{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ynab.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:43:48.000Z",
          "Titre": "I really don’t like your format",
          "Contenu": "I really don’t like your format. But I haven’t found any other app that I like either."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brendan",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T15:10:22.000Z",
          "Titre": "Many direct import connections do not…",
          "Contenu": "Many direct import connections do not work, or work intermittently. The YNAB solution is to remove and re-add the connection, which is a complex set of steps. If you want to keep your budget current everyday, this becomes a cumbersome process. Mutliple contacts with customer support results in a cheerful but vague response that they are working the issue. If you check YNAB's status report on its direct import connection status, it details so many issues that it is a 19 minute read.Without a reliable direct import, the app is more time consuming than it is worth. YNAB may work for some but it also does not work for many."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T17:29:22.000Z",
          "Titre": "Bad UI/UX, Poor connections to banks",
          "Contenu": "Poor connectivity to some banks, like Amex. Expensive for what it does. Bad UI/UX that has not been updated in years. Transaction matching is awful. Bad auto-categorization. There are many better alternatives on market now, it seems YNAB has been coasting on their early success and driving the price point higher every year without delivering materially more value."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T17:18:37.000Z",
          "Titre": "YNAB has a massive amount of missing…",
          "Contenu": "YNAB has a massive amount of missing features and has been stagnant as a platform for way too long. I really like this platform but for the price it’s pretty unacceptable that it hasn’t seen platform growth in years. It has so much potential but feels like you built something 10 years ago and are coasting off it. If it doesn’t see improvement in many areas soon I’m done. For instance other budgeting software can login to Amazon to auto catalog purchases. Please look at other software on the market and wake up.Edit: In response to the response of this review look no further than /release-notes and just how many of these bullet points aren't user facing features and are things like \"Another round of backend updates\" \"no visual changes\" on loop. I get that the person in charge of writing these release notes has to be fun and cute with what is ultimately nothing new, it's hard to read all of these and try and claim like there has been any real progress in this app and this response isn't convincing me that's going to change anytime soon. I'll start looking elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T20:17:30.000Z",
          "Titre": "New owners tanked it",
          "Contenu": "Bank accounts constantly came unsynchronized, app became clunky, price more than doubled, but the customer service is still great. At least until the money grubbing new owners fire all of them for offshore customer service. Either way, I'm not sticking around to find out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christina Vilgiate",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T17:40:29.000Z",
          "Titre": "YNAB has changed",
          "Contenu": "Unfortunately we have had some issues that have not occurred in past years. All year our YNAB account has not been importing transactions via Plaid from our bank account. I have to enter everything in manually by logging into my bank account and inputting transactions that have not already been logged in YNAB. Honestly I could do that without a service charging me for really nothing except a template. I’ve been very disappointed. In the past years YNAB has been so helpful. Their customer service is great. I know the problem will be solved so I will continue to use YNAB as I have for the past 7 years."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kp",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T21:15:00.000Z",
          "Titre": "The desktop works totally differently…",
          "Contenu": "The desktop works totally differently from mobile. Missing critical features like running average daily balance, progress to goals beyond categories, missing monthly analysis of budget to actual spend, leftover total balance, etc. desktop add works like mobile move. Mobile add overwrites existing amount. Documentation is redundant on some features but nonexistent on others and not written for complete newbies. Documentation suffers from curse of knowledge. Bank connections consistently break."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Davidj",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T16:29:06.000Z",
          "Titre": "They were review fishing",
          "Contenu": "They were review fishing. Sent me an email asking for a review. This seriously affects how I view a product.Also, I miss when YNAB was a one time purchase, I dislike SAAS"
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "Wilhelm",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T07:51:33.000Z",
          "Titre": "YNAB is good but this app is stagnant…",
          "Contenu": "YNAB is good but this app is stagnant and no new features are being added. You can not even do basic reporting via the android app and it is missing a basic feature like a running balance on the account view."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darin",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T05:49:55.000Z",
          "Titre": "YNAB software should allow me to import…",
          "Contenu": "YNAB software should allow me to import old data like from the last 2 years do I can analyze my past spending to help me prepare for my new budget."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ziggy Ladak",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T06:33:19.000Z",
          "Titre": "Amex UK",
          "Contenu": "Amex UK - Unable to link account after updating connectioni paid for subscription to YNAB even though it is one of the most expensive budgeting software around but it allowed me to do what i needed including automatic credit Card imports. For one month now there has been an error in importing transactions from Amex  and i am now wondering whether it is actually worth the value i paid for One year. The whole point of me subscribing to YNAB was because importantly that i could import alot of my transactions saving me time to manually input transactions.I am bitterly dissapointed with the service i am getting which is definately not the service i paid a premium to YNAB for. i rely alot on YNAB and i am left dissapointed."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T23:32:47.000Z",
          "Titre": "Price…",
          "Contenu": "It was way too expensive for the benefits received,  price skyrocketed but being outside the direct import zone meant it was no longer worth it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T19:46:54.000Z",
          "Titre": "My Fidelity accounts will not sync"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T01:36:16.000Z",
          "Titre": "Accounts don't update",
          "Contenu": "I love the idea of ynab, but my account transactions haven't updated in months, making my subscription useless. I've tried unlinking and relinking accounts, which has sometimes worked very briefly, and then they stop updating again."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jane Doe",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T21:27:39.000Z",
          "Titre": "Can’t afford the new price all at once",
          "Contenu": "Can’t afford the new price all at once. Cancelled because I don’t have the money. Wish i could still pay monthly"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T02:29:05.000Z",
          "Titre": "Hard to use",
          "Contenu": "Not easy to use and doesn't always pull transactions through....not a good system"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T11:51:58.000Z",
          "Titre": "Too complicated",
          "Contenu": "I could never figure out how to use their budgets"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T17:15:04.000Z",
          "Titre": "No response or follow-up"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David R",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T02:05:22.000Z",
          "Titre": "Too complicated",
          "Contenu": "Too complicated. Too much effort."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JO",
          "Nb_Reviews": 2,
          "Date": "2022-11-22T22:59:50.000Z",
          "Titre": "Dificult to understand ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T22:42:18.000Z",
          "Titre": "Over priced ass app"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ash",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T18:03:50.000Z",
          "Titre": "Learning curve is too steep",
          "Contenu": "Learning curve is too steep. Make it more Intuitive"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "HanM",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T20:47:34.000Z",
          "Titre": "Too expensive"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T03:43:59.000Z",
          "Titre": "too expensive"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Milliesmom",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T12:36:25.000Z",
          "Titre": "I've been with YNAB for several years",
          "Contenu": "I've been with YNAB for several years.  The budgeting concepts are good; and, I do recommend that you buy the book and implement the four rules in your budgeting process.The company is not to be trusted.  The software has been buggy from the beginning.  Appeals to fix the linking issues have gone on for years, with half-hearted fixes and a vendor change to Plaid.  The vendor change wasn't adequately tested at the time, and charges were not being imported correctly (Plaid had a little trouble with debits being credits for a while there).  YNAB didn't even know it was going on when its users first started complaining about it.  Testing before implementation feels good, man. The recent treatment of YNAB customers over the price hike really was just the icing on a very old cake.  The entire debacle has been very telling in terms of how the company views its users.  The contempt of their customers was overt in answers to questions posed in an online forum.  They have never listened to their users' concerns in any of the fires they've had to put out over the years.  And they really don't have any intention to start.  YNAB does not value its customers.  It has continuously been the buggiest budget software out there, with no concern about fixing its own issues.Steer clear."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrik Hellstrand",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T20:30:08.000Z",
          "Titre": "Doesn't sync to Amex."
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T05:10:16.000Z",
          "Titre": "I feel like their recent patches are…",
          "Contenu": "I feel like their recent patches are not really needed if we can have a vote on the features would be nice. Moreover, bank import is not supported for me but still paying full amount (not using USD as default currency) so I'm not really maximizing my payment. A lesser payment for lesser features would be nice"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Deeble",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T02:18:52.000Z",
          "Titre": "worst customer service response time…",
          "Contenu": "worst customer service response time ever!  Its been over two days now that I am awaiting a response from their chat help to relink my bank accounts.  Seriously ynab you don't have the dough to hire a few more customer service reps?????"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allan",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T14:05:07.000Z",
          "Titre": "Lack of reporting especially on mobile…",
          "Contenu": "Lack of reporting especially on mobile is a huge downside. My partner and I are joining finances and not being able to quickly review trends in spending has made us start considering other budgeting apps as our year renewal comes up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Grimes",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T15:41:59.000Z",
          "Titre": "YNAB no longer works with my bank",
          "Contenu": "YNAB no longer works with my bank.  I don’t really care who is at fault, I just need things to work.  Otherwise YNAB has been great, but I am close to dropping if my bank connection doesn’t get restored."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T15:57:02.000Z",
          "Titre": "Don't know how to use it.",
          "Contenu": "It's a complicated software, I fumble around trying to figure out how to use it, your help support doesn't offer much in the way of help, and you don't have training.YNAB keeps warning me and this, that, and the other and I don't understand what it's talking about.  I just want a simple app that conducts an envelope budgeting system without all the bells and whistles."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Liv",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T17:23:51.000Z",
          "Titre": "The platform is fine in theory",
          "Contenu": "The platform is fine in theory - You're supposed to be able to manage your budgets and get updated statements, however, delays are often quite long (more than 3 days regularly and up to weeks sometimes), the imports don't always come in and you're never able to balance your budget accordingly (too much budget rolled over since imports are delayed or never show up. Though they have customer service, it's nowhere near as advanced as a regular SaaS company should be. I would expect 1-1 customer service (within set hours), who can walk me through issues instead of just pushing out their FAQs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amelia",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T00:35:20.000Z",
          "Titre": "Requests for Captioned Podcasts Remained \"Unimportant\"",
          "Contenu": "I've left this review multiple times to different YNAB staffs and it seems to continue being ignored. SUBTITLES and TRANSCRIBE every single videos and podcasts, not only the ones that your team deems as the most important. When I say everything, I literally mean *everything* Deaf people have money to handle, too. I don't understand why it's assumed that we don't need budgets like hearing people do."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sunfun",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T14:04:38.000Z",
          "Titre": "I wish there was more opportunity to…",
          "Contenu": "I wish there was more opportunity to learn about your finances specifically and how to apply them to YNAB. I can see how it can be a good program but I get lost in the mess of it all and there’s not many options for classes with YNAB these days"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KH",
          "Nb_Reviews": 2,
          "Date": "2022-12-08T18:10:09.000Z",
          "Titre": "They moved from a license model to SaaS…",
          "Contenu": "They moved from a license model to SaaS pricing, so you're paying a lot more than you were for YNAB4. They charge a ton of money and don't make many improvements or changes, and when they do try to do something, it's often a poor design choice. They then proceed to ignore customer feedback.The app itself is useful for budgeting, and I'm committed because I've already used it for years, but at this point if you're starting fresh I would look elsewhere for a company that actually values its customers."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Pier-Olivier",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T15:25:03.000Z",
          "Titre": "Price of the sub",
          "Contenu": "Im with ynab for 2 years now. It helped me alot. The thing is your price go up and up and up. I have nothing to say about the app, but it is ridiculous that you need to cut essential things to put ynab in your budget. It's like you guys lost the real purpose of the app. That's really sad."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T21:34:55.000Z",
          "Titre": "I wish there was a more affordable…",
          "Contenu": "I wish there was a more affordable option. I would like one where there I just use the software without import, goals, or anything added in the last 5 years. I just want something to effectively use the envelope system plus look back at trends/past purchases."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim Walke",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T06:14:11.000Z",
          "Titre": "Worked great until it stopped importing…",
          "Contenu": "Worked great until it stopped importing transactions from Amex for months.  As Amex is my main account for day to day purchases, adding everything by hand got real old, real quick.  Multiple support requests returned the same \"working on it\" response, so I gave up.  Once that problem cropped up, the product was no longer useful at all and YNAB seemed unable to fix it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T18:41:34.000Z",
          "Titre": "YNAB4 was so good. nYNAB, not so much.",
          "Contenu": "1) The step from YNAB4 to nYNAB was a backwards step. I understand they needed to change their pricing model, but they did NOT need to change their platform to accomplish that.2) Early adopters such as myself were given a \"forever\" 45% off loyalty discount that they rescinded without notice and without apology.3) The new YNAB has completely deflated me and my personal finance rythym. I'm months behind and have no ambition to actually do much budget routine anymore. Just takes too much time (old YNAB was different).The company culture has changed. I wish there was a better option available for budgeting."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T11:20:50.000Z",
          "Titre": "Best budget app. Paycheck to paycheck peasants need not apply",
          "Contenu": "Helps me keep on track with my budget. Literally the best app out there even though it constantly yells at me that I'm poor piece of crap for not having all the money for the month on the 1rstThe absolute lack of anything bi-weekly is baffling though. It's super duper duper condescending to anyone living paycheck to paycheck and don't you DARE have any bi-weekly bills. The solution is to split it in half and do it weekly. You can do custom recurs every x bills but only for months or years. It's such a weird ass stance they took. Instead they have videos and tutorials on how to work around their app if you don't already have all the money you need for the month on the 1rst"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MER",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T15:04:54.000Z",
          "Titre": "Used to be good, now not so much",
          "Contenu": "It used to be super helpful when I started. Lately is too buggy and slow to bring in transactions, I am considering not renewing after this year is over."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T19:32:30.000Z",
          "Titre": "Great tool, but bad direction and lack of improvements",
          "Contenu": "Great tool, except company is out of touch with what users actually want improved within the app. For years users have requested improved reporting capabilities (arguably the most important item to visually understanding spending habits) and customization options within the mobile app and website... yet every 6 months they seem to release a niche use case 'improvement' (categories?). I love YNAB, but for $100 a year, lack of reporting and inability for auto import to function properly, I'll be moving over to another envelope based budgeting system. It's worth noting, the community introduced a Toolkit that provides a lot of capabilites YNAB should have... the code is available and yet it's not integrated.."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Bertrand",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T15:50:13.000Z",
          "Titre": "Good budgeting app but really too expensive",
          "Contenu": "It helps me to track my spending and stick to my budget. But it is definitely too expensive ($15/month for new clients !) And we still waiting for multi-currency support: Hi YNAB team, we are in 2023 ! People travel, you still don’t know?"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Wannabe",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T03:30:45.000Z",
          "Titre": "I want to love YNAB",
          "Contenu": "I want to love YNAB, I really do. I have really tried to use it a few times over the years. What I find most frustrating is the linking and auto downloading of transactions from my financial institutions. It has been a near constant headache of syncing accounts. I should try again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JW",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T03:05:31.000Z",
          "Titre": "YNAB has had a big positive impact in…",
          "Contenu": "YNAB has had a big positive impact in my life, and I've used it for about a decade, but it's no longer the darling it used to be. Big price hike but no noticable change in the product. I used to recommend YNAB to friends and family left and right, but I no longer do that due to the price. The price hike was particularly awful, given YNAB backtracked on their promise to keep YNAB grandfathered into the original price. Felt like a big slap in the face and a betrayal of trust. Regarding the product itself... wish I could attach receipts to transactions, make a budget template for general planning purposes, have better data visualizations for understanding my financial state, have better investment tracking. Syncing has never worked very well, and I feel like my relationship with YNAB is glorified data entry instead of letting me spend my time understanding and exploring and planning around my financial state."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Matthew Bi",
          "Nb_Reviews": 6,
          "Date": "2023-02-13T13:11:05.000Z",
          "Titre": "CANCEL After many months of subscription",
          "Contenu": "After many months of subscription, I have decided to cancel it. *EDIT next sentence: THERE IS NO EASY WAY TO REMOVE YOUR SUBSCRIPTION, this is simply F** annoying and even a reason not to Subscribe.The mechanics for adding transactions are extremely cumbersome. If I scroll through my budget, it should be possible to click and add a transaction or simply mark it as \"paid\". Let me give you an example: monthly internet cost. I have to click on transactions, remember the correct amount to pay, for example 24.95€, I have to enter it, add the payee, add the category, add the transaction. Every category should be clickable and show options to change the budget, mark as paid, add transaction. Despite being extremely user-friendly, adding all expenses is very stressful for me. The budget should be modified monthly and only show the current expenses screen. I always use English for everything else, but this app, one of the few, I would have liked to have in Italian which seems to not be available. I breathe a sigh of relief to eliminate it. Before, I used a simple excel and added rows every day in a simple way. One column for the budget, one column for what was spent. Now I will try Spendee or Mint.😖"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Avg Joe",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T07:19:41.000Z",
          "Titre": "Managing YNAB is a full time job",
          "Contenu": "Managing YNAB is a full time job. I wish the program could be changed to common budgeting types. Not just a zero budget. The software is a tool for me to manage my money. I want it to let me manage my money  the way that I want to manage my money. It makes me categories that I do not intend on fully budgeting for the month."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T14:20:38.000Z",
          "Titre": "It is okay but could be better",
          "Contenu": "I really loved the YNAB4.  It was awesome!!  I hate the new one.  I don't want my info on the online. I hate subscriptions too!! I also don't like that my cc purchases just disappear out of my categories for the next month and I have to look at my cc totals and don't know what category needs funding."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "tuko",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T21:11:50.000Z",
          "Titre": "As European",
          "Contenu": "As European, I don't benefit from a lot of the development effort put into the product. The main feature lacking, obviously, being the bank account synchronisation. It's still a decent product, sure, but I don't get 100% of it, while paying the full price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erin",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T02:10:27.000Z",
          "Titre": "My bank doesn't support Plaid so I'm no…",
          "Contenu": "My bank doesn't support Plaid so I'm no longer able to use YNAB. I really am not interested in doing everything by hand."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pjo",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T00:44:52.000Z",
          "Titre": "Great ... When it works.",
          "Contenu": "YNAB was great for what I wanted, when it worked. I first subscribed in 2018, and I used it successfully for a while to set up budget categories, it helped me keep track of my recurring expenses and remember to cancel services I no longer needed. However, every few months, something with the importing would break. Sometimes some of my accounts just wouldn't import, and most recently I had an issue where all of my credit card charges would shows as duplicated positive inputs to my bank account. I'd get in to a cycle where I'd get everything set up, use it consistently for a bit, something new would break, and I'd get out of the habit of using it again while I was trying to figure out how to fix what was broken. I ultimately canceled my subscription this year in 2022 because the import issues were too much hassle for the budgeting I wanted to do. I still miss the service sometimes, but I didn't want to keep paying for something that I wasn't going to get much use out of because it kept breaking."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Fraem92",
          "Nb_Reviews": 7,
          "Date": "2022-11-11T16:52:44.000Z",
          "Titre": "Been charged twice!?",
          "Contenu": "Absolutely love the app but the service it so bad! Can not get hold of them and they have charged me twice when I subscribed:(no chats available not replied to my message sent..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve Collins",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T13:24:52.000Z",
          "Titre": "For the first time ever",
          "Contenu": "For the first time ever, I have been able to save money and cover future expense at the same time. The Four Rules rule!!"
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Morad",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T20:02:56.000Z",
          "Titre": "to have such an expensive product does…",
          "Contenu": "to have such an expensive product does not really ring well with selling ways to save money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pete",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T00:32:19.000Z",
          "Titre": "Program is difficult to use",
          "Contenu": "Program is difficult to use Never seems to stay connected to the bank Cost of program is to much. Will not be renewing for another term"
        },
        {
          "Note": 2,
          "Lieu": "BR",
          "Pseudo": "MARCIO",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T10:56:52.000Z",
          "Titre": "your price is too expensive!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:17:29.000Z",
          "Titre": "Great Product, Needs Improved Refresh Rates",
          "Contenu": "There’s a lot to love about YNAB! Intuitive, easy to pick up, and based on solid budget fundamentals. Only reason I didn’t give 5 stars is that their refresh rates from banking institutions is limited to once per day which can limit views into spending especially over the weekend. 5 stars for sure if they can move the needle on that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RDB",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:51:27.000Z",
          "Titre": "Love Everything Except...",
          "Contenu": "I like everything about YNAB except the time it takes for it to sync with my bank and CC accounts. It's hard to track transactions real-time when the sync often takes 3-4 days to catch up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T02:55:14.000Z",
          "Titre": "I am still struggling and get repeated…",
          "Contenu": "I am still struggling and get repeated \"you have assigned more than you have\" alerts for reasons that are not obvious. I'm a loooong time user of Mvelopes and assignments methodology of YNAB is still mysterious to me."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "CM",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T03:41:35.000Z",
          "Titre": "Great app that could be awesome with some changes",
          "Contenu": "The categorization aspects are great, but linked accounts are fairly unreliable.  Using for one year I've had to switch from plaid to mx back to plaid because accounts failed to sync or transactions were importing incorrectly.  There are useful reports but I would love to see some additional data visualizations built out, more things like ynabexplorer.com instead of relying on 3rd party devs, so more users would see the benefits."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Dominique",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T00:04:53.000Z",
          "Titre": "Bittersweet",
          "Contenu": "I feel bittersweet about YNAB. I find it expensive, especially that the bank account syncs are rarely working properly. I’m with four different banks and they all have issues loading my transactions so it’s not a problem caused by the bank. That being said, I like the concept of allocating money and how the interface is designed. It’s helped me a lot with managing my money, but especially for Canadians, it’s pricey, even if it was reliable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "abergsneider",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T22:09:16.000Z",
          "Titre": "Love but!",
          "Contenu": "Love but!Recently it seems like transactions are a bit more out of sync. I have also noticed is hard to track overspending on my credit card from past months. While I have reached out to support, it still seems like is not clear where the money goes and how to keep myself accountable for it."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Shawna",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T14:59:52.000Z",
          "Titre": "Only 1 issue with YNAB….",
          "Contenu": "I have loved YNAB since day 1, but it’s getting harder to justify the annual cost, which has gone up. I would hate to do it, but every time renewal comes up, I consider using another platform or creating my own budget so I’m not paying so much to save $$$ 🫤"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T13:05:45.000Z",
          "Titre": "It has been great",
          "Contenu": "It has been great, except for an issue where my credit card hasn’t been able to link for over a month. YNAB is aware and working on it but it is essentially useless to me until that issue is resolved. Apart from connection issues, I love this app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T16:17:03.000Z",
          "Titre": "YNAB is very helpful with this inflationary economy",
          "Contenu": "When I first got YNAB I had all my credit cards and my credit union accounts connected with YNAB. When I purchased something I would enter into YNAB and then my accounts would verify and sometimes it would catch mistakes that I made. Now my credit cards still operate the same, but my credit union does not. The YNAB customer support team looked into it and tried a few things but it’s still the same. I would like to have this back to working like it did, but this tool is very helpful for me to not overspend which is very much needed in this economy today!"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Fabio",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T18:48:52.000Z",
          "Titre": "It is a good budgeting tool if you are willing to compromise a bit",
          "Contenu": "It is a good budgeting tool and a good application that forces you to think what to do with every dollar you have.It is missing a couple of things:1. Ability to budget in fortnightly periods. Currently the work around is either to calculate de equivalent in monthly amount or to budget weekly for it. Not ideal if your pay check is also received fortnightly.2. Automatic bank feeds for banks for other regions other than the US or Canada. I am located in NZ and the option is not available here. I am fine with not having these but then I think the price should reflect this and be less."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Privacy Issue",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T18:29:03.000Z",
          "Titre": "I need more basic onboarding instructions",
          "Contenu": "I need simpler, more basic onboarding directions. I understand the concept and have read the book. But the way the software works and knowing what I Sam supposed to do sometimes eludes me. Add to that trying to find time to decipher it. The instructions I found were only for more complicated circumstances. I’m not there yet. But I want this to work for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dev",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T00:05:22.000Z",
          "Titre": "I tried for a while to like this…",
          "Contenu": "I tried for a while to like this product but ultimately ended up canceling. I think the concept makes sense and it's a challenging thing to make intuitive. I would have been okay jumping through the hoops but ultimately found that some of the integrations to my CCs were unreliable and therefore the value dropped for me because it's only really valuable if it takes up a minuscule amount of time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike T.",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T21:42:45.000Z",
          "Titre": "I like YNAB and have been using it for…",
          "Contenu": "I like YNAB and have been using it for over 7 years and love that it helps me keep things on track for the most part. What is hard , is managing Amazon orders that involve multiple categories as well trips to Target for the same reason. Lastly the sync feature w my bank has a terrible lag. My credit card is fine, but bank sync is not good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Krysten H",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T22:18:02.000Z",
          "Titre": "Issues with bank connection",
          "Contenu": "We nearly always have issues with Bellco not being able to input. And when it does work, it only catches some of the transactions. We have contacted people at YNAB about this multiple times, but this makes our experience not great We have to still manually input alot of transactions and cannot trust the software to input them all. This makes it very tiresome, but we don't want to switch to another software again because it's such a process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim Hosken",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T04:48:38.000Z",
          "Titre": "When it works it works, bank sync issues",
          "Contenu": "When it works, it works well. We have had issue after issue with syncing items consistently with our bank and credit cards. I will  not renew, as every time it breaks the status is “we are aware of this and don’t have an ETA for it to be resolved.” If this was Mint’s free plan that might be acceptable, but as a premium service this can’t be overlooked."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Rosi",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T10:18:54.000Z",
          "Titre": "Not as efficient as the German alternative",
          "Contenu": "Since after many years there is still no full support for most German banks, and editing CSVs (even using a script) is a lot of effort, I have changed to the German alternative Outbank - it is not as strong as YNAB, but it supports all (!) my bankds an thus makes it much easier to keep track of what is going on. I would love to go back to YNAB, but I need out of the box support for these banks including Depots:N26, comdirect, smartbroker (DAB), Wüstenrot, Blockchain"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T20:21:48.000Z",
          "Titre": "Price hiked, product is the same",
          "Contenu": "This year was my first year paying the new higher subscription price. While YNAB is a valuable tool for me, it's disappointing that as a years-long loyal user I was suddenly having to pay more than double what I was paying previously. They chose to capitalize on their oldest and loyalist base of users instead of working to acquire new ones at the rates that they wanted. The UI is clunky and (frankly) ugly. I still use it, but as soon as a better alternative comes along I'll be there."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Robbie Bannister",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T12:07:56.000Z",
          "Titre": "Needs more payment schedule options",
          "Contenu": "I mostly love YNAB, it's helped me balance our finances and get back on track and I'd be lost without it. But, I really wish they had the option for bi weekly payments, as this is a common payment option for mortgages and car payments, and I've had to make up my own ways to make this work"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T12:14:55.000Z",
          "Titre": "Long Time YNABer",
          "Contenu": "Long Time YNABerFor years, I used the old version of YNAB.  Last year, I finally switched to the annual subscription.  I have been very disappointed with the linking of accounts to my banks.  They disconnect on a regular basis, and I have to go through all the motions of reconnecting.  It is frustrating and a waste of time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AGP",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T02:57:29.000Z",
          "Titre": "I've been using YNAB for over 4 years",
          "Contenu": "I've been using YNAB for over 4 years. I started off by trying to learn as much as possible but at some point it became, let's say, not intuitive to use. I continue to use it in a very basic way but am trying to decide whether to dedicate more time to learning or try another software product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "rml",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T20:27:49.000Z",
          "Titre": "No longer worth the cost",
          "Contenu": "No longer worth the costThe automatic transaction input challenges became too frequent and impactful to my budgeting cadence to maintain progress. The concurrent increase in price for a product with no meaningful new features and decreasing reliability will drive me to find alternatives."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Feizal Marrero",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T00:02:57.000Z",
          "Titre": "Love everything except…",
          "Contenu": "I love everything about this app except the reports tab from within the app. I’m always mobile and would like to see a detailed report of my earnings and expenses right from the app like I used to do on Invoice2go.  I can only see Age of money and Networth on my App.  If I have any other question then I need a computer to find out the info I’m looking for.  I fix cars and didint need a computer for this before, but after wetting Ynab I have to use a computer to see the reports. It’s the only thing that really is bothering me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diode",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T02:36:27.000Z",
          "Titre": "Expensive budgeting",
          "Contenu": "Expensive budgeting. That's what YNAB is. Don't get me wrong, it's mostly a solid product. Excellent auto-imports via Plaid, clean UI, and easy to use - what more do you want? Well, I want it to be cheaper. $100 a year is too much to just budget efficiently. Also, customer service will ignore all feature requests. They should use a public ticketing or forum system to track feature requests."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Sheila",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T02:31:35.000Z",
          "Titre": "Amazing support team, issues importing",
          "Contenu": "Your support team is A+, five stars, amazing people.  I've always had great experiences when I've had to reach out.  I'm finding as time goes on my import ability is continually broken, and now it is such a hassle to import my transactions I'm logging in maybe 2-4 times a month to do so - which defeats the purpose.  Especially given the cost hikes.  I wish I could rewind to the YNAB experience I had two years ago, and have it stay like that permanently!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mimi",
          "Nb_Reviews": 2,
          "Date": "2022-12-31T15:43:54.000Z",
          "Titre": "Wish this worked for me, but it doesn't.",
          "Contenu": "Very expensive and too complex. I'm on my second year of using it and still haven't figured it all out. Doesn't link to/ update from most Canadian bank accounts. Overall it's pretty frustrating- if you haven't \"got\" it after the free trial I recommend using something else."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J Cook",
          "Nb_Reviews": 3,
          "Date": "2023-01-03T20:49:11.000Z",
          "Titre": "I liked YNAB a lot more a few years ago…",
          "Contenu": "I liked YNAB a lot more a few years ago but as their bank linking gets buggier and they move towards mandating manual transaction entry I moved on to another system. Still suggest the book to others, but the software got worse over time instead of better in my opinion."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Barry",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T20:51:51.000Z",
          "Titre": "The automatic import is buggy at best",
          "Contenu": "The automatic import is buggy at best. Constantly having to renew connection only to have it happen again next day.You are expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff B.",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T03:17:14.000Z",
          "Titre": "The old YNAB was absolutely perfect and…",
          "Contenu": "The old YNAB was absolutely perfect and fit my family's needs. It turned us around financially and allowed us the control we were looking for. The new YNAB is not as easy to use, has issues at times connecting that cause us to play catch-up, and doesn't allow us to put our transactions in manually like we used to. I'm supremely bummed that old YNAB isn't available because it was a perfect product as-is (as-was?). We still use it but we're looking for something that works like the old YNAB used to with manual entry and control."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Bailey",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T17:56:23.000Z",
          "Titre": "Using the app was going well until…",
          "Contenu": "Using the app was going well until automatic upload of my transactions were not able to be done. It has to be done manually or with a bank import until the issue is resolved. This has lead to some inconsistencies in my budget that I did not previously have. I’m looking forward to the automatic upload being available soon, as without it the app loses some of the appeal for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T05:00:13.000Z",
          "Titre": "I like Ynab a lot",
          "Contenu": "I like Ynab a lot. I actually have a friend who has been helping me to really get it and I am really grateful for her. I think Ynab could use her teaching. She rocks for people like me who are not spring chickens and have been baffled by spreadsheets and all"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristen",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T14:21:03.000Z",
          "Titre": "I wish I could give a 5-star review…",
          "Contenu": "I wish I could give a 5-star review because for the most part it’s been amazing. However, with the whole Plaid and Amex not syncing that has been going on ever since I joined, it’s just been a little frustrating. Other than that, it’s the best budgeting software out there!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Audrey F",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T13:30:37.000Z",
          "Titre": "Great premise, ongoing import issues",
          "Contenu": "I love the premise of YNAB, the philosophy, the ability to parse out my current money into sinking funds. However, over the past 6 months I’ve had ongoing issues with my bank transactions not importing, importing as cleared when they had not cleared, or importing as not cleared when they had cleared. If his has resulted in me spending literal hours to reconcile my accounts. I’ve had ongoing contact with YNAB help and although they have always been friendly, this issue doesn’t seem to spark any sense of urgency and they remind me that I can just not use direct import and log everything manually. I know that’s an option, but the direct import is a key reason I use YNAB."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CC",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T18:34:31.000Z",
          "Titre": "Just started using ynab at the…",
          "Contenu": "Just started using ynab at the beginning of the year. I have Fidelity which seemed to be out of commission at the time so it was difficult for me to learn the platform correctly I think. Overall i think it is aligning my finances well and lets me have a better view into what is going on. I was doing nothing previous to using ynab. So we will see how I like it as the months go on and if it makes a difference with my spending and saving.There is room to improve the use of venmo transactions and make it smarter and more seamless."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Willem",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T13:05:17.000Z",
          "Titre": "Difficult for ADHD people",
          "Contenu": "It's super nice, but as a person with ADHD it's impossible to keep at it and catch up again. I know I can reconcile accounts, but for one reason or another I always wanted to put everything in and that was too tedious. I need methods I can stop and start without too much hassle."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hobbygirl Dolls",
          "Nb_Reviews": 8,
          "Date": "2022-12-21T16:23:29.000Z",
          "Titre": "Confusing",
          "Contenu": "I have been trying to figure it out and it is very confusing. I have been using excel and can't figure out how to translate what I have in excel to YNAB. I renewed, but this is the last year for YNAB if I am unable to get it going."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Holly",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T18:31:51.000Z",
          "Titre": "I like YNAB but have had problems mostly with reconciling and using the more in depth part of the program",
          "Contenu": "I like YNAB but have had problems fully using it.  I liked it when customer service could respond to my questions in real time before I forgot what my problem is.  I'm getting more comfortable now so will give YNAB one more try"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ssh",
          "Nb_Reviews": 2,
          "Date": "2023-03-19T19:41:59.000Z",
          "Titre": "The old program was better",
          "Contenu": "The old program was better. The whole SAAS model just sucks and is so heartlessly greedy, it makes me sad. One of the only good things about the new app is that it syncs with your bank, but it's also behind, it cannot even connect to one of my credit unions, and I have to reauthorize it much too often."
        },
        {
          "Note": 3,
          "Lieu": "HU",
          "Pseudo": "Dmitry Filonenko",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T16:18:30.000Z",
          "Titre": "I have been using YNAB for over 6-7…",
          "Contenu": "I have been using YNAB for over 6-7 years, and it is the best money-budgeting app. But unfortunately, YNAB needs to meet the requirements of the modern world. Two of them are multi-currency and crypto assets."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Budgeter",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T17:52:31.000Z",
          "Titre": "Great budget app with some room for improvement",
          "Contenu": "I have loved using YNAB because it budgets the way that I budget. I was so happy to find an app that rolled over the left over budget money in each category. It is how I have budgeted for 30 years and now that YNAB has come alone what use to take hours to budget each week now takes minutes. Yes, I talk highly of the app so now you are wondering why I only give it 3 stars. YNAB gets 3 stars because it struggles with importing transactions from your bank at time. YNAB has always fixed the connection but sometimes it takes a month or two. It gets frustrating having to go manually import your transactions for so long.It also does not have a way to look up past transactions in a report or be able to summarize and analyze your collected data. It would be nice to be able to run some reports and do a transaction search."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Marco",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T06:57:42.000Z",
          "Titre": "Very simple tool at an exorbitant price",
          "Contenu": "The idea of budgeting is good and works well. I gave up on it after several years using it, when they started doubling the prices, like today. There is no reasonable relation between the service offered and the monthly cost of 9-15 dollars. It is just a simple website and everything has to be done by yourself."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Johnny",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T17:16:22.000Z",
          "Titre": "Nice service, if you live in the right places.",
          "Contenu": "Considering the exchange rate for USD/BRL, YNAB sadly became too expensive in the past few years for Brazilian users, considering they only focus outside of here. Despite Brazil being at the edge frontier in terms of banking technologies (to the point where other countries come to learn from us), and the widespread adoption of OpenBanking technologies and APIs, to use YNAB in Brazil is to be manual.Other than that, if you live in places where YNAB invested in the automations and interfaces needed, it must be really amazing.And despite all that, their philosophy is amazing and can be applied anywhere, but requires discipline. Their videos are amazing lessons for life, doesn't matter if you use their app or not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T01:04:19.000Z",
          "Titre": "AMEX connector broken",
          "Contenu": "AMEX connector is almost always broken, so you have to reconnect it constantly and the transactions are delayed. Still a good personal accounting software, if you’re willing to put in a ton of hours to learn it."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T03:56:18.000Z",
          "Titre": "Does not give users the option to…",
          "Contenu": "Does not give users the option to deficit rollover across months. This is different from the original YNAB, and makes it extremely difficult for users whose credit card statement dates do not follow the calendar month, or who practises debit in the first month and subsequent credit/reimbursement in the next month. In general, app is not flexible enough to cater for different user behaviour, and simply assumes that people who rollover deficits are simply outspending their budgets, which is not true in all cases, as my examples above illustrate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Harry W",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T14:18:59.000Z",
          "Titre": "Credit cards are just too hard to…",
          "Contenu": "Credit cards are just too hard to figure out. There has to be a way to make that more intuitive.On my mobile device when I open my budget it populates the current   month. On my desktop it populates a much older month, I have to input current month."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronni",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T18:46:30.000Z",
          "Titre": "When you go from unique to run of the mill",
          "Contenu": "When I first started with YNAB I could hit the QUESTION MARK button and there was an option to speak directly with someone. Now it's just some useless robo pig mascot. It's not helpful, and I don't even bother. It's not an improvement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zack",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T16:34:07.000Z",
          "Titre": "A big step down from YNAB classic",
          "Contenu": "I first started with YNAB classic many years ago and it did wonders for my bank account. It helped me move to a point where I was living on last month's income and I couldn't not have been happier. That version didn't require a subscription, just a few Dropbox account. Eventually the app stopped syncing with Dropbox and I was forced to \"upgrade.\" This new version doesn't have a few of the features that helped me the most. I can't set up my budget for next month. I have to allocate my funds in the same month so I can't just lay out next month's budget to get a sense of how much I'm going to need. All in all, I'm disappointed with the new version of YNAB. What used to be a one time payment around $20 is now a yearly fee around $100 and the experience has actually degraded for the cost. It's still a useful utility but, is a shadow of what it used to be. I would get rid of it to save money but, I haven't found anything better yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom L",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T03:51:35.000Z",
          "Titre": "Too Clever by Half",
          "Contenu": "This app started out many years ago with a clear and simple user experience.  But now it’s got so many bells & whistles that I’ve stopped using it.  It’s gotten ‘too clever by half’ for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Colleen",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T04:34:50.000Z",
          "Titre": "CC function could be better",
          "Contenu": "I like ynab alot however, if I get messed up with the credit card function, I give up. What messed me up was attaching credit card and bank accounts. When I decided to reverse it, it was near impossible to figure out so i gave up and stopped. But I'd love to use it again. This function is just not very user friendly for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Preston",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T17:12:21.000Z",
          "Titre": "Love it, suggestions to make it better",
          "Contenu": "I wish I could see the same level of reports on the app as i do on the desktop. in particular my spending in individual or combined categories. Overall love the app. The other issue i find, although i have no solution, is that if i order something on my credit card and do not pay it off in time before the end of the month, the debt carries on my credit card account but does not show up in the next month as a debt that needs to be paid in the category the expense was tied to. For example, I spend $100 in gas on 4/29/23 and it will not show up on YNAB till roughly 5/2/23, which makes sense. But now the debt has been incurred in April with no way for me to know other than me tracking my credit card debt like a hawk. One workaround i found was to change the expense date to sometime in May to bring that credit card expense into the current month so i can tackle it. I guess making us aware that our debt didnt go away bc we're in a new month with a notification would be cool or perhaps keep that debt on the category and carry it over in the category, much like is done with the credit card account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DCN",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T07:38:07.000Z",
          "Titre": "It’s OK",
          "Contenu": "I find managing a credit card reconciliation at times confusing. Also, I wish their support people were available more hours of the day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mel",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T20:12:22.000Z",
          "Titre": "Trying to keep up",
          "Contenu": "The program is really robust, and I appreciate that... But sometimes it is really confusing to follow what to do and how to do it correctly. Even after watching the tutorials..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 9,
          "Date": "2023-01-19T09:44:45.000Z",
          "Titre": "I used the suggested solution, but .....",
          "Contenu": "I used the suggested solution, and I am experiencing the same problem, I am still trying to solve it so I can receive automatic financial information from my Credit Union. The message says that the data were accessed and transmitted within the last hour or so, but I have no additions to my checking or saving accounts. Frustrated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Esther",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T16:43:20.000Z",
          "Titre": "Definitely the best budgeting app I…",
          "Contenu": "Definitely the best budgeting app I have ever used, I just wish I could see my spending history in a certain category easier and past months spending."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SUZANNE WENTWORTH",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T23:34:05.000Z",
          "Titre": "This is a complicated App",
          "Contenu": "This is a complicated App, to say the least.  It is easy to link to your accounts to import data and expenses , but it is not user friendly. I literally had to watch how to videos every time I friend to use the App.  It was a gift from a family member and I tried for two months and wanted a refund, but they won’t do it.  There are easier Apps that are free.  Don’t waste your money"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T14:41:35.000Z",
          "Titre": "It’s not flexible",
          "Contenu": "It’s not flexible.  Lots of issues"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sofia Sedergren-Booker",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T03:25:57.000Z",
          "Titre": "Easy to use",
          "Contenu": "The app/website is easy to use, but the bank connections are more often broken than not which makes matching expenses with actual transactions more time consuming."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Opal",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T06:33:56.000Z",
          "Titre": "Import is unpredictable",
          "Contenu": "I know they try their best but as banks improve security the import stops working consistently and I fall behind and eventually give up minding my budget."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Paul Hayman",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T05:47:32.000Z",
          "Titre": "I do not use it to its capacity as the…",
          "Contenu": "I do not use it to its capacity as the program is too difficult to work so I just make it up to suits what works for me."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Raj",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T19:21:34.000Z",
          "Titre": "Linked accounts do not work well always…",
          "Contenu": "Linked accounts do not work well always have to reconcile which misses Amy reports"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T18:20:53.000Z",
          "Titre": "Incosistent and costs is high",
          "Contenu": "cost became too much and inconsistent connection to my bank. made budgeting difficult and hard to justify the increase in the price of the product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DeeBee",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T20:14:09.000Z",
          "Titre": "YNAB: The least worst budgeting tool, but still limited and frustrating",
          "Contenu": "Credit card payments remains an arcane feature that I wish I could just turn off.  The transaction filtering feature is very limited and will frustratingly reset every time you change another filter (e.g. if you filter for a time range, and subsequently filter for a transaction type, the date filter will disappear).  A lack of a robust tagging system forces me to use my own codes in the memo which is time consuming and produces incorrect reports when I make a typo.  Finally, the inability to carry over negative category balances month to month remains an infuriating feature.  YNAB's philosophy has dictated this experience, NOT customer feedback.  It's very Apple -- \"We know better than you.\"  I've sampled many budgeting apps over the last 15 years and can say they're all lacking fundamental functionality and sort of suck in irritating ways. YNAB is the best among them, but being the best of the worst isn't exactly a great claim."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T00:33:24.000Z",
          "Titre": "Great product, but…",
          "Contenu": "YNAB as a service has had an extremely positive impact on my finances. I think it’s a great product that works well for me, and many others. Normally I’d give them 5 stars, but in recent years I’ve been unable to recommend YNAB to friends/family due to a number of changes I’ve seen. The big one being, random and large price increases with poor communication regarding the changes. The price is a pretty large barrier to entry and tough for me to recommend at the latest price points. From an end user perspective I’ve seen these increase fees go towards trying to onboard new customers instead of add features long time users have been asking for. I’ve also seen new features come out in an unfinished state (such as the loan tracker) which caused me to have to use a lot of workarounds.Overall it’s a great product, but with the random, giant price jumps and lack of features that benefit long time users, I keep my eye out for alternatives."
        },
        {
          "Note": 3,
          "Lieu": "JO",
          "Pseudo": "Yazeed David",
          "Nb_Reviews": 6,
          "Date": "2022-12-07T00:07:30.000Z",
          "Titre": "The most annoying thing of this is the…",
          "Contenu": "The most annoying thing of this is the lags and delayed transaction imports. With its price. It made me just stop using it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T14:11:45.000Z",
          "Titre": "I was an avid fan before they moved to…",
          "Contenu": "I was an avid fan before they moved to the web platform. Since then, they've mostly increased price. Still a pretty good program but if I didn't have years of history saved, I'd probably look into alternatives."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T17:59:07.000Z",
          "Titre": "My bank transactions are still not…",
          "Contenu": "My bank transactions are still not syncing! Disappointing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Georgi",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T07:19:21.000Z",
          "Titre": "Has been stagnant for years",
          "Contenu": "Has been stagnant for years. Problems with syncs, price increases happen every year."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Loyal YNAB User",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T06:45:16.000Z",
          "Titre": "You Need To Budget for this App",
          "Contenu": "Subscription price has increased significantly, so savings accumulated through the app just went there 😐"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Landon",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T15:03:23.000Z",
          "Titre": "Price is too high",
          "Contenu": "The app is great, but for a budgeting app, the price is a way too high."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "James Watters",
          "Nb_Reviews": 23,
          "Date": "2020-12-08T16:49:54.000Z",
          "Titre": "YNAB not interested in U.K. customers",
          "Contenu": "This product is fine if you fit the pattern of user for which it’s designed. It’s pretty inflexible otherwise. As mentioned by another reviewer, their automatic bank sync service is very unreliable. I think the reason for this is that they do not use the modern Open Banking protocols which make the service work well. They have told me today that they have no intention of updating this. Their only interest is in North American systems so I am going elsewhere after having been with them for many years."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T04:15:39.000Z",
          "Titre": "Using credit card is a pain."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Marcel",
          "Nb_Reviews": 2,
          "Date": "2021-01-05T05:43:28.000Z",
          "Titre": "Two issues",
          "Contenu": "While the software itself is quite good I have two negative things to mention:1. In the classic software you were able to overuse a budget category (lets say -100 on Electricity as you had to pay something in advance). And then the next month this was calculate together with your budget. (so for example -100 from the last month, budgeted 100 for this month and another 50 used in this month would lead to 50 budget). This is no longer the case in the new online version. The budget from last month is only used if it is a positive value. This does not work with the way I am budgeting.2. It is simply to expensive. I'd say around 30-45$/year would be ok, but not 84$/year."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bye bye bye",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T08:41:49.000Z",
          "Titre": "Might be time to move on…",
          "Contenu": "I have enjoyed YNAB for years. But I haven’t used it regularly for close to a year because of the inability to sync my bank account, University Federal Credit Union, with YNAB. I have tried several times without success, and there are no known issues listed. Sadly, I’m about to cancel my subscription."
        },
        {
          "Note": 3,
          "Lieu": "VI",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T02:23:54.000Z",
          "Titre": "Losey customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VS",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:45:22.000Z",
          "Titre": "Great tool",
          "Contenu": "Great tool. Lots of flexibility to create categories and organize. Only downside is that accounts need to be relinked more often than I would like."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kianna",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T03:44:46.000Z",
          "Titre": "Awesome app some things are confusing…",
          "Contenu": "Awesome app some things are confusing but they are very helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lorrie Rogers",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T12:05:07.000Z",
          "Titre": "The app is amazing and does exactly…",
          "Contenu": "The app is amazing and does exactly what I need it to do as an envelope budget system. I tried lots of other budget systems after mvelopes folded and disliked them all except for YNAB. My one complaint is that I cannot write notes on particular transactions. But otherwise I love it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JimmyMac",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T13:42:03.000Z",
          "Titre": "Easy to understand great envelope budget online",
          "Contenu": "Very easy and user friendly app if your looking for an online envelope budget system. I have had minor issues with the syncing with my bank account but I believe that is because YNAB uses Plaid to make the connection. Also adding a credit card was confusing to me. I couldn't wrap my head around how it handled CC transactions vs payments. The whole CC thing just seemed backwards to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelly Woodman",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T18:02:36.000Z",
          "Titre": "Good Budgeting Tool",
          "Contenu": "I started using YNAB over a year ago after the budgeting/envelopes tool I used closed. For the most part, I love YNAB. The user-interface is easy to understand. As a tool, it helps keep the budgeter on track and committed to goals. In general, tools like these are great for those who want to get Credit Card rewards, yet also pay off their credit card balance every month. Having not started YNAB with consumer debt, I cannot speak to how quickly the program can help someone get on track financially, but in principle, YNAB is designed with financially freedom in mind.My only reason for giving 4 stars instead of 5 is for some of the higher level, complex budgeting options, not currently available that I would love to see YNAB offer. For instance, I often have to pay for items and then submit a reimbursement through my employer. I know that I will have the money, as it is not really money spent out of my own budget, but YNAB has no good method for that. Rather, I have to submit preemptive deposits to keep my account from appearing overspent. I imagine that most people do not need the type of function I mention, but for me, this is a small frustration with YNAB."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:12:06.000Z",
          "Titre": "Real good with a few room for improvement areas.",
          "Contenu": "Customer service is 5 stars.  They are quick to answer questions.My issue is pulling up history of my budget AFTER inputting into YNAB.  You can search and bring them up but it isn’t intuitive.  I just want to highlight a budget category and all the things that I put  in that category should then be seen.  Doesn’t work that way.Also if you make a mistake, it is hard to correct.  You can’t fix an error if you are using an iPad or iPhone.  You have to use the computer browser version of YNAB to make corrections and then you can only perform corrections if you haven’t refreshed your budget session.Annual price is reasonable.Other than the things I mentioned, I like it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kaila",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T19:23:28.000Z",
          "Titre": "Best budgeting app! Response time and overspent rollover process needs work",
          "Contenu": "Overall best experience I've had with a budgeting app, it's the only one that works for me. However, there were some bugs this year when I switched my FNBO password and YNAB stopped conecting to my bank for a month or more. I didn't like that I couldn't call anyone and it took several weeks to get a useful human response. Also, I don't like that YNAB won't carry over a negative account balance into the next month. If I assign my money over multiple months and I over spend in a category this month, after it changes to the next month I have to go to the last month I assigned money to because it takes it from there. I don't know if that makes sense but it's a weird and confusing process. It's still a really great service and I appreciate it a lot. Also, love the new branding!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Boy Mom",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T14:58:20.000Z",
          "Titre": "We are coming from Mvelopes",
          "Contenu": "We are coming from Mvelopes which was perfect for us.  YNAB has been the best solution we have found.We only have one real complaint.  We have been budgeting well for 30 years and do the right things. :) I understand WHY YNAB has it up for the utmost accountability.  Our issue is that we budget for the year. Each month is an average of what we need to budget per month. If we go negative in gifts in May because we have 5 birthdays and Mother's Day, we know it will settle out in June because we only have Father's Day. It would be VERY helpful if you had a switch in settings to allow us to carry over a negative balance in a budget category to the next month so we can settle it up easily.  We currently have to keep an additional spreadsheet to even things up month to month. This is our one complaint and it is why we continue to look for a different program that creates less work for us. However, this is by far the best we have found so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alberto",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:26:06.000Z",
          "Titre": "YNAB is amazing and user friendly. Wish it had a couple more features.",
          "Contenu": "This App is Amazing!!! This app makes it very easy to know where money is and how its set aside and I love how in the weeds it lets me get with my budgets. There are a few of things I wish it did a little bit better. 1 - I wish it showed me more easily the Totality of my budget across months. So I have them broken down into categories and all that but I wish there was a report that gave me that insight. 2 - in conjunction with the first, I wish it would take the income planned for periods and let me know how that compares to budgets so that if there is a budgeting issue it should alert me. 3 - I wish it almost had the ability to make a money assignment profile. What I mean by that is that I get paid semimonthly. I wish I could create a couple of profiles to say when I get paid way A I distribute money one way. When I get paid way B I distribute money this other way."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Vince I.",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T11:23:16.000Z",
          "Titre": "Helps us talk about our finances",
          "Contenu": "Me and my partner have been using YNAB for more than a year now and it's perhaps the most important software we've ever used. It encourages helpful conversation about our finances and always seems to give us a feeling of \"enoughness\" as long as we budget."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peggy Hiett",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T13:54:23.000Z",
          "Titre": "What I love about YNAB is that it stays…",
          "Contenu": "What I love about YNAB is that it stays in touch with how much money I have left at all times, and communicates that. It's simple and clear and easy to use. Both the online and mobile apps function well without glitching. I'd like to see a clear summary of the goals on the budget page that helps me to quickly assess whether my goals all fit within my income. I'd like to have this without searching the web and downloading an extension.Great work y'all."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Thibaud De Figueiredo",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T08:55:14.000Z",
          "Titre": "Great app but…",
          "Contenu": "Great app, sad I can’t keep a picture of my receipts inside the transaction. Maybe you can, but haven’t been able to do it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jordan",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T23:16:13.000Z",
          "Titre": "Great product",
          "Contenu": "The budgeting functions are fantastic. My only issue is that my bank kept getting disconnected. Seems to be working really well now though! I like being able to categorize my money so easily."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hannah",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T00:37:54.000Z",
          "Titre": "Super helpful to keep track of spending and saving",
          "Contenu": "Using YNAB has been so helpful in being aware of where my money is going. I have both a personal budget and a business budget, and I love that I can easily toggle between them...while keeping everything separate. The ONLY thing that feels lacking is the mobile app reports. I'd love to see a breakdown of where I'm spending the most money. I can see it on the desktop version, but having more reporting options on mobile would be so helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin der Kinderen",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T07:57:42.000Z",
          "Titre": "YNAB Turned My Finances Around",
          "Contenu": "One Year YNABer.YNAB turned my finances around and, for that, I will always be grateful. It did this by providing four simple rules and a tool to help implement them. The key is visibility and having the information to make decisions about money.There are times where I don't understand why YNAB is working a certain way and not \"my\" way. While I think the unofficial forums are kind of useless for any kind of support or even how-to's, the official support has been real good. The answers are not realtime but once they get on the case they figure out what's going on and can explain it.There is kind of a learning curve but if you understand the envelop system of budgeting and can embrace the four rules then YNAB has a chance to make a real difference for a new budgeteer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kaylin",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T01:33:46.000Z",
          "Titre": "I absolutely have been loving YNAB!",
          "Contenu": "I absolutely have been loving YNAB!! It has helped me visualize all my money and allowed me to spend and save systematically. I recommend it to EVERYONE I meet, as I’ve tried many other budgeting apps and truly nothing compares to YNAB. It was definitely a learning curve at first, and I did put a lot of work into learning it, and I would say that there are some minor kinks that could be worked out, like sometimes I’ve had to connect my banks multiple times before it really saves, but honestly, I love how they are always trying to make YNAB better for customers! Thank you YNAB!"
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Oleksandr",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T11:09:19.000Z",
          "Titre": "Great tool",
          "Contenu": "It is 4, because for me there is no multi currency in one budget, banks integration in my country, slightly more expensive than competitors.But it is a great tool, I'm using it for over year now, it helps me track everything and I'm happy with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J M",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:01:36.000Z",
          "Titre": "YNAB has made a big difference for my…",
          "Contenu": "YNAB has made a big difference for my finances and is a platform that really lets me see what is happening with my money. But the constant GUI changes are frustrating sometimes."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Janet",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T10:08:37.000Z",
          "Titre": "great except...",
          "Contenu": "Great, except one big flaw. My mortgage is a biweekly payment, and the app doesn't seem able to do anything other than a monthly mortgage payment, so that is disappointing and it makes my mortgage tracking inaccurate. This should be addressed, since the app is about saving money and a biweekly payment is the wisest financial choice that will save you money over time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jamie Doran",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T17:03:16.000Z",
          "Titre": "It's better than just a spreadsheet",
          "Contenu": "YNAP is better than the old spreadsheet because either of us can access it online whenever needed. Using YNAP has improved our relationship with our money and made it really easy for us to set and work towards money goals.I wish it synced with more banks, I still have to do a lot of manual transactions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caren",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T18:01:04.000Z",
          "Titre": "Love the app",
          "Contenu": "Absolutely love YNAB. I have it as my browser homepage and use it to make sure I'm always looking at where my money is. The system is invaluable for me, and helps with my compulsive spending and gambling addiction issues. Connections break sometimes but less than Mint and some others I've tried. One thing I'd like to see improve is integration/support for the YNAB toolkit. Many of the features I rely on are customizations from there and it breaks sometimes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah C",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T16:16:54.000Z",
          "Titre": "YNAB has been such a great tool in helping me save money.",
          "Contenu": "YNAB has been such a great tool to help me see where my money had been going and an even better tool to help me budget my money in a way I never had before.I will say that I absolutely HATE the new approval bar. It makes no sense for it to be at the bottom of the page when it appears since the transaction I'm trying to approve is at the top of the budget. Other than that, I just don't like it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jennifer Hassett",
          "Nb_Reviews": 15,
          "Date": "2023-09-20T12:10:02.000Z",
          "Titre": "Control over our finances at last",
          "Contenu": "We are so much more in control of our finances since we started using YNAB, we have 'sinking funds' and savings pots set up and we've started trying to save towards our kids future and our retirement. I don't really use the reports as I don't find them very useful but seeing where our money goes each month has been eye opening!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Deb",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T14:20:56.000Z",
          "Titre": "Love ynab mostly except for the…",
          "Contenu": "Love ynab mostly except for the reporting....it's quite vague it definitely needs improvement. It seems like it's hard to see where you've spent your money out of each category. Plus the overall reporting is not great when you down load it to excel"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Somers",
          "Nb_Reviews": 3,
          "Date": "2023-09-23T18:10:21.000Z",
          "Titre": "YNAB is great for computer-savvy seniors who need to understand their finances",
          "Contenu": "I am a senior citizen and have been using You Need A Budget for several years to help me manage my money. YNAB is a great way to track your spending. Just set up your accounts (checking, savings, credit cards, big ticket items like mortgage and auto, etc) and then record each transaction you make. Secondly, set up your budget and assign the amount for each weekly, monthly, and yearly expense and you’ll quickly see where you are over-spending. Understanding how credit cards work with YNAB is somewhat confusing but there are helpful YNAB tips and YouTube videos. YNAB is somewhat time consuming but once you get in the habit of recording your daily transactions it becomes easier. I recommend You Need A Budget because it gives me an organized “big picture” of my finances."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T08:42:52.000Z",
          "Titre": "Great budgeting app",
          "Contenu": "Great budgeting app for my personal but also companies purposes. There is only one annoying thing that for Polish banks it messes with transfer titles and payees."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T15:58:03.000Z",
          "Titre": "Virtual classes available but, limited support",
          "Contenu": "For me, there was a steep learning curve to YNAB - including one failed attempt.  Fortunately, virtual classes/YouTube videos are now available but, live support is limited.  I advise new users to join FB support groups for help, from other users."
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Vlad Zahrevsky",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T08:07:49.000Z",
          "Titre": "You pay for the education, not for the app",
          "Contenu": "With YNAB, you pay for the education, not for the app itself. There's a lot of videos, tiktoks, articles and podcasts: from “How do I edit transaction date?” to “How do I make long-term financial decisions?”And as educators, they're great."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "I Needed a Budget",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T23:27:08.000Z",
          "Titre": "Fantastic service but Expensive Outside the US",
          "Contenu": "Fantastic service.  It has really helped my wife and me with budgeting.  The culture around the service is also nice with some of their videos presenting a sort of corny positivity to budgeting.The only problem I have is payment in dollars.  It is getting harder to justify the cost in my local currency, especially when a lot of the features like automated transactions are not available in my country."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T16:05:38.000Z",
          "Titre": "I’ve enjoyed the experience for the most part",
          "Contenu": "I’ve enjoyed the experience, but my partner who uses a different bank had to abandon YNAB, because every time they’d try to use it, all their accounts would have to be reconnected and it was a huge pain. Calls to YNAB and the bank could not resolve it. So I can’t use YNAB for couple expenses, and that sucks."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T13:51:04.000Z",
          "Titre": "Was better when auto import worked",
          "Contenu": "Would have been 5 star if the automatic import still worked. Since August you now need to reconcile each account for 3-5 minutes in order to see transactions. You need to do this every time you use the app. Huge waste of time for an expensive product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T14:47:51.000Z",
          "Titre": "My Experience with YNAB is generally…",
          "Contenu": "My Experience with YNAB is generally fantastic. I've seen a wide range of benefits after starting to use YNAB ranging from reducing my spending, all the way to being able to save thousands of dollars faster than I ever have before.Some features that would be really helpful to have would be:1) a way to export my budget from the mobile application2) More reports available, and way to customize those reports          2.1) Some reports that are able to make projections (if I save x amount then this is what I will have in N months, for example)3) Increased variety of savings/goals, and ways to customize those"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gretchen",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T03:02:09.000Z",
          "Titre": "Worth the learning curve",
          "Contenu": "Took a little while to understand all the bells and whistles (and I still probably don't know them all). Flexible enough to track very detailed spending information. Possible to set up a budget in another currency. Has helped us track and understand our spending. I appreciate the many videos answering common questions."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Chris Macneill",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T17:46:07.000Z",
          "Titre": "I have been using YNAB for years",
          "Contenu": "I have been using YNAB for years.  It took me a long time to switch to the updated version because I didn't think I could justify the cost.  However, I am very happy with the product.  I know exactly where I stand and if I have questions the customer service is quick, and efficient.  The people in customer service know their product well and have outstanding communication skills.  The only reason I did not give a perfect score is because of Plaid.  Plaid is the only issue I've had to contact customer service.  The on going training sessions are done well with clear explanations on how and why we budget the YNAB way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lucy",
          "Nb_Reviews": 6,
          "Date": "2023-10-10T15:38:27.000Z",
          "Titre": "We've saved thousdands of dollars!",
          "Contenu": "I love this app!  We've saved so much money by being able to visualize where every dollar is!  Overall the basic features are easy to jump in and use.  I know there are other features that we're not taking advantage of.  The app is both simple and complex at the same time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T20:58:59.000Z",
          "Titre": "App is good, but has AMEX syncing problems",
          "Contenu": "The app is great. Very helpful and easy to navigate. I love creating categories and love how it does all the math. I'd recommend everyone to learn how to budget with this app. Con: For 1 year I could not reconnect my AMEX accounts despite multiple attempts to delete the AMEX accounts and reconnect. The delays and not being able to reconnect ultimately made me not renew."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim S",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T21:14:43.000Z",
          "Titre": "I love how easy it is",
          "Contenu": "I love how easy it is. I like that all my transactions are automatically put in my budget for approval, and the algorithm suggests which budget to take from. I was doing my budget in excel until YNAB, and switching has saved me so much time and headache. The only thing I wish that was different, is it didn't zero out any negative balance at the beginning of the month, and that the Credit Card payments were easier to understand and manage."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Antoinette Koolaard",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T04:48:06.000Z",
          "Titre": "Neat tool but bit pricy",
          "Contenu": "YNAB's training resources are a life saver. They have videos/articles explaining literally everything to do with budgeting. I think the price puts a lot of people off though so would like to see a longer trial period, cheaper subscription, lifetime subscription, or just other options in general because it's such a life changing product!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T02:22:30.000Z",
          "Titre": "Curb overspending and see where your money goes",
          "Contenu": "YNAB helped us see where our money was being spent when budgeting was new to us. In the years since, it has helped when the budget is tight (hello student life & mortgage) and is ensuring we keep track of things now that we have greater cashflow - yay for jobs and graduating! We expect to need to buy a new car soon, and I suspect using YNAB has been instrumental in us having the cash to buy one without finance.(We've been using YNAB for probably 8-10 years now.)"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jo",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T20:46:38.000Z",
          "Titre": "Great software",
          "Contenu": "Great software. I have been using it for many years! The newsletters are actually helpful, their website has a lot of good information and it made budgeting so much less scary for me. I constantly recommend YNAB to my friends. The only real drawback is that I can't integrate it with my non-US bank, so I have to add all transactions manually."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "KangaRoo",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T08:49:56.000Z",
          "Titre": "Amazing tool - Give every dollar a job concept is brilliant",
          "Contenu": "Takes any stress and worry out of money and budgeting. Amazing budgeting concept and tool which has massively helped us to get on top of our personal, and also our household, finances, meaning when an expense/bill comes up needing to be paid, it's very very rarely unexpected or unplanned for, we know the money is sitting there ready to go :)Only four stars as we did have an issue with it duplicating transactions when our bank accts were linked so we've removed them and it's fine"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Wladimir F",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T14:05:46.000Z",
          "Titre": "Good but not Perfect",
          "Contenu": "Ynab is a fantastic platform, the fact that the main focus is on budgets helps a lot with financial control. The only problem I see today is that there is no expense report in the mobile app, it is only present in the web version, and I really miss it in the mobile app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kirstyn B",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T22:18:16.000Z",
          "Titre": "YNAB is great for keeping our family on…",
          "Contenu": "YNAB is great for keeping our family on the same page with our budget and saving priorities. The user interface is easy to use and looks great. We have experienced some challenges with the automated imports from our banking institutions. Usually it’s fixable by reconnecting, but we have had to do manual export/import a few times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anania",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T02:12:04.000Z",
          "Titre": "Not always intuitive but help is…",
          "Contenu": "Not always intuitive but help is availableI tried a few way to track our expenses in a cohesive way and so far I find this to be the most flexible although not always intuitive. It is well documented and being improved regularly and the team makes themselves available to resolve issues one may face. I wish I didn't have to look up so much information on some unique features that I do not find intuitive like how they track the value of an asset while paying off the related debt."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T13:42:46.000Z",
          "Titre": "I’ve been using YNAB for over a year",
          "Contenu": "I’ve been using YNAB for over a year now and it has been the only budget app that I’ve really ever stuck with. The zero-based system works incredibly well, and my wife even likes it since she’s used to cash envelope budgeting. The app and website are intuitive and powerful without being too overwhelming. There is room for improvement though, particularly in the area of reports. There’s only like 1-2 reports visible on mobile; and a very limited selection overall. A lot of people use the extension ‘Toolkit for YNAB’, but frankly we shouldn’t have to rely on a third party tool to gather useful info about our budget. They promised better reporting years ago and have yet to deliver. Also some more savings goals would be nice, such as a weekly savings builder, or adding a target amount to a savings builder goal - more options and flexibility is always nice."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "AC",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T14:25:13.000Z",
          "Titre": "Good but delayed banking import is a struggle",
          "Contenu": "I love the platform and feel it is helpful in streamlining our budgeting. However, we struggle with the banking delays to import and end up with duplicates from time to time that make it hard to reconcile."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel Kate Cason",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T14:55:28.000Z",
          "Titre": "Mostly love it",
          "Contenu": "I like YNAB and it’s helped us save money. Using a credit card in the app is difficult to understand, especially if you pay it off monthly (ie have no credit card debt). It usually ends up appearing like I’m overspending when I know I’m not based on my own checks and balances. It’s also $100 per year now which is a lot for some people."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Ray",
          "Nb_Reviews": 6,
          "Date": "2022-12-20T21:12:35.000Z",
          "Titre": "YNAB is a useful budgeting tool",
          "Contenu": "I found that YNAB was a useful budgeting tool, which was quite easy to learn. I always received prompt and helpful advice from customer service.The only negative for me is the price. I found a cheaper product with auto feeds for all of my bank accounts, and includes budgeting and exceptional support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "YNABUser",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T14:57:36.000Z",
          "Titre": "YNAB Is Awesome!",
          "Contenu": "I love the functionality of the platform and it looks cool too! The mobile app and ability to share the budget with my spouse is also great. I wish there was a way to make hidden/closed accounts disappear from the category section since I don’t want to see “Hidden” or “Closed” after I no longer need them. Maybe put them in a larger menu tucked away from the main screens the users see? Anyway, that’s the only reason I didn’t give 5 stars. The tutorial and podcast videos are great too!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Claude Peloquin",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T15:38:32.000Z",
          "Titre": "Nice and clean user interface",
          "Contenu": "Nice and clean user interface. I like it a lot in general and would recommend.It is still lacking in the planning ahead department however. But I get that their idea is to only spend what you have but the reality is that you have to plan ahead to have the money you'll need in months from now which requires to take in account your predictable revenus and create a budget that \"fit\".That process can be much improved. I already voiced my suggestions using the feature suggestion pipeline."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 3,
          "Date": "2023-10-13T13:04:57.000Z",
          "Titre": "It is very easy to use and set up",
          "Contenu": "It is very easy to use and set up.  Three people in my family use it.  However, it's challenging to keep my Account the same number as my Bank Account number.  Also, it's not the easiest to pay for the year subscription via iTunes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Johnson",
          "Nb_Reviews": 2,
          "Date": "2022-12-20T18:36:53.000Z",
          "Titre": "Next level spreadsheet budgeting.",
          "Contenu": "YNAB takes the spreadsheet budgeting to a higher, nerdy level that I enjoy. I've always did my budget on a spreadsheet. Adding formulas but never was able to get it to connect to my bank for transaction tracking. To know where my money is set aside gives me peace that things are covered."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T14:04:53.000Z",
          "Titre": "Best budgeting / money tracking…",
          "Contenu": "Best budgeting / money tracking software I've used. The ability to plan future spending makes it so much more powerful than basic money tracking software. An automatic bank feed for Australian banks would turn this into a 5 star review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "River",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T07:55:07.000Z",
          "Titre": "A useful tool that shows your FUNCTIONAL balance, instead of your TOTAL",
          "Contenu": "This has really helped me see where my money actually is, instead of seeing only the total balance and thinking well maybe I CAN squeeze something extra in. Being able to see that all my bills can be paid, that I have enough for gas for the month, and whether I can pull from somewhere to afford something or not, it's relaxed a lot of my financial anxiety. I only gave it 4 stars because there are some things that I find confusing. Figuring out how to properly categorize and balance my credit card spending has been difficult. And sometimes it can be finicky and require extra steps to get it to register properly."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Stéphane",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T08:09:55.000Z",
          "Titre": "Very good product",
          "Contenu": "Very good product. Give me the confidence to spend money knowing the basics are covered.Would love to be able to link my bank account. As a french it isn't available yetEffectively, it is now possible to link french bank. (wasn’k possible 5 years ago when I started)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T17:31:12.000Z",
          "Titre": "So close to 5 stars",
          "Contenu": "Overall, fantastic app. Only thing keeping me from giving it 5 stars is the connections to banks are often glitchy, or don’t work at all (especially tracking accounts like investments). If those got ironed out, 5 stars all day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joey S",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T20:19:58.000Z",
          "Titre": "This app is a life changer with a few faults",
          "Contenu": "I love what YNAB has helped do to transform my financial success. Not only is it a helpful tool, but using YNAB has given me confidence in my financial plans and goals for the future.The only reason that I don't give the app 5 stars is because the app sometimes has a few bugs and the ways that the app calculate things are not always intuitive or how one would expect. On the flip side there are tons of videos on Youtube to help with this."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Nik S.",
          "Nb_Reviews": 4,
          "Date": "2023-01-03T22:26:27.000Z",
          "Titre": "I love YNAB but…",
          "Contenu": "Im using YNAB many years and it’s absolute help me to organize my finances and balances. But I have to do a lot of In/Outcome Inputs manually. No one German Bank is supported automatically sync in YNAB. That’s one feature what could make this Software perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T17:36:59.000Z",
          "Titre": "Overall, I love YNAB.",
          "Contenu": "Overall, I love YNAB. I just wish I had a little more custom control over the target types.  Other than that, it's helpful and easy to use.  It has made financial discussions with my spouse easier.  It has given both of us a better picture of our money."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Aideen & John Teahan",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T16:46:04.000Z",
          "Titre": "good for data collection",
          "Contenu": "I like that this app collects data on my spenidng. I don't particularly find it to be a good budgeting tool for a more complex family budget with multiple income steams and expence categories associated with each. It doesn't link with one of my banks :("
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jared",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T23:33:27.000Z",
          "Titre": "I absolutely love YNAB!",
          "Contenu": "I absolutely love YNAB and their budgeting system. I wish all of their startup tips and tricks were together in one startup guide pdf, but having videos and emails daily during the first week is cool too I guess. It has definitely changed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T03:46:39.000Z",
          "Titre": "Good tools and an intuitive layout",
          "Contenu": "Good tools and an intuitive layout. Really helps keep track of where money goes. Wish it didn't cost quite as much to make it more accessible to more people, it costs more than my email/vpn/cloud storage software, but it *does work well* and saves me money."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Letti",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T10:44:10.000Z",
          "Titre": "Practical to keep a budget and to see…",
          "Contenu": "Practical to keep a budget and to see exactly how to make your money work more efficiently to enable savings, budget for things and more important avoid overspending etc.Easy to use both on the computer and on Android, syncs well.However, still a bit annoyed that I bought that software years ago as YNAB 4 but it is no longer supported on the computer nor on smartphones and now I have to pay a hefty yearly subscription to keep using the online version with a mere 10% discount. That's not alright at all but I guess a clever way for the company to make more money rather than selling the software once to reach customer. Monthly and yearly subscriptions for everything now is a plague these days for all technology softwares so no choice I suppose but to yield."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim O",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T15:54:50.000Z",
          "Titre": "Nearly perfect budget tool",
          "Contenu": "It is out of YNAB's control, but the connection issues with some institutions prevent me from giving a full 5 stars. The UX and structure are great, easy to learn, and have saved us tons of stress and money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A very happy customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T16:12:01.000Z",
          "Titre": "We’ve used YNAB for a year and have…",
          "Contenu": "We’ve used YNAB for a year and have found it to be generally useful, overall. It’s not super intuitive and it takes some work to figure out the angles, but after taking time with it, it’s really a good tool. The only thing that we still find frustrating is the bank updates are super slow. And the app doesn’t always sync well. Irritating but over all a good product."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 5,
          "Date": "2023-02-22T18:17:42.000Z",
          "Titre": "Great for Monitoring Expenditure",
          "Contenu": "I think that the app is generally aimed as the less financially savvy than I as I'm still getting used to \"only budgeting for the money I have,\" which can make it difficult to prioritise for long term goals (i.e. will there be sufficint funds for everything I have planned for the next 12 months, 5 years, etc.). I still love it! I have lots of finance and budgeting experience and have used spreadsheets to manage my budgets for many years, but YNAB is much more convenient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ArchiePepper",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T19:03:24.000Z",
          "Titre": "How do I undo on my phone?",
          "Contenu": "My only concern with Ynab has been on the phone app, when I accidentally tap on all icon, and it moves money or some similar action. I don’t know how to undo the action. And there is no history/record of my actions, so that I at least know what I did. Apart from that, Ynab has been great. It has increased my net worth by thousands of dollars. I am very grateful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TU Greystones",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T20:14:40.000Z",
          "Titre": "Overall a good program",
          "Contenu": "Overall I like YNAB.  I find the web application clunky and frustrating to use.  I also find some of idiosyncrasies of the software frustrating - such as not carrying negative balances forward from month to month in budget categories.  I wish they had a non-web version.  Their staff is always friendly and responsive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ohmoogirl",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T09:34:59.000Z",
          "Titre": "Expensive, but so worth it to me.",
          "Contenu": "YNAB has helped me organize my bills as well as helped me easily save money every month. The only reason for one less than maximum stars is they have increased their annual fee and it’s expensive."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T11:20:04.000Z",
          "Titre": "Expense Management and Income Categorization: Enhancements and Suggestions",
          "Contenu": "I successfully categorized the expenses and created effective charts and tables, which was great. For further improvement, it would be helpful to have categories for income, similar to those for expenses, and to include support for anticipated income."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yadir",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T23:11:21.000Z",
          "Titre": "I've been using YNAB for years",
          "Contenu": "I've been using YNAB consistently for several years. It's been a fairly simple way to keep an eye on several budgets for myself, my family, and my businesses. The thing that continues to confuse me is how the credit card debt / payments work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Syd kid",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T21:08:00.000Z",
          "Titre": "Great budgeting tool for the consistent…",
          "Contenu": "Great budgeting tool for the consistent budgeter. I only started budgeting back in November 2020, and didn't start using this app until January 2021. There is definitely a learning curve to this app, but I love that I can budget a month out and see how \"old\" my money is. I've considered using other apps, but I can't get over the ease of creating a budget and how my working budget goes along with me out and about."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bridget",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T14:36:15.000Z",
          "Titre": "I love YNAB!",
          "Contenu": "I love YNAB and recommend it to everyone. It shifts your whole perspective on money and budgeting, and it just makes so much sense (once you get used to it- give yourself time to adjust to that new way). Their customer service, educational materials, and support is second to none. My only bummer is the iPad interface. I replaced my beloved MacBook Pro with a new iPad Pro, and my YNAB experience has suffered a bit. It’s hard to get important reports, and articles and tutorials for all the things are geared toward desktop. (I’ve been told I can switch modes and more easily access my reports, but after several attempts I gave up.) These are small issues compared to the epic benefits. I’m sticking with YNAB and singing its praises to anyone who wants to listen. Give every dollar a job and it will change everything!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T16:19:30.000Z",
          "Titre": "Great Budgeting Tool",
          "Contenu": "We were grateful to finally find a tool that would help us track our budget. We have used it for a little over a year now. One thing I wish YNAB would improve on is having a live person to talk to through their customer service. I  still have a few questions about reconciling my budget that I don’t know how to get answers for. I have watched all the YouTube videos, but I wish I could call and chat with someone. Other then that I have been extremely happy!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bre",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T23:31:04.000Z",
          "Titre": "Most beneficial budget tool I’ve ever used",
          "Contenu": "I’ve been using YNAB for over a year now! Great tools and resources to help you learn how to use the app and makes budgeting waaaaay easier than it has ever been for me. Support groups, podcasts are also so helpful. Overall such a beneficial experience I’ve recommended it to all my friends"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AJ Thompson",
          "Nb_Reviews": 2,
          "Date": "2023-03-25T17:08:57.000Z",
          "Titre": "I love YNAB and look forward to more reports",
          "Contenu": "I love YNAB, it’s a wonderful tool that has made budgeting much less difficult for me. I wish there was a way to export from it, to allow me to do more reporting. I would love to look at monthly, quarterly and annual expenses to see how I’m spending and how I can do better. I’m always looking for ways to improve my finances, so better reporting is the only thing I can think to add, or a simple export option to allow me to create my own reports instead.Maybe it’s already available and I’ve not explored the tools to find it, and if that’s the case then it’s maybe just hiding from me. I’ve tried exporting or even copying my spend from areas within YNAB in order to build reports, and I haven’t been successful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janet H.",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T23:21:29.000Z",
          "Titre": "I had a hard time at first, but now it is such a blessing. I love YNAB!",
          "Contenu": "I had a hard time at first. I do not understand the basics of budgeting, but you had so many YouTube helps that I could go to that helped me get started. I stopped and started over again many times. But eventually I finally got the hang of it. I needed a budget so desperately and this was the only program that really helped me. It seemed logical and I was not going to give up. Your self helps were so useful and they did help me set up my budget. Also, your Customer Service help was useful, although I wish they were easier to get hold of.It has now been a year since I started using YNAB and I recommend it to everyone. It has helped me to live within my means and as a retired person who only has her Social Security as her only source of income, this has been a blessing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T15:28:34.000Z",
          "Titre": "YNAB is the best budgeting app I’ve used.",
          "Contenu": "YNAB is a well-made budgeting app that covers most of the bases and is not difficult to learn. It is a very helpful tool oriented towards budgeting every dollar.I have used Mint, Every Dollar, and my own custom spreadsheets. This is by far the best experience I’ve had.YNAB gives you a lot of control and customization over managing the details of your budget, if you want that; but, it does so without being complex. You can learn the fundamentals in a few minutes. I would prefer a few more reporting capabilities, but many people will not need that level of information. My only gripe is a minor issue with syncing between the iOS and PC versions: the two apps mirror transactions exactly, but sometimes “approved” transactions in one are not marked as “approved” in the other, causing me to have to manually approve them on my phone and PC. This is a very minor inconvenience since you can multi-select transactions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heather M",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T13:53:25.000Z",
          "Titre": "by FAR the best budgeting tool…",
          "Contenu": "YNAB is by FAR the best budgeting tool I’ve tried and used. I just reached my one year “anniversary” and for the first time don’t have regular anxiety over money because I see it in front of me, it is FLEXIBLE, and I know that every dollar has a job! Thoughtless spending has decreased significantly. My reason for 4 stars is that I wish the mobile app was slightly more user friendly (I would give anything for an “undo” button!), the “automatically assign” option always leads to a mess and me wiping my budget and starting from scratch, and it is not the best at catching duplicate purchases. (For example, I often use PayPal for purchases but it is linked to my checking account and without fail I get a separate deduction from each account and have to manually delete one. Not a big deal but it really threw me off at first and I could never keep my accounts reconciled. Now I just make sure my PayPal is always at zero$)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SHERRI",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T14:39:13.000Z",
          "Titre": "The only reason I didn't give YNAB 5 stars…",
          "Contenu": "The only reason I didn't give YNAB 5 stars is because of a fault of my own. I've been a customer for over a decade and a year ago I accidently deleted my account and had to start over from the beginning. I called support immediately but my 10+ years of data was lost forever. I wish YNAB had an account recovery feature. Other than that, I love YNAB."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T16:47:00.000Z",
          "Titre": "Enjoyable, but a steep learning curve",
          "Contenu": "It made budgeting an enjoyable activity for me. To be able to have the numbers crunched and laid out so well is a huge help with organizing finances. There is a steep learning curve with the program and it took me almost a year to realize that I had been inputting credit card transactions incorrectly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-01-26T02:13:21.000Z",
          "Titre": "Great tool, but expensive.",
          "Contenu": "Great tool - unfortunately the price recently increased significantly. However, this has probably been the best tool I have used over they years to track finances and really allows me to control finances as well as track them (other options I have tried include Quicken, Microsoft Money, Mint, Personal Capital). Budgeting features here are the best I have seen"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T12:20:52.000Z",
          "Titre": "Mostly amazing",
          "Contenu": "I think it is great-it has definitely helped me to save money and be more goal focused.  My only issue was some bank connection issues that took several months to resolve and made things more challenging and the different type of connection I had to use wasn’t as reliable or automatic so I have to pay much closer attention - which is fine just not as “easy”.  Overall awesome and I tell everyone about learning to budget at 55!!"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Bruno",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T03:56:29.000Z",
          "Titre": "A bit too expensive",
          "Contenu": "A bit too expensive for my (non-US / non-Europe) country. Still, amazing app"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Barb Miles",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T20:11:00.000Z",
          "Titre": "Educated spending",
          "Contenu": "I love that YNAB has made it easier for me to make educated decisions about my money all in one place. By having those yearly expenses right in front of me, I'm no longer relying on memory to ensure I have enough money at the time it's due."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T07:23:15.000Z",
          "Titre": "Has room to improve",
          "Contenu": "YNAB is a handy toolset and mindset for anyone who wants relief from financial distress.If the company can listen to users' suggestions and improve customer services. It will be more great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WDBIV",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T15:56:26.000Z",
          "Titre": "YNAB Comments",
          "Contenu": "The support from your team has been outstanding.  Our only complaint with YNAB is the lack of reports available.  We really need a budget vs. actual comparison on a monthly and YTD basis.  If you would add that, the app would be outstanding!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jazmin Ragsdale",
          "Nb_Reviews": 2,
          "Date": "2023-04-19T11:41:53.000Z",
          "Titre": "I love YNAB",
          "Contenu": "I love YNAB. Just renewed my yearly subscription. I’m never leaving!! Lol the only reason I didn’t give 5 stars is because sometimes transactions take days to show up and the app and computer website don’t always sync well. We can’t all be perfect but I love it so much!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T07:58:51.000Z",
          "Titre": "Mostly satisfied",
          "Contenu": "I don’t like not being able to use some features from my iPhone and that there isn’t a person to call when there are issues but overall it’s a good tool"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Levi Palmer",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T08:22:37.000Z",
          "Titre": "Really great with a little room for improvement.",
          "Contenu": "I really like the cash envelope system used and the way that all my accounts connect with ease. I would like it if it could connect live with my investment accounts to update maybe even just once a day. The price is a little more steep than I would like. I had it free for a year as a student and if I didn't have that time to get it all set up and really get in the groove of things, I likely wouldn't have began the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Suzanne",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T01:43:51.000Z",
          "Titre": "I love the electronic \"envelope\"…",
          "Contenu": "I love the electronic \"envelope\" system.  I nearly quit many times... found myself a coach that can share my screen.  I wish that there was a live person to chat with on YNAB.  Getting help a day later or even an hour later is really cumbersome (though appreciated)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Goldberg",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T23:11:50.000Z",
          "Titre": "I still have issues from time to time…",
          "Contenu": "I still have issues from time to time such as correcting a mistake like debiting from the wrong account and having issues trying to undo or correct it. Is undo even possible from the mobile app? If so, I haven't been able to find it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T20:33:12.000Z",
          "Titre": "The app is easy to use",
          "Contenu": "The app is easy to use. I like how I can fit it for my spending. I get paid weekly, which is unusual-but it’s no problem for this app.My only ‘issue’ was learning the credit card spending. Took me a bit to figure how to use — but once I understood — I love it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T18:21:31.000Z",
          "Titre": "Mostly easy and fast to budget",
          "Contenu": "Tracking spending is easy and fast between my spouse and I. Format is customizable to many budget types. However, bank data transfer doesn't work with our bank, and reconciling isn't the easiest process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessi Myers Wise",
          "Nb_Reviews": 3,
          "Date": "2023-03-26T14:30:28.000Z",
          "Titre": "YNAB is a great tool",
          "Contenu": "YNAB is a great tool. It can be confusing at first, but there are plenty of video tutorials.  It is figure-out-able.  I read Ramit Sethi’s “I will teach you to be rich” book and he recommended YNAB, so I got it over a year ago and it’s a tool I check in on every 2-4 weeks. Categorizing everything made it really easy to figure up my tax write offs, which is awesome!There’s still a lot of features I don’t know how to use, but even without all of that, I have a much firmer grip on how my money is spent each month, and that’s a huge help!I definitely recommend it."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Dale",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T00:06:37.000Z",
          "Titre": "I am a daily user of YNAB and it is a…",
          "Contenu": "I am a daily user of YNAB and it is a great tool to track and monitor spending and budgeting.I would really like there to be more detailed reports, and for those reports tk be available on both desktop and mobile."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben Meeder",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T18:38:26.000Z",
          "Titre": "Ynab is a pretty good tool and has…",
          "Contenu": "YNAB is a pretty good tool and has helped me get more organized and learn about budgeting.  One thing is I think they’ve over complicated the software and budgeting.  If software is easy to use incorrectly, then the user will fall into a pitfall despite everyone’s best intention.  One example of this is that I still can’t believe there is not a budget interface in the system where I can see the whole year at once.  Just a spreadsheet basically with the columns as months and the rows as expense categories or income categories.  Then a subtotal column ect and final yearly numbers to have a full projection of a year.  Instead i have to export my budget to a spreadsheet and work with it in excel?  For a specific example, see how this property management software has a dead simple budgeting tool. help.buildium(dot)com/hc/s/article/Budgets So in summary I’m grateful to YNAB for helping me along my budgeting experience, as I use more book keeping tools and accounting tools, I’m realizing they overcomplicated some things and left out some important things.  Keep up the good fight YNAB."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D.O",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T13:45:22.000Z",
          "Titre": "Invest in yourself, get YNAB",
          "Contenu": "A great program that helped me go from living paycheck to paycheck to actually paying off a credit card and have a balance in my savings. The only reason I didn’t give it 5 stars is because they tend to have a lot of connection issues with my bank and my transactions are consistently a week-ish behind"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T23:28:41.000Z",
          "Titre": "I'm rating the experience of YNAB Wellness",
          "Contenu": "I think YNAB Wellness is a GREAT option for a service provider like me, and customer service is great.  My only constructive feedback is on the billing.   It's unclear how/when we get billed, and the annual invoice was innacurate - for example, we got a link to an invoice for 5 seats in advance of the charge date, and then saw that transaction + another for additional seats that we don't have an invoice for.  In our case it's fine, but that may be problematic for other businesses that are more tightly budgeted and unclear about how the billing works for wellness accounts."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Onishi",
          "Nb_Reviews": 2,
          "Date": "2022-12-08T10:58:39.000Z",
          "Titre": "A great tool for personal finance, but too expensive right now",
          "Contenu": "Managing my personal finance using YNAB is both easy to setup as well as easy to manage and I'll not easily say such a thing.However the reason I stopped using is twofold. First off the price just about doubled for me, and while the application may be more worth the price when using more advanced functions like automated imports (which are mostly supported only in the USA), the price increase puts it well above the price of most other similar applications. Secondly, the main reason I used YNAB was because I had to properly budget to prevent myself from going into debt, which ironically means that by using YNAB I learned I shouldn't be paying over ninety euros on a service that is available far cheaper even if I think it worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich B",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:16:05.000Z",
          "Titre": "Massive Time Saver & Peace of Mind",
          "Contenu": "This tool is effective and efficient and saves me hours of precious “Saturday morning free time” each month I’d otherwise spend going through spreadsheets and account reconciliations. It gives me peace of mind that our budget is on track and also helps me catch fraudulent or questionable charges right away. I recommend YNAB to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clint U.",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:17:32.000Z",
          "Titre": "I have been using YNAB since 2009 and…",
          "Contenu": "I have been using YNAB since 2009 and it is the best budgeting software by far, in my opinion.  I have gotten the \"maybe the grass is greener\" itch a few times and tried other software options, but I've always found my way back to YNAB.  It just works and the customer support is next level if you ever have a question or issue."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Łukasz",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:09:51.000Z",
          "Titre": "Flexible",
          "Contenu": "The best budget planning app that is getting better and better.I’ve tested many other budget planning but YNAB is most flexible and truly understanding people’s needs.Using it for over a year and very happy about how calm I became by not remembering what I need to spent my money on."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Rando",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T10:40:18.000Z",
          "Titre": "Great tool",
          "Contenu": "It's a great tool that is obviously made with a lot of attention to detail. I used Quickbooks before and I couldn't get used to it. YNAB felt right immediately."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samantha Ever.",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T05:51:28.000Z",
          "Titre": "We have finally gotten our attention under control",
          "Contenu": "This is the best app ever. I've used quickbooks, mint, honey, several others briefly and couldn't get under control but this one has a different approach and actually helped my husband and me. We've been using it a little over a year and I highly recommend it. Try for at least 4 months, you'll see."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mandy",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:04:11.000Z",
          "Titre": "YNAB has changed my life!",
          "Contenu": "I love YNAB. YNAB has helped me go from living paycheck to paycheck to having a solid emergency fund. It has changed my relationship with money completely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise McDonald",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:51:04.000Z",
          "Titre": "Can’t live without it",
          "Contenu": "Easy to use and creates visibility to how my savings and spending is going. It gives me freedom to spend when I know there’s money in a category."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JT",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:33:15.000Z",
          "Titre": "We have been able to be in control of our finances.",
          "Contenu": "We have been able to be in control of our finances, instead of the other way around. Less disagreements about what to spend where, we just check the budget and category to see what is available and make an informed decision as to spend or not to spend. Love rolling with the punches when needed. Less worries about unexpected things that come up, as we have it covered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T12:50:49.000Z",
          "Titre": "Versatile Software and Caring Staff",
          "Contenu": "I have had YNAB for about two years now.  This is the most versatile budgeting software I have come across.  You can customize your categories to the max!  And anytime I have reached out to YNAB with an issue or a simple thank you, I have received a beautiful and detailed response.  They care about each and every person who uses their software- not just as customers, but as human beings."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Taylor",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T14:32:56.000Z",
          "Titre": "Best thing ever!",
          "Contenu": "It has changed my life by changing the way I look at and utilize our money. We've been able to pay off debt, save for the future and go on vacation. None of this would have been possible without YNAB."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Em",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T10:12:26.000Z",
          "Titre": "After 1 year of using YNAB",
          "Contenu": "After 1 year, YNAB has helped me determine what my unnecessary expenditures were and told me where my money's mostly going. This has definitely improved my spending habits and I hope my savings are also going to improve very soon!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wille",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:08:16.000Z",
          "Titre": "Excellent budget app easy to helps…",
          "Contenu": "Excellent budget app easy to helps track credit purchases and payments seamlessly. Easy-to-fill envelopes each month and know what is left in each envelope daily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:29:57.000Z",
          "Titre": "YNAB is a game changer",
          "Contenu": "Budgeting only with money you have is counter to all of the advice I grew up with and had encountered before YNAB, but it’s revolutionary and the level of peace I feel being a month plus ahead is priceless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T06:59:48.000Z",
          "Titre": "Seriously easy to use and super helpful!",
          "Contenu": "We had a bank that wasn’t easy to connect, and the support team created a way to make it happen. This program is so helpful to keeping to a budget. Everything works so intuitively. And we just don’t know how we survived without it before!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Naomi",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T16:47:24.000Z",
          "Titre": "YNAB is phenomenal!",
          "Contenu": "YNAB is such a help in our personal finances. We have an accurate understanding of where our money is going. The program has a learning curve, but the supports available to teach you are very helpful. It's worth every penny!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T18:46:39.000Z",
          "Titre": "The tool is so helpful!",
          "Contenu": "The tool itself is such a helpful tool in general. Customer service takes a little while to get back to you but when they do they go above and beyond to help explain things to you or fix any problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karissa",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T14:27:26.000Z",
          "Titre": "Successful switch from Mint",
          "Contenu": "We have been users of Mint for over a decade. Sure I had to do a lot of manipulations to make it work but it was free! However, I had forgotten to balance the budget before the end of the month one too many times and decided to try YNAB. Its super easy to use, they are always working to make it better and when I have had questions I couldn't figure out they have a great support team that has looked into my individual issue and figured it out. We also have taught a lot of people over the years to budget and this tool is much easier to explain."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SW",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:28:32.000Z",
          "Titre": "Easier than I expected",
          "Contenu": "So much of the work gets done automatically. It took me a few months sorting out what categories made sense for me, but then YNAB picked up what stores went with what category so I rarely do more than add a comment and approve them. Unprovoked I have tried to get others on this app. It is outstanding. Budgeting is life changing. I am retired on a fixed income and it lets me balance my big expenses like travel against emergency expenses like car repair, lets me get the most out of y money."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Diana",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:08:42.000Z",
          "Titre": "Best budgeting app I have ever used.",
          "Contenu": "Best budgeting app I have ever used.Pros:-It is hands on. You need to be logging in at least once a week (I do it daily). This means you actually use it as a budget and not a tracking system that runs in the background and you look at once a year after the spending has already taken place. -The software forces you off the credit card float. Which before YNAB I didn't even know I was on. This means I can pay off my credit card bill in full at any point.-No guessing. You know where your money is, and you know exactly what you can afford, and what you can't.-Great for couples who share finances. Each person has their own log in, and multiple accounts can be linked to YNAB.Cons:-The import feature is a bit gimmicky and doesn't always work. There are other options for importing transactions, and YNAB tech support is fantastic, but still, I wish it was better. -Reports could be better on the web, and they are basically non-existent on the app. There is a web extension called \"Toolkit Reports\" which bridges this gap, but for the price, I don't think I should have to rely on random web extensions. All in all though, this thing is worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz Woodfield",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T21:53:31.000Z",
          "Titre": "YNAB is the best way to manage your budget!",
          "Contenu": "We love YNAB! Their customer service is incredible and they offer so many classes and resources and sessions to give feedback on their product and make sure you know how to use it in a way that will really serve you. I love how easy it is to track credit card payments and what you owe and ensure you have all the money set aside to payoff in full. We will continue to use YNAB for the long-term (hopefully forever)!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meghan",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:19:31.000Z",
          "Titre": "Best budgeting tool I've ever tried",
          "Contenu": "Best budgeting tool I've ever tried, and I've tried a few.  It really helped me change my relationship with money and to be able to save for both expected and unexpected events in the future.  I'd say it took me about 3 months to get the hang of it and two develop the categories I needed with the help of perusing the Reddit YNAB subreddit and things agree going smoothly a year into the process.  At first, I scoffed at the cost, but honestly it's with every single penny to know where my money is and where it's going.  I recommend not linking accounts and doing everything manually so you really stay in touch with every transaction you make."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "steph",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:25:11.000Z",
          "Titre": "highly recommend!",
          "Contenu": "YNAB is easy of use and excellent customer service. It’s helped me approach my finances with less anxiety, and I’m so glad a friend recommended it a year ago! The fact that I’ve stuck with it that long says a lot!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T15:59:04.000Z",
          "Titre": "Love the app!",
          "Contenu": "• app is very user friendly• desktop is not as intuitive for me, but has more reports available so I use it for spot checking about once a week•love that I have to reassign overspending instead of just ignoring itPrevious to using YNAB I had a system where I was a month ahead on bills so I would have a large amount of money in my account but it was clunky because I would have to manually figure out how much I still needed and for what bill, etc. Now YNAB takes care of that and I always know which item for the next month is still short.  Overall super pleased with YNSB’s system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:21:38.000Z",
          "Titre": "Tools for success",
          "Contenu": "With a good support team, clear how to articles, rock solid principles and an easy interface, YNAB provides not just a good idea for personal financial success but the essential tools to achieve it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Jo",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T03:30:54.000Z",
          "Titre": "The best budgeting app I have used",
          "Contenu": "The best budgeting app I have used. Completely changed the way I handle my money and has helped me pay down my debt tremendously"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J-Rod",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T02:44:34.000Z",
          "Titre": "This app has been a live saver for me",
          "Contenu": "This app has been a live saver for me. Since using it, my networth, savings, and investments have gone up exponentially just because my finances are more organized. Thank you YNAB!!"
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "Filipp",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T09:54:53.000Z",
          "Titre": "Take you money under control",
          "Contenu": "The new approach, well, It's not that \"new\" anymore, so rather a unique aproach to deal with money, debts and be less stressed of the furure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corey W",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T15:01:22.000Z",
          "Titre": "Exactly What I've Wanted",
          "Contenu": "This software does EXACTLY what I've wanted since 2000 in every way! It manages the \"envelope\" system digitally and sets aside money for credit card transactions as you categorize your items according to your budget!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judith Mendez",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:22:04.000Z",
          "Titre": "This app is truly life changing",
          "Contenu": "This app is truly life changing. Our family is in the middle class bracket. Make too much to get any assistance and we make too little to really make it. This app has shown me where we spend too much so i was able to make the adjustments needed to give us a better financial life. I am still a work in progress but i am making progress."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:51:14.000Z",
          "Titre": "YNAB makes it easy",
          "Contenu": "YNAB makes it very easy to meaningfully track our household budget"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kmb",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T07:05:08.000Z",
          "Titre": "Must needed tool!",
          "Contenu": "Been using YNAB on and off since 2015. I've tried other apps but always come back to YNAB.  It's definitely improved my relationship with money. YNAB should create a financial education course to be taught in high school!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T07:48:10.000Z",
          "Titre": "Worth the money",
          "Contenu": "I'm using YNAB for a year and I have really built savings for the first time ever. It works for me because it is flexible and easy to use and it is easy to deal with impulse buys or unexpected circumstances."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "GladysL",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T07:23:56.000Z",
          "Titre": "Life changing.",
          "Contenu": "This app literally changed my life.It’s more than just a great app, with a breathtaking user-friendly beautiful interface, an amazing community, and the most impressive personal finance management tool, it’s more than that. It’s a true life concept, which drastically revolutionized my entire view and mindset of what personal finance management is and should be.I am literally addicted to this app, and I could not live without it. Ever."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Rui",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T10:47:55.000Z",
          "Titre": "Use the free trial to understand the method",
          "Contenu": "I recommend using the free trial to its fullest to understand how YNAB works, because it's much more useful if you follow the underlying principle.It was a little daunting at first and expensive when compared to other budgeting apps, but when I tried to used others, they felt lacking, like I was just making an effort to record transactions without actually getting useful or actionable information from it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Landon",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T18:15:19.000Z",
          "Titre": "Simply fantastic",
          "Contenu": "YNAB got me through college when I was unexpectedly on my own for survival, including tuition. Even though I had inconsistent income, massive tuition bills, and a host of other things to worry about, YNAB had me handled. I've saved gobs of money and feel confident about my finances now because the Four Rules really work.On top of the app itself, their website and support are extremely helpful, with lots of articles and help on anything I've needed. I'm currently planning my wedding with YNAB too. As things stand, I will be sticking with these guys till the end of time 🫡"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T16:21:37.000Z",
          "Titre": "Financial Clarity!",
          "Contenu": "YNAB has changed my life financially for my family. Financial clarity over expenses, habits, and life’s surprises make the burden of budgeting a breeze. I look forward to looking at my YNAB budget everyday and constantly recommend it to friends and family."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ido Ran",
          "Nb_Reviews": 5,
          "Date": "2023-11-20T11:54:41.000Z",
          "Titre": "Using YNAB over year and loving it",
          "Contenu": "I'm using YNAB for our a year now and I'm happy to say it worth every penny because it helps me, and us as a family, manage our finance in a way bank applications cannot.The biggest difference is by building and following a budget we can be prepared for things we don't want to happen but know might happen and also better understand what we can and cannot afford.Even if we have money in the bank, without YANB it's hard to know what this money purpose is.Using YNAB we know exactly how much money we can use for each thing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T16:15:25.000Z",
          "Titre": "YNAB presents a clear at-a-glance view…",
          "Contenu": "YNAB presents a clear at-a-glance view of cash flow. It’s allowed me to invest more, keep spending aligned with our values, and easily roll with the financial punches that are inevitable. It takes some time to set up and figure out the approach because YNAB looks forward at spending, not backwards. Once set up it saves SO much time. It also greatly reduces worry because everything is so clear. Lu moved to YNAB 18 months ago and love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan F",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T20:34:00.000Z",
          "Titre": "Change your life, Choose YNAB",
          "Contenu": "We've been using YNAB for the last year and it has really changed our lives by changing our relationship with our money. I was into budgeting before my wife and I got married, with most of it being with EveryDollar and the folks of the Ramsey network. The people at YNAB are just more supportive, understanding that how people want to spend their money is as varied as the person who earned it. We don't get yelled at for NOT living on rice and beans, or using credit cards responsibly, and we don't get berated for spending money on the things we enjoy WHILE we pay off debt. And if we decided to sprint, the folks at YNAB would still be there to support and cheer us on. Because they're so damn awesome. I get to watch our net worth go up as we pay down debt, save some money here and there, and we do this all while being encouraged to think about what we want our money to do for us. The only thing I'd like to see added to the Income and Expenses report is an approximate savings rate each month and annualized as well. The Age of Money is awesome as well. MANY thanks to Jesse and the YNAB crew!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Jameson",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T01:30:12.000Z",
          "Titre": "The software is the best we have used",
          "Contenu": "The software is the best we have used. Helped us fine tune our budget management."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:54:45.000Z",
          "Titre": "Mvelopes convert",
          "Contenu": "Switched when Mvelopes closed. This is way better than Mvelopes in many ways - and only worse than MVelopes in a couple ways. My main complaint is that I want to carry a negative balance on envelopes from one month to the next. I use that to indicate when people owe me money. YNAB doesn't like that. I understand why, but it makes it harder for me to deal with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T16:38:02.000Z",
          "Titre": "I absolutely love YNAB",
          "Contenu": "I absolutely love YNAB and can’t imagine handling my finances without it. The ease of being able to see all your money (checking, savings, credit cards) in their own category and then summarizing everything into a budget tab is great! I also love the addition of loan pairing so when you make a payment, the loan amount goes down so you can see your progress. It also has a simulator that allows you to see if you made additional or lump payments, how much quicker your loan due date will decrease while saving interest. There’s just so much about this that I love. You have to try it! It really will change your life and give you a better relationship with your money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donny",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T13:29:42.000Z",
          "Titre": "Great for “envelope” style budgeting",
          "Contenu": "This is the only online budget software that I found that does zero-based, envelope style budgeting, which I believe is the best way to not just know your spending, but to actually manage it. Besides that, it’s easy to use, fast, and both the mobile and web experiences are good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:50:17.000Z",
          "Titre": "We love YNAB",
          "Contenu": "We love YNAB! When bills come I don't get anxious, I know it's covered in YNAB. It's brought a lot of financial peace."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cristy K.",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T05:23:11.000Z",
          "Titre": "Best budgeting app…hands down.",
          "Contenu": "Love YNAB.  I couldn’t live without it at this point.  I was an mvelopes user for years.  Once that app was discontinued, I tried numerous alternatives and YNAB is head and shoulders above the rest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rudy",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T16:20:47.000Z",
          "Titre": "I Love YNAB",
          "Contenu": "I Love YNAB! There I said it! I have always done a \"budget\" but YNAB allowed me to have the insight as to where I want my $ to go. By planning in advance, giving each dollar a job, it works very well for my style of spending. It took a couple months to transition from a paper budget to YNAB but now I cant imagine doing it any other way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C Swanner",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T17:12:20.000Z",
          "Titre": "I love the flexibility to create my own…",
          "Contenu": "I love the flexibility to create my own groups and categories. The only thing I wish YNAB had is a spending plan to automatically fill my envelopes based on how I plan to spend the money. That’s not a deal breaker though."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Us",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T17:05:16.000Z",
          "Titre": "Able to save for big yearly expenses now!",
          "Contenu": "We started using YNAB because we wanted to save up for big yearly expenses and a 20 yr anniversary vacation. Now a year later, we have reached those goals and we are managing our money better than we ever have our entire lives. Thanks so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aubrey",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T09:11:06.000Z",
          "Titre": "Best budgeting app ever!",
          "Contenu": "YNAB has given me so much confidence with my money. I feel so prepared for anything that might come up, I paid off all of my credit card debt, and I’ve learned how to prioritize saving and spending goals. I love how it connects to your bank and credit card accounts so it’s easy and quick to stay accurate. I will never give YNAB up, it’s the best budgeting tool out there!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T13:51:50.000Z",
          "Titre": "Try it, you won’t regret it",
          "Contenu": "I had been using another platform for a long time. When they shutdown I found YNAB. Admittedly it took some getting used to, but now I love it. It integrates with my bank and credit cards seamlessly. I have been able to get 1.5 months ahead with funding my budget. Funding is simple and flexible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T16:54:17.000Z",
          "Titre": "Extremely helpful",
          "Contenu": "There’s a learning curve, but tons of helpful videos and also tons of live webinars where you can ask questions. Every person has been friendly and helpful. The app works well, has plenty of flexibility to use it the way you want to, and is extremely helpful in keeping you aware of all transactions and on track."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jess",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T19:32:15.000Z",
          "Titre": "It took some getting used too",
          "Contenu": "It took some getting used too, but when getting the hang of it, It’s been really great at being mindful at what my money’s being spent on. Also the budgeting automation has been great at taking the guess work on when, what and how much to pay towards bills."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Naomi",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T09:40:23.000Z",
          "Titre": "I love to use YNAB",
          "Contenu": "I love to use YNAB. I have been using the method of just over a year. I had be budgeting with a different program for years, but after starting to use YNAB I have been able to get over a month ahead and am out of debt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roxana",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:11:33.000Z",
          "Titre": "YNAB IS LIFE CHANGING!!!",
          "Contenu": "YNAB has genuinely changed my life. I can’t imagine my life without it. I love how they not only provided a platform to budget, but they also provided their 4 rules of budgeting. Those rules with the tools provided from YNAB has given me the most amazing financial freedom I’ve ever known. I actually know where every cent of my money is going, and if I have money to spend on something. It’s allowed me to save more than I ever have. I love it and am so grateful for the work they have done! They’re saving people’ finances in my opinion."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "João Dinis Ferreira",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T12:40:52.000Z",
          "Titre": "Can't imagine myself managing my finances any other way",
          "Contenu": "I've been using YNAB for just over a year now, and it has genuinely changed my mindset towards personal finance. It has enabled me to keep a tight grip on what my money does, and to better align my spending with my goals and intentions.I sincerely cannot imagine myself managing my money any other way. I highly recommend YNAB!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Danielson",
          "Nb_Reviews": 4,
          "Date": "2023-11-24T05:48:37.000Z",
          "Titre": "Review of YNAB after one year",
          "Contenu": "About a year ago, I was looking for a new method of managing our budget. For many years we were using Quicken and for a number of reasons decided it was time to leave, their app and lack of interest in customer issues related to the app being just one. After searching YNAB appeared to be the best choice. We were already trying to follow a zero based budgeting stategy so the transition to YNAB wasn't that difficult. Not saying it was seemless, but with the help of the many video tutorials the transition went pretty well. Needless to say, we just renewed our subscription for another year. YNAB is easy to use, clever in how it handles your budget needs, and provides updates as needed in a timely manner. Another thing I personally like is how rapidly the team responds to questions when something occurs that I cannot figure out on my own. The mobile app is quick and easy to use and actually makes it enjoyable to enter transactions at the time they occur."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sybil",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T08:28:43.000Z",
          "Titre": "Great customer service and free classes! Thank You!",
          "Contenu": "Customer service and your free classes!  Your podcast is great too. The ease of use of your mobile app helps me also stay on top of a complex family office when I’m on the road. I recommend YNAB to our friends and family - it has been a complete game-changer for us helping me to stop my vagueness around money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T12:57:26.000Z",
          "Titre": "No longer afraid to look at my bank account",
          "Contenu": "YNAB has been extremely helpful with teaching me how to budget. It has forced me to take ownership on what I allocate my money to and the ways I could be saving or paying off debt faster."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanessa H",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T15:48:25.000Z",
          "Titre": "Excellent product & excellent service",
          "Contenu": "Excellent product & excellent service!  After over a decade using another budget service I made the switch to YNAB when they shut down a year ago.  After 1 year with YNAB, I only regret not moving sooner.  YNAB is a great place to reach your goals & it has the right team to just keep making it better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angeliki",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T16:51:55.000Z",
          "Titre": "YNAB is a game changer",
          "Contenu": "YNAB is a game changer.  It allowed me to save thousands of dollars in my first year of use.  As an independant business owner, my income fluctuates, and because YNAB allows me to give every existing dollar a job I am able to ensure my budget no longer relies on future income.Make the investment.  Use YNAB's endless resources to evolve your budgeting methods - between YouTube and the podcast, YNAB provides so many tools to help you curate a budget that makes the most sense for you as an individual.I wish I would have found YNAB sooner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bre",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T14:19:23.000Z",
          "Titre": "I love YNAB",
          "Contenu": "I love YNAB! They keep me on track. Not to mention the extremely responsive support staff for all of my questions around maintaining my budget, how to work different situations  and credit card usage. Truly enjoy the platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Laplante Caron",
          "Nb_Reviews": 5,
          "Date": "2023-12-05T15:57:22.000Z",
          "Titre": "Love Love love YNAB!!!",
          "Contenu": "Love! Love! Love! Ynab . . .It's my 4th year and the learning curve was a bit tedious in the beginning. So happy that I stuck to it cause now I can't imagine what my finanacial life would be without it!  I am on a very limited budget (fixed income)  and since on YNAB I can even save a few $$$.  Who would've thunk???? LOL   Love the new \"SNOOZE\" feature!  Thank you again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Toone.",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T03:44:52.000Z",
          "Titre": "YNAB is a great budgeting tool",
          "Contenu": "YNAB is a great budgeting tool. It allows you to create a plan and allocate your funds so you can stay on track. The training videos are helpful and the courses they offer help with any questions you may have. I love the program and recommend it to all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T04:26:48.000Z",
          "Titre": "Time saver over Google Sheets!",
          "Contenu": "Time saver over Google Sheets!I switched to YNAB just over a year ago. After much research, I found that it aligned most closely to our family's financial philosophy. It has been a huge time saver over my Google Sheets system and is more accurate and up-to-date to boot. Love the educational support and community, especially the \"Budget Nerds\" podcast. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lorna Howgate",
          "Nb_Reviews": 12,
          "Date": "2023-11-29T11:05:20.000Z",
          "Titre": "YNAB has changed my life!",
          "Contenu": "I've been using YNAB for a year now, and it has completely changed my finances. I tried different budgeting systems but this is the one that's stuck, thanks Team YNAB"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Curran",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T17:54:26.000Z",
          "Titre": "YNAB is the best!",
          "Contenu": "I used to mvelopes which I thought was great. But they went out of business. I tried many tools to replace it. YNAB was by far the best out there. I could not manage my budget easily in this day and age of online transactions without it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abbie",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T18:19:36.000Z",
          "Titre": "YNAB is AWESOME!",
          "Contenu": "I have ADHD and struggle with spending. My husband and I share an account. It has really helped me realize the amount of money I have in my checking account is ALL spoken for in one way or another! My husband looks at the bank account online and I look at YNAB to see how much we have to spend on fun things, bills, extra debt payoff, etc. This app has really been life changing for me to build skills to think of my money differently.  I'm not perfect in my spending, but this method has worked very well to see how much I have spent and that an extra I spend has to be taken away from something else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roxie",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T16:36:19.000Z",
          "Titre": "YNAB is a huge help for my ADHD",
          "Contenu": "YNAB is a huge help for my ADHD! It's hard to make money feel \"real\" sometimes with ADHD and plan for the future, and YNAB has helped me keep perspective and keep money feeling more real and give me a better reminder of consequences if I go off-budget. It's helped me weather some sudden financial changes and keep future bills in mind. I absolutely love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jarrett",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:54:04.000Z",
          "Titre": "Using YNAB has been one of the best…",
          "Contenu": "Using YNAB has been one of the best decisions I have made in years regarding my finances. Before YNAB i had absolutely zero clue how to budget and often tried to keep it all in my head. Simply looking at my account balance and trying to plan for the future did not cut it. YNAB instilled a philosophy around money that has led to me feeling the most confident about my budget I have ever felt. YNAB works, but it is an intentional tool in your daily routine and is well work the effort. Also, the program and apps work well with no complaints. The bread and butter is how YNAB forces you to face reality and not spend money you don't have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MM",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T20:15:43.000Z",
          "Titre": "Thank you YNAB for enriching my life! :)",
          "Contenu": "I have been using YNAB for a year now. While I used to loosely track my expenses with a spreadsheet, I quickly got used to the YNAB system and it's incredibly easy with the links to my bank accounts to track every penny I spend. I have significantly more money in the bank now than I did a year ago which I attribute to my ability to really see what I'm spending every month and to plan ahead better. At the beginning I found the YNAB tutorials useful and also found helpful videos online which got me fully up-to-speed quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mariee",
          "Nb_Reviews": 3,
          "Date": "2023-11-26T07:16:17.000Z",
          "Titre": "I don’t understand it, but it works!",
          "Contenu": "I’m not sure how it compares with any other programs, but it has done the trick. I don’t know how it all works exactly, but I’m getting ahead on managing my money after YEARS of struggling.  THANK YOU!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zach K",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T13:13:30.000Z",
          "Titre": "YNAB is the best mix of complex and simple",
          "Contenu": "YNAB is the best middle ground between complex and simple. It seems like every feature I need to be able to use when I have some kind of obstacle in my budget is handled already by a feature of YNAB. It’s always just a matter of learning it, and usually it’s intuitive enough I don’t need to look up a guide. The only criticism I have is the lack of ability to connect certain cards (my Kohl’s credit card, for example)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T13:43:05.000Z",
          "Titre": "The best approach to budgeting with the most reliable app",
          "Contenu": "Before YNAB I had always _tried_ to pay attention to money and make sure I was not spending too much. But YNAB is now the only way I can think about money and cash flow simply because it is so good.YNAB have built an _incredible_ app that as long as you stick to it could dig anyone out of the messiest financial situations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana Gonzalez",
          "Nb_Reviews": 7,
          "Date": "2023-11-04T16:29:40.000Z",
          "Titre": "Wiser with money thanks to this app",
          "Contenu": "Very easy to use. It has helped me to have real control over my expenses and to think more wisely regarding money allocation. The only thing I think it lacks is more freedom to do reports...existent reports are useful but I have liked to see other things and have needed to use excel instead."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T14:55:42.000Z",
          "Titre": "Support got back to me promptly and…",
          "Contenu": "Support got back to me promptly and they knew what the problem was . They also told me if their advice didn’t work to contact them again"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Carl",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T08:14:26.000Z",
          "Titre": "10/10 Would Recommend",
          "Contenu": "Life changing. Been using it for a year and a half. Savings skyrocketed, money management has improved, and I feel happier and more stable financially through the help of YNAB's software and educational resources. It's a lot to learn up front but if you stick through it, it's such a low maintenance service that works wonders. Helps me focus on more important things in life and not stress out about money regardless of my circumstance."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kendall",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T07:24:38.000Z",
          "Titre": "Obsessed with YNAB",
          "Contenu": "I am obsessed with YNAB in a similar way that I am obsessed with music. I have never before been able to keep money in my account beyond a two week period. Now I never have less than a few thousand, and I’ve only been using it for a year! It’s actually one of my favourite topics and I’ve rambled on about it to total strangers. I’ve got my mom, husband, and friends onboard because I am so passionate about it that they’ve had their interest peaked and subsequently their finances drastically changed for the better. I definitely fall under the category of a budget nerd and yes I do listen to the YNAB related podcasts. I never thought I would say that budgeting is one of my passions but here we are thanks to YNAB."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Cherie",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T06:15:40.000Z",
          "Titre": "Helpful in all ways",
          "Contenu": "Helpful in all ways. App works great. The “thinking” / philosophy behind it just makes your brain and emotions “get” what you are doing when you budget. I'm out of credit card debt! Forward on my mortgage and comfortable even with rising rates. AND I still get to go out, buy things, travel or splurge at Christmas."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "S Bakker",
          "Nb_Reviews": 9,
          "Date": "2023-12-01T11:48:57.000Z",
          "Titre": "Ynab is easy to use and fun",
          "Contenu": "Ynab is easy to use, and for all of us who have their money (finally) under control: a lot of fun to play with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T19:24:21.000Z",
          "Titre": "YNAB changed my whole money game!",
          "Contenu": "When I started YNAB a year ago, I knew I was in for some education. My finances were a MESS. I was living paycheck to paycheck and not achieving any goals. Once I started YNAB and using the budgeting method, I came to some hard realizations. I had to make some major adjustments, including entering a debt management plan for my high interest credit card. I am now for the first time EVER, making steady progress to pay down my debts and take control of my financing. I am so grateful for YNAB for showing me the way."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Jolene",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T20:27:41.000Z",
          "Titre": "Amazing Employees, Awesome Product",
          "Contenu": "The best thing about YNAB is their awesome customer service! Anytime I’ve had a question it’s been answered quickly, and the help they provide through videos and live Q&As is incredible! I’m a student who tried YNAB for a year free and it saved me way more than the subscription cost by getting me to rethink how I approached my budget and taking most of the work out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kent Munro",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T09:15:34.000Z",
          "Titre": "The best way to budget and save money",
          "Contenu": "YNAB  uses the cash envelope system.  Best way to understand your spending and cash flow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cara Wilmot",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T19:27:19.000Z",
          "Titre": "Makes Budgeting Easy",
          "Contenu": "Makes Budgeting EasyThis helps our family manage our budget together. It is easy to use the program on the computer or in the app. It helps us plan for short-term and long-term goals. I also manage my elderly father's budget. It is easy to toggle between the two budgets."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T14:35:20.000Z",
          "Titre": "Great tool!",
          "Contenu": "This app was originally a little bit tough to use. They have wonderful resources about getting started and how to use the platform but it’s also semi simple enough to feel like you don’t need them. Despite that, after getting the hang of it (and restarting maybe twice along the way) it turned out to be a huge help to managing my finances! It became easier the more I used it and helps me keep an eye on my spending."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana Williams",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T16:20:47.000Z",
          "Titre": "YNAB gives you financial clarity for a stress-free future",
          "Contenu": "I've tried many budget apps and methods but none provide the instant visibility and understanding of your financial posture like YNAB. I wish I would've stuck with it when I first had it in 2012. I would've had a nice retirement account by now. YNAB is a gamechanger."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toni",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T23:03:15.000Z",
          "Titre": "I'm rich!",
          "Contenu": "I've been able to organize and prioritize my spending in ways that other apps failed. I can setup spending and savings goals and plan accordingly.In the year that I've been using ynab, I'm 100% debt free and my net work, excluding retirement funds, tripled."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nostromo",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T18:05:55.000Z",
          "Titre": "YNAB changed my relationship with…",
          "Contenu": "YNAB changed my relationship with money. It helped me better understand where I was spending and reign in the chaos of reacting to my bills vs being proactive with my bills. I was able to build a plan and harness over 17k in debt. Now we just maintain and plot along."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T15:53:02.000Z",
          "Titre": "Budgeting that builds confidence",
          "Contenu": "I was able to see what I was doing wrong throughout my budgeting career, That all things can be prepared for when you know what job your dollars are doing. Very intuitive way to understand money and cash flow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristen",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T19:12:52.000Z",
          "Titre": "I love how customizable this platform…",
          "Contenu": "I love how customizable this platform is! I can tailor it to perfectly meet my needs and easily make changes along the way. I have better control managing my finances and greater peace of mind being able to track my saving and spending goals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "there",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T13:38:27.000Z",
          "Titre": "Great website!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Erica",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T10:20:09.000Z",
          "Titre": "I’m a visual learner",
          "Contenu": "I’m a visual learner, and seeing the YNAB bar graph change was a huge motivator to save money and pay down debt!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Geert",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T20:58:16.000Z",
          "Titre": "YNAB makes it fully transparent",
          "Contenu": "YNAB makes it fully transparent - glad to use it on a daily basis"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:09:44.000Z",
          "Titre": "Friends who are advocates",
          "Contenu": "Friends who are advocates. Blogs. Videos. Lots of helpful resources."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Sofia G",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T02:35:16.000Z",
          "Titre": "Never looking back",
          "Contenu": "I was used to organizing my expenses with the envelope system, but it got out of control the less cash I used. My boss recommended YNAB and I love it, once again I have control of where my money is, no matter how many accounts, cards or cash I have. Thank you YNAB team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily S.",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T12:15:05.000Z",
          "Titre": "I LOVE YNAB!!!",
          "Contenu": "I LOVE YNAB!!!! It's created such an easy, straightforward way for me to manage our family's household $, make legit plans, and feel so much confidence around money in general. Seriously, I'm a huge fan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Sprouse",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T05:35:10.000Z",
          "Titre": "YNAB is the best budgeting app/software…",
          "Contenu": "YNAB is the best budgeting app/software I’ve used. The consumer service is 2nd to none. Great value."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erik Dempsey",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T16:39:34.000Z",
          "Titre": "YNAB Removed my excuses for poor budget management",
          "Contenu": "YNAB makes managing my budget and my money easy! Period! The category groups, categories, reports, the integration with banks and credit cards to get transactions, and their support is polite and quick to respond. Plus, they teach you how to use the product and how to have a budget and why! Amazing!The mobile app is amazing! Having my accounts AND my budget in the palm of my hand is invaluable! I can be out and about and need to buy something and just grab phone to see what I have in that category and move things around if needed.I have tried a lot of different tools, including making my own, YNAB has been the best and easiest to learn and has all of the features I needed when it comes to managing my money. YNAB removed the excuses for me to not have a good budget and to not manage it well. Dang you YNAB! :) And also, Thank you YNAB!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T13:34:13.000Z",
          "Titre": "Accessible yet robust…",
          "Contenu": "I’ve tried several budgeting strategies but never stuck with anything until I tried YNAB. They do a great job balancing ease of use with some robust and nuanced features. On the days I don’t feel like diving in to my financial situation, I often smile when greeted by ‘I like big budgets and I cannot lie’ and other similar messages. It’s a relatively small thing but it makes it fun. The tutorials are super helpful when getting started. The basic tracking of income and expenses is very intuitive but I’ve found the asset and tracking capabilities to be super helpful for envisioning the future. The reports function is another great feature that I’ve found a great deal of benefit from. Keeping an eye on your ‘age of money’ over time has been a real eye opener for me. I will definitely be sticking with YNAB and highly recommend it to a lot of people trying to maximize their financial chops!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T14:10:19.000Z",
          "Titre": "My favorite app of all time",
          "Contenu": "My favorite app of all time. Don’t know what I would do without YNAB.  One of those priceless apps. The 99 I pay a year saves me thousands by budgeting smart. Well done YNAB"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Shelton",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T14:52:49.000Z",
          "Titre": "I’m loving it",
          "Contenu": "I’m loving it, I feel like I have so much more awareness.  Reach out to the military.  This would be an excellent option/training for young service members to learn how to build budgets and spending plans early in their careers."
        }
      ]
    }
  ]
}