{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "4kdownload.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "ID",
          "Pseudo": "Vianney Tedjamulia",
          "Nb_Reviews": 1,
          "Date": "2023-12-25T12:21:41.000Z",
          "Titre": "Can't download.",
          "Contenu": "Actually, the program is good, or even one of the best youtube downloader. But why its always d**n difficult to download or update this. I already tried it on different PC and different networks. Always stuck between 1-2 Mb download. Repair this plz. The good program will be useless if no one can'tdownload or update it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "SK MAVANI",
          "Nb_Reviews": 7,
          "Date": "2024-01-04T02:49:00.000Z",
          "Titre": "Scammers avoid at any cost...",
          "Contenu": "It's not a lifetime license. They are scammers and manipulating people by saying as lifetime license. I have told my detailed experience below. So only buy the software if you are millionaire man and don't care about your money anymore. This is not a home made story I have all email conversations as a proof which I can provide to anyone in future if needed.bought the personal license for lifetime for 3 computers before few time.At first it was giving very slow speed and I complained for that as well and they said they are working on it but nothing changed ever.But the main part comes then. My computer got upgrade from windows 10 pro to windows 11 pro. And the program logged out automatically. I entered the activation keys again but due to some reason that didn't worked so I created a new user on my computer and tried there. And somehow I could login to account.After sometime the software got logged out again automatically and my key didn't worked by giving error that you are already using this license on 3 pc already. I contacted customer support and explained all in details. One lady named Olivia responded me very rudely saying that she don't care about what happened but the only thing she was  oncerned was that I entered key 3 times. I asked her to confirm on her end that there is not a single license running under the activation key she provided and I had to enter key 3 times on my same system because of their faulty software which was full of errors and I couldn't use the license properly in past as well because of that error. And she straight away declined my valid reason and sent me link to buy their license again. That's a big shame one them...Really they do only care is about money and once you buy their software you will be surely helpless because of their faulty software.Honestly saying i had very bad experience with them so I warn each and every one about it and please do think 1000 times before you buy a single penny thing from them..."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "A. Lieven",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:59:22.000Z",
          "Titre": "Buggy Updates and Scammy performance",
          "Contenu": "It was bad enough when the free version of the audio program got cut in half from 30 to 15. But, today, it tells me I've hit the limit at ELEVEN. And, right before that, trying to upload the url for one video to download, that normally got one the box to choose between one and all, got me a spam box to sell an upgrade. Well, since you're not working properly, and cheating us by stopping at 11 rather than 15, why would I offer up a plugged nickel after such crappy performance ?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Deutsch",
          "Nb_Reviews": 1,
          "Date": "2023-12-31T19:54:15.000Z",
          "Titre": "I have the Professional License but…",
          "Contenu": "I have the Professional License but most of the videos I try to download never complete and I get an error message."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Young",
          "Nb_Reviews": 5,
          "Date": "2023-12-21T15:56:42.000Z",
          "Titre": "I used to rate it 5 stars now there's advertising in my paid version touting their new version at an additional fee.",
          "Contenu": "I used to rate it 5 stars now my paid version is advertising for their new and improved version at an additional fee.  A one time ad would be ok but it's been a dozen or more times.  I'm happy with the lifetime version I already paid for so please stop pestering me to spend more money that I don't have."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark Elmy",
          "Nb_Reviews": 5,
          "Date": "2023-12-24T23:44:29.000Z",
          "Titre": "Awful interface",
          "Contenu": "the interface on the android version is awful. cannot pause. delete, reload etc. windows version is fine so why not do the same on android"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Leah",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T13:44:02.000Z",
          "Titre": "I used to love this app",
          "Contenu": "I used to love this app and paid for the full version a few years ago. Since they've changed to a new '+' version, none of my videos will download. I've tried to update the software but it only lets me download the '+' version and not the one I have paid for. I refuse to pay for an app that I've already paid for when it was a lifetime access. Feel like I've been scammed"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Hiroo Homes",
          "Nb_Reviews": 1,
          "Date": "2023-12-26T12:58:56.000Z",
          "Titre": "My account was suspended after I used…",
          "Contenu": "My account was suspended after I used this application on Instagram to download photos and videos of my idols. How do you take responsibility?"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "RogueSpirit",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T00:40:24.000Z",
          "Titre": "WHY provide a .deb file for…",
          "Contenu": "WHY provide a .deb file for installation on linux??????Manjaro doesnt support that type of install file.It would be much easier with the standard file type for linux or even on snap or put it up on the repositories"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ronald Marks",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T21:37:51.000Z",
          "Titre": "I purchased the Oppenheimer movie from…",
          "Contenu": "I purchased the Oppenheimer movie from YouTube and downloaded it into 4K Download, no problem. I set it for video MP4 format at 720p and when I played it, at first I thought it worked, since the opening spinning globe displayed well. However, the movie itself did not display at all except as a digital hash. Disappointed."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Ronald Sethoga",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T11:12:30.000Z",
          "Titre": "This new software(4k+) makes no sense…",
          "Contenu": "This new software(4k+) makes no sense at all. it is completely unreliable. It downloads a playlist on youtube and it says download complete, and when I check most videos it downloaded says they are 0kb in size and are unplayable. My very best recommendation is to stop using this software completely and look for alternatives like J-Downloader which are much much more reliable and free than this one. I bought 2 licenses for 4k downloader hoping that these issues will eventually get resolved but it is clear that the 4k downloader internal team does not use their products because if they did, they will understand that it has alot of bugs and as a result fix them."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Roger Spencer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T21:27:10.000Z",
          "Titre": "terrible and no longer user friendly",
          "Contenu": "This \"new updated\" 4k+ version is a nightmare compared to the original one. previously it would download quickly. now even a small, low res file takes forever, and the worst part of all is that it frequently crashes / closes down, either during the download version or immediately once the file has completed downloading and \"converting\".The original version was so much better. If this was meant to \"improve\" the package - then you have failed. miserably. Sometimes its better to leave things as they were. a good package has now become unusable and i'm looking for more reliable downloaders because this one isnt anymore"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Ivan Jurisic",
          "Nb_Reviews": 5,
          "Date": "2023-11-01T09:09:06.000Z",
          "Titre": "I bought a license and the app stopped…",
          "Contenu": "I bought a license and the app stopped working twice, I had to go through 5 step process and trying to find a solution with uninstalling, installing, re-entering my license. At this point, there is no added value compared to a web browser, as the main reason I paid for it, was to save some time. I requested a refund due to constant issues, but they declined, even when I bought the license only 2 months agoEdit: to reply to your message. You \"fixing\" the issue is me having to take huge amount of screenshots, then do a 5 step process that takes 15 minutes. If it happens once, it's okay. But it happening every 4th time while using the app is not acceptable. Alternative of using web browser is quicker. I'm here just to save time."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Amr",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T19:53:28.000Z",
          "Titre": "Very limited on a licensed version",
          "Contenu": "New versions come all the time, became worse recently, downloads are limited to 100 post, then you have to manually start over, there is no misunderstanding, the developers for months fail to find a way around instagram authentications, will not renew.. useless now.Avoid this software."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Ed Bakker",
          "Nb_Reviews": 3,
          "Date": "2023-11-19T17:36:13.000Z",
          "Titre": "Upgrades are (only) payable and stutter!",
          "Contenu": "I bought the VideoDownLoader version 3; worked without hassle. Today 19th november; announcement of new version.Do not need it, I thought, I have the version 3; try to past a Youtube link; error; 'url cannot be parsed! Pass on the url to our support so we can process it'. Me, stupid enough, I upgrade to the \"3+\"version; there this same link can be parsed without problems! .. Downloaded video; it stutters [only vido, not audio]. I can not resize the image, after plenty effort I can resize in 1 standard format... I had bought the 'simple 3 version while ago working flawlessly; now url's get blocked or something so they can only be downloaded with the '+'version? ... I tried clicking the 'Contact' link to contact you guys; NOT working; the option next to it 'Leave review' DOES work; so I cannot contact you guys and have to show my dissatisfaction in the 'Review'?? .. Odd company / mindset you guys have. One buys a version, and afterwards you add a '+' sign and customers can pay once more. What is next? You (only) add 'Pro' and customers can pay once more??? .. Even date of experience here on the page does NOT work; can only fill in 12 instead of 19th november! .... My gosh...."
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Alexander Majer-Wendelstein",
          "Nb_Reviews": 360,
          "Date": "2023-12-01T13:10:12.000Z",
          "Titre": "Ich wollte das Programm 4K Video…",
          "Contenu": "Ich wollte das Programm 4K Video Downloader kaufen, aber das funktionierte nicht. Man kann nur mit Kreditkarte, Klarna, Giropay etc. dafür bezahlen. Ich habe aber keine Kreditkarte und auch kein Online-Banking. Die einzige Möglichkeit für mich, für die Software zu zahlen, wäre Prepayment (Vorrauszahlung) Als ich das dem Support mitteilte, wurde nicht darauf reagiert. Statt dessen erhielt ich den Bescheid, ich könne ja auch die kostenlose Version nutzen, was ich auch tue. Für mich ist das ein seltsamer Laden, der nicht imstande ist, seine Bankdaten herüberzureichen und das wahrscheinlich auch gar nicht will. Also verdient die Firma kein Geld an mir und es scheint ihnen völlig egal zu sein. Über die Software kann ich mich nicht beschweren. Sie ist gut. Aber was die Bezahlung angeht, ist das eine rückständige Firma, die einem die Bezahlmethoden aufs Auge drückt. So komme ich nicht umhin, nur einen Stern zu vergeben.Edit: All my relatives are dead and my friends are few. I wouldn't know who to ask. I bought the Macrium Reflect software for € 66 and it was no problem to pay by prepayment. Why is that not possible with you? I also bought the Pro version of the PrivaZer program for € 30 and here too there were no problems with prepayment. Only you don't have that and that's an indictment. I understand that adding a new payment method is a bit complicated, so you should get on with it as soon as possible and put it into practice. You must have a bank account. And spare me your annoying advertising (Black Friday, for example) I can only see that you don't want to do business and you're leaving me out in the cold. That can't be right. Goodbye.PPS: I gave you an answer and I don´t have to say anything more about it. One star is enough for you."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "ingrid",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T13:49:28.000Z",
          "Titre": "What I bought doesn't work",
          "Contenu": "I bought a Lite a while ago and it worked fine, now I personally bought it last week and it does nothing at all, I no longer have a Lite at all, the key I received does not work either, as soon as I enter that key it goes I go to the purchase page that I can buy again, I hope you can help me. Kind regards, Ingrid"
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Пакет Конфет",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T16:06:12.000Z",
          "Titre": "Scam and spam.",
          "Contenu": "DO NOT BUY!!! USE FREE OPENSOURCE ALTERNATIVES!!!Scam and spam.Spamming on email and desktop with popups.They asking to buy \"new\" app, which I already bought.And asking every day. They deleting reviews, posts on reddit. Rude answers from support.Update: 2023 nov 29Another mass spam on emails.Another lie from support \"you can unsubscribe\".How many times I must \"unsubscribe\" from your spam.As you can see, developers/support just ****. They now gaslighting me!!! Such shame and hypocricity!!! They banned all who writing bad reviews, asks refund, ask unsubcribe from spam. They deleting post on reddit. I have screenshots to prove that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T03:21:20.000Z",
          "Titre": "Does not download 4K YouTube videos.",
          "Contenu": "I purchased this software for the express reason of downloading 4K videos from YouTube.It does not allow me to the select the 4K version (it does not even show up)."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Marc White!",
          "Nb_Reviews": 13,
          "Date": "2023-09-12T17:05:15.000Z",
          "Titre": "4K Downloader Bundle is a total waste of money.",
          "Contenu": "I paid $100 AUD for the Pro Bundle and have been ripped off. The activation key for 4k Downloader does not work, after trying to activate it for nearly 24 hours now. This is a criminal company. I feel disgusted and so disappointed. I have no way of getting my money back or activating the programs I paid for in this complete waste of money bundle. This company cannot be trusted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 4,
          "Date": "2023-08-14T09:26:15.000Z",
          "Titre": "Scummy limits in fine print",
          "Contenu": "Scummy. They lie on the sales page about limiting you to just 3 activations. I’ve changed computers five times over several years since I first purchased it. That means I have to buy ANOTHER license to continue using in my newest MacBook.Don’t trust this company!"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Oskar",
          "Nb_Reviews": 8,
          "Date": "2023-10-28T11:48:33.000Z",
          "Titre": "It's a shame",
          "Contenu": "It's a shame. A program that worked perfectly. They launch the Video Downloader + version which in theory was going to be better, I bought it and everything stops working. I feel cheated, nothing works anymore, neither the old nor the new. Money thrown away."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Purton, Sound Right",
          "Nb_Reviews": 11,
          "Date": "2023-08-10T14:41:36.000Z",
          "Titre": "Sadly this company prefers to keep your…",
          "Contenu": "Sadly this company prefers to keep your money.Enjoyed the features of 4k downloader on Win 7...installed latest version on Win 10 and it failed to record video...I de-activated and uninstalled. Asked for a refund within 24 hours. Basically they don't and steal your money!Stay away...there are other programmes."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "GibSn",
          "Nb_Reviews": 1,
          "Date": "2023-12-28T03:05:02.000Z",
          "Titre": "they said u can download private…",
          "Contenu": "they said u can download private videos, you can't"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David Dooley",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T23:09:09.000Z",
          "Titre": "4K Stogram doesn't work any more and 4K Downloader",
          "Contenu": "So far 4K Stogram doesn't work any more, after downloading a couple of pictures i get logged out. Currently my account is banned for breach of instagram policiesAs I'm not allowed to review a second product, i'll have to do it here. the 4K Downloader refuses to download probably 10 to 15% of the videos i want to download with a \"Unknown internal error\" message. and theres no support for these programs. You pay you money and you on your own when it all goes tits up. this softwear is going down hill so fast, It used to work but seams to be more trouble that its worth"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard, Belgravia",
          "Nb_Reviews": 13,
          "Date": "2023-04-30T16:05:22.000Z",
          "Titre": "4K Download: Completely useless.",
          "Contenu": "Completely useless.  Downloaded the app and entered a Youtube link.  Response was \"cannot parse this link\".  Tried several other Youtube sites including some that have no need to protect their copyright but answer always the same.Only thing I can think of is the home screen says \"not activated\". If I try to activate it brings up the Premium Options screen which I don't want because I WANT THE FREE VERSION."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracy Boggs",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T09:08:15.000Z",
          "Titre": "4K Downloader has severe activation…",
          "Contenu": "4K Downloader has severe activation issues. No help from tech support. Will not recommend to anyone in the pc space. Would not refund my purchase price. Software activation database seems to be broken."
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "Kamsani",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T20:25:21.000Z",
          "Titre": "Unable to download 4K videos",
          "Contenu": "I have been using the old version of the free basic 4K Video Downloader since the end of 2022/early 2023 and had no problems with downloading 4K videos from YouTube channel.However, recently I was no longer able to download any 4K videos. I then installed the latest version of 4K Video Downloader Plus but I still failed to download any 4K videos. What shall I do now?Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jaquess Schitt",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T17:26:28.000Z",
          "Titre": "4K video Downloader quit working after installing the latest update",
          "Contenu": "I paid for the Professional version and am happy with it.Now, 4K video Downloader quit working after installing the latest update. It won't even open.Is this some kind of ploy to force users to upgrade to the newest version"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "YAGHLEKDJIAN ROGER",
          "Nb_Reviews": 5,
          "Date": "2023-10-28T09:59:46.000Z",
          "Titre": "impossible d\"enregistrer",
          "Contenu": "impossible d\"enregistrer. me dit  'trop vielle video ' pourtant je suis en train de visionner la video.allez comprendre ?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Klaak",
          "Nb_Reviews": 4,
          "Date": "2023-09-11T11:17:12.000Z",
          "Titre": "Keeps saying \"Video no longer available\" but it is",
          "Contenu": "I just finished installing 4k Download and activating my license after purchasing the Bundle package.I then immediately went to the Twitch video that I wanted to download, but the app keeps telling me, \"Video is no longer available\", even though I'm literally able to watch the video right there in the 4k Download app. The video is on a subscription only Twitch channel, but I'm logged in to my Twitch account through the 4k Download app (Windows on PC), and I'm subscribed to that channel.My primary reason for purchasing this was specifically so I could download videos from Twitch, so that I can watch them without constantly having the video pause to wait for the Twitch stream to buffer.I will happily update this review to 5 stars if you can provide me with a solution to make this work."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Analbumparty",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T20:58:46.000Z",
          "Titre": "Don't buy",
          "Contenu": "They deleted the old version of 4kdownload that I paid £13 for and are now charging £20 to buy 4kdownload+ with seemingly no extra features just to get more money. They don't let you use your old license key."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Lineback",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T04:07:50.000Z",
          "Titre": "Misleading advertising",
          "Contenu": "Misleading advertising, their \"lifetime\" licenses don't actually last a lifetime, only as long as you don't upgrade/replace/switch your PC 3 times. Due to their technical limitations they cannot reassign the license to your new device.Edit: My response to their response: it's also misleading to say you can activate the license on up to 3 computers, it can just be one computer, but the second you modify or change that machine 3 times, that key is wasted and cannot be recovered. Typically software licenses are detached from a device on request if that machine changes over time or if the machine is broken and no longer accessible. So buying this license entitles you to 3 total activations, not necessarilly concurrently, but in total."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brooke B",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T19:52:57.000Z",
          "Titre": "Can’t seem to download anything even…",
          "Contenu": "Can’t seem to download anything even after purchasing the application! I just keep getting an error message. Does it matter what quality a video that I choose. Not choosing anything with age restricted content, etc. Just a few nature videos."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Scott",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T14:01:35.000Z",
          "Titre": "Would not use this program at all.",
          "Contenu": "I tried this product and when I tried is on the free download I could not do anything.  Everything I press said xxx xxxx is unavailable on the current plan.  Do you want to upgrade.  After I upgraded to the Personal Version I got the same messages.  I asked for a refund less than an hour after I purchased it and the came back with wanting me to help them debug it and refused the refund.  I dislike companies like this that keep pumping you to pay more using these methods.  I used VLR, it worked perfect, has more features, and is truly free.The additional messages from 4k Downloader regarding this post are misleading.  We corresponded over several emails.  I finally told them in that correspondence that I was tired of their replies and to forget the refund before I posted this review."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "kim v",
          "Nb_Reviews": 17,
          "Date": "2023-07-24T15:14:32.000Z",
          "Titre": "cannot recommend buying this program",
          "Contenu": "cannot recommend buying this program, I have reinstalled my PC os 3 times and now my key cannot be used anymore, it is never being used by others support wont help my DONT buy this appsi have only reinstall OS, on my pc never on new computers but support team keep say i have activated three computers this is not true"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Brian Søndergaard Hansen",
          "Nb_Reviews": 7,
          "Date": "2023-03-25T23:43:25.000Z",
          "Titre": "Not 4k in mp4 format!!!!",
          "Contenu": "I had bought this program in the belief that I could download content from youtube in 4k in mp4 format, as both text and an image indicate on the page.This was not the case and therefore the program was not suitable for my use and I therefore wanted to be refunded my amount for the complete pro package.This denies 4k Download.I find this reprehensible when the company is called 4k Download and the even shows a picture with this feature on their homepage!!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T03:35:00.000Z",
          "Titre": "Double Payment Charged",
          "Contenu": "Hi, I bought 1 year subscription of 4K Downloader  and charged me twice.First I tried to buy through GPay but your site should me an error.Then I tried to buy using PayPal and transaction was successfully.But my credit cards is showing two payment of US $ 15. 00 paid to your company"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Tokyo Okada",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T03:09:47.000Z",
          "Titre": "Upgrade is down grade",
          "Contenu": "I use 4K Downloader for free for 1 year. Thank you. Very happy using this software until Dec 25th. After I paid 1700 JPY to upgrade 10 days ago, even the same Youtube videos that I was able to download before did not download with a red font error alert. Since then I have been using Clip Coverter, Dirpy and Offriberity for free. It seems that I am paying to disable 4K Video Downloader forever."
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Тимур Т",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T21:41:32.000Z",
          "Titre": "I purchased a license for this product",
          "Contenu": "I purchased a license for this product. After entering the key, the message “IT IS NOT POSSIBLE TO ACTIVATE” is displayed. It is not possible to contact technical support."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2024-01-02T13:00:47.000Z",
          "Titre": "one of the worst app",
          "Contenu": "one of the worst app. waste of money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annacolleen Etters",
          "Nb_Reviews": 3,
          "Date": "2023-09-29T08:26:13.000Z",
          "Titre": "I was called a liar",
          "Contenu": "I was called a liar, or just as much. I bought in to 4k, about 3 years ago. I have had 3 pc's (the 3rd, just given to me for my 67th bday) I am in pain 24/7 and live far away from the city, so get spotty internet from my phone.. I copy things to watch when my internet goes out. Now Olivia tells me I have installed the app on more pcs. I know how many pc's I have had. I just installed this maybe 2 weeks ago. all my apps disappeared a few days ago, and I am trying to reinstall, and Olivia is calling me a liar, for having installed on more pcs! They say it's the last downloader I would need. What terrible people. Wonder if they treat their grannies so badly...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ex-Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T11:24:30.000Z",
          "Titre": "They will try to slip things past you.",
          "Contenu": "It works wonderfully.The company has a new product that has a name that is one character different than their old product.  The \"update\" button defaults to downloading this different product.  If you want to update the product you have already paid for, you need to hunt for the update.As well, the whole time you are using the old product, it periodically pops up ads for their new product, and there is no way to tell it to stop.The company has decided to change business models to the most scammy and misleading model it could come up with.  They are clearly no longer to be trusted at all.Update: The old product is still updated, but the update link takes you directly to the new product with the intentionally similar name.  This is intentionally misleading, with the goal of having users fail to notice the difference until after the new program is installed.Either change the name of the new program to avoid confusion or have the update link in the old program go to the update for the old program.  Anything else is working very hard to skirt the edges of fraud."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "emil clim",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T11:41:59.000Z",
          "Titre": "I bought 1 year access but they didn't…",
          "Contenu": "I bought 1 year access but they didn't gave me any license number so I can't have any access ! I've sent 3 mails to support but still no answer ... I think it's a scam now ... just don't buy anything ! I think if I'll have no answer for the next 2-3 hours , I'll go to the postal police with the recipe I've got from my bank !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "gait wtg",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T03:53:40.000Z",
          "Titre": "I can usually watch a youtube video in…",
          "Contenu": "I can usually watch a youtube video in real time. Sometimes it takes 4k downloader ten times that long to download the same video. Why???"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Paid user",
          "Nb_Reviews": 3,
          "Date": "2023-07-24T16:27:17.000Z",
          "Titre": "Can't open app at all",
          "Contenu": "Can't open app at all, seems to happen after a free update falsely was provided, after installing a paid link for upgrading was provided."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S Russo",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T20:27:55.000Z",
          "Titre": "This new version is absolute junk",
          "Contenu": "This new version is absolute junk. The old version was WAY easier to navigate. Who ever put this junk of an app together should be fired."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T05:06:08.000Z",
          "Titre": "They will never refund",
          "Contenu": "They will never refund your money. The software is full of nonsense. They claim that 30 days money back but when you ask them, they will give you a link with a long explanation where you are literally not allowed to take the refund."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Garry Frost",
          "Nb_Reviews": 71,
          "Date": "2023-08-12T01:48:02.000Z",
          "Titre": "Downloaded and purchased a key for 4k…",
          "Contenu": "Downloaded and purchased a key for 4k video downloader, had to reset my PC so it removed the 4k video downloader, tried to download it again but it seems you can't download 4k video downloader anymore, you have to download 4k video downloader plus, and guess what, your 4k video downloader key won't work, it just tells you you need to pay extra, complete rip off! I don't want 4k video downlaoder plus, I just wan't the bloody software I paid for which more than suited my needs!"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T07:58:37.000Z",
          "Titre": "I bought a software package",
          "Contenu": "I bought a software package, it was necessary to work with TikTok, it does not work. I've been waiting for a response for two weeks now. Why sell something that doesn't work?"
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Alexandr Melnik",
          "Nb_Reviews": 3,
          "Date": "2023-08-26T20:21:12.000Z",
          "Titre": "Says you can download 200 items per day…",
          "Contenu": "Says you can download 200 items per day FREE, on 1st day you can download 100, and after that 'the limit has been reached' and you can download 0. Scam marketing, 0 stars."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Mohammadreza",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T01:20:40.000Z",
          "Titre": "A Major Software Problem",
          "Contenu": "No matter what I try to connect to my Instagram account by 4K Stogram software \"with VPN\", it does not work.I followed your instructions [1-2], but it did not help.References:1. troubleshooting/troubleshooting-howto-fix-connection-issues/12. troubleshooting/troubleshooting-howto-fix-too-many-requests-error/1Kind regards,"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Salvador Herbella",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T19:45:31.000Z",
          "Titre": "A month ago I bought the suscription to…",
          "Contenu": "A month ago I bought the suscription to be updated, and again this month also asked me ti renew suscription, and I did it.Now I cannot download music. I want mu money back"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Vitor Kovalski",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T06:52:15.000Z",
          "Titre": "TOTAL DISAPPOINTMENT",
          "Contenu": "I purchased the 4k video download software, Lifetime License, for use on up to 3 devices on 05/27/2023. When downloading constant errors and failures occur, almost in all videos on youtube, and it does not finish the downloads in most videos. Since the free version, which I used previously, worked perfectly on both computers. (In the same ones that are now in use in the paid version). I thought that there was some misconfiguration in the computers and I did the formatting process, but without success in correcting the problem in the downloads. After uninstalling and reinstalling the 4k software, it no longer activates on the computer. I contacted 4k support and was disappointed with the service when they told me that there are more than 3 activations on 2 SINGLE devices and because of this it can no longer be activated. When I completed the purchase of the product, I received an email with the confirmation of the purchase saying: You have successfully unlocked all features of 4k Video Download. LIFETIME LICENSE. license key number LASTS FOR LIFE AND CAN BE ACTIVATED ON UP TO 3 different devices.                          THEREFORE: IF THE PROGRAM WAS PURCHASED WITH A LIFETIME LICENSE AND IT IS INTENDED FOR 3 DEVICES, IT DOESN'T MATTER HOW MANY TIMES THEY ARE REINSTALLED ON THREE MACHINES. Unfortunate. HERE'S THE ALERT."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "Jae Yu",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T14:28:41.000Z",
          "Titre": "too many upgrade reminder popup alerts",
          "Contenu": "You show too many upgrade reminder popup alerts to the paid personal user. Its annoying!"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Pedro Ribeiro",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T21:39:23.000Z",
          "Titre": "I do not recommend",
          "Contenu": "Good afternoon, I do not recommend.Unfortunately I bought it with a lack of information, on the mobile site for iphone I didn't see details of the application, so I thought it was a simple download application, but no, it has download limits, something that didn't appear to me at any time until I bought it.In other words, I bought it thinking that I had unlimited simultaneous downloads, and apparently I have a limit of 3.I got in touch by email and I've already exchanged 28 emails asking for a refund because I'm completely dissatisfied with the application, in addition to the fact that the application doesn't let me download more than 3 videos at the same time.By e-mail it seems that they respond in a stupid way and make fun of me, they weren't polite or anything, and it seems that they pretend they don't understand.I do not recommend"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T13:14:58.000Z",
          "Titre": "I thought I would be able to download…",
          "Contenu": "I thought I would be able to download You Tube on my plan, but not so.\"Subscriptions addition is unavailable on the current plan.\""
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Stephen",
          "Nb_Reviews": 15,
          "Date": "2023-08-15T14:43:21.000Z",
          "Titre": "This program does not work at all",
          "Contenu": "This program does not work at all. It just keeps showing me an error \"Can't Parse This Link\"I think it just wants to get my YouTube login details.Avoid!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cody",
          "Nb_Reviews": 3,
          "Date": "2022-10-05T17:54:29.000Z",
          "Titre": "Reviews are Fake / Owner ducks cows",
          "Contenu": "Reviews are Fake! This piece of shlit product doesn’t work. The criminals you bought it from are profiting from false advertising. YOU CANNOT DOWNLOAD IN 4K.Ever the name of the product is fake. Duck these fools"
        },
        {
          "Note": 1,
          "Lieu": "CN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T17:12:32.000Z",
          "Titre": "The software still cannot be used in a…",
          "Contenu": "The software still cannot be used in a normal VPN environment, but you have no response to your request for a refund"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Alderman Abramson",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T09:06:25.000Z",
          "Titre": "Do not buy from this company",
          "Contenu": "Do not buy from this company. Their 4K Tokkit Lite product is not just bad quality. Their CRM is horrendous and drags you into endless conversations creating obstacles to a USD 11 reimbursement, when they can actually check that the product has been uninstalled and used for just a few minutes with VERY POOR RESULTS. Terrible Watermark removal. It does not do the trick. A big disappointment.Buying a product, installing it, trying it takes commitment and time. Immediately that you made a mistake brings disappointment and frustration. Engaging with CRM asking for a simple refund that leads to a long chain of e-mails in which they ask you for a chance to solve your issue and threaten you not to be reimbursed is simply UNACCEPTABLE.IT IS THE RIGHT of any consumer to retract based on one's own judgement. The consumer should not be forced or threatened to engage in additional time consuming exchanges questioning his competence or  reimbursement request. If a consumer judges a product is POOR QUALITY, this is the consumer's right and opinion, and the consumer should given credit, instead of being taken on a ride cannibalising more of his time.The consumer should not be WRONGLY and FALLACIOUSLY  led to believe that the policy of the company the product was bought from is BEYOND COMMON LAW and COMPELS HIM to engage in additional exchanges and justifications for a reimbursement to occur.I wasted my money, I wasted my time, I was taken on a ride for USD 11. This company is a perfect example of manipulation and deceit. It happens every day to a lot of people, and this is why Trustpilot exist.And what can I expect from them now?You've got it: WASTING MORE OF MY TIME writing this, sharing screen, justifying myself, etc.Will I be compensated for my contribution? Of course not, at best, if I am lucky, I will get my money back. BACK TO ZERO, this is what you win buying from the wrong people. Buy only from companies that have a \"MONEY BACK GUARANTEED. NO QUESTIONS ASKED\" business ethics.If you don't DO THIS or THAT or THIS, we cannot reimburse you. No, of course, that's not a threat, that's just a \"CONDITION\". I do NOTHING MORE FOR YOU unless you pay me. Is that clear?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T11:10:27.000Z",
          "Titre": "I paid for the full version and was…",
          "Contenu": "I paid for the full version and was sent to an error page, I was charged but never got my license code, DO NOT PAY FOR PREMIUM."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T14:06:14.000Z",
          "Titre": "Man I wish these programs worked better",
          "Contenu": "All the programs in the bundle (except for 4K YouTube to mp3) have scrambled text/corrupted looking to where I literally can’t read it. *edit* Sometimes it can be read and sometimes can’t, usually exploring the GUI menus makes it scrambled again. I changed the language from system to English, updated my computer like instructed. Still happens and support basically told me to get a newer computer (on OSX Big Sur, I can’t update because of compatibility issues moving forward but they should be able to have an alternative GUI where the text is at least legible, I’ve had other programs do just that). Seems like a fault of the programming to me, but at the end of the day all I know is I can’t read anything (which includes error messages to trouble shoot when contacting support).Edit* I originally thought Tokkit stopped downloading at the 715th video but it saves the ‘likes’ rather than the ‘saves’ which was my mistake. I added a star back to my review because I saw an issue that wasn’t an issue.I was able to download all the Instagram videos I was trying to however— you can’t save the specific collections so it’s kind of a mess. I also can’t search the uploads by uploader which would help me reverse engineer my groups by hand— I can search the caption text under it but not all posts will have that. I value the software  enough to keep the program and I hope they are able to or willing to find solutions for the things I mentioned but not necessarily feeling happy with my purchase.Edit*1. You should be able to find my messages with support, it was only a day or two ago.2. The fact that Big Sur (a relatively recent OSX version) isn’t supported— and the answer to that ISN’T to find a way to support it in the GUI like most software does, but instead for me to have an additional computer with an OSX that is newer than Big Sur is really silly (Big Sur literally came out only 3 years ago). Also it assumes I have two computers.3. I’m aware collections aren’t a feature— I was saying they should be considered (although I don’t know how possible that is) but without it the downloads folder currently is just a mess without some form of organization. I suggested an alternative that should be fairly easy is to include the Instagram user in the downloaded video metadata or title itself.Edit 2*1. Updating their OS …”helped” them… while potentially risking incompatibility with every other program on their system just so they could …read some text? Do you see the issue with that solution?2. I overlooked this before but the ‘saved collections’ feature …while isn’t explicitly stated… it IS heavily implied that the program can save collections. Please consider the impression this page gives. It reads…“Download Instagram Saved Posts and Saved Collections on Desktop in Bulk”And goes on to give steps to do that with 4K Stogram but leaves it very easy to confuse the reader into thinking they can download specific collections in bulk.4kdownload (dot) com/blog/2022/10/31/download-saved-posts-from-instagram--1/Edit 3*It’s up to me to update my OS which is rather recent for a solution that may help… that’s silly. I have made the points I think worth making, I’ll change my rating if future updates answer these issues in some significant way."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T21:11:35.000Z",
          "Titre": "The software keep giving me an error…",
          "Contenu": "The software keep giving me an error and doesn't download my videos"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Suresh Chand Choudhary",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T05:22:35.000Z",
          "Titre": "your service is not proper ,lose of…",
          "Contenu": "your service is not proper ,lose of deta is your fasion.please do not cheat the costumor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Owen Friend",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T19:02:29.000Z",
          "Titre": "DO NOT BUY NOT WORTH THE MONEY",
          "Contenu": "update kicked me out absolutely not worth the money do not buy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customeLou Kosmar",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T19:17:57.000Z",
          "Titre": "I lost all of my previous downloads and…",
          "Contenu": "I lost all of my previous downloads and really very unhappy about it!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Caleb Jelley",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T05:47:32.000Z",
          "Titre": "The new version of the app is not the…",
          "Contenu": "The new version of the app is not the same I liked the old version better 😭"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T22:06:59.000Z",
          "Titre": "The key did not work",
          "Contenu": "The key did not work. Kind of disappointed."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Banti Kumar",
          "Nb_Reviews": 3,
          "Date": "2023-07-14T07:08:01.000Z",
          "Titre": "A Frustrating Encounter with 4K Download (4kdownload.com)",
          "Contenu": "My recent experience with 4K Download (4kdownload.com) left me thoroughly disappointed and frustrated. This platform, which claims to provide efficient and high-quality downloads, failed to live up to even the most basic expectations, making it difficult for me to recommend it to anyone.First and foremost, the user interface of 4K Download was far from user-friendly. Navigating the website was a cumbersome task, with cluttered menus and confusing options. It was a struggle to find the desired features or understand how to utilize them effectively. The lack of intuitive design only added to the frustration of using the platform.Furthermore, the performance of 4K Download was incredibly unreliable. Despite promises of fast and efficient downloads, I encountered numerous issues throughout my usage. The software frequently crashed, froze, or experienced inexplicable errors, disrupting the download process and wasting my time. These technical glitches made it difficult to complete even the simplest tasks, undermining the very purpose of the platform.The customer support provided by 4K Download was equally disappointing. When I encountered problems and reached out for assistance, the response was slow and unhelpful. The support team seemed indifferent to my concerns and provided generic, automated replies that did little to address my specific issues. It was evident that customer satisfaction was not a priority for them.Moreover, the free version of 4K Download was severely limited in its capabilities. While the platform advertises itself as a free tool, it fails to mention that many essential features are locked behind a paywall. This lack of transparency is deceptive and misleading, leaving users feeling cheated and frustrated. The pricing structure for the premium version also seemed excessive, especially considering the subpar performance and lack of reliable customer support.In terms of security, 4K Download raised serious concerns. Given the nature of downloading files from various sources, I expected robust measures to protect my computer from malware or malicious content. Unfortunately, the platform provided little assurance in this regard, leaving me unsure about the safety of the files I downloaded.Overall, my experience with 4K Download was a complete letdown. The confusing user interface, unreliable performance, unhelpful customer support, limited free version, and questionable security practices all contribute to my negative review. I strongly urge others to explore alternative options for downloading software, videos, and other content, as 4K Download fails to deliver on its promises of efficiency and quality."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cody",
          "Nb_Reviews": 3,
          "Date": "2022-09-21T15:22:41.000Z",
          "Titre": "‼️ SCAM ‼️",
          "Contenu": "‼️ SCAM ‼️If you buy the 4k downloader. Don't expect it to work. You cannot download anything over 1080p. The company will make you jump through hoops to get your money back. I still haven't gotten mine back. Do not buy their products - ‼️ SCAM ‼️"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Anonymus",
          "Nb_Reviews": 3,
          "Date": "2022-10-03T11:01:32.000Z",
          "Titre": "Can‘t say anything good so i dont say…",
          "Contenu": "Can‘t say anything good so i dont say anything at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda R",
          "Nb_Reviews": 8,
          "Date": "2022-05-25T21:29:30.000Z",
          "Titre": "Buy Almost ANY Product But This one (or Any of their other products)",
          "Contenu": "Purchased this product for a project and licensed it with a personal license which is when the troubles began.  The software wouldn't download anything unless I upgraded from a personal license to a pro license.  I emailed the company and they have been giving me the run-around ever since.  They have a 14 day money back guarantee if you are not satisfied but they are not honoring that.  They are scammers.  They are horrible to deal with."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Doug Vick",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T22:58:09.000Z",
          "Titre": "I paid the 15$ and are still limited to…",
          "Contenu": "I paid the 15$ and are still limited to the  15 per day?"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "George Owen",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T23:51:25.000Z",
          "Titre": "Just download viruses directy from internet instead.",
          "Contenu": "The fact that they conceal the software isn't free only the information harvesting software so that after you waste your time downloading this piece of S H I T  software you find out they want you to pay for it. You do not even get any free downloads to see if you like it or not. Don't waste your time, money, or energy on cock suckers that made this sack of S H I T"
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T17:23:07.000Z",
          "Titre": "WORST REFUND POLICY",
          "Contenu": "One of the worst refund policies in the market"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Alan JT",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T14:20:40.000Z",
          "Titre": "Was good but now very buggy."
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "Nicole P.",
          "Nb_Reviews": 5,
          "Date": "2021-12-16T19:34:36.000Z",
          "Titre": "Blocks your Instagram account!",
          "Contenu": "Every time I use 4K Stogram, Instagram detects \"suspicious activity\", blocks my account, I have to pass verification process over and over, change the account password, re-save it and re-login on all devices...I spend about half an hour every day only fixing the mess 4K Stogram caused!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "raju gupta-chaudhary",
          "Nb_Reviews": 16,
          "Date": "2022-04-03T02:21:32.000Z",
          "Titre": "4kdownload is a waste of your time",
          "Contenu": "hi this is just to let people know you can download this for free. the item says it downloads for you from youtube. this it does do to nowhere? so basicaly each link you wait twenty minutes while its doing nothing. so my advice dont waste your time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jocelyn Warfield",
          "Nb_Reviews": 1,
          "Date": "2021-08-28T00:07:40.000Z",
          "Titre": "No assistance at all",
          "Contenu": "I purchased the Mac package and could not get it to download.The most disappointing part about this ordeal wa I could not get any assistance what so ever. No phone, no email ..,When I finally did get one to down load, my computer kept sending warings  “this could damage your computer, are you sure you want to download this?”"
        },
        {
          "Note": 1,
          "Lieu": "HU",
          "Pseudo": "Pétercsák Zsolt",
          "Nb_Reviews": 2,
          "Date": "2021-06-02T19:14:26.000Z",
          "Titre": "I just purchased the app and I've tried…",
          "Contenu": "I just purchased the app and I've tried to download like 20 videos and I got error for all of the video. The application has significant downloading issues(my internet speed 1gbps). Customer service is terrible, they said I should update my software which I did nothing worked. Regret purchasing this app and the refund policy is not straightforward compared every company I have dealt with so far. Scam watch out..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "tit",
          "Nb_Reviews": 1,
          "Date": "2020-10-09T16:01:33.000Z",
          "Titre": "SCAM! updated 10/9",
          "Contenu": "since i paid for software , been emailing tech support trying to get program to work..no luck, been doing same things trying to fix over and over and now they refusing to give me a refund... This is a SCAM...be warned! update..when they saw the review they quickly offered to refund my money and the same day, the debit card i had given them, was fraudulently used at 2 gas stations...coincidence..i dont know?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandy Bernstein",
          "Nb_Reviews": 1,
          "Date": "2020-08-20T15:53:53.000Z",
          "Titre": "4K Downloader",
          "Contenu": "I'm only giving one star and that would go for just that fact that tech support at least contacted me and tried to help. All the suggestions and nothing has helped and the software remains unusable where it once worked. I don't understand how this has happened and I cannot be the only one who is experiencing difficulties with no resolve. Sorry / not sorry for the review."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ron Matsusaki",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T00:51:47.000Z",
          "Titre": "I bought the \"Personal\" version of 4K…",
          "Contenu": "I bought the \"Personal\" version of 4K Downloader online for $15. I installed it and activated the app using the Activation Key provided. When I hit the green + button to install an URL, a window popped up to buy an upgrade. So, having no apparent choice, I upgraded and the app still did not work.  did notice that the installation did not ask me any questions. I sent the problem in the box provided and will see if there is a solution.If there was some kind of glitch in the installation, I will retract this comment. But, for now, I have a useless purchase."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Leslie Rw",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T17:12:46.000Z",
          "Titre": "I just purchased the app and could only…",
          "Contenu": "I just purchased the app and could only download two videos. The application has significant downloading issues. Customer service is non-existent - had no response to my enquiry. Regret purchasing this app and the refund policy is not straightforward compared every company I have dealt with thus far."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stephen Goode",
          "Nb_Reviews": 6,
          "Date": "2021-10-29T19:50:23.000Z",
          "Titre": "Does not download.",
          "Contenu": "I have tried 3 times now over the last two months to download and run 4k video downloader.I fails to load.'Support' gives me instructions that I cannot understand, the they give me more instruction on how to find 'log files'; I do not want to find any log file' I just  want to be able to download and run.I have run this in the past with; and previously 'supports' instructions were easy to follow; but now the instructions from 'support' are different, and I cannot understand them.I am now looking to use a product from another company.I cannot recommend this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ivan Rendon",
          "Nb_Reviews": 1,
          "Date": "2021-05-22T14:46:23.000Z",
          "Titre": "Unhappy with Updates",
          "Contenu": "After the update just released the app shows errors and is unable to parse the urls, I have a premium subscription to both 4k Downloader and YT premium, a few days ago before I installed the latest version everything was working I loved it, but unfortunately this isn't the first time last time back in Dec, 2020 the same thing happened, after I installed the latest version everything stopped working, until the next patch was available. seems like there is not enough testing done on their end before a new release comes as it always breaks things up."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John Connolly",
          "Nb_Reviews": 2,
          "Date": "2021-01-31T23:00:30.000Z",
          "Titre": "I  used to be happy with the interface",
          "Contenu": "I  used to be happy with the interface, speed and convenience of this product, but after the last couple of updates it appears that half to two thirds of downloads only download audio. It's not the source files because other downloaders are able to capture the videos without issue. Very poor."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Archi Archibal'",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T09:03:00.000Z",
          "Titre": "No correct work."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "easyplz",
          "Nb_Reviews": 1,
          "Date": "2021-01-03T17:48:27.000Z",
          "Titre": "This software I purchased used to work…",
          "Contenu": "This software I purchased used to work perfectly. As of a month or so ago, it just will not work whatsoever! I have tried contacting 4KDownload for any kind of support with ZERO RESPONSE for weeks now! Done updates / removed and reinstalled software... NOTHING WORKS!"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Mustafa",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T11:00:27.000Z",
          "Titre": "Youtube to MP3 app does not deliver quality audio",
          "Contenu": "Youtube to MP3 app promises to offer high quality audio files and having 320kbps option in the settings gives the expectation that it can download 320kbps. I purchased the product expecting that and found out from the support team that it actually does not. This is completely deceiving the customer.They hide behind the fact that somewhere in their website it mentiones that YouTube does not provide 320kbps quality. First of all, it is not written clearly in the product info page (it just says high quality audio download), second of all in the apps preferences, there is an option to download at 320kbps quality. If YouTube does not support it, then why do they have that option in the app? That is clearly deceiving the customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edgar",
          "Nb_Reviews": 1,
          "Date": "2021-05-23T01:48:32.000Z",
          "Titre": "It used to be a great app, but it's not anymore...",
          "Contenu": "It was a great application, I've been using the premium one for more than three years until the last update, now most of the time I have failures when parsing the links of the videos, which prevents me from downloading the videos."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "M Kanagasabapathy",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T11:29:09.000Z",
          "Titre": "4K downloader is not worthy",
          "Contenu": "I had the paid version of 4K downloader for downloading youtube videos. Its not worthy. It cannot create .srt file. But in their website they advertised it can do it. They are misleading.  Its not worthy for the money."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Charlie Huynh",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T10:39:15.000Z",
          "Titre": "It did not working at all",
          "Contenu": "It did not working at all . Please get money back !"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bert Buizerd",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T22:19:56.000Z",
          "Titre": "Same as the latest post everything…",
          "Contenu": "Same as the latest post everything worked fine today until i did the last update and no support at all. For them everything works fine.Very bad service don t bij anything from them."
        },
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "TIZMODO TIZMODO",
          "Nb_Reviews": 3,
          "Date": "2021-01-16T14:44:36.000Z",
          "Titre": "Free for a fee",
          "Contenu": "\"Download Instagram content for free\", but only after you pay. This is regarding their 4kstogram app. Just wasted my free time installing their \"free\" service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MrJay",
          "Nb_Reviews": 1,
          "Date": "2021-02-08T17:20:33.000Z",
          "Titre": "wish I saw the reviews for this tool before I bought",
          "Contenu": "What a pain it is just to try and get a refund for a software that doesn't work. You have to run around in circles and re-explain yourself just to try and get a refund. This problem is on going. Been trying to get this issue resolved for almost 2 weeks but I am just wasting time with support.I wish I saw these 1 star reviews here about this tool before I bought. I'll never buy or recommend this product to anyone. If you are thinking of buying this product - know that the bad reviews on here are not from angry ppl but ppl that are telling the truth.It does not work. You can download an FDM for free and get way better results. If you do choose not to heed this warning - good luck getting your money back.It really feels like you're dealing with scammers the way they refuse to refund you your money for a non working tool."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T15:55:25.000Z",
          "Titre": "I bought a key and never got my key."
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "vkbiz",
          "Nb_Reviews": 8,
          "Date": "2021-10-29T04:52:08.000Z",
          "Titre": "Worst service ever",
          "Contenu": "The worst service ever.I reported a problem (put short): Channels don't work but videos do.Their reply: Do videos work?Then they requested sending a log file.I did.Their reply: Send us a log file.Except for reinstalling the whole app (which meant manually entering and setting up all the subscriptions from scratch!) I have never ever resolved an issue with them.Their app continuously causes bans on my Instagram account.\"Interesting\" that virtually all their nice reviews here are \"Invited\". (note: only users who are expected to write positive reviews are \"Invited\" thus making the total score irrelevant; the score among the spontaneous reviews gives a totally different picture).EDIT (reaction to reply):I surely did report the Instagram problems (bans, lockdowns due to app activity). Many times and not only this year. Never resolved.EDIT2: No matter what you write, the solutions NEVER WORKED and the issues were NEVER RESOLVED."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Fortune",
          "Nb_Reviews": 30,
          "Date": "2020-08-22T09:04:52.000Z",
          "Titre": "it was really nice to use but now just…",
          "Contenu": "it was really nice to use but now just ask for a license key I am no longer using the software anymore going to use YTD or youtube-dl-gui such a shame"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Martha E. Woldt",
          "Nb_Reviews": 2,
          "Date": "2024-01-01T20:55:52.000Z",
          "Titre": "I've had one in three videos from…",
          "Contenu": "I've had one in three videos from YouTube which this downloader would not process.  I think it's a bag investment on my part."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2024-01-05T04:37:59.000Z",
          "Titre": "I have more problems with 4k video…",
          "Contenu": "I have more problems with 4k video downloader+"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Chris Cherry",
          "Nb_Reviews": 5,
          "Date": "2023-12-21T01:10:21.000Z",
          "Titre": "Running 4K Video Downloader on Chromebook",
          "Contenu": "I bought 4K Video Downloader for use on my Dell Laptop running Ubuntu and it worked fine.. I have now changed to a Chromebook running Linux and cannot get 4K Video Downloader to run. I keep getting a 'Cannot parse this link' message. Is this a problem with Chromebooks? Should the software run on a Chromebook?"
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Barad Dedi",
          "Nb_Reviews": 1,
          "Date": "2024-01-04T12:09:27.000Z",
          "Titre": "keep getting logged out",
          "Contenu": "it used to work much faster a few years ago.i keep getting logged out. can't really download anything like this"
        },
        {
          "Note": 2,
          "Lieu": "LK",
          "Pseudo": "Laksheya Lakkathas",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T05:01:10.000Z",
          "Titre": "The subtitle files are separately…",
          "Contenu": "The subtitle files are separately downloaded as .srt files  instead of being downloaded as a whole .mp4 file. In the older versions, subtitles were not downloaded separately. When the video is being played on QuickTime Player, I can't even watch the video without subtitles. This problem occured when I was downloading videos from YouTube. Please look into this problem.App version- 1.3.0.0038"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PJ",
          "Nb_Reviews": 5,
          "Date": "2023-12-17T15:55:37.000Z",
          "Titre": "Slooooow download speeds",
          "Contenu": "1.2+ gbs download speed and this software starts out at 32 mbs then slows down to 15mbs after about 30-45 seconds into a(single) download and never speeds up. that's after upgrading."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ahmad Saleh",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T16:35:17.000Z",
          "Titre": "Read the price tiers carefully",
          "Contenu": "Read the price tiers carefully.  The Personal is not \"for personal use\" and the Pro is not \"business-friendly\".  I bought Personal for personal use, and found out I did not receive the feature I bought it for.  To get the feature, I have to double what I paid.Customer Support just quotes the website if you have plan issues.  However, they did respond quickly within a day."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Many Iceclimbers",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T21:18:38.000Z",
          "Titre": "No 3D-360 Video From YouTube",
          "Contenu": "The application does download video and quickly but the promise of downloading 3D 360 video from YouTube is blocked by YouTube.The app must be more transparent and notify the user of the limitation."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T01:01:51.000Z",
          "Titre": "Latest version (v4.12.1.5530) can't download",
          "Contenu": "Latest version (v4.12.1.5530) fails to download the individual file from bilibili.com after pasting video link (e.g. with \"?p=124\") but only downloads the first video in the list (i.e. p1)For the comparison the previous version worked flawlessly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Annacolleen Etters",
          "Nb_Reviews": 3,
          "Date": "2023-08-26T02:14:32.000Z",
          "Titre": "Too difficult to retrieve code for…",
          "Contenu": "Too difficult to retrieve code for regular downloader I paid for already. It's like you guys are trying to force people to buy the downloader plus, which I do not want. Why was the other one just fine, for 3 years? O was told, when I bought the 1st one, I was never going to have to buy more, and now you are making it really hard to reinstall?"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T18:07:22.000Z",
          "Titre": "Only 128kb/sec max mp3 quality when…",
          "Contenu": "Only 128kb/sec max mp3 quality when converting youtube video’s ( normal free youtube downloads at least 192kb/sec)Getting it to 192 will set you back 68 euro’s , way too expensive for this normal feature ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fakher K",
          "Nb_Reviews": 5,
          "Date": "2023-07-20T08:53:38.000Z",
          "Titre": "Works Less Than Fifty Percent of the Time",
          "Contenu": "4k Video Download, when it works it's great...Unfortunately it only works fifty percent of the time..in fact I;m being generous; more than half the time you attempt to download a video from Youtube you will get a pop up dialog box stating \"Unable to parse file.\"  Now I can understand this happening once in a while...but this is ridiculous.  It got to the point where seeing this annoying box every other time I attempted to save a video became so infuriating that I had to uninstall the program.  As I said, it does actually work sometimes, but more oftern than not it fails to do anything.  For those who need something reliable, like a student, or an Office worker trying to put together a presentation, I absolutely can't recommend 4kVideoDownload, due to the fact that it is wildly unreliable..."
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T19:10:42.000Z",
          "Titre": "There are a lot of 4k video…",
          "Contenu": "There are a lot of 4k video downloader+software bugs, and I suggest not to improve them all. After listening to the customer’s narration, the customer service still can’t figure out the situation, and all the troubleshooting tips given by the sister lead the problem to the customer’s own use, and the problem occurs. I would rather call the customer Uninstalled and reinstalled the software, and did not release a new version after correcting it myself. The new version of the software has a bunch of logical errors. It seems that it has not been tested before being released for sale. I have returned to use the old version of 4k video downloader. I am very disappointed. The customer seems to be your product. test operator"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Glitch Artist",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T03:12:15.000Z",
          "Titre": "It used to be a 5 Star, but then Greed got in the way.",
          "Contenu": "I Liked 4K Downloader when it worked.I even got a license for it since I liked the project + it ran on Linux very well. But ever since 4K+ came out, it suddenly stopped working. On Linux, it parses the link, but as soon as download begins, \"error\". No specification either. On Windows, \"can't parse this link\". It's been like this for weeks.4K+ works fine, but I'm not getting a new license after I already bought a perpetual one for the older (and frankly better looking) software.This reeks of greed. Don't offer a perpetual license if you plan to make that license useless in favor of a needing us to get a new one.Either let the old software continue to work as advertised (then and now) to work or let the license transfer without needing to spend more on an \"upgrade\".If this remains to be an issue for another week, I'm going to have to look elsewhere, and you should too. I definitely won't be recommending this to people anymore if it's not fixed that's for sure."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Alexandru Buhnici",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T12:20:02.000Z",
          "Titre": "Key no longer works",
          "Contenu": "I was advised to download the new installer but now my key no longer works and I cannot upgrade.I hate this kind of shady behavior with your user where you ensnare them and leave them with no option.Will look for an alternative app now"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Tim Davenport",
          "Nb_Reviews": 10,
          "Date": "2023-06-01T02:10:46.000Z",
          "Titre": "4K downloader failed to download the…",
          "Contenu": "4K downloader failed to download the clips I wanted, so I reached out to their tech support, They've ignored me. I've tested it on more videos and it has been able to download some, but it falls short of being the single solution it promised."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Joseph Caffrey",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T15:30:28.000Z",
          "Titre": "I've used this program for a few years…",
          "Contenu": "I've used this program for a few years now. I really wanted to give this a higher rating but the fact that features that were once free (threads and login) are now behind a monthly paywall. It's now got me looking for alternate downloaders.Once great but is a shadow of its former self. If you have cash lying around tho, I'd say it will be decent."
        },
        {
          "Note": 2,
          "Lieu": "VN",
          "Pseudo": "Nik Argavan",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T04:34:24.000Z",
          "Titre": "its not a 4K downloader",
          "Contenu": "Just 2 Star for being a good GUI or friendly /easy to use but its not a 4K downloader. I download many 4k videos to test but the output is 1080P- 25fps which is not 4K"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "GHJ",
          "Nb_Reviews": 7,
          "Date": "2023-07-08T21:32:41.000Z",
          "Titre": "Download bad from YouTube",
          "Contenu": "Download bad from YouTube, slow are everytime blokked halfway download. I'am verry disappointed about that and what i pay for it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KOOLEDO",
          "Nb_Reviews": 2,
          "Date": "2023-06-09T23:33:20.000Z",
          "Titre": "Not really a good downloader for me",
          "Contenu": "Not really a good downloader for me. Not able to download many youtube videos or other videos on the net. Thanks anyway. Wanted to try something new."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Edward",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T22:40:27.000Z",
          "Titre": "Paid for a lifetime licence",
          "Contenu": "Paid for a lifetime licence, then they released a new \"+\" version that doesn't really do anything new, but the existing licence no longer covers, discounted upgrade program then only applies to the most expensive \"pro\" version I don't need, so basically they want me to pay all over again to continue getting updates."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Raj Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T03:42:30.000Z",
          "Titre": "App on Play Store",
          "Contenu": "Is your Android application available on Play Store?"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Craig",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T23:55:27.000Z",
          "Titre": "No improvement over the non activated…",
          "Contenu": "No improvement over the non activated download version!"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T18:28:33.000Z",
          "Titre": "My downloads at hangs every time I use…",
          "Contenu": "My downloads at hangs every time I use it.  So far only YouTube to MP3 used"
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "xia一九九七",
          "Nb_Reviews": 22,
          "Date": "2021-05-10T21:00:17.000Z",
          "Titre": "Download ClipGrab instead.",
          "Contenu": "It sure works but ehh. It has been more troubling to use. Worked very well in the beginning but I slowly start to get errors? The alternative is to use ClipGrab. This one can download in 4k while the ClipGrab can't do it but you sure do get 1080p which is totally fine for me! This app will remain on my pc but I won't use this as my primary downloader. If I really want to get a video in 4k I will give my time to struggle with this downloader"
        },
        {
          "Note": 2,
          "Lieu": "PT",
          "Pseudo": "RICARDO B.",
          "Nb_Reviews": 2,
          "Date": "2022-04-13T10:02:19.000Z",
          "Titre": "Problem downloading channels defined in subscription",
          "Contenu": "Have a license and 7 days ago it stopped automatically downloading the channels it had in the subscriptions... anyone else with the same problem? If I try to add another channel to the subscription, an invalid channel appears!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Uatu",
          "Nb_Reviews": 1,
          "Date": "2020-10-03T23:53:58.000Z",
          "Titre": "Used to be great",
          "Contenu": "Used to be great, but in late 2020 starting getting more and more \"Unable to parse this link\" errors. MacX Youtube Downloader has no problems with the same links, so that's become my first choice for now. I've upgraded to the latest version, but the errors persist. Pity, because 4K was a little easier to use, not needing so many clicks."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Stephen Waller",
          "Nb_Reviews": 2,
          "Date": "2020-09-02T20:57:18.000Z",
          "Titre": "This was a great app a 5 star…",
          "Contenu": "This was a great app a 5 star originally but slowly and surely they have chipped away at its functionality on the free version. Happily there are plenty of other free alternatives."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Albert",
          "Nb_Reviews": 2,
          "Date": "2023-12-27T20:08:27.000Z",
          "Titre": "I like it so much",
          "Contenu": "I like it so much, but I have purchased a perpetual license before, and now I get an error when I attempt to activate."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "HAO YUN HSIEH",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T02:20:53.000Z",
          "Titre": "Can’t login my Instagram by this product right now",
          "Contenu": "I use 4kstogram and it really works perfectly.However, I have some problems these days which is my Instagram on my iPhone always be logged out after using this product. I can’t even login my account by this product to download anything last night. Because they make me enter the verification code. But I haven’t get any verification code.I will be grateful if you can give me some examples for solutions. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charly Mann",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:04:58.000Z",
          "Titre": "Recent 5.1 audio download problem",
          "Contenu": "I loved the product for downloading 5.1 audio from YouTube - but it has not been recognizing the 5.1 files for the last two months. The files now only show up as stereo. I guess YouTube has done something that is causing this glitch. Can you fix this problem."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Sabots Libres Info",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:30:44.000Z",
          "Titre": "Mediocre",
          "Contenu": "At the moment, I cannot see any particular benefits compared with the previous Pro version. There does not appear to be any extra functionality, speed gain (in fact it locked up completely on a download just after installation) nor 'enhanced user experience'.The only advantage to date is that I am no longer being nagged to update the programme."
        },
        {
          "Note": 3,
          "Lieu": "LK",
          "Pseudo": "Laksheya Lakkathas",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T14:25:36.000Z",
          "Titre": "Cannot download bilibili videos from…",
          "Contenu": "Cannot download bilibili videos from chrome properly. It doesn't display the file name and doesn't open with quicktime player.Version- 1.2.40036The video file name is displayed as Bilibili.mp4 and when I try to open it, it shows that the file isn't compatible. I tried to download this in the highest video quality and frame rate that is available for that specific video. I have the same problem with other bilibili videos downloaded from the bilibili website on google chrome.4K video downloader version- 1.2.40036Operating System- MacOS VenturaI didn't have this type of problem with the older versions of 4K video downloader. Please look into this."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Manuel",
          "Nb_Reviews": 6,
          "Date": "2023-10-25T21:58:11.000Z",
          "Titre": "I have been using the 4K downloader since 2020",
          "Contenu": "I have been using the 4K downloader for a couple of years. It works with ups and downs. There seems to be a period now that youtube downloads are not working (parsing takes forever, and if downloads start they are terribly slow). In many of such cases it is waiting for a new version to come out. I hope you replace version 4.27.1 very soon, so I can use the software again.---One day later I get a message from their support team telling me that I am using an older version and I should update. In my ticket to them I clearly stated that I am using the latest version including the version number, which exactly matches the latest version on their website.Apparently their support team isn't paying attention to such details and one can expect just a random standard response when asking for help. Too bad!"
        },
        {
          "Note": 3,
          "Lieu": "CD",
          "Pseudo": "Blessing Danamua",
          "Nb_Reviews": 3,
          "Date": "2023-10-23T22:25:51.000Z",
          "Titre": "My experience using 4kdownload Android and its few lack of features.",
          "Contenu": "Hi to all the 4kdownload team! The use of the App is perfect. I have a copy and that's it. But gradually I noticed that 4kdiwnload Android does not provide me with enough cost-effective features. That is to say, there is no subtitle mode, to download subtitles in any language.There is no browser mode, which can allow me to interact with my favorite sites. The video image thumbnail is blurry. The video download notification does not appear above the screen notification. And, it turns out that videos broadcast on YouTube or other sites can be in several audio languages, unfortunately the application cannot download a video in French audio. He takes the trouble to download the video in its original language While video accommodates several audio languages. Why 4kdownload Android can not download it  ? This Why I gave 3 stars. if Android can't download it? For which I gave 3 stars. If improvements are made in future updates, and there is a significant change, then I will add stars to make the rating 5. Thank you very much 😊"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "usually satisfied customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T18:10:07.000Z",
          "Titre": "I have been able to revisit the APP…",
          "Contenu": "I have been able to revisit the APP throughout the years to catalog content that I would refer to for classroom curriculum.  I hesitated for 2 years to buy the 4kdown-er, and then made the purchase when they advertised it as a no-limit, lifetime purchase.  Now I'm getting ads that I will save 60% on some rubbish upsell.  The name itself is \"4k Downloader\" - suggesting that it is capable of downloading 4k quality videos.  I am sure that they have to update their software engine, to contend with new security features by video-serving website(s); however, the original premise of \"lifetime\" seems rather elusive.  Then too, if I am remembering in error, I apologize to be incorrect."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karl Shepard",
          "Nb_Reviews": 2,
          "Date": "2023-03-02T00:16:55.000Z",
          "Titre": "Just wanted to move license to a new SSD",
          "Contenu": "I only wanted to remove the license from a hard drive and move it to another.  I am, like many, moving from spinning platters to SSD.  I had to upgrade to PRO.  This is not right.After I upgraded, I finally got the answer for Windows and Linux. I was not trying to cheat beyond the available machines,  I was replacing hard drives on computers that had a valid license.Why make this so difficult?  Why did I have to upgrade in order to get the answer?Karl"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phillip Burkhalter",
          "Nb_Reviews": 2,
          "Date": "2023-02-01T23:43:20.000Z",
          "Titre": "Works but it needs work",
          "Contenu": "It crashes every time I use it. It doesn’t automatically redownload anything that was corrupted by its crash either. I also wish it had a rename mask. Otherwise it works exactly like it should."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JCG Thewordis",
          "Nb_Reviews": 3,
          "Date": "2023-03-31T02:48:38.000Z",
          "Titre": "4K couldn't deliver!",
          "Contenu": "I changed my rating from 5 stars to 3.I tried to download a video but 4K said it's could not parse it.I tried downloading it in different formats still a no go.I used an online site and got the video in the highest quality.So what now 4K, explain why I paid for something that couldn't deliver?"
        },
        {
          "Note": 3,
          "Lieu": "ET",
          "Pseudo": "Yakub Yusuf",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T22:49:47.000Z",
          "Titre": "I like reality and dislike fabrication",
          "Contenu": "I like reality and dislike fabrication. i.e., make something false seem true. This company should have to strengthen its legal framework."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Collin Beveridge",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T06:10:02.000Z",
          "Titre": "Seriously disappointed by the latest upgrade.",
          "Contenu": "Last night I purchased 4K Downloader+ and have sadly regretted doing it as the download speeds are a fraction of the speeds I was achieving before the upgrade from the original 4K Downloader that it replaced.No other changes are applicable as it is on the same computer using the same internet which delivers 930/350 speeds almost all of the time."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "John Marsh",
          "Nb_Reviews": 2,
          "Date": "2022-11-01T13:26:48.000Z",
          "Titre": "4K Download is better at short clips not longer ones",
          "Contenu": "4K Download is better at short clips as it can be slow downloading longer ones. Otherwise useful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry Taylor",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T21:55:27.000Z",
          "Titre": "Nice app....very easy to use!!!",
          "Contenu": "Nice app...I really appreciate the ease of use.But I DO NOT appreciate you double-charging my credit card ($50.05 X 2).  I hope it was just a mistake."
        },
        {
          "Note": 3,
          "Lieu": "QA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T08:24:18.000Z",
          "Titre": "It's a bit challenging sometimes to get…",
          "Contenu": "It's a bit challenging sometimes to get the video downloaded. The site shows error message."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mt",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T00:54:30.000Z",
          "Titre": "This software has one major flaw",
          "Contenu": "This software has one major flaw, that can be fixed so easily I don't know why they don't do it. I've written to them about it, but they don't consider it a problem...I let you be the judge When you download a whole YouTube channel 4K Download puts all the videos into one folder with NO dates or numbered system on the file names. So its one big jumbled mess of files in a folder. If its a big channel with lots of videos you can imagine the chaos of the files in the folder being completely random. If you want to watch the files in order its impossible...making the download channel option almost useless.You end up with a bunch videos in a folder with no way of knowing the order they were publishedPlus if you want to come back later to download more videos from that channel, its a pain to see where you left off.This fix is so easy...put YouTube publication dates on the files...or number the files...#1(video file name)...#2(video file name)...#3(video file name)....ectas it is the channel download feature is too much of a pain to useIve used other software of this type and they all had creation dates on the files or they numbered the files, so this request is not some crazy ask...its a basic standard on other softwareOther then that the software works fine and is great for single video downloadsIf they will correct this, ill post a glowing 5 star review"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Maurice Daignault",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T20:54:34.000Z",
          "Titre": "Not all videos on the web sites can be…",
          "Contenu": "Not all videos on the web sites can be downloaded.Many site are excluded."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jose",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T19:16:47.000Z",
          "Titre": "Download issue",
          "Contenu": "Hello.  I have been very happy with this app for several years.  However, for the last 2 days, whenever I paste a youtube link in the download bar, within 7 or 8 seconds of attempting to retrieve the file, the app completely closes.  It has been doing this nonstop for the past 3 days.  Please help."
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "MrFaltux",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T21:04:38.000Z",
          "Titre": "4k download only downloads YouTube videos after buying it",
          "Contenu": "Yesterday I was thrilled by using 4k download. It was downloading almost every clip so I decided to buy the Bundle :( (unfortunately, a bad decision I guess). Since I bought that Pro Bundle. I can not download IG videos anymore. It only supports YouTube videos :(Error: The site is unsupported"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T12:07:30.000Z",
          "Titre": "Download",
          "Contenu": "The service works but the download speed is very slow."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Todd M",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T12:58:18.000Z",
          "Titre": "It's Just Okay!",
          "Contenu": "It's Just Okay!If you want to get the videos without the watermark or in HD format, go with another option where you can download one at a time. It takes longer, but way better quality! If you just want to have a record of the videos to go back and watch at your leisure, then it's great!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Cj A",
          "Nb_Reviews": 3,
          "Date": "2021-02-24T13:44:37.000Z",
          "Titre": "My experience...",
          "Contenu": "Modified my review after getting refund - I wont comment on the software as I got refunded and barely used it - I would however comment on their customer service. There is a significant room for improvement tbh  and let me not say anything harsher. Just for me trust is broken and I will not use 4K download because of their customer service.Best of luck to all -"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T18:09:07.000Z",
          "Titre": "when uploading plylist it often crashed"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "alphonso Jarrett",
          "Nb_Reviews": 5,
          "Date": "2021-06-03T17:22:18.000Z",
          "Titre": "Mp3 marvel",
          "Contenu": "I downloaded the app and after a few teething problems. The app is working fine and delivering on its promise.I managed to convert tracks for my mp3, which delighted me gratefully. I would highly recommend this app for any body looking to download and convert music.  As its fast and efficient."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stella Ng",
          "Nb_Reviews": 1,
          "Date": "2021-01-18T00:56:34.000Z",
          "Titre": "Review on 4K Video Downloader",
          "Contenu": "4K video downloader is good to download videos from YouTube and other sites. Yet sometimes it fails to work without any hint. Therefore, I switch to AnyVid downloader. It shows a reliable performance on PC, Mac and Android."
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "王祺",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T04:22:08.000Z",
          "Titre": "video cover why not"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Felix K Friju",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T17:29:39.000Z",
          "Titre": "Why I can't download 4K  videos"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Garry",
          "Nb_Reviews": 1,
          "Date": "2023-12-31T19:45:36.000Z",
          "Titre": "Getting Logged Out Repeatedly",
          "Contenu": "I would have loved to give a 5-star rating but it's rather frustrating to constantly to get logged out by Instagram over and over again no matter what I do or how much I'm downloading at a time. I know you have no control over what Instagram does but it seriously affects my using of your software."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Cameron Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T12:42:39.000Z",
          "Titre": "Almost perfect",
          "Contenu": "Hi! The app is almost perfect, but there is one memory leak problem. In the latest version (4.28.0.5600 x64) a memory leak occurs (total exhaustion of system memory) after downloading several dozen videos (videos downloaded one by one, single thread, Windows 7 SP1, 32 GB). Can you solve this problem?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R Bolton",
          "Nb_Reviews": 1,
          "Date": "2024-01-02T06:18:33.000Z",
          "Titre": "Download worked well",
          "Contenu": "Download worked well. The interface is somewhat confusing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:15:27.000Z",
          "Titre": "Good in general and getting better",
          "Contenu": "I use this program to download videos from different sources and in general it makes it easier. There are still few places where it doesn't work."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ray Bois Canada",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:32:35.000Z",
          "Titre": "Forget all the pirate downloads of all sorts. (Also free but full of malware and viruses.)",
          "Contenu": "It's a great software. Been using it for many years with a $10. donation.Now it's a new version I decided to pay for. Ok, but the promised discount/coupon thing didn't work.Hence 4 stars. Otherwise, 5 stars.------------------------------------------Your reply was:Reply from 4K DownloadHi there,Thank you for your feedback.If you have a discount coupon that wasn't applied, you can request a refund of the discount amount via our support link.-------------------------------------My answer to your reply is this: Thanks for the offer of me going through various loops to get a small discount of a few dollars. That would be You just brushing me aside with a couple of bucks to pacify me.The answer I was hoping for is:-We will verify and test our electronic couponing algorythm at the basket paying procedure and get back to you to -Explain what happened.-What you did to correct the problem.-Ensure this won't happen to anyone anymore.Because out of the thousands of people buying '4K' while not getting the discount but not bothering or insisting to get it (like me), how much money does THAT represents to you...?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Troy",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T03:37:14.000Z",
          "Titre": "4K Video's Customer Care is good.",
          "Contenu": "I had some issue at first with this updated version not allowing me to choose the folder on my computer to save the data to, nor allow me to change the name of the file before downloading it.But 4K's customer service kindly explained how to make the app work the way I wanted.  One issue I have now though is that the app shuts itself off or crashes after it downloads the video."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Roo Bicon",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T04:37:00.000Z",
          "Titre": "pluses and minuses",
          "Contenu": "ON the whole I am happy with the purchase. It does provide very fast download times. My negative comment is that the homepage provides access to twelve Apps including YouTube, however some of these are written in Japanese, few I will never personally use and one that is not accessible (not that I will use), but it's on the home page."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "dpina1",
          "Nb_Reviews": 8,
          "Date": "2023-11-20T23:37:57.000Z",
          "Titre": "Great desktop App and easy to use.",
          "Contenu": "Great desktop App and easy to use.i`ve been use it for years nowCON: Saved files format is MKV and instead of MP4? i get saved files only in MKV format and that is difficult format for playback on some TVPlease upgrade to make MP4 SAVING possible"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steele",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T14:42:04.000Z",
          "Titre": "Unable to download many private videos",
          "Contenu": "Unable to download many private videos, which is what I paid for activation to be able to do. Still, otherwise a reliable product.Edit: I did everything they suggested, sent multiple follow up emails, still no luck downloading many of the videos I tried. Last I heard there were developers looking into my issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 21,
          "Date": "2023-04-08T03:38:15.000Z",
          "Titre": "Fast And Dependable",
          "Contenu": "Using this software is amazingly fast and dependable. I used other software previously for downloading videos and this one is much faster. Never fails to download videos I try. It also extracts audio from the videos so you can just have audio if that's what your looking for.4K download will not disappoint. Worth the small price for a lifetime of satisfaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terence Drakes",
          "Nb_Reviews": 18,
          "Date": "2022-11-01T21:47:09.000Z",
          "Titre": "My purchase of 4K Stogram was fast",
          "Contenu": "My purchase of 4K Stogram was fast, easy and affordable. The product works even better than expected. Very thorough and each photo/video is well labeled and dated.However, it does frequently crash after each download is finished. This may just be a problem with my computer. Anyway, the downloads themselves work great.Highly Recommend! Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Lane",
          "Nb_Reviews": 4,
          "Date": "2022-12-02T16:57:27.000Z",
          "Titre": "4K runs smoothly and usually downloads…",
          "Contenu": "4K runs smoothly and usually downloads at a decent rate.  Sometimes it is unable to locate a file or is denied access to a video by the host/web source of a film.Downloaded files are compatible with most popular movie/video playing apps."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phillip",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T15:08:09.000Z",
          "Titre": "Love the upgrade, however . . .",
          "Contenu": "This review is for 4k Video Downloader+. I like everything about it except I wish there was a way to hide the control panel icon and search. I know the developers are probably proud of these additions but I don't need them and find them annoying. A simple option to hide them would be great."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Gregg",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T17:57:40.000Z",
          "Titre": "The app works really well",
          "Contenu": "The app works really well. Support has been brisk and helpful in the past. I love that you can download playlists from YT and have multiple download options.The only thing preventing a full 5 stars is that it can take some time to parse links initially, before downloading. Otherwise it's a near-perfect app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Kane",
          "Nb_Reviews": 3,
          "Date": "2023-04-01T17:40:08.000Z",
          "Titre": "I use 4K on multiple computers...I have…",
          "Contenu": "I use 4K on multiple computers...I have a purchased copy on the computer I am writing from...so I have unlimited downloads on this machine...my one issue with 4K is on the other computer...where it no longer asks what quality and format of video I want...after parsing...it just automatically downloads as soon as it is done parsing...this is annoying..."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "greenKac",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T02:28:38.000Z",
          "Titre": "Great to download songs even if it has 2 little problems",
          "Contenu": "I downloaded it to download all my musics from youtube and it works great for that but i have two little problems (it might just be that i'm dumb (no doubt i am)) :1 : i only have the free version limited to 30 downloads per day, and when i try to download a full playlist that has more than 30 videos in it, it tells me that the link is invalid, where when i download individually it works2 : when i look the details of the mp3, the artiste is, either null, or replaced by another name than the youtube channel name."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "J. Touma",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T11:32:19.000Z",
          "Titre": "Resolving problems",
          "Contenu": "Resolving problems. The staff of 4K  Download helped me to debug a problem downloading videos and I greatly appreciate their help."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T08:21:14.000Z",
          "Titre": "Worth the purchase.",
          "Contenu": "Well done. The playlist download feature just saved me hours, if not days of work. Astonishing. I was able to download my thousands (literally) of saved songs  all in mp3 format. Also backed up all of my channel videos with more ease than the Youtube studio itself. Only thing that didn't work quite well for downloading .mp3 files is that it tends to automatically attatch an artist to a song you downloaded, sometimes it's an incorrect artist. For instance there is a song named \"A Word in Your Ear\" by musician \"John Shakespeare\", but the software labeled the mp3 file with an artist named \"Alfie\" instead (which just happens to be another artist that produced a song with the same name). But that's about all I can complain about it. If this software could search for songs that have been uploaded to official music channels (Usually with the label \"Topic\" next to it), it could use that to identify the correct musician instead. But if it can't find an artist, maybe it'd be best for it to not automatically attatch an artist."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Abdallah Breik",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T14:15:24.000Z",
          "Titre": "Best YT downloader",
          "Contenu": "In general great application. All functions work as supposed to be. One aspect which I find not so good is that the app will save everything in one place !!! What I mean is that the app should ask each time where to save or the app should suggest a new folder. Because a user will not only download from one source but different sources which should be sorted out in seperate folder rather all saved in one place.Anyway, still one of the best apps in this field, Thanks and keep up the good work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "fanta pineapple",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T09:06:11.000Z",
          "Titre": "very good",
          "Contenu": "i use 4k video downloader very often to download videos and audioit downloads things very fastmy only complaint is that it constantly opens tabs in my browser which i do not like"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T21:46:51.000Z",
          "Titre": "I like it",
          "Contenu": "I mean It's pretty good downloads pretty much any video I want hopefully they could make it work with IOS but other than that it's perfect."
        },
        {
          "Note": 4,
          "Lieu": "RS",
          "Pseudo": "Bim Bros",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T18:21:30.000Z",
          "Titre": "take it, good tool.",
          "Contenu": "Some years i used this softver (started be fore cvd19). If i wrote rewiu that is act of satisfying. PS. dont know why but recently 4k download colaps recently, please fix it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Michelle from yorkshire",
          "Nb_Reviews": 24,
          "Date": "2023-06-05T09:52:37.000Z",
          "Titre": "Well I was using the free one and found…",
          "Contenu": "Well I was using the free one and found it great, so I got the forever one. Only thing it's not compatible with all my computers. So if one breaks I can use it on tablet, shame as for price it was great. I have android Huawei tablet it's not compatible or would have bought for it."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Dennis Pauwels",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T22:16:45.000Z",
          "Titre": "Program is good and easy to use but it…",
          "Contenu": "Program is good and easy to use but it has problems with downloading content in 4k when other programs don't have this problem with the same URL."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Herman Koerts",
          "Nb_Reviews": 3,
          "Date": "2023-08-03T14:56:24.000Z",
          "Titre": "The new software version is great",
          "Contenu": "The new software version is great, did not have the funding first to obtain a payed version but now I have and the extra options are great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John OBrien",
          "Nb_Reviews": 4,
          "Date": "2023-08-01T18:41:19.000Z",
          "Titre": "4K Download Keeps Its Promise",
          "Contenu": "4K Download does an excellent job of downloading video files by simply using the URL of the source file. Seamless operation, simple interface, updated regularly with improvements."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Adrian De Bourbon",
          "Nb_Reviews": 8,
          "Date": "2023-10-02T08:13:13.000Z",
          "Titre": "Need for instructions",
          "Contenu": "Program is great but lack of instructions made it difficult to use at first."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sissy",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T13:05:10.000Z",
          "Titre": "The only problem I'm having is that I…",
          "Contenu": "The only problem I'm having is that I installed my license on my laptop and can't figure out how to change it to my desktop!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "David Catania",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T05:15:37.000Z",
          "Titre": "New interface is user friendly",
          "Contenu": "The new interface is user friendly but may need more intuitive text to describe the settings available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Walter Goralski",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T02:02:49.000Z",
          "Titre": "Had issues with install, but they were quickly resolved...",
          "Contenu": "I got this when I tried to install on Win 64:Setup failed.(words related to log file, which is no help)0x80091007 - The hash value is not correct.Issue was fixed within 24 hours, so I am pleased."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Konner",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T03:10:46.000Z",
          "Titre": "Works with lots of websites but not all",
          "Contenu": "There are alot of websites that you can download from. But not every website unfortunately."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T20:33:59.000Z",
          "Titre": "Really good at its job",
          "Contenu": "Really good at its job, simple to use and clear UI. Only gripe: Right now, to pull a video file into Premiere, you need to click 'show in folder' then drag the file over. I would be super nice to just be able to drag the video from the 4k UI into premiere."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Audrey Heeley",
          "Nb_Reviews": 16,
          "Date": "2023-07-16T13:26:39.000Z",
          "Titre": "Gave this rating because l couldnt do it without help",
          "Contenu": "Gave this rating because l couldn’t figure out how to use it had to get a friend to sort it out ."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Graham",
          "Nb_Reviews": 22,
          "Date": "2023-09-09T10:30:52.000Z",
          "Titre": "It downloaded a difficult file quite…",
          "Contenu": "It downloaded a difficult file quite fast but anoth was very very slow."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Joel Turcotte",
          "Nb_Reviews": 3,
          "Date": "2023-04-01T17:38:37.000Z",
          "Titre": "I love the technology",
          "Contenu": "I love the technology. I am somewhat confused about what the advantages are with a subscription to the product?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-10-03T15:44:06.000Z",
          "Titre": "It works with a good price.",
          "Contenu": "It works in a simple consistent manner at a reasonable cost."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "ER",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T16:41:54.000Z",
          "Titre": "Great interface easy to use and no…",
          "Contenu": "Great interface easy to use and no buffering. Very good value both the free and the paid for versions."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "ling",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T08:48:22.000Z",
          "Titre": "Generally is good",
          "Contenu": "Generally is good. Easy to download."
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T04:06:54.000Z",
          "Titre": "Excellent app to download content",
          "Contenu": "Excellent app to download content you can use for your posts."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Colin Harris",
          "Nb_Reviews": 7,
          "Date": "2023-11-01T21:39:05.000Z",
          "Titre": "Excellent downloaded",
          "Contenu": "Excellent downloaded, probably could use a flac audio convedter"
        },
        {
          "Note": 4,
          "Lieu": "SN",
          "Pseudo": "Gorgui",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T00:59:05.000Z",
          "Titre": "Good app, one of the best I have seen",
          "Contenu": "Really appreciate this app, it helps me à lot with my courses"
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "salman",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T23:06:06.000Z",
          "Titre": "Good value for money",
          "Contenu": "Very easy to download full play listAnd 1 purchase is sufficient for 3 devices👍"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sonic Hedgehog",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T09:09:08.000Z",
          "Titre": "This is a great application but...",
          "Contenu": "This is a great application, I've been using it for months, and it does download videos fantastically, but for whatever reason, most of the YouTube videos I find that are indeed 4K, this application most of the time doesn't let me download it in 4K or 2K, only 1080p."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T18:53:18.000Z",
          "Titre": "No worries about spam sites that offer…",
          "Contenu": "No worries about spam sites that offer free downloads"
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Ann Jones",
          "Nb_Reviews": 3,
          "Date": "2023-03-12T15:09:14.000Z",
          "Titre": "The downloads are quick and clear",
          "Contenu": "The downloads are quick and clear.  I enjoy using this application."
        },
        {
          "Note": 4,
          "Lieu": "SV",
          "Pseudo": "Stefan",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T22:29:26.000Z",
          "Titre": "Does what it is supposed to and the…",
          "Contenu": "Does what it is supposed to and the price for the upgrade is reasonable."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Allan",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T00:13:52.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use and the price is fair. Very useful tool in downloading YouTube viedos"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Andras Enekes",
          "Nb_Reviews": 23,
          "Date": "2023-01-08T17:46:33.000Z",
          "Titre": "The program is working well",
          "Contenu": "The program is working well, but I can not download from the Videa."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "E.Brown",
          "Nb_Reviews": 2,
          "Date": "2023-04-08T18:15:03.000Z",
          "Titre": "has a problem with 25fps frame rate so…",
          "Contenu": "has a problem with 25fps frame rate so I use osb studio for that"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Boite daniel",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T13:38:13.000Z",
          "Titre": "Comparison between old and new 4K Download",
          "Contenu": "With your first  App, i can download some twitter files.I can't do it now !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ross",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T19:17:28.000Z",
          "Titre": "Great software at an affordable price"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D.H. Jr.",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T00:27:33.000Z",
          "Titre": "I really enjoy the service that you…",
          "Contenu": "I really enjoy the service that you offer. It’s easy to use and does not take a lot of time.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vasant Mahadeo Dandekar",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T14:25:24.000Z",
          "Titre": "you tube video links worked",
          "Contenu": "The you tube links worked today"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T10:58:14.000Z",
          "Titre": "There are several formats available",
          "Contenu": "There are several formats available. And the downloading speed is considerable."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Cyber horse rider",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T00:32:50.000Z",
          "Titre": "Easy to operate and easy to use",
          "Contenu": "Easy to operate and easy to use.  Updates are fine too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T16:50:12.000Z",
          "Titre": "Great product at a reasonable price"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T01:37:00.000Z",
          "Titre": "works well still sorting it out for…working on it",
          "Contenu": "works well still sorting it out for best results."
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "ari tikka",
          "Nb_Reviews": 10,
          "Date": "2023-06-07T17:01:48.000Z",
          "Titre": "It works",
          "Contenu": "It works. No fuzz buying experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mandy",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T19:13:18.000Z",
          "Titre": "A bit frustrated",
          "Contenu": "I really like using 4k Download since it allows me to save videos that are only up for a limited time.  The one issue that I've recently had was that several videos that I downloaded just disappeared without warning from the app.  It's really disappointing because they've since been labeled private by the sources so I have no way to re-download them.  If you use this app, make sure you save your downloads so that they don't suddenly disappear when you leave them in the app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mag",
          "Nb_Reviews": 2,
          "Date": "2022-08-14T07:03:29.000Z",
          "Titre": "Decent video downloader",
          "Contenu": "I have purchased the paid option for this software and I wouldn't say I was dissatisfied, but I wasn't very impressed. It seems like a good video downloader if you want high quality, fast downloads. But, if your watching videos on a phone on say a road trip, it wouldn't matter too much. In other words, you can get the same experience with other downloaders that are free, if you are planning to watch them on small devices. If you plan on watching on a laptop or desktop, it would be worth if you are having network outages or rely on hotspots to download.5/10 for looks7/10 for compatibility6/10 for reliability, download speeds4/5 overall. Definitely one of the better ones out on the market."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "helen",
          "Nb_Reviews": 72,
          "Date": "2022-04-18T11:35:00.000Z",
          "Titre": "Easy Peazy with quality",
          "Contenu": "I'm using for approx 5 yrs 4k video downloader on PC and laptop: works most of the time great. There are some glitches, the output is 95% great to watch. The 4K slideshowmaker worked until recently fine on my win 8.1 then it stopped to my dismay since it was handy while on holiday makng a quick video to send it to friends"
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Ricky Lee",
          "Nb_Reviews": 2,
          "Date": "2023-04-09T03:44:53.000Z",
          "Titre": "Overall the quality of the movie is good"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "taty gustafson",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T20:34:50.000Z",
          "Titre": "10/10 would reccomend",
          "Contenu": "4k video downloader has helped me tremendously over the last few months with downloading videos quicky. i make little video edits and i never have to worry about downloading a video when it comes to 4k because its simple to import the link and have the video downloaded! I will continue to use 4k video downloader for however long the app is running because i use it basically every day!"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Chumley_Crumley",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T21:58:26.000Z",
          "Titre": "Excellent Software",
          "Contenu": "The program makes it easy to download multiple videos simultaneously.Smart mode works well.Frequent updates to the program (all free).Support is good with a rapid response and detailed information on how to fix any problems."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Constantinos Flessas",
          "Nb_Reviews": 3,
          "Date": "2020-12-15T05:53:38.000Z",
          "Titre": "As the old saying goes 'sky is the…",
          "Contenu": "As the old saying goes 'sky is the limit' and 'there is always room for improvement', the 4 stars signify an above the average score and an encouragement to aspire towards even higher results :-)My overall experience has been always a positive one, with a high commendation on excellence in customer support. Thank you :-)"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Tobias the notorious G",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T17:48:07.000Z",
          "Titre": "The Tool is just awesome for Music Albums harvesting",
          "Contenu": "The Tool is awesome and for me the best working one (and developed since years more and more - despite the other grabbers).If you know how to use it it is fetch whole Music Albums with the correct songs!A little metadata enrichment (MediaMonkey) you have a perfect never ending source of music for offline use.Thanks to the coders and the support!If you ask me the next big thing would be to have autatically the #song Number of the Album.This is the most work you have to control and correct manually.Still great tool!"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Bharat",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T16:49:11.000Z",
          "Titre": "A Positive Experience",
          "Contenu": "1. The system/software is very user friendly and efficient. 2. The support personnel are prompt and responsive in helping to resolve problems. 3. Overall all a very positive experience."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Lev Gimelfarb",
          "Nb_Reviews": 1,
          "Date": "2021-06-12T00:11:12.000Z",
          "Titre": "Love having this tool to get the music…",
          "Contenu": "Love having this tool to get the music I find on Youtube for offline listening pleasure :) Recently it started failing, probably due to Youtube changes, and support has been responsive and a fix was released pretty quickly. Happy to have it working again!"
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T01:43:10.000Z",
          "Titre": "Light and User-friendly"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "River Slaney",
          "Nb_Reviews": 7,
          "Date": "2021-06-21T10:18:07.000Z",
          "Titre": "This is a VERY good system",
          "Contenu": "This is a VERY good system.  I only take away one star because it can, at times, be very slow to connect/read the site details and sometimes it just fails, BUT 90% of the time it works perfectly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Heizer",
          "Nb_Reviews": 1,
          "Date": "2020-04-22T17:51:52.000Z",
          "Titre": "Had a problem getting it to sign in to…",
          "Contenu": "Had a problem getting it to sign in to YouTube. Tech support was very responsive and created a new version of the software within 2 days to fix the problem. Some features are awkward (hence 4 stars instead of 5)."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Leonie Stewart",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T21:41:45.000Z",
          "Titre": "I have appreciated this product to share YouTube videos of our church services.",
          "Contenu": "I have appreciated this product to download our church services so that those who don't have access to internet can also be engaged. It is quick and easy to use and reliable."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "PATRIZIA",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T08:10:14.000Z",
          "Titre": "A \"YES\" PRODUCT",
          "Contenu": "It has always been an excellent product, even if now it's a bit slower than before and the free version allows you to download only 30 vids per day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JP",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T00:47:16.000Z",
          "Titre": "Easy and fast",
          "Contenu": "Easy and fast. Downloads videos fast."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:58:02.000Z",
          "Titre": "fms2023",
          "Contenu": "It works realy fine!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AWFordJr",
          "Nb_Reviews": 14,
          "Date": "2021-07-15T00:37:40.000Z",
          "Titre": "I am rating this 4 out of 5 stars…",
          "Contenu": "I am rating this 4 out of 5 stars because having to reinstall this with paid can be a pain sometimes. Its not an AVS kind of pain where they totally try to screw you, but its annoying sometimes.I use this for many sites not just YouTube. Its nice because I can convert videos into sound or video formats to play on my computer saving time & bandwidth.I think I got more then one software when I bought this from them but this is the only one that I use. This is one of those programs you can use one up to 2 computers which is a great deal being I have just that amount, but I reformat every 30-90 days to get that new computer feel as you can not really get all the crud off your computer otherwise. In any cause they have been nice enough to rearm my key each time & not really given me any problems, but like I say you have to wait to get it rearmed & sometimes that can take a bit.As for should you use the free version or the paid one, that is really up to you. I think I could have gotten by with the free version since I do not download full YouTube channels or multiple videos at once from a album or whatever. I bought it because I liked it not because I wanted the extra content or options.I recommend it though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "I Am Gayima",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T11:54:40.000Z",
          "Titre": "I'd like to be able to parse out audio…",
          "Contenu": "I'd like to be able to parse out audio from a youtube video that is private."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bing",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T23:25:40.000Z",
          "Titre": "Simple and easy to use."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "customer Fritz",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T15:20:08.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, quick, simple! Good price!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ian mckenzie",
          "Nb_Reviews": 2,
          "Date": "2020-06-02T14:34:36.000Z",
          "Titre": "Great software downloads videos Good …",
          "Contenu": "Great software downloads videos Good  and Cristal clear"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2023-03-03T15:19:09.000Z",
          "Titre": "Very easy to use."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "antonio crivellari",
          "Nb_Reviews": 1,
          "Date": "2020-04-23T11:48:09.000Z",
          "Titre": "good to download video and mp3",
          "Contenu": "good to download video and mp3 in you tube"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Roger Melo",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T15:15:42.000Z",
          "Titre": "I'm very satisfied with this app",
          "Contenu": "I'm very satisfied with this app! =)"
        },
        {
          "Note": 4,
          "Lieu": "LU",
          "Pseudo": "Pascal Dussausaye",
          "Nb_Reviews": 1,
          "Date": "2021-08-28T02:47:36.000Z",
          "Titre": "Great program",
          "Contenu": "Great program, works very well"
        },
        {
          "Note": 4,
          "Lieu": "GH",
          "Pseudo": "Daniel Dela",
          "Nb_Reviews": 1,
          "Date": "2020-05-08T11:24:36.000Z",
          "Titre": "Great and easy app to use."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Greg Eldon",
          "Nb_Reviews": 1,
          "Date": "2020-04-24T11:06:38.000Z",
          "Titre": "Enjoying my YouTube downloads",
          "Contenu": "Quickly back online."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Luigi",
          "Nb_Reviews": 1,
          "Date": "2020-04-13T12:23:19.000Z",
          "Titre": "It works",
          "Contenu": "It works. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "Zohar Zhao",
          "Nb_Reviews": 1,
          "Date": "2023-12-26T13:40:01.000Z",
          "Titre": "A powerful and useful app",
          "Contenu": "I tried many downloaders, and this is the only one satisfied me. It is generous for you to give us some free download credits everyday. I mainly use this app to download videos and animations from bilibili for my own collection purpose. But I found that only 480p and 360p can be downloaded. Can you fix that? Thank you very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2024-01-01T21:40:10.000Z",
          "Titre": "Reliable and the new version is clearly…",
          "Contenu": "Reliable and the new version is clearly faster. The updated UI is larger though."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ajay",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:44:42.000Z",
          "Titre": "Thanks for such a great application",
          "Contenu": "Thanks for such a great application. I use this occasionally, so the free version is more than enough for me. However, since I'm a fedora user, I'm using the portable app and found it to be using a lot CPU power when compared to the PC version. Hope this can be fixed in future version."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ed macias",
          "Nb_Reviews": 1,
          "Date": "2023-12-27T00:54:55.000Z",
          "Titre": "Customer service awesome",
          "Contenu": "Customer service awesome , despite it was my fault, they helped me to resolve the issue, you don’t find companies like this one any more"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Andrew Dickinson",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T01:44:46.000Z",
          "Titre": "Love love love 4K download",
          "Contenu": "Love love love 4K download. Can rip hard-to-find music I want on an industrial scale.App downloads swiftly and smoothly.Puzzled that it runs well only on my (newer) laptop than my fairly old PC (otherwise runs everything else well).Happy to make another donation :)"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2024-01-02T14:15:19.000Z",
          "Titre": "A very good experience",
          "Contenu": "A very good experience. It works very well."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Acon",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T22:11:32.000Z",
          "Titre": "Best downloader app I've ever used",
          "Contenu": "4K Video Downloader+ is a great tool for downloading those videos I couldn't download before, e.g. membership-only videos on YouTube channels, videos on Bilibili.com, etc.The UI is clean. Using this tool is straightforward. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T. L. Rankin",
          "Nb_Reviews": 1,
          "Date": "2024-01-01T20:41:25.000Z",
          "Titre": "Great product and service",
          "Contenu": "Great product and service, smooth transaction!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "James Cookson",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T09:27:44.000Z",
          "Titre": "Great software and service",
          "Contenu": "Great, easy software to use. I had a problem downloading a song and used the fault reporting feature within the software. This sent an email to 4k. I got a response within 24 hours with a path for resolution. Followed the instructions which worked and now downloading again.Absolutely great service for software that you can use for free with the only restriction being a maximum download of 30 songs per day."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "G Reeves",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T11:45:35.000Z",
          "Titre": "I've used 4k downloader for years",
          "Contenu": "I've used 4k downloader for years. I never upgrade free software, but I did for this. It's helped my guitar playing and podcast listening. The support is also responsive and helpful."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Roger Neale",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T19:22:11.000Z",
          "Titre": "An excellent product",
          "Contenu": "An excellent product, with so many different functions at such a reasonable price.Support is also extremely good and quick, with help coming less than 12 hours after my request.Well recommend"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Surej Kumar S",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T06:53:04.000Z",
          "Titre": "Must Try this : 4K Downloader simplest , reliable , awesome software   faster than anything else I have ever used, on any platform or device.",
          "Contenu": "over the years, I have been using 4k video downloader to download music and videos for my project. I am very glad that I found this software and service provided by 4k downloads. The limit has sometimes prevented me from downloading more files than I wanted. However, 30 files per day are awesome, given that some other apps only allow you to download a few before requiring a new account.In my opinion, it is a useful piece of software that simplifies the process of downloading music for everyday use, and the paid options are not all that expensive either. My downloads are lightning-fast, they are faster than anything else I have ever used, on any platform or device."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Patterson",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T10:31:37.000Z",
          "Titre": "I keep Getting File Path Too Long…",
          "Contenu": "Updated:Thanks for the ReplayOther than this error, it is an Excellent Product !I keep Getting File Path Too Long errors with Facebook Videos.Seems that the Video Description, becomes the Name of the Video. and Many Videos have long descriptions.Why can't the File name just be trimmed to a Length that is not too long?Or Why can't the Video Link be the File name?Every Video I try is File Path too Long.Pro Version 64 bit 1.3.0.0038"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Big T",
          "Nb_Reviews": 6,
          "Date": "2024-01-01T22:37:56.000Z",
          "Titre": "Out performs all others!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T08:50:06.000Z",
          "Titre": "This software and the people behind it…",
          "Contenu": "This software and the people behind it are both Phenomenal.  I have been a customer of theirs for years, and they are Always nice, helpful, give Great support when needed, and the software 4K is unbeatable!  Wish I could give their 4k App 10 Stars.  Works perfectly and Fast too.  :)"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "YeetMan",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T21:40:18.000Z",
          "Titre": "The best audio download software I've ever used",
          "Contenu": "4k Youtube to MP3 is quick and easy to use, and the daily limit of 15 downloads for free users is really, really good! There have been a few times where I just wanted to download more stuff but couldn't due to the limit, but 15 files a day is ridiculously reasonable, given some other apps only let you download a few before you have to make a new account and whatnot.It's free software that makes downloading music for everyday use a piece of cake, and the paid options aren't all that expensive tbh.I do have one complaint though, it takes 10-20 seconds to open on my older computer, but I let it slide because the downloads are so god damn fast, faster than anything else I've ever used, on any platform or device."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Shaughan Ask",
          "Nb_Reviews": 1,
          "Date": "2023-12-29T06:57:23.000Z",
          "Titre": "Always quick to respond to help requests"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arooj Sattar",
          "Nb_Reviews": 1,
          "Date": "2024-01-03T03:23:56.000Z",
          "Titre": "Very easy to use and work always the…",
          "Contenu": "Very easy to use and work always the way it should."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Gururaj Sharma",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T19:09:42.000Z",
          "Titre": "Excellent App!",
          "Contenu": "“I recently started using 4k Download App and I couldn’t be more impressed with its functionality and user-friendly interface. The app has made a significant impact on my daily routine, streamlining tasks and increasing productivity. The developers have clearly put a great deal of thought and effort into creating a top-notch app that caters to its users’ needs. I highly recommend 4k Download for anyone looking to simplify their life and increase productivity.”"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ethio Germany",
          "Nb_Reviews": 2,
          "Date": "2023-12-28T14:28:11.000Z",
          "Titre": "4k download is best software",
          "Contenu": "4k download is best software. best support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T21:07:33.000Z",
          "Titre": "First Class Company",
          "Contenu": "I just wanted to compliment you on a very happy experience I have had since I first bought your 4k video downloader years ago. Your updates are always prompt and when you asked me to upgrade to the latest version at the discounted rate for existing customers I did not hesitate. Thank you for fulfilling your promise on an excellent product and customer service.Peter GrilloneHoliday Island AR.USA"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "salvatore flore",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T17:14:02.000Z",
          "Titre": "wonderful software for everybody who love to play with their fantasy.",
          "Contenu": "4k is really a very useful software.  I use it very often to download videos from the net and for managing my movies mixing them with my favorite music!!"
        },
        {
          "Note": 5,
          "Lieu": "DZ",
          "Pseudo": "Imad Salhi",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T13:49:30.000Z",
          "Titre": "4k video downloader to download music…",
          "Contenu": "4k video downloader to download music and videos for my project. I am very glad that I found this software and service provided by 4k downloads"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T01:57:41.000Z",
          "Titre": "I had a problem when I wasn't aware…",
          "Contenu": "Y  I had a problem when I wasn't aware I needed to save my key number but your staff was courteous and helpful your service is safe (spam free) and reliable.  The start up steps seemed a bit confusing but after I got them down your product worked perfectly."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Fabio Amaral Di Fini",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T14:46:02.000Z",
          "Titre": "A Very Friendly, Fast and Reliable Capture Software",
          "Contenu": "In my opinion, and I use this software very frequently, \"4K Download\" is the best option for capture of videos and films in the Web. It's fast, precise and very reliable, providing allways a good result when you look for obtaining this kind of \"pieces\" from the Internet."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Tomajjs",
          "Nb_Reviews": 9,
          "Date": "2023-11-16T15:48:15.000Z",
          "Titre": "I love this app",
          "Contenu": "Made my time using YouTube so much easier and better. It is now so easy to download YouTube videos more than ever before! I really love this app. It has an epic Windows app and also has an Android app! If I could give more stars, I would. It also has a lot of customization! If you're looking for an easy way to download YouTube vids, I recommend this from the bottom of my heart."
        },
        {
          "Note": 5,
          "Lieu": "KH",
          "Pseudo": "Nika",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T14:24:05.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "I like to use educational YouTube videos to enhance lessons in classroom as well as for my own learning, but it is not always possible to stream them directly. This is why this program is so useful, I decided to fork out for the premium version, which I hardly ever do these days. Usually going for the paid version for an app that works well as a free one is a big disappointment, but not this time. Moreover, the two times I reported a problem, and just like before, I received a response the very next day, with a suggestion how to remedy it, that worked perfectly.  I've seen video downloaders come and go in a rapid succession so I consider the price  of the premium version a reasonable investment."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer Pasi",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T04:44:56.000Z",
          "Titre": "I have to say that the program does what it claims…",
          "Contenu": "I have to say that the program does very good job at least for me. It down' load the whole play list if wanted and shows for the process. The download speed depends mostly external influences that can't be controlled by the program.  Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Tobi W.",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T14:52:57.000Z",
          "Titre": "Great Service!",
          "Contenu": "Had a question about my Lizenznumber (I ´ve lost it). Catherine form 4KDownload anweserd me immediately anvery friendly. I could solve my problem without any problems. It works again. Great Service!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T00:43:19.000Z",
          "Titre": "Onlinechurch service downloads…",
          "Contenu": "Our church produces an online service every week.  I download this and produce DVDs of the services for people who do not have internet access.  I also often download YouTube videos for use during normal church services.  4K makes it very easy, especially when I find myself behind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Salvatore Migliore",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T16:25:21.000Z",
          "Titre": "Best tech support anywhere.",
          "Contenu": "I had a problem using 4k Download so I emailed their tech support and what amazed me about them was how FAST they got back to me.I have never experienced that with tech support before.They solved my problem very quickly.It's a great program and an even greater company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel Romero",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T02:46:10.000Z",
          "Titre": "4K DownloadRaving Review: 4K Download - The Best Video Downloader! is",
          "Contenu": "4K Download is, without a doubt, the ultimate video downloading app I've encountered! Its user-friendly interface makes it a breeze to use, and you can't go wrong with it. What sets it apart is the developers' commitment to keeping the app up-to-date, ensuring any issues that arise are promptly addressed and keeping pace with emerging technologies. And let's not forget their lightning-fast support and unbeatable pricing – it's a package that's hard to beat!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sepal Tura",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T23:17:20.000Z",
          "Titre": "Excellent software",
          "Contenu": "4k stogram is an excellent software to download any videos you like from the Instagram! Actually, it’s a great platform to download videos from other social media as well i.e. Youtube, Tiktok, even from any other website!Especially I will recommend 4k Stogram to everyone on instagram because it lets you to download all the posts from your favourite creator by just a single click! The people you follow from Instagram won’t be away from you anymore. It’s like a magic software which will keep all the posts and stories of your following accounts in a single hub. Try to use the latest version of this software to utilize all the benefit from the 4k softwares.I will also recommend 4k tokkit for the people on tiktok because it also gives you similar advantage as 4k stogram and lets you to download posts from your favourite creators. You can also download single video by simply copy pasting the link in the software.Overall, it’s a great tool for your gadget!! Thanks a lot 4k teams for keeping this wonderful platform!!"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Chan park",
          "Nb_Reviews": 1,
          "Date": "2024-01-01T22:54:18.000Z",
          "Titre": "Very exllent good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marco",
          "Nb_Reviews": 3,
          "Date": "2023-10-16T20:26:46.000Z",
          "Titre": "So far this does exactly what it…",
          "Contenu": "So far this does exactly what it claims, and it is painless! I just downloaded the app yesterday, and am very pleased with the ease of operation, and the download speeds. I have already converted over 50 songs without any issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Wilbraham",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T15:07:02.000Z",
          "Titre": "Several years of using 4K Download",
          "Contenu": "I have been using 4K Download for a few years and depend on it.  When I find something on YouTube that I want to share I save it on 4K and often later convert it so I can make a DVD of it. Saving it also makes it easy to find again on YouTube when I want to email the URL to someone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Arnold",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T21:38:27.000Z",
          "Titre": "Easy to download, install and use.",
          "Contenu": "Easy to download and install on both my desktop and laptop computers.  Did a couple of YouTube video conversions to mp3.  No problems encountered and hard to believe it would work with such a simple interface! Primarily using it to convert worship videos to an mp3 format, trimming them down and putting them on a CD in a wav format."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T10:35:11.000Z",
          "Titre": "Recommended Program",
          "Contenu": "well , there is opensourced ytdlp for everyone to use also have gui repo , however I still buying 4kdownloader just because its nice gui and auto updates which really helped my when I'm lazyvery recommend to who don't know how to use other free way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "gamingfacts gamingfacts",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T00:20:40.000Z",
          "Titre": "Best Way To Download Videos!",
          "Contenu": "I've personally have been using 4K downloader for years, despite your first thoughts on the program because of the name, it is the best way to download videos with all of it's options and features there is no better place to get your footage. Also no potential malware that you might get from other sources!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Pencil Points",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T14:55:16.000Z",
          "Titre": "Big up customer support, and the 4K dev team.",
          "Contenu": "I don't normally do reviews, at all, anywhere, not my bag. But two days ago I had issues with the software's functionality, so I emailed customer support. And got a very prompt, polite and helpful reply, and last night the dev team rolled out an update that resolved the issue. Can't fault that, so here I am, typing something. Bravo 4K Download team, you win. \\o/"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave T.",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T21:31:10.000Z",
          "Titre": "Great Program for a great price",
          "Contenu": "Program works extremely well. Intuitive interface.  Pretty much install, look over the short menu's and use it. Great piece of software and the price is super also."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlo",
          "Nb_Reviews": 7,
          "Date": "2023-10-20T01:02:44.000Z",
          "Titre": "Great Customer service by Olivia!",
          "Contenu": "I have used 4K products for over 2 years.  It has always been a great suite and updates were flawless.  Recently I tried to use their \"Stogram\" product for the first time and could not get it to work.  I contacted 4K using their contact form and very shortly heard via email from \"Olivia\".  She asked questions about my version of Windows and in a very short time, gave me explicit instructions on what to do AND it worked!  Olivia is a keeper!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Keira",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T10:29:27.000Z",
          "Titre": "Best downloader in the game!",
          "Contenu": "I have been using this software for years now, since 2019, and I would never look to another downloader.It is so simple to use and it is super efficient! Even the free version is a great tool.No risks of viruses,  no ads stopping you from downloading, notifying you when you open of bug fixes,  ITS GREAT! The daily limit for free users is quite chunky too at 30 videos!Would recommend to EVERYONE!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A Salinas",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T16:34:01.000Z",
          "Titre": "4K Download is a good program at a fair price",
          "Contenu": "I like the ability to download certain videos on the internet and 4K Download gives me that ability. I can download most videos; but certain videos in X-Twitter I can download them too; but it doesn't retain the videos for some reason on a permanent basis. I'm still experimenting with the program. It is worth the money as far as I'm concerned."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robb",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T21:31:52.000Z",
          "Titre": "I never give 5 stars",
          "Contenu": "I never give 5 stars in a review and I complain about everything!  Except 4k download, other than being able to sort a song list, it does everything perfectly and I thank you for a great product."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Raiven",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T08:06:22.000Z",
          "Titre": "A happy user",
          "Contenu": "Excellent....Automatic download of .srt files (subtitles) while downloadin videos from Youtube is an excellent feature 4K Download has offered. Absolutely loved it. Please keep this feature forever free for everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D. S.",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T17:22:51.000Z",
          "Titre": "As a user of the 4K Downloader + Professional",
          "Contenu": "As a user of the 4K Downloader, the 4K Downloader + is a must upgrade.  The overall layout and improvements to this program is definitely worth the upgrade. I was happy with the 4K Downloader, but the 4K Downloader + is simply a revamped, vastly improved version.  It's obvious that the developers have taken user input and their own technical analysis of how to improve the program into mind. All you have to do is download and startup the 4K Downloader + to immediately be pleased at the new, easier format to download file.  Great job 4K Downloader + developers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Wuthrich",
          "Nb_Reviews": 4,
          "Date": "2023-11-10T01:30:15.000Z",
          "Titre": "I've been using 4K download for a few…",
          "Contenu": "I've been using 4K download for a few years and it's been a great utility app.  Updates are appreciated and easily loaded.  Thanks for a great app!"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Nour Almashaek",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T18:20:00.000Z",
          "Titre": "THE BEST",
          "Contenu": "wow it's really the best program to download videos for sure , easy to use and you can even download the entire playlist in YouTube . Thanks for that ."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Marie Ray",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T16:15:01.000Z",
          "Titre": "It downloads LOOKING like it is going…",
          "Contenu": "My apologies.  When you're wrong, admit you are wrong.  I was not aware [my excuse - working from a phone] that this tool is for YouTube videos; I was downloading from a different platform.  Retracting my 1🌟 rating.  Explains below.It downloads LOOKING like it is going to work ... and NEVER has the video.  Black screen every time.Frustrating as heck.  ALL days - not just today."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Mikka",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T09:10:37.000Z",
          "Titre": "Worked great",
          "Contenu": "Worked great! I got the 5 app \"4K Download Bundle+ Pro\" which included the android app, and absolutely loved it! I'm a return customer of the original 4kvideodownloader app, these guys are great! highly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abe Ibrahim",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T18:12:41.000Z",
          "Titre": "The 4K Download software simply the best...hands down.",
          "Contenu": "The 4K Download software is the most reliable tool that makes it intuitive to use and produce the best output in quality; it also makes it easier to capture library lists in one operation. This aside, I can't say enough about their support and their quick response to help answer any question and help their customer to ensure 100% satisfaction... I LOVE it and love ALL their staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos  Gomez",
          "Nb_Reviews": 3,
          "Date": "2023-07-31T18:59:02.000Z",
          "Titre": "The first download didn't work",
          "Contenu": "The first download didn't work. After two more attempts, with a fresh download each time, the program began functioning without glitches. Seems to work fine now and has much faster downloads than the previous version."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Peter Runting",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T09:50:59.000Z",
          "Titre": "Had an issue with activating a copy.",
          "Contenu": "Had an issue with activating a copy of 4K Download. I contacted support, Liza got back to me and resolved my problem VERY quickly. Thank you Liza!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brendon H.",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T16:57:09.000Z",
          "Titre": "Works well",
          "Contenu": "The UI has a learning curve, and by that I mean you have to actually explore it for a few minutes, not try to immediately get things going like I did, then it's easy to navigate. The program itself does everything I need it to."
        },
        {
          "Note": 5,
          "Lieu": "BH",
          "Pseudo": "All Might",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T22:37:55.000Z",
          "Titre": "New Impression",
          "Contenu": "With the previous version, my subscription list get deleted after every reboot or so, so I had to add the list manually every time I see new video for the channels I follow. This is the main reason I had to upgrade for the new version which seems to work fine as intended. I appreciate your support and excellent application."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T17:03:36.000Z",
          "Titre": "Hello people",
          "Contenu": "Hello peopleWell, the program is clearly designed and built. The friendly environment makes it easy to use.About a year ago there was a problem with the reinstallation. What happened? The service helped me quickly and objectively, and the problem was solved. Conclusion: Everything is great. Keep up the good work. ThanksGreetingsBerni from Germany"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T23:15:10.000Z",
          "Titre": "New Version of 4K Downloader",
          "Contenu": "This new iteration of the application is easier to use and is very informative in terms of tracking the progress of down loads.  It also carries forward the best aspects of the previous version.  For example, you can download and process a single item or all of the items in a list, such as individual songs in an album."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve Aleppo",
          "Nb_Reviews": 9,
          "Date": "2023-07-26T21:55:08.000Z",
          "Titre": "Best of the bunch by far",
          "Contenu": "Have used this software for years. I would never pay a monthly subscription for anything but am happy to pay a one off fee and for upgrades. This program is one of the few that is truly excellent in every way. Have just upgraded to their new version and can't wait to get started. Customer service is amazing and the software is like nothing you will have ever used before. It is simple, super efficient and worth the money. How many items could you honestly say that about in your life? Buy it, you will not regret it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen Crow",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T19:46:25.000Z",
          "Titre": "Do the Upgrade . . . It Is Worth It !",
          "Contenu": "I have used the paid version of this software for years and had not one minute's hesitation about the recent upgrade.MONEY WELL SPENT ! The 4K Video Downloader+ upgrade is fantastic. Well done friends !"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Dongseok Lee",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T18:21:21.000Z",
          "Titre": "Please give me a fully refund.",
          "Contenu": "Please give me a fully refund.I send email your account \"support\" My address is \"4295102~\" I have attached my receipt.and I have never activated and used your product key. please give me a fully refund for my purchase."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Didier Martin",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T20:13:15.000Z",
          "Titre": "A great software that allows me to save…",
          "Contenu": "A great software that allows me to save the best moments of YouTube videos"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Norm Wilkins",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T19:25:09.000Z",
          "Titre": "Very reliable and they are always…",
          "Contenu": "Very reliable and they are always improving this.  They also provide rapid responses to customer queries.   I wish they would make Amazon Prime and Netflix downloads also.  Come on guys, do it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T17:46:11.000Z",
          "Titre": "The software just works.",
          "Contenu": "The software just works.I have a couple of issues over the years and each time the support team responded very quickly.This is by far the best supported software I own or use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Villapiano  NYC",
          "Nb_Reviews": 5,
          "Date": "2023-11-02T03:48:36.000Z",
          "Titre": "Fast & Easy",
          "Contenu": "Fast and easy... so much better than recording manually! Daniel Davis Deep Dive on YT approves!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Alexandre",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T11:16:48.000Z",
          "Titre": "I enjoy use 4K Download for personnal purpose",
          "Contenu": "I just use 4K Download for personnal purpose. I love all music and 4K Download allows me to listen to full music tracks rip from youtube. Otherwise I go to concerts to listen to the musicians I like."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "David Little",
          "Nb_Reviews": 3,
          "Date": "2023-09-09T00:28:49.000Z",
          "Titre": "Super fast",
          "Contenu": "Downloads super quick and if you convert to audio takes almost no extra time, the new search feature looks good but I haven’t tried it yet"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T17:23:03.000Z",
          "Titre": "The download and use is so simple",
          "Contenu": "The download is simple. It is very easy to understand and use. I have found it incredibly helpful in downloading my favorite music videos. My focus is on Austrian folk music. This app is a joy to use."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "MD FAYSAL",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T04:39:22.000Z",
          "Titre": "nice",
          "Contenu": "Great app that is pretty intuitive. But what stands out is their support! Responsive and helpful. Unusual for sure!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T08:44:45.000Z",
          "Titre": "Great app with great support",
          "Contenu": "Great app that is pretty intuitive. But what stands out is their support! Responsive and helpful. Unusual for sure!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Duane DeSalvo",
          "Nb_Reviews": 5,
          "Date": "2023-11-01T20:48:45.000Z",
          "Titre": "4K Download makes it so easy to…",
          "Contenu": "4K Download makes it so easy to download YouTube videos in literally seconds! The only way to do it as far as I’m concerned!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Benoit Paquette",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T20:18:23.000Z",
          "Titre": "Better, faster than Firefox add-ons.",
          "Contenu": "Better, faster than Firefox add-ons.Do not work here -- > www . ffctv . church / wednesdaylive"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Yerha",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T17:28:39.000Z",
          "Titre": "a good helper to download youtube…",
          "Contenu": "a good helper to download youtube viodes, it will be best if adding shut down the computer after the download list is completed."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Joseph Lizzio",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T16:14:39.000Z",
          "Titre": "Great Product",
          "Contenu": "In the world of video downloading software, 4K Download Software stands out as a robust and user-friendly solution. Its intuitive interface, support for a wide range of platforms, and commitment to high-quality downloads make it a top choice for anyone looking to build their own video library. Whether you're a casual viewer or a content creator, 4K Download Software has the tools to enhance your media experience."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Luke Vincent",
          "Nb_Reviews": 5,
          "Date": "2023-08-16T18:58:08.000Z",
          "Titre": "Beautiful and professional software.",
          "Contenu": "They stand behind their products. Support is first class. I have been using 4K downloader for a number of years, it's first class! Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "lonelyfencepost",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T19:16:11.000Z",
          "Titre": "Thoughts after 1,100 downloads",
          "Contenu": "Thoughts after 1,100 downloadsThe new 4k video downloader is outstanding. I used it for free for a very long time and have since bought the professional license (as I do with several paid programs.) The developers are very lenient with the free version, as you can use it forever and the requests to buy a license aren't too invasive. I personally found the license worth it, as it's not a subscription, and it's not that expensive either. The program is also constantly updated which is a very nice thing to have. You also have the option to download as an mp3 file or a couple other audio files.The program does exactly what I want it to do. The only thing I would want to be added is for the video files to be marked with the date they were downloaded (similar to how when you take a photo with a camera, the file has the \"date modified\" marker on it, which is helpful for sorting what is most recently downloaded while using the file explorer instead of the actual app itself.) I also wish there was the ability to turn off the popup when the program is updated, because every time you update the app, your browser will open and take you to the 4k downloader website saying \"Thank you for downloading\" regardless of whether you have the license or not, and there's no way to turn it off. Occasionally the program will sometimes switch the download file format to mkv or m4a, which I wish was changed (or a setting to change the defaults) because those two file formats are unusable for me, for various reasons."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr James Harper",
          "Nb_Reviews": 8,
          "Date": "2023-12-08T20:24:55.000Z",
          "Titre": "It does as it says it will do",
          "Contenu": "Program works as it should do. Assistance is first class."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kevin kevin",
          "Nb_Reviews": 4,
          "Date": "2023-08-01T19:17:42.000Z",
          "Titre": "Thank you for the fast fix!",
          "Contenu": "Thank you for the fast fix where starting the software after initial use forced user to stop the service in task manager before it would start until a computer restart!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Kunde",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T03:32:46.000Z",
          "Titre": "This allows you to quickly and easily…",
          "Contenu": "This allows you to quickly and easily save videos or even entire playlists - if desired, even with subtitles automatically translated into all languages."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Cyber",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T07:11:45.000Z",
          "Titre": "Very Good Product",
          "Contenu": "I have no complaints, it has 30 free downloads and can download in many formats, amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ST",
          "Nb_Reviews": 5,
          "Date": "2023-12-26T07:55:13.000Z",
          "Titre": "Easy and fast download",
          "Contenu": "Easy and fast download.  Application is very Intuitive."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Happy customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T00:37:12.000Z",
          "Titre": "Ease of use",
          "Contenu": "Ease of use. Great file conversion and bit rate selection. Fast download speed."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "WCC",
          "Nb_Reviews": 6,
          "Date": "2023-08-13T09:19:19.000Z",
          "Titre": "Licence key don't work",
          "Contenu": "Updated review (13/08)There was some confusion between 4K Download and 4K Download +. The license key did work.Nonetheless, for other reasons, I requested a refund and they accepted it within hours. Of course, they asked why, which is a legitimate question and 3 days later I had the refund.I cannot comment on the software as I have not used it but the experience with the company ended up much better than initially expected. Therefore I am updating the review.------------------------------Original review:I have just purchased their bundle which gives me access to all their product with the pro license.The transaction went smoothly and I immediately got the licenses.I downloaded 4k Video Download and the license did not work. It says \"Can't activate ...  please enter the correct key\".Did I copy-paste the wrong key (I received 5)? no, it was the correct key.I sent an email to their support.I then decided to try another of their app. After all, I paid for a bundle.I installed 4K Video to mp3.  There is nowhere to activate the product or check the subscription...I am starting to wonder.They claim I can request a refund within 14 days of purchase. Let's wait and see for a few days for their support to respond.Hopefully, I will not have to ask for a refund and won't have to write another review saying they never refunded me.Fingers crossed."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert",
          "Nb_Reviews": 8,
          "Date": "2023-09-05T11:30:24.000Z",
          "Titre": "Excellent products and customer support.",
          "Contenu": "I use both 4K video & mp3 downloader, both are excellent products. Customer support also excellent, had a problem with MP3 downloader which I reported and had a response within 24 hrs."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert Smart",
          "Nb_Reviews": 17,
          "Date": "2023-08-01T20:23:57.000Z",
          "Titre": "4K Download just seems to get better . . .",
          "Contenu": "4K Download just seems to get better and better, and subjectively at least quicker to download files.So much so, I upgraded to the full version!"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T19:02:16.000Z",
          "Titre": "Happy for more than 8 years",
          "Contenu": "I bought 4k video downloader 8 years ago and have been happy with itsince, it just works and it keeps getting updates on top of a greatupdater. So when I read the announcement of the new 4kvd+ I was a bitworried they would also jump the train on some kind of subscriptionmodel. When I saw this is not the case and I also get a loyalty discountI instantly bought it and just wanted to say thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chester Paul Sgroi",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T06:26:34.000Z",
          "Titre": "Works as Advertised",
          "Contenu": "This program was easy to purchase and use in that it performed as advertised without being overly complex or memory intensive; thank you! :-)"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "hans loon",
          "Nb_Reviews": 7,
          "Date": "2023-08-01T13:38:30.000Z",
          "Titre": "heb nog nooit zo een goed progam gezien…",
          "Contenu": "heb nog nooit zo een goed progam gezien super een dikke 10 dank hans holland . 4K the best of the world"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Simon Clarke",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T12:51:41.000Z",
          "Titre": "super quick service",
          "Contenu": "Had an issue and was advised of a fix within hours, fantastic quick service and quality products too."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Johann",
          "Nb_Reviews": 6,
          "Date": "2023-09-09T12:13:55.000Z",
          "Titre": "The program is easy to use",
          "Contenu": "The program is easy to use. I have already downloaded some YouTube videos. In any case, The program is worth the money. I definitely recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Rayl",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T16:05:14.000Z",
          "Titre": "Needed customer service help with app license",
          "Contenu": "While setting up a second computer, one I could use away from my desk, I was not able to locate the license number for an important app, 4K Downloader. I’m a newbie woodworker and like to d/l YouTube videos that teach me about my new hobby. I often watch the same video several times in a row to drill the information into my brain. 4K Downloader makes downloading and saving videos a snap.But I had lost the license number and that meant contact with the dreaded “Customer Service.” It seems to me that “service” to the “customer” has become less and less service and more and more a rebuke to the customer.Customer Service at 4K Downloader blew me out of the water. Not only was the response prompt, it was also polite, appreciative of my usage of the product, provided the information that I needed, and urged me to contact again if there were any difficulties with setting the app in place.My experience is that if I really want a certain item, I’ll buy it whether or not the salesperson is helpful. But, if the service personnel are not helpful when needed, I never return to that store. Good customer service keeps a customer happy. Excellent customer service, such as I received from 4K Downloader, makes a customer a life-time customer.Who can ask for more than a great product and excellent customer service."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T06:23:47.000Z",
          "Titre": "Thank you",
          "Contenu": "Thank you. I'm somewhat illiterate as far as the computer is concerned therefore unable to make any comments"
        },
        {
          "Note": 5,
          "Lieu": "MU",
          "Pseudo": "Avish Ramgolam",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T11:43:11.000Z",
          "Titre": "Using 4K Download Since 2015",
          "Contenu": "Since 2015, I've been a dedicated user of 4K Download's Professional version, and my experience has been outstanding. The software’s efficiency in managing high-quality video downloads and conversions is unparalleled. What sets 4K Download apart, however, is its remarkable after-sales and customer support, showcasing professionalism and promptness in resolving issues.Recently, I upgraded to the Bundle version, further expanding my toolkit. This version integrates various functionalities, enhancing my capability to handle a wider range of video processing tasks with ease. Both versions impress with their user-friendly interfaces, catering to both tech-savvy individuals and beginners.The consistency in performance, reliability, and timely updates are aspects that I particularly appreciate. Each new version brings improvements that enhance the user experience significantly.In summary, 4K Download, both in its Professional and Bundle versions, is a testament to quality and efficiency in software design. It’s an invaluable tool for anyone needing advanced video downloading and processing capabilities, backed by exceptional customer service."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Ahmed Mohammed Ashraf Badr Gam",
          "Nb_Reviews": 5,
          "Date": "2023-11-16T18:24:54.000Z",
          "Titre": "Awesome company and products, looking for more.",
          "Contenu": "I recently had the pleasure of using 4Kdownload products, and I must say, they have completely transformed my content consumption experience. Whether you're a music lover, video enthusiast, or just someone who appreciates high-quality downloads, this suite of tools is an absolute game-changer.First and foremost, the user interface is incredibly intuitive. Navigating through the software is a breeze, and the sleek design adds a touch of elegance to the overall experience. From the moment you launch the application, you can tell that the developers have put a lot of thought into creating a user-friendly environment.One of the standout features for me is the ability to download videos and playlists from YouTube in stunning 4K resolution. The download speed is impressive, and the quality of the videos remains uncompromised. This is a game-changer for anyone who wants to enjoy their favorite content offline without sacrificing visual fidelity.Moreover, the software supports a wide range of platforms beyond YouTube. Whether you're into Instagram, Vimeo, SoundCloud, or even Facebook, 4Kdownload products have covered you. The versatility is outstanding, and having a single solution for all your downloading needs is refreshing.What truly sets 4Kdownload apart is its reliability. I've tried other downloaders in the past, and they often fall short of consistency. With 4Kdownload, I've experienced minimal issues, and any concerns were promptly addressed by their responsive customer support team. They prioritize user satisfaction.The software is regularly updated, ensuring compatibility with the latest changes on various platforms. This commitment to staying current and adapting to evolving online environments gives me confidence that I've invested in a product that will stand the test of time.In conclusion, 4Kdownload products have exceeded my expectations. If you're someone who values convenience, top-notch quality, and a seamless user experience, look no further. This suite of tools is a must-have for content enthusiasts, and I can't recommend it enough. Kudos to the 4Kdownload team for creating such a remarkable product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sal Carone",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T17:42:42.000Z",
          "Titre": "I really like your product",
          "Contenu": "I really like your product. They are easy to use and never had any technical difficulties. Would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Angus Bell",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T16:55:15.000Z",
          "Titre": "Great software",
          "Contenu": "Great software. Works well and easy to use. Have recommended it to friends! Good online support as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T17:55:06.000Z",
          "Titre": "Okay",
          "Contenu": "Okay, it's been a great program for a long time, I recommend it to everyone, I really liked it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T23:27:11.000Z",
          "Titre": "Quick downloads",
          "Contenu": "Quick downloads!   Great GUI.   Well designed!   I haven't used the other programs; but I'm very pleased with Downloader+"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Joseph Yeo",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T23:24:17.000Z",
          "Titre": "Excellent product and affordable too.",
          "Contenu": "Have been using this product for years with no problem.  Happy to upgrade to support a good product that cost less than a burger meal."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "nightmare42",
          "Nb_Reviews": 7,
          "Date": "2023-11-02T14:10:51.000Z",
          "Titre": "Great support",
          "Contenu": "4K Download provided a  prompt response to my question and a solution"
        }
      ]
    }
  ]
}