{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "800.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T11:59:32.000Z",
          "Titre": "Not very helpful or personable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Former Accion customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-24T19:40:01.000Z",
          "Titre": "Don't do it",
          "Contenu": "I signed up to 800.com and there was a  problem with my number, which would not allow me to dial out. I asked for a credit, which I did not receive. I was not able to use my minutes that I'd paid for. A representative told me that a supervisor was going to call me back. I never received that call. I attempted to pay for the second month and the website would not take my PayPal payment. I called PayPal who said the company 800.com's website appeared to be caught in a loop of some sort and I should try a different browser. I tried a different browser and it still wouldn't work. I keep trying to pay it and the 800.com website won't accept my payment. Right now, when clients call my 800 number they get a busy signal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "H. L",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T23:07:52.000Z",
          "Titre": "Overpriced And Time Consuming",
          "Contenu": "I wanted something temporarily, simple for my startup. Basically, a number to satisfy one of the \"many\" bureaucratic requirements that go hand in hand with setting up a corporation. While waiting for my online platform to launch.I found the interface time consuming and the AI voice? Terrible. Worst of all, \"800.com\" kept charging my card after I CANCELLED the service and was clearly not using it for months."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T18:58:06.000Z",
          "Titre": "Serious Limitation",
          "Contenu": "Serious LimitationsThis tool only allows for 60 second voicemails...which means people get cut off in the middle of trying to explain their issue. Not helpful!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dr. S. Tejeda",
          "Nb_Reviews": 2,
          "Date": "2022-12-02T00:52:31.000Z",
          "Titre": "ABSURD",
          "Contenu": "Our company was interested in a vanity number that they had. We were informed that it couldn't be ported out but only leased and a subscription was needed in order to lease it. The subscription is quoted at $260 & the lease $970. This includes no services. It's absolutely absurd."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-05T19:36:43.000Z",
          "Titre": "very bad service",
          "Contenu": "very bad service. account is removed any time. he does not send any mail or update. customer service is very week. specially mr. Ray. having no information."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T08:04:41.000Z",
          "Titre": "Deceptive Fees",
          "Contenu": "I paid for a year upfront “to save $48 in additional fees”. I authorized a $228 charge but they charged $269.04 to my card. When contacted, they said this was for “federal and other fees”. I told them this is very misleading and those fees should have been revealed up front. Number cancelled."
        },
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "swift Swift",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T22:21:32.000Z",
          "Titre": "Very bad cost of service",
          "Contenu": "Very bad cost of service. And you did not approve my account"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Israel Chery",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T03:15:17.000Z",
          "Titre": "OOMA my telephone service provider…",
          "Contenu": "OOMA my telephone service provider advised me that 800.com wouldn’t release my 8774267552 number"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T22:20:06.000Z",
          "Titre": "They took money of my card & asked me…",
          "Contenu": "They took money of my card & asked me to send my confidential documents which upon request was cancelled so i asked for refund. Instead of refunding they activated the accou nt & said you cannot get refund & never receiced a single incoming call on that number & took my money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will rene",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T18:10:37.000Z",
          "Titre": "Don't used this they have fake…",
          "Contenu": "Don't used this they have fake advertising offers unlimited calling supposedly and then when you used 2500 minutes bang they said you need to paid 200 for 5000 minutes that's nothing don't used this company bad experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T15:45:45.000Z",
          "Titre": "My 800# wont even call forward and they…",
          "Contenu": "My 800# wont even call forward and they have no live chat, no customer service online box , these people are not on topOf their game!!! PS your iOS doesnt even work!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deborah Baker",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T18:59:24.000Z",
          "Titre": "Your representative lead me to believe…",
          "Contenu": "Your representative lead me to believe that I could have a specific toll-free number, and after I was charged, then it was reviled that you only forward numbers, you don't actually have toll-free numbers"
        },
        {
          "Note": 1,
          "Pseudo": "P. Lands",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T17:30:09.000Z",
          "Titre": "Personally I do not agree with the cancellation difficulty",
          "Contenu": "Personally I do not agree with the slowness and difficulty of cancelling your 800# service. This needs to be rectified by 800.com . They make it very difficult, and its been over 82 Hours since I sent the email to cancel and still no response. Not e ven an auto  - responder email. 800.com , just MAKE IT EASY TO CANCEL ON YOUR WEBSITE, OK? This really sucks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James  Pehringer",
          "Nb_Reviews": 3,
          "Date": "2021-10-04T16:40:57.000Z",
          "Titre": "WE ARE WAITING FOR YOU TO PORT OVER MY…",
          "Contenu": "WE ARE WAITING FOR YOU TO PORT OVER MY PREVIOUS 800 NUMBER???"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T19:23:16.000Z",
          "Titre": "Flawed and VERY difficult to set up.",
          "Contenu": "Flawed and VERY difficult to set up. And the support that followed was just as bad as the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kemo Richardson",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T03:35:07.000Z",
          "Titre": "I’m not impressed",
          "Contenu": "I’m not impressed, I got a 833 number that’s 11 digits long."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T14:35:39.000Z",
          "Titre": "Still waiting on my number"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scoty",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T15:33:36.000Z",
          "Titre": "I have called and sent email with no…",
          "Contenu": "I have called and sent email with no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sonya",
          "Nb_Reviews": 1,
          "Date": "2020-12-12T00:24:22.000Z",
          "Titre": "Called customer service for help & John…",
          "Contenu": "Called customer service for help & John referred me to a e-mail that he will send me. I am not completely set up."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Jishanth Boda",
          "Nb_Reviews": 2,
          "Date": "2020-04-21T10:31:02.000Z",
          "Titre": "Had bad experience"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:39:47.000Z",
          "Titre": "you signed us up for one price and bill…",
          "Contenu": "you signed us up for one price and bill us for a much higher rate"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T22:34:07.000Z",
          "Titre": "This is a fairly subpar service…",
          "Contenu": "This is a fairly subpar service provider - calls are delayed and there's a 1-2 second lag between the speaker and the caller. Their website sometimes doesn't let me make calls. No idea why, it just doesn't. You can't make calls from a landline or your phone. And it's pretty expensive for what it offers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T00:27:37.000Z",
          "Titre": "forwarding number instructions do not work",
          "Contenu": "I can't read the instructions on how to forward the number"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Big waste diva dumpsters",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T17:33:56.000Z",
          "Titre": "It rings it doesn’t ring it works and…",
          "Contenu": "It rings it doesn’t ring it works and doesn’t work. The excuses are endless. Until I can find something better than 800.com I’m stuck with them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 2,
          "Date": "2020-11-16T15:16:21.000Z",
          "Titre": "Review",
          "Contenu": "800.com kept inserting their own advertisement. It stated to the caller to purchase a phone number from 800.com after the caller dialed the number and before prompting them to leave a message. It gave the impression that the caller must have reached a wrong number. I have a paid service and this is so inconvenient. On 3 separate occasions i removed the advertisement and had to reset my own message each time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2020-10-08T13:55:34.000Z",
          "Titre": "The best feature is the recording",
          "Contenu": "The best feature is the recording. System has issues we reported were supposed to get a call back never did. Hope they take our suggestions as some things don't make sense."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glen",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T01:19:26.000Z",
          "Titre": "Just ok",
          "Contenu": "Just ok, what more can I say."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T20:25:17.000Z",
          "Titre": "The quality of your calls is choppy.",
          "Contenu": "The quality of your calls is choppy.CS is great, but I'm not sure I will continue next month if the choppy robotic quality is not resolved"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T05:29:42.000Z",
          "Titre": "Site is better, Price is much worse",
          "Contenu": "The site has improved drastically over the years, but at a significant cost to the consumer. I don't like the price structure now at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T04:31:10.000Z",
          "Titre": "They can be a little more available",
          "Contenu": "They can be a little more available. Because I had some  question."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T19:30:01.000Z",
          "Titre": "Slow to get my 1833 number working"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lebrosha",
          "Nb_Reviews": 1,
          "Date": "2020-09-15T20:16:06.000Z",
          "Titre": "We keep getting robot calls that we are…",
          "Contenu": "We are getting robot calls with no one on the call the last 2 months. We never received calls like this until July. Thank you for calling me to address this issue. Though I don't understand why they have started or why they are silent with no one on the call. I understand that I am not being charged for them and I appreciate that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T18:52:46.000Z",
          "Titre": "The 800 functions is not what I thought…",
          "Contenu": "The 800 functions is not what I thought it would be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "N.A.",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T15:33:25.000Z",
          "Titre": "Useful",
          "Contenu": "The customer service reps are courteous. There is a problem in that greetings cannot be easily deleted and restored. Also, invoices are not delivered (by email or by post) unless explicitly requested. That seems odd. Overall, I recommend the service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "province",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T23:08:23.000Z",
          "Titre": "Price is right service is great",
          "Contenu": "Price is right service is great. Just wish I could call out from my 800 Number. I curretley pay for 2 services because I cant call out"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sandra- Parry Sound, Ont Can",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T19:20:13.000Z",
          "Titre": "I am impressed with how much they want…to make me feel that I am confident in using this",
          "Contenu": "I am impressed with how much they want to make me feel like I am a valued customer. Just checking up and making sure that I am doing alright. So far its been great. Still learning all about it but day by day I am learning something new."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barnes Sisters In sales",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T19:18:32.000Z",
          "Titre": "As entrepreneurs and realtors in…",
          "Contenu": "As entrepreneurs and realtors in multiple states and counties, my business partner, and I also sisters decided to start the process of marginal business together to collaborate on all fronts. We decided to go with 800.com so that we could have one a number that was close to customization easy to remember and also Flexibility. The capabilities options to choose which one to speak to a general voicemail. The option to text the calls and also to have a log on our app is an excellent resource."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T23:01:45.000Z",
          "Titre": "Easy and affordable",
          "Contenu": "Easy and affordable. Great functionality. Customer support was fast and helpful. I only wish it were more explicitly clear and documented that we own our new 800# number and can port it away from 800.com anytime for any reason if we ever want to or need to take our number in-house. There are a couple of support articles that talk about how to do it but there's too much confusing language around it. A phone number should be like a domain name with clear lines of ownership."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T17:20:08.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer service, straight forward app, would like to see ability to delete phone numbers from call log"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim F",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T22:35:02.000Z",
          "Titre": "The only issue I had was with follow…",
          "Contenu": "The only issue I had was with follow up; I was sent an email to alert me to allow five business days for activation, which was very nice.  However, I did not hear from anyone again until I received this survey.  If we are informed to wait, we should also be informed when the wait is over, I would think.  This would be a great opportunity for a celebratory email that says, \"Congrats! Your number is ready to use!!\"  I only received confirmation that my number was active after emailing support to confirm.  Seems like a step that should be automated, honestly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T03:22:32.000Z",
          "Titre": "Customer service is excellent",
          "Contenu": "Customer service is excellent, but I cannot delete my messages from the app. This seriously needs to change."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T13:14:35.000Z",
          "Titre": "Just switched 5 numbers over to…",
          "Contenu": "Had an issue early on and was very concerned with a number I've had for over 30 years, it wasn't working and they were at first not able to fix it right away. After 4 or 5 business days it seems to be resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "E Kay",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T01:59:37.000Z",
          "Titre": "Fairly easy online interface",
          "Contenu": "Fairly easy online interface, well designed iOS app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Marquess",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T14:56:57.000Z",
          "Titre": "Ease of set up"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T19:20:50.000Z",
          "Titre": "The time support took to help me was…",
          "Contenu": "The time support took to help me was really appreciated. I was having a little yellow bus moment when trying to set up my voicemail."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JIHAN",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T02:20:34.000Z",
          "Titre": "Almost 5 stars 🌟 Very good service",
          "Contenu": "I like the service but I think you should have someone completely set up the number all in one shot. I had to set up call forwarding after and it took me a minute to figure it out. But I'm not tech savvy so it could just be me. Other than that it's a solid service so far. A little pricey but easier and cheaper than a landline because I can use my laptop or mobile. It goes where I go. It gives me credibility. But the vanity nber has 2 extra numbers that no one will ever type. Lol. I thought that was weird. But who's gonna know? Lol 😆"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshlon",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T23:34:43.000Z",
          "Titre": "Perfect response",
          "Contenu": "Perfect response; However, I would like to be listed as a true business in your system.  I think... I could get more customers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed Esters",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T14:29:14.000Z",
          "Titre": "The customer service is very good",
          "Contenu": "The customer service is very good,  I had an issue I called in and it was taken care of immediately.  They are there to help you with your set up as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Evermore Flowers",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T12:37:39.000Z",
          "Titre": "It takes a bit to figure out how things…",
          "Contenu": "It takes a bit to figure out how things are labeled and how to find them.  Support on a separate web page is both good and bad.  Maybe a quick video tutorial of what to click on etc. Once I had the layout it wad great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark B",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T04:38:51.000Z",
          "Titre": "So far we are having a great…",
          "Contenu": "So far we are having a great experience. We are still pretty new to this platform, but so far so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Q.",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T23:33:25.000Z",
          "Titre": "I was able to get a great vanity number…",
          "Contenu": "I was able to get a great vanity number in relation to my business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JM SCOTT at JMS CONSULTING INC",
          "Nb_Reviews": 1,
          "Date": "2022-06-30T19:39:18.000Z",
          "Titre": "Well priced plans for toll free…",
          "Contenu": "Well priced plans for toll free numbers. Setup  of extensions and messaging was little frustrating at first. All in all i am very pleased.JM SCOTT"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T18:52:34.000Z",
          "Titre": "Your service is very good and you…",
          "Contenu": "Your service is very good and you responding well to customer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leslie",
          "Nb_Reviews": 3,
          "Date": "2021-05-10T17:37:54.000Z",
          "Titre": "Solid platform",
          "Contenu": "Solid platform. I like having the ability to buy 800 numbers and for messages to get texted to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Mckinney",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T08:50:00.000Z",
          "Titre": "I LIKE THE SPEEDY SERVICE"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 1,
          "Date": "2021-03-16T16:33:26.000Z",
          "Titre": "Friendly customer service always there…",
          "Contenu": "Friendly customer service always there to answer the questions and solve the issues I had."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heena",
          "Nb_Reviews": 1,
          "Date": "2021-01-28T15:08:20.000Z",
          "Titre": "Working great",
          "Contenu": "Working great! Need improvement in the App though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 1,
          "Date": "2021-01-30T03:26:33.000Z",
          "Titre": "If the set up was explained a little…",
          "Contenu": "If the set up was explained a little more this would have been a 5 star."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T13:30:58.000Z",
          "Titre": "Only use the service to register",
          "Contenu": "Only use the service to register, it was fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-03T17:21:03.000Z",
          "Titre": "Some of your functions are confusing…",
          "Contenu": "Some of your functions are confusing and difficult to understand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zack",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T12:39:30.000Z",
          "Titre": "We were looking for an 800 type number…",
          "Contenu": "We were looking for an 800 type number for our new construction company and 800.com was there. We found one with our initials in seconds and their customer service was extremely helpful right from the get go. The only thing I would like to see changed is the UI for the website. It works just fine though and this is more of just a preference."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2020-09-04T21:54:12.000Z",
          "Titre": "A must have as a nation wide consulting…",
          "Contenu": "A must have as a nation wide consulting company.To provide the best service and access for local clients, a single 800 number is not only welcome, but required.Scenario: A consultant locates in Boston for a large client.  That client does not have to call San Diego, to contact a consultant, in the conference room down the hallway. The consultant previous client, located in Dallas, calls the same 800 number they always did, to ask a simple question.If this is you and your business, this 800 service is essential.  Essential."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tara",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T16:45:56.000Z",
          "Titre": "Initially had trouble dialing the 800…",
          "Contenu": "Initially had trouble dialing the 800 number from a normal landline number without it calling a person with the first 7 digits of our toll free phone number locally. It was fixed but annoying at first because the woman it kept calling locally was none too pleased with us. Eventually it allowed us to dial our complete 11 digit number from a landline without further issue. Only problem is we don't know how many customers dialed in from a landline or their office phone to our company and got the upset local woman who was fed up with getting our company calls."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Drace",
          "Nb_Reviews": 1,
          "Date": "2020-07-28T17:44:04.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! the issues was not totally resolved as the caller was not directed to the 800.com recording after I let it ring. And similarly when I silenced by iPhone ringer with one click after the caller called....the caller was sent to my iPhone recording."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maureen",
          "Nb_Reviews": 1,
          "Date": "2020-09-06T23:19:35.000Z",
          "Titre": "I was looking for a way to see if a fax…",
          "Contenu": "I was looking for a way to see if a fax was received.  800.com was quick to respond but said that feature was no longer available.  Turns out I think it is... A blue dot is by the numbers that were received."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Josie",
          "Nb_Reviews": 1,
          "Date": "2020-11-25T20:43:52.000Z",
          "Titre": "Overall its a good product!",
          "Contenu": "I am happy with the product! Its been easy and straight forward to use. Its great for data analytics. I leverage the reporting and components of the data to keep track of calls, messages and utilize the information to help our business strategize better. Customer service has been excellent as well! No issues or suggestions for improvements. I think once volume for our calls go up, we will have a better idea of all capabilities. Thanks!UPDATE: We have had one issue. Because these numbers are recycled, when dialing out from your line ensure the caller ID states your business number. Our number shows up as a random 10 letters and digits. The only way to rectify it is to call all phone providers (Rogers, Bell, Telus, etc.) and update your name. It's very time consuming."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2020-11-11T17:01:01.000Z",
          "Titre": "5th Star",
          "Contenu": "Haven't had any traffic on the line, so tough to judge. Maybe you guys can give some marketing tips to your customers to drive traffic to the phone. That would get you that 5th Star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Ferguson",
          "Nb_Reviews": 2,
          "Date": "2020-06-19T22:18:57.000Z",
          "Titre": "800.com has allowed me to grow my…",
          "Contenu": "800.com has allowed me to grow my business without any contracts.   The toll free number can be forwarded to any phone I choose.  This helps me to never miss a radio advertising call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 2,
          "Date": "2020-11-16T14:24:43.000Z",
          "Titre": "some of the instructions were not very…",
          "Contenu": "some of the instructions were not very clear I had several days that I thought our number was active and it was not.  Over all I am happy about the service once we got it going."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Naimah",
          "Nb_Reviews": 2,
          "Date": "2020-08-07T15:38:38.000Z",
          "Titre": "Good Service for the price",
          "Contenu": "I would give this service 4 stars because it is low cost and provides good options for voice message services. However, there have been times where we have had issues with the fax."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2021-01-20T20:30:09.000Z",
          "Titre": "the phone calls are clear",
          "Contenu": "800.com provides a lot of number choices, the phone calls are clear, and the customer service responds quickly, but the ios app needs further improvement"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hilda",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T20:20:25.000Z",
          "Titre": "Did not tell me  I could port # or just…",
          "Contenu": "Did not tell me  I could port # or just buy it for $100. Or forward it when I was on phone when I first called. Took me a month for it to start working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T15:29:04.000Z",
          "Titre": "Our small business has benefited from…",
          "Contenu": "Our small business has benefited from having a toll-free number by providing us with a branded, national contact point for our customers and prospects."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T21:04:16.000Z",
          "Titre": "Haven’t used the service yet",
          "Contenu": "Haven’t used the service yet……."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NexStepForward",
          "Nb_Reviews": 1,
          "Date": "2020-09-11T20:36:34.000Z",
          "Titre": "Customer service a bit slow to…",
          "Contenu": "Customer service a bit slow to respond...but once you login the system is great for allowing you to give BIG BUSINESS IMAGE to your clients..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TSMD",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T03:31:57.000Z",
          "Titre": "It works great for my business",
          "Contenu": "It works great for my business. I wanted to display a professional number for my business instead of my personal cell and this was fine"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T07:31:49.000Z",
          "Titre": "I like my number"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2020-08-14T15:36:15.000Z",
          "Titre": "I entered an order and heard nothing…",
          "Contenu": "I entered an order and heard nothing for 6-7 days. After writing several times finally got the service I needed. All is fine now"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexander Arakelian",
          "Nb_Reviews": 1,
          "Date": "2020-05-04T13:53:11.000Z",
          "Titre": "I bought a vanity number and it took a…",
          "Contenu": "I bought a vanity number and it took a little longer than expected but the site is very easy to navigate through."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2020-07-13T18:23:32.000Z",
          "Titre": "Had a great call with Carmen",
          "Contenu": "Had a great call with Carmen. She was very helpful, polite and knowledgable. She made it a great experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dene",
          "Nb_Reviews": 1,
          "Date": "2020-12-03T22:14:34.000Z",
          "Titre": "I Love that they are they 24 hours",
          "Contenu": "I Love that they are they 24 hours. I had an issue and the representative was extremely patient with me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 1,
          "Date": "2020-07-23T22:41:45.000Z",
          "Titre": "Issue was fixed",
          "Contenu": "Issue was fixed. Just don't understand why I was the one to bring it up when it was so obvious"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy Rice",
          "Nb_Reviews": 2,
          "Date": "2020-12-03T15:35:10.000Z",
          "Titre": "800.com was easy to get going and with…",
          "Contenu": "800.com was easy to get going and with my own #.  They've responded well to my inquiries."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2020-12-10T16:43:16.000Z",
          "Titre": "The only reason for 4 stars is because",
          "Contenu": "The only reason for 4 stars is because there’s only one perfectionist 🙏🏻"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne Pounds",
          "Nb_Reviews": 1,
          "Date": "2020-05-01T14:07:18.000Z",
          "Titre": "Online instructions were confusing but…",
          "Contenu": "Online instructions were confusing but support was great...."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T04:34:37.000Z",
          "Titre": "Easy to use so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 2,
          "Date": "2020-11-20T20:33:12.000Z",
          "Titre": "800.com is a great service for the…",
          "Contenu": "800.com is a great service for the price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2020-05-27T02:43:22.000Z",
          "Titre": "The system isn't very intuitive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T19:40:16.000Z",
          "Titre": "easy to setup"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori Koutelis",
          "Nb_Reviews": 2,
          "Date": "2020-12-03T20:16:40.000Z",
          "Titre": "Very easy to work with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kenneth",
          "Nb_Reviews": 2,
          "Date": "2020-05-14T03:43:47.000Z",
          "Titre": "Great bang for the buck"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T22:34:38.000Z",
          "Titre": "On some phones it shows as spam.",
          "Contenu": "Progressing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill G",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:31:28.000Z",
          "Titre": "Easy, fast set up, with robust features",
          "Contenu": "Selected phone # was available, recieved notice of box set up on the same day.  Set up outbound message, calendar, and forwarding rules the next day.  Use the chat help twice, they were right there.   888 and box is Operational.  Still have to read up on all the features and reporting, all got turned around so quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Soho Express Transportation",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:19:14.000Z",
          "Titre": "So happy that I picked the number I…",
          "Contenu": "So happy that I picked the number I want .Customer service was great contact me and we set up everything."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "George Niblett",
          "Nb_Reviews": 3,
          "Date": "2023-11-09T15:07:33.000Z",
          "Titre": "Easy and reliable",
          "Contenu": "It was easy and reliable. I asked for a specific sequence of numbers, I was given some options that were available, booked the service and within 2 days it was hooked up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott M.",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T19:47:42.000Z",
          "Titre": "Website was plain and easy to navigate…",
          "Contenu": "Website was plain and easy to navigate thru different options that where available. I ordered my number and received great instructions on how to set up number. Customer service gave me a courtesy call asking if I had any questions, need information or help with anything. I had a great experience, looking forward being a customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Reid",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T13:15:17.000Z",
          "Titre": "The staff at 800.com are very friendly",
          "Contenu": "The staff at 800.com are very friendly, helpful, and knowledgeable.  They walk me through the process to get my 800 number setup and working. They made the whole process felt so easy."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Rolf",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T22:05:53.000Z",
          "Titre": "Great and quick service",
          "Contenu": "Great and quick service, loved the way on how the Platform is set up and lets you integrate your number quickly into live environment, Thanks."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:28:20.000Z",
          "Titre": "excellent",
          "Contenu": "excellent service in setting up"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dante",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T22:45:22.000Z",
          "Titre": "Best business team on the planet",
          "Contenu": "Your company has made this experience to get a one 800 number so perfect. Every time I called always had help no one not ever help me thanks to you my business will prosper once I get it off the ground because it a remarkable number that. One of your great workers gave me it’s gonna work for the business. Thank you again I appreciate all you guys do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Casey Sedik",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T19:02:23.000Z",
          "Titre": "GREAT assistance- finally I found an…",
          "Contenu": "GREAT assistance- finally I found an 800 number service that not only has their own 800 number but actually answers with actual helpful humans.  It’s done wonders for our business.  Many thanks 800.com!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenna Ryan",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T18:18:26.000Z",
          "Titre": "Wow! Love your service. Thank you!",
          "Contenu": "I am very impressed with your service. I am amazed at how I was able to find my vanity number after business hours quickly and efficiently. Thank you so much for providing this awesome service. I have already referred you to a friend who asked where I got my number."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T13:43:00.000Z",
          "Titre": "Fixed the Problem !",
          "Contenu": "After writing a scathing but truthful review, based on an unacceptable delay, the very next day they called me, out of concern for my issue. They fixed the problem and said that my review helped them become aware of the systemic issue which they now have fixed. Kudos to both them and Trustpilot !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Artem  Raa",
          "Nb_Reviews": 5,
          "Date": "2023-02-10T18:02:55.000Z",
          "Titre": "Great option for a virtual phone line/ answer machine",
          "Contenu": "Using their service for 6 years now, and had no issues. We were on monthly billing and they just called to offer to save $200 by switching to annual, which is totally making sense for us and I appreciate them reaching out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ML",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T18:15:20.000Z",
          "Titre": "Quality Customer Service",
          "Contenu": "I am a new customer and was sent a welcome email, which I failed to reply to.  In response to my oversight, Anthony (800.com representative) called me to inquire as to whether I had any questions or needed any assistance setting up my service. He took time to answer my questions, perform test calls and adjust a few settings on my profile.  Anthony was knowledgeable, efficient, result-oriented and delightful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T17:04:10.000Z",
          "Titre": "I am very grateful for how quickly they…",
          "Contenu": "I am very grateful for how quickly they resolved my issue when my SMS wasn't working temporarily! You never know when purchasing a new product how the customer service is going to be but these guys did a wonderful job and everything is working perfectly right in time for me to launch my advertising as planned. Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chelle",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T23:25:23.000Z",
          "Titre": "Excellent…",
          "Contenu": "In this day and age where customer service is essentially non-existent 800.com came through !!! They walked me through everything and insured that my questions were answered and I was comfortable with their service!!! A real live person answered the phone and actually spoke professionally and effectively … very knowledgeable and a very pleasant experience !!!! Loved it!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Anthony Grishaj",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T01:01:49.000Z",
          "Titre": "I truly just didn’t expect all of the…",
          "Contenu": "I truly just didn’t expect all of the types of services that come along with the 866 number I had. Also, I did not type in 7 mercies. I had just typed in Mercies, as the charity I work with is called Divine Mercies. There two types of divine mercies, the corpora and spiritual works of mercy. There are 7 of each. 7 Corporal works of mercy and 7 spiritual works of mercy. The number 866-7-Mercies was the first to pop up as an alternative to my first choice which must not have been available, and it just seemed like it was meant to be."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T17:05:11.000Z",
          "Titre": "Great experience so far",
          "Contenu": "The initial search to create a unique number was easy.  The follow up call/voicemail to let me know the number is now in service was appreciated and the user friendly interface to create your own greeting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:01:17.000Z",
          "Titre": "The timing wasn't great but the…",
          "Contenu": "The timing wasn't great but the functionality has been"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "custms lee",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:28:11.000Z",
          "Titre": "oficial and to the point had it up and…",
          "Contenu": "oficial and to the point had it up and running in hours excellent 5 stars"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Bennett",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T22:23:30.000Z",
          "Titre": "Grateful",
          "Contenu": "I had been working on getting a particular phone number for awhile with no luck at all. Until, I contacted 800.com! It could not have been easier! I found that my number was available & purchased it. The next morning I talked with Anthony who was kind, helpful, patient and well informed on how to set me up to receive calls, texts, messages etc…everything I needed to complete to get my ministry number ready to go BEFORE my number was even activated!! Once my number was activated I was already to go immediately. And i received another call from Anthony asking if everything was working well and if i had any questions. Anthony provided impeccable customer service!! I’m so glad I got my 800 number from 800.com."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T16:36:56.000Z",
          "Titre": "Very Professional",
          "Contenu": "Very Professional. I've been working with Dominic. Super professional and helpful and when I was too busy to reply to an email, he picked up the phone and called. Got everything resolved immediately. Great company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DYLAN DOHERTY",
          "Nb_Reviews": 3,
          "Date": "2023-01-30T20:46:31.000Z",
          "Titre": "Everything so far has been great",
          "Contenu": "Everything so far has been great.  I could not be happier.  I am thrilled to be embarking on an exciting new endeavour with such a dynamic partner team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bailey Campbell",
          "Nb_Reviews": 3,
          "Date": "2022-02-07T08:52:09.000Z",
          "Titre": "Anthony called me the next business day…",
          "Contenu": "Anthony called me the next business day and got us all set up! This is an amazing service and very economical. We love our vanity number, the company and it's people who offer it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MarinaZ",
          "Nb_Reviews": 6,
          "Date": "2022-01-26T16:42:43.000Z",
          "Titre": "the customer service level I…",
          "Contenu": "the customer service level I encountered was absolutely fantastic - very courteous, very knowledgeable and helpful. I just wish the pricing was bit less. i highly recommend them. thank you for a job well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "gogobytes",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T15:40:34.000Z",
          "Titre": "Got it Done!!!",
          "Contenu": "I had an amazing individual named Michelle walk me through the setup & explained the extras. Wow! She helped me complete some shat today that had been hovering in my mind for months. Done with ease & grace, Miss MichelleStay groovy-g-gogobytes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T20:48:02.000Z",
          "Titre": "Very easy process",
          "Contenu": "Very easy process. Needed to change the initial number I chose to a vanity number. They assisted with the entire process without any issues.Would recommend this company to anyone who needs a 800 number"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelby Cooper Glam Rx Med Spa",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T17:41:15.000Z",
          "Titre": "Setting up my vanity number was…",
          "Contenu": "Setting up my vanity number was seamless, and they even called me a few days later to see if I needed help getting things set up. 5 start experience thus far"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melvin",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T14:24:49.000Z",
          "Titre": "My review",
          "Contenu": "Great customer service.Very responsive to calls and any questions that may have been addressed. Thank you!Melvin"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaMonte at GeoSis Logistix",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T14:38:40.000Z",
          "Titre": "Anthony & Drucel are the best…",
          "Contenu": "Anthony & Drucel are the best associates with their knowledge and patience when dealing with clients. THANKS and have yourselves a MERRY CHRISTMAS & HAPPY NEW YEAR !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 3,
          "Date": "2022-02-07T19:50:20.000Z",
          "Titre": "Great Service",
          "Contenu": "800.com has always been exceptional service provider. Every time I’ve called customer service they took care of my problem right away.Thanks 800."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shane",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T06:16:05.000Z",
          "Titre": "The representative was very helpful in…",
          "Contenu": "The representative was very helpful in helping set up our vm for 1st time and adding a fax and answering all my questions in a kind and professional manner. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiana",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T20:59:31.000Z",
          "Titre": "Kyle was amazing",
          "Contenu": "Kyle was amazing! Great help, patient and easy to work with. He's professional and wants to make sure my team was all set so we were ready to launch our campaign."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miss Linda",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T15:54:30.000Z",
          "Titre": "Anthony Is The Best Customer Service…",
          "Contenu": "Anthony Is The Best Customer Service Rep In The Universe! The Customer Service Dept has awesome people that take care of the customers! Every time I call  they are so helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ProntoEpoxy",
          "Nb_Reviews": 2,
          "Date": "2022-05-26T15:15:28.000Z",
          "Titre": "Starting a new small biz",
          "Contenu": "Starting a new small biz.  Needed 1 vanity 800 number that will forward to my cell phone so that I never miss a new customer!  Finding the vanity number was easy!  Pricing is very fair.  Perfect for what I need"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Audrey Daniels",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T06:46:30.000Z",
          "Titre": "Awesome customer support team.",
          "Contenu": "I'm new in business so I really appreciated the fast response when I called, thank you for making things easier for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T16:50:40.000Z",
          "Titre": "The customer service was very good",
          "Contenu": "The customer service was very good.  Anthony helped me set up the service, voice greetings and voice mail.  He was knowledgeable, efficient and patient with my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Macrea Money Management",
          "Nb_Reviews": 2,
          "Date": "2022-01-20T16:15:19.000Z",
          "Titre": "SO GREAT FOR US!",
          "Contenu": "Dominick set my service up and he was absolutely amazing.  He was very patient and kind I am 70 years old and I need both. He really spent a lot of time with me to make certain I understood.  John called to let me know my services were working.  He too was very patient and kind and checked all the numbers. I love my service and all of my employees love the service.  So great for us!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gine’a & Co",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T16:25:59.000Z",
          "Titre": "Great customer service",
          "Contenu": "I called because I was not getting notifications. The representative was able to solve my issue. He also followed up to make sure that everything is working properly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward J Vann Consulting LLC",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T01:47:19.000Z",
          "Titre": "Awesome business and Banking Tool",
          "Contenu": "Awesome business and Banking Tool. It adds credibility to my company and heightens the trust level between our company and our clients"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-21T17:56:38.000Z",
          "Titre": "Customer service contacted me right…",
          "Contenu": "Customer service contacted me right away to help me figure out how things work and they offered to go through other features . I was impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T18:57:12.000Z",
          "Titre": "i couldn't figure out how to connect my…",
          "Contenu": "i couldn't figure out how to connect my new toll free number with my existing line one call to customer service solved my issue right away. a friendly knowledgeable  representative talked me through the steps to rectify my issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meagan",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T19:24:01.000Z",
          "Titre": "Very convenient and easy to understand",
          "Contenu": "The customer support was always very friendly and the software they use is very easy to understand and navigate through. It is a very convenient service that this company offers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Williams",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T22:47:26.000Z",
          "Titre": "Lovelight",
          "Contenu": "This is the first time I’ve ever used a vanity Townline they were very helpful easy to set up and thank you very much I’m looking forward to using your services hope it does my business as well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T15:54:06.000Z",
          "Titre": "Recently we changed phone carriers and…",
          "Contenu": "Recently we changed phone carriers and we had to source out our toll free number and 800.com was recommended to me. So I contacted them and everything went great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Kirsh",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T17:40:02.588Z",
          "Titre": "I was looking for a way to use my existing 800# for phone and text messages.",
          "Contenu": "I was looking for a way to use my existing 800# for phone and text messages. 800.com solved my problem. Customer service is outstanding. Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DRW Closures",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T04:53:35.000Z",
          "Titre": "Dominique was awesome",
          "Contenu": "Dominique was awesome.  Flat out awesome.Knew what I needed to be effective on a new biz launch and new I was busy so got right to the point on everything.You should promote that dude.  Like now.Other than that, great product and I know it will help enormously with this launch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-29T20:34:13.000Z",
          "Titre": "The customer service was detail…",
          "Contenu": "The customer service was detail oriented and was very wonderful in making sure all the tasks were done on my greetings. He was awesome!Lynne"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marilú",
          "Nb_Reviews": 2,
          "Date": "2021-08-27T23:00:50.000Z",
          "Titre": "Hooray for 800.com",
          "Contenu": "Recently signed up for a business line with 800.com. Couldn’t begin to say how great it’s been to use this company. The customer service is great and the set up was easy. The features have great options and every thing my business was needing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith F.",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T20:58:58.000Z",
          "Titre": "Couple little hiccups at first",
          "Contenu": "Couple little hiccups at first, but got it all smoothed out and under control.Over all this has been a good experience so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerritt",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T23:19:56.000Z",
          "Titre": "Great job over there",
          "Contenu": "Great job over there. Should have originally gotten the toll free number from you to begin with. 800forall is pretty worthless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2022-08-04T22:31:06.000Z",
          "Titre": "So far so good awesome program really…",
          "Contenu": "So far so good awesome program really good customer service I called and they explained everything to me and I’m off to the races using their platform really really good platform"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tinmanz",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T01:37:48.000Z",
          "Titre": "I got the vanity number that i wanted…",
          "Contenu": "I got the vanity number that i wanted and, was suprised when their customer care dept called me to let me know it was live and thanked me for my business. That was awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-08-02T22:59:58.000Z",
          "Titre": "Great customer service",
          "Contenu": "Michelle from customer service was great in returning my call and answering all my questions. I am grateful for their support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Solo Business Owner",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T18:22:59.000Z",
          "Titre": "...the best way to get an 800 number is…",
          "Contenu": "...the best way to get an 800 number is here! 800.com has the least complex way to get a (now harder to get) vanity number! Great service and easy-to-use platform for business."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T02:05:23.000Z",
          "Titre": "u guys are awesome",
          "Contenu": "loved your service and looking forward to expand in future with  your tollfree services , Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Lytle",
          "Nb_Reviews": 2,
          "Date": "2022-05-27T16:41:15.000Z",
          "Titre": "When I had some questions the customer…",
          "Contenu": "When I had some questions the customer service rep couldn’t have been nicer! He knew the answer to every question and walked me through."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2021-11-12T14:40:24.000Z",
          "Titre": "Customer Service was readily available…",
          "Contenu": "Customer Service was readily available and very responsive.  They made the process of transferring our toll free number clear and timely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T15:09:53.000Z",
          "Titre": "Professional service",
          "Contenu": "Professional service.  We asked port 800 number from another provider and everything went well.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AirGar",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T22:35:27.000Z",
          "Titre": "Easy to work with… excellent customer…",
          "Contenu": "Easy to work with… excellent customer service when I need some help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R P",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T17:45:04.000Z",
          "Titre": "This was my first attempt of signing up…",
          "Contenu": "This was my first attempt of signing up for an 800 number. It was very easy to accomplish. I could not set up my voicemail on my own. I called support and they had me up and going within a few minutes. Very pleased so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin Dunkle",
          "Nb_Reviews": 2,
          "Date": "2022-03-26T15:37:59.000Z",
          "Titre": "I am really enjoying the use of my new…",
          "Contenu": "I am really enjoying the use of my new business phone number and the customer service team has been great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Santilli",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T00:06:39.000Z",
          "Titre": "Great service",
          "Contenu": "It works great just like they said it would"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joy",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T02:22:57.000Z",
          "Titre": "Great customer service on change of…",
          "Contenu": "Great customer service on change of number. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry Kelly Tempe Az",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T04:18:29.000Z",
          "Titre": "Very easy process to order a toll-free…",
          "Contenu": "Very easy process to order a toll-free number."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JPiii Electric",
          "Nb_Reviews": 2,
          "Date": "2022-04-16T12:09:01.000Z",
          "Titre": "Goals!",
          "Contenu": "Always wanted a phone number to coincide with the business. Thanks for making this gape for us!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-01-21T18:09:17.000Z",
          "Titre": "I am very pleased with the service and…",
          "Contenu": "I am very pleased with the service and availability. The ease that customers are now using. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brain Buzz Marketing",
          "Nb_Reviews": 6,
          "Date": "2022-03-30T17:36:46.000Z",
          "Titre": "The Perfect Tool for my business.",
          "Contenu": "800.com was super easy to set up and works great for my business. They also have amazing customer support."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sherryl Cole",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T20:50:42.000Z",
          "Titre": "Best Customer Service Ever (BCSE)",
          "Contenu": "Being open and transparent, we have had some feedback from clients and prospects that they were having trouble to navigate through some of the features on the phone system.We had to make the necessary adjustments to help our company better communicate with potential customers and current clients, as we build and grow.Honestly, this is one of the best customer experiences  that I have had in a long time and appreciate. Thank you, Anthony for your excellent customer service. What I appreciated most was that this representative listened to my concerns and was able to immediately identify with what we needed - this was a time sensitive issue, to help our business improve our customer service. Knowing the product and service inside out was key in addressing my concerns to quickly find a resolve too. The representative made a few recommendations after assessing the problem and then worked with me to do a test run of the all the changes. Like the ongoing support throughout the entire call and a willingness to help- \"let me try something else, let me look into something, is there anything else I can do for you, I want to make sure it works while I have you on the phone\". Appreciate the interaction, answered my questions/concerns and found the right product/service to resolve the problems as quickly as possible. This will help to increase call rates and conversion as we are starting our sales and marketing campaign.Thank you, for your customer support.Warmly,Sherryl Cole Griffiths, FounderPICKLE ME GREENCommercial and Residential Property Services"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "OndemandRun.com",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T23:26:42.000Z",
          "Titre": "Great product and services",
          "Contenu": "Great product and services, We got all that we needed for our phone system on One platform. We're very satisfy! Tommy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T02:27:37.003Z",
          "Titre": "I just love them point blank",
          "Contenu": "I just love them point blank , very responsible in accurate keep up the great work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL  ALLEN",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T19:56:03.000Z",
          "Titre": "The easy access to the needed services…",
          "Contenu": "The easy access to the needed services and the following up via emails."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T21:26:20.000Z",
          "Titre": "I appreciate the call that when…",
          "Contenu": "I appreciate the call that when somebody had called me to go over with me of how it works"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T20:30:20.000Z",
          "Titre": "Very easy to place an order",
          "Contenu": "Very easy to place an order.  Customer service responds to questions very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "berto",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T18:28:47.000Z",
          "Titre": "Good getting back in touch with support",
          "Contenu": "Getting back in touch with support was quick and easy and resolved the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T18:30:43.000Z",
          "Titre": "understanding and flexible",
          "Contenu": "was willing to accommodate my wished on an account change."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T13:13:18.000Z",
          "Titre": "Easy",
          "Contenu": "Very easy process and helps to strengthen brand recognition when displaying the vanity phone number on marketing materials. Than you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T18:06:55.000Z",
          "Titre": "Great online portal and easy to use the…",
          "Contenu": "Great online portal and easy to use the customer service support is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KK",
          "Nb_Reviews": 2,
          "Date": "2022-09-30T18:43:13.000Z",
          "Titre": "800.com makes it easy to find a toll free #",
          "Contenu": "800.com makes it easy to find a toll free number to be used as a vanity number. Gret follow-up by staff once you sign up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T02:03:45.000Z",
          "Titre": "Easy, reliable, and fairly priced",
          "Contenu": "Easy, reliable, and fairly priced, with excellent sales and technical support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean C.",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T01:46:31.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use.  I was able to find a great number and quickly set. it up.  Simple but powerful interface.  Exactly what I needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy E",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T21:50:37.000Z",
          "Titre": "Easy to purchase and user-friendly",
          "Contenu": "Easy to purchase and user-friendly. Good pricing. Very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theresa Johnson",
          "Nb_Reviews": 4,
          "Date": "2021-10-18T19:32:06.000Z",
          "Titre": "Great and prompt service",
          "Contenu": "Great and prompt service. It did not take me long to get set up and the number I requested was perfect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 6,
          "Date": "2022-08-24T20:52:36.000Z",
          "Titre": "Very simple and easy to setup and use",
          "Contenu": "Very simple and easy to setup and use.  I was surprised how fast they were able to import my number to their system."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T02:58:46.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erica Williams",
          "Nb_Reviews": 1,
          "Date": "2022-01-31T19:16:39.000Z",
          "Titre": "800.com representative was extremely…",
          "Contenu": "800.com representative was extremely helpful and the service they provide is amazing for any growing business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom DePalo",
          "Nb_Reviews": 6,
          "Date": "2022-03-10T16:05:10.000Z",
          "Titre": "800.com has been very helpful and easy…",
          "Contenu": "800.com has been very helpful and easy to work with.  We are using them to host our 800 number and so far there are no issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T08:29:14.000Z",
          "Titre": "Very informative patient through System…",
          "Contenu": "Very informative patient through System set upGreat Job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T20:03:19.000Z",
          "Titre": "Quick onboarding and effective",
          "Contenu": "Quick onboarding and effective. Thank you 800.com"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DK",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T14:19:09.000Z",
          "Titre": "This company is very responsive and…",
          "Contenu": "This company is very responsive and helpful - a pleasure to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T17:15:20.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Addressed my concern quickly, with great follow-up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Lopez",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T17:55:25.000Z",
          "Titre": "Great Service",
          "Contenu": "It was easy to get my vanity number!  Haven’t used it much… just in my beginning stages."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T01:27:23.000Z",
          "Titre": "We LOVE 800.com!",
          "Contenu": "We LOVE 800.comWe started out as a small business and have grown to be a big business. We still use this to this DAY!Thanks for growing with us!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rod Pope",
          "Nb_Reviews": 3,
          "Date": "2023-10-27T22:36:53.000Z",
          "Titre": "Easy to use and implement"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ricky",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T17:01:51.000Z",
          "Titre": "Very Helpful",
          "Contenu": "They were very helpful anytime we need help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STAIRLIFT-USA.COM",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T02:53:26.000Z",
          "Titre": "Great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Garage Doors and Service",
          "Nb_Reviews": 3,
          "Date": "2022-12-27T17:13:48.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful. Great customer service. LOve my new number."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elianne Silva",
          "Nb_Reviews": 2,
          "Date": "2022-01-03T23:28:13.000Z",
          "Titre": "Very easy to work with!",
          "Contenu": "Very easy to work with!!!!Nice to talk with a real people when you call, and make even better when they are  Great people willing to help you!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SFN Staffing",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T15:19:15.000Z",
          "Titre": "This was a simple transaction",
          "Contenu": "This was a simple transaction. Very quick and reliable service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 2,
          "Date": "2022-02-14T23:06:13.000Z",
          "Titre": "Loved it",
          "Contenu": "Loved it. Easy, simple, fast.Would recommend anyone.Don - SocialMediaRabbit.com 888-89- Social"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T17:40:56.000Z",
          "Titre": "My initial experience with 800.com was…",
          "Contenu": "My initial experience with 800.com was a pleasant one. I  received professional and courteous assistance setting up my number."
        }
      ]
    }
  ]
}