{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "8fig.co",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniela",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T14:40:07.000Z",
          "Titre": "Very unhappy with this company",
          "Contenu": "Very unhappy with this company, I  waited for my loan to finalize for about 3 weeks.. it was implied I didn’t have the correct paperwork to run my business, turns out my name was spelled wrong on their end this whole time, just ridiculous…the amount of emails after emails and paperwork after paperwork after paperwork just to end up getting NOTHING.Plans we had for the store also on hold for no reason…just a huge waste of our time really, would not recommend this place to anyone."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Éric Paul",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T00:33:12.000Z",
          "Titre": "Worst experience ever",
          "Contenu": "Worst experience ever. Their cost of capital is so expensive and if you miss paiement they will hold our Amazon Paiement and frooze our money and business !"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Body Massager",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T19:47:07.000Z",
          "Titre": "No professionalism, just a bunch of amateurs!",
          "Contenu": "They are not professional at all. While they are spending thousands of $$ on their marketing, they are neglecting their operations! I received an offer from them, but after 2 weeks, they informed me that they were not able to offer any plans for Canadian brands. While I was waiting for those 2 weeks, I rejected offers from other providers because they said it was available for Canada. No professionalism, just a bunch of amateurs!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alina Lola",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T18:47:45.000Z",
          "Titre": "I can assure you 90% of these “positive…",
          "Contenu": "I can assure you 90% of these “positive reviews” are made up. We worked with this company and our store was doing huge revenues yet we had the lowest IQ rep, no ability to talk to their backend team, and no variation to funding terms or change refusals were explained to us. We tried for weeks and months to work with this difficult company and summarized that they’re nothing but heartless, dysfunctional loan sharks. We’re now looking to work with Wayflyer or some other capital finding agency that’s more dynamic and gets the pains and needs of a growing business. Stay away from 8fig if you want peace of mind."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 4,
          "Date": "2023-10-15T19:38:25.000Z",
          "Titre": "DO NOT TRUST 8FIG",
          "Contenu": "Everything was going fine until the end of March of this year when SVB collapsed and they pulled back all of my funding and the plan had me remitting huge monthly amounts of 10k per month.  After that, I tried to borrow to pay them and had to take out new loans because I was paying them huge amounts monthly and now my finances are in a shambles.  Do not trust this company because they do not care about what happens to small business owners.  I honestly wish that I had never dealt with them.I've had some time to think about it and I think they just say that they want you to scale but the ultimate goal is to turn whatever money that they lend you into an expensive merchant cash advance loan!  Each time you ask to have the repayment term extended (after they've pulled back the funding), they just add more money onto the loan and say it is for the \"cost of funds\".  This is really a merchant cash advance which for most small businesses is bad news and a trap!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T06:39:39.000Z",
          "Titre": "The lack of communication between the…",
          "Contenu": "The lack of communication between the funding team and your customer representative and the client is non existent.   We had a quarterly review done the day we where supposed to get funding.   We are now at a month of no funding even though they continue to say funding is on its way.   ( there’s no problems and funding will be there).  The funds where now eaten up by the next three repayments so those funds didn’t help expand the company.   The first 6 months were great and than it went to lack of communication    They continue to say the have to wait for there team in Israel to approve it.   Well it’s been 4 weeks with no solution.   Our plan is still on pause.   I would give them a 0 star but the stars start at 1."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Cooler King",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T09:12:34.000Z",
          "Titre": "It started well, but BEWARE",
          "Contenu": "It started well, but with SVB collapse 8Fig were ‘experiencing operational issues’. Funding we were relying on was paused, it cost us more because of the delays and then after two weeks we received 25% of what was originally scheduled.But here’s the kicker. The 8Fig online account claims that we received way more funds than we did and when it was brought to their attention they refused to update it. Flat refused. So, what were we charged interest on when there is a set of false accounts? We are still not sure. It’s a poorly run, untrustworthy outfit that let us down and seems to have major transparency issues. Make of that what you will.*the response here from 8Fig is totally unrelated to the issue (looks like a cut and paste from someone in their ‘reputation team’. We had a promise of funds, they didn’t pay due to ‘operational issues’, the payment that was never made is still displayed on our dashboard as if it happened and they took weeks to respond to emails when we raised it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pissed off Vet",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T04:34:10.000Z",
          "Titre": "They claim unlimited funding...FALSE!",
          "Contenu": "They claim unlimited funding. Well, we got one-third of the funds, which they demanded it all of it back right after we bought the products. I spent a crap ton of time on a plan which went out the window as soon as the contract was signed, so to speak.They came up with a bogus reason. Anyways I would find other funding sources. It's been a trainwreck experience. Big letdown! We are a small US Veteran owned business with a bad experience. We thought we could grow with these guys. Nothing but a nightmare I would not share with anyone I hate, let alone people I care about! Run now while you still have a business!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A.V",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T23:52:04.000Z",
          "Titre": "8fig is a very shady organization",
          "Contenu": "8fig is a very shady organization. They are not easy to work with at all. Horrible communication between departments and extreme disorganization with their internal teams. As sales slow down they are incapable and incompetent in working with you. They frequently lie and make false claims against sellers. My sales slowed down by 50+ percent and I was making small payments based on the cashflow of my business during this time they still continue to draft your bank account for huge remittance payments that cause your business bank account to go negative which is a huge hassle and causes many problems / ruins your banking relationship / credit. Internally they are a wreck you can be in the process of remitting payments and they will file UCCs against the business serve you with threatening legal filings with amazon to highjack all sales proceeds. They also flat out lie and comment fraud. They stated my bank account was disconnected from the platform and I broke the contract which never happened I have proof via Plaid banking software showing this was a false fraudulent allegation to justify fling UCC against my company. While they are taking all sales proceeds they are still continuing to draft my bank account for 10K+ at a time. 8fig commits fraud in the remittance schedule they are showing on the live web app software that I was transferred $7500 more dollars than was given. This is extreme fraud. I have all banking records showing all deposits received from 8fig and there is a $7500 discrepancy, I have my attorney reviewing this fraud and will soon open a case against 8fig for theft by deception. I was stay far away from 8fig. I would recommending growing organically and self funding as much as possible. Traditional bank loans are 1000% superior than 8fig."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 4,
          "Date": "2023-07-28T18:24:34.000Z",
          "Titre": "Funding Taken Back Suddenly, Hurt Small Business",
          "Contenu": "At first, it was good and smooth but not anymore.  After the SVB collapse the growth fund was basically rescinded and we now owe all of it back and are not getting funded anymore.  I am working with Juan and the first time I reached out after two weeks of not getting funded, it took about 2-3 days to receive a response after trying to contact in multiple ways (instagram, Facebook, by phone, email, messaging on their site, etc.).  Once I did get a response I was told that due to new protocols every single account is being reviewed before being funded and not only that, I wouldn't be receiving funds but (now that my growth plan was \"revised\") instead owed a whole lot of money back at once.  For a small business, that can be detrimental. I never experience this with Kabbage which is now the American express business line of credit. Here is the message I get on 8fig's dashboard now:Review your revised Growth Plan.TodayOur team revised your plan following a recent request. Your Remittance Schedule will remain paused for 3 days, or until you accept.This revised plan basically says I owe upwards of 40k in the next month without any additional funding until June. I no longer trust this will actually be funded because they never deposited funds on 3/30 when they were supposed to!   I'm facing losing my business now because I ordered inventory and set up marketing based on my original growth plan that has now changed drastically.  Not only is there no growth to be seen on the plan, I may be out of business sooner rather than later.  With a child that is going to college this year, that scares the crap out of me and has caused me many sleepless nights.Very, very scary!Edit--7/28/23--I never got funded and as I stated now owe a whole lot of money back in a short time, to the tune of my account being drafted every 2 weeks and it's a horrible experience.  I would say if you do get approved and choose to go ahead with funding from 8fig have a backup plan in case they decide to pull back the funding because there's no long term repayment option with them and you will owe a LOT of money back at once.  I've been hospitalized due to the amount of stress and anxiety this has caused me!  I ordered lots of stock and spent a lot on marketing, and owe a lot of money!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Wood Wood Toys",
          "Nb_Reviews": 3,
          "Date": "2023-03-27T15:43:51.000Z",
          "Titre": "Frustrating, disappointing and unprofessional from start to finish",
          "Contenu": "Our experience with 8fig has been thoroughly disappointing. Communication with their team can be frustrating, and took us many repeated attempts to get detailed information about our funding application. The store and banking integration in their online application process broke repeatedly, and we received conflicting and incorrect automated email responses during the application process. There were discrepancies and communication breakdowns throughout because we conduct business in a non-USD currency, and the team did not seem to be familiar with businesses outside of the US. When we did finally sign a funding contract, the funds were not delivered on the specified date (understandably, because of the SVB banking meltdown), but after two weeks we received no proactive communication from 8fig and no funding. We did, however, receive a message indicating that we would be debited for our first remittance payment even though no funding had been received. It's hard to imagine a more convoluted, opaque, frustrating and disappointing experience than what we just went through with 8fig."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Daniel Drabo",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T03:46:52.000Z",
          "Titre": "They keep changing their requirement",
          "Contenu": "They keep changing their requirement,3 months now, 6 months now 1 year. Not good at all"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tanner Kurrasch",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T23:28:21.000Z",
          "Titre": "8fig Is a Bad Lending App they don't…",
          "Contenu": "8fig Is a Bad Lending App they don't follow guide lines set forth and they are just a all around bad app to use with the high APR your Business will never leave the ground. they will decline you for the littlest thing you make one mistake on the plan they block you cant use it. But Either Way 8FIG is Just A down right bad app. Just another tid bit the support suck on this platform."
        },
        {
          "Note": 2,
          "Lieu": "GE",
          "Pseudo": "Uzi",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T14:48:02.000Z",
          "Titre": "A very bad partner, HUGE rates, slow processes",
          "Contenu": "They say they use \"special model\" for financing, so it is hard for you to calculate real interest rate, which is more 50% a year. It is crazy!The process is extremely slow, they go back and forth with documents and even when everything is verified, they need days to really make transfer.They are late for depositing your accountThe only reason why I give them 2 stars is the point of contact, which was nice and communicative. Unfortunately, he could not do lotFee structure is not clear"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MS",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T09:13:28.000Z",
          "Titre": "Not clear on when capital will be…",
          "Contenu": "Not clear on when capital will be received, after asking and never getting a response. The date on dashboard doesn’t match after signing on 6/29 … still nothing and today is 7/6."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Deanna",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:34:55.000Z",
          "Titre": "Not Very Professional",
          "Contenu": "My experience was professionally handled. Prompt and user friendly. My only complaint, 8fig program should have been more upfront about who they are willing to help. I thought the program was to help in a financial situation where you did not have capital to stock your store. My bad! As soon as my bank account showed no money, 8fig left me sitting there wondering where everyone was. I finally get a response 3 days later, stating that they do not deal with my platform. I know I put my platform down during the initial questioning. I know it was that my bank account was empty, and I understand that. They could have at least told me something. That's why I signed up for the assistance, because I am flat broke. I am just a small store, just starting out.They did not want to risk it. That's ok just be a little more professional and finish the job."
        },
        {
          "Note": 3,
          "Lieu": "PA",
          "Pseudo": "Benjamin K",
          "Nb_Reviews": 6,
          "Date": "2023-07-02T20:28:10.000Z",
          "Titre": "Expensive. Run the numbers properly.",
          "Contenu": "I don't regret using 8fig but will say they are unbelievably expensive.The process was smooth and support was great initially and they definitely helped us scale because our options for other funding options were limited (foreign owned US LLC). So if I'd be back in the same position knowing what I know now, I would likely use them again.After running the numbers properly we ended up paying 40+% APR on the loans we had. But it's almost impossible to calculate the loans with how convoluted the lines are designed.Support was good initially but started to become worse and worse over time. Not sure if that's the case in general for the company or if existing clients are just not as important as getting new business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alvin Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T04:54:44.000Z",
          "Titre": "Ease in navigation and time taken to…",
          "Contenu": "Ease in navigation and time taken to complete was smooth, and the only issue is operator error."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donte carter",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T14:11:05.000Z",
          "Titre": "Best experience I had with 8fig they…",
          "Contenu": "Best experience I had with 8fig they really listen and work on your behalf and business love that!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Worldwide Brands Direct LLC",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T14:47:05.000Z",
          "Titre": "We just began with 8fig and so far the…",
          "Contenu": "We just began with 8fig and so far the program looks good and will work better for us that our current financing. There was a glitch in their site that caused a delay in getting the first payment but it has been fixed and our rep has been quite responsive in having this resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Naeem",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T15:44:22.000Z",
          "Titre": "The process was fast and easy",
          "Contenu": "The process was fast and easy. They gave me a great offer I just wasn’t  able to take it because it didn’t fit my company at the time ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cadogan Justin Price",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T20:07:42.000Z",
          "Titre": "8Fig Feedback",
          "Contenu": "All in all, we have had a positive experience with 8Fig. There have been challenges on more than one occasion with their platform and that has created concerns about how we can partner together long-term. Nevertheless, we have had a really positive experience with the customer service team, especially Jenifer Dobbins. Jenifer has always been incredibly supportive and prompt in her communication. Our truly appreciates the support Jenifer continues to demonstrate!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marisol",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T22:28:52.000Z",
          "Titre": "8 Fig has been a great solution to keep my business running and avoid going out of stock.",
          "Contenu": "8 Fig has been a great solution to maintain my items in stock and do not run out of inventory. Their founding allows me to keep my business running. They are also supportive if I need to change my plan when things change. I am glad I found them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennafer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:38:14.000Z",
          "Titre": "Recommended by me!",
          "Contenu": "They definitely keep on contact and try their best to help you. They are very kind people. I definitely recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnnie East",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T10:36:36.000Z",
          "Titre": "Yes I would be interested to join in…",
          "Contenu": "Yes I would be interested to join in great experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rj",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T15:05:48.000Z",
          "Titre": "8fig is a awesome company that not only…",
          "Contenu": "8fig is a awesome company that not only has finance means to help grow your buisness. It also helps guide one with tools to help achieve the goals of a successful business and have the opportunity to grow with great insight from the assessment they give."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corey Fletcher",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:55:18.000Z",
          "Titre": "It helped me to understand how to Connect business partners to my Woo Commerce Store",
          "Contenu": "It helped me to understand how to install intergrations, to be able to connect 8fg and other Sales Channels to my Woo Commerce Store."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T17:36:01.000Z",
          "Titre": "As a client of Trust Pilot",
          "Contenu": "As a client of Trust Pilot, I found it to be great ! In the sense of an experience,! I also had fun using TEST Pilot, getting the job, done, while enjoying the experience. Thomas Hunt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EDUARDO  RODRIGUEZ",
          "Nb_Reviews": 4,
          "Date": "2023-11-27T16:09:52.000Z",
          "Titre": "Very helpful",
          "Contenu": "The representatives of 8fig have been fantastic. They totally understand my business cash flow and inventory planning. They listen to you and are flexible to make sure your plan is completed successfully."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Nathan",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T21:51:04.000Z",
          "Titre": "8fig has once again been responsive and…",
          "Contenu": "8fig has once again been responsive and supportive to our business."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Robert MacArthur",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T04:14:40.000Z",
          "Titre": "Very helpful and easy to communicate…",
          "Contenu": "Very helpful and easy to communicate with as far as helping to fill out forms etc. The concept is a great one for business starters. How can you not love a group that wants to give you a loan when your business resourses are just about tapped. Ill be dealing with them again definately. Robert M."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Pittinaro",
          "Nb_Reviews": 4,
          "Date": "2023-11-27T14:35:56.000Z",
          "Titre": "Positive Experience",
          "Contenu": "This company was very professional, courteous, and kind explaining the process and guidelines of their program. My company did not qualify for proceeds, but was a very positive approach to the guidelines and how the program works for a possible qualification in the future. I would recommend this company to anyone who feels it would be an advantage to go through their program."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nour Saad",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T15:31:41.000Z",
          "Titre": "8fig is an amazing company and has…",
          "Contenu": "8fig is an amazing company and has helped me a lot realize that I need an e-commerce business with profit for funding ! Thank you 8 fig!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fletcher, Corey",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T00:43:43.000Z",
          "Titre": "It gave me new funding options to grow…",
          "Contenu": "It gave me new funding options to grow my business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T15:19:10.000Z",
          "Titre": "Utilizing the dashboard made it…",
          "Contenu": "Utilizing the dashboard made it extremely easy to submit my request .The response I received was timely and perfectly understood.My request was handled to my satisfaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T19:58:17.000Z",
          "Titre": "Juan was great he was prompt",
          "Contenu": "Juan was great he was prompt. He was concise he was to the point he explained the scenario and the reason I should come back in one year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emma",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:54:22.000Z",
          "Titre": "My experience has been very positive,I…",
          "Contenu": "My experience has been very positive,I highly recommend them to other D2D business.I appreciate the way 8fig plans everything"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Satisfied Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T14:57:50.000Z",
          "Titre": "They are very efficient",
          "Contenu": "They let you know exactly what you have to do to receive funds."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T05:13:32.000Z",
          "Titre": "Super Easy Access!",
          "Contenu": "The process of discovering information and applying was extremely easy and designed to be self-guided without a lot of reading instructions, which is a huge help when business is hectic.  If we had time to sift through volumes of instructions in order to fill out a simple form, we probably wouldn't need capital!  Thanks, 8Fig, for making it easy to get on board!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Althea",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T08:20:10.000Z",
          "Titre": "Good business"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Tavera",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T17:30:37.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, good service i love it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cadaryl",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:42:19.000Z",
          "Titre": "8fig review",
          "Contenu": "Easy and efficient platform to \"User-friendly for beginners to navigate. Exceptional customer service that is top-notch.\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Smith",
          "Nb_Reviews": 4,
          "Date": "2023-12-07T15:24:59.000Z",
          "Titre": "The process was simple and straight…",
          "Contenu": "The process was simple and straight forward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Summer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T14:10:53.000Z",
          "Titre": "Everyone is so nice and helpful…",
          "Contenu": "Everyone is so nice and helpful throughout my process so far! Looking forward to continuing this business relationship!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T18:07:06.000Z",
          "Titre": "Super easy application,seems to me that…",
          "Contenu": "Super easy application,seems to me that this company is made up of well minded individuals looking to help people succeed, waiting now to see if they will be the one to actually help this thing hit the ground running. Fingers are crossed, but for some reason I feel as though I will be getting approved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "hudsonsoundslab",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T14:11:00.000Z",
          "Titre": "Hudson Sounds Lab",
          "Contenu": "I really like the offer to help grow my business experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T17:30:04.000Z",
          "Titre": "Impressed so far!",
          "Contenu": "I'm just getting started with 8fig but, so far, they've been great. They seems to be primarily focused on Amazon sellers but they were able to work through a few atypical things with my company (ecom with our own website) and provide funding that will help us grow. In addition to the good customer support and communication, they also produce informative content for ecommerce sellers. I look forward to working with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mind Eyes",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T20:46:37.000Z",
          "Titre": "Cash Flow and a Success Plan",
          "Contenu": "A unique structure that solves cashflow problems by providing lending options with a plan. 8Fig offers an interactive planning tool that helps sellers stay on track with their goals and budget."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Omari",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T15:50:51.000Z",
          "Titre": "Good experience",
          "Contenu": "Good experience. Thanks for letting me provide feedback."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Abdoulfatah Mohamed Yusuf",
          "Nb_Reviews": 5,
          "Date": "2023-07-12T16:21:53.000Z",
          "Titre": "Hands down the best e-commerce financing company…",
          "Contenu": "Hands down the best financing company for e-commerce companies. The process is so smooth and fast. And their customer success manager, Tanner, goes above and beyond to help you with any questions that it feels like he is the owner of the company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T22:41:24.000Z",
          "Titre": "8fig has been a great company to work…",
          "Contenu": "8fig has been a great company to work with. Very professional, and very focused on working with their customers to find the right solution.  8fig knows their business, and small to medium size businesses should consider them when looking at growth strategies."
        },
        {
          "Note": 5,
          "Lieu": "TN",
          "Pseudo": "Bilel Rais",
          "Nb_Reviews": 9,
          "Date": "2023-05-17T17:37:27.000Z",
          "Titre": "Just amazing",
          "Contenu": "Amazing value proposition and amazing service. Our plan was activated in a few days, and our account manager Tanner did everything he could to answer any questions. This is probably the best MCC for eCommerce out there. Looking forward to more collaboration with 8fig.co."
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "Gideon",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T09:48:53.000Z",
          "Titre": "Smart scaler…",
          "Contenu": "You make businesses skyrockets with a matter of clicks and in a matter of minutes. I saw that potential, I went for it. Scaling made easy like it was meant fir amateurs. One thing, I accessed through a mobile device and because of that, access was denied. But I love 8fig."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lowell Bekker",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T17:50:36.000Z",
          "Titre": "Easy to activate plan and really…",
          "Contenu": "Easy to activate plan and really supportive customer service! Tanner helped me from start to finish and answered any questions I had. Definitely recommend if you're looking to explode your sales!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Queens Beauty",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T22:58:50.000Z",
          "Titre": "Amazing team!",
          "Contenu": "The team and Jen ! Did a Fantastic job in helping me adjust my plan and appreciated their help to be flexible with my plan and situation! Everyone is super helpful and friendly! Jen was amazing! Would recommend anyone looking for flexible funding to seek out 8fig!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ryan Sherrard",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T23:20:14.000Z",
          "Titre": "8fig Accelerated Our Growth",
          "Contenu": "As one of 8fig's earliest customers, we've had the pleasure of working with the team for a few years now. They are dedicated professionals, and without the capital they provided it would have taken years to scale our business as fast as we did—from nothing to 7-figures to Exit, all in less than 3 years."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T09:39:43.000Z",
          "Titre": "2nd plan with 8fig helped us enormously…",
          "Contenu": "2nd plan with 8fig helped us enormously in growing our business to 7 figures! Very well made and fitted for ecommerce brands who's willing to scale their business."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Ran",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T12:30:15.000Z",
          "Titre": "A game changer for our ecommerce brand",
          "Contenu": "8Fig's financial planning and funding services have been a game changer for our ecommerce brand. Their smart platform helped us reach our financial goals quickly and efficiently, and we were able to receive funding in a fast and streamlined process. We would definitely recommend 8Fig to other ecommerce brands looking to take their financial planning and funding to the next level."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T18:00:34.000Z",
          "Titre": "Great and Helpful",
          "Contenu": "My plan was just activated. The process was seamless, fast, and on point. Tanner was just great. He helped me every step of the way, he was willing to explain everything and found alternatives when things didn't come my way, he was fast in replying to my questions. All in all I have nothing but great things to say."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T19:23:15.000Z",
          "Titre": "8Fig is amazing!",
          "Contenu": "Your team was amazing to work with, thank you Carli for all your help answering all my Q's. Easy to use dashboard/ platform and very insightful information that can be utilized to ensure investments into the business are made in the right areas, reaffirming the capacity to grow our e-comm business!! Thanks for such a great resource & option to a more 'dynamic' way of funding."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "MichaelG",
          "Nb_Reviews": 3,
          "Date": "2023-07-24T17:22:35.000Z",
          "Titre": "Very good support from Juan",
          "Contenu": "Hi With the support you have JuanGold guyResolve every problem that comes Maximum doing video conference to understand the issue"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bipinjot Gill",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T14:43:49.000Z",
          "Titre": "I am almost finished completed my file…",
          "Contenu": "I am almost finished completed my file for funding. If i get the funds i will use it on my business and generate wealth that will secure my future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jin Qiu",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T17:18:07.000Z",
          "Titre": "Generous funding and very reasonable payback",
          "Contenu": "Account manager was very helping in getting what I needed. 8fig was the most generous funding partner I've come across as a growing small business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pupsentials",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T17:11:16.000Z",
          "Titre": "I loved working with 8fig to help my…",
          "Contenu": "I loved working with 8fig to help my company grow to 8figs! Customer service is 5/5 stars and wonderful, responsive, and helpful. Carli was awesome!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamil H",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T15:48:47.000Z",
          "Titre": "Very easy enrollment process and very…",
          "Contenu": "Very easy enrollment process and very excited to work with 8fig to take our business to the next level! With their help we should be able to scale to mid 7-figures within the next year!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cory Beattie",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T22:07:26.000Z",
          "Titre": "Tanner was very efficient and prompt in…",
          "Contenu": "Tanner was very efficient and prompt in handling our application. Really looking forward to scaling our business with 8fig's Team!"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Nathan",
          "Nb_Reviews": 3,
          "Date": "2023-02-17T19:48:33.000Z",
          "Titre": "8fig is incredibly responsive to…",
          "Contenu": "8fig is incredibly responsive to changes in cash requirements and sensitive to the pressures that changes in market performance or conditions can have.We are very grateful for the business support that 8fig is providing us as an early stage business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VSN",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T17:55:41.000Z",
          "Titre": "Juan is very knowledgeable",
          "Contenu": "Juan is very knowledgeable, respectful and patient men. He took the time to demonstrate and explain to me how to add and edit lines. It was nice to talk to him in person and to learn something new."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tenisha",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T17:23:48.000Z",
          "Titre": "Tanner was AMAZING…",
          "Contenu": "Tanner was AMAZING… he made my experience very hassle free… if you want to try this company request Tanner he will get you up and running…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Stover",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T16:46:05.000Z",
          "Titre": "I never thought I'd be worthy to receive enough capital to get me started. Extremely blessed and happy.",
          "Contenu": "The fact that you believed in me is enough already. Thank you so very much 🙏"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jMod Boutique",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T01:35:16.000Z",
          "Titre": "8 fig was amazing",
          "Contenu": "8 fig was amazing! Most streamlined, easy process with support along the way. Thank you for helping my business grow to the next level!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabriela",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T19:49:30.000Z",
          "Titre": "THE GROWTH PARTNER WE HAD BEEN LOOKING FOR!",
          "Contenu": "Our brand had been craving this for so long. Capital that grows with our business, without taking an absurd amount of stake. Very happy to have found 8fig."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda Marie Boshell",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T10:14:30.000Z",
          "Titre": "8fig  was able to help me no problem.",
          "Contenu": "Yall was able to help me no problem."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "David Lang",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T12:33:31.000Z",
          "Titre": "Extremely Rapid Growth",
          "Contenu": "8fig provided us a flexible financing solution that permitted us to grow our company in a very short amount of time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T22:09:37.000Z",
          "Titre": "Good Company for e-commerce.",
          "Contenu": "My experience  With 8fig is really good. This company is very flexible. They give me the amount that I am looking for. The payments are affordable. so I am happy to work with this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lue",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T03:59:38.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Great staff! Made the transaction so smooth!! I would definitely recommend 8fig to friends & family."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Philippe",
          "Nb_Reviews": 2,
          "Date": "2023-04-19T13:08:36.000Z",
          "Titre": "Great service!",
          "Contenu": "My experience with 8 fig has been great. I like the flexibility of the plans. I have been working Jenifer and she's been able to guide me since the beginning. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamara",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:45:30.000Z",
          "Titre": "Beautiful experience ever"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Tali",
          "Nb_Reviews": 3,
          "Date": "2023-07-10T21:56:17.000Z",
          "Titre": "8fig always Helping adjust plans in a…",
          "Contenu": "8fig always Helping adjust plans in a way that suits your business"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Afshin  Make Up Duo",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T12:35:01.000Z",
          "Titre": "Absolutely wonderful every step of the…",
          "Contenu": "Absolutely wonderful every step of the way. I can’t wait to start my new journey with 8fig at my side. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claude",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T20:27:40.000Z",
          "Titre": "Fast Service",
          "Contenu": "The experience was due to the speed of the service.  I'd recommend this to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:41:03.000Z",
          "Titre": "Great service",
          "Contenu": "Great service and planning"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maribeth",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T19:48:29.000Z",
          "Titre": "Veryyyy helpful and i am soooo excited…",
          "Contenu": "Veryyyy helpful and i am soooo excited to grow with 8fig. 100% recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manasseh Moga",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T05:34:26.000Z",
          "Titre": "I have been able to scall my business…",
          "Contenu": "I have been able to scall my business higher than I would have without 8fig"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T14:18:00.000Z",
          "Titre": "Excellent customer service very…",
          "Contenu": "Excellent customer service very informative and professional"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nour Saad",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T03:49:09.000Z",
          "Titre": "8 fig is an amazing company !",
          "Contenu": "8 fig is an amazing company !! Props"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T11:15:41.000Z",
          "Titre": "So easy to work with !",
          "Contenu": "Amazing company. Always been there for my business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tenisha",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T13:55:16.000Z",
          "Titre": "Tanner was amazing and Will was very…",
          "Contenu": "Tanner was amazing and Will was very very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alizha",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T14:16:35.000Z",
          "Titre": "Great experience using 8fig"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "lizzy",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T01:49:43.000Z",
          "Titre": "Everyone is very nice",
          "Contenu": "Everyone is very nice, positive and helpful always."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T15:28:07.000Z",
          "Titre": "8Fig: Great Service, Great Team",
          "Contenu": "Jen was super helpful in helping us navigate the platform. We appreciated the personalized on-boarding experience. Can't recommend enough!"
        },
        {
          "Note": 5,
          "Lieu": "BY",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T22:46:12.000Z",
          "Titre": "We are proud to be with 8fig",
          "Contenu": "We are proud to be with 8fig. Easy to launch, transparent and fair. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Althea",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T19:13:10.000Z",
          "Titre": "Great so far"
        },
        {
          "Note": 5,
          "Lieu": "IS",
          "Pseudo": "Karl",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T10:38:31.000Z",
          "Titre": "Great service and support from…",
          "Contenu": "Great service and support from beginning."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2023-10-14T19:59:36.000Z",
          "Titre": "Fast and easy to apply"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "yoav yones",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T13:09:21.000Z",
          "Titre": "Thank you",
          "Contenu": "Amazing service. Very credible!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tate",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T16:27:42.000Z",
          "Titre": "Very easy and simple process."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T12:56:26.000Z",
          "Titre": "Shift",
          "Contenu": "Great lean with us so tanks so muchs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sir",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T03:56:04.000Z",
          "Titre": "Nice I like it……."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clansy Cheistian",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T09:20:05.000Z",
          "Titre": "Loved the review",
          "Contenu": "Grateful service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Simeon Talley",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T22:21:13.000Z",
          "Titre": "Very responsive."
        }
      ]
    }
  ]
}