{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "abclegal.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adri T",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:56:36.000Z",
          "Titre": "They’ll cost you your court case",
          "Contenu": "GO TO THEIR BBB PAGE!  They cost me and my husband our shot at justice and thousands of dollars. Thorough review will soon come… for now, I advise you to go to their BBB page and look at the massive amount of complaints they have. It’s clear these positive reviews are fake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve -",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:46:59.000Z",
          "Titre": "Horrific service, just took the money and didnt do the job",
          "Contenu": "Id give a zero if possible. Did not make any attempts to serve within 5 days as stated. Deadline for service was noted at day 14 without a continuance. Date came and past. Defendant was served the incorrect paperwork, but that didnt matter because it was late. I followed up with ABC 6-7 times during the process, communication was late and ineffective."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oughton Law",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:21:49.000Z",
          "Titre": "Your process server failed to serve",
          "Contenu": "Your process server failed to serve the complaint based solely on the representation that the person being served filed bankruptcy and has an attorney, which, in addition to not being true, also is not a basis for failing to serve the complaint.  When this was brought to your attention, you stated that you would charge an addition $150 to go back out to complete service.  In 16 years of practicing law, I have not ever had a process server determine when service was appropriate based on the party being served saying that they filed bankruptcy or had an attorney because, I would imagine, that is not what the process server is being hired to do.  Please refund the money charged for this service and I will remove the negative review online.  We found another process server for this job."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T23:52:45.000Z",
          "Titre": "Very bad experience ABC Legal so far.",
          "Contenu": "Very bad experience ABC Legal so far.. really hoping they can fix it. Hired them to serve a case to an individual, and several weeks later only one attempt was made. In addition, several clerical errors have been made through the process, which I have had to reach out to remedy on several occasions. I initially chose to go with ABC because they are a larger company and felt they could get the job done, however I am now learning this was possibly a mistake and I am probably just another person they can overcharge and deliver subpar results to because they are too big to care."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kayla Myren",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:52:24.000Z",
          "Titre": "This company is terrible",
          "Contenu": "This company is terrible.  I requested service on 3 parties.  They went once and told me the person did not live there and when I asked them to try again they charged be an additional $75 even though I paid for 3 attempts.  Then they said there was a snow storm and they \"couldn't reach the address\" but there was no picture, next they attempted service at the wrong address but still charged me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dale",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T20:44:20.000Z",
          "Titre": "I've been dealing with the VP of Compliance.",
          "Contenu": "I've been dealing (General Counsel/VP of Compliance) about an incident that happened at my home with one of their servers in May 2023. I've made 7 phone calls on 5/26, 2 phones 6/28 and 2 phone calls 7/11. Ive sent several email and pictures, last email was sent on 10/26 with no response. I'm going to make a long story short, Server left my gate open and one of my very expensive dogs got out without my knowledge and has been gone since May, This company refuses to take responsibility for the actions of the server. I'm waiting for a resolution about this matter."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Manny",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T21:43:30.000Z",
          "Titre": "Absolutely horrible experience",
          "Contenu": "Absolutely horrible experience. I paid for rush process serving for 2 days to be complete and it has been over a week. I’m still waiting to hear why my tenant who needs to be served so I can start the eviction process hasn’t been served yet. I’m totally regretting using ABC Legal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christen Shepherd",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T22:45:45.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible.  They don't know the basics of personal service, since they gave me one name of a person to have appointed, and then randomly gave it to two other different people -- that's not good service.  Won't let you talk to the server, to try and get updated information to them on hard to serve people.  They make you do everything all over again and pay double to try different addresses for one target person.  Awful.  Hate them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gail",
          "Nb_Reviews": 3,
          "Date": "2023-09-03T01:46:40.000Z",
          "Titre": "Horrible people doing as little as…",
          "Contenu": "Horrible people doing as little as possible to get the process served. Just thinking about attempting during a Tropical Storm counts as an attempt, Sunday morning at 7:45 am for a business in an industrial park, two evenings at 8 p.m. were a waste of time.  Strongly NOT recommended!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Burt - Burt Jones burtdjonesjr",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T21:37:11.000Z",
          "Titre": "Terrible service",
          "Contenu": "Terrible service. I paid for an immediate service 2days. The original documents has to be submitted by me, which means the proof that I printed out was denied by the court. And the originals are God knows where. Terrible service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deswin C.",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T17:31:50.000Z",
          "Titre": "Process was served but…",
          "Contenu": "Process was served but the service paper has YET to be signed by the process server and it’s been almost a week since initial service. The whole point of using this method was to expedite service but now I am being held up by this company and no one is reaching back out to me to respond to what is happening."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ems",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T21:57:47.000Z",
          "Titre": "Don't use if you're in a hurry",
          "Contenu": "Paid a rush fee, but it wasn't rushed. Then didn't even get done during the standard promised time frame. Deadlines were missed. Finally, service was done after reassignment of three different people, the second of wish lied about the attempt of service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "N/A",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T06:14:37.000Z",
          "Titre": "Too Slow and Servers Don't Try",
          "Contenu": "The prices are severely inconsistent, as they will price the service of process based on the first address listed.  Secondly, whoever ABC Legal uses to serve process, they are not only extremely slow, but they find every excuse in the book not to complete the service.  The prices are okay compared to other companies, but the service is garbage."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joan - Strong & Hanni",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T05:02:18.000Z",
          "Titre": "You never served and when I called to…",
          "Contenu": "You never served and when I called to find out what was going on four days later, said you don’t serve the area, but you took our money and still haven’t returned it despite two requests."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nichole Atkinson",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T22:29:22.000Z",
          "Titre": "Worst service company!",
          "Contenu": "Worst service company!  Proofs of service are ALWAYS completed incorrectly, resulting in rejections from court.  Process servers falsify proofs, stating they have served individuals that were not in fact served.  They fail to send the required mailings and provide proofs of mailings for sub-serves.  Customer service reps and supervisors place you on hold and then hang up on you.  Phone service hangs up on you after being on hold for 10 minutes.  No replies to messages and requests for corrections.  BEWARE, watch your proofs of service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doris - Schlimgen Law Firm",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T22:18:54.000Z",
          "Titre": "Do not use this company!",
          "Contenu": "The process server did not use common sense to find the address. She wasted two attempts due to \"weather conditions\" and wasted another attempt saying she couldn't see the house number. Which then they wanted to charge me an additional cost for a new address. I did a quick google search of the property and sent her the screenshot circling the house number. Only then was she able to find it. It took a long time to get the person served. I would recommend using the sheriff's office or a different process server to get your documents served. Not impressed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary - Mary Grace Sterling mar",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T04:19:52.000Z",
          "Titre": "Even after showing the company the CA…",
          "Contenu": "Even after showing the company the CA requirement of at least 3 personal service attempts before substitute service, the process server substituted service on the first attempt then again on the second.  He only made a second attempt because I complained!  Now my lawyer says this service may not hold up in court and puts me at legal risk!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Mathers",
          "Nb_Reviews": 1,
          "Date": "2022-08-13T17:07:47.000Z",
          "Titre": "Dreadful",
          "Contenu": "Dreadful! Put in an order for rush service on Monday. Didn't hear anything, sent two messages. Finally I called customer service Friday. Said they would get on it ASAP. Another day later, still haven't heard anything. No service, no communication. Will not use again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 2,
          "Date": "2023-07-30T00:00:49.000Z",
          "Titre": "Server is terrible",
          "Contenu": "Server is terribleHas attempted twice in a week, both times during the middle of the day when tenants are at work. Why doesn't server try in the evening or on the weekend. I have written my comments, last Thursday, to your support email. I am waiting for a response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Elkins",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T02:07:30.000Z",
          "Titre": "Do not use!",
          "Contenu": "Your server tried to serve a company after hours on a Sunday, then took almost 2 weeks to try again, only after I called several times to ask why my paperwork was not being dealt with. I was told the server had a lot on her plate. too bad you offer a service in a timely matter and you did not do that. Hold your people accountable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Megan Schilling",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T23:50:25.000Z",
          "Titre": "Error after error",
          "Contenu": "I had very high hopes after reading reviews. We used them as a process server and although they completed the service part ok, they made significant errors in the Proof of Service document. Each of their attempts to fix it introduced additional egregious errors in the document, thus holding up our ability to get them on file with the court. Painstakingly slow to respond and consistently frustrating. I will not recommend and will not be using them ever again. Beware!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T01:41:41.000Z",
          "Titre": "Extended delays with no updates outside…",
          "Contenu": "Extended delays with no updates outside of the 5 business day window.  Unable to service papers, defaults to not updating the status, and wastes valuable time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark - Law Office of Mark J. Y",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T21:51:39.000Z",
          "Titre": "Late to serve",
          "Contenu": "Late to serve, slow to provide proof of service, failed to return proof of service in consumer notice, generally non-responsive except for customer service, who couldn’t get action from process server either.One and done.  ABC should be XYZ, the last place finisher.Will publicize your incompetence."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JP",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T11:40:22.000Z",
          "Titre": "Using them is tantamount to malpractice",
          "Contenu": "They promise serviced within 5 days, it weeks.  Their servicer claimed that the original address was unusable because it lacked a unit number.  I paid $235 for investigations to find another service address; the process took months. Then I discovered that the original address was 100% correct, that the building did not have unit numbers.  I asked ABCLegal for a refund and they refused.UPDATE: After kicking up a fuss, they have refunded the investigations. But they refuse to refund the subsequent service attempts, even though they were necessitated by ABCLegal's screw up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raegan attorney",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T16:43:03.000Z",
          "Titre": "Improper Service in Texas",
          "Contenu": "Texas has very specific service laws for out-of-state discovery. I was assured that service would be properly handled; however, it was not. Now, I'm going back and forth with ABC's compliance team about whether I was the one at fault. This is unacceptable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shawn Mitchell",
          "Nb_Reviews": 2,
          "Date": "2022-10-27T01:34:16.000Z",
          "Titre": "Your process server was rude and…",
          "Contenu": "Your process server was rude and continued to come to my house when our nurse told her my stepson (who she was looking for) has never lived here. On the third visit I was home and berated her for her aggressive behavior including knocking on our windows!   She refused to identify herself and only admitted she was a process server. If this is indicative of your company's business I would recommend staying far away!  We didn't know what she was up to until the third visit.  I told her to not come back and will pursue legal action for harassment if this continues.  She only flashed this company's card as she left."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sydney",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T20:01:15.000Z",
          "Titre": "Many mistakes",
          "Contenu": "They served our clients and then had to redo service, then continually put the paralegal's name as the attorney of record on the proofs of services.  Made several messages to correct it and was ignored. called the rep and they gave the customer service number.  A big mess that should not have happened."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John - Bull and Davies PC",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T06:51:55.000Z",
          "Titre": "You charged me another $75 for a second…",
          "Contenu": "You charged me another $75 for a second attempt. This charge was not clearly shown before purchase and I have access to other process servers that charge less and do 3 attempts included in the base price. You might have gotten an extra $75, but you lost my business and I’ll be sure to remember this when I’m recommending process servers to my firm and colleagues in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Connie Rozier",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T19:54:21.000Z",
          "Titre": "We gave the California servers two…",
          "Contenu": "We gave the California servers two Unlawful Detainers to serve in January. Neither job was completed in a month. I cancelled the service and another company was able to get the service done in a week. They went over 5 days without even attempting to serve the documents despite my urging."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laurent La Brie",
          "Nb_Reviews": 3,
          "Date": "2023-04-17T15:58:20.000Z",
          "Titre": "If they had actually done what I paid…",
          "Contenu": "If they had actually done what I paid them to do.  I gave them the hours that the individual would be at what location and they followed my instructions only once out of 3 times.  I paid for expedited service and they made an attempt within 48 hours but to the wrong address. I will never use them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ericka - Cheves | Briceno",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T14:13:37.000Z",
          "Titre": "No one has responded to me about the…",
          "Contenu": "No one has responded to me about the service. I added a new address and no one responded about the new address or new service. I had to pay another company to do what I paid you to do!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Becky Winegard",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T21:10:03.000Z",
          "Titre": "Waste of Time",
          "Contenu": "I submitted documents to be served on four defendants on May 11th. It was not entered into the system until May 13th. As of May 18th I had no communication from ABC Legal nor had a process server been dispatched. ABC Legal then contacted me on the 19th and said they could not find a process server in the area and asked if I would like them to contact the sheriff's office for process. I had to call another local processor to do a rush job to fix the mistakes of ABC Legal. Oh, and the local process server finished the job in less than four hours."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin morris",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T00:21:28.000Z",
          "Titre": "Used their service a couple of times and…",
          "Contenu": "Used their service couple of times and they were reasonable, however, they would not e-file the declaration of non service and their supervisor claimed they no longer support this service even though both their website and links on odyssey eFileCA mentions they e-file case documents to the courts.  I was surprised after a $75.00 fee and failing to serve the defendant they would not send the form directly to the court via e-file.  It turns out, that If they successfully serve an individual based on my past experience they would e-file the affidavit documentation to the court. What their supervisor told me and what their website claims are totally inconsistent what happened to me today."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elisabeth - Elisabeth Dillard",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T22:07:32.000Z",
          "Titre": "Frustrating Service",
          "Contenu": "I had someone in Georgia served on 8/28. The Proof of Service had the wrong address on it. The process server was aware of this, but for whatever reason was unable to change it. I was not notified of this, I only knew by seeing the pictures he uploaded and knew that it was not the correct address. I contacted the company and was the address was corrected and he would mail the new Proof of Service directly to me. My second contact to the company was concern that the new Proof of Service had not been signed. I was updated through the dashboard on 9/8 that it had in fact been mailed to the Atlanta office on Wednesday, 9/6. I contacted the company again on 9/8 and told them I had been told the original would be mailed directly to me. I was placed on hold and then assured that the corrected original was placed in the mail directly to me that morning and would be uploaded to the file. As of today, 9/9, a signed Proof of Service is not showing in my file. I have found this process very frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NN",
          "Nb_Reviews": 23,
          "Date": "2023-01-05T16:07:03.000Z",
          "Titre": "Such a mess",
          "Contenu": "Such a mess. I uploaded my documents. Instead of serving my documents they substituted them with someone else’s documents (that had nothing to do with my case) and tried to serve them to my defendant. I’ve noticed these strange changes on my account and immediately messaged them asking to fix this. Their customer service took their time to respond. They didn’t even bother to check what was going on, sent me a general message and disappeared again. My service has been paused, I have no idea what’s going on and when my documents will be served. Also - I’m in possession of someone else’s confidential documents that their client support casually emailed me without making sure I was the owner of the documents. This makes me wonder who might be in possession of my confidential documents"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joey Haley",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T16:23:02.000Z",
          "Titre": "Worked my butt off serving for them…",
          "Contenu": "Worked my butt off serving for them last week, and was underpaid by almost $400. Served 3 that listed as over $100 a piece, and was paid about $10 for each. ABC stated that was the pay for \"posting\", but I served the 3 in person. Served another that was supposed to pay $70, ABC stated that the identity was not verified, and did not pay me. Gas prices are too high to be on the road serving papers and not get paid... VERY disappointed in this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nikkie - Campbell Killin Britt",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T17:56:55.000Z",
          "Titre": "Will not be using ABC Legal again",
          "Contenu": "We paid for a rush delivery of 1 company, that was under 3 entities - it took almost 2 weeks. I explained from the very beginning and throughout that I submitted 3 service requests, for the same address, under the same order because the 3 entities were actually 1 company. Nevertheless, ABC Legal dispatched different servers for each entity and for some reason, each time, only one entity was served. Each time we would begin the process of me explaining that it was the same company, them dispatching different servers, only one or none served. This process was repeated over and over until I finally let them know it was ridiculous that they could not serve one company, at the same address. After I brought this up - Voila! - a process server was dispatched that same day and service was completed. I'm sure this is how ABC Legal racks up costs, so we will not be using them in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brad Clark",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T09:22:18.000Z",
          "Titre": "New bracelets lol",
          "Contenu": "Only way to serve people is to falsly imprison them and attempt to assault them with your vehicle at 1:00 am.  One of their star employees behind bars tonight."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Colleen",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T02:54:48.000Z",
          "Titre": "I never heard back",
          "Contenu": "I never heard back with a proper response and with the correct paperwork. I’ve had a completely disappointing experience all the way around with the exception of receiving a full refund.   None of the services that I purchased were done."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alvaro Kraizel",
          "Nb_Reviews": 3,
          "Date": "2023-04-18T19:21:28.000Z",
          "Titre": "After 11 Days the process server claims…",
          "Contenu": "After 11 Days the process server claims he couldn't finish his process because there was a tornado. I checked there wasn't! I called yesterday as to why another 6 days have passed without any further attempts. She called Bruce the assigned Process server, and he promised he will go out there today. Another day goes by and nothing Bruce claims he couldnt make it out yesterday but promised he would go today. The level of incompetance is unbelievable. So today I asked to speak with the Supervisor Vincent who is the client support manager. I told him how unacceptable this was and said Bruce will definately go out today. I said I cant waste anymore time on meaningless promises. I wanted a different process server assigned. His response was that Bruce was assigned and that he will for sure Go out today. I insisted that anyone but Bruce and his second response was that maybe I should issue you a refund. I said that would be a good Idea. Need to deal with compatant professionals. NEVER AGAIN!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Jones",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T22:32:15.000Z",
          "Titre": "Failure to pay as promised",
          "Contenu": "Failure to pay as promised, don't understand or accept Pennsylvania rules in Service of Civil Process, even after providing the relevant sections of the Rules of Civil Procedure.  Had to resend affidavits multiple times because they reportedly never received them, even though they were signed, uploaded through their website and mailed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeramy",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T01:46:30.000Z",
          "Titre": "I had complaints to serve",
          "Contenu": "I had complaints to serve. The first two went without a hitch. The third I had to pay again and resend instructions. I guess the carrier Ahmed can’t read and still asked for instructions after I clearly wrote them down. He also needed me tell him the address again I guess because he could not read it the first time. The service is mostly good but sometimes you get a dumb carrier that slows the process. In that case certified mail Is the best way to serve if possible. I hate paying, then having to baby sit a company employees to do the job."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy - Vinson & Bales",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T22:30:14.000Z",
          "Titre": "Staff did not handle professionally",
          "Contenu": "Company made multiple errors regarding our service. Spoke to staff who was unable to answer what happen, said they would have someone contact us and never did."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOHN - MONTE J WHITE & ASSOCIA",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T19:54:20.000Z",
          "Titre": "I still have not received my notarized…",
          "Contenu": "I still have not received my notarized return to file with the court."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard - Richard Zelma  tcpal",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T03:15:31.000Z",
          "Titre": "The company screwed up service and only…",
          "Contenu": "The company screwed up service and only admits they guarantee service.They won’t own up to tipping off my defendant.I will take this up with their licensing agency."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "N/A",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T17:45:31.000Z",
          "Titre": "Errors, Slow to Correct",
          "Contenu": "As of writing this review the error has still not been fixed. First of all, they do not notify you by email or phone that your proof of service has been signed by the process server, you just have to check and maybe it will be there. Then, when I finally get them, I find that the PDF files are corrupted and the signed entries are scattered across the page, not in the correct locations. Once they finally get back to me about fixing them, I go to download them and while I had two different documents, they uploaded the same proof of service for both of them, not the proof of service for each separate one. It has been days since I notified them of this issue, I've only gotten one message back, saying they are reaching out to another team member to figure out the issue, but the issue is a very simple matter of uploading the correct PDF. There are a lot more affordable process servers out there, if I were in a case that had a higher level of urgency I would expect ABC Legal, especially for the price, to do much better."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mariana - M&M Attorney Service",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T04:57:39.000Z",
          "Titre": "your company took the job,,,,",
          "Contenu": "your company took the job,,,,, we requested status several times and after 10 days they emailed.....\"sorry, we are not going To complete the job.\"horrible!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shuga Bear",
          "Nb_Reviews": 3,
          "Date": "2023-01-03T23:11:58.000Z",
          "Titre": "This place has false job descriptions…",
          "Contenu": "This place has false job descriptions and false advertisement.  ABC Legal says you don't need a process server certificate.  CLEARLY STATES NOT REQUIRED and it is required.  ABC Legal should say required if you are hired.  If you get this certificate, you can work any place you don't have to work with ABC Legal.  I don't like the fact that they are not transparent. Put the job description in FULL DETAILThank you for the response ABC Legal but like I said put in FULL DETAILS on what is expected.  People can do this on their own and make more money.  I researched it very well.  You all have a Blessed day as well!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda - Linda Layman",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T05:16:04.000Z",
          "Titre": "My last communication was not answered",
          "Contenu": "My last communication was not answered.  The description of who was served and who was supposed to be served differed greatly.   Also, the server did not indicate the person served had a purple beard.  That would be my first proof that I served the individual If I was the server.   It was never mentioned.  I do not think it was served to the intended party."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D. Mayer",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T23:26:14.000Z",
          "Titre": "Use Someone Else",
          "Contenu": "Requested Rush Service. Service was not completed. A week after the original order I was informed that they do not have a process server in my area. Will not use again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Floyd",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T21:40:14.000Z",
          "Titre": "Worst process server encounter in 28 years",
          "Contenu": "I've been practicing for 28 years.  This is the worst process server I've ever encountered.  I think it's just a tech company that provides a platform for requests and farms the service out.  The company doesn't seem to know anything about perfecting service or that's time sensitive.  I requested an expedited service.  Four days later, I had to call them and they refunded by expedited fee and said it would be served that day.  Two days later, first attempt.  After the second attempt, they gave up.  No one informed the entire time.  I called again and was told that the details are on-line.  I sign in, no details.  Just two attempts made at these times and at this address.  I call again and tell them I need a declaration so I can seek substitute service from the Court.  Rep clearly did not understand what that meant.  I try to explain.  Another four days go by, I receive a completely worthless form.  I have no sent them an example and am still waiting for a declaration."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William - William T. Baker bba",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T19:13:24.000Z",
          "Titre": "I've had a bad experience...",
          "Contenu": "I've had a bad experience that I'm sure you could learn a lot from and hopefully change your customer experiences."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C O",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T05:00:38.000Z",
          "Titre": "Paid Extra for a Rush, yet Nothing!",
          "Contenu": "I have paid extra for a rush service for process service, and right now its been over 3 days without the first attempt being made!  This is ridiculous!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Troy - Troy Wilkes",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T21:56:37.000Z",
          "Titre": "Double charged from r 2 day service and…",
          "Contenu": "Double charged from r 2 day service and server didn’t perform their duties and was fired. This jeopardizes my Answer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dukes",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T20:10:38.000Z",
          "Titre": "Other process servers deliver the proof…",
          "Contenu": "Other process servers deliver the proof of service to the local court house. There is no cost to file the documents. I instead I had to personally deliver the server’s document"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dawn",
          "Nb_Reviews": 2,
          "Date": "2023-07-22T21:02:23.000Z",
          "Titre": "It wasn’t served",
          "Contenu": "It wasn’t served.  The document required personal service and you taped it to the door.  The court will not accept that.  There was no service!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anton",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T02:08:09.000Z",
          "Titre": "This company claims to be able to serve…",
          "Contenu": "This company claims to be able to serve papers for a small claims lawsuit.  They tried to serve the city of Oakland, CA.  After four times, they still hadn't completed it.  If they can't understand how to serve a city, who can they serve?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca - Gerosabren Corp., In",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T23:35:32.000Z",
          "Titre": "Did not deliver within the 5 day…",
          "Contenu": "Did not deliver within the 5 day requirement & never filed proof of service with the court according to the judge"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MCK",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T20:22:29.000Z",
          "Titre": "They missed the service deadline",
          "Contenu": "They missed the service deadline, I advised them and had to pay another service for a rush, then ABC served the defendant and billed me for the untimely service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yesenia - Yesenia Villafana",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T21:19:07.000Z",
          "Titre": "Not knowledgeable",
          "Contenu": "There was too much back and forth. They were not knowledgeable. My service was considered untimely and my court date was moved. Only lucky that the judge did not request me to have it reserved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AZ P",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T20:13:45.000Z",
          "Titre": "Would not recommend",
          "Contenu": "Would not recommend. Service was slow, no effort showed, Would update only when I inquired. Waste of time and money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark - na markjmillerusa.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T04:28:12.000Z",
          "Titre": "Forgot to name person served",
          "Contenu": "Refused to refund me for filing fees"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacqueline",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T20:05:58.000Z",
          "Titre": "Only used once, but not a good experience.",
          "Contenu": "First time using this process server.  Unfortunately, not a positive experience.  They did not make the first service attempt with the agreed-upon time frame.  Their communications were incoherent.  They did not respond to requests for clarification."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "The Office",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T20:45:14.000Z",
          "Titre": "ITS AMAZING HOW YOU WORK FOR A COMPANY…",
          "Contenu": "ITS AMAZING HOW YOU WORK FOR A COMPANY SINCE 2016. AND THEY TREAT YOU LIKE YOU NO ONE JUST CANCEL YOUR CONTRACT AND NO WILL EVEN SPEAK WITH YOU."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tricia - Lanier Law Group, PA",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T15:54:50.000Z",
          "Titre": "Had to continue to contact you to get…",
          "Contenu": "Had to continue to contact you to get the process server to do their job, Extremely frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T01:16:45.000Z",
          "Titre": "I asked them to serve a small claims…",
          "Contenu": "I asked them to serve a small claims suit on 9/16.  Nothing ever happened.  I finally called them today to be told that they don't have  process server in the area.  Why did it take 3 weeks to hear this?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole - Wilson Sonsini",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T14:25:51.000Z",
          "Titre": "I have already written about this and I…",
          "Contenu": "I have already written about this and I won't spend one more minute of a waste of time and money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aiden",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T21:27:28.000Z",
          "Titre": "The lack of knowledge was pathetic",
          "Contenu": "The lack of knowledge was pathetic. They do not even know what is required to do complete service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Refund",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T20:08:44.000Z",
          "Titre": "You guys charged me twice on my debit…",
          "Contenu": "You guys charged me twice on my debit Card And promised to give me refund and it’s been three weeks no refund was made"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Suzanne - Wolf & Lee, LLP",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T21:25:49.000Z",
          "Titre": "Poor communication",
          "Contenu": "Poor communication.  Server didn't attempt service when requested.  Poor customer service.  Would not recommend using this company for your very important legal needs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brittany Green",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T18:55:50.000Z",
          "Titre": "I still haven't received a signed proof of service",
          "Contenu": "I have requested a signed proof of service multiple times in the past week and a half, and still have not received it. Instead of apologizing for the delay, they said that I should have shown them there was a proof of service to sign, but it is always standard for a Summons to have an attached proof of service which the process server signs. I would not use this company again after this experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Thomas, Attorney at Law",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T13:02:19.000Z",
          "Titre": "Inconsistent Stories and No Serves.",
          "Contenu": "Inconsistent Stories and No Serves.I was told by 3 different process servers that the party no longer lived at the address provided, as well as the second defendant was never present to serve, then the facility had a fence around it and they could not enter, which none of the above is correct. We contacted another process server who got them all 3 served the same day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allisa C",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T07:30:51.000Z",
          "Titre": "Respondent was never served",
          "Contenu": "Respondent was never served, The person serving the papers actually spoke to the respondent who pretended it wasn’t him. Paid $150 for two separate addresses (home and work) for them to tell me the day before court that the address is a bad address and they attempted twice at his work but wasn’t able to get pass security. Definitely wasted my money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Attorney's office",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T20:02:37.000Z",
          "Titre": "Worst process servers I have ever used",
          "Contenu": "Worst process servers I have ever used. If I could give them less than 1 star, I would.  They were given explicit instructions on service of this individual and didn't do anything I asked them to do. Everything was done incorrectly, unprofessionally, and service was blown, exposing the lawsuit to the defendant's family, thus making him even harder to find. DON'T hire them. They are truly awful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric - Malloy Law Offices, LLC",
          "Nb_Reviews": 1,
          "Date": "2021-07-28T14:27:53.000Z",
          "Titre": "No proof of service since 7/15 DOS",
          "Contenu": "Got notification that Defendant was served on 7/15. Requested proof of service on 7/20/21. As of 7/28/21 didn't receive copy of the endorsed affidavit. Nor it was filed with court. Will not be using ABC in future. They have great, easy to use portal and responsive intermediaries. But process servers can't do their job. This was the second and last time we used ABC Legal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christine Foster",
          "Nb_Reviews": 2,
          "Date": "2021-06-14T17:02:49.000Z",
          "Titre": "Employees they churn and burn",
          "Contenu": "All I see online is people who have used this company. I was a server for them and they worked me like a dog. My limit was 90 and I had 130 I asked to raise the limit to 100 but stick to it, they did not. I still have no reason why, but they finally \"fired\" me via email. NO reason, but I will also say I was in the 98% for the highest pipeline and I rarely fell out of the service window."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean - Maye Law Group LLC",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T21:43:53.000Z",
          "Titre": "I am VERY displeased with my…",
          "Contenu": "I am VERY displeased with my experience.  No follow through, I had to call every day to tell ABC what to do to get the job done, and it was an absolutely nightmare getting the results I paid for.  I ended up having to continue my client's case, which risked him losing an important issue, all because ABC's servers did not know what to do and kept making mistakes.  Absolutely terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MATTHEW - Calvi Law Group PC",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T18:16:47.000Z",
          "Titre": "WORST PROCESS SERVING FIRM AROUND",
          "Contenu": "You had an order for service for 3 weeks and when I called for an update was told “the process server has been on vacation”. That is ABSURD. Then you completed a service on July 2nd and as of yesterday July 19 a proof of service had still not been completed. I will NEVER use your service again. You are a disgrace to the legal community."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marianne Duhaterov",
          "Nb_Reviews": 2,
          "Date": "2021-05-26T14:18:14.000Z",
          "Titre": "ABC Legal - Do Not Recommend",
          "Contenu": "One star. Paid for the basic package, which promises about 7 attempts to serve in 7 days. After multiple calls and messages, I was finally able to get them to serve in about 2 weeks. After which it too the server another 3 weeks to send the proof of service. I am in week 7 and still waiting for the proof to be delivered. The case is closed on their end at this point. Horrible service, needless to say. I highly DO NOT recommend using them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Law Office of Joseph S. Shook",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T18:26:07.000Z",
          "Titre": "I don’t trust the affidavit",
          "Contenu": "I don’t trust the affidavitIt did not specify the attachment was servedTwitter stated no attachment was servedThen the affidavit was supposed to be updated to say attachment was filed But ABC had them as two separate documents and they were not.All one document was sent PDF to ABC, subpoena and attachmentSo it appears attachment may not been served because they appeared as two separate documents in ABCs  system according to agent from AB CNow I have unnecessary legal issue"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MountainGal",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T20:01:25.000Z",
          "Titre": "Unsuccessful Attempts",
          "Contenu": "The first service I sent was not even attempted for several days after receipt and the guy went to a business on a SUNDAY. Two of the other requests came back as bad addresses, despite the claim you all will verify addresses. I am not really impressed so far and unless we are serving in a state that you are the only option I am not sure I will continue to use ABC Legal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie Salera",
          "Nb_Reviews": 1,
          "Date": "2020-12-24T00:17:08.000Z",
          "Titre": "Completely terrible I gave them two…",
          "Contenu": "Completely terrible I gave them two chances I needed someone to be served in the pa area and twice they failed to notify me that they couldn’t do it they don’t have enough staff was their second reason I’m so annoyed the first time my court date was less then a week away and I had to contact them now it’s two weeks away and I can only hope I can get another company to do the job and my court date doesn’t get dismissed now!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Matthew",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T00:33:12.000Z",
          "Titre": "Had problem their not paying full…",
          "Contenu": "Had problem their not paying full eviction fee amount to Court. Aug 2020. I had to deliver $75.00 bal. myself to get case#. Tried again in Dec 2020 for another eviction and asked for help on how to prevent same thing again.   Refused to assist me and no take my calls. I called elawservices.com & they walked me thru procedure to file and only charged $6.50 for file fee. (10 times cheaper) than ABC legal services & without any problems."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "B, king Contra Costa County",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T21:29:29.000Z",
          "Titre": "awful",
          "Contenu": "awful  they couldn't follow directions and then they signed off the \"SERVED\" Order with the WRONG DESCRIPTION !!!they said it was a typo error,  But how do you say they served a 5'5 man?  When the person is OVER 6ft tall.They are the only game in town at that price!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristi - Clinton Investigation",
          "Nb_Reviews": 1,
          "Date": "2020-12-03T18:35:43.000Z",
          "Titre": "We hired your company for a process…",
          "Contenu": "We hired your company for a process service on 11/09/2020 and received an email on 11/11/2020 that the service had been perfected. We received the Affidavit of Service, which had an incorrect city. We requested a revision and was sent another Affidavit of Service with the same incorrect city. We have called multiple times, almost daily and still do not have the correct Affidavit of Service. It is now 12/03/2020! Ref#6847235. We will never use ABC Legal again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "V. - V. James Granito, Jr., P.",
          "Nb_Reviews": 1,
          "Date": "2021-03-17T13:16:51.000Z",
          "Titre": "We submitted a Summons and Complaint…",
          "Contenu": "We submitted a Summons and Complaint for service in a matrimonial action. The turnaround time was very quick but the process server elected to use sub-service which is ineffective service absent a court order. We are currently awaiting a response from ABC as to what corrective action they are prepared to take."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Law office",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T18:15:41.000Z",
          "Titre": "TERRIBLE!!!",
          "Contenu": "I will never use your services again. It was terrible. My client was served Twice instead of having her ex-husband being served. The server was careless and bad. You charge me extra to have the person served within 48 hours and you did not do so. I am very disappointed to say the least."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ms. Toni",
          "Nb_Reviews": 2,
          "Date": "2022-02-19T17:03:36.000Z",
          "Titre": "Worst experience ever",
          "Contenu": "One of ABC's process servers banged on my door and I opened it.  She asked if I was the person she had to serve and I said no one lives here by that name.  She proceeded to ask various questions about this person which I did not know answers to.  I am a single woman who lives alone.  I felt she was invasive and aggressive.  I closed my door telling her that I am no longer answering questions.  She returned to my door, banged on it, but I did not open the door again.  She yelled through the door that she was leaving the papers.  This lady reported that she had served papers, which she did not.  She reported false information.  Extremely poor and I feel unlawful service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Taylor English Duma LLP",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T16:58:36.000Z",
          "Titre": "We uploaded a Subpoena for personal…",
          "Contenu": "We uploaded a Subpoena for personal service on September 9, 2021. We did not hear anything from anyone regarding any attempts for personal service. We reached out on September 23, 2021 to check on the status since we did not hear anything from anyone. Our Subpoena was not assigned to a process server until September 24. The deponent was finally served on September 25. We received a bill stating 3 attempts had been made to serve the deponent which was not accurate. We have requested a revised bill to reflect the correct amount for payment and have yet to receive a response. Very poor customer service and response time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Natasha Hebert",
          "Nb_Reviews": 1,
          "Date": "2020-12-30T16:00:12.000Z",
          "Titre": "INCOMPETENT",
          "Contenu": "Needed to be served in a just built development. They could not bring up the address on whatever maps process they use. They call this an \"attempt\".  I sent them a Google maps map, a waze map and coordinace, they still could not find the address and refused to give a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M. Williams",
          "Nb_Reviews": 2,
          "Date": "2021-05-25T18:39:16.000Z",
          "Titre": "THEY DESERVE 0 STARS!",
          "Contenu": "I would give 0 stars if it were an option.  I do not appreciate having paid to have one person served only to have the process server, although equipped with a picture of that person, serve someone else who looks noting like the correct person and was much taller than him.  When I brought it to the attention of the company, I was blown off with a sort of \"oh well, we are sorry,\" type response.  Lesson learned though.  I won't be using them again.  Finally, it only shows how tone deaf this company is to have spammed my email with a request for a review.  You asked for it... you got it!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie Sinatra Foerster",
          "Nb_Reviews": 7,
          "Date": "2021-10-01T14:53:03.000Z",
          "Titre": "Terribe Service-do not hire",
          "Contenu": "I hired ABC legal on Sept 7 for a court hearing on September 30. The defendant was served on the 18th. I called and emailed many times as my court date approached as a notarized proof of service was required for the hearing. My case was postponed because ABC legal did not provide me the document in time. I lost time and pay from work and need to now do the same at a future date. I got nothing but an apology from ABC legal saying they will do it as soon as they could. I don't understand how it was not possible to fill out a simple form and notarize it within the allotted time, especially from a company who specializes in process serving."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna W.",
          "Nb_Reviews": 1,
          "Date": "2021-03-16T17:35:41.000Z",
          "Titre": "I had a subpar experience with this…",
          "Contenu": "I had a subpar experience with this company.  They bought out or merged with MLQ Attorney Services, a company I had worked with in the past, and had no problems.  This new company is based out of Oregon!  I will stick with a local process server the next time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Flynn",
          "Nb_Reviews": 2,
          "Date": "2022-03-17T17:35:55.000Z",
          "Titre": "Serving banks on weekends",
          "Contenu": "I have subpoenas for governmental agencies and banks.  Your idiot process server continues to try to serve them on WEEKENDS.  Several weeks later, surprise, the bank has not been served.  Inexcusible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debbie - Overcast Law",
          "Nb_Reviews": 1,
          "Date": "2020-09-09T21:46:11.000Z",
          "Titre": "Oklahoma Service",
          "Contenu": "I have used ABC Legal Services a number of times.  This was the worst.  After 7 full days of nothing being done I asked when service would be done and they apologized and contacted the process server.  Service was attempted but just said attempted.  I had included the vehicle the person was driving but it did not list if the vehicle was there so I had no way of knowing if the person was avoiding service or just not there.  I had to ask them to let me know that.  The contact for my issues was helpful.  It was a very lengthy process that I felt I had to track every minute."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael McGregor",
          "Nb_Reviews": 1,
          "Date": "2020-03-15T01:31:56.000Z",
          "Titre": "Extremely disappointing service",
          "Contenu": "Paid for rush delivery and first attempt was not made until a week later.  Was told that there was a mixup with the process server upon calling to see what was going on.  Delay caused the individual to get served late, the day before the court date.  Then the affidavit was not signed causing us to have to bring the unsigned one to the court which resulted in the judge throwing out the case and postponing it meaning a wasted trip for us to New York and another one to come.  The signed affidavit then showed up late that afternoon after the court case was over."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ani Lopez",
          "Nb_Reviews": 3,
          "Date": "2020-10-30T20:46:22.000Z",
          "Titre": "I have used your company on many…",
          "Contenu": "I have used your company on many occasions and on the last service request ABC Legal provided the WORST service ever for a simple service of process.  You can go see my comments on that service request.THE WORST SERVICE EVER!!1 FOR NO REASON WHATSOEVER!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NS",
          "Nb_Reviews": 3,
          "Date": "2021-10-05T18:46:23.000Z",
          "Titre": "I had two jobs for them in two…",
          "Contenu": "I had two jobs for them in two different cities in California.The so-called registered agent did not check the document for proper court clerk information. As the court clerk had forgotten to date the documents.After I called and informed them, they told me this is a new job! Which it should not be. Because this is why we use a registered processor. To check for accuracy not just to dump documents at a location.But then the guy I spoke to said that they will make it right.  But instead, they messed up the order. And used both jobs to serve 1 document to the same address. After I notified them, they served both documents to the same address! Frankly, They are still not getting it right. It is out of the ordinary how chaotic this simple request has become."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 3,
          "Date": "2020-04-01T18:49:55.000Z",
          "Titre": "4 full weeks and nothing",
          "Contenu": "4 full weeks, nothing. Says they turned it over to sheriffs dept and then said sheriffs office doesnt answer.  I paid THEM, not the sheriff. Contacted another process server who served IMMEDIATELY.Dont use these people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerome",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T18:11:57.000Z",
          "Titre": "Strange to receive a survey before order is complete",
          "Contenu": "Strange to receive a survey asking how well ABC Legal performed when the order is not complete. Furthermore, the order for service of process is taking forever to complete."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maria Washington",
          "Nb_Reviews": 6,
          "Date": "2023-12-18T03:12:25.000Z",
          "Titre": "Terrible Communication",
          "Contenu": "Not enough communication. Package was left with someone who does not legally live at the address. Person addressed in the legal document was not served. ABC Legal said all they had to do was give it to someone who resides there. No name, no signature, that person was just crashing at the house for a few weeks, not a co habitant."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ya",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T00:50:22.000Z",
          "Titre": "Unprofessional service and wrong form",
          "Contenu": "The server complete a wrong form after serving, the form is the the one for the county the court is in. I sent them the correct form to finish, but they ask me to finish myself and then send to the server to sign! This is quite unprofessional. If you made a mistake, you should be the one to correct this, but not let the customer clean your sh**t for you!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KMK",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:36:06.000Z",
          "Titre": "We had two summons that needed served…",
          "Contenu": "We had two summons that needed served at the same address.  One summons was served with no problem.  The second summons I was told \"no such address\" - even though the process server was just there a day prior and effectuated service.  They wanted me to pay another $200 for another attempt.  The communication from the team was fine, and I liked the ability to track the service online - however, we'll be switching up our process server in the future.  We're a newer firm and were hoping to find a company to use exclusively, but it won't be ABC."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "kim",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T17:05:53.000Z",
          "Titre": "Process server attempted to serve an…",
          "Contenu": "Process server attempted to serve an individual at a school on a Saturday when schools are clearly not open.  He also said he could not serve bc it was raining.  I was in the area on that date and it was not raining.  He then attempted to serve the same individual at the same school after school hours.  I called ABCLegal to report this as no one was responding on the customer portal.  I had to hold for 40 minutes before my call was taken."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Natalia",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T20:50:11.000Z",
          "Titre": "Slow Service",
          "Contenu": "Ordered service 8/14/2023. There were a couple of documents that were not uploaded correctly by me but I uploaded them the same day that the company contacted me. My papers were finally served on 8/29/2023. I still live with the party who was served so I came home to find that the papers were left on the front doorstep even though the party to be served was at work since early morning. I don’t think this is legal so I hope that this does not come back to bite me in court."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Travis - Blend Document Techno",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T15:04:29.000Z",
          "Titre": "Slow Service",
          "Contenu": "The time that elapsed between when I submitted the requests to ABC Legal, and when the requests were hand served, was far too long for what I needed accomplished. Two of the three requests have STILL after 7 days, NOT been served, and these were \"Rush\" requests as well."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A.A.",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T23:50:30.000Z",
          "Titre": "Customer Service great/Follow Thru Lousy",
          "Contenu": "CS great/Follow Thru Lousy - it's been almost a week and a half and I'm still waiting on my signed proof of service.  The Court's hearing date has already passed and I had to use the text chain of ABC trying to get ahold of their service processor as proof of service.  I appreciate the work they did but the follow through has been very disappointing.  I hope this process server gets a good talking to.  Customer service folks have been really nice and I appreciate their assistance."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "B Blinsmon",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T19:10:05.000Z",
          "Titre": "How much is charged for ABC Legal Services should be able to talk to someone PRIOR to placing an order!",
          "Contenu": "Wanted to deliver documents in person.  Address on website was false as the office had been moved.  Tried to call twice and after two 20-minute waits, got hung up on.  Went to the posted address.  Not there!  Called and operator said Tacoma does not take walk in clients and to place order online.  Document file was too big so had to break what was sent down and send rest in a message AFTER order was placed.  Got charged $300 which I felt was a ripoff!==============================Reply from ABC Legal Services\"Thank you for taking the time to share your experience with us. We regret any confusion with regards to our office locations and any issues that occurred during your document upload. Our team will investigate our office listings to ensure this does happen again.\"----------------------------------------------------------So they're saying the same thing will happen to others as it happened to me!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Law Office",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T01:03:15.000Z",
          "Titre": "As an attorney I would not use this…",
          "Contenu": "As an attorney I would not use this service again.  It took almost a month to get a respondent served on a petition, and took almost a week for the first attempt to even be made. That attempt was unsuccessful, and the reason given for incomplete service was the weather (it was raining). As an attorney who needs petitions served in a timely fashion, this is simply unacceptable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph - The Watts Law Firm",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T20:49:51.000Z",
          "Titre": "Communication through website is not good",
          "Contenu": "The communication through it's website is not good. You cannot respond to e-mails wherein ABC's staff is identifying a problem. Uploading documents is a problem. I had service in the same suit to two different parties, but the second matter was not served because ABC claimed I did not upload the document. This happened after I uploaded the document again. If it did not upload to the correct location, that is an organizational problem with ABC. Make your portal and communication user friendly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roya Hanna",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T16:23:04.000Z",
          "Titre": "Served the wrong person",
          "Contenu": "They sent someone out to serve the person within 3 days.  However, they served the wrong person and I have been communicating with them for about a week now and they will not tell me if they are going to serve the right person or just keep the money for serving the wrong person."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Janice - Farrar Bates Berexa",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T17:56:05.000Z",
          "Titre": "I was assured that the subpoena would be domesticated",
          "Contenu": "I was assured that the subpoena I had ABC Legal Services serve would be domesticated and it was not. We have now received an objection from the party because the subpoena was not domesticated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike - Mike  O'Neil tanonehotm",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T02:13:36.000Z",
          "Titre": "You should have  found the information…",
          "Contenu": "You should have  found the information about Holland America's Seattle office that is easily available on the internet and quickly served the papers instead of just going to the office and looking at it.  I can't believe I had to give you the phone number for the office before you finally called them and finally made arrangements to serve them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PMich",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T04:17:08.000Z",
          "Titre": "Customer Disservice Group",
          "Contenu": "The service of process was performed timely, but dealings with your customer service (or disservice) to get the proof of service has been horrible, to say the least!!! Such level of customer disservice is avoidable by having the process server file the proof of service with the court."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kori - TBLG",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T16:12:19.000Z",
          "Titre": "The site should be more transparent…",
          "Contenu": "The site should be more transparent about the actual time frames they are capable of delivering results. I have an issue with the site making you verify the service address on Google, pre-paying for service, to only find out days later that no process server is available for that service area. I don't like the fact that it takes days to verify a filing, with no contact in the interim, and if the county in question requires a special order from the Judge for a private process server then they should let you know upfront before you wait days- at the very least offer guidelines or an explanation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Clare - Law Office of Jacobie",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T00:55:02.000Z",
          "Titre": "Ignored",
          "Contenu": "Your service started out really great, but it turned south fairly quickly. One service was made and the turn around for the production of documents was fast. To no fault on your other server, service was not made. That’s okay. It was honestly expected for this individual to not accept service, however, I requested an affidavit of non-service to be generated. It was generated, but still has not been signed nor notarized. Due to a hard deadline with the court, I asked for the signed affidavit of non-service multiple times and I have been ignored. I still am being ignored as I followed up with you all this morning. I had to submit the unsigned affidavit with the court due to the deadline and it will most likely be rejected. Honestly, this is highly unprofessional and not worth the money that you all are charging for your services. Please follow through until the end. As legal professionals, our deadlines are make or break for our cases. Get it together.Update: To add more fuel to the fire, you guys still have not responded to my requests nor have you responded to email after you said you'd investigate this matter. Due to your negligence and non-responsiveness our office has missed a deadline for our client. Please refund me. You guys are horrible; our office will never use your services again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angel - Law Office of Angel Da",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T21:54:48.000Z",
          "Titre": "I don’t like that I spent extra money…",
          "Contenu": "I don’t like that I spent extra money for a rush service only to have my filing served four days later."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anthony - Anthony H",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T20:16:09.000Z",
          "Titre": "Just OK, you get what you pay for.",
          "Contenu": "I had to call on both of the service requests and make sure the right boxes were checked and that it was marked as substitute service. They had to fix both of them. This is your business not mine and I had to check on your process servers work. What if it was done wrong and ruined my case? You need to check your servers and check your work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tall girl",
          "Nb_Reviews": 5,
          "Date": "2023-06-03T04:42:07.000Z",
          "Titre": "The server attempted to serve the…",
          "Contenu": "The server attempted to serve the Secretary of the corporation (listed as the agent of record) at 9 pm. It was no surprise that no one was working then. The second attempt resulted in the server being told that service should be made at a different address. I asked that an investigation be made of this different address and it was determined that a professional service agent had an office at the different address and a similar sounding corporation had listed CSC … as its agent. I asked that the service agent at this new address be served. The attempt was made and I was told that no one of that name was at that address. When I inquired about the particulars of the service, I asked if the server asked at that address if John Hancock (the party) or if the agent (CSC) was at that address. I was told the server asked for John Hancock. I said go back to the address and ask for the agent (the service was accomplished at that point).  The service at the original address at a time when no one was working and the attempted service on the agent at the different address inquiring if the corporation and not the agent was at that address took about a month and a half."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alison - None gatorgirlyahoo.c",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T21:39:03.000Z",
          "Titre": "Had to serve twice",
          "Contenu": "Had to serve twice. When I inquired about time, no one answered truthfully. The mailed paperwork doesn't even have my name on it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pat - Law Offices",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T21:28:16.000Z",
          "Titre": "They did not do what we asked",
          "Contenu": "They did not do what we asked.  They were unable to serve a person at work.  Then asked to go @ 4 to his house and he was going to accept service.  They went at all times BUT 4, and then FINALLY got him served."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lisa - Williams McDaniel, PLLC",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T15:24:56.000Z",
          "Titre": "Service was fast BUT...",
          "Contenu": "Service was fast, but on Friday of this week, it will be two weeks since service and I have yet to receive my Affidavit of Service for filing with the court."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cameo - Brydon Swearengen & En",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T15:14:37.000Z",
          "Titre": "The process was very long",
          "Contenu": "The process was very long. And the attorney was not happy with your performance."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angela Kelly",
          "Nb_Reviews": 4,
          "Date": "2023-02-07T22:12:22.000Z",
          "Titre": "The person named was not the person…",
          "Contenu": "The person named was not the person served.  The person served was a minor and I don’t know if that is good enough in court"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chi",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T18:03:13.000Z",
          "Titre": "While filing and loading documents…",
          "Contenu": "While filing and loading documents seems to be smooth with a good interface for communication, the major issue seemed to be the process servers being very incompetent. I even began to think the defendant had collaborated with the server to truncate the whole process. From giving a completely wrong description of the defendant to the failure to upload the proof of service several days after service, it is just not something I would be able to comfortably recommend to others."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SNE",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T19:28:34.000Z",
          "Titre": "Miscommunication",
          "Contenu": "I requested that they put the same process server on two of the defendants in this case because they could serve two out of he three parties at the same time but they were sent out to two different process servers t so I incurred three more additional unwanted charges because once the first one got served the defendant ducked service for the registered agent one.Then I filed a completed action on one of these defendants once they sent me a Return of Non-Service and the next day they attempted to serve the same party again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chorlette Davis - Paralegal",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T17:16:56.000Z",
          "Titre": "The process server took our summons and…",
          "Contenu": "The process server took our summons and complaint to a business after 5pm.  There is a assumption that most businesses are closed after 5pm and cannot accept service.  An attempt was made the next day and we were sent a photo with instruction on what to do when waiting for a signature.  As the sign was clear in the photo, the process server did not follow directions causing our proof of service to be delayed in filing with the court and reach our office. As a result, the Defendants filed a Motion to Dismiss the claim.  I am very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TWise",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T20:18:51.000Z",
          "Titre": "Very bad service",
          "Contenu": "Took 2 weeks to serve a rush service order. First service went to a wrong address 3 miles away. I provided detailed time/day availability instructions & they were ignored. I expected more capable, faster, better service for this sensitive matter. Especially given their DOJ/DOS service claims. Very disappointed. I’ll never use them again & I don’t recommend them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Archie Durham",
          "Nb_Reviews": 1,
          "Date": "2021-03-17T00:51:47.000Z",
          "Titre": "Smells like Bait and Switch to me",
          "Contenu": "Your advertisement for service states a price of $60 for process service. There is no note that it is a \"First-time introductory offer\" or anything of that nature. When I approach your firm for repeat service, the price is raised to $135.00, not good. Smells like bait and switch to me. But that's fine, I found someone else."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AMY",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T19:13:34.000Z",
          "Titre": "Someone elses case was loaded into my…",
          "Contenu": "Someone elses case was loaded into my file.  This caused a delay in service, since the papers I needed served were not what was in my file. Due to the error everything was sent to the other claims state and address. The staff was friendly and quick to fix the error once i contacted them and informed them of what had happened on their end and forms were served."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shannon - Quick Law Group PLLC",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T16:50:20.000Z",
          "Titre": "No matter how simple the serve",
          "Contenu": "No matter how simple the serve, for some reason there is always an issue with ABC!  I forgot about this until I decided to try again and experienced the same lack of information, lack of response, lack of assistance, lack of contact, and nearly 2 week delay of service due to ABC's computer system placing a HOLD on my request.  Just awful.  This experience reminds me why I don't use ABC for even the most simple of process serves."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Albright - Albright & Jones",
          "Nb_Reviews": 1,
          "Date": "2020-03-20T15:15:58.000Z",
          "Titre": "I had a service that needed to be…",
          "Contenu": "I had a service that needed to be served by midnight on the 11th, however there was no attempt made and I paid $190 for rush service.  When I complained they sent the process servers out several more days after the date that needed to be served by even after I said do not attempt to serve since its too late.   Probably will not use service again.  Communication is not the best."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laurie - J Selmer Law",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T18:08:09.000Z",
          "Titre": "I suspect it is the process server and…",
          "Contenu": "I suspect it is the process server and not the company overall, but this was the slowest most inefficient process of service we have ever had, with no explanation for the slowness. We were not pleased."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J Doe",
          "Nb_Reviews": 2,
          "Date": "2021-01-26T20:15:44.000Z",
          "Titre": "Average",
          "Contenu": "Pro: Ease of placing an order and to communicate.Responsive staff.Con:VERY slow service from the time order is placed to the time one attempt is even made (10+ days...)Cost: charging for every little thing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christy - Gleam Law",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T18:33:54.000Z",
          "Titre": "We had asked that service be started on…",
          "Contenu": "We had asked that service be started on all three addresses we provided but ABC only attempted service at one address. We had to re-instruct ABC again today to attempt service on the other two addresses."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Clinton - Morgan Legal Group,",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T20:11:47.000Z",
          "Titre": "Lack of knowledge of basic service of…",
          "Contenu": "Lack of knowledge of basic service of process rules. I requested service of process to a Texas prison inmate. The process server assigned my case did not know how to serve an inmate."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TF",
          "Nb_Reviews": 6,
          "Date": "2020-07-22T14:36:27.000Z",
          "Titre": "Pay for RUSH service on a restraining…",
          "Contenu": "Pay for RUSH service on a restraining order.  IT DOESN'T GET FILED IN A TIMELY because you can't efile district court in King Co SO YOU MAILED the Declaration - Regular Mail. Find this out 3 days before hearing when I'm checking online & see it hasn't been filed. Nothing you can do about it? Also note that the address served is wrong. Yes, typo in the order. You DID serve the correct address. But the declaration has the WRONG address. You're supposed to put the address you served in the declartion. Ok, fix it, crap happens. Had to argue to get it corrected/refiled, transferred 4 times because nobody knows who handles that. And RESTRAINING ORDER hearing gets postponed because you're MAILING the corrected affidavit. But by God if that bill is a day late in getting paid there are emails everyday."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T19:02:31.000Z",
          "Titre": "Took so long to get any response from…",
          "Contenu": "Took so long to get any response from you about service attempts that I had already hired another process server to complete the job."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CQ",
          "Nb_Reviews": 2,
          "Date": "2022-08-30T22:14:06.000Z",
          "Titre": "Disappointing experience",
          "Contenu": "Disappointing experience. I've had better experience (and persistence) with the local Sheriff."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tawana - Reynolds Law Group, L",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T20:01:11.000Z",
          "Titre": "Turn around time is slow",
          "Contenu": "Turn around time is slow, not served by the date requested and proof of service still has not been provided 5 days after service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T19:08:07.000Z",
          "Titre": "Unhappy with the communication when it…",
          "Contenu": "Unhappy with the communication when it came to the inability to successfully serve"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T22:11:41.000Z",
          "Titre": "Poor communication"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Holly - Atlanta Law Firm",
          "Nb_Reviews": 1,
          "Date": "2021-01-28T18:08:18.000Z",
          "Titre": "Failed Rush Service",
          "Contenu": "I requested two Rush service of processes on a Friday, to be served over the weekend, within 48 hours.  One was completed on schedule. The other was not attempted because the server had \"technical issues\" printing the document to be served (1 page document). The server did not contact ABCLegal to remedy the issue.  I phoned ABCLegal, four days after requesting service, to check on the status. It was then that ABCLegal reached out to the server and remedied the issue and reduced charges to base charge.Additionally, when I attempted to contact ABCLegal in Atlanta, I heard music, then transferred to someone's email.  I have yet to be able to contact the Atlanta office, specifically in the a.m. When I called the long distance number on the website, I heard a recording stating that the office would not open until 8:30 a.m., in a different time zone that is three hours behind ours.  So I had to wait three hours to contact ABCLegal.  This was not acceptable, as my client requested the status of the two services.The first time I was able to get someone on the phone, in the different time zone, I gave her my information and we were working to resolve the issue, I was disconnected.  The service rep made no attempt to call me back.  So I again called for assistance, and connected to a different service rep. This service rep was knowledgeable and was able to give me details of the service that was not yet completed. While I was not satisfied at all with the process server's failure to serve and communicate with ABCLegal, I was happy with the second service rep who remedied the issue.  Lastly, ABCLegal was unable to provide me with a working direct number to their Atlanta office.WELL THERE SEEMS TO BE NO APPARENT WAY TO REPLY TO YOUR RESPONSE.  NO EMAIL OR PHONE NUMBER EITHER.  AND THE EMAIL ADDRESS THAT SENT YOUR RESPONSE IS A NO-REPLY EMAIL ADDRESS."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mmer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:37:42.000Z",
          "Titre": "Took a long time to get done.",
          "Contenu": "The delivery took a long time and the proof took a long time too. The proof signature looks like a scribble from a child. The website asked about my experience with the service before it was even completed. The price was really high for what it's worth."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerome A Myers",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T19:15:49.000Z",
          "Titre": "Unsure of additional requirements to secure collections!Does this case need to be domesticated…",
          "Contenu": "Does this case need to be domesticated and served with a lien on the properties for collection.If necessary, this is my desire. Please advise of applicable services on your end."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anna - Hutchinson Black and Co",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T17:00:56.000Z",
          "Titre": "Problems with Affidavit",
          "Contenu": "Not all of the documents served were listed on the affidavits provided. When I asked for them to be listed, the full set of documents (including the exhibits) were listed on one affidavit, but not on the other. The person I spoke with was very helpful, however, I am still frustrated with the issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sven Sittser",
          "Nb_Reviews": 3,
          "Date": "2023-10-01T04:58:47.000Z",
          "Titre": "Serving an old lady tenant who needs to move on",
          "Contenu": "I ordered the priority serve for a tenant. it did not happen in the following two business days. So I called ABC Legal and they refunded the priority fee. When the lady server finally showed up she was patient until I got the old lady tenant to the door. Her description I read later stated she looked 80 pounds heavy. I would put that more at 150 pounds and fat with gray hair."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kimberly - Stotler Hayes Group",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T18:25:15.000Z",
          "Titre": "They were prompt in getting a process…",
          "Contenu": "They were prompt in getting a process server out and I love the fact that I can see the progress. However, two of my four Affidavits of Service came back not notarized. I followed up a week ago and still have not received my notarized Affidavits."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T21:00:41.000Z",
          "Titre": "Fairly simple process with detailed information",
          "Contenu": "I like the process for signing up for a new account and submitting an order for service. I appreciate the detailed updates including time stamps and photos. I would appreciate more prompt customer service responses. I will also note to be cautious when \"updating\" an address as it was easy to accidently accept new charges. Otherwise, an overall decent experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vivianna Hernandez",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T20:37:15.000Z",
          "Titre": "I am still waiting for three out of…",
          "Contenu": "I am still waiting for three out of four serves to be served their summons. I understand it's the weekend and am hopeful that by next week all parties will be served. Other than that, the main company was served, which gives me a sense that they are aware of the complaint. I am very pleased how diligent Nikko is with his work. Thank you so much,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zach - Larson Griffee & Picket",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T18:32:30.000Z",
          "Titre": "I got what my client paid for.",
          "Contenu": "The website is useful, and they did what I needed.I got my affidavits fairly quickly and service occurred within a few days of my order.However, one of the process servers apparently attempted to deliver at the wrong address and sent me a rather snarky message about how I would have to pay him more to find the right one. I was not overly impressed with Kyle's professionalism."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "N/A",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T19:06:45.000Z",
          "Titre": "Rush Service",
          "Contenu": "The rush service took 3 days for the processor to make contact which I was hoping 24-48 hours. Overall, the dashboard is user friendly and provides detailed updates."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan - Bryan Cockel bcockelco",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T20:27:25.000Z",
          "Titre": "I did not receive expedited service.",
          "Contenu": "I paid for expedited process service. One attempt was made in 4 days, I called your support number and that server was replaced.  It took 5 days to serve the papers. Not what I'd call \"expedited\"."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Attorney",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T21:39:18.000Z",
          "Titre": "Lack of Communication, Documents not fully served",
          "Contenu": "Lack of communication. It is not easy to contact for support. Documents not all served as there is no communication within the messages section. Service is not attempted more than once... Still waiting on my documents to be served a week later.. I messaged him to continue attempts and still no replies.. It was not like this before."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Orlando Clarke",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T03:54:02.000Z",
          "Titre": "The service was done quicker than i was…",
          "Contenu": "The service was done quicker than i was told however , they should keep in mind most people dont go suing people everyday and should inform their customers after service its their responsibility to turn in the proof of service to the court house. Most lawyers dont take on small civil cases so we as nonlawyers do not know any better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Von",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T14:36:22.000Z",
          "Titre": "I was happy he was served",
          "Contenu": "I was happy he was served. After the server refused to return for a 3rd attempt, I had to tell them what time to meet him or his daughter. The over charge has decreased the score ad well. I was charged twice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Law Office",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T20:24:39.000Z",
          "Titre": "50/50 chance of things going right",
          "Contenu": "Sometimes things get served on time, sometimes it gets served to the wrong address or it gets served to the wrong city. Sometimes the court filings get to the court, sometimes the Judge asks you where the Judgment is, and ABC doesn't know what happened. It is VERY hit and miss whether it'll get there or not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "t.",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T21:35:34.000Z",
          "Titre": "Serve was relatively quick",
          "Contenu": "Serve was relatively quick, but I cant get a notarized proof of service for a while now, still trying..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Todd Nichols",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T20:18:47.000Z",
          "Titre": "I could have used some help locating a…",
          "Contenu": "I could have used some help locating a defendant is still not been served. You did a great job with the one you did serve."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward - Edward Molina-Lamas e",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T15:57:11.000Z",
          "Titre": "I did not like that there was a delay…",
          "Contenu": "I did not like that there was a delay in posting the \"proof of service\" for ref: 444, additionally I was disappointed with the weak identification process utilized to effect the service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HENRY S",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T23:15:48.000Z",
          "Titre": "took a little longer than I would have…",
          "Contenu": "took a little longer than I would have hoped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Natalie - Natalie Green, PC",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T00:00:32.000Z",
          "Titre": "We paid for expedited service",
          "Contenu": "We paid for expedited service. The documents were served expedited but it took several days to have our proof of service, which in some cases would have been fatal if we were up against a statute of limitations issue. I sent a message in the portal and they refunded the rush fee, but it was still a day or two later before I got my proof of service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JmorrisHLM",
          "Nb_Reviews": 2,
          "Date": "2021-12-21T19:11:17.000Z",
          "Titre": "We provided a photograph of the…",
          "Contenu": "We provided a photograph of the individual to be served. ABC Legal did not provide the process server with a photo for identification. We are now unable to verify \"who\" was served because the provided photo was not given to process server by ABC Legal. Service overall was an easy process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angela -",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T21:06:06.000Z",
          "Titre": "Service was quick but it was not…",
          "Contenu": "Service was quick but it was not notarized, per server it is not required but to be safe I think all of these should be notarized to be more efficient in sending these back. It took much longer and I received no response for days requesting it to be notarized. your services are of great value but you need to be prompt and efficient in your responses. Save us all some time and just make it a habit to notarize your signature as these are legal documents."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randall Blaylock",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T19:25:31.000Z",
          "Titre": "No problem with your efiling my small…",
          "Contenu": "No problem with your e-filing my small claims documents.  However, after I had the defendant served I contacted your company as to how I was to e-file the proof of service which I feel should be part of your service.  Unfortunately I still do not know how to accomplish this.  Any assistance you can provide would be greatly appreciated.  You have my email or you can contact me by phone at 720-254-4645."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T19:52:46.000Z",
          "Titre": "Paid for a rush",
          "Contenu": "Paid for a rush service - server did not get there on time, did not re-attempt a second service, ABC contact me notified the server had car problems. ABC did credit back the rush payment. They have a great online system however, due to their particular server this one was botched. Just my luck"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shoebooty",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T19:32:33.000Z",
          "Titre": "Confused with service but happy with outcome",
          "Contenu": "I put it at 3 stars because I feel like the 2nd charge for changing an address could be explained better. Although for new customers it’s $10 cheaper in NY versus an existing customer which I had to pay for. The back office customer service was super nice, I just don’t get why a change of address is an additional total charge of $85. Even though I could of changed my email and only paid $75 as a new customer. Either way, I feel like I should of only been charged once not twice because a server makes multiple attempts anyways, so why does it matter if it’s a different address.Other than that issue, they were awesome, informative, helpful, and got the job done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dana - Oles, Morrison",
          "Nb_Reviews": 1,
          "Date": "2020-08-19T16:32:44.000Z",
          "Titre": "I forwarded a process service request…",
          "Contenu": "I forwarded a process service request to ABC with instructions (per their website form) to serve within 5 days.  After 6 days I had to contact them, and they in turn had to contact the server.  Later that day I was notified that there was a bad address.  I forwarded a new address the next morning and the process was perfected that afternoon.  My issue is that it should have been taken care of within the 5 days.  I never should have had to follow-up with them to find out the status."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brittany - WAD",
          "Nb_Reviews": 1,
          "Date": "2020-08-21T01:17:38.000Z",
          "Titre": "We paid for 2 rushed subpoenas to be…",
          "Contenu": "We paid for 2 rushed subpoenas to be served. One of them was handled perfectly. The other, even though tomorrow will be 7 days from the order being placed, I have no update on and am not clear if it has even been served or not. I messaged for an update 2 days ago and have still not received a reply."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MEZ",
          "Nb_Reviews": 1,
          "Date": "2021-10-04T13:37:13.000Z",
          "Titre": "Not impressed",
          "Contenu": "I requested this service on 9/9/2021. Service was effected on 9/21/2021.  Though the service address was correct, the servicee was a lawyer and was ducking service.  However, I think that almost two weeks is an overly long time to wait for an affidavit to be served.  I had to send supporting documents, that anyone could have found on the internet, to help the service along.  I had to call numerous times for responses to my requests; communication was not very regular or consistent. I am happy that the service was finally effected, but I am not impressed by the management and administration regarding this request. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NM",
          "Nb_Reviews": 1,
          "Date": "2020-03-10T16:06:52.000Z",
          "Titre": "Bad experience",
          "Contenu": "Not a fan. Don’t like the independent contractor set up.  The company doesn’t have control over the process server’s schedule and delivery. This is important when you have time sensitive documents that need to be delivered. Update: I appreciate the response and will change the rating to reflect that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brenda - Berg McLaughlin & Nelson, Chtd.",
          "Nb_Reviews": 1,
          "Date": "2020-02-24T17:25:05.000Z",
          "Titre": "I love the convenience",
          "Contenu": "I love the convenience.  However, some follow thru is lacking.  I have had orders that were not presented to local server until 6 days after order was placed. I have had a husband and wife served which in general should not be considered two separate serves, one and a half perhaps but not 2x the cost, but then the server failed to subserve one of the parties which makes subsequent service very difficult as it is then expected. I've had it take the server 2 weeks to sign the proof of service.  All of these items should be addressed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jenna",
          "Nb_Reviews": 1,
          "Date": "2021-07-27T18:44:00.000Z",
          "Titre": "Not effective service on Corporations",
          "Contenu": "Quick but not effective service on corporations.  I keep getting letters after ABC said service was completed, which state service is not accepted by Agent for Service Company.   It would be nice if process servers knew the service laws re serving corporations/llcs/etc & ensured service was completed & effective - especially since you charge more than other service companies.  For ex: ABC server filed the POSS as substituted service on Secretary of State but the law in CA is an unregistered LLC’s agent for service is the CA Secretary of State (effective through personal service).  It would also be a useful feature if you could find the proper legal entity name of exact subsidiary & AFS."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Law Offices of Matthew C. Hine",
          "Nb_Reviews": 1,
          "Date": "2020-10-23T19:30:38.000Z",
          "Titre": "Good and Bad",
          "Contenu": "I love the interactive website and notifications.  But have only gotten successful service on businesses with a registered agent.  None of the individuals are getting served, which is problematic."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AZ",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T17:55:08.000Z",
          "Titre": "I used them many times!",
          "Contenu": "I used them many times!The service is quick and keeps you updated very well, especially if you are computer savvy. I love that and you get photos of attempts with GPS location. The only 2 hiccups I had was one time of service ABC Legal's server sat on my documents for a week before attempting service and the service was a simple affix and mail compared to once before other documents were served the very next day. Also, two times I needed service, the same server was used and that created problems because the person was dodging him because she recognized his face. When I asked ABC Legal to change servers I was told I have to pay a new server fee which sucked because there should be a shuffle. People don't want to be served so why send the same person to the same address to the same person obviously they would dodge the same server."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "S.C",
          "Nb_Reviews": 1,
          "Date": "2021-06-14T14:21:53.000Z",
          "Titre": "Service was time sensitive and needed…",
          "Contenu": "Service was time sensitive and needed to be rushed. Service was not completed until days after the request. Notice was posted on gate, not on door, as requested."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lindsay - Sound Legal Partners, PLLC",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T22:51:52.000Z",
          "Titre": "I find that the servers don't follow…",
          "Contenu": "I find that the servers don't follow instructions very often. I am constantly having to review and re-instruct to attempt service at different times."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael - Michael Bandler mich",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T03:19:28.000Z",
          "Titre": "No affidavit of service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T21:18:45.000Z",
          "Titre": "Timing…",
          "Contenu": "It seems as though they choose times to wait that are outside of business hours when we want to have a business served."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BARBARA - Terrier Claims Servi",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T19:23:45.000Z",
          "Titre": "Service is usually completed in a…",
          "Contenu": "Service is usually completed in a timely manner. Getting the affidavit of service is painful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Polly - Patel & Dalrymple, PLLC",
          "Nb_Reviews": 1,
          "Date": "2020-03-02T13:28:51.000Z",
          "Titre": "I haven't gotten information that it…",
          "Contenu": "I haven't gotten information that it was served, to who or posted and it was filed with the Court."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2021-09-29T17:17:35.000Z",
          "Titre": "Not impressed",
          "Contenu": "Not impressed with response to my issue, second issue was not responded to."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Uno",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T21:34:04.000Z",
          "Titre": "Painless ordering",
          "Contenu": "Painless ordering, received product quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina - Law office of Linda Str",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:08:52.000Z",
          "Titre": "Patrick in Customer Service is a Rock Star!",
          "Contenu": "Patrick in Customer Service was amazing. He made sure that service was completed as requested."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen - STEPHEN T. HIOKI, At",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T02:45:06.000Z",
          "Titre": "The service of my Petition was done expeditiously and professionally.",
          "Contenu": "The service of my Petition was done quickly.  I had difficulty getting a copy of the proof of service.  However, when I called ABC's customer service, the representative was courteous and helpful.  I got a copy of the proof of service within minutes.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sally - Holder Padgett Littlej",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T15:04:27.000Z",
          "Titre": "Great Job All Around",
          "Contenu": "Thank you for the quick turnaround on service.  Also, thank you for taking care of the issue with the proof of service notarization relatively quickly.  The only thing that could be improved is not having to ask for the proof of service to be notarized and it being complete the first time.  Great job all around resolving!  Thanks! :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anna - LT Family Law Legal Tec",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T21:20:57.000Z",
          "Titre": "Documents were successfully served",
          "Contenu": "Documents were successfully served. A hiccup at the early stages of services led the dashboard to show that documents had been dispatched to the server, but after waiting a week without an update, I contacted ABC to find the documents had not been dispatched. In the end, all worked out, but in the future, I will make contact sooner if the dashboard is not updated in a reasonable time frame."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa - Melissa Munoz PC",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T20:45:19.000Z",
          "Titre": "i had some last-minute trial subpoenas…",
          "Contenu": "i had some last-minute trial subpoenas to hostile witnesses. One was served without the $10.00 witness fee requred by Texas Law. Another had my own clerical error that rendered the subpoena defective. I recognize that rush service is not a good example of ABC's service. I look forward to using ABC next time. I like the online order process that made it easy to set up and track service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M.E.",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T18:02:50.000Z",
          "Titre": "Good service but took a little longer than expected",
          "Contenu": "When I spoke to an agent before hiring their services, the agent was very knowledgeable. After I retained their services, agents were quick to reply to my messages. I needed a specific Proof of Service for the documents that were served. I left them a message to please complete that form. After service, they took an extra week to complete that Proof of Service. Overall, very professional service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John P",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T19:15:50.000Z",
          "Titre": "Online ordering for the service was…very easy",
          "Contenu": "Online ordering for the service was fast and easy. The price was also good for the service. The server went out on the second day but missed the target. The only concern I had was the delay to follow up on the weekend and it was a number of days before the next attempt. Service was done properly and the paperwork received quickly.  I will be using this service again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie - Dan Vaughn Law",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T16:19:28.000Z",
          "Titre": "Easy service, delayed serving documents",
          "Contenu": "Overall good experience, however, they started the service on day 6 and 7, I had to send a message asking what the status was, and then they started the service process.  I'd expect ABC Legal to stick to the service schedule stated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T01:40:52.000Z",
          "Titre": "The first processor received the…",
          "Contenu": "The first processor received the documents but never made an attempt to serve. After about a week I contacted them by a private message and they got back to me the next day and rectified the situation within 1-2 days. Initial experience was not good but after they rectified the situation it was taken care of quickly and seamlessly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathleen Morre",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T18:39:57.000Z",
          "Titre": "Good proof of service",
          "Contenu": "Good proof of service.  Phone customer service person easy to speak to.  Setting up the order for service not complicated.  Wish they had an option to pay a fee for a mailed hard copy of the service besides digital service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LARRY",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T19:21:39.000Z",
          "Titre": "Insufficient Communication",
          "Contenu": "The service on one party was done quickly and the communication between ABC Legal and I was great.  The service on the second party was not done in a manner appropriate for the circumstance.  I was informed that there is a camera at the residence and the server believed that the party was avoiding service by utilizing the camera.  I asked that a different process server be utilized so the second party would not be aware of the server.  I was told that that could be arranged.  However, the same server is being utilized and no progress is being made."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sean - Prospection Legal Group",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T20:15:08.000Z",
          "Titre": "I was not informed that a new address…",
          "Contenu": "I was not informed that a new address would cost an additional fee. Its no problem but would like to be warned that adding a new address would give rise to a new charge. Unless I overlooked that!!! Very good service though and thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jamie - Keiter Law, P.C.",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T17:48:58.000Z",
          "Titre": "Prompt service",
          "Contenu": "Prompt service. The ease of the online ordering system. Progress updates throughout the process via electronic text and email which provided clarity."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sheli - Woods, Brangwin & Brat",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T18:19:31.000Z",
          "Titre": "This was my first time using the online…",
          "Contenu": "This was my first time using the online scheduling, so it was a learning curve for me. but ultimately the service was performed successfully and the staff helped me through the online part."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JLA",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T23:47:25.000Z",
          "Titre": "Persistence and they achieved service",
          "Contenu": "Persistence and they achieved service.  Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Megan",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T21:29:24.000Z",
          "Titre": "Creating an account and placing an…",
          "Contenu": "Creating an account and placing an order is very fast and easy.  The online platform is easy to navigate and I love that I can get updates as they are uploaded to my dashboard. However, I have run into issues that delay the time sensitive task of civil process.  * My questions are not answered in a timely fashion.* I have had multiple orders either delayed or required to be canceled because they do not have servers to cover the requested area needing service and this does not get brought to my attention when placing my order which delays the process and sometimes results in me spending extra time requesting alias summonses and orders for a different process server or sheriff."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raymond Torres",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T00:16:00.000Z",
          "Titre": "I expect the process server not just…",
          "Contenu": "I expect the process server not just serve the document but make sure that that the delivery of the service is correct.   I do make mistake and in the several projects that I submitted, if they verified my service, then it would not have cost me more money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lillian - Bagby Law",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T15:54:44.000Z",
          "Titre": "Timely and Helpful",
          "Contenu": "Service was timely. We had to find another address for service and ABC was helpful in assisting with new address."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miriam - Jonisa Enterprises",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T21:31:08.000Z",
          "Titre": "ABC Legal performed to my expectations",
          "Contenu": "ABC Legal performed to my expectations.  Their online platform makes super efficient to send & retrieve documents, communicate with staff, etc.  The server was diligent in serving the subject in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jillian",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T15:20:01.980Z",
          "Titre": "everything was great",
          "Contenu": "everything was great, the only thing i would have liked would be a little bit more communication regarding my job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William - William Burns Attorn",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T20:37:43.000Z",
          "Titre": "I was able to send documents easily on…",
          "Contenu": "I was able to send documents easily on the website and everything went smoothly and when I added a document to the paperwork I was able to easily do so."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T06:25:14.000Z",
          "Titre": "Fast service",
          "Contenu": "Defendant was served immediately after I provided a second address and I was given a discount on the second service after calling in a couple times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DSH Law Office",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T19:39:40.000Z",
          "Titre": "Complicated service needed",
          "Contenu": "We requested that ABC serve both summons and complaints at one of the defendants' addresses only; however, both defendants were put into the system as separate services.  In speaking with ABC Legal, since I cannot speak with someone on the phone, it can be a challenge to be able to effectively communicate our service needs, as sometimes we have defendants who office in the same location, but with one having a different registered address.  I cannot figure out how to go back and review my initial notes when entering a service request; and, I would love to be able to talk to someone by phone when there's a complicated service needed.  ABC Legal Services has been absolutely great with all our other services to date, and we will continue to use them, but may need to look elsewhere for the complicated services."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin B",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T20:47:20.000Z",
          "Titre": "Friendly and helpful staff",
          "Contenu": "Friendly and helpful staff allowed me to get a much needed summons served right on time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T22:19:21.000Z",
          "Titre": "Initial process server was not diligent…",
          "Contenu": "Initial process server was not diligent in getting it served. Second process server received documents and served within 24 hours. Fantastic."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ozan Kiratli",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T17:48:21.000Z",
          "Titre": "Efficient but not painless",
          "Contenu": "Our experience with ABC Legal overall was OK but not completely painless. If we were to serve someone else, we would still use them without a doubt. This was the first time we were serving someone and using ABC Legal. That's why I decided to write a detailed review, which might help others especially regular people. 1) Website and the online system is fantastic. The website is functional and responsive, which makes all the difference. It allowed us to see the progress (and lack of it at times which allowed us to identify and resolve problems). You can contact customer support from the website and they reply very quickly. 2) Timeliness: This item is a mixed bag. We submitted our documents and after 2 days all activity stopped on our case. After a week of no activity, we contacted them on the website, and hearing nothing for sometime we called them to see what was happening with our case. They immediately identified the problem, and upgraded our service to speed things up. The service was completed the next day. The case was closed 10 days after the service was completed. However, at that time we had not received the original copy of the service affidavit. When we contacted the customer support from the website, we were told to wait 10 more days and it would arrive, however, it did not. After these 10 days (20 days after the service was completed and 5 days prior to the hearing), we contacted the customer support again to find a solution for this issue. After going back and forth several times (this was painful on our end), ABC Legal was able to get the process server to prepare and send us another affidavit, which was to be delivered only 1 day before the hearing. This caused a lot of stress on our end. However, it was successful. So overall score for the timeliness is poor but can be improved.3) Problem solving: Excellent. Every time we contacted ABC Legal, we talked to people who are problem solvers. They are doing their best to help their customers. 4) ABC Legal Team: Fantastic. Such an amazing team of people working there. They have the kindest and the most professional people in their team. 5) Value for the money: Given everything, it is good. Feedback for ABC Legal: Closing the case after the customer confirms the receipt of the affidavit of service (or attempt) would be a better practice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joanna - US DOL OSHA",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T17:31:11.000Z",
          "Titre": "my only complaint is that i still dont…",
          "Contenu": "my only complaint is that i still dont have \"proof\" of service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 4,
          "Date": "2022-07-05T21:16:58.000Z",
          "Titre": "Successfully served the papers on the…",
          "Contenu": "Successfully served the papers on the first try! Well done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William - LO of WRM",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T21:26:21.000Z",
          "Titre": "now quit asking for reviews over & over…",
          "Contenu": "now quit asking for reviews over & over again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "stephen - stephen georges sgeo",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T16:28:47.000Z",
          "Titre": "Need to have summons served more quickly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristi VonDeylen",
          "Nb_Reviews": 2,
          "Date": "2021-07-20T18:32:54.000Z",
          "Titre": "I would use ABC again!",
          "Contenu": "ABC was quick and efficient with the process of service. They were very good at tracking the status and communicating with me.I only marked them down because their prices were high, although they did match a cheaper rate on the 2nd address attempt. There was also a glitch where I was getting an error when trying to download the proof of service and they had to e-mail me a PDF copy for my records.I would use them again for sure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C. Kelly Law, LLC.",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T20:16:27.000Z",
          "Titre": "Fast and Simple Order Process / Prompt Response Time",
          "Contenu": "I love how fast and simple the order process was. Response time via chat was very prompt and timely. Service was not perfected the first time, but it was quickly resolved with the correct, previously agreed upon process server being sent out to re-serve. We will definitely use ABC Legal again for service needed outside the state of Georgia!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 3,
          "Date": "2020-03-18T15:20:52.000Z",
          "Titre": "I used ABClegal for the first time this…",
          "Contenu": "I used ABClegal for the first time this year.  I got great service on my Tinley Park case.  They made multiple trips to get the papers served.  I was impressed. I will use them again.On my case in Texas,  the only address I had was a mail drop location.  There was no additional service available to find this individual for serving the legal notices.  Other servers offer that extra service.   Reporting was fast.  Mixed bag"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2021-01-05T19:19:48.000Z",
          "Titre": "First time working with them",
          "Contenu": "First time working with them. I would say there was a bit of reminders and detailed explanations but communication was awesome and response time was fast and efficient. Also a small issue with invoices and that was dealt with quickly and resolved.Very happy at the overall service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenny Blackwell",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T22:51:32.000Z",
          "Titre": "The one problem I have is they…",
          "Contenu": "The one problem I have is they didn’t finish  what they were paid to do. After my document was served they failed to file.  All that was required was to mail it to the court  in which they had the address. They gave it to me for me to do. I won’t use them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Seth",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T13:46:11.000Z",
          "Titre": "Good Service",
          "Contenu": "The online platform was extremely easy to use. Team members quickly responded to questions or comments and kept us updated with their progress in effecting service. When we discovered some errors on the returns of service, they were quick to correct and return the documents for us."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric - Eric Allen allenewhotma",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T19:45:55.000Z",
          "Titre": "Service provided"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen - Kraeber Law Office",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T20:15:18.000Z",
          "Titre": "Service was successful and pretty…",
          "Contenu": "Service was successful and pretty quick, only issue was that the proof of service did not list all of the served documents (there were several) but they quickly fixed that when I emailed them.  Thanks ABC Legal Services, we will use you again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald - Gregg & Associates, L",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T19:47:40.000Z",
          "Titre": "PRESIDENT",
          "Contenu": "GREAT FOLLOWUP"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andreea B.",
          "Nb_Reviews": 2,
          "Date": "2020-01-24T18:57:17.000Z",
          "Titre": "Overall a smooth and pleasant experience",
          "Contenu": "Overall had a great experience with the interface and communication went well, except for the fact that service was performed long past the date that it was listed due. The issue was quickly resolved with a call, though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "THE LAW OFFICE OF KENNISHA DABNEY NORMAN",
          "Nb_Reviews": 2,
          "Date": "2020-08-08T00:42:15.000Z",
          "Titre": "So far so good!",
          "Contenu": "I have been using your services for approximately 2 years now and you have not failed me yet.  The only issue I have is the time it takes for service on some cases; otherwise, your process servers do a great job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff - Wolford & Robinson",
          "Nb_Reviews": 1,
          "Date": "2020-02-03T15:56:23.000Z",
          "Titre": "The only real issue I have had is being…",
          "Contenu": "The only real issue I have had is being able to reach someone by phone when there is a question.  However, by and large we are very happy with the performance thus far.  Thanks for your partnership."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan LRGR",
          "Nb_Reviews": 1,
          "Date": "2020-10-23T19:47:39.000Z",
          "Titre": "They're very good at what they do",
          "Contenu": "They're very good at what they do, but sometimes there are delays that are considerable. And we don't always get filed documents back quickly, have to dig for them on their website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiera - Gingery Hammer and Sch",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T19:58:42.000Z",
          "Titre": "Communication while proceeding with the…",
          "Contenu": "Communication while proceeding with the request was great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Campbell",
          "Nb_Reviews": 2,
          "Date": "2020-01-14T20:21:05.000Z",
          "Titre": "I would have given 5 stars but ...",
          "Contenu": "I would have given 5 stars but when I include a request on the messenger slip for a call back to me when the delivery or filing has been done, I usually don't receive the call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Ault",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T18:41:03.000Z",
          "Titre": "It was very difficult to gain access to…",
          "Contenu": "It was very difficult to gain access to their offices to deliver the forms and pay for the service. Once that was resolved the process was excellent"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arminda - Tehama County Counse",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T16:03:28.000Z",
          "Titre": "Service",
          "Contenu": "Overall, the service is good. You have to provide specific instructions and detailed information to get what you need accomplished. Response to messages are prompt."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "alan - alan Birnbaum reagentin",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T19:59:56.000Z",
          "Titre": "Very effienct"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tami - Davis Rothwell Earle & Xochichua PC",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T22:48:03.000Z",
          "Titre": "Easy to contact (love being able to…",
          "Contenu": "Easy to contact (love being able to email!) and they get things done.  I only gave 4 stars because you don't repeat service attempts frequently enough."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KIMBERLY D",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T18:26:56.000Z",
          "Titre": "Other than having the wrong court in…",
          "Contenu": "Other than having the wrong court in the proof documents, you did great- everything was timely.  Will continue to use you.   Kim D"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BEK",
          "Nb_Reviews": 1,
          "Date": "2020-11-03T16:13:30.000Z",
          "Titre": "Little disappointed",
          "Contenu": "I was a little disappointed they did not follow directions left for them at the service location regarding who to serve during Covid shutdown."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew - Law office of Andrew L. Hoffman, PC",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T15:39:12.000Z",
          "Titre": "We had a couple of miscues at first",
          "Contenu": "We had a couple of miscues at first, and I wish the server had been more proactive in straightening those out--but it came together in the end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TGB office",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T22:44:11.000Z",
          "Titre": "We have used them twice",
          "Contenu": "We have used them twice; both times the serves were done incredibly fast but also both times the wrong proof of service was used."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DEB",
          "Nb_Reviews": 1,
          "Date": "2020-01-27T16:12:22.000Z",
          "Titre": "A little more money than having the…",
          "Contenu": "A little more money than having the sheriff or our employees deliver, but it seems you have more patience and time to get the job done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dannie - API Chaya",
          "Nb_Reviews": 1,
          "Date": "2020-07-29T17:15:38.000Z",
          "Titre": "Vincent was amazing and made…",
          "Contenu": "Vincent was amazing and made corrections for me immediately. The whole team was very accommodating and I appreciated all their help!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffry - VP, SEMCO Legal Dept.",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T18:49:29.000Z",
          "Titre": "Great Service",
          "Contenu": "Great Service! My Office was able to initiate prompt service on the Defendant without having to track him down ourselves."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2020-02-28T19:09:31.000Z",
          "Titre": "Thank you for getting the job done…",
          "Contenu": "Thank you for getting the job done without any extra fees! Here's hoping you will keep up the good work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2022-03-01T19:14:42.000Z",
          "Titre": "Difficult to communicate since they are…",
          "Contenu": "Difficult to communicate since they are on the west coast, and I am on the east coast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Catrina - ZIMMERMAN & KAHANOWI",
          "Nb_Reviews": 1,
          "Date": "2020-11-13T16:30:59.000Z",
          "Titre": "Just starting to use ABC Legal Services…",
          "Contenu": "Just starting to use ABC Legal Services and so far so good!! Thanks for all the help along the way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica - Jacobsen Orr Law Fir",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T19:22:36.000Z",
          "Titre": "Good place to work with",
          "Contenu": "Good communication and easy to use system. They got our job done within a week!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael - Law Office Of Michael E Mec",
          "Nb_Reviews": 1,
          "Date": "2020-03-20T17:02:19.000Z",
          "Titre": "The wrong court was on the proof of…",
          "Contenu": "The wrong court was on the proof of service.  But I have been promised immediate correction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra - Gay, Sandra B",
          "Nb_Reviews": 1,
          "Date": "2020-01-27T15:21:48.000Z",
          "Titre": "Slight delay due to messengers illness…",
          "Contenu": "Slight delay due to messengers illness but otherwise good service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Fedoronko",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T21:52:23.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, as advertised.  Professional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joni - Beaty Hatch PC",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T15:56:26.000Z",
          "Titre": "ABC does great work",
          "Contenu": "ABC does great work, however, it is very expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sean - Sean Springer saenyoutl",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T00:44:59.000Z",
          "Titre": "Prompt action and communication."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nichols - Nichols",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T21:10:36.000Z",
          "Titre": "The experience was adequate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allan - Allan Lee",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T20:45:24.000Z",
          "Titre": "Satisfied customer",
          "Contenu": "Service worked as advertised"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew - Setterquist Law Firm",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T21:30:33.000Z",
          "Titre": "Great job!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben - Pratt Aycock LTD",
          "Nb_Reviews": 1,
          "Date": "2020-07-04T16:52:08.000Z",
          "Titre": "Very good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gilly",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:13:27.000Z",
          "Titre": "Well..",
          "Contenu": "Well... okay... first time trying to serve, the person sat in their car and honked the horn.  They were successful the second time.  I do have to fault ABC Legal office, however, since our attorney subsequently advised the form (which supposedly is valid in AZ) is not the right one.  Guess your \"legal\" only extends as far as the actual process service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Coweta Loosa",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T21:05:31.000Z",
          "Titre": "I was very happy with the service",
          "Contenu": "I was very happy with the pricing, the communications kept me in the loop so that I was able to give my client status updates, service was made quickly as promised.  The website is very professionally done, and easy to navigate.  I have no complaints and am very satisfied with the service and overall."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:46:55.000Z",
          "Titre": "Easy and fast service!",
          "Contenu": "ABC Legal made it incredible easy to serve in this case! Simply upload the documents and information to the portal and they take care of everything else. I was provided constant email updates and was able to track everything on the website. Service was achieved in less than 48 hours of submission on a standard request and the proof was filed with the court for me. I’ll definitely be using ABC Legal in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommie - Tommie Lee  Lemons to",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:29:29.000Z",
          "Titre": "I got the legal assistance needed",
          "Contenu": "I got the legal assistance needed! great price, timely manner, professional processing..I will use this service again! A legal arm to my personal and professional affairs. TL"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T23:23:00.000Z",
          "Titre": "First time user... not disappointed.",
          "Contenu": "I held off until I received the proof of service on the first time I used your company.I now have it and am delighted by the professionalism and ease to use your services.Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alyssa",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:47:23.000Z",
          "Titre": "SPEEDY Return of Service!",
          "Contenu": "Fast and easy to request Service Processor and SPEEDY Return of Service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan - Susan Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T16:02:56.000Z",
          "Titre": "Speedy execution of papers",
          "Contenu": "The day before Thanksgiving I submitted forms to serve divorce papers to an uncooperative person, and ABC Legal got the job done the day after Thanksgiving.. super impressive! Hopefully I will never need this type of service again, but if I do they will be the first company I call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy - Jones, Cobb, Wadsworth &",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:23:11.000Z",
          "Titre": "Very quick & easy process",
          "Contenu": "Very quick & easy process!  They sent updates and kept us in the loop the entire time from receiving the initial documents to perfecting service.  Would definitely recommend and use anytime going forward!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cuong - CUONG TRAN cutranoutlo",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T11:25:21.000Z",
          "Titre": "If you would like to know how many I…",
          "Contenu": "If you would like to know how many I rated, not by how many STAR x5s because you already surpassed them since your work was so speedy and positive, I need a TEN to fit with your service. Than you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maureen - Maureen  Berry  maur",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T04:51:42.000Z",
          "Titre": "I had an excellent experience with ABC…",
          "Contenu": "I had an excellent experience with ABC legal services. I did the online service and my person was served papers within days. Then they finished the court process by filing the papers with the court. They did an excellent job for me. I will use them again in the future if I need to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:58:29.000Z",
          "Titre": "Service",
          "Contenu": "The service was immediate.  The communication was clear.  I will be using them in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelli - Lesley T. Abbott PA",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:29:18.000Z",
          "Titre": "Prestine service!",
          "Contenu": "We received your name from a local process server and although we put the service requests through as standard, they were taken care of immediately.  In addition, they were outside of our county service requests and the fees are very reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cassidy - LMBH Legal Services,",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:41:22.000Z",
          "Titre": "ABC Legal Services was fast and professional",
          "Contenu": "ABC Legal Services was fast, their online access allowed me to track the service attempts and their pricing was more than fair.  Highly recommend and will be using them in the future for our civil process service needs."
        },
        {
          "Note": 5,
          "Lieu": "TC",
          "Pseudo": "Dany - Dany Benjamin danybenja",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T03:11:40.000Z",
          "Titre": "This website came up first on my search…",
          "Contenu": "This website came up first on my search engine. And honestly the best decision I made by choosing ABC Legal Service! I was being updated on all service attempts and a sworn Affidavit was signed which was perfect and was able yo present it on time for my case. I would most definitely recommend using them and I will be using them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark - Mark Aulaumea markaulau",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:29:07.000Z",
          "Titre": "Made my orders very easy and…",
          "Contenu": "Made my orders very easy and understandable. Communication was great and timely matter"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dona - Morrissey Law Firm",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:12:02.000Z",
          "Titre": "Our request was a difficult serve",
          "Contenu": "Our request was a difficult serve.  Within only a few days, the server was able to successfully deliver the Summons on a Saturday."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eugene - Law Office of Eugene",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:28:02.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service, excellent response time! I’m going to use them for all my POS needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renee - Armstrong Berry & Lamp",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T14:41:22.000Z",
          "Titre": "Fast, Effective…",
          "Contenu": "I was pleased with the very fast service for a defendant whose address was unsure"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cherise Jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:36:01.000Z",
          "Titre": "Great service …",
          "Contenu": "Best price and they offer more attempts then other businesses.  Got the job done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina - Langlade County Distric",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:53:29.000Z",
          "Titre": "easy to use on-line services",
          "Contenu": "easy to use on-line services.  Process Service was done in a timely manner. Great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cici - Samuels Yoelin Kantor L",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:39:04.000Z",
          "Titre": "Fast Service.",
          "Contenu": "Fast Service.My firm needed a process server and the website was easy to use to upload documents, and getting status updates."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan - Tyree, Embree & Associ",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T15:29:54.000Z",
          "Titre": "Great Process Server",
          "Contenu": "ABC Legal made serving an individual out-of-state a seamless, easy transaction.  From the ability to upload all documents to be served to the notifications throughout the process, everything was informative and organized. Service was prompt and the affidavit of service was provided same day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judith - Judith Montes De Oca",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:49:13.000Z",
          "Titre": "Efficiente service",
          "Contenu": "easy to contact, fast response and very efficient service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny T.",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T20:40:19.000Z",
          "Titre": "Fast, easy, complete!",
          "Contenu": "Service was fast and easy. Very grateful for a simple process and efficient follow-through!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna D",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:13:18.000Z",
          "Titre": "More affordable and reasonable pricing…",
          "Contenu": "More affordable and reasonable pricing compared to others.  Also more attempts on service (6) compared to others (3). Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mayombo - Mbanza Law",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T06:19:53.000Z",
          "Titre": "Fast and furious-",
          "Contenu": "Fast and furious-ABC Legal Services served and followed up with me. Easy to reach and talk toTransparent in business practice Straight forward people Thanks to Attorney Jacobie K. Whitley, PLLC., for referring me..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marlene - Marlene Gomez-Diaz m",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T03:23:38.000Z",
          "Titre": "Thank you so much!!!!!",
          "Contenu": "Thank you so much!!!!!! I had to serve my ex husband in another state, for child support the process was so easy! I thought I had to drive to that state but no everything was handled quickly by paying a fee online. What amazed me was that the company updated you on which step they are in, and what to expect in a few days! You can also add your email or go to your log in and see the process. You guys are amazing! The communication and quick service was so professional from day one!I will recommend to anybody! Will use again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L.E.",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T23:48:03.000Z",
          "Titre": "OUTSTANDING SERVICE!",
          "Contenu": "This company is dedicated to its customers!I needed urgent service that was near impossible.  I thought that it was not going to happen, but then Stacy entered the picture.  She went out of her way to handle the logistics so that what I thought could not be done, got done.  Aside from that, she remained positive and professional in a demanding situation.I am very grateful for the exceptional service and would not hesitate to use this company again.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna schasker",
          "Nb_Reviews": 2,
          "Date": "2023-10-14T22:05:49.000Z",
          "Titre": "Wow the Service !",
          "Contenu": "Well first it is very simple , convenient , fast and effective too I’ve got my papers served  and pictures too. And not to mention the server was able to confirm that the defendant did live at the address.. what more can a person ask for .. I know that my money , and the issues that are important to me are handles with respect and care. Definitely will recommend your company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven - CalTax Accountants &",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T00:00:05.000Z",
          "Titre": "Services performed timely",
          "Contenu": "Was very concerned because services were required out of state where case is to be heard. Called and person who answered phone was honest and gave me the answers I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Moni M. from Florida",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T20:22:25.000Z",
          "Titre": "Served my defendant in my small claims…",
          "Contenu": "Served my defendant in my small claims case within 10 days.  I had to hire an outside service (this company) since the people at Squabbles couldn’t get my defendant served the first time out, resulting in me having to waste more money and time refiling the case.  I wish I would have known: (1) how useless Squabbles is when it comes to having a defendant served, and (2) about this service and how effective and reliable they are at making sure people are served in a timely and efficient manner.  I’ll definitely be using this company again when needed in the future!  Highly recommended!!"
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Ian Mutiso, Advocate/FQL/FLC",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T07:03:45.000Z",
          "Titre": "Wonderful service.",
          "Contenu": "As a foreign qualified lawyer at IM Mutiso & Co Advocates, we needed an effective process server who is located in California and can also provide other additional services from contact tracing to personal service. I was pleased to use them to serve a corporate based in California and we are very pleased with the outcome. I would recommend them.If you have any doubt on them, I put my reputation on the line. Ian Mutiso, Managing Partner at IM Mutiso & Co Advocates. F.Q.L England and Wales, F.L.C (State Bar of California) Advocate of the High Court of Kenya."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "pablo - pablo arthurrodger pab",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T10:05:40.000Z",
          "Titre": "Excelent Work!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa M. Hutchin",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T21:13:08.000Z",
          "Titre": "The BEST and EASIEST",
          "Contenu": "I wish I had used ABC Legal from the get-go. I paid a lot of money for the Sheriff's Dept to serve the defendant and they served him alright, but never notified me or the court. I had to refile the case all over again. ABC was extremely easy to use and kept me notified of their progress. I can't thank them enough for taking care of a matter that I couldn't handle, especially as I am dealing with a matter that is 1200 miles away. Would HIGHLY recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer - Garau Germano, PC",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T15:16:01.000Z",
          "Titre": "This was my first experience using ABC…",
          "Contenu": "This was my first experience using ABC Legal Services. I needed a subpoena served as soon as possible on an out of state witness. ABC Legal served the subpoena the same day I placed the order. I also loved the real time updates via text/email. I will absolutely use ABC Legal Services again for service of process needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher - Christopher Last",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T01:45:22.000Z",
          "Titre": "Great professional service",
          "Contenu": "Great professional service.  Great follow up.  I forgot to attach the complaint and they contacted me right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa - Teresa  Burke  teresa",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T01:13:48.000Z",
          "Titre": "You handled this for me so quickly and…",
          "Contenu": "You handled this for me so quickly and professionally, I was amazed. I will definitely use your services in the future weather it’s for work or personal business. Thank you for your great service. Thanks again Teresa Burke."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William - William Giammarino s",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T00:31:03.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, efficient, professional, trustworthy.  Will get the job done. Thank you!Giammarino Family"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn - Wolverine Engineers and",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T16:29:10.000Z",
          "Titre": "As a small business",
          "Contenu": "As a small business, we find it difficult to provide court documents to our clients because we do business throughout the entire state.  With this service, we are able to fulfill our legal needs with a click.  The service is so quick and reliable.  Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JP - Clancy & Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T21:34:14.000Z",
          "Titre": "ABC is A+ Service",
          "Contenu": "Ordering a service was easy, service was obtained timely and at a reasonable cost.  ABC keeps you updated with progress bullets at each step, and the proof of service is filed upon completion.  We will definitely use ABC Legal again and would recommend to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cloud paralegal services",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T21:40:17.000Z",
          "Titre": "I think they are prompt and they know…",
          "Contenu": "I think they are prompt and they know what is required to serve people who may be evading service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "New Direction IRA - 1161359",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T01:56:53.000Z",
          "Titre": "Client for Life",
          "Contenu": "Extremely efficient great price. Words can’t express how much I appreciate this service. I worked with an independent service and they couldn’t do in a year what ABV accomplished in three days. They have a client for life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nadina B",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T02:24:05.000Z",
          "Titre": "It was very easy and painless",
          "Contenu": "It was very easy and painless.  I was skeptical about the idea of working with your company at first.I looked at the reviews and made the call the next business day. I felt comfortable after speaking with the representative.  It was easy and once again it was a painless process. I was kept informed every step of the way"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanessa - Modern Law",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T18:28:59.000Z",
          "Titre": "They went above and beyond to get the…",
          "Contenu": "They went above and beyond to get the other party served. They were also quick to respond to my messages. It was a great experience overall."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hannah",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:15:33.000Z",
          "Titre": "Very easy to use and turnaround was…",
          "Contenu": "Very easy to use and turnaround was quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth - Copus & Copus, P.A.",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T18:26:34.000Z",
          "Titre": "Phenomenal service",
          "Contenu": "Great service and their system made it very easy to communicate with them and the process server.  We will definitely use their services again!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Mark Holmes",
          "Nb_Reviews": 6,
          "Date": "2023-09-23T20:32:45.000Z",
          "Titre": "Easy, fast, professional",
          "Contenu": "Easy to use platform, fast and professional service.   One small criticism would be the slow speed of the website chat feature.   No one answered and I got tired of waiting.   Still very satisfied though 👍🏻"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert - Robert Frezza uncopti",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T00:35:08.000Z",
          "Titre": "THE TURNAROUND TIME ON SERVING THE",
          "Contenu": "THE TURNAROUND TIME ON SERVING THE DEFENDANT WAS GREATI ALREADY GOT THE INFO BACK TOSTAMFORD CIVAL CT FOR MYZOOM MEETING ON JAN 19THXGREAT JOB"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol - Carol McKeown kadiemac",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T01:20:30.000Z",
          "Titre": "Prompt",
          "Contenu": "Prompt, professional and kept me informed as to service status. Thank .you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T19:26:01.000Z",
          "Titre": "Very simple",
          "Contenu": "Very simple. Quick response time. Provided all necessary paperwork. If we have the unfortunate need for process service we will definitely use you again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles H.",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T20:15:27.000Z",
          "Titre": "Very pleased with their service",
          "Contenu": "I couldn't have expected any better outcome than their successful efforts to serve a very hostile client. And all the while during this process, they communicated every step. I really appreciated that with knowing exactly how things were progressing. To be really honest, I highly recommend ABC Legal without any reservation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjimin - Law Offices of Benj",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T20:29:54.000Z",
          "Titre": "The assignment was accepted by you and…",
          "Contenu": "The assignment was accepted by you and you immediately executed the service of process as requested.  You did not waste any time.  You communicated promptly with us and we are very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ghaus malik",
          "Nb_Reviews": 3,
          "Date": "2023-09-09T21:13:11.000Z",
          "Titre": "I found ABC legal personal to be very…",
          "Contenu": "I found ABC legal personal to be very responsive and helpful. Every inquiry was answered promptly.The service of delivery was carried out as required. I will use their service in future without hesitation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kennex Technical",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T14:29:45.000Z",
          "Titre": "Good timely execution",
          "Contenu": "Good timely execution,  thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonya - Tonya Capers tonyacape",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T00:57:34.000Z",
          "Titre": "My experience was great",
          "Contenu": "My experience was great, I didn’t have to keep calling to find out what was going on I just sat back and let them do what they do and it was a great experience not having to do anything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terri M.",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T00:16:16.000Z",
          "Titre": "RPS Made Simple!",
          "Contenu": "First time using ABC.  Great online input format and follow-up.  POS correction made timely and efficiently.  I think I just found my new go-to RPS company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathie - Bugni, Michael W. & A",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T21:25:40.000Z",
          "Titre": "Very fast and efficient service",
          "Contenu": "Very fast and efficient service. Kept me informed along the way. Very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jan - Haitsuka Degele LLP",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T20:14:04.000Z",
          "Titre": "Very efficient with service",
          "Contenu": "Very efficient with service. I really appreciate the quick response to all my questions and your website is very user friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia - Patricia E",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T23:17:33.000Z",
          "Titre": "Fast response & clear communication",
          "Contenu": "Fast response & clear communicationThey made two attempts and were successful on the second one. Documentation was completed clearly. I would definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa - Kaplin Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:00:42.000Z",
          "Titre": "Process Service",
          "Contenu": "You followed my instructions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie - Bonnie McK",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T21:11:24.000Z",
          "Titre": "Great service",
          "Contenu": "In state or out of state, ABC has been able to quickly find and serve the people I needed to have served. Nothing but prompt, efficient work. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corey",
          "Nb_Reviews": 3,
          "Date": "2023-09-16T20:12:41.000Z",
          "Titre": "Easy to order service of process (on…",
          "Contenu": "Easy to order service of process (on line), easy to upload the court documents to be served, FAST service (at regular rate) and FAIR pricing.  Thank You!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda - Brock Shipe Klenk PLC",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T22:18:56.000Z",
          "Titre": "Great job",
          "Contenu": "Great job! Thanks for the fast turnaround."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tatyana - Tatyana  Scales  tat",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T21:13:42.000Z",
          "Titre": "Highly recommended",
          "Contenu": "Great experience, great communication, reasonable prices and make many attempts if service of choice is serving/processor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shari - Sutton Law Firm sharis",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T18:03:42.000Z",
          "Titre": "Very smooth",
          "Contenu": "Very smooth.  No issues at all, phone calls, etc.  All handled seamlessly via client portal, etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T02:15:53.000Z",
          "Titre": "It was incredibly easy",
          "Contenu": "It was incredibly easy to sign up, open an account, and place an order. And within issue short days service was perfected. Thank you so much. Great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan T.",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T18:09:38.000Z",
          "Titre": "Prompt Service and Excellent Level of Communication",
          "Contenu": "Prompt Service and Excellent Level of Communication. They kept me informed throughout and were very easy to use. We're using them from now on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob's Bikes Bikes",
          "Nb_Reviews": 3,
          "Date": "2023-11-12T14:14:21.000Z",
          "Titre": "I appreciated the ability to send…",
          "Contenu": "I appreciated the ability to send messages and also liked that they kept in touch."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Marina - BLG",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T23:57:51.000Z",
          "Titre": "Great experience!",
          "Contenu": "Working with ABC Legal was a great experience. Every person I dealt with was a true professional and wonderful individual. I  will highly recommend the company to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth - CASES",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T17:51:50.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use, competitive pricing, and in our case, they were able to over deliver on the timeline promised (I realize this may not always be possible."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T14:51:45.000Z",
          "Titre": "Great communication",
          "Contenu": "Great communication, friendly, helpful and very professional people as it was my first time hiring their abc’s services.I would definitely recommend people to hire them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie - Soyars & Soyars Ac",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:12:13.000Z",
          "Titre": "Excellent communication",
          "Contenu": "Excellent communication. Served Defendant in a very speedy manner. Will for sure use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NaChelle - Denenberg Tuffley,",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T14:42:06.000Z",
          "Titre": "Quick and reliable service",
          "Contenu": "Same day service. Quick and reliable service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen - Nicol Law, PLLC",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T00:32:11.000Z",
          "Titre": "Service of Process",
          "Contenu": "I had a total of three companies out to make service on a difficult defendant.  ABC was the only company to succeed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John R. Tatone",
          "Nb_Reviews": 3,
          "Date": "2023-09-11T16:28:53.000Z",
          "Titre": "Very efficient",
          "Contenu": "Very efficient.  very reasonable fees.  great use of technology.  I was kept informed at each attempt of service.  They got the job done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Marr",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T18:58:17.000Z",
          "Titre": "Quick and efficient!",
          "Contenu": "ABCLegal got my papers served quickly and for a very fair price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T20:31:59.000Z",
          "Titre": "Real-time alerts that enhance the process!",
          "Contenu": "The timely follow-up and notifications! The service and care of the customer support team. The real-time alerts throughout the process make one feel confidence and trust."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanne, New York",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T22:48:44.000Z",
          "Titre": "Served!!",
          "Contenu": "This company tried several times to serve papers.  They didn’t stop until served!  Thank youHappy client from New York"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott - Scott Lyons sklyonscox",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T21:05:45.000Z",
          "Titre": "Process Server",
          "Contenu": "Super easy and efficient from start to finish!  Don’t have to worry about certified or registered mail with ABC!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacie - Starn O'Toole Marcus",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T03:25:19.000Z",
          "Titre": "I love the quick and efficient service…",
          "Contenu": "I love the quick and efficient service and instant communication.  The website is user friendly.  Keep up the great job!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Diana - Aird & Berlis LLP dmor",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T14:04:35.000Z",
          "Titre": "Using ABC Legal Services is an easy…",
          "Contenu": "Using ABC Legal Services is an easy process and the tasks are always completed quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica F.",
          "Nb_Reviews": 4,
          "Date": "2023-09-10T22:00:26.000Z",
          "Titre": "ABC Legal Services are the BEST Process…",
          "Contenu": "ABC Legal Services are the BEST Process Servers in California!!!  They are very well-informed and professional.  I will never use any other company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oscar - ANA Brokers",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T15:44:15.000Z",
          "Titre": "Great website",
          "Contenu": "Great website. Easy to maneuver. Everything went very smoothly. Perfect for someone needing a process server in multiple states. Didn't have to find someone else when the first state was a bust. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "KN",
          "Pseudo": "Browne & Associates SKN",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T16:46:27.000Z",
          "Titre": "Great and easy use of website to allow…",
          "Contenu": "Great and easy use of website to allow the user to easily navigate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry - Trent Law Firm, PLLC",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T17:05:44.000Z",
          "Titre": "I was very happy with ABC Legal…",
          "Contenu": "I was very happy with ABC Legal Services as they were prompt and communicative throughout the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa - Letts Property Manageme",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T20:25:04.000Z",
          "Titre": "ABC Legal was right on it & was able to…",
          "Contenu": "ABC Legal was right on it & was able to serve the notice rather quickly to the tenant. Will defiantly use this company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GILBERT - PROMPT PROCESS & INV",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T06:05:09.000Z",
          "Titre": "I spoke to them on the phone and then…",
          "Contenu": "I spoke to them on the phone and then scan the docs. They did exactly as they said would and the service was completed. And ... I did not have to wait days to get the return of service affidavit. I will use their services again for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Norman - Law Offices of Norman",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T18:50:28.000Z",
          "Titre": "Great communication as to where you…",
          "Contenu": "Great communication as to where you were with the order. Quick service, and receiving proof of service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura - McLallen Law Firm",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T17:26:31.000Z",
          "Titre": "Good communication and super fast…",
          "Contenu": "Good communication and super fast service. There was a question about the charges, and it was addressed and partial payment refunded immediately.  Would definitely recommend and will use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Midge Leavey",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T17:12:11.000Z",
          "Titre": "You can trust this companyand proof of service",
          "Contenu": "Great updates and proof of service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie - Julie Smith juliebodya",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T21:08:21.000Z",
          "Titre": "Expeditious service and easy to…",
          "Contenu": "Expeditious service and easy to schedule. Prompt updates and proof of service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitzi - Marks Balette Giessel",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T14:30:04.000Z",
          "Titre": "Easy",
          "Contenu": "Easy to use your website to request service; you respond quickly to any messages; very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy - Schirmer Law LLC",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T19:04:41.000Z",
          "Titre": "The process was easy and the…",
          "Contenu": "The process was easy and the communication was on point.  The service was fast and everything just flowed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T22:22:53.000Z",
          "Titre": "First timer",
          "Contenu": "This is the first time I have ever had to use a service like yours. Your website guided me through the steps and made it super simple. The text updates were cool too, made me feel like I was on a ride along or something.                            Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber - Lewis Labadie",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T21:58:02.000Z",
          "Titre": "Service was quick and reasonable…",
          "Contenu": "Service was quick and reasonable priced.  ABC kept us up to date constantly on status of serve"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "N Scott",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T18:00:52.000Z",
          "Titre": "Cost effective and super efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Baijla",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T14:44:29.000Z",
          "Titre": "Quick work....you dispatched a process…",
          "Contenu": "Quick work....you dispatched a process server promptly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele - Law Office of Patric",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T15:00:45.000Z",
          "Titre": "You had our defendant served in 3 days…",
          "Contenu": "You had our defendant served in 3 days which we were trying for 5 months to get them served."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry - Lewis Brisbois Bisgaar",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T15:11:07.000Z",
          "Titre": "All was given to them last minute and…",
          "Contenu": "All was given to them last minute and they still managed to get all services done at a great price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily - Danchuk Law, LLC",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T21:47:13.000Z",
          "Titre": "The availability of a reliable company…",
          "Contenu": "The availability of a reliable company online is wonderful, and ABC Legal makes the process super easy.  The service was very prompt."
        }
      ]
    }
  ]
}