{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "acratech.net",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "MrJohnStubbins-later",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T15:40:36.000Z",
          "Titre": "Fake website, never received my order",
          "Contenu": "I ordered a dji mini 2 on the 19th of March, I received tracking the same day however my address was not on the tracking and it also stated my drone was shipped on the 17th March. On the 24th March the tracking stated my drone had been delivered and signed for however I had not received anything. So I emailed arcatech drones to find out what the problem was. They responded pretty quickly and said the tracking was wrong and they would look into it for me and if needs be send another drone with the fastest shipping. Its now the 3rd April and I have sent 3 further emails and not had any response to any of them. It is obviously a scam company! I have contacted my credit card provider to let them know of the fraud. Worst of all it was for my sons birthday on the 1st April."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2022-05-23T17:25:26.000Z",
          "Titre": "Wasn't happy with the 1165 I ordered",
          "Contenu": "Wasn't happy with the 1165 I ordered.  Asked to return it on your website.  Never heard any response.  The turning movement is a lil gritty.  The lever clamp fully releases when opened.  It should only release so you can move the camera.  Not so the camera can fall out.Really badly designed product.  The LeoFoto I have is a much better designed product at less than half the cost.And throw in the customer service that doesn't respond."
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Beat Hotz",
          "Nb_Reviews": 2,
          "Date": "2020-06-15T21:02:08.000Z",
          "Titre": "Didn‘t receive item"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason Jantzen",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T21:50:10.000Z",
          "Titre": "Still haven’t received my package and…",
          "Contenu": "Still haven’t received my package and customer service was no help."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Jonathan R.",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T10:08:05.000Z",
          "Titre": "The quality of the product is normal its price is disproportionate",
          "Contenu": "The quality of the product is normal and its price is disproportionate, the side wheel is uncomfortable to use on flat platforms, the base should be totally flat. Another inconvenience was the shipping costs totally disproportionate being an ordinary shipping and with more than 3 weeks to arrive to my country. I would not buy it again. Greetings"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JEANNIEJAY CREATIVE DESIGNS",
          "Nb_Reviews": 1,
          "Date": "2019-07-25T15:26:46.000Z",
          "Titre": "Not what I expected",
          "Contenu": "Not what I expected. It really is a lot for not much of anything. I still don't get the right look on my computer. I think it also is where you sit or high or low your laptop is. If I line it up then my my screen is too dark. I had hoped it locked my screen in place."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Jaume Claramunt",
          "Nb_Reviews": 2,
          "Date": "2019-12-17T10:12:37.000Z",
          "Titre": "Disappointed",
          "Contenu": "I'm very disappointed because in the web it's not clearly stated that I must pay import taxes at customs. I had to add one third of the sale price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill Soinski",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T23:25:55.000Z",
          "Titre": "I was disappointed with the finish",
          "Contenu": "I was disappointed with the powder coat finish, which does not wear very well. All my other plates from competitors are anodized."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Marcomarco",
          "Nb_Reviews": 1,
          "Date": "2020-12-03T23:54:39.000Z",
          "Titre": "The level bubbles do not align up.",
          "Contenu": "In September 2020, I received the two products I purchased - Acratech Leveling Bases - Fast Tripod Leveling and Acratech Panoramic Head - each has a level bubble. When fitted to my Gitzo tripod the two bubbles do not align up, as expected. They are about half a bubble out. I have sent two emails in regard to this issue and have not had any reply!!!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Y J Kwong",
          "Nb_Reviews": 4,
          "Date": "2020-09-23T05:11:17.000Z",
          "Titre": "I'll give it 4 stars if it is not that…",
          "Contenu": "I'll give it 4 stars if it is not that bulky and weight a bit. The other thing is the tensioner knob seems don't do much except like the other locking knob to lock in the tilt movement. It is a bit pricey too."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Stephen Loftus",
          "Nb_Reviews": 4,
          "Date": "2023-02-12T00:22:13.000Z",
          "Titre": "Great Product",
          "Contenu": "Solid, well constructed panarama head. Easy to use and very stable shooting platform.Quick international freight with tracking. Well done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 7,
          "Date": "2021-05-05T00:20:36.000Z",
          "Titre": "Good so far.",
          "Contenu": "I have owned many ball heads including RRS BH 55 and this one ranks with the the best. I like the gimbal option and the size/design. I am earning to set the tension, hoping it will perform like my large gimbal. I am writing this review before using this in the field. Requests for reviews would be much more valuable if done after 3-6 months."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gordon Jalkemo",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T18:39:18.000Z",
          "Titre": "Product _leveler_ is good however",
          "Contenu": "Product _leveler_ is good however, one major shortcomings is the lack of an option to set the resistance to movement once the \"lock\" screw is released.With that in place it would take it an excellent leveler."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jime",
          "Nb_Reviews": 2,
          "Date": "2020-11-21T15:47:10.000Z",
          "Titre": "NEED LARGER INDICATOR MARKS.",
          "Contenu": "Due to my age, but maybe younger folks have problems too, the registration marks and especially the indicator mark are too small to see easily.  That is only on the horizontal axis.  The mechanics and build quality are superb"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Nelson",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T00:25:44.000Z",
          "Titre": "I sent a tech/customer service question…",
          "Contenu": "I sent a tech/customer service question concerning am arca clamp I purchased. It took a while for them to respond. However, when they did it was helpful. They were fair overall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Dhondt",
          "Nb_Reviews": 7,
          "Date": "2020-09-07T14:07:36.000Z",
          "Titre": "Great product but with a high price tag",
          "Contenu": "Excellent craftmanship! This is one solid crafted piece and works perfectly.  I only knock it down one star because of the cost. It is really high cost for what you use it for.  But I suppose if you can afford it you won't be sorry. It is really well made."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Gustave",
          "Nb_Reviews": 3,
          "Date": "2019-12-28T18:26:59.000Z",
          "Titre": "I give a 5 stars rating for the product…",
          "Contenu": "I give a 5 stars rating for the product quality. I have been using Acratech ball heads for years. They never let me down. This model (GXP) takes some time to get used to, as there is an extra knob. I wish the level was bigger, it's not easy to see in low light.But I had the ballhead order sent overseas (to France). There was a VAT to pay (perfectly normal) but delivery was not possible unless there was someone home. It would be easier to pay the VAT upon ordering so that the parcel can be delivered moreeasily. But it may not be possible for logistic resons."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2020-07-13T14:26:02.000Z",
          "Titre": "Excellent Light Weight Leveling Ballhead",
          "Contenu": "My mistake was ordering the tripod head on a Friday because it took until Monday to see PayPal acknowledge the transaction even though I had a PayPay charge against my bank account for the cost of the item plus a \"0\" charge that PayPal normally places on the account. It was acknowledged on Monday and I received the item on Wednesday. I had ordered the same day a tripod from Amazon and it hit my bank account in the same fashion but delivery was on Saturday. The tripod head is a very nice unit and met all of the claims about sturdiness and light weight. It will be a nice change from backpacking any of my other tripod/head combinations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike T.",
          "Nb_Reviews": 4,
          "Date": "2019-08-27T12:58:17.000Z",
          "Titre": "Quality is fantastic",
          "Contenu": "Quality is fantastic. I did not like how bulky the L-plate is on the camera body. I prefer one that can be left on, so I returned. it. If you don't mind putting it on a and taking it off, you couldn't get a higher quality plate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Heath",
          "Nb_Reviews": 1,
          "Date": "2020-02-13T15:22:31.000Z",
          "Titre": "Thus far I'm very pleased with my new…",
          "Contenu": "Thus far I'm very pleased with my new Acratch GP ballhead. It's 1.6 lbs. lighter than my old NPC ballhead and has more flexibility and nice  features I look forward to exploring.  I'm surprised Acratech does not recommend carrying a tripod and camera attached to the Acratech GP. Detaching the camera from the tripod ballhead  each time I change to a new nearby site doesn't seem practical.  My older Arca-Swiss plates appear to have edges that extend further into the receiving channel edges of the new GP. So I'll use the old release plates on the GP, continue to carry my camera on the tripod in the field and hope for the best. The much lighter Acratech now makes my camera rig a candidate for a weight loss ad. ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "murdridge",
          "Nb_Reviews": 1,
          "Date": "2019-06-30T21:05:00.000Z",
          "Titre": "Only complain I have that there seems…",
          "Contenu": "Only complain I have that there seems to be no means of logging out, at least I could not find one.Everything else is very good, placing orders, phone support and speedy delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Issler",
          "Nb_Reviews": 1,
          "Date": "2019-06-12T20:15:59.000Z",
          "Titre": "Long Lens Tripod Head",
          "Contenu": "I’ve only used the Long Lens Head for about a month now and I’m satisfied. It supports my Pentax body and D FA 450 with teleconvert just fine."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tony Bradstreet",
          "Nb_Reviews": 1,
          "Date": "2020-06-11T16:57:15.000Z",
          "Titre": "Good prompt service.",
          "Contenu": "Good prompt service.The product itself was ok but not as good as its hype (as one would expect)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2020-05-04T19:36:49.000Z",
          "Titre": "Good stuff but even something as simple…",
          "Contenu": "Good stuff but even something as simple as a quick release plate is expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Koshiro Hashimoto",
          "Nb_Reviews": 2,
          "Date": "2020-06-10T17:07:31.000Z",
          "Titre": "Two weeks report of GP ball head with lever clamp and 5\" lens plate",
          "Contenu": "Two weeks have passed since I received my GP Ball head with lever clamp andone week for 5\" lens plate.  With 5\" lens plate, I started o set up Nikon 70-200telephoto zoom and TC-17 EII teleconverter to take Landscape and several bird/s picture. Bird picture is new category for me with tis GP Ball head with gimbal feature.  During two weeks experimental practice, I have been workingfor routine setup and process. This is very important for trained efficiency . I dropped whole system from clamp system which broke lens food. I was lucky that I dropped it on floor carpet, not outdoor.  Damage to food was minor one,need bond repairing and D850 and telephoto lens are all OK.  I still need to work on Clamp lever, Main Control knob and Tension knob for best routine and tightness.  Need to confirm for each step as you work on it.  I also found someloose condition when you shake the system after I have tighten the system.  I also found that ball slide has some tendency on direction, but it might be a margnal and not a serious one.  A gimbal worked very well and easy to find to measure the balance center for free move with 5\" lens plate.  Only suggestion to report is to add scale dot or line to plate so that you can control the position on clamp system.  (I put several dot/s to the plate by marker for each lens to indicate the best weight balance)  I am enjoying it very much taking picture of bird/s visiting water fountain at backyard of my house.  After all these trial, I will go out to take outdoor scenery and wild life. This Ball Head is a big fun!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Donald McVee",
          "Nb_Reviews": 3,
          "Date": "2019-11-18T16:34:38.000Z",
          "Titre": "Super product",
          "Contenu": "Super product. A bit expensive but ....."
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "victor Benavides",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:49:48.000Z",
          "Titre": "This was a highly recommended product…",
          "Contenu": "This was a highly recommended product and i bought it.  I am impressed with the quality and sizs of the green level."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GEORGE W",
          "Nb_Reviews": 5,
          "Date": "2023-12-21T05:09:16.000Z",
          "Titre": "Easy to order...",
          "Contenu": "Easy to order, shipped fast, very happy order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tana",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:49:42.000Z",
          "Titre": "The best products on the market."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Dianne",
          "Nb_Reviews": 3,
          "Date": "2023-08-21T00:48:34.000Z",
          "Titre": "Brilliant service as always and the…",
          "Contenu": "Brilliant service as always and the pano head was exactly as described.  Products are always really well built and work as described.  You know that whatever you buy will be excellent, go the distance, and you are paying for long lasting quality.Shipping was faster that expected and everything is very well packed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ari Denison",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T20:03:10.000Z",
          "Titre": "Superb products and customer service.",
          "Contenu": "I had a question about the product and my call was answered on the first ring by a real human who not only answered my questions but said that they would personally confirm that my order was handled properly. They make such good gear and they have such good customer service that I can't imagine going anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Claire Moore",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T13:44:55.000Z",
          "Titre": "Right from the ordering experience to…",
          "Contenu": "Right from the ordering experience to the fast shipping and even returns if needed, they are really good. Also the customer service was quick to reply to inquiries too which is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bradley Weeks",
          "Nb_Reviews": 4,
          "Date": "2023-05-07T05:17:26.000Z",
          "Titre": "One all my questions were answered in…",
          "Contenu": "One all my questions were answered in fast and timely fashion. Also the order arrived in timely and fast manner. Everything was perfect and worked great. These little things make the system work better than most or all competitors products. It is in the details that I find the best experience. When every step goes smoothly with the quality and fit of Aquatech that photography is fun and rewarding. So enjoy the precision and sturdy feeling of AQUATECH."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Burke Schmidt",
          "Nb_Reviews": 22,
          "Date": "2022-10-27T02:43:51.000Z",
          "Titre": "Acratech Review",
          "Contenu": "I've purchased a ball head and a leveling head based on several; criteria, namely, high quality, American made, and ease of use.  The Acratech products I now own exceed all of those conditions.  All the products were shipped quickly at a reasonable price and arrived in perfect shape.  Your video tutorials answer any questions that might occur with your products. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Luterbach",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T16:51:12.000Z",
          "Titre": "Professional and caring",
          "Contenu": "Professional and caring, they called me shortly after my order to explain the certain item was out of stock and waved the shipping cost for my other items. Now days it is rare to see the level of customer service, I will being ordering with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Owens",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T17:01:04.000Z",
          "Titre": "What A Find!",
          "Contenu": "Acratech's panohead has been an absolutely incredible find! I've been using a Really Right Stuff panohead for many, many years (now no longer available). It's incredibly versatile and durable. But it's also very heavy. Enter Acratech's panohead! Incredibly light, great design and manufactured with quality materials. Finally a solution for those long hikes where any and all weight is at a premium. Thank you Acratech! Jeff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 8,
          "Date": "2022-05-28T04:36:39.000Z",
          "Titre": "Nothing but positive experiences…",
          "Contenu": "Nothing but positive experiences dealing with Acratech. Innovative, well machined products. Not going too far out on a limb to say their customer service is as good as any and much better than most. In the parlance of this opinion thing's format, Acratech offers FIVE STAR service. They do this without the saccharine emptiness often betrayed by a 'customer service rep' trying to read from his script. Good products, friendly staff and fair prices. They will help you before and after the sale."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffery DuBridge",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T18:29:31.000Z",
          "Titre": "Will Stand the Test of Time!",
          "Contenu": "Acratech makes many excellent products that stand the test of time. I have three of their tripod heads along with many more camera and lens plates. They equipment is very sturdy and will take either a sledgehammer or welding torch to ruin, yet is extremely lightweight and very intuitive to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 8,
          "Date": "2022-09-29T12:36:34.000Z",
          "Titre": "Champ Clamp",
          "Contenu": "This clamp was perfectly designed and machined, just as everything I've bought from Acratech has been. Smooth action/looks good. As an added bonus they price these little works of art/workhorses competitively. Can't ask for more than that. I use this one to quickly switch AD200Pro flashes from one stand or tripod to another. Very convenient to not have to screw around when you're thinking about other aspects of the lighting. Chuck"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 5,
          "Date": "2022-04-26T01:25:03.028Z",
          "Titre": "Acratech Pano Head w/ Lever Clamp",
          "Contenu": "Extremely please with the Pano Head with Lever Clamp.  Set up w/ my leveling base is extremely accurate, This unit attached to a leveling base makes stitching pano's a breeze vs when I just used my ball-head.  Also, for all my other general landscapes images the pano head works flawlessly.  I opted to using the lever clamp vs the screw type for speed and preference.  I have a ball-head with a screw mount and that's is fine, but I personally prefer the lever clamp.  Lever clamp is super easy to adjust to your specific mount (mine is a RRS L bracket) and holds my DSLR perfectly.  With DSLR mounted I've had no slippage especially pointing camera either upward or downwards (very steady).  Again, extremely please with this product and looking forward to the many adventures that lay ahead."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Parcell",
          "Nb_Reviews": 2,
          "Date": "2022-06-22T06:39:53.000Z",
          "Titre": "The overall purchasing rices was easy…",
          "Contenu": "The overall purchasing process was easy and straightforward.  Could not ask for anything more.  As well, on receipt of the several items I purchased, I found that the gear was absolutely top notch and of extremely high quality.  If I have further needs, I will always check with Acratech first!  Bravo Zulu!"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Dianne",
          "Nb_Reviews": 3,
          "Date": "2023-03-06T17:38:43.000Z",
          "Titre": "Excellent service and product",
          "Contenu": "Excellent service.  The ball head arrived really well packaged with full tracking all the way from the US to New Zealand.  I had previously made an enquiry via the website and all my questions were well answered with recommendations provided.  Very happy with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Michael Pollock",
          "Nb_Reviews": 4,
          "Date": "2023-02-07T16:21:46.000Z",
          "Titre": "Great service, good result.",
          "Contenu": "Great service, excellent range of products and very competitive prices. Order dispatched promptly, handled quickly and efficiently by courier, customs cleared and delivered on time. Items exactly what was required, a good result. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 4,
          "Date": "2021-04-29T17:00:14.000Z",
          "Titre": "Tried hard not to like it, but....",
          "Contenu": "Coming from a lifetime of using a heavy lever-driven three-way pan/tilt head, I tried very hard not to like this ball head.  It won me over the first time in the field.  Very solidly built and excellent controls.  My old Gitzo Rational 3 magnesium head weighed a ton.  The GXP ball head from Acratech weighs less than a pound.  Couple that with a 5 pound carbon fiber tripod, and the combo can't be beat.  Using an L-bracket on my Fujifilm GFX 50R, the quick release lever locks solidly and positively into place, reducing the time to move from horizontal to vertical shots by a huge factor.I'm very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erik S.",
          "Nb_Reviews": 2,
          "Date": "2021-05-13T14:27:49.000Z",
          "Titre": "Always top quality",
          "Contenu": "Every product I've ever purchased from Acratech is of the highest quality. As a full time nature photographer I rely on their equipment and put it through a lot in windy deserts, on wild ocean coasts and in the snowy mountains. Acratch makes the best equipment and that's why I keep coming back . Their customer service is always top-notch as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken B.",
          "Nb_Reviews": 2,
          "Date": "2021-10-23T22:18:05.000Z",
          "Titre": "The Best Heads on the Market",
          "Contenu": "The Acratech products I've purchased (GXP, Leveler, Swift) are truly excellent; by far the best I've seen.  They're easy to use, secure, and accurate.  Thank you, Acratech; you're doing great!The only things I would change would not be to the products, but to the website:  Downloadable PDF instructions for all the products and a link to logout after making a purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Santa Fe Paratrooper",
          "Nb_Reviews": 3,
          "Date": "2021-04-15T16:38:41.000Z",
          "Titre": "The Acratech Pan Head is Perfect!",
          "Contenu": "The Acratech Pan Head is an absolute gem. Just perfect as a day to day head for portraiture, etc. But its real beauty shows when you need to do panoramic images.  So stable and easy to use. I did some panos last week in New Mexico and they came out perfectly aligned. Simply a high quality head that any outdoor photographer should procure. And don't forget what an amazing warranty Acratech has on its products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RON",
          "Nb_Reviews": 1,
          "Date": "2021-10-20T11:04:20.000Z",
          "Titre": "Great product & service",
          "Contenu": "Had a question about clamp for recently released camera.  Owner answered when called.  Said he'd have individual who knew get back to me the following day when he came in.  Instead owner got back to me within an hour.  Fantastic service & great products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jeffrey friedman",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T23:47:49.000Z",
          "Titre": "Enduring quality",
          "Contenu": "There are certain bits of gear worth investing in.  A body (obviously,) great glass, and i would argue a fantastic ball head falls into this category. The acratech gxp hits that mark.  It more than meets my needs today and I expect I'll say the same thing 5 years from now.It's both bombproof and light.  The movement is super smooth.  Overall the quality is outstanding... every tolerance is tight / precise.  And the ability to clean the ball / mechanics puts this over the edge. We'll done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Burke Schmidt",
          "Nb_Reviews": 22,
          "Date": "2022-03-17T06:10:57.000Z",
          "Titre": "Acratech GP-SS Ballhead",
          "Contenu": "I purchased this Acratech GP-SS Ballhead because it is made in the USA, handles the weight of all my cameras, including my 4x5, and converts to a leveling head quickly.  I just wish I had acquired one sooner.  It mounts to the tripod quickly, adjusts quickly and firmly, and enables much more secure camera management than any other head I’ve experienced. Thank you Acratech for a great product."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Allen A Hale",
          "Nb_Reviews": 5,
          "Date": "2021-08-09T14:32:49.000Z",
          "Titre": "After opening the boxes for the…",
          "Contenu": "After opening the boxes for the leveling base, panorama head and nodal rail, I handled them, turned the knobs and placed them on both of my tripods.  I then just looked at them for quite some time marveling at how beautiful they were and how well they functioned.The next day I used them to determine the pupil entry point (nodal) for the lenses and focal lengths that I intend to use for panoramas.  It was easy and efficient using the Acratech equipment.I am very pleased with the devices and the fair shipping costs I was charged for my international location."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CYNTHIA CLARK",
          "Nb_Reviews": 1,
          "Date": "2021-04-19T16:58:00.000Z",
          "Titre": "I purchased a GPX ballhead  and plates…",
          "Contenu": "I purchased a GPX ballhead  and plates for my various lenses & cameras. Everything is engineered with amazing precision. The quality of the products, particularly the ballhead is outstanding. I also should mention that I made a couple of mistakes on my order, which Acratech cheerfully & promptly helped correct.I could not be happier with the product and this company! They are THE BEST!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T14:13:35.000Z",
          "Titre": "Discover what your missing!",
          "Contenu": "Acratech's website is very easy to navigate. My purchase was smooth and painless. Delivery was fast, and it is so exciting to hold a brand spankin' new GXP ball-head in your hands! It is truly a testament to the superior design and machining that Acratech utilizes. This is my second purchase. If you want to support an American company and family, and get the highest-quality products and service, go with Acratech."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pharwatch",
          "Nb_Reviews": 6,
          "Date": "2021-11-02T20:28:19.000Z",
          "Titre": "Had a question on  L-plates for the Z6…",
          "Contenu": "Had a question on  L-plates for the Z6 and interference with the new Nikon r11b . Had a long and detailed conversation with customer support and got great advice on why this is happening and they don't have an L-plate solution so ended up getting the standard plate. Great Support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard McLain",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T15:06:02.000Z",
          "Titre": "Perfect head for pan and tilt.",
          "Contenu": "This produce works great and paired with a leveling base will do almost anything you want. Biggest surprise is the more manufacturers done come up with their own version. Do that is okay because Acratech already has a great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keylor E.",
          "Nb_Reviews": 2,
          "Date": "2020-12-28T20:10:39.000Z",
          "Titre": "Exceptional. Everything you'd hope for in a small company and product.",
          "Contenu": "I'm very pleased with my Acratech purchases. I appreciated Scott and Patty's help in matching a plate to my \"not listed\" Nikon F4s, as well as suggesting a GP ballhead, lever clamp, and plates for my other cameras and long lenses for my kind of photography. When I asked about their business, they were kind enough to share how they and their staff have produced these innovative precision ball mounts, plates, and accessories for 20+ years in CA. Great quality products with a 10 year warranty, personal service, rapid shipping, and family business in the USA. What isn't there in this to love about Acratech?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Peters",
          "Nb_Reviews": 2,
          "Date": "2021-09-21T15:13:13.000Z",
          "Titre": "I Absolutely Luv Acratech's Tripod…",
          "Contenu": "I Absolutely Luv Acratech's Tripod Heads. The Quality of Design, Materials and Construction is superb! I have the GPX Ball Head and Long Lense Head, and am thoroughly pleased with both – I'll look forward to Acratech's continued commitment to innovation and extremely High Quality photo gear!Also, Kudos the Hudson Henry🙌for introducing me to Acratech👍Best, Tim Peters"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel McCool",
          "Nb_Reviews": 2,
          "Date": "2021-05-05T01:13:51.000Z",
          "Titre": "I purchased a large leveling base",
          "Contenu": "I purchased a large leveling base. Beautifully made. I liked it better then other leveling bases I compared it too. It locks up tight. I has a lower profile which was important in my buying decision. Would recommend it highly !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grant Daniels",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T21:41:47.000Z",
          "Titre": "Ordered several items from Acratech",
          "Contenu": "Ordered several items from Acratech.  Couldn't be more pleased with my purchases.  This is my first experience with this company--but after dealing with the company and their products, I will be back.In my opinion, their products quality are second to none.  Plus their customer service is also exceptional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arthur Stoppe",
          "Nb_Reviews": 2,
          "Date": "2022-06-18T18:35:11.000Z",
          "Titre": "The usual high Acratech quality and service",
          "Contenu": "Prompt shipping and delivery. And the product (quick disconnect plate for Nikon D850) was the usual high Acratech quality. The only thing I might change is this: I worry about the metal surface of the plate scuffing the bottom of the camera. My solution is to put some electrical tape on the top of the plate so that it doesn't contact the camera directly. You can even use different colors of tape so that if you have more than one camera/plate you can color code them. But it'd be nice if Acratech would come up with some solution of their own (like putting some cushioning on the top of the plate) for this small issue. Otherwise the product is pretty much perfect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 3,
          "Date": "2022-08-01T20:20:45.000Z",
          "Titre": "Nice Product -- Great People",
          "Contenu": "I've had an Acratech Leveling Base for several years, but mated to some heads of indifferent quality.  After looking around and reading reviews, I realized that the Ultimate Ball-Head was the best option for my use case.  I think I'm going to be very happy with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa streeter",
          "Nb_Reviews": 6,
          "Date": "2022-03-31T00:15:12.000Z",
          "Titre": "Long lens pan & tilt tripod head.",
          "Contenu": "I’m so impressed with this company wow! Great customer service, great product and an out of this world warranty!! I can’t believe how much more support my camera has with the long lens pan & tilt head. It works flawlessly, great panning, tightens right up no movement. Thank you so much Acratech!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bill",
          "Nb_Reviews": 13,
          "Date": "2023-04-29T21:29:39.000Z",
          "Titre": "Excellent for Landscape / Hiking Photography",
          "Contenu": "So much better than a Ball Head.    Absolute Bombproof quality.   Easy to use.    Very precise.  Very good markings for my bad eyesight.   I currently own a Joystick Head for weddings and it is great.  I also own a Geared Head which is great for Macro and extremely precise, but far too bulky for me for travel and hiking around Scotland.   I purchased a Ball Head, but returned it due to its erratic behaviour and lack of precision for Landscape Photography.    I decided to give this Acratech set up a go and don't regret it at all.   It's perfect for Pano's.   I appreciate that it costs more than a Ball Head but you do get your moneys worth.   I also purchased the Acratech base leveller.   The whole set up is great for travel and pretty streamlined compared to a geared head set up.   Very happy with the Acratech."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary McCaughtry",
          "Nb_Reviews": 2,
          "Date": "2022-04-04T17:42:27.000Z",
          "Titre": "Quality worth the price.",
          "Contenu": "I am pleased to pay what some might feel is a premium price if it’s a high quality, specialized domestically produced product. The long lens head definitely qualifies. It is a much better match for my hiking-oriented tripod than the ball head I was previously using. The only recommendation I would make would be if the panning knob control would provide a more graduated adjustment for a smoother range from tight through a freer rotation range. But this is not intended to be a video panning head. When purchasing I also prefer to buy directly from the company that produces the item and this was a positive experience with Acratech. The ordering process was quick and easy and the shipping was fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gr8orangeone",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T22:01:00.000Z",
          "Titre": "Solid product",
          "Contenu": "No issues with the product. Prompt shipping solid product. Have yet to really heavily use the tripod head but what I have done with it it's worked great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 8,
          "Date": "2022-05-19T13:03:41.000Z",
          "Titre": "No Problems Ever From Acratech",
          "Contenu": "I've bought several things from Acratech and the deals have always been smooth and perfect. They make high quality gear and have a high quality Mrs. Acra' who generally answers their phone. She is easy to talk to, often offers good advice and sometimes lower prices. Very good company to do business with. I'm sure I will buy from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T11:33:03.000Z",
          "Titre": "The GPX ball head was shipped within 2…",
          "Contenu": "The GPX ball head was shipped within 2 days of ordering. It exudes quality just by look and feel. The adjustment knobs are precise and lock down the camera so we'll that the I use tripod becomes the less stable component."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Miller",
          "Nb_Reviews": 9,
          "Date": "2022-02-20T14:36:07.000Z",
          "Titre": "I have several products from Acratech and this won't be the last.",
          "Contenu": "I have never bought a product from Acratech that wasn't excellent. Even the 'seconds' items are perfect IMO. Their build quality is incredible and I always feel well cared for when talking with customer service.Love their products and have at least one item in each of my kits."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R Vickers",
          "Nb_Reviews": 2,
          "Date": "2021-04-13T20:35:40.000Z",
          "Titre": "Panoramic Head with Large Format",
          "Contenu": "I am extremely pleased with the Acratech Panoramic Head.  I use it for my large format cameras together with a leveling base.  Using the two together allows for precise and separate vertical and horizontal placement of the camera with a compact and lightweight set up.  So far, I have used the combination with a 5x7 and an 8x10 camera.  Once in place, I can use tilt, shift and other camera movements without camera displacement.  Also, the camera remains steady when inserting and removing film holders. And at some point I will try the panning movement actually to try some panoramic set ups. In the meantime, this is a great setup for backpack outdoor use with LF."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Stephen Loftus",
          "Nb_Reviews": 4,
          "Date": "2023-03-09T02:03:25.000Z",
          "Titre": "Fast service and what a solid well made…",
          "Contenu": "Fast service and what a solid well made product. Great for heavy lenses and a very stable platform easily fine tunable. I will be looking at additional Acratech products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Miller",
          "Nb_Reviews": 9,
          "Date": "2022-01-11T21:12:10.000Z",
          "Titre": "Super fast shipping and most of all; Excellent products.",
          "Contenu": "Super fast shipping and most of all; Excellent products.Acratech does superb machining and finishing. The Hasselblad mount fits perfectly and what is not to love about their ball heads.Love this stuff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Ihde",
          "Nb_Reviews": 3,
          "Date": "2021-06-15T20:19:02.000Z",
          "Titre": "Customer service goes far beyond the…",
          "Contenu": "Customer service goes far beyond the ordinary.  There was some confusion with FedEx because I knew a package was coming I needed to sign for.  FedEx dropped off the package I was supposed to sign for (unsigned), and I never received the second package which was my Acratech lens base plate.  So I thought FedEx must have lost it.  I called Acratech and told them the situation.  They offered to send me a second base plate at no charge.  Fortunately, FedEx delivered the base plate over the weekend and I notified Acratech in time to hold the base plate they were going to give me.  Unusually good customer service."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Abhijit Chanda",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T18:16:53.000Z",
          "Titre": "Global shipping for the win",
          "Contenu": "Global shipping for the win! Also, what a beautifully designed mount that’s strong, sturdy, versatile and compact. You guys have succeeded where so many have failed."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Hagen Merkel",
          "Nb_Reviews": 1,
          "Date": "2021-02-15T18:08:33.000Z",
          "Titre": "When I was looking for the long lens…",
          "Contenu": "When I was looking for the long lens holder, I liked the design of the web page and the ease and security of ordering. The fast delivery surprised me positively.The long lens holder corresponds to the full extent of my imagination.A light construction and no vibrations with heavy lenses.Hagen Merkel"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL TAYLOR",
          "Nb_Reviews": 2,
          "Date": "2021-03-30T21:29:29.000Z",
          "Titre": "AWESOME Product",
          "Contenu": "AWESOME Product. Now the lens rotates perfectly centered on its axis for panorama's. Super easy to untighten mounting plate, lift and retighten for shooting in portrait mode also. Shipping was fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Kaar",
          "Nb_Reviews": 1,
          "Date": "2021-05-15T17:14:34.000Z",
          "Titre": "Quality products!",
          "Contenu": "Nice, easy transaction.  All I needed this time were Arca-swiss-type mounting plates for a Nikon D500 & a long lens.  Got both at a very reasonable price.  Previously had picked up one of the Acratech Long Lens heads - a great piece of gear for landscape work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JW_Dupage County",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T03:11:47.000Z",
          "Titre": "I called Acratech prior to ordering",
          "Contenu": "I called Acratech prior to ordering, asked if they had it on hand + how long to ship.As they promised, it shipped same day and arrived on time.  Shipping was perfect!I haven't really used it yet, but it mounted to my tripod perfectly.  In a couple months I'll do a product review"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Maxson",
          "Nb_Reviews": 2,
          "Date": "2022-06-14T20:55:43.000Z",
          "Titre": "1117 Leveling Base: The Perfect Compliment to the Panoramic Head",
          "Contenu": "The 1117 Leveling Base is the perfect compliment to the 1165 Panoramic Head. I purchased both to build out a small travel tripod. The beautiful, simple, well-executed design makes this pair ideal for my application. After using ball heads for many years, I have transitioned to panoramic and video heads for most of my general photography. The independent x- and y-axis movements makes framing and alignment so much easier compared to a ball head. The Leveling Base makes tripod setup painless by eliminating the hassle of adjusting legs to finesse a level pano platform. This unbelievably light-weight combo just screams “take me with you!”A word of caution — there is ample drag adjustment, but these are not fluid-damped, or spring-loaded components. Set the drag properly, balance the load, and you are good to go. But for safety, keep a hand of the lens / camera rig as you loosen the vertical-axis clamp knob on the pano head. I lovin’ the form, fit, and function of the Acratech products. Great mechanical engineering is an art in it’s own right!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly Watts",
          "Nb_Reviews": 2,
          "Date": "2021-08-26T17:52:48.000Z",
          "Titre": "After using the Acratech ball on my…",
          "Contenu": "After using the Acratech ball on my tripod, I curse myself for not upgrading sooner. It is a terrific product and I look forward to taking many great pictures with this baño for a long time. It is very smooth when adjusting and helps to get good composition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 3,
          "Date": "2021-07-27T19:19:52.000Z",
          "Titre": "Superb service",
          "Contenu": "Excellent, trouble-free purchase from the Acratech website. My items was in stock, shipped quickly and Acratech kept me informed every step of the process via e-mail and text. I couldn't be more pleased with the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanner",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T14:57:02.000Z",
          "Titre": "Love the Panorama head",
          "Contenu": "Love the Panorama head. No slippage even with the 70-200. Only thing i don’t like is the leveling bubble is kinda hard to see. Having to pay an additional 160 dollars for a leveling base with the bubble on the side hurts. Other than that it’s an awesome product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill S",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T18:13:19.000Z",
          "Titre": "I bought the Acratech pano head and…",
          "Contenu": "I bought the Acratech pano head and leveling base.  Nice, solid pieces, easy to use and adjust.  They tighten down very nicely without much effort.  I don't need or want anything more than these and I expect to use them for years to come.  Definite 5 stars!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian A. Moore",
          "Nb_Reviews": 1,
          "Date": "2021-09-03T23:45:48.000Z",
          "Titre": "A FIve Star Company that Earns Every Star.",
          "Contenu": "The company has an excellent website for both shopping their available products and easy ordering online.  The product I ordered was shipped promptly, it was well packaged and arrived in a timely manner.  The product I ordered was exactly what I received.  Everything that was supposed to be included was in the box: the product itself, the tool and an adapter needed to attach the product.  The included information/instruction pamphlet was clear, concise and contained everything I wanted or needed to know regarding the operation of the product.  I would not hesitate to order from this company again or to recommend them to anyone wanting to purchase their products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter Mehmke",
          "Nb_Reviews": 4,
          "Date": "2023-10-16T20:59:42.000Z",
          "Titre": "The camera tripod plate works great for…",
          "Contenu": "The camera tripod plate works great for my R7 camera. I would highly recommend acratech plate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "frank",
          "Nb_Reviews": 6,
          "Date": "2023-09-07T22:45:30.000Z",
          "Titre": "top quality",
          "Contenu": "I own two of your wrenches ,which Iwas told are no longer made. These are works of art in my opinion . Ineeded a foot for the sonya7r3a with grip and you guys had one . It fits perfect, although not as beautiful as the wrench .it is made the same ,it exudes quality.Very satisfied.Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SM",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T05:26:05.000Z",
          "Titre": "Exactly What I Expected",
          "Contenu": "I have high expectations and this ball head exceeded them.  Extremely well made with high end materials and tactile controls make adjustments quick and precise. Easily supports my heavier lens setups.  Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Clark",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T15:18:54.000Z",
          "Titre": "Quality product",
          "Contenu": "This is a quality product through and through. Great materials, great construction, great fit and finish. Controls are smooth and responsive, not too tight not too loose, just perfect. I highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2021-01-04T22:15:27.000Z",
          "Titre": "Plates for Nikon D850 & D500",
          "Contenu": "Each specific plate fits my Nikon D850 & D500 and Acratech ball heads perfectly. The anterior lip prevents rotation and adds stability. Great plates for a fair price."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Carlos Marks",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T20:42:50.000Z",
          "Titre": "Thanks for hanging up.",
          "Contenu": "I called your company from Australia soon after receiving the ball head to say how much I liked it and the woman that answered the phone hung up on me. I didn't appreciate her response."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Manny Suriel",
          "Nb_Reviews": 3,
          "Date": "2021-04-26T17:27:30.000Z",
          "Titre": "Tripod leveling plate",
          "Contenu": "Received my 2nd order from Acratech a tripod leveling plate and it arrived fast considering that it traveled from their headquarters in California to my home in Spain. Acratech’s leveling plate is without a doubt one of the best in the market. Smooth in operation easy to operate and beautifully designed just like the rest of their products. If your looking for a top of the line leveling plate or tripod head I strongly recommend Acratech"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 4,
          "Date": "2022-09-27T16:51:44.000Z",
          "Titre": "Simply the Best!",
          "Contenu": "Great products.  Personal service.  I have an assortment of Acratech mounts, clamps, etc. that perform flawlessly, reliably, and simply. I never need to look elsewhere!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vic Wright",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T14:38:14.000Z",
          "Titre": "The products are amazing",
          "Contenu": "The products are amazing. I have used Acratech heads for about 20 years. The original Ultimate Ballhead still works like new and the GXP and Long Lense heads I just purchased are even better. The customer service is second to none. All the help you could ever need is just an email or phone call away. I am a customer for life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Morris",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T00:12:26.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Way better than a ball head. Combined with a compact leveling “bowl” type tripod (Leofoto) makes the most since for many photographic applications."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frans Jurgens",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T23:08:02.000Z",
          "Titre": "Heaton is right",
          "Contenu": "British landscape photographer Thomas Heaton is right: pair the Acratech Long Lens Head with a leveling base on a stable tripod. The result is quick and no-fuss camera setup, durable and immune-to-the-elements gear, and the joy of using one of the highest quality designed and manufactured photo tripod heads on the market."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Howard",
          "Nb_Reviews": 4,
          "Date": "2022-10-31T01:47:38.000Z",
          "Titre": "Love Acratech's People and Products",
          "Contenu": "Dealing with Acratech is always a pleasure. Call or email, I know I will be connecting with a true professional who will listen to my question and provide a complete and thoughtful response."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "David Simpson",
          "Nb_Reviews": 1,
          "Date": "2021-03-16T01:26:44.000Z",
          "Titre": "Tripod Head Levelling",
          "Contenu": "The product was delivered promptly and in good condition. I wanted the product to level the head of a non-systematic Manfrotto tripod. It is of excellent quality and works well and entirely as expected. I have a reasonably heavy Manfrotto N8 fluid head mounted on it and have had no trouble levelling the head. It compares reasonably well with my Gitzo/Manfrotto half bowl mounted on my Gitzo Systematic tripod with the Acratech Panning head, which I consider to be an excellent combination."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DUANE MARVIN",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T19:29:45.000Z",
          "Titre": "I appreciated Acratech's going the…",
          "Contenu": "I appreciated Acratech's going the extra mile in determining which QR plate would work properly on my camera. Excellent quality of the product, as are all Acratech products I have used to date."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Manny Suriel",
          "Nb_Reviews": 3,
          "Date": "2021-04-13T15:09:57.000Z",
          "Titre": "Acratech manufactures some of the best…",
          "Contenu": "Acratech manufactures some of the best tripod heads available in the market today. Material and quality is second to none, they are fast in shipping the orders and best of all they ship international which is important as I live in Spain. I strongly recommend Acratech for your Tripod heads and plate purchase needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffery DuBridge",
          "Nb_Reviews": 2,
          "Date": "2022-07-14T21:41:23.000Z",
          "Titre": "I have purchased lots of equipment from…",
          "Contenu": "I have purchased lots of equipment from Acratech, and have always enjoyed their ability to answer the phone AND answer any questions that I have. Everything they make is top quality and lasts!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Peters",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T13:35:19.000Z",
          "Titre": "⭐️⭐️⭐️⭐️⭐️Best Tripod Head Ever⭐️⭐️⭐️⭐️⭐️",
          "Contenu": "The extreme high quality of design and materials is matched by the amazingly quick turnaround delivery time! ACRATECH hit it out of the park and I plan to order a second tripod head in the coming weeks!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bruce Perin",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T17:33:43.000Z",
          "Titre": "Solid equipment functions well",
          "Contenu": "Solid equipment functions well.  Instructions could have been a little more detailed.  But I real like I can set tension on movement and the sturdy construction.  Very fast to level camera and it stays level"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 3,
          "Date": "2021-08-05T18:04:57.000Z",
          "Titre": "Acratech is the class of the industry…",
          "Contenu": "Acratech is the class of the industry -- superb products, exceptional support, fast shipping. Not inexpensive -- until you compare to other similarly priced photo products, then they are bargains that will last a lifetime plus. I highly recommend Acratech as the first place to go for camera and lens supports."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry L",
          "Nb_Reviews": 4,
          "Date": "2022-04-25T19:31:46.626Z",
          "Titre": "Buying direct from Acratech",
          "Contenu": "Buying direct from Acratech is always a positive experience. I had a quick question before placing the order. Called Acratech's number, got an answer, placed the order. Had the item two days later."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Sullivan",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T15:18:01.000Z",
          "Titre": "I bought the camera plate for mounting…",
          "Contenu": "I bought the camera plate for mounting a Hasselblad to my newly acquired (used) Arca Swiss Mono Ball head. It fit the camera and tripod perfectly. I will be buying more camera plates in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig L",
          "Nb_Reviews": 1,
          "Date": "2021-08-02T21:36:19.000Z",
          "Titre": "I'm a long time customer for a good reason…",
          "Contenu": "I'm a long time customer for a good reason. Acratech sells great US-made products that have never let me down. They arrive quickly and are well built and will last a lifetime."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard D",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T21:25:32.000Z",
          "Titre": "Quality Products and Service",
          "Contenu": "I purchased a GP Ballhead from Acratech a few years ago and through Texas heat and an Alaskan winter it has performed without fail, day after day and time after time. This December I added a couple lens plates. The plates perfectly fit, as expected, but also, the service was exceptional, especially in this blame Covid for delays world we are living in. When a company readily communicates with their customers both through their website and more importantly by phone, and is able to process and ship within hours on even small orders, I believe they are a company worth supporting. The products are superior in quality and design and their customer service, at least in my contacts with them, have been what others should be. And supporting American manufacturing makes it even better."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Beverley Tyler",
          "Nb_Reviews": 4,
          "Date": "2023-05-20T14:43:19.000Z",
          "Titre": "Friendly and knowledgable staff",
          "Contenu": "I spoke to an Acratech team member and discussed the best ball-head for what the kind of photography I do. Delivery next day. Fantastic!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Dake",
          "Nb_Reviews": 3,
          "Date": "2022-05-23T18:09:25.000Z",
          "Titre": "Excellent staff backing the best…",
          "Contenu": "Excellent staff backing the best products available. I have a tone arm that cost 14k for my record player. The engineering of the acratech product is on par with the tone arm!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert C",
          "Nb_Reviews": 6,
          "Date": "2021-02-22T21:32:22.000Z",
          "Titre": "The Acratech pano head system.",
          "Contenu": "The Acratech pano head, leveling base and nodal rail are the quality that I expected. Delivery was fast and efficient. I believe this will be a great addition to my photo kit and would recommend this setup as very straightforward and efficient. You can accurately  adjust for single level panoramas or multi level panos. There are % adjustment markings for both horizontal and vertical adjustments. I have not yet had the opportunity to test this new system but I am sure it will help me get great results.When I compared Acratech to other systems, Acratech is much more compact but still has all of the functionality needed. In addition this head will support heavy long lenses, and accommodate normal photo shooting as well.A great all around solution and highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Lantern",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T22:21:00.000Z",
          "Titre": "You guys have great products,,excellent…",
          "Contenu": "You guys have great products,,excellent customer service. I think I received my shipment in two days, of course I’m two states away but still it shipped fast,,,thank guys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harvey Meissner",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T23:13:37.000Z",
          "Titre": "This is my 2nd Acratech purchase",
          "Contenu": "This is my 2nd Acratech purchase, and as usual the quality and finish of the GXP Ball-head with Quick release lever is outstanding. It was well packed and arrived quickly. Acratech has another very satisfied customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2021-07-26T15:48:44.000Z",
          "Titre": "Absolutely first class",
          "Contenu": "Absolutely first class !  Beautifully made and a pleasure to use.  This panoramic head and nodal rail is as advertised and is now a permanent fixture on my tripod !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Boyce",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T20:43:36.000Z",
          "Titre": "Finest engineering in precision",
          "Contenu": "Finest engineering in precision.  Fits the application quite well. I always thought the best tripod heads came from Italy. Not the case."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-07-27T19:48:57.000Z",
          "Titre": "The Acratech Leveling base",
          "Contenu": "The Acratech Leveling base is an excellent piece of gear for your kit. Extremely well made and level bubble is nice size for older eyes."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Vicky Mansfield",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T07:02:14.000Z",
          "Titre": "Arcatech Long Lens 1160 Head",
          "Contenu": "Super fast delivery to the UK just customs slowed it down and the extra £90 they charged me but I couldn’t purchase this product anywhere else in the UK other than that all good will use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurence",
          "Nb_Reviews": 4,
          "Date": "2022-10-25T10:42:34.000Z",
          "Titre": "Lever Clamp",
          "Contenu": "Like all Acratech products, the lever clamp is elegantly designed and functionally a joy to use. Additionally, the company's high level of customer service matches the quality of their products."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Henry",
          "Nb_Reviews": 9,
          "Date": "2021-08-05T17:48:00.000Z",
          "Titre": "Professionals deserves Professionals",
          "Contenu": "Professionals deserves ProfessionalsI am long in the Art business and medium format cameras and lensesOnly a real masterclass can prevail and is suitable The Acratedh master ball-head participate in that level of professional  genius engineeringI recommend every prof to look at the Aratech Master ball head because it proves reality and durability besides the enormous flexibility in one concept Henry- HF ART ACADEMY SIWSS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David R",
          "Nb_Reviews": 2,
          "Date": "2021-08-12T03:24:25.000Z",
          "Titre": "Tripod head system",
          "Contenu": "This order was only a lens plate addition to my Acratech leveling base and tripod head. I received a quick answer on a product selection question and the fit and function is great."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Beneddette Bates",
          "Nb_Reviews": 3,
          "Date": "2022-04-22T07:56:31.884Z",
          "Titre": "Nice sturdy parts that are simple",
          "Contenu": "Nice sturdy parts that are simple to use and adjust. I don't need or want anything else, and I plan to use them for a long time. The ordering process was simple and straightforward, and the delivery was prompt."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Cathrine",
          "Nb_Reviews": 5,
          "Date": "2021-09-07T17:30:03.000Z",
          "Titre": "Excellent and swift delivery",
          "Contenu": "Excellent and swift delivery. I received the product in Norway after one week. I ordered a panoramic head and a leveling head. The quality and function is outstanding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mindy  Leeds",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T11:27:23.000Z",
          "Titre": "Great products and quality",
          "Contenu": "Great products and quality.  Own several ball heads and plates and have never had a problem with any of them. I highly recommend them to all photographers."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Raymond FAIRWEATHER",
          "Nb_Reviews": 5,
          "Date": "2021-02-18T16:33:37.000Z",
          "Titre": "Great products and service.",
          "Contenu": "Great products and service. Thanks for being a leader in the Photography world of getting things done. An absolutely essential company for great photos easily!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Flynn",
          "Nb_Reviews": 1,
          "Date": "2021-01-30T22:02:31.000Z",
          "Titre": "I've used the head for about a month…",
          "Contenu": "I've used the head for about a month and have totally enjoyed the quality and precision of the build. If we can ever travel again, I hope to take it on a month-long photo vacation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darlene",
          "Nb_Reviews": 7,
          "Date": "2023-04-03T08:35:52.000Z",
          "Titre": "The best-designed leveling base ever",
          "Contenu": "The best-designed leveling base ever. I used another well-known leveling base before the Acratech model but changed after trying a friend's Acratech. Ordering from their website was easy, and delivery was lightning-fast! Thank you, Acratech!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie Moger",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T21:32:46.000Z",
          "Titre": "No finer pano head",
          "Contenu": "There's no finer pano head. Love my Acratech. Delighted with the excellent service and the value for what I spent. You can buy many a cheaper head, but you'll wish you'd spent more wisely for an Acratech."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 5,
          "Date": "2021-03-03T02:02:11.000Z",
          "Titre": "This is one of those companies that you…",
          "Contenu": "This is one of those companies that you find through your acquaintances. They are the best and word of mouth definitely says that about them.  Their communication is wonderful, they get back with you quick. They answer questions with the right answers and then the products:  The absolute best.  I love the way my ball head was designed and how it handles my camera.  I photographed a SpaceX launch a couple of weeks ago and used my old head.  I was wondering why after just a few seconds exposure the stars were steaks. Then I realized the ball head was slowly dropping.  I received my new Acratech head and used it on the launch a couple of days ago.  I tightened the head but not too much force.  It held my heavy 400mm lens solid.  No slip, no movement.  I will never use another ball head except Acratech.  To me this next info makes a difference, they are made in good 'ol US of A!  As a Veteran, I love seeing high quality products made here at home.  I give them six stars."
        }
      ]
    }
  ]
}