{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "admincolumns.com",
      "Review": [
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:35:30.000Z",
          "Titre": "Fast and friendly help",
          "Contenu": "Super fast and friendly help (when it was user error / oversight). They create one of my “must-have” plugins."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "RR",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T12:07:10.000Z",
          "Titre": "Outstanding customer support—swift…",
          "Contenu": "Outstanding customer support—swift responses and effective solutions to address your concerns."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie Erickson",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T02:06:05.000Z",
          "Titre": "Amazing support!",
          "Contenu": "I had trouble with a strange glitch in the plugin. I recieved a very prompt response. After a couple exchanges it was determined that a different plugin caused the interference. The very next update fixed the problem and now it all works like a dream!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Glenn Langford",
          "Nb_Reviews": 10,
          "Date": "2023-09-27T09:51:58.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, saves a lot of time editing metadata in Wordpress. Had trouble with activation of Pro version, but support was excellent and solved the problem within 24 hrs."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Gavin Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T13:02:20.000Z",
          "Titre": "Great product BUT more importantly the…",
          "Contenu": "Great product BUT more importantly the support provided by the Admin Columns team is right up there with the best on the WordPress echosystem."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Elio Cremi",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T19:35:14.000Z",
          "Titre": "A great plugin",
          "Contenu": "Admin Columns Pro is really phenomenal. It was what I was looking for and I'm glad I found it. It is not difficult to use and does its work very well.The support is super fast and helpful.In short, I think I made a great purchase."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-04-04T08:49:45.000Z",
          "Titre": "This team run a great service",
          "Contenu": "This team run a great service. The plugin itself is top notch, invaluable in making the client admin of WordPress usable, and terrific for developers needing to customise data shown on the back end. But it is their customer service that really stands out. Knowledgeable, helpful team members with technical knowledge, speedy responses and a willingness to dive deep into the issue. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Calvo",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T18:21:34.000Z",
          "Titre": "Admin Columns is a \"must-have\" for any website that needs to be updated frequently!",
          "Contenu": "Admin Columns helps me update my website in a fraction of the time it would take without their plugin. I've been using it for years and didn't realize how helpful it was until my real estate listing plugin was updated and the new version was not compatible with Admin Columns. I immediately reached out to the support team with Admin Columns and within a day they responded and provided me with custom CSS code to make their plugin work with my other plugin. I'm a huge fan of their plugin!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonah West",
          "Nb_Reviews": 7,
          "Date": "2023-01-20T13:51:22.000Z",
          "Titre": "Must Use Tool For WordPress Admin Management",
          "Contenu": "This is one of my must use WordPress admin management plugins! It makes it super easy to manage all dashboard post type lists and columns - with the ability to add all built in fields, custom fields, inline & bulk editing (two KILLER features), and has fantastic integration with popular plugins like WooCommerce, ACF, Yoast and more. I've been using it for years and it keeps getting better and better! The UI is fantastic and easy to use, released and new features are frequent, and support is always friendly and helpful."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Aline Duchesne",
          "Nb_Reviews": 4,
          "Date": "2022-03-06T19:08:51.000Z",
          "Titre": "Admin Columns I cannot do without!",
          "Contenu": "Admin Columns is a plugin that I cannot do without. Used it for one year and when my license expired, I thought I could do without but I was so wrong and renewed with pleasure.When I did not have it, I found myself wasting so much time trying to sort, filter, organize, and frustrated that I could not do what I did before.Nothing better than a plugin or program that actually meets and exceeds expectations.This will be a forever plugin for me. Great job Tobias. You have gained a loyal customer."
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T03:10:39.000Z",
          "Titre": "Beyond Professional.",
          "Contenu": "I requested a cancellation and refund for a payment I (emphasis on the fact that it was me) forgot to cancel since I am no longer in need of the service, and to be perfectly honest, was expecting a much longer response time and more resistance regarding the refund. Even though it was over the Christmas holidays, the response came in a matter of days and the refund was promptly issued! Blown away! Amazing customer service. Thank you, Stefan."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Elron B",
          "Nb_Reviews": 10,
          "Date": "2022-11-20T00:24:26.000Z",
          "Titre": "Surprisingly intiative!",
          "Contenu": "Surprisingly intiative!I purchased and installed, and the site was up and running easily. In below 30 minutes, I could send my client the admin panel. How easy!!!I'm a big fan of ACF and I see that he recommended Admin Columns, and I'm happy for that :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andre",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T19:48:19.000Z",
          "Titre": "Admin Columns Support is EXCEPTIONAL",
          "Contenu": "Admin Columns is a great plugin and their support is exceptional. I had a puzzling and complex issue and they had it resolved in 1 business day, with quick replies throughout and an elegant solution. The plugin is high quality and it's backed by a top shelf team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "brandonjp",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T18:53:23.000Z",
          "Titre": "Truly high quality & worth the price!",
          "Contenu": "Admin Columns is truly a pro-level quality plugin. Well worth the subscription price. I've rarely needed support, but when I have, their team has been quick to respond via email to fix issues/bugs. I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2021-10-20T17:17:56.000Z",
          "Titre": "Superb Premium Plug & Superb Support",
          "Contenu": "If you use Wordpress with a large amount of posts or custom post types/custom fields. This plugin is a godsend. Even just the 'sticky headers' feature helps you browse the admin area for posts quickly and saves countless time scrolling up and down.The ability to customize is amazing, you can do filters, show custom columns and pretty much display your data to your liking from jobs, accounts, blog posts or magical unicons, you can get your columns working for pretty much any scenario. I use it for my basic blog posts to more advanced data and it just works. I recently had an issue (the only issue really) with the sticky headers breaking the CSS. Stefan couldn't reproduce the issue so took the extra step to login and figure it out and did so in under 2 days (mostly back and forth via emails, the solving was fast). This level of support is what motivated me to come here and leave a review."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Devon Strang",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T15:23:44.000Z",
          "Titre": "Game changing if you deal with a lot of fields and posts",
          "Contenu": "Admin Columns makes my life much easier. Used it on a project many years ago and happy to have the opportunity to use it again. It can transform your Wordpress experience if you are dealing with a lot of custom fields and a lot of posts."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Daniel Boutet",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T00:00:59.000Z",
          "Titre": "Time saver!",
          "Contenu": "Probably the ideal solution for quickly managing a large number of files; in my case, managing images in the media library. I highly recommend it!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-04-17T18:16:37.000Z",
          "Titre": "One of the best WP plugins I have ever used.",
          "Contenu": "This is an incredible plugin that I wish I had discovered long ago. It is so much easier for me to manage a large content website now that I have total control of the back end post and page lists. The support team was also responsive and very helpful. One of the best WP plugins I have ever used!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Schoellen",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T15:13:55.000Z",
          "Titre": "Stefan Is The Man!",
          "Contenu": "Stefan was prompt, very helpful, and managed to tackle all of my needs with the highest level of customer satisfaction in mind. I typically don't leave feedback like this, but I couldn't help myself here. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MCsReviewsUK",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T10:53:18.000Z",
          "Titre": "Speedy, thoughtful, human",
          "Contenu": "Speedy, thoughtful and human response to my random query, from a company that clearly cares about its current and potential customers.  Admin Columns have a reputation for good customer service and I was certainly not disappointed from this first touchpoint - they very much seem to be a firm you can trust."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scot Giambalvo",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T15:37:29.000Z",
          "Titre": "Admin Columns PRO - Beyond Exceptional",
          "Contenu": "Beyond the fact that Admin Columns is an essential tool for web professionals that want to maximize their productivity, the support is exemplary. Stefan has created a brilliant tool, with essential addons, and offers it for a fair price. I would NOT hesitate to recommend Admin Columns PRO over the free version and consider it one of my top five admin interface management tools."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "ubyte.dev",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T18:52:34.000Z",
          "Titre": "I run a very extensive website where I…",
          "Contenu": "I run a very extensive website where I constantly need to update various fields, and opening each post for that became VERY repetitive.The inline editing feature is 100% a lifesaver."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "jaiwebs",
          "Nb_Reviews": 7,
          "Date": "2021-10-29T20:11:10.000Z",
          "Titre": "Absolutely ideal.",
          "Contenu": "I started to write some code to create this functionality on a website. I soon realised that it was going to take me a long time. So I had a look around and tried this plugin out.It does more than I had set out to do and opened up new ideas for the website.Absolutely ideal."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Beejer",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T16:33:35.000Z",
          "Titre": "An almost perfect plugin",
          "Contenu": "An almost perfect plugin. I love using it. If something is not perfect, their support is quick to respond. The price is on the high end for a subscription I think."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Nestore Novati",
          "Nb_Reviews": 5,
          "Date": "2022-09-08T14:08:24.000Z",
          "Titre": "Must have for sites with lot of content",
          "Contenu": "This is one of the most useful WordPress plugins for managing websites with lot of posts (thousands) without problems.I always used the free version, but recently I switched to the Pro, for additional functionalities like inline editing, advanced filtering and other options only available in the Pro version: it is a game changer!If you need to check and reorganize hundreds or thousands posts (after a migration, heavy modification or massive import of data), it really saves you A LOT of working hours.If you need to modify the admin interface for your client, this plugin + Admin Menu Editor Pro (another backend plugin I love) together allow to customize the interface for your client requirements.Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "email noreply",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T13:15:31.000Z",
          "Titre": "This plugin is excellent",
          "Contenu": "This plugin is excellent. Other thing I am much impressed is good support. It's like cherry on the cake meaning"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "karim",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T15:39:48.000Z",
          "Titre": "Great Plugin to manage your content easily",
          "Contenu": "Thanks for your great plugin i have pro version since 2018 and it made me manage my website content very easy (: (:"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rikin Shah",
          "Nb_Reviews": 2,
          "Date": "2022-02-16T11:31:25.000Z",
          "Titre": "Fantastic product",
          "Contenu": "Fantastic product.  It's not cheap, but the efficiency it brings you (even more so if you use ACF and/or Custom Post Types) is well worth the cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Linstedt",
          "Nb_Reviews": 2,
          "Date": "2021-10-22T12:37:22.000Z",
          "Titre": "Support has been stellar",
          "Contenu": "Support has been stellar - always timely, always precise.  The product operates flawlessly, I use ACF and wooCommerce and a GravityForms, and AdminColumns lets me control all that I see, export, sort, and edit.  Amazing plugin for an administrator.  I'd recommend this solid product to anyone looking to enhance their administrative experiences."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Anderson",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T11:13:02.000Z",
          "Titre": "Absolutely awesome customer service!",
          "Contenu": "Absolutely awesome customer service.  I think Stefan broke the record on turnaround time.  And, truly a \"Happiness Engineer.\"  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Langlois",
          "Nb_Reviews": 4,
          "Date": "2022-04-30T20:01:50.000Z",
          "Titre": "This product brings remarkable…",
          "Contenu": "This product brings remarkable enhancements to ACF users managing back-end editing.  The detailed tutorials are an added bonus."
        },
        {
          "Note": 5,
          "Lieu": "SI",
          "Pseudo": "Špela Golob",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T08:41:25.000Z",
          "Titre": "Phenomenal customer support",
          "Contenu": "Phenomenal customer support. Kind, helpful and fast. Thank you! Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert Andrews",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T19:33:39.000Z",
          "Titre": "Great product.",
          "Contenu": "Stefan is very helpful.Admin Columns Pro is a great, flexible tool that can make admin lists much more browsable."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Ton van der Valk",
          "Nb_Reviews": 3,
          "Date": "2022-06-13T11:00:32.000Z",
          "Titre": "Support was great",
          "Contenu": "Support was great, giving some advice and explaining to me what went wrong with my code. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albany Med Health System",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T15:49:36.000Z",
          "Titre": "Great Client Support",
          "Contenu": "Stefan was quick to reply our question, professional and courteous in his approach, and knowledgeable about the product and its interaction with our website."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Vitali Marquart",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T17:29:11.000Z",
          "Titre": "Had an issue",
          "Contenu": "Had an issue, reported to dev, after 13 mintues i got a reply with a fix.this is called \"best support\".best work guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Etgen",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T15:39:24.000Z",
          "Titre": "Fast response and good answer",
          "Contenu": "Fast response (given it was a question from a prospective customer), and the answer was exactly what I wanted to hear!"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Threads of Life Textiles",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T10:06:20.000Z",
          "Titre": "Billing question promptly responded to",
          "Contenu": "I had a billing question and it was answered immediately and refunded in full."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kev Foulds",
          "Nb_Reviews": 12,
          "Date": "2023-02-22T15:52:58.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent. Sorted out the problem that I was having on the same day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T18:28:28.000Z",
          "Titre": "Top-notch customer service",
          "Contenu": "Answered everything I asked, and even provided a temporary work-around to help."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "TempoBill Zeiterfassung",
          "Nb_Reviews": 2,
          "Date": "2023-01-16T18:02:44.000Z",
          "Titre": "Competent and fast help with a problem…",
          "Contenu": "Competent and fast help with a problem that has occured after installation."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ben Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:48:08.000Z",
          "Titre": "Excellent plugin",
          "Contenu": "Excellent plugin, excellent support - would recommend"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ramin Fleckner",
          "Nb_Reviews": 3,
          "Date": "2022-08-03T15:38:15.000Z",
          "Titre": "Great support",
          "Contenu": "Great support, quick and problem solving"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Kristinardottir",
          "Nb_Reviews": 11,
          "Date": "2022-06-06T19:06:01.000Z",
          "Titre": "Excellent work on the features",
          "Contenu": "Excellent work on the features. Bravo!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Michael Ghelfi - RPG Ambiences",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T14:34:00.000Z",
          "Titre": "Very good support and high quality product",
          "Contenu": "Very good support and high quality product."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Maya Nikolova",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T12:12:55.000Z",
          "Titre": "Love the product",
          "Contenu": "Love the product, makes managing post types so much easier. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ColBill",
          "Nb_Reviews": 2,
          "Date": "2023-04-18T20:46:25.000Z",
          "Titre": "Great support",
          "Contenu": "Don’t know what we would do without this plugin. Over 9,000 posts on the site."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Bellul",
          "Nb_Reviews": 1,
          "Date": "2021-10-30T13:41:35.000Z",
          "Titre": "Very useful plugin and good support!"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Roger",
          "Nb_Reviews": 6,
          "Date": "2021-12-10T02:48:24.000Z",
          "Titre": "One of the most valuable plugins there…",
          "Contenu": "One of the most valuable plugins there is.."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "websplash",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T08:37:43.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, helpful support."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Clemens",
          "Nb_Reviews": 3,
          "Date": "2022-07-25T14:53:32.000Z",
          "Titre": "Fast support",
          "Contenu": "Very fast and helpful support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Cross",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T20:53:49.000Z",
          "Titre": "Very helpful feedback and responses"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diana Sachs-Silveira",
          "Nb_Reviews": 2,
          "Date": "2022-11-15T17:19:31.000Z",
          "Titre": "Great plugin and great support"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Siegfried",
          "Nb_Reviews": 3,
          "Date": "2023-08-23T18:25:16.000Z",
          "Titre": "very helpful"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Georgia",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T15:35:42.000Z",
          "Titre": "Excellent & Immediate Support",
          "Contenu": "Excellent & Immediate Support! Awesome Plugin! Easy to use and begginer friendly options"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gwenette Writer Sinclair",
          "Nb_Reviews": 3,
          "Date": "2022-04-06T17:42:57.000Z",
          "Titre": "Excellent plugin with fast",
          "Contenu": "Excellent plugin with fast, friendly support!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Pat Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T20:09:18.000Z",
          "Titre": "Fantastic service and brilliant…",
          "Contenu": "Fantastic service and brilliant product. Great customer support. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Vicki",
          "Nb_Reviews": 3,
          "Date": "2021-11-23T07:42:35.000Z",
          "Titre": "Sooooooooooooooo useful!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "meet mehta",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T11:21:20.000Z",
          "Titre": "Great",
          "Contenu": "GreatThank you for the quick reply. Hope to see that update soon."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "kk",
          "Nb_Reviews": 7,
          "Date": "2023-06-28T12:49:38.000Z",
          "Titre": "good product and pristine support"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Reinhard Jung",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T10:30:34.000Z",
          "Titre": "Best ever with great Support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Mangold",
          "Nb_Reviews": 1,
          "Date": "2022-01-28T18:39:57.000Z",
          "Titre": "Fast and friendly response."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G.Z.",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T03:05:53.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service. Great plugin."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "VivaWeb",
          "Nb_Reviews": 3,
          "Date": "2023-04-28T13:29:28.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent, really useful and efficient"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "ETOC Tehnic",
          "Nb_Reviews": 2,
          "Date": "2023-08-26T10:33:25.000Z",
          "Titre": "Fast and professional"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "David Henry",
          "Nb_Reviews": 10,
          "Date": "2023-04-27T11:34:40.000Z",
          "Titre": "Excellect plugin and support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Kellaway",
          "Nb_Reviews": 5,
          "Date": "2022-07-25T19:30:09.000Z",
          "Titre": "fast and too the point"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Siegfried",
          "Nb_Reviews": 4,
          "Date": "2023-10-03T12:16:00.000Z",
          "Titre": "excellent support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe G",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T18:19:06.000Z",
          "Titre": "Wow great job",
          "Contenu": "Wow! Well done."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Kobotolo - Webbutveckling Kari",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T17:06:04.000Z",
          "Titre": "Excellent support."
        }
      ]
    }
  ]
}