{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "altairtech.io",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SEAN PARRISH",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T08:40:08.000Z",
          "Titre": "The description for the control board I…",
          "Contenu": "The description for the control board I ordered listed an S19a as one of the models that this board would replace. The board itself looks exactly like the original with exception of two of the connectors. Board was a bit pricey to begin with and it took an entire week to get here because you use USPS. Now I have to solder, thanks a lot."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mario Balderrama",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T02:27:03.000Z",
          "Titre": "I buy a whatsminer m30s",
          "Contenu": "I buy a whatsminer m30s and They delivered late when I paid extra money for fast shipping, the machine was all dirty and it came without the power cable,so I can't test if it works, just terrible I buy before with them a terminus r909 and everything when perfect that time i don't know what happened this time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ant",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T19:56:12.000Z",
          "Titre": "Great seller",
          "Contenu": "Great seller, shipped item pretty quickly item was packed very well. I wish they had required signature because FedEx left my electronic package out in the rain but that's not the sellers fault. Will definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. Bryce Guy",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:29:48.000Z",
          "Titre": "Perfect- Altair Tech hooks it up again!",
          "Contenu": "Perfect- Altair Tech hooks it up again!Prompt, polite, and professional- these guys make buying mining equipment easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernest Cobarrubias",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T02:05:25.000Z",
          "Titre": "I am so glad I found you guys",
          "Contenu": "I am so glad I found you guys. Your tech support team help me verify the part I needed for my miner and with the quick shipping I’m back online making money."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Anthony Stubbs",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:24:48.000Z",
          "Titre": "Wonderful team at Altair!!",
          "Contenu": "Wonderful team at Altair. Assisted me in get the miners on racks in a timely manner even with delays from the wholesaler. This is the team you want to work with to get the job done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley K.",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:26:17.000Z",
          "Titre": "Above and beyond customer service",
          "Contenu": "I’m very impressed with the customers service these folks provide. Same day shipping after questions I had were completely answered that morning. I’d remand these guys above any other provider. Great job guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Cooperman",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T04:51:21.000Z",
          "Titre": "Altair is fantastifc.",
          "Contenu": "I've ordered mining equipment from a handful of vendors, globally, over the past few years and will say that there is a broad range of service one may get purchasing this sort of equipment. Over the past few months as I have been building out a new mining facility, I decided to use Altair after some positive experiences with their eBay store for smaller asics and I am very glad I did. My point of contact was a Aviral Shukla, who has gone above and beyond to make this process easy. For perspective - I purchased about $35,000 of equipment from them. When I've dealt with some other distributors, as soon as they have the cash in hand you get second-rate service. NOT WITH ALTAIR! Turned out that 1 of my machines was DOA - and because of a delay in L6-30 Receptacles at my local electrical supply house, I was just outside of the 2 week Altair warranty, but Aviral offered to exchange the unit - basically no questions asked regardless. More businesses with integrity, like Altair, will help to give the crypto-space a more positive rep.Altair - thank you for all that you do for the mining community! I will, forever, be a loyal customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Some Dude",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T00:20:00.000Z",
          "Titre": "Stealth Miner packaging",
          "Contenu": "Thanks for packing the stealth miner with support. Some feedback:  It didn’t bother me but 2 of 4 feet plugs were loose in box, easy to put together but might consider putting them in bag and then maybe also include a one pager for setting up the stealth miner and the default password."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "rewolf",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:57:10.000Z",
          "Titre": "The device worked out of the box",
          "Contenu": "The device worked out of the box. Setup instructions were easy to follow. There was some discrepancy in the screenshot from the actual UI when setting up wifi etc. but I forgot the specifics. I was a bit confused about the “extender/repeater” config options presented. Disabled them.But yeah it all works great. Also, the order processing and shipping was so fast !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WillieB",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:10:22.000Z",
          "Titre": "Great communication!!",
          "Contenu": "Great communication throughout the whole ordering process. Top notch service for US!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ibrahim Al-Warthan",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T18:37:23.000Z",
          "Titre": "Great service and prices",
          "Contenu": "Great service and prices, amazing customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rand Childs",
          "Nb_Reviews": 5,
          "Date": "2023-10-31T15:16:53.000Z",
          "Titre": "Wonderful Customer Service",
          "Contenu": "Wonderful Customer ServiceI had to call customer service due to a shipping issue and they took great care of me.  Immediately solving the issue and getting the equipment I ordered to me as soon as they could.  One of the best I've every dealt with and their prices that I've seen are reasonable if not less expensive that other companies.  Would highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jordan Justice",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T13:01:37.000Z",
          "Titre": "Proved Wrong - Nicely Done!",
          "Contenu": "I was slightly skeptical ordering from this company as I heard about them via a YouTube Promoter and decided to give them a shot seeing they were a distributor based out of Missouri (American Company). Excellent service and communication. Timely shipping updates and so on. Would definitely purchase from them again. Keep up the outstanding work!"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Antony Paloubis",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T12:54:25.000Z",
          "Titre": "Super Fast Shipping with DDP ✅✅✅✅✅"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Schroeder",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T06:51:01.000Z",
          "Titre": "Prompt service",
          "Contenu": "Prompt service. Answered questions that didn't pertain to the miner I purchased."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-10-11T03:57:02.000Z",
          "Titre": "Highly recommended",
          "Contenu": "Their online support team was awesome! Very knowledgeable, and took the time to do some out the nor research for me when I needed some specific measurements. High recommended and I haven't even installed the control board and fw yet. I'm sure that will blow my socks off too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T07:44:32.000Z",
          "Titre": "The ONLY place I will buy from now!!",
          "Contenu": "This was first experience purchasing from Altair Tech. What took my eye was their pricing waxed everyone else’s by far! I purchased a S19K PRO with the ePIC UMC. I wasn’t expecting Altair to contact me to ask if I wanted the UMC installed! No other supplier has ever took the time to ask if I wanted a control board installed that I’ve purchased. That aside from the great pricing was already more than I’ve received from another supplier in the past. Not to mention EXTREMELY FAST shipping. The S19K PRO performed better than expected with 122TH @ 2762watts on a 24hr average in 87 degrees. GREAT! GREAT seller! I couldn’t ask for a better experience! So much that I typically never write reviews but Altair definitely deserves it. Once I got the miner hooked up I ordered another S19K PRO ePIC UMC and a PDU. GREAT COMPANY AND SUPPORTS USA JOBS AS WELL!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Burgess",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T04:33:36.000Z",
          "Titre": "Easy ordering system and quick fulfillment",
          "Contenu": "Stumbled across this site from a youtube referral and called the company. Wow. Great conversation and placed my order. Easy order system allowing several forms of payment options. Quick delivery and super pricing too! I became a repeat customer."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T18:45:33.000Z",
          "Titre": "I had a great experience",
          "Contenu": "I had a great experience, the products ordered were exactly as described and arrived very quickly considering I'm in Canada. The support offered great suggestions and pointed out something I hadn't thought of. Overall amazing experience! A vendor like this is a breath of fresh air in this space"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Los",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T22:13:49.000Z",
          "Titre": "Great service and prices",
          "Contenu": "Great prices, very fast shipping. I chatted with customer support when I had a question and they answered all my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Romine",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:28:59.000Z",
          "Titre": "Good customer support",
          "Contenu": "Good customer support, and shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel Berdecia",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T12:42:38.000Z",
          "Titre": "Arawak Enterprise",
          "Contenu": "Well I learned a lot of growth well handling managing and taking chances life is always about taking chances right"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Bruno",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T11:51:30.000Z",
          "Titre": "Fast Delivery + Great Customer Support",
          "Contenu": "A Very Fast Delivery that took 3 days .Amazing Customer Support i recommend  5 stars"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin Seward",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T15:27:13.000Z",
          "Titre": "I highly recommend!",
          "Contenu": "Well, the gekko miner came as promised. But the customer support was incredible. I’m very new to mining and needed a lot of guidance. The Altair admin made sure my miner was working and spent as much time with me as needed to get it operating.I really appreciate companies that care about their customer’s experience and this is evident with Altair! I highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Tim Zachow",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T20:41:44.000Z",
          "Titre": "Highly reliable and great dedication to meet full satisfaction",
          "Contenu": "I worked now very successfully through a couple of deals with Aviral, the owner of Altair. His business values align very well with ours, and he is a pleasure to work with!Due to their highly reliable and fast shipping, I decided to engage in further business and would highly recommend Altair's services to anybody else!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JCMining",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T16:51:16.000Z",
          "Titre": "Top tier",
          "Contenu": "Great packaging Great communication and even went above and beyond when I needed help. Definitely a seller I will buy from again -I already have :).  Definitely recommend this seller! Honestly can’t say enough about the quality packaging- it’s been a long long time since I have seen this great of quality- probably one of the best places packaging even compared to the major companies. Top tier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alonzo Jewett",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:20:12.000Z",
          "Titre": "Fast good communication would…",
          "Contenu": "Fast good communication would definitely deal with again.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RICHARD SMITH",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T03:05:02.000Z",
          "Titre": "The purchase of my Gekko R909 miner was…Very Good",
          "Contenu": "The purchase of my Gekko R909 miner was quick and easy. I did have some trouble setting up the cgminer on my RaspberryPi. I don't know much about Linux/Debian, you know, ssh-ing and all that stuff, Mine is a headless Rpi. I talked with Avaril on chat and he was right there to answer my questions and helped me through my problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T23:31:34.000Z",
          "Titre": "Trustworthy Reseller",
          "Contenu": "I’m in the US.  I paid via bank wire and they shipped the next business day when it cleared. It arrived in 2 business days because they had it in stock in the US. They put the antminer box in an unmarked box for shipping and the antminer box appeared to be unopened. The miner arrived in perfect shape.  It is brand new and works perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Miller",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T23:37:57.000Z",
          "Titre": "Aviral loves what he does and that is…",
          "Contenu": "Aviral loves what he does and that is why he is successful and makes such an impact for his customers.  He not only helped me with my troubleshooting, but he taught me things I never knew.  He is teaching while helping you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Craig S",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T03:27:22.000Z",
          "Titre": "Never known a customer experience to compare.",
          "Contenu": "Altair have been fantastic from start to finish. Starting with parts working up to miners. Their customer service knows no bounds. This space can be full of people after your money/crypto. Altair on multiple occasions stopped me buying things from their own site and have explained to me for hours how i can achieve the same result for free. Where else would you get that? Reach out to them if your thinking of anything related to what they sell, they will be honest, answer all your concerns, and even then are still the cheapest you can find. I am a customer of theirs for my life within crypto and would also go a step further and say a crypto friend! Fantastic service, A********"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MrB",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T22:06:31.000Z",
          "Titre": "Amazing Service and Prices",
          "Contenu": "They took the time to answer all my questions, with a very high degree of knowledge and didn't try to up sell.  Their prices and shipping charges are the most reasonable I've seen in an industry that's full of scalpers.  These folks were great to work with."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Joel Morris",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T05:23:37.000Z",
          "Titre": "Very good customer service",
          "Contenu": "Very good customer service. They got back to me almost right away and told me exactly what I need to know. Definitely recommend them for purchases customer service all the above."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lou",
          "Nb_Reviews": 3,
          "Date": "2023-01-24T01:42:35.000Z",
          "Titre": "Great Support",
          "Contenu": "Purchased a control board at a fair price.  It came quickly and exactly as advertised. I've received great support since then, too - as it turns out the miner I put this in is a but of an unusual model.  I'll consider Altair first for all my mining needs in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T22:30:41.000Z",
          "Titre": "great company",
          "Contenu": "great company, no issues with fast delivery! Hope they carry more miners in the future!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jose viveiros",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T02:10:18.000Z",
          "Titre": "Fast delivery and very friendly support",
          "Contenu": "I'm happy with the quick delivery and when I needed to know a few things about the device, the support team to check it was friendly and answered my questions. Thanks to support again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fritz",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T22:51:27.000Z",
          "Titre": "Altair is an outstanding company with…",
          "Contenu": "Altair is an outstanding company with great service! I am local to ST. Louis and have purchased from Altair several times for different mining equipment. It's great to find a high quality, dependable company within the crypto industry! I would absolutely recommend Altair!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "stephen albo",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T22:21:13.000Z",
          "Titre": "Amazing amazing Amazing I had a little…",
          "Contenu": "Amazing amazing Amazing I had a little bit of trouble with my product when I received it and aviral  Was kind enough to stay on the phone with me for hours trying to rectify the situation. Leaving a review is not something I do very often but I cannot express how amazing the customer Service was that I received. These guys deserve a 10 star review seriously"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BKL",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T04:56:33.000Z",
          "Titre": "Great communication and faster than…",
          "Contenu": "Great communication and faster than promised shipping.  I had some questions after delivery and they responded faster (and more accurately) than the manufacturer."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "HAYTHAM A A AL FAYOUMI",
          "Nb_Reviews": 8,
          "Date": "2023-06-04T23:10:37.000Z",
          "Titre": "Awesome Awesome customer service",
          "Contenu": "Awesome Awesome customer service, following up with the customer with Great knowledge of their product such amazing experience I felt here! So good after purchasing the product service follow up so kind and professional. Just ultimate ultimate and grateful to the team at Altairtech.io"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JP",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T05:45:56.000Z",
          "Titre": "Excellent service",
          "Contenu": "The package arrived really fast and included a new I/O backplate to fit the new control board I ordered for my S19j pro with Amlogic. I didnt know that backplate was included so I was really happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Lluberes",
          "Nb_Reviews": 2,
          "Date": "2023-03-15T01:39:00.000Z",
          "Titre": "Fair prices",
          "Contenu": "Fair prices, fast ship times, and no problems with the installation. I would definitely use your team again for future Bitcoin ASIC needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erik Hagen",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T06:29:03.000Z",
          "Titre": "I First found them on eBay",
          "Contenu": "I First found them on eBay was looking for gekkoscience 8 port usb hub due to like 4 other sites I know of that sell them where out of stock. They where a little higher then other sites made offer on eBay but then found on Amazon for $25 less so bought it there. Then seen they had AltairTech.io IglooHat- GekkoScience Base Hub active cooler on eBay for $59.99 made offer got it for end up getting it $55.00 also is the first one I ever seen and works amazing have my compac F’s over clocked at 600 MHz and they are cool as can be. Then I was looking all over internet for 120 Watt DC Power Supply, 12V, 10A, 6 Pin PCIe connector for gekkoscience R909 could find anywhere so I was like wonder if that company I bought from on eBay earlier tonight got it found there webpage and yes they had it. So now I bought 2 items from them in one night one item I never seen other couldn’t find anywhere. Then looking through there website was like wow the information they provide with some of products gekkoscience to be exact they had more information then I seen on multiple websites or have found on the internet was very impressed with that like overclocking setting up etc.. very detailed I haven’t seen that much information on gekkoscience anywhere else . I have ordered gekkoscience products from like 5 other companies and they blow them all away !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Gray",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T20:39:56.000Z",
          "Titre": "Phenomenal customer service",
          "Contenu": "Phenomenal customer service! Extremely helpful and willing to hold my hand along the way.  These guys are a resource and I will be ordering from them in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D. M.",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T12:03:35.000Z",
          "Titre": "Very fast service",
          "Contenu": "Very fast service,  Altair exceeded my expectations with my order. Everything was packaged well and arrived in great shape."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FMS",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T19:06:53.000Z",
          "Titre": "The customer service was amazing &…",
          "Contenu": "The customer service was amazing & personal. The part arrived quickly and in good order and made the repairs easy and convenient. Thank you team at Altair!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Travis",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T20:52:14.000Z",
          "Titre": "Aviral was very generous to upgrade me…",
          "Contenu": "Aviral was very generous to upgrade me to a higher TH machine when the one I ordered was out of stock. Fast shipping and great to work with! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Rivera",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T14:53:12.000Z",
          "Titre": "I love it but how can I buy bitcoin?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Peters",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T03:59:42.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service.  I received the control board quickly and they helped with the firmware as well.  I definitely would buy from again."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Marian Radulescu Agarici",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T08:20:25.000Z",
          "Titre": "Altair can help you",
          "Contenu": "Original parts of any stuff.Fast delivering but very expensive with DHL.Aniway trusted vendor"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Heisreal",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T21:47:42.000Z",
          "Titre": "Best Vendor Ever",
          "Contenu": "Knowledgeable, helpful, quick to respond, quick to ship, order complete, bonus items. Would buy again and recommend to friends"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gm Gm",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T20:22:39.000Z",
          "Titre": "Exceptional",
          "Contenu": "My experience with this company has been nothing short of exceptional.From the moment I placed my order, I was impressed with the level of customer service I received. The team at Altair Tech was extremely attentive and made sure I had all the information I needed to make an informed decision. They were patient in answering all my questions and made sure I had the right products to meet my needs.The team at Altair Tech was with me every step of the way, providing guidance and support to make sure everything was set up correctly. They even helped troubleshoot some minor issues I encountered, and their expertise was invaluable.Throughout the entire process, the customer service team was incredibly responsive. They were always available to answer my questions and provide support when I needed it. The chat and support channels were very helpful and allowed me to get the assistance I needed quickly and easily.In addition to the excellent customer service, I was also impressed by the fast shipping. My order arrived sooner than I expected.Overall, I cannot recommend Altair Tech enough. Their customer service is truly exceptional, and their personal attention and responsiveness made my experience a pleasure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Green Mine Group",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T20:28:20.000Z",
          "Titre": "Legit customer service",
          "Contenu": "Legit customer service.  Had a little confusion with the product. But they were responsive of my email and called right away to trouble shoot with me. Def will order thru them again.  Cheers thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T03:07:12.000Z",
          "Titre": "Outstanding service level and…",
          "Contenu": "Outstanding service level and attention.Quick response and follow-up for text message questions. Order confirmation, detailed invoicing (including tracking, and serial number), process updates, and shipping status. Shipped the same day, just 1 hour after placing the order. Impressive order management system. An all-around excellent customer experience that helps establish confidence and trust after a first-time order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Shindel",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T16:56:26.000Z",
          "Titre": "My experience was excellent",
          "Contenu": "My experience was excellent. My questions were answered and there was no effort to try and rush through and move on."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Andreas Adamidis",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T19:32:32.000Z",
          "Titre": "i dont have words for the",
          "Contenu": "i dont have words for the big help,thank you all and i hope to the future we work togethet with this super people !!!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Ulisses Cordas",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T22:14:12.000Z",
          "Titre": "Thank you",
          "Contenu": "All seems in perfect condition, very good packaging, but haven't tried it yet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billy e",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T22:45:51.000Z",
          "Titre": "Killer customer support!",
          "Contenu": "These guys walked me through some issues I was having with miner control boards that turned out to not be related to the equipment they sold me at all. THanks a ton Altair! Cheers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trent Rowles",
          "Nb_Reviews": 1,
          "Date": "2022-04-24T05:30:38.693Z",
          "Titre": "Freaky fast shipping",
          "Contenu": "Bought a few control boards and splitter cables from them. The items are high quality but the best part was superfast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T05:55:25.000Z",
          "Titre": "Helpful and answered my questions and…",
          "Contenu": "Helpful and answered my questions and shipping was fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bj",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T16:39:36.000Z",
          "Titre": "Great customer service and very fast to…",
          "Contenu": "Great customer service and very fast to responde and ship. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Genio",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T14:44:44.000Z",
          "Titre": "Superb!",
          "Contenu": "Very good, fast and friendly customer support.Great company with solid products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ralph Schultz IV",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T18:03:28.000Z",
          "Titre": "antminer s19k pro",
          "Contenu": "fast shipping, good pricing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Smith",
          "Nb_Reviews": 2,
          "Date": "2022-06-14T16:05:30.000Z",
          "Titre": "Ordered a PDU from them and it arrived…",
          "Contenu": "Ordered a PDU from them and it arrived extremely quickly!  I have not had a chance to install it yet, but I was very impressed with the speed of shipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Just Shilln",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T16:45:14.000Z",
          "Titre": "The Company is amazing!!!",
          "Contenu": "The Company is amazing!!!! If you have any questions, they reply ASAP. Also the items ship quick! The company has earned my business and I am here to stay!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn Mullaney",
          "Nb_Reviews": 2,
          "Date": "2023-02-07T03:37:07.000Z",
          "Titre": "Shipped fast and working PSUs",
          "Contenu": "These shipped quickly and had no issues installing them into broken miners."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T21:45:05.000Z",
          "Titre": "Gekko ASICs",
          "Contenu": "Great customer service & fast shipping with updates. Products packaged exceptionally well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Logan ONeill",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T02:20:07.000Z",
          "Titre": "Lots of payment options and fast…",
          "Contenu": "Lots of payment options and fast shipping. Excllent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Werline",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T23:14:33.000Z",
          "Titre": "Quick shipping",
          "Contenu": "Quick shipping, product worked exactly as it should when installed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonio H",
          "Nb_Reviews": 7,
          "Date": "2023-07-12T05:07:22.000Z",
          "Titre": "Lovely product",
          "Contenu": "Lovely product. I was so happy to receive my Gekko Science Bitcoin miner!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julius Smith",
          "Nb_Reviews": 3,
          "Date": "2023-08-17T00:16:10.000Z",
          "Titre": "Good Transaction",
          "Contenu": "The process was streamlined and the shipping was quick."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Chris",
          "Nb_Reviews": 7,
          "Date": "2023-11-24T00:10:24.000Z",
          "Titre": "very good product",
          "Contenu": "very good product, very good support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Barrow",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T23:09:22.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Great, fast support response. and got my order quickly."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Kyle Rogers",
          "Nb_Reviews": 3,
          "Date": "2023-11-11T03:22:32.000Z",
          "Titre": "They were fast shipping the product to…",
          "Contenu": "They were fast shipping the product to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "marc sherman",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T19:09:15.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, great price, fast delivery, great product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "imreebs",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T19:34:24.000Z",
          "Titre": "Great company and amazing service."
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "Gertrude Arhin",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T04:09:26.000Z",
          "Titre": "They are doing so well with their staff."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Arnel",
          "Nb_Reviews": 3,
          "Date": "2023-03-31T07:41:54.000Z",
          "Titre": "Shipping is fast with good technical…",
          "Contenu": "Shipping is fast with good technical support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Poindexter",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T19:37:17.000Z",
          "Titre": "Great pricing",
          "Contenu": "Great pricing, fast shipping, great products"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "svete",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T06:48:57.000Z",
          "Titre": "Very good product and very fast",
          "Contenu": "Very good service and very fast. The product works great. Made perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff R",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T01:31:30.000Z",
          "Titre": "Great price and fast shipping!",
          "Contenu": "Great price and fast shipping!  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brett",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T17:47:15.000Z",
          "Titre": "Altair 30 amp PDU",
          "Contenu": "Helpful support on purchase. Fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AT",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T23:43:25.000Z",
          "Titre": "Fantastic customer service and…",
          "Contenu": "Fantastic customer service and extremely fast shipping.  Above and beyond!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Ruyle",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T05:41:03.000Z",
          "Titre": "Great price, great experience",
          "Contenu": "Best service anywhere in an online retailer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lex Brooks",
          "Nb_Reviews": 3,
          "Date": "2022-07-15T09:42:07.000Z",
          "Titre": "Nice packaging",
          "Contenu": "Nice packaging, nothing is getting damaged!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Björn",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T21:12:52.000Z",
          "Titre": "Great seller",
          "Contenu": "Good price, quick shipping. THX"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Rico",
          "Nb_Reviews": 2,
          "Date": "2023-03-04T21:56:24.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, customer support, and fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reinaldo Perez Kalachian",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T22:49:04.000Z",
          "Titre": "Extremely happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Schmidtgal",
          "Nb_Reviews": 6,
          "Date": "2023-07-25T13:15:36.000Z",
          "Titre": "Fast shipping!",
          "Contenu": "Fast shipping!Good prices!Product work great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-04-08T20:47:52.000Z",
          "Titre": "great service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jason Herbert",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T18:57:15.000Z",
          "Titre": "Delivery came before expected date",
          "Contenu": "Delivery came before expected date. Product meats expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "richard Smith",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T01:17:29.000Z",
          "Titre": "Every thing was fast and complete."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Gonzalo Vaccalluzzo",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T16:11:51.000Z",
          "Titre": "Great service!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stuart Hodges",
          "Nb_Reviews": 3,
          "Date": "2023-10-07T03:44:07.000Z",
          "Titre": "Great place to buy a btc miner!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Jennings",
          "Nb_Reviews": 2,
          "Date": "2023-01-21T07:49:13.000Z",
          "Titre": "great as usual"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T03:49:54.000Z",
          "Titre": "Excellent Service and communication."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Victor Garcia Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T17:34:26.000Z",
          "Titre": "Super good and fast",
          "Contenu": "Super good and fast. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T17:46:50.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Responsive and knowledgeable customer service and support. Rare and appreciated."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "TopPen",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T17:05:17.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service, excellent dispatch time,Thx"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "shawn",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T17:33:17.000Z",
          "Titre": "Quick delivery and amazing customer…",
          "Contenu": "Quick delivery and amazing customer service."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "bu ksor",
          "Nb_Reviews": 4,
          "Date": "2023-05-11T04:52:55.000Z",
          "Titre": "good jod ,i love this."
        }
      ]
    }
  ]
}