{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "altoira.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lars Hagen",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:58:43.000Z",
          "Titre": "Same situation as Justin",
          "Contenu": "Same situation as Justin. A management change at Alto has instituted a much different fee schedule from the one I have had for a period of years, which caused me to use Alto. Now, it includes $400 per year in fees PLUS fees for miscellaneous things like transfers and any account closing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:32:20.000Z",
          "Titre": "Bait and switch",
          "Contenu": "Had a multi-year real estate deal that I wanted to do and signed up with Alto for their premium plan for my IRA. Yearly fees was $250. Four months into the deal, I get an email stating now their fees are $400 a year. What a bunch of crooks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Theodore",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T00:17:49.000Z",
          "Titre": "Terrible platform and software",
          "Contenu": "Terrible platform and software.  Very little investment performance visibility and no process for simply putting in a short limit sale.  I list significant fees because of this and there was no indicator that their software sells immediately when a short limit order is entered.  Management refuses to refund any of the fees.  Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle Gilkay",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T03:52:33.000Z",
          "Titre": "Alto Refuses to allow rollover to another institution",
          "Contenu": "Similar to others, I am unable to rollover my Roth account from Alto to another institution. I receive timely email replies with reasons they need us to pay to move our money or things are not yet complete. I recommend you avoid working with Alto. I have worked with a dozen investment firms and this is only firm that has had suspect business practices like this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darryl",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T00:25:07.000Z",
          "Titre": "Frustrated",
          "Contenu": "Trying to log in to my account for over 3 weeks, password reset link does not work.  Have called customer service and have been placed on hold for extremely long wait times, only to get a prompt to leave a message.  Left several messages with no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T20:18:26.000Z",
          "Titre": "I transferred my initial investment…",
          "Contenu": "I transferred my initial investment from my bank account via Plaid interface and now it no longer works.  I can’t seem to get your IT department to figure out why it no longer works."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DB",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T21:02:56.000Z",
          "Titre": "Horrific customer service",
          "Contenu": "Horrific customer service.  Expect transfers to take months, cost $$,  and require dozens of follow-ups (during business hours, because the web site can't do anything).  Have a lawyer handy.   Multiple security incidents.  Oh, and a fee to close you account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyler poole",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T16:28:59.000Z",
          "Titre": "AVIOD AT ALL COST",
          "Contenu": "AVIOD AT ALL COST.  This company is a scam.  I invested for about two weeks, they waited till I made a couple transfers, and then one day I was told my log in email was invalid.  I reached out to customer service and received a reply that said\"we have no record of your account\". I filed a fraud claim with my back, so luckily I was able retrieve my funds bank.  Disregard Alto's response, they have not reached out to me!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andy K.",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T00:29:56.000Z",
          "Titre": "Read the fine print!",
          "Contenu": "I ended up being an Alto customer when LendingClub pushed the partnership on its customers. When I wanted to transfer the assets to another Roth IRA custodian and close the account, Alto would not process the request before I paid a $50 account closure fee. When I politely asked them to waive it, the reply I got was along the lines of \"You agreed to our terms and conditions when you opened your account, if you want us to process the transfer, pay up.\" I'd suggest going with another, more reputable company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Barnathan",
          "Nb_Reviews": 4,
          "Date": "2023-07-28T08:39:14.000Z",
          "Titre": "Roth conversion taking over a month, can't access funds",
          "Contenu": "Upon attempting a Roth conversion, the company has kept my funds locked up for over a month without processing it. I can neither cancel the request nor move the money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nate Doty",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T11:20:25.000Z",
          "Titre": "Very inept customer service.  Possible fraud!",
          "Contenu": "I had an unauthorized transfer of USD from my Altoira crypto account.  For 3 weeks I havent gotten an answer as to what it was.  I am constantly told that a team will contact me.  The people I talk to cannot even answer a question.  Now my account when logging on says invalid email address.  Its always been the same email and I have no idea if I still have an account.  Again... a team will contact me.  It hasnt happened yet!  Customer service has been extremely slow and terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tiim",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T16:11:39.000Z",
          "Titre": "We have been trying to roll our cash…",
          "Contenu": "We have been trying to roll our cash only ira to another administrator from November 2022 until this date of 3-31-23 and Alto refuses to complete the transaction. Numerous emails and calls from my administrator and myself were refused. The transaction finally entered their system in 2-16.  4-2 update: Alto is now claiming that the paperwork was rejected because payment details were not sent. I am told that payment details are always sent with transfer paperwork and a phone call to them on 3-31 by my administrator was not answered. Our next step is to file a complaint with FINRA to get this resolved.4-4-23 update. The transfer has been completed. I can't say if it was because of this review or not, but the timing is very suspicious."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doug Smith",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T14:48:49.000Z",
          "Titre": "Customer service are is friendly, but transfers are fairly torturous",
          "Contenu": "I am increasingly disappointed in Alto IRA, although I still have hope that they can improve. Most of their problems seem be be due to flaws in their infrastructure, particularly in transfers into and out of Alto. I also never got a call back from any of their investment \"partners\"- which makes me wonder. Although they do have some friendly people in their customer support, the  accounting on their is cause for concern. I still have a small amount of remaining money in their accounts which I am trying to transfer from Lending Club to them, and then to a very large brokerage. It should have be seamless and simple, but instead the process has taken 3-4 weeks thus far -this time around. The customer service hotline is a fairly torturous phone queue. (the jazzy 4 measure one handed piano player jingle will drive you insane), but if you know the backdoor phone number and email  you may do better. ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RJ",
          "Nb_Reviews": 2,
          "Date": "2023-01-13T20:33:03.000Z",
          "Titre": "BEWARE_Fees to close account",
          "Contenu": "Beware, they charge a fee to close your account, got stuck with them through Lending Club and they hold your funds until you pay. Slimy business practice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R. Ladue",
          "Nb_Reviews": 2,
          "Date": "2022-12-08T00:04:23.000Z",
          "Titre": "Alto is a DISASTER.",
          "Contenu": "I was an alto IRA customer for years. Super high fees for everything. Nearly impossible to reach on the phone. Absolutely no way to contact them at nights or weekends. Also no way to contact them electronically.  customer service reps very poorly trained, have absolutely no idea what they’re talking about.  I can’t remember a single transaction that I did with alto IRA that did not have to be redone at least two more times. Alto notorious for asking you to fill out forms, and then turn around two days later and tell you that those were the wrong forms.And transfers in or out?? Don’t get me started. Any transfer out of alto was stalled, delayed or stopped altogether, unless you called every day… Literally every day hammering on them to complete the transaction.  Deposits, routinely lost.  transfers out… routinely went into the ether.  Over all the years I was a customer with them auto was never able to complete a single wire transfer successfully the first time in fact, they were never able to complete a wire transfer in Two tries.  Alto, in every case… And I mean in every case… Required three tries to complete any wire transfer in or out.I can’t tell you how strongly I recommend against using Alto. avoid this company at all costs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Stone",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T17:07:18.000Z",
          "Titre": "Can't be trusted with your assets!",
          "Contenu": "Sent our dividends/distributions to someone else's account.  Sent other investor's dividends/distributions to our account.  Lost dividends/distributions that our investment companies have proven/documented they issued.  Labeled distributions incorrectly (indicating they were from one investment, when they were from another).  Monthly statements are erroneous, including the above, and also that we requested that they withhold taxes on a distribution from the account to us, and they didn't but the monthly statement showed they did.  Never took responsibility for all of the above....only indicated that our investment companies have issues.  Froze our access to our cash for 3 months now, because they can't reconcile our account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Alper",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T00:40:22.000Z",
          "Titre": "These people are bandits",
          "Contenu": "These people are bandits! First they charge $25 to get your money electronically or wait three weeks to get a check. Then there is the outrageous $100/yr account fee, and worst of all, a $50 fee to close my account. What a crock of you know what!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nelson Houser",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T22:56:38.000Z",
          "Titre": "NO customer service response to my emails and phone calls in over 2 months",
          "Contenu": "I have been trying to get in touch with them for the last 2 months. No response from anyone by phone or email and I have tried both weekly. Still no response. Are they still in business or did they get caught up in the FTX crypto debacle? I see they monitor these comments. I will let everyone know if I do not hear from them soon. For now .. I would be hesitant to deal with this company.  If you doubt me .. try calling them 877-673-1557 and see what you get. Hope they prove me wrong because they have a nice little chunk of my money that I am trying to get from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Schmitt",
          "Nb_Reviews": 2,
          "Date": "2022-07-18T21:38:50.000Z",
          "Titre": "Transaction was sent out as and ACH…",
          "Contenu": "Transaction was sent out as and ACH rather than the Wire I requested.  I missed out on the investment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J.J.",
          "Nb_Reviews": 1,
          "Date": "2022-07-09T13:47:22.000Z",
          "Titre": "Trade Execution Issues",
          "Contenu": "Your technology doesn't work as expected, resulting in erroneously executed trades. No bueno"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nabil",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T18:18:24.000Z",
          "Titre": "Your website leaves much to be desired…",
          "Contenu": "Your website leaves much to be desired - there should be instructions where distributions from investments get sent to Alto for deposit into our accounts.  You should be able to open multiple types of accounts with the same email (Roth, traditional IRA, SEP IRA, solo 401K, etc.)  I cannot recommend your service to others."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T15:39:58.000Z",
          "Titre": "I am somewhat disappointed in alto",
          "Contenu": "I am somewhat disappointed in alto. The platform is not that intuitive. And I was told that I could open a regular Ira and move funds from my crypto Ira into that. But when I asked to do that they said I need to have another email. I do not want to have two emails. So I was missed informed when I asked about it originally. Now I’m looking for another custodian that I can open up a regular Ira at."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim M.",
          "Nb_Reviews": 4,
          "Date": "2021-12-01T15:27:18.000Z",
          "Titre": "Part 3 if Take your business somewhere…",
          "Contenu": "Part 3 if Take your business somewhere else.November 30, 2021 - after submitting another TOA(Transfer of Assett) form with my brokerage firm (due to the untimely handling by ALTO of my first request) , the TOA was sent to ALTO.Again, I really don’t know how Breanna holds the title of Manager of Client Experience. One might think that would be a positive title, but, my experience was nothing but negative."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T23:05:50.000Z",
          "Titre": "Deposit delay and crypto fees",
          "Contenu": "I'm annoyed that 1) there's no ability to setup an automatic monthly deposit from my bank, 2) it took so many days to complete an ACH transfer from my bank to Alto and then to Coinbase and then to be ready to trade, and 3) I didn't know up-front they were going to take 1.5% of my crypto deposit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GMaharjan",
          "Nb_Reviews": 1,
          "Date": "2021-10-31T05:07:01.000Z",
          "Titre": "Awful ! open to complete account  in AltoIRA",
          "Contenu": "This is very awful to open an account and transfer 401K to Traditional IRA and open Alto Roth IRA and transfer Traditional IRA to Roth IRA. It took almost a month to complete the process, this is one of the most stupid things in my life. I'm super regrading for choosing this platform. Customer service '0' star, Information in website '0' star, have no smoothness in the workflow. And they don't have service on Saturday!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-05-29T12:42:56.000Z",
          "Titre": "4 attempts to invest in Linqto failed",
          "Contenu": "4 attempts to invest in Linqto failed.  Still have not been able to complete an investment from my Roth IRA into Linqto from Alto.  Linqto closes the transaction because funds are not received in time for settlement.  Ugh."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lauren Snell",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T21:21:32.000Z",
          "Titre": "Since Alto became the IRA custodian for…",
          "Contenu": "Since Alto became the IRA custodian for Lending Club, it has been a disaster. First they were hacked and all accounts were frozen. I don't hold that against them. But since then it takes days from the time I transfer money out of Lending Club before it shows up in my AltoIRA account. And it takes weeks to get money transferred out of Alto to other institutions. They have repeatedly lied to me about the money being sent when it was not. This whole experience has been terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Noel Frenzel",
          "Nb_Reviews": 2,
          "Date": "2021-08-10T20:46:00.000Z",
          "Titre": "DO NOT use this custodian!!!",
          "Contenu": "Switched to Alto as a Lendingclub investor like many others. I'll excuse the 2 plus week shutdown due to the cyber attack, but their customer service before and after the attack does not deserve the 1 star I gave the review. I'll save you the many grueling details of my terrible customer service experiences and their lackadaisical responses. I'm seriously thinking of going back to my former custodian. DO NOT use Alto as your custodian!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eulalia",
          "Nb_Reviews": 1,
          "Date": "2021-09-10T20:23:26.000Z",
          "Titre": "Could someone answer the important emails?",
          "Contenu": "I have been requesting information about the status of a transfer of funds out of AltoIRA since 9/3/21 today is 9/10/21. I have not received the information requested. I don't understand why AltoIRA is not answering my emails regarding the status. Could someone please let me know what the status is? This is important."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T16:30:40.000Z",
          "Titre": "IRA Distribution Problems",
          "Contenu": "Their process for handling IRA distributions is in serious disarray. Distribution requests can't be submitted on-line, calls to customer support bounce to voicemail, and emails go unanswered. Judging from some of the other reviews here I'm not the only one running into these problems."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Flavio Junior",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T18:31:52.000Z",
          "Titre": "Not responsive",
          "Contenu": "I needed to recharacterize my IRA to a ROTH IRA and had to reach out to them multiple times via phone. It has been more than a week and they still have not addressed my issue. This operation would is automated with most actual brokers such as Vanguard and etc. It is not justifiable that this requires multiple manual interventions."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "billinorlando",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T09:35:50.000Z",
          "Titre": "Customer service is ok",
          "Contenu": "Wish I could post screenshots here. I had filed for a disbursement on 12/21/21. 9 days later Alto told me that I had entered the wrong info. I cancelled my pending withdraw, and tried again. Only to find out that I was unable to enter my info. I asked 2 DAYS ago for help. Till now no response via email, or on the chat. Alto fees you for each deposit, withdraw, and maintenance fees. Best to use a trading platform.UPDATE: I just talked with Kevin and helped me to file for my withdraw. I will keep you posted as to when I get paid. UPDATE: 1/7/22 Just received my funds in full."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terrible customer service",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T21:41:24.000Z",
          "Titre": "I just got off the phone with one of…",
          "Contenu": "I just got off the phone with one of your reps. This rep had an absolute abysmal attitude. There was. no, I repeat, not 1 apology from this person. The candor regarding a financial situation was beyond my understanding. It’s sad when a company is saddled with careless employees early on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ty Russ",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T00:42:38.000Z",
          "Titre": "Alto will take your hard earned money!",
          "Contenu": "I am a former Financial Advisor and Alto charges 1% a year of the total account value of the IRA. That is a complete and total ripoff. They are not performing anything to earn this 1%....IT'S A SELF-DIRECTED IRA!! Financial Advisors across the country charge 1% to manage your investment account. Alto should be ashamed of themselves to charge this fee. Do yourself a favor and find other alternatives. They do exist, without the 1% annual charge."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DP",
          "Nb_Reviews": 2,
          "Date": "2021-07-26T14:59:29.000Z",
          "Titre": "I came to AltoIRA via Lending Club",
          "Contenu": "I came to AltoIRA via Lending Club.  They switched my custodial account from Forge Trust to Alto earlier this year.  Unfortunately I did not realize this until after I made a withdrawal from Lending club.  I hae been attempting to activate my AltoIRA account in order to access the funds transferred to them from lending club sin July 8th and as of yet there website is still not working.  I sent several emails and even talked to them on the phone.  They keep saying it will be up in few days but now it has been nearly 3 weeks and I still hae no access tomy money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 3,
          "Date": "2021-05-24T14:37:04.000Z",
          "Titre": "Worst place ever they don't even have a…",
          "Contenu": "Worst place ever they don't even have a phone number to contact them if there's a problem everything has to be done by email and you got to wait like a week to get a response I'm withdrawing my money and now they're giving me a hard time avoid this place like the plague"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Genady Solovyov",
          "Nb_Reviews": 2,
          "Date": "2021-07-28T23:55:06.000Z",
          "Titre": "It has been 4 weeks since my IRA distribution request with Alto IRA with no result",
          "Contenu": "I find the customer service at AltoIra horrific. I was switched to AltoIra without my knowledge by Lending Club, and now it has been 4 weeks since I requested my IRA distribution, and when I open my AltoIra account it still shows \"pending initiation\". Also there is no phone number anywhere on AltoIra site  and all communications are by email only. I do receive emails from different people at AltoIra saying that my distribution request will be addressed but no result whatsoever in 4 weeks !!! This is simply unacceptable. I wish I knew which regulatory agency I could file a complaint with."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T13:31:14.000Z",
          "Titre": "Difficult to add funds",
          "Contenu": "Difficult to add funds, very little customer support wnd not user friendly.  Other friends have the same issue with your firm.  As a result not sure throng term viability of this firm.  Currently not adding funds due to no support"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Accurateinspections",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T18:07:21.000Z",
          "Titre": "Good review and this is exactly what is…",
          "Contenu": "Good review and this is exactly what is wrong with this company. Suggestion; Invest into some people to answer your phone and get the money transfers done quicker. Or stop advertising when you can't even answer the phone! Over promise and under deliver! I get a better customer service from the IRS!Other reviewer post: Alto and Capitalize seem to be still working customer services out. I have been unable to reach anyone by phone or email and get a quick answer during business hours. Emails responses seem to be sent at the end of the day and are already behind by the time I hear back. It is very frustrating. Now that all the funds are in my account trading is relatively easy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JayKay",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T22:34:59.000Z",
          "Titre": "Not what I was expecting for an SDIRA…",
          "Contenu": "We've been extremely disappointed thus far.  It was easy enough to open an account and move cash, but it's been over a quarter now trying to get the assets from my other SDIRA to transfer with multiple attempts thus far."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rexel",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T21:16:48.000Z",
          "Titre": "Disgusting service",
          "Contenu": "Disgusting service. Scammer. The support service does not respond, they block the account without explaining the reasons. They do not allow to withdraw money. I strongly do not recommend using this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Okeila C",
          "Nb_Reviews": 2,
          "Date": "2022-04-24T17:49:44.074Z",
          "Titre": "Beware….",
          "Contenu": "DO NOT DO BUSINESS WITH THIS COMPANY!!!! Do your research… there are more competent Crypto IRA companies out there with professionalism, morals and business sense than ALTO! To start, ALTO took double the amount that I authorized out of my personal bank account in January 2022. Fast forward to April 2022 and I am still trying to get my money back. I will not put money into a crypto IRA with a company who has deceitful business practices, shotty back room operations and non-existent customer service. I have now retained an attorney and will be taking ALTO to court. I have done absolutely everything I was told to do and they still will not return the excess funds that were taken from me. Please save yourself the time, frustration and sanity and DO BUSINESS ELSEWHERE!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Midwest skier",
          "Nb_Reviews": 7,
          "Date": "2020-12-09T16:42:40.000Z",
          "Titre": "Poor follow up so far",
          "Contenu": "Account opening was straightforward.  Transferring money to the crypto IRA.  The money left my broker two days ago and has yet to show in my account.  So far I have left 3 emails, Monday, Tuesday and today WITHOUT a response.  Poor start to the relationship"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 4,
          "Date": "2021-08-06T20:25:11.000Z",
          "Titre": "Avoid Alto!",
          "Contenu": "Like many others, I was pretty much forced to move my Lending Club funds from another custodian to Alto. That was almost two months ago, but I've yet to see a penny actually transferred. Some of the money is still at Lending Club, some has disappeared into cyberspace. Also, Lending Club promised that Alto's first year's administrative fee would be waived. But when I signed up on Alto they demanded a credit card before opening my account and charged me $100. A customer service rep promised me the $100 would refunded; it has not been. They have no phone number to call, sometimes they answer emails and sometimes not. Don't deal with Alto!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 3,
          "Date": "2021-08-26T15:32:31.000Z",
          "Titre": "Please do not contact ALTO",
          "Contenu": "I have requested and pretty much begged ALTO to not send me any emails or contact me  because of the bad experiences I had with them before I could make the fatal mistake of using them as a custodian. They finally said they would remove my information and comply with my request.Yesterday I received an email asking me for referrals. I would not refer this company to my worst enemy.Once you contact this company by email, which is pretty much the only way to get in touch with them, they keep your info in their data base and constantly email you. They are unstoppable in sending junk emails and I am tired of it.Stay away from this company! Do not contact them...ever!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SRT. DAVID",
          "Nb_Reviews": 4,
          "Date": "2021-10-30T10:35:23.000Z",
          "Titre": "Not recommended",
          "Contenu": "Money Transfers take 1 week and Bad customer service!! The website on my account has conflicting information where my money is but NOT IN MY ACCOUNT!!!!  This is a very unrefined Investment site!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "william",
          "Nb_Reviews": 2,
          "Date": "2022-01-15T14:45:01.000Z",
          "Titre": "It’s too hard to execute trades with…",
          "Contenu": "It’s too hard to execute trades with you folks Trades should happen in about 30 seconds or less maybe a minuteAnd since you’re charging 1.5% I think you should be doing it promptly"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TheManDudez",
          "Nb_Reviews": 1,
          "Date": "2021-07-23T19:12:55.000Z",
          "Titre": "Stay Away from AltoIRA - the worst!",
          "Contenu": "I wanted to open a Self Directed IRA to invest in alternative assets. I opened an account, which was a fairly easy and intuitive process. However, after opening up an account, everything that could go wrong went wrong. Poor communication, terrible customer service with long response times, multiple bank withdrawal requests, no visibility into funding, etc. Additionally, AltoIRA just had a huge data/privacy breach. Therefore, I would recommend staying away from these tech-enabled IRA providers like AltoIRA, Rocket Dollar, etc. Go with the traditional non-tech enabled companies like Broad Financial, Entrust, etc. Less data/privacy risk, more customer service, and attention, and a better experience overall. It's worth the marginal premium in the long run!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob W",
          "Nb_Reviews": 2,
          "Date": "2021-08-01T22:11:39.000Z",
          "Titre": "Yikes! $250k in assets and no support for issues!",
          "Contenu": "Like many others here, I was coerced to Alto via Lending Club. I have two Lending Club accounts and both have encountered issues with [lack of] fund transfers, horrific (meaning no) customer service, no means to speak to an actual human to resolve issues, etc. I've submitted several Alto help requests/emails over the past couple months and receive dismissive or deflective responses weeks later with nobody willing to engage and actually help resolve the issues. I waited as long as I could for them to get things in order with the Lending Club transfers and their recent network breach, but I can't waiting any longer. Isn't this an IRA custodian/administrator with obligations to clients and federal regulators? I'm packing my toys and finding another IRA custodian ASAP."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Olivia Sauvage",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T19:33:36.000Z",
          "Titre": "For weeks now",
          "Contenu": "For weeks now, my pods have either all leaked out or have been bought burnt, I open the package and it’s a brown yellow color. This is unprofessional and quite unsafe as well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JCD",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T00:00:46.000Z",
          "Titre": "I intended on investing my money and am…",
          "Contenu": "I intended on investing my money and am missing an opportunity to get in at a low due to your 7 day rule. It’s my money. I should be able to do what I want with it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Curt Haedke",
          "Nb_Reviews": 7,
          "Date": "2021-07-08T12:27:12.000Z",
          "Titre": "The Website does not work",
          "Contenu": "The Website does not work, not responsive to emails, no phone number, they have my money and I can't access it.  Stay away, I now have to fight to get my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sloan Chapman",
          "Nb_Reviews": 1,
          "Date": "2020-03-09T15:16:35.000Z",
          "Titre": "There is no way to speak to anyone when…",
          "Contenu": "There is no way to speak to anyone when you have a problem understanding something.  Need to have better contact information that includes the ability to speak with someone if necessary."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JT",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T22:19:56.000Z",
          "Titre": "This system sucks",
          "Contenu": "This system sucks. It advertises that it you can buy crypto but, even though there's a pull-down menu for a bunch of crypto, you can only buy bitcoin"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Viktoriya Safris",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T21:15:49.000Z",
          "Titre": "The worst platform ever"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Douglas S",
          "Nb_Reviews": 5,
          "Date": "2021-10-20T13:43:12.000Z",
          "Titre": "I've had issues with them",
          "Contenu": "I've had issues with them, though I like the idea of what they are trying to do. Unfortunately their web site was hacked back in July  2021, and they were offline for about two weeks. Since then I've been trying to transfer money out of there back to a previous IRA custodian with very little success.  I have had to file a complaint with the Consumer Financial Protection Bureau because of a 2+ month delay, and possible lost checks.  See: Consumer Financial Protection Bureau Complaint Number 211019-7461102  My biggest complaint is that transfering money into and out of Alto IRA was never smooth, involved countless hours of calling various parties and leaving emails. They always respond with a generic email saying they are listening, but the responses and customer service are minimal and insincere.  Obviously they are a young company with lots of growing up to do. I wont be keeping my money there for much longer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J.",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T19:53:03.000Z",
          "Titre": "The customer experience has been awful",
          "Contenu": "The customer experience has been awful. Lost check, late deposit, and difficulty getting to speak with or even get an email back from staff."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "david",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T19:17:07.000Z",
          "Titre": "A miss",
          "Contenu": "Unfortunately, my experience with transferring my account from its current custodian was riddled with errors on Alto's part.  The electronically-generated transfer form was sent to the wrong address, no solution was provided for fixing the problem, inaccurate timing projections were provided, I was charged incorrect amounts of fees, I was guided about the wrong day to invest in a fund, having needed to overnight a check for a workaround solution, Alto only located the overnighted check four days after it arrived at their company, and a litany of other minor details were missed.  At the end, once my issues became escalated, everything worked out with my investment; however, I invested many hours of personal time in assuring that this process was done correctly and did not have confidence that Alto did their part of the job.  The supervisory manager did give me assurance that things would be handled well going forward, however, this volume of errors is difficult to overcome as far as my confidence in the company's professional execution is concerned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-11-14T18:01:06.000Z",
          "Titre": "Your transfer process is too…",
          "Contenu": "Your transfer process is too cumbersome!  You should have a customer service number with a real person to talk to."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Tamayo",
          "Nb_Reviews": 1,
          "Date": "2021-12-05T16:24:24.000Z",
          "Titre": "STAY AWAY… For now",
          "Contenu": "AltoIRA.com’s concept is awesome: A tax sheltered way to invest in Cryptocurrency and other forms of unique investments. The problem with this website is that it’s simply not ready for launch. The website is RIDDEN with bugs that make it operationally awful. It is nearly impossible to contact customer service for any specific problem you’re having because there just isn’t enough employees on their payroll to satisfy their customer base. And lastly, the transferring of funds in and out of their website from other custodians will give you an absolute heart attack. I was with this company for only 7 days before I quickly realized I wanted nothing to do with them, and when I tried to send my money back to the original brokerage firm I was met with obstacles each step of the way. The worst part is, each step it takes customer service to respond to you in 3 days. Right now, it’s been two weeks and my money is still rotting in the account and I am getting no support! Trust me when I tell you all to please stay away… You do NOT want to trust your money with these people at this moment in time. I hope this changes because their concept is fantastic."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 8,
          "Date": "2021-11-05T21:13:54.000Z",
          "Titre": "Takes me 2 weeks to invest",
          "Contenu": "Takes me 2 weeks to invest?  Sorry no thanks I will move on to other companies that's freaking crazy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T20:40:35.000Z",
          "Titre": "No response back regarding question I called about",
          "Contenu": "Agent never got back to me regarding maximum contribution for 2021 for a  self-employed contractor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim M.",
          "Nb_Reviews": 4,
          "Date": "2021-11-24T01:00:12.000Z",
          "Titre": "Go somewhere else with your business…",
          "Contenu": "Go somewhere else with your business Part 2For clarification in my first review. I started the transfer process in June 2021 and was finally completed at ALTO in November 2021.ALTO was closed for two weeks for COVID at the end of October and beginning of November 2021. If you read my first review, it may have sounded like the  two week shutdown occurred earlier. Once again, I was never notified of the closure and left without any communication.ALTO, you responded to my Part 1 one star review  with: “…. We understand that there is definitely an urgency when it comes to exercising warrants and transferring shares to another custodian.”My response: My paperwork with my custodian to where the shares were being transferred into, from ALTO expired after 90 days. Since this process took nearly five months, I will have to refile another TOA(Transfer of Assett) form. Right, doesn’t sound like a big deal and if it were the only delay or  miscommunication from ALTO, it wouldn’t be a big deal. However, stack it on top of everything I’ve already mentioned, it’s just another area where ALTO created more work and frustration for me where if things were handled in a timely manner, I wouldn’t be here giving ALTO another one star review.James"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Branch",
          "Nb_Reviews": 2,
          "Date": "2021-11-17T21:36:00.000Z",
          "Titre": "Pretty damned confusing",
          "Contenu": "Pretty damned confusingTried to buy $50 of bitcoin and you wouldn't accept my signature."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 3,
          "Date": "2021-07-21T14:45:52.000Z",
          "Titre": "Please stay away from Alto!",
          "Contenu": "Alto has the worst customer service I have ever experienced with any company. Total frustration! Not transparent as they show no contact phone number. They want you to email them and have to wait days until they decide to call back. If you miss their call, the process starts all over again. Even when you leave a VM or email addressed to a particular person someone else contacts you back.I made the HUGE mistake of filling out a partial application online and quit because I could not get Conner to call me back regarding a question I had. I have emailed and spoke to Tom, Conner and Robert saying I wanted nothing to do with this company and wanted to be taken off their contact list and my info erased. Then I was emailed that their website was hacked and I needed to reset my password! I am furious they did not remove my personal info...SS#, birthdate, name, address, etc. After about a dozen emails and 2 phone calls they refused to issue me free credit monitoring for 1 year. Please do not even talk to ALTO as you are wasting your time and setting yourself up for major problems. If their customer service is this poor before they get your money, I cannot imagine how bad it would be after they get your account and money. There are better people to deal with. Alto is the worst!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Orion Lukasik",
          "Nb_Reviews": 1,
          "Date": "2021-06-16T18:55:41.000Z",
          "Titre": "Alto IRA and LendingClub",
          "Contenu": "I came to Alto via LendingClub. Earlier this year, LendingClub changed their 'preferred' custodian from Forge to Alto. I had the opportunity to choose my own custodian or do nothing and automatically move to Alto. My experience has not been good since. I decided to move from LC to Prosper for note investing, so I transferred some available funds into Alto. The transfer wasn't happening, but after contacting LC, they straightened out the problem and my funds showed up in my Alto account as cash balance. Then the real fun began...I initiated a custodian to custodian transfer from Alto to Millennium with both Alto and Millennium. Millennium made the transfer request to Alto over two weeks ago, and that's the last either I or Millennium have heard from Alto. Missing in action. They have not responded to communications from anyone. Alto still shows my transfer as 'pending initiation' and there it sits, even though Millennium initiated it over two weeks ago. So I'm left with my funds lost to Alto and no communication from them. The other companies have been very responsive and helpful, but Alto just outright sucks...not a nice thing I can say about them. So beware of dealing with Alto. I have a hard time believing the good reviews here are for real."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2021-11-16T22:25:31.000Z",
          "Titre": "Wow...sooooo slow",
          "Contenu": "WOw, incredibly slow transfer service and holds.  Buy direct crypto, it is instant."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LC",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T18:33:37.000Z",
          "Titre": "Good at making promises but not at following through",
          "Contenu": "I have had an account with Alto IRA since March of 2020.  At the time I was putting money in, customer service was good.  There were a number of glitches in getting the account set up and the money in, but they were a new company, and they communicated well enough throughout the process, so that wasn't a big deal.  What has been has been the literally abysmal customer service since then.  It seems like as soon as they have your money they put no effort into timely customer service, and they take no responsibility for issues on their side.  I missed the chance for one investment (a partner firm) because the process did not work and I couldn't get timely support.  They've also raised fees since I signed up and yet conveniently didn't respond to any of my inquiries for the month leading up to the change so I couldn't make the investment I wanted before the change (which would make the same investment much more expensive).  I don't expect a new company to be perfect, but I do expect them to try to take care of their customers, and to make reasonable accommodations to their customers when failures on their side do occur.  To me this has seemed more like a money grab, where they get you in the door to make their numbers look good but then put no effort into providing anything close to the service that was promised.  To sum up, I've been paying for the service for almost 2 years and have not been able to make one investment.  Not one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Curt Albertson",
          "Nb_Reviews": 2,
          "Date": "2022-03-04T19:39:20.000Z",
          "Titre": "And this is easy?",
          "Contenu": "At what time do the miscues, requests, endless emails finally end?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 2,
          "Date": "2021-12-25T03:50:36.000Z",
          "Titre": "Fees are high",
          "Contenu": "Fees are high.   Trades do not happen quickly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim M.",
          "Nb_Reviews": 4,
          "Date": "2021-11-18T16:16:41.000Z",
          "Titre": "Go somewhere else with your business.",
          "Contenu": "First of all:  To ALTO - PLEASE do not give me any more excuses and apologies for NOT doing your job. Please, no more “I’m sorry, but…”One star is generous review rating.I needed an account that needed to be transferred out of ALTO into my brokerage account. My paperwork with my brokerage was filed June 21, 2021. As of November 18, 2021 it was finally complete. As of today, November 19, 2021 after speaking with my brokerage account, since it’s been past 90 days I have to resubmit another Transfer of Assett form due to the other paperwork expiring . They also told me, that three attempts of communication was made after my initial TOA form was filed June 22, 2021. They received no response from Alto, and after my communication with them in July they had to mail a request via USPS to Alto.  Yes, their office was vacated due to Covid for two weeks - no one told me about the reason for that delay, until after asking. Yes, my stock shares needed to to cleared via a third party. I got timely emails and updates from that third party, waited patiently, expecting to get an Alto update, never got an update, so just like several times before, I initiated more communication to Alto requesting an update. I sent back requested paperwork within 3 days, the third party was timely with what they were required to file. ALTO was the log jam in the river.As a customer, why is it my responsibly to constantly initiate communication only get numerous “I’m sorry, but…” I felt like I was doing Breanna Pepper’s job , who happens to be a manager of “customer experience”.I received wrong information, excuses, untimely updates and felt like I was doing her job with follow-up communication with my brokerage account, ALTO customer service , another manager within Alto(Sean), and finally Breanna who was never without an “I’m sorry, but…”My advice : Go somewhere else with your business.James M."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T21:21:52.000Z",
          "Titre": "Dysfunction throughout.",
          "Contenu": "Unable to speak with someone as a problem arises...Told to schedule a call....in 10 daysThen they fail to send my funds by wire transfer as instructed....even though they charge for it....they used ACH instead, without informing me....after that I hear from no less than a half dozen different people...nobody takes responsibility...nobody knows where the money...$100,000... is or why it was not wired....they keep saying the investment is \" complete\" even though the funds have never been received. In the end they waste an entire week before they realize they even screwed up the ACH....the money was returned to them...so they finally used Wire Transfer and of course it arrives at the company within hours....as it should have in the first place a week prior.Overall they have layers of employees all with various job titles and nobody seems to know what the others are doing. You get lots of apologies but no action. For a time-sensitive investment scenario this is a disaster. They require the recipient of the investment to \" join\" their site as a \" sponsor\" and you are not copied or apprised of what is going on until after it's happening. They request information from the sponsor instead of from them through you...it's your money...your investment, but you are not in the loop....then ....surprise! After asking for wire instructions....they don't wire the money...you find this out from the sponsor instead of Alto that it wasn't sent.... fortunately the company was very understanding and spent a lot of their own time trying to get Alto to perform and kept me informed. Alto refunded the wire charge, in some small effort to compensate for a week of unecessary agrivation and delay...but true to form, they went and charged me for it anyway a couple days later..after saying they would not.... The circus continues...as soon as I updated this review...( end emailed them once again)  the wire charge was refunded....A completely dysfunctional organization has been my experience. It's as if there's a whole bunch of people on computers at home with no idea what the others are doing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 4,
          "Date": "2022-01-14T14:10:29.000Z",
          "Titre": "Real New User Review: what you should know they don't tell you!",
          "Contenu": "Real New User Review:First make sure you sign up for the correct type of account.  Thought I was signing up for coin trading SEP IRA instead I managed to sigh up for just a SEP IRA.  This was a bit confusing considering I knew exactly what type of account I was after.  Since my transfer was coming from Fidelity, the right of recision had expired. At least that was in my favor.  Pretty much nothing else was.I had called the day after I initiated my transfer and spoke to Paul Hayslip, he informed that I had signed up for the wrong type of account.  Not to worry, it could be fixed on the back end within the next few hours.  I checked later that day and still no change.  I sent him an email with zero response.  I called, zero response, online help, zero response, so I let it go for the day.  The following day I checked back. Zero response, there was not a soul to be found! It took about a week before Paul responded (nobody else responded period to any of so called help or chat lines).  He claimed that there was an email sent out.  I can't imagine for the life of me why they could have a message displayed after logging in with this disclaimer.  I get it, they're a start up but when you're dealing with peoples money, accessibility is the key to success.  Plus being new, most emails could be considered spam or junk.  I don't think they did, I never received any notification, checked both junk and spam folders. Finally the account is coded correctly, the transfer is complete, lets get some money invested...  Nope,  you have to transfer from your account to the trading account.  This doesn't happen when you push the buttons, who knows what has to happen.  More sit and wait. Finally after several hours, the transfer is complete.  Don't get too excited, trades have to process as well.  They take 5 plus minutes per trade.  No API interface at this time either.  All in all, its a very slow process with terrible communication response time and you might as well cancel any communication if its a holiday, not just for the day, for the week!The one positive Alto offers, decent coin options based on Coinbase. Good luck, hopefully thing get better or other companies understand the importance or solid communication.  1 Star at best."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blake",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T20:26:29.000Z",
          "Titre": "Annoying af to transfer money to"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elhanafi",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T16:16:28.000Z",
          "Titre": "To long to finalize deposit",
          "Contenu": "Too long to finalize deposit"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JAY",
          "Nb_Reviews": 1,
          "Date": "2021-10-17T20:07:06.000Z",
          "Titre": "Super unhappy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cb cb",
          "Nb_Reviews": 1,
          "Date": "2021-02-25T18:42:47.000Z",
          "Titre": "Poor Service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marian",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T20:48:52.000Z",
          "Titre": "Lost money",
          "Contenu": "Lost money.  My account is almost 2/3 less than I started.My bad choices"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Apoorv Saxena",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T01:57:59.000Z",
          "Titre": "frustrating account set up and funding",
          "Contenu": "It took a lot time almost 3 months to set up my account and then to fund it and invest to meet  a capital call. The person assigned to me was helpful but they were not at all proactive. I had to keep pinging him about the status throughout the process and he would react only when I identified the problem. Overall very frustrating process and I would be very reluctant to recommend Alto to anyone and I investment account is over $5M across various firms."
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "Henry",
          "Nb_Reviews": 4,
          "Date": "2023-04-28T05:22:00.000Z",
          "Titre": "Alto’s crypto platform has a major flaw…",
          "Contenu": "Alto’s crypto platform has a major flaw that they do not disclose anywhere on their website. Cryptocurrencies that you buy can only be sold as long as they remain listed on Coinbase. If they are delisted from Coinbase, which can happen to any coin at any time, they cannot be sold and are essentially stranded assets because Alto does not have a means to sell cryptos outside of Coinbase. Alto does not currently have a solution to this and does not seem to consider it a major problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T17:13:21.000Z",
          "Titre": "Poor customer service and Web site design",
          "Contenu": "I was disappointed with the lack of customer service and poor web design.  Phone call hold times were extremely long, resulting in the need to send emails.  It took days to get a response, which required additional follow up correspondence.  When I finally spoke with a person, she was helpful and professional. The web site is difficult to use and not clear.  The account balances listed didn't match each other. I had no faith in this company.  I closed and trnsferred my account as a result."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "XYZ",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T21:59:18.000Z",
          "Titre": "Too more than 2 weeks and team is not…",
          "Contenu": "Too more than 2 weeks and team is not responsive and responsible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Naresh",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T23:28:35.000Z",
          "Titre": "Onboarding process",
          "Contenu": "1. Too much time spent 2. Reactive way / method to deal with the request"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JimL",
          "Nb_Reviews": 2,
          "Date": "2022-05-05T20:37:48.000Z",
          "Titre": "Seems Alto back end accounting is not…",
          "Contenu": "Seems Alto back end accounting is not fully functional yet.  I have a Roth IRA custodied at Alto.  Alto's books show the account is 100% notes from Lending Club when in reality it is mostly cash and some notes.  I transferred the cash into the Alto Roth IRA so now my account shows an incorrect balance, still with 100% notes plus the cash I transferred.  This has been a couple weeks since I did this.  Someone needs to do a backend transaction to reconcile to the correct balance."
        },
        {
          "Note": 2,
          "Lieu": "CZ",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-04-24T06:02:26.823Z",
          "Titre": "Terrible experience migrating over from…",
          "Contenu": "Terrible experience migrating over from Chase. The entire process was on me and no one made any effort to assist in the process. Everyone at Chase that I talked to kept mentioning how typically \"the receiving party handles this and not the client\" and with other rollovers in the past it's been the case as well. I'm glad I can use Coinbase custody and asset options, but the process and the eventual crappy Alto UI for trading is really not on par with modern fintech experiences."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "HJW",
          "Nb_Reviews": 2,
          "Date": "2022-02-25T02:21:30.000Z",
          "Titre": "Amateur",
          "Contenu": "It is absurd that I have to create a different IRA type with a different email, and also that you don’t demonstrate growth % next to each asset. The only reason I didn’t give a 1 is because Vivian is nice. I’m thinking about moving elsewhere though because what a ridiculously amateur experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sridhar",
          "Nb_Reviews": 2,
          "Date": "2021-12-28T20:32:10.000Z",
          "Titre": "I am neutral because of these reasons:",
          "Contenu": "Update today - altoira has been pretty much non functional today - December 28 - again when the market is tanking. Reducing my rating by 1 star.I am neutral because of these reasons:a. Very high fees . 1.5 percent is really too highb. I started trading in this account for the first time during that big flash crash on Dec 3rd/4th. I could not get the best prices. The trades also took a very long time to execute. c. No bots.d. no ability to provide stop loss. Only limit order for sells."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T17:53:37.000Z",
          "Titre": "Part of the adaptation curve",
          "Contenu": "I wasn’t a fan of how convoluted their transfer process was. Initially I was directed to using their transfer method, then that failed due to my previous custodian, so next I was sent to use a horrible partner of theirs called “Capitalize” who was absolutely horrible and lied to me. Their transfer rep. was very responsive though. Their customer experience side seems pretty clueless about the nuances of crypto and are just there to navigate you surficially.     Not a big fan that Alto isn’t distributing me earnings from native wallet staking either. Nor that I have access to cold storage wallets to verify they’re actually holding my funds."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sophia Rosenthal",
          "Nb_Reviews": 4,
          "Date": "2021-12-20T03:08:28.000Z",
          "Titre": "Takes way too long to be able make trades!!!",
          "Contenu": "Love what Alto has to offer BUT takes way too long for funds to show in your account to make trades! How can one get on when prices are low to make your trades??? I wish I signed up with another company that doesn't make you wait and lose out on opportunities to make trades at great timing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FL",
          "Nb_Reviews": 1,
          "Date": "2021-07-24T13:24:11.000Z",
          "Titre": "Terrible service",
          "Contenu": "Great idea, poor execution.  Terrible customer service.  In an effort to transfer another SDIRA here, I tried repeatedly to get things set up with Alto.  Only to discover that the information I was being given was false.  Once I asked them about this (and the only way to contact them is via email), they ghosted me.  Repeated emails to them over weeks have resulted in no responses.  Terrible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2022-03-20T19:58:02.000Z",
          "Titre": "Would give 2 1/2 stars if able .Crypto…",
          "Contenu": "Would give 2 1/2 stars if able .Crypto Roth is a great idea and great way to avoid taxes. Having to wait 7 days is way too long when transferring money to my account. I can buy immediately on Coinbase when I transfer money from my bank account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Armand",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T22:52:49.000Z",
          "Titre": "I am excited to use this service but I…",
          "Contenu": "I am excited to use this service but I am disenchanted with having to wait seven days to get started. How can I refer others to use your service when I am instantly unable to. If you had made the introduction more clear as to how long my funds would be held, I may not be as disappointed as I  currently am. Upon signing up, I understood that I had to await irs verification, which has already been completed only to find my money still being held.I will review your service further and see about referring others once I am able to use the service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laurie",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T05:06:01.000Z",
          "Titre": "Failure to be able to log in…",
          "Contenu": "Failure to be able to log in consistently, delays on trades..  This kind of b.s. costs customers money.  No customer support?  Don't bother responding telling me to change browsers, either.  Get it together, or I'll get out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DAVE",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T14:18:57.000Z",
          "Titre": "Customer Service Leaves a Lot to Be Desired",
          "Contenu": "Website is difficult to navigate. They are not responsive at all. Did not get email reply back or a phone call back after several attempts, although they claim to have very responsive service. Lately, I have been working with a gentleman named Manan, who has been very professionally pleasant, responsive and helpful. Hire more Manans!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2022-01-20T18:32:31.000Z",
          "Titre": "I love the opportunity to hold and…",
          "Contenu": "I love the opportunity to hold and purchase crypto in my IRA. However, Alto and Capitalize seem to be still working customer services out. I have been unable to reach anyone by phone or email and get a quick answer during business hours. Emails responses seem to be sent at the end of the day and are already behind by the time I hear back. It is very frustrating. Now that all the funds are in my account trading is relatively easy. It would be great is Alto had a mobile phone app and the ability to consolidate multiple accounts so that I can see total investment without having to log out of one to go into the other. I hope things improve soon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T15:36:34.000Z",
          "Titre": "I found the process difficult",
          "Contenu": "I found the process difficult. The website was not user friendly. Instructions were not clear.When I tried to call my contact person @ 615-326-6326, a recording said: \" Not taking calls know, please call back later\".So I called back later (thinking it was a time zone issue. Same recording.)So I called Customer service: 877-673-1557. The gentleman said he was not qualified to help me but he will connect me to the transfer department. Guess what? He received the same recording: Call back later!!Lastly, when I went to print my receipt for my $100., it printed three pages for the receipt!! Probably done by the same person who did your website."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vernon Campbell",
          "Nb_Reviews": 5,
          "Date": "2022-01-20T00:39:03.000Z",
          "Titre": "I am new to crypto",
          "Contenu": "I am new to crypto, and the Help or Instructions are sorely lacking. Took me three tries to invest my money. Almost afraid to go back in, almost assuredly will mess it up. Alto dashboard leaves a LOT to be desired"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T02:26:35.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "Getting my funds rolled over into an Alto IRA was a nightmare. There were some issues with my former employer and former custodian which delayed the process (not Alto's fault). But once Alto got the funds, it was discovered they were sent to the wrong place and it took Alto forever to find them and fund my account. The issue throughout the entire ordeal was that Alto did not communicate at all with me. Every time I tried to email, I got an automated message back with no response from a service representative. Nobody at Alto has apologized or done anything to make the situation right. It's a real shame that the customer service is so poor, because the products Alto offers are good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dirk",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T02:12:25.000Z",
          "Titre": "Alto-Prosper additional investments, lack of directions or documentation",
          "Contenu": "Just starting out so this isn't a general review, just an initial point. Hard to know how to invest more money with Prosper and hard to get through for help with it.  Documentation outdated or doesn't explain process and long holds on phone support that either leads to an answering machine or hang ups.  Finally got Prosper to help me after several calls to Alto, though Prosper support didn't really understand the process either but they were able to text with Alto support and eventually we got it.  So now I know that additional investments need to be initiated from Prosper and not from Alto as one might assume.  So I'm good now, but just wish that was more plainly laid out, if not for me then for other first timers"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Overby",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T15:51:14.000Z",
          "Titre": "communitcation from team was verty…",
          "Contenu": "communitcation from team was verty poor, hard to get a hold of and took over 6 weeks to transfer my ira. was very close to going to a differetn IRA platform. Luckily for you all there arent many good crypto IRAs out there"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Arthur",
          "Nb_Reviews": 2,
          "Date": "2023-02-02T16:02:40.000Z",
          "Titre": "7 days is way too long to transfer in…",
          "Contenu": "7 days is way too long to transfer in cash."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Calvin H",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T19:40:07.000Z",
          "Titre": "Responsive to Begin With, Unreachable Now",
          "Contenu": "The team at Alto were extremely responsive to begin with and to get my new account funded. After trying to move funds out (the original opportunity did not come to fruition), I have not been able to reach anyone (all the customer service options lead you to voicemail, I get no response from the one direct phone number I have), email communication is delayed by multiple days or I receive no response at all, and the email response I have received just asked for information that was already included in the original email. Would like to hope this is due to being the end of the year but seems that is the time the team should have more resources and quicker response times and not the opposite. Hopeful for improvements in the future as I think they have a good model over all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Wood",
          "Nb_Reviews": 2,
          "Date": "2021-12-18T17:15:58.000Z",
          "Titre": "Customer service",
          "Contenu": "It's impossible to speak with someone on the phone. I think this company will do well. But more customer service is needed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2021-12-26T16:49:50.000Z",
          "Titre": "Website not allowing me to access my…",
          "Contenu": "Website not allowing me to access my account since late Dec 25th and now morning of the 26th.    I hope this is not a Scam."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-11T00:03:56.000Z",
          "Titre": "Alto was never set up correctly to take…",
          "Contenu": "Alto was never set up correctly to take Juva life business. In the end, I had to email alto to make sure the transaction completed!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "That Daily Deal Customer",
          "Nb_Reviews": 2,
          "Date": "2022-03-31T20:08:33.000Z",
          "Titre": "Slow time for funding verification",
          "Contenu": "Slow time for funding verification. Took a long time after funding before I was able to trade"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-20T16:36:54.000Z",
          "Titre": "Weak customer service",
          "Contenu": "difficult to get support on funding investments.  I've been working 2 weeks now on my latest support issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2022-02-05T07:04:12.000Z",
          "Titre": "Transferring funds",
          "Contenu": "Very unclear how to cash out and deposit funds back into the bank."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 6,
          "Date": "2021-12-05T14:47:38.000Z",
          "Titre": "The transfers team is non existent",
          "Contenu": "The transfers team is non existent. They do not respond to emails or call back. When I did get an email response, all they would respond with was a link to a FAQ.  The FAQ they kept sending me did not relate to my question and had to do with rolling over an IRA but I was rolling over 401ks. 401k rollovers are pretty straightforward. The transfers team had no idea what they were talking about, and kept telling me I needed to fill out paperwork for them to submit to my 401k administrator. 401k administrators do not accept 3rd party paperwork. The customer experience is terrible. I sent at least 5 emails asking someone to call me. They wasted my time, and they wasted their time sending all these incorrect email responses when all they had to do was pick up the phone.  With how terrible the customer experience is, there has to be a directive from leadership to not use the phones. Problems of this size within a company always comes down to leadership. I'm sure the transfers team was trying their best. They clearly were under trained, under staffed, and not supported. I asked for a call multiple times from a manager or someone who actually knew what they were talking about. This isn't a magazine subscription service. This is people's life savings. The only reason I stuck w Alto is because of their relationship with Coinbase and the options that provides for crypto choices. Terrible company. Terrible user interface. Terrible use experience. But currently, if you want to be able to choose crypto outside of the top 10 for your IRA, Alto is the only option. Maybe they know that and maybe that is why they are indifferent to the terrible experience they provide"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Yan",
          "Nb_Reviews": 1,
          "Date": "2022-03-12T16:36:35.000Z",
          "Titre": "it took two weeks for a wire transfer…",
          "Contenu": "it took two weeks for a wire transfer funds over ..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Infinity",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T02:54:26.000Z",
          "Titre": "The amount of follow up emails borders…",
          "Contenu": "The amount of follow up emails borders on SPAM level."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2022-04-25T03:36:02.785Z",
          "Titre": "Well the phone help was non existent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rich Henry",
          "Nb_Reviews": 2,
          "Date": "2021-11-26T23:05:44.000Z",
          "Titre": "Why do it take so long to transfer…",
          "Contenu": "Why do it take so long to transfer funds?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Quazi",
          "Nb_Reviews": 2,
          "Date": "2021-12-26T05:25:43.000Z",
          "Titre": "Fee is just too crazy high."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MT",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T03:57:09.000Z",
          "Titre": "Has potential, but still a long way to go",
          "Contenu": "Mobile app is not super intuitive. Would prefer to see Coinbase’s interface. I can live with these, but the inability to have multiple Crypto IRA types (eg Traditional and Roth) with a single email/login is extremely inefficient and a waste of both their and our time; it also creates additional risk of compromise. Customer service is very responsive and helpful. The partnership with Coinbase Pro to lower fees for active traders is very intriguing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T16:21:15.000Z",
          "Titre": "caution if rolling over from TSP",
          "Contenu": "sorry this couldn't be a 5--you guys are actually great and do have much better customer service than others...  BUT I was rolling over from the TSP.  And you didn't even know that you can't \"pull\" from TSP but rather I have to \"send\" from them?  and you didn't know I'd have to input your address then wait a week then request the rollover (meaning 2+ weeks total before funds actually are available)?  The problem is with the TSP and IT'S rules, but, you should know and advise anyone rolling over from TSP--come'on you can't tell me I'm the first Fed retiree to use you??  or am I ??"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T23:32:02.000Z",
          "Titre": "Overall reasonable service.",
          "Contenu": "Overall reasonable service.The big negative is that they don't participate in Yodlee. I think most Alto investors likely have enough assets to have their money invested elsewhere. And being able to see all of your assets in one place is nice. Sadly their hubris gets in the way"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Davis",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T22:27:18.000Z",
          "Titre": "Customer service is great, UX needs a lot of work",
          "Contenu": "Customer service is great, but man UX/UI needs a ton of work.  Very confusing to understand status of investment when funding via Angelist, for example.  I had to play ping pong back and forth; ultimately concluding that Alto was erroneously stating that Angelist needed to upload documentation.  Rather, they just activated the status right on the phone.Great potential, but they really need to redesign the interface big time IMO."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Wood Konecny",
          "Nb_Reviews": 4,
          "Date": "2022-06-15T17:57:46.000Z",
          "Titre": "Signing up based on Fox News",
          "Contenu": "I signed up to Alto based on your radio ads on Fox News.  I signed up for a Roth IRA to purchase crypto.  Somehow, I wasn't signed up right and then I called and somebody quickly changed to the correct account type.  A couple of other things: I wanted to purchase Digibyte crypto and found out I had to purchased something that was available through Coinbase.  I didn't know this prior.  Subsequently, I purchased Bitcoin.Also, your add on Fox News seems to indicate you and can set up an account for a minimum of $10.  Although that can probably be done, the ad does not say anything about the $100 fee to open an account.  I thought your radio ad was a little bit misleading."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 2,
          "Date": "2022-09-17T02:40:16.000Z",
          "Titre": "The Roll over process and addition…",
          "Contenu": "The Roll over process and addition funding is extremely slow and makes it impossible to take advantage of market swings. You need to plan a head and leave additional cash in the account and plan on it taking a week to get there, and 3 to 4 weeks for any kind of rollover"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 3,
          "Date": "2023-04-14T19:54:18.000Z",
          "Titre": "Customer support very hard to get a…",
          "Contenu": "Customer support very hard to get a hold of and the process was not as simple as described and took several days longer than planned and required significant back and forth to get everything set up and funded. That being said I did get a call as a follow up from one of the support folks and they did help eventually with items but again it took a lot longer than planned."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T16:44:58.000Z",
          "Titre": "Necessary for the custodian of my…",
          "Contenu": "Necessary for the custodian of my SDIRA. Painfully long process. Impossible to contact via telephone. Transfer now complete and happy it’s over."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2022-07-23T00:03:06.000Z",
          "Titre": "I'm still learning how to use your…",
          "Contenu": "I'm still learning how to use your platform but I would like to be able to transfer crypto from Coinbase or Gemini into my IRA account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Allan",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T19:30:03.000Z",
          "Titre": "It's quite difficult/frustrating to…",
          "Contenu": "It's quite difficult/frustrating to navigate/switch between my Alto IRA and Alto Crypto IRA account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T19:37:18.000Z",
          "Titre": "Very confusing process trying to…",
          "Contenu": "Very confusing process trying to transfer funds to the investment company. I was given wrong information by a guy on the phone and the website has poor instructions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T03:10:42.000Z",
          "Titre": "I like the fact I can invest in crypto…",
          "Contenu": "I like the fact I can invest in crypto through my Roth or Sep. the downside is they cannot be under the same login."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T18:30:27.000Z",
          "Titre": "Certainly not the best experience",
          "Contenu": "Certainly not the best experience.  Trading fees high.  Website is sparse."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GB",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T16:31:41.000Z",
          "Titre": "More attention would is needed.",
          "Contenu": "I felt like our overall process wasn't amazing to transfer the money into Alto.  It was a very complex process that involved many parties.  Alto has their way of doing it, but when dealing with large amounts of money I would like to have more support than what was provided.  In the end, the money was transferred, but I just feel like there could have been more supportive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AC",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T16:59:19.000Z",
          "Titre": "Good customer service, high fees",
          "Contenu": "The people and customer service has been quick and helpful, so that has been great. The user experience has also been pretty slick and easy online. The fees are high and weren't told to the investment company I did a private deal with, so we were both not prepared for the fees and it was too late to change to another IRA provider at that point."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CB",
          "Nb_Reviews": 5,
          "Date": "2022-05-10T02:38:19.000Z",
          "Titre": "Overall pretty good company with good…",
          "Contenu": "Overall pretty good company with good Selection of cryptos.  But two things are lacking I’ve found:1 It’s hard to get a complete list of cryptos that are available in the Alto IRA. Had to scroll down Alto webpage many times and write them down in my own list.  And if you could generally give category that crypto’s fall into that would be great, i.e. Hard to research on Alto as very little information is available.  2 Really be nice to have an IOS and Android app for Alto to check my account and place trades ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gerald",
          "Nb_Reviews": 1,
          "Date": "2022-01-20T17:07:51.000Z",
          "Titre": "Buy and sell, that’s it!",
          "Contenu": "Service is ok for what it has to give.  Don’t expect anything comprehensive.I don’t expect Alto to be an exchange, but the UI is archaic.  Minimal fields, minimal info.  You trade crypto from a drop down selection list.  This is not how it should be done.  Don’t expect charts or historical data or anything helpful at all.  You must already be in the know and educated with crypto and then you simply execute in Alto.  Don’t expect to research and be informed/educated on the platform.  You buy and sell, that’s it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roy",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T00:30:21.000Z",
          "Titre": "You need to speed up the funds transfer…",
          "Contenu": "You need to speed up the funds transfer process (from bank account to Alto).  I don't like waiting over a week for transfers.  I know it can go faster as I pay most of my bills the same way and they process within 48 hours.  Technology allows for faster processing with lower risk.  Other than that so far so good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T01:12:58.000Z",
          "Titre": "The Good and Not so good",
          "Contenu": "Set up was easy which is great.  But, being able to have access to my funds was less than stellar.  It showed my funds arrived at Coinbase on 27 October 2021, but subsequently has now changed to 28 October.  I called and asked about investing and was told there was a 24 hour hold and was assured I could access my funds at 12:30 CST on the 28th.  Well, I couldn’t and it is now 8 hours later and I still can’t access my funds for trading.  Do better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hamilton",
          "Nb_Reviews": 1,
          "Date": "2021-10-20T18:32:33.000Z",
          "Titre": "I'd be lying if I said I'm not…",
          "Contenu": "I'd be lying if I said I'm not concerned. After depositing a quarter of million dollars, I've experienced site outages, site hacks, transfer delays, and multiple links on the site that don't work. If I invested in a car or a boat for the same amount, I'd expect them to work out of the gates. But I've got my fingers crossed there are good folks in this new organization who are trying to do the right thing and are getting the bugs worked out as they go."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeannine",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T03:47:09.546Z",
          "Titre": "Lack of paperwork follow-up",
          "Contenu": "They sent the original paperwork to the wrong place and didn't follow up.  I called days later and the paperwork was sent to the right place right away.  However, I missed dividends this month because of their lack of following up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JH",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T23:35:13.000Z",
          "Titre": "Easy to use but man, the fees are high.",
          "Contenu": "Pros:  Very easy to setup and use, decent coin selectionCons:  The fees are 1.5% / transaction!  So if you buy and sell a coin, you will incur a 1.5 - 1.5 = 3% transaction fee.  I see that ITrustCapital's fee is just 1% / transaction.  Please become more competitive!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2022-05-20T00:18:10.000Z",
          "Titre": "Good, but could be better",
          "Contenu": "I chose Alto because they're based on Coinbase, whose setup and fees I'm already familiar with. However, there were several things that were not made clear to me in the marketing materials:1. Coinbase may underlie the system, but Alto has none of the features of Coinbase.2. Biggest among these is the ability to earn staking rewards.3. You also cannot move your crypto from your Coinbase account into your Alto IRA. You must first liquidate and pay taxes on the sale, then move it into the IRA. Which, if I'd known this up front, I would've set my Alto up as a Roth.I get that marketing materials are designed to get people to sign up, but things like this should definitely be clearer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nathanael",
          "Nb_Reviews": 1,
          "Date": "2021-10-17T03:00:24.000Z",
          "Titre": "Customer support was knowledgeable and…",
          "Contenu": "Customer support was knowledgeable and professional, I like their web interface and crypto IRA options but be aware that AltoIRA requires more work from the private companies you want to invest in than other self-directed IRA providers do. This prevented my investment from closing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James King",
          "Nb_Reviews": 2,
          "Date": "2020-10-14T20:14:22.000Z",
          "Titre": "This process took an excessive amount…",
          "Contenu": "This process took an excessive amount of time. I’ve dealt with IRA Custodians for 40 years and this was one of my most frustrating experiences. The reason I didn’t rate this lower was that Kate and Sang were trying their best. In the end, they got it done, but someone needs to take a hard look at Alto’s procedures with Angel List, which need significant improvement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas POWERS",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T21:29:19.000Z",
          "Titre": "Kate Mellinger was the key to my having a successful outcome. Thanks",
          "Contenu": "Kate Mellinger was great, and made the whole thing work for me. I  wasn't either getting the proper transfer paper work or made an error on my end - but I wasn't sure which. so my initial trasnfer acat was rejected.   There were also times that ALTO was I think waiting for things to be returned that  I think I may not have been given.  This was a test run for me, and it would be in my opinion very nerve racking to move large amounts of funds- while also  attempting to monitor and control my crypto exposure."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "custoner 3g",
          "Nb_Reviews": 2,
          "Date": "2020-01-31T04:20:09.000Z",
          "Titre": "Some issues but Very good to work with",
          "Contenu": "Very good to work with,  just wish when there is an issue, even on my end they would not leave it hanging in balance. Wish alto would contact me to resolve instead of me looking for my investment to be there. It was a signature issue that I was not notified about until asking. No notifications about pending, please contact us. No number to call. Once I did find out, very quick response and clearing of issue. Simple to invest with"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 3,
          "Date": "2020-04-10T14:52:31.000Z",
          "Titre": "Alto replied to me in a timely manner",
          "Contenu": "Alto replied to me in a timely manner, however they did not do a good job of continuing to keep me informed as to what was going on and I was the one who had to keep on inquiring, when instead they could have sent me periodic email to keep me up on the process. I think they are new. New people, they will probably get better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan M",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T19:51:00.000Z",
          "Titre": "Not the easiest online portal",
          "Contenu": "Not sure how it's supposed to work since it's my first time. Since I had to send a few inquiries about the status, that should tell you that the online experience wasn't exactly easy to get through. If I was to compare the Alto experience with that of e-signing loan documents to buy a house, buying a house was easier. There was no question of what steps needed to be completed, what needed to be signed, what to expect next, etc. With Alto, it was somewhat confusing. Other than that, it seems to work fine.Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MK",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T14:01:22.000Z",
          "Titre": "The website is messed up",
          "Contenu": "The website is messed up. I had all sorts of problems uploading documents. I did it multiple times and then had people emailing me that I needed to upload my documents. I couldn't even download the documents to email them in for a period of time...I was finally able to download and so I could manually upload them on the webpage, It said it worked, but then I was notified I still needed to do it. I went back to the website and there was no indication that I uploaded anything. i was finally able to download and email the scanned hard copy in. Hopefully the crypto investing process will be much more customer friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Rickelman",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T15:48:00.000Z",
          "Titre": "Had to help push the investment along",
          "Contenu": "It felt like my investment was stuck, not going anywhere. Once I reached out the transaction was completed. I’m new to Alto so it may run smoother on future investments. Alto was very responsive once I reached out which I greatly appreciated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KG",
          "Nb_Reviews": 1,
          "Date": "2021-09-26T16:30:29.000Z",
          "Titre": "Initially impressed",
          "Contenu": "Sign up process and bank account transfer was really easy...was impressed. However, they just stopped the checkbook LLC program which is one of the main reasons to open an SDIRA...very disappointed about that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cap",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T14:42:17.000Z",
          "Titre": "I might be a bit harsh on giving 3…",
          "Contenu": "I might be a bit harsh on giving 3 stars.  The time lapse from submitting my funds to getting them to the issuer my not be all your fault.  It might have been due to my lack of knowledge, multi country dealings, Reg A investment … Don't know."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert McGurty",
          "Nb_Reviews": 5,
          "Date": "2021-07-29T16:51:04.000Z",
          "Titre": "Seems sketchy right now...",
          "Contenu": "Update- am giving 3 star. They are trying but it is screwed up - they got cyber attacked and closed down for a few weeks while trying to fix things. In the meanwhile, I made two deposits which did not show up nor did the company have the decency to communicate except to say 'we were shutdown because of a cyber attack'. If your shut down and a deposit is attempted... Anyhow, might be a good company, but my trust is not high. I will be glad to update the review if the issue is fixed. The problem is that AltoIRA was not chosen by me but by Lending Club. It seems they had a breech of security this month but there were 4 transfers for $700 that do not show in my account between July 8 and July 20th. But the transfer of July 22 does show. Not good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "robert anderson",
          "Nb_Reviews": 1,
          "Date": "2021-01-14T00:08:14.000Z",
          "Titre": "Miscommunication and missed forms.",
          "Contenu": "Miscommunication and missed forms.It would have been a better experience if Alto helped me along this process a little more. I sent a few email asking about certain required forms. I was sent back a vague email. I tried to follow the instructions and sent a follow up email with what I thought were the correct forms It took too long to hear back from Alto saying that they were not filled out correctly. Everyone knew that I wanted to get my funds back into BTC as quickly as possible. I was not informed about a couple of missed items until later in the process which unfortunately made me wait another day to get my funds into the Sky Bridge fund. I understand that this a brand new fund... just wish the communication was better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 3,
          "Date": "2020-11-20T17:41:51.000Z",
          "Titre": "I was very frustrated...",
          "Contenu": "I was very frustrated that every time I followed a “final” step, I was then requested to do another “final” step...several times I am thankful to be past that but it was awful"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T18:36:05.000Z",
          "Titre": "WEEKEND HELP SHOULD BE AVAILABLE",
          "Contenu": "Waiting for information requested Friday and Saturday. Help should not be limited to work days/hous as Crypto markets operate 24/7."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2021-11-24T21:54:15.000Z",
          "Titre": "Order Status Does Not Update, No current market quotes",
          "Contenu": "It’s great to be able to get a hold of a customer service representative and report a problem. I don’t know how long it will take to fix it. When I put in a market order and a limit order for cryptocurrency in my crypto IRÁ my order status did not update until I tried to cancel the limit order and then it said it had already been filled. The market order never updated until I logged out of Alto and logged back in. The fill price on the market order was not very good and I know that because I was watching the price as I put my order in.  Limit orders are a much better way to go. Also, you can’t see what the market price is on the Algo website. You have to find another website to see what the current market price is so that you can set your limit orders.  I hope they can quickly get it fixed so that you can see that your orders fill right away and also so that you can get current market data on the Algo website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Owen",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T18:04:33.000Z",
          "Titre": "It's not bad, set your expectations though",
          "Contenu": "Response from sales on-boarding team is solid.  They are patient, knowledgeable, and quick to respond.The transfer of funding took several weeks, via check from a brokerage account.  Quite slow and started to get me worried. If you magnify your computer text, some of the UI may be too large to fit your screen.  Try reducing your magnification or accessing with different monitor/screens.This is an observation per Coinbase, not AltoIRA: The coin selection is from Coinbase and be aware it is ethereum-based.  (I noticed some exchanges favor the blockchain they're built on, such as Binance.US has more BNC/Bep20 coins). There's still 1% transaction fee. (pionex offers 0.05%, Binance.US offers 0.1%)This is an observation per CryptoIRA's in general: You will not be able to withdraw the coins for usage: eg. staking, lending, nor decentralized financing. This currently should be seen purely as a ROTH-protected trading platform with 1% trading fee."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kenton van acker",
          "Nb_Reviews": 2,
          "Date": "2022-02-04T21:25:57.000Z",
          "Titre": "I like the ability to trade tax free…",
          "Contenu": "I like the ability to trade tax free but this site gives no info on the crypto you are about to purchase. Bid/Ask volume no indicators."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debra Redd",
          "Nb_Reviews": 3,
          "Date": "2022-01-10T14:45:48.000Z",
          "Titre": "since this is a new account and nothing…",
          "Contenu": "since this is a new account and nothing has actually happened on the account it's hard for me to give any other review at this time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T17:41:27.000Z",
          "Titre": "Your company is pride to provide fast…",
          "Contenu": "Your company is pride to provide fast turnaround time to managing alternative investment through IRA. However, there a significant lack of prompt customer service. E.g. I request Xxxx(name omitted per request of alto) multiple times to call me back, without follow through by phone most of the time. His colleague Jxxx, is very helpful though by calling me back later.  Very frustrating to have a deadline, without being able to find anyone to talk to. There was significant difference on the name of the subscriber when filling out paperwork. I feel like I’m literally signing my money away to the trustee/alto which I had no experience  working with, e.g. I basically relinquished all the signing right (about nine permissions) to the CEO of alto. The bottom line is you have to trust a trustee that you have never worked with, by signing lots of document under deadline pressure. I wish I had more handholding and reassurance during this brand new process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Ditmars",
          "Nb_Reviews": 2,
          "Date": "2021-11-19T23:16:06.000Z",
          "Titre": "AltoIRA is a breath of fresh air in the…",
          "Contenu": "AltoIRA is a breath of fresh air in the crypto IRA space since it is the first to provide an IRA with reasonable fees.  But, be aware they appear to be just getting their feet on the ground and patience is required.  Your deposits to your IRA must first wait to clear before they are available in AltoIRA and then there is another wait while the deposit clears in Coinbase. Also, your trades are not reported as executed in the timeframe you may be accustomed to when trading directly with Coinbase.  My last trade last night reported it was executed about 15-30 minutes after I submitted it.  Lastly, the dashboard does not show your profit/loss on any holdings.  I hope this enhancement to the dashboard is coming soon.I believe AltoIRA is a good crypto IRA product enabling investors to make profits in crypto without the worry of paying taxes on every gain.  AltoIRA is definitely worth 5 stars once they have further developed their product.  I'm very happy to have found them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-08-23T23:17:03.000Z",
          "Titre": "Full of delays",
          "Contenu": "Took 24 days from start to finish for a fund transfer. Poor responses and no oversight on the process. It’s a good idea but execution is lacking."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Virginia",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T21:34:33.000Z",
          "Titre": "The starting up process was difficult",
          "Contenu": "The starting up process was difficult. We were set up in with the wrong forum for what we needed. It took weeks to figure that out and fix it. It did not help that it was the holiday season. AltoIRA and CryptIRA need to have clearer distinctions for future investors. I looked through the help tabs and they were not helpful at all.The assistance from support was also very delayed. We spoke to one person who could not get us to the correct platform or simply did not understand the issue. We almost pulled all the money out of this platform and were ready to go somewhere else. However, we decided to try one last thing.We scheduled a call with another person from support. His name was Dallas and he was very helpful and fast. I had emailed him the problem the night before our call and in detail explained the issue and what I was seeing on my end. He realized what was wrong, the issue was resolved the even before our scheduled call. He also tried his best to make it so we were able to start investing in cryptoIRA that very night.Once you are correctly set up, the process for buying crypto is very easy and this part is user friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron Tucker",
          "Nb_Reviews": 4,
          "Date": "2020-03-12T22:07:07.000Z",
          "Titre": "wanted to use two IRA accounts to…",
          "Contenu": "wanted to use two IRA accounts to invest with Masterworks and Alto only allows the use of one account. disappointing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BLines",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T00:35:52.000Z",
          "Titre": "Better if you had an app",
          "Contenu": "Better if you had an app. Website layout could be better. Concept is good though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "P.A",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T03:03:07.000Z",
          "Titre": "So far so good!",
          "Contenu": "So far so good will update review after a few months to see how the mechanics work!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vincent Van Cour",
          "Nb_Reviews": 2,
          "Date": "2021-11-21T21:25:31.000Z",
          "Titre": "Quick to ask",
          "Contenu": "Just signed up and already asking me to rate it with minimum exposer with the app"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim Hundley",
          "Nb_Reviews": 2,
          "Date": "2022-04-07T18:28:18.000Z",
          "Titre": "The communication between you and…",
          "Contenu": "The communication between you and Republic.co leaves much to be desired."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Cox",
          "Nb_Reviews": 2,
          "Date": "2022-01-17T03:52:25.000Z",
          "Titre": "takes too long to buy crypto probably…",
          "Contenu": "takes too long to buy crypto probably won’t continue to use this site"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Bellini",
          "Nb_Reviews": 2,
          "Date": "2022-01-25T00:55:22.000Z",
          "Titre": "Needs better tech than a web interface",
          "Contenu": "Needs better tech than a web interface. Where is the mobile App????"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CARLOS",
          "Nb_Reviews": 5,
          "Date": "2021-12-16T17:39:54.000Z",
          "Titre": "Could be better response times via…",
          "Contenu": "Could be better response times via email and website not friendly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T17:25:27.000Z",
          "Titre": "Mobile view caused lots of issues",
          "Contenu": "Mobile view caused lots of issues. Requires a lot more testing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T18:41:06.000Z",
          "Titre": "New user experience",
          "Contenu": "No mobile app.  Staking not available. Easy to use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy Zacher",
          "Nb_Reviews": 1,
          "Date": "2022-04-03T14:52:08.000Z",
          "Titre": "Getting good clear communications was…",
          "Contenu": "Getting good clear communications was an issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HIPOLITO",
          "Nb_Reviews": 1,
          "Date": "2021-10-16T21:13:40.000Z",
          "Titre": "Takes way too long to fund",
          "Contenu": "Takes way too long to fund. Not a great start"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T19:41:27.000Z",
          "Titre": "Initial experience overall good",
          "Contenu": "Easy to set up account. Helpful assistance with questions. On the downside, complex to set up investment in an LP and somewhat difficult process for transfer of funds to my account from the LP but has seemed to work out so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jenna Smith",
          "Nb_Reviews": 3,
          "Date": "2023-08-20T09:55:12.000Z",
          "Titre": "Fee structure changes which is a pill",
          "Contenu": "I wrote a review before and wanted to update. The company has been good and I've enjoyed the service. They did just change their policy to incorporate a % fee based on investment amount which I dislike. Doesn't make it much better than other services if you're comparing apples to apples. May be better in offerings available but you'll have to do your own dudiligence. Wanting to share for transparency as this was added a couple weeks ago."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S Dil",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T21:21:06.000Z",
          "Titre": "Service team very responsive.",
          "Contenu": "The service team was very responsive and proactive in following up. I did feel like I had to do more work to get my assets transferred from my traditional IRA provider, and they were not trying to be helpful with how to move some of my assets out. It would be great to have Alto jump in to this a little more to minimize the burden of me having to figure this out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alto customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T18:09:42.000Z",
          "Titre": "Great progress need a bit more",
          "Contenu": "Great to see Alto new launch and progress. Three things I would like to see improve. 1. No ACAT, please can we enable that. Currently disjointed online and offline process of paper to transfer funds from another custodian. 2. Would have like to see new additional investment choices, waiting for them:) . 3. Way to add more beneficiary information especially people living overseas."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T00:01:49.000Z",
          "Titre": "Most of the process of establishing an account was easy and seamless, but...",
          "Contenu": "Most of the process of establishing an account is straightforward, but once I had it going, trying to invest in a not-already-established venue is a bit tricky, with things like a \"call\" being required.  But I didn't know that for 3 days, until I asked Lindsey why, when I was told 3 days earlier that everything was a go for the transfer of funds, nothing was moving.  Turns out the investee had to place a \"call\" before funds could be transferred.  Not a big deal, but a bit frustrating.  Otherwise, I'd have given the process 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S.P.",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T01:23:48.000Z",
          "Titre": "Process wasn't always intuitive, but GREAT overall!",
          "Contenu": "The process wasn't always intuitive, from getting money into a new Crypto IRA account, to then using it to invest in Crypto and give shape to the IRA. Alto could use more and better 'in process' helps and information all along the way especially for those new to the Crypto world. However, their support team has been very responsive and very willing to help all along, which made up for any lack within the software and tools. Very happy so far, overall!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EE",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T22:14:16.000Z",
          "Titre": "Very good experience overall",
          "Contenu": "Good things:- Customer support and overall response is 5 star- Fees are the lowest between the IRA crypto institutions. 1% buy and 1% sell.Things that can be improved:- Coinbase trading fees are now much lower, why not lower it on the IRA accounts so we can buy and sell when we really want. Or offer this yearly payment program coinbase offers.- Would be nice to offer an earn program on stable coins and other coins. Partner with Nexo or some good lending platforms.- Would be nice to offer staking."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T04:14:37.000Z",
          "Titre": "The company was very professional…",
          "Contenu": "The company was very professional regarding user experience. That said, I made the mistake of investing in crypto. I will never do that again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caren",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T19:36:04.000Z",
          "Titre": "Excellent customer service both through…",
          "Contenu": "Excellent customer service both through email and phone. Questions were answered thoroughly. Fees for each account type should be more up front and clearly stated before the account opening process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Syx",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T01:26:15.000Z",
          "Titre": "Great service, but needs more features",
          "Contenu": "Alto allows me to invest in crypto in the only place that I have money available, my retirement account, which is awesome!!! However, the fees create a disincentive to trade and the inability to stake makes you get diluted by others who can. I have no doubt they will improve and allow you to take full advantage of what crypto has to offer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T01:59:33.000Z",
          "Titre": "Exercise care answering investment questions",
          "Contenu": "The site worked well. Users need to exercise caution using the site as a wrong answer to a question is difficult to undo without contacting very helpful customer support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Salvador",
          "Nb_Reviews": 1,
          "Date": "2022-07-17T00:55:05.000Z",
          "Titre": "Initial Experience with Alto",
          "Contenu": "Overall the process was relatively smooth with the exception of a minor issue finalizing my asset transfer from E-Trade. However, that was promptly addressed. I was very glad that Alto staff kept me updated regularly and quickly followed up on any concerns/questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helena Hamilton",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T02:09:39.000Z",
          "Titre": "Not a good start - but recovered well",
          "Contenu": "I signed up with AltoIRA and initiated a transfer from my Principal account. Principal sent the wire on 7/21/2022 and AltoIRA acknowledged getting it on 7/22/2022. I was told that transferring my funds into Coinbase would take \"up to one business day\". So far so good! Then things took a turn. The transfer of my funds into Coinbase was mysteriously cancelled on 7/22 and the funds remain unavailable. Repeated inquiries have resulted in polite, but unhelpful responses: \"I've opened a ticket\", \"We're trying to see what's going on\", etc. If I had wanted to just let my funds sit there, I could have stayed with Principal. I'm a day or two from just initiating a transfer out of AltoIRA and into any one of the many other options available out there. So as of now, I can't recommend AltoIRA, they've gotten off to a poor start.Update: not long after this review, AltoIRA was able to complete the transfer and make my funds available. And after that initial glitch, things have been much smoother."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2022-06-15T02:14:38.000Z",
          "Titre": "Hard for me to tell if some of the…",
          "Contenu": "Hard for me to tell if some of the issues where on our end or Alto's end, but process took longer than I expected.  However, the customer service as outstanding and the interfaces are very well done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T00:26:07.000Z",
          "Titre": "I am very pleased with the site and…",
          "Contenu": "I am very pleased with the site and ease of navigating and purchasing of assets. Although, a great number of crypto is available, there are some projects that are not available that I wish were."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KB",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T07:18:32.000Z",
          "Titre": "Alto is great on email support",
          "Contenu": "Alto is great on email support, but when it comes to getting someone on the phone, good luck!  They are very under stiff for phone support; I was never able to get them on the Phone.  They would put me on hold, then after about 10 minutes, hang up on me!  How rude.  I thought if I became a client, they would judge my call as a VIP and answer my call, but no such luck. I prefer phone support because it's so much quicker that typing out an email."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T18:52:37.000Z",
          "Titre": "Customer service to restore access via…",
          "Contenu": "Customer service to restore access via password and code worked great.  Took couple of days though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marian",
          "Nb_Reviews": 1,
          "Date": "2022-08-07T18:30:46.000Z",
          "Titre": "FINALLY ALL DONE",
          "Contenu": "AFTER A VERY EXTENDED PERIOD OF TIME GETTING AN ACCOUNT SET UP, IT WAS EASY MAKING PURCHASES.JENNIFER AND KIELY WERE VERY HELPFUL IN GETTING MY ACCOUNT AND 2-FACTOR AUTHENTIFICATION SET UP AND I AM VERY THANKFUL FOR ALL THEIR ASSISTANCE."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T19:31:02.000Z",
          "Titre": "Very slick process",
          "Contenu": "Overall I was very pleased with the process. The only reason I didn’t give five stars is that the transfer of funds to Coinbase took longer than what was explained to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T06:17:33.000Z",
          "Titre": "Thank you for your platform.",
          "Contenu": "Thank you for your platform.The roll over went smooth and the communication was spot on.My Roth is now investing in something I believe in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 2,
          "Date": "2022-07-01T21:22:38.000Z",
          "Titre": "The staff on the phone was very helpful…",
          "Contenu": "The staff on the phone was very helpful and polite. Also, the communication via text and email were timely. It would be nice to set up transfer via ACH with our bank vs. a third party software."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "SS",
          "Nb_Reviews": 8,
          "Date": "2022-11-04T18:02:34.000Z",
          "Titre": "In Good Hands",
          "Contenu": "• Customer service was very professional, prompt, and expert • Automation of some steps would’ve made experience better• Overall quite good and cool"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T05:15:55.000Z",
          "Titre": "Almost there",
          "Contenu": "There are some things you just won't allow. Staking, one login for 2 accounts, one price to convert coins..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 2,
          "Date": "2022-06-12T17:38:00.000Z",
          "Titre": "Worked well with a slight problem…",
          "Contenu": "Worked well with a slight problem connecting to the investment co.  Also accidentally pulled two allocations of funds instead of the one requested."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victoria Valid Solutions",
          "Nb_Reviews": 2,
          "Date": "2022-08-04T18:04:01.000Z",
          "Titre": "Sign up on Alto",
          "Contenu": "Was a pretty easy process - took some time to get approved which I was surprised with but ok"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Farah",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T20:03:01.000Z",
          "Titre": "The representatives were very good at…",
          "Contenu": "The representatives were very good at their jobs and were helpful answering my questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T20:24:38.000Z",
          "Titre": "The customer service rep was very…",
          "Contenu": "The customer service rep was very friendly and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-01-13T01:15:29.000Z",
          "Titre": "Good response time on email",
          "Contenu": "Good response time on email. It would be nice to have a number to call as an option"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Bichler",
          "Nb_Reviews": 3,
          "Date": "2022-06-18T23:11:02.000Z",
          "Titre": "Need to make bank transfers quicker…",
          "Contenu": "Need to make bank transfers quicker than 7 days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JT",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T23:06:14.000Z",
          "Titre": "Excellent onboarding",
          "Contenu": "So far, I haven't had much time to utilize the platform (trading, etc.), but the onboarding experience was great. An Alto representative immediately contacted me about a rollover I initiated and helped as the process completed over the course of a few days (the time delay was not Alto's fault). Looking forward to using the service more! One suggestion: mobile app 😉. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T14:49:00.000Z",
          "Titre": "Alto IRA - pretty good but didn't get contact back",
          "Contenu": "Received this email from Alto to write a review.  I had some trouble funding my outside investment with their partner affiliates.  It ended up getting done, but I did send a request to Alto for some assistance and received no communication back.  Thankfully, the partner affiliate reached out directly when I contacted their site and the investment was then funded.  It is a good self-directed IRA, I just don't fully understand what the disconnect was and is."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A typical IRA investor",
          "Nb_Reviews": 2,
          "Date": "2022-05-03T21:28:33.000Z",
          "Titre": "Online platform offering digital management of your IRA",
          "Contenu": "Online platform offering streamlined, digital management of your IRA. Issuers use the same digital platform to upload your deals so the investment process is fast all around. AltoIRA does not yet have an app but the browser interface is simple and seamless. Alto supports alternative assets like pre-IPO equities. They do not yet support listed stocks—hopefully they will soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M.A.",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T18:38:56.000Z",
          "Titre": "Growing Pains but ok",
          "Contenu": "Service is relatively new so still experiencing some growing pains but a) the customer service is responsive and b) the variety of alternative investments is growing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T03:10:53.000Z",
          "Titre": "Solid representatives and great…",
          "Contenu": "Solid representatives and great communication.I filled out info to open account and that went smooth, them dealt with my bank TD to get the money out of my IRA-CD and TD fumbled there, no fault of Alto. The bonus to it all was days went by before TD resolved their issues and in the mean time my Alto crypto account passed the 7days no trading compliance rule. So no sooner the funds landed in account I was literally buying every cyrpto I had on my list! Good times. Lets see if cryptos now become something of value over next decade!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T08:05:31.710Z",
          "Titre": "Happy Customer",
          "Contenu": "Alto IRA’s customer support was fantastic in getting me set up with my crypto IRA. I’m very happy to be able to add these alternative investments to my portfolio. My one gripe is that Alto doesn’t offer crypto staking or an earn feature with their crypto selections. That would be a HUGE and I believe, necessary addition needed ASAP. All-in-all I’m happy with my choice of using Alto. The application & setup process was a breeze, and the friendly support is there when you need it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ron",
          "Nb_Reviews": 2,
          "Date": "2022-05-22T18:56:01.000Z",
          "Titre": "Customer service makes up for flaws",
          "Contenu": "Customer service makes up for flaws.  1.  Overly complex process to transfer a rollover check you receive from a custodian and send to Alto.  2. System didn’t automatically and timely update my dashboard on a limit buy order.  Update took over 12 hours plus a call to customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2022-06-01T03:54:20.000Z",
          "Titre": "Alto, a trusted resource for alternative investments",
          "Contenu": "Alto appears to be a trusted resource for alternative investing and retirement planning.   I look forward to capitalizing on the ease of use, and quick access to support.The only drawback to setting up an account will be if the bank that you use to fund the account is not listed in the Plaid application Alto uses. There is no resolution for that at this time, although there are alternative methods to fund your account.  I started a checking account with a bank that was recognized in the Plaid app, and local to me.  Funding my account was simple at that point."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T22:50:59.000Z",
          "Titre": "Transfer from LPL IRA to Alto IRA for…",
          "Contenu": "Transfer from LPL IRA to Alto IRA for an investment via website was somewhat confusing.  Web site stated I needed a Medallion Gold stamp was required from my Broker (LPL).  When contacted LPL only does Medallion Gold stamped on $250,000.00 or higher.  It would have been easier if I was told to have LPL just send a check with my \"wet\" signature.  Alto was very helpful in setting up my account, only when the transfer needed to occur is where I had some issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margaret",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T11:22:29.459Z",
          "Titre": "A snaffu and a fix",
          "Contenu": "A snafu and a fixThere was a time lapse between the check being deposited at Alto and the funds moving to my account because more paperwork needed to be filed.  The snafu was that it was not obvious that this was necessary.  The fix was that the \"help desk\" was extremely helpful and timely in their responses. Since initially funding my account, I have asked several questions and have had timely responses both by email and by phone.  The people who help new users like me get 5 stars.  Also getting 5 stars is the ease of trading."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2022-01-30T18:49:09.000Z",
          "Titre": "I've had a good experience with alto…",
          "Contenu": "I've had a good experience with alto overall with one exception. The time between opening my account and being funded was slow. Almost a month. The slowest part was when Alto received my funding and held it for approximately two weeks before releasing it. I could be wrong, but that seemed very excessive in today's world. Customer service was friendly along the way."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T04:08:53.000Z",
          "Titre": "The customer service and selection are…",
          "Contenu": "The customer service and selection are A+ top notch. I have to give 4 stars however because like most of crypto, the website UI/UX is clunky.  The team helped update my paperwork but the website still says it's outstanding. Also the website is not the easiest to navigate and I sometimes just find it easier to log off and then back in. Once this is updated you got a race horse here!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AJ Perko",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T05:57:42.000Z",
          "Titre": "Chose ALTO over ITrust",
          "Contenu": "I was not able to roll my ROTH 401k over to ALTO.  However, I was advised before that it was unlikely I would be able to as I was still employed.- that said, I opened an account anyway.  -- Not crazy about the 5 day settlement period.  But the main competitor Itrust Capital wanted $2500 to open the account and I wasn't comforable with that.  -- That said, so far so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T23:12:04.000Z",
          "Titre": "It's like having Coinbase access with…",
          "Contenu": "It's like having Coinbase access with your IRA which is cool, trades are not instantaneous however, and they charge 1.5% of the transaction amount per trade But hey it's still not as bad as Eth gas fees. It's Good if you're a hodler and you want exposure to crypto and you trust Coinbase. Unfortunately due to the nature of IRA custodial accounts you don't have the option to move your holdings to a cold wallet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Troy",
          "Nb_Reviews": 1,
          "Date": "2022-04-10T20:23:45.000Z",
          "Titre": "First interactions",
          "Contenu": "Very responsive process. Simple and well communicated. Money transfer process could be better automated where you don’t need to repeat steps every time  you do new transfer…..and lower minimum need per transfer so money doesn’t have to sit in account unused until needed."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Erik",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T03:51:38.391Z",
          "Titre": "Staking Options?",
          "Contenu": "Everyone I have dealt with at the company has been very helpful but I don't like not having any options in regards to staking, DeFi, NFTs, etc.  Hopefully you will offer something like the interest that Coinbase offers, at a minimum, in the near future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2021-11-28T07:47:00.000Z",
          "Titre": "Good",
          "Contenu": "Everything has been good so far with Alto CryptoIRA it’s very simple to place trades. The reason it doesn’t get 5 stars is because of the 1.5% fee I wish it was lower it eats up my profit, and I wish they had an app so I could access it and make trades on my cell phone easier instead of the web browser. Hopefully these changes will take place in the future"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay No",
          "Nb_Reviews": 2,
          "Date": "2022-04-14T19:13:06.000Z",
          "Titre": "Great App - Worth the Time!",
          "Contenu": "So far, I have been using this app for a few weeks and have REALLY liked what I have seen, experienced, and read within this app! It has a great user interface, is very easy to use and navigate, fast load times, and all-around straightforward and seamless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Neal",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T16:01:57.000Z",
          "Titre": "First Self Directed Investment",
          "Contenu": "I just completed my first self directed investment on the Alto platform. The process went relatively smoothly. Since this was an investment in a private company that was not on the Alto platform, there were a few extra steps to go through. I was able to connect with Josh in Support and he was very helpful. It would be good for Alto to provide more detailed explanation of the process of getting an investment done that is not on the Alto partner list. This was not a big obstacle, but added a few steps to the process and took a couple of days longer than originally expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T15:33:43.000Z",
          "Titre": "The account opening process is great, but...",
          "Contenu": "The account opening process is great, but...waiting the 7 days restriction even though the money has been transferred in is not acceptable. Should have an option to waive that restriction. When I fund my ROTH IRA account at a brokerage firm and the funds clear in 24 hours, I can trade immediately. Also, need to have a better interface for trading cryptos. The delay in pricing information and in reporting an execution even though you are using Coinbase which replies instantly when trading directly seems unusual."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DENNIS",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T00:45:27.000Z",
          "Titre": "It was very easy to set up my Alto…",
          "Contenu": "It was very easy to set up my Alto CryptoIRA account.  I was able to jump right in and make trades after the required 7-day period.  My only suggestion for improvement is to include more Crypto investments.  I could only find 2 of the names I am interested in.  At least it's a start."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike S.",
          "Nb_Reviews": 9,
          "Date": "2021-11-25T12:47:08.000Z",
          "Titre": "Great for the Self Directed",
          "Contenu": "The website did a great site setting my expectations.  Fortunately, I don't need much hand holding and got everything done that I needed.The only comment I have is the slowness in communication.  Twice I called and left voice mails with specific questions but never received a return call.While I did get some personalized emails, when I asked questions it took at least a day before I received a response.For a client who likes to be self directed, I would highly recommend Alto."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2021-10-02T17:31:00.000Z",
          "Titre": "Experience mostly positive",
          "Contenu": "Louis was very knowledgeable and responsive in helping me with my investment.  The experience with the rollover process could have better as there should be an option to indicate you are initiating a check-based distribution from a previous employer 401k plan.  It is not always possible to state the value of the rollover until securities are sold."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kurt",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T22:03:12.000Z",
          "Titre": "On boarding has been good so far",
          "Contenu": "On boarding has been good so far. Jimmy has been good about reaching out and making sure I am on track. I have made my first trade and it was easy. I have no complaints at all so far other than funds are slow to get to the account but really it is only a few days. If you are  patient you will be happy.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PIYUSH",
          "Nb_Reviews": 5,
          "Date": "2022-01-25T13:34:44.000Z",
          "Titre": "Everything is Good",
          "Contenu": "Everything is Good , However Taking Long time to Get Fund Transfer & Available to Trade .  Has Coinbase account also they allow instant Trading upon ACH perform . Here also my CIRA account linked with Coinbase then why not immediately Trading permitted ? In 2-3 days lots changes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2021-09-11T01:38:16.000Z",
          "Titre": "Alto is great",
          "Contenu": "Alto is great! Super easy to use and the value  of a self directed IRA that allows trading in all major crypto is amazing in itself. I would absolutely recommend Alto and I can’t imagine an IRA being much easier; my only complaint is actually with coinbase, who Alto uses as an exchange, and their lack of new, promising projects that I would like to pour more of my money into! Thanks, Alto. I would say you’ve changed my life with your IRAs"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TOM",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T18:12:02.000Z",
          "Titre": "Generally speaking",
          "Contenu": "Generally speaking, Alto's response is fast and accurate, and cares about customers' experience. It also allows regular Roth and crypto Roth. This combination is very useful for people looking forward to strong development in digital arenas."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Boghossian",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T03:23:00.000Z",
          "Titre": "Great Reps.",
          "Contenu": "Great Reps.,  Who Follow up and do the Job Right."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T16:43:58.000Z",
          "Titre": "New to your service",
          "Contenu": "New to your service, so giving four stars since service has been good so far.  I did have an onboarding issue concerning funding my account.  Your site does not seem to be capable of handling names such as mine that contain an apostrophe.  Needed to remove the apostrophe to get past an Unexpected error  500."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2022-02-02T00:45:57.000Z",
          "Titre": "Very satisified with people but process can be improved",
          "Contenu": "Overall - very good experience with the ALTO people.  Quick to respond, easy to work with, can fix issues quickly.  ALTO needs to fix the automatic sweeping of funds into Coinbase once they arrive in the ALTO account.  This fund transfer needs to be done on a manual basis by the account holder.  Took several days to get this money back out of Coinbase and into another standard account. Would highly recommend the ALTO IRA based on customer service, speed in correcting my \"sweeping\" issue, and access to a large enough selection of Coinbase crypto coins to buy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2022-04-03T21:35:52.000Z",
          "Titre": "Good with minor hiccups",
          "Contenu": "Generally good but hiccups by not being told about medillion signatures needed , wasn’t familiar with my prior IRA trust company and took a few emails to get link to company I wanted to invest in to work the first time . Eventually worked out ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tough Customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-03T19:16:59.000Z",
          "Titre": "Better than iTrust Capital",
          "Contenu": "My only “complaint” is the time it takes to do a ROTH conversion and have funds available.  During that wait time, prices increased and I bought at higher than I wanted.  Otherwise, smooth operation and significantly better than iTrust Capital."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JS",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T03:13:39.000Z",
          "Titre": "Executing a buy was slow",
          "Contenu": "Executing a buy was slow.  It took a day to get a response that my trade went through.  Looks like you're using coinbase.  I have a separate account there and it takes seconds to execute.  Not sure whether the price was when I elected to buy or when the trade was executed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edgar",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T01:51:31.000Z",
          "Titre": "I love the ability to invest not only…",
          "Contenu": "I love the ability to invest not only in a traditional IRA but a crypto IRA and gives me a variety of choices and coins that I can invest in my only disappointment is that it doesn't have a app yet that makes it a little easier to access and track my investments in real time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2022-06-19T07:48:07.000Z",
          "Titre": "Awesome!!",
          "Contenu": "Love the idea of having this account. Great app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vinny",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T20:24:41.000Z",
          "Titre": "Overall I was pretty happy with…",
          "Contenu": "Overall I was pretty happy with interface and customer service. The one thing that annoyed me was the fee structure, which was masked and not fully disclosed until time and energy was set up. It is not as inexpensive as they lead you to believe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vince Hamon",
          "Nb_Reviews": 4,
          "Date": "2021-11-08T00:03:58.000Z",
          "Titre": "Im excited that there's an IRA option…",
          "Contenu": "Im excited that there's an IRA option for crypto! However, my initial contribution was bumpy: several days after I initiated my first transfer I got notice that it had failed due to technical problems. So I had to start from the beginning---entering bank snd account info."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Monica",
          "Nb_Reviews": 11,
          "Date": "2021-01-01T12:52:56.000Z",
          "Titre": "Customer service inaccurate on timing",
          "Contenu": "I funded my Alto IRA with my Vanguard retirement and the process was very quick. I was assured by Alto customer care that the funds would be available \"right away\" for a wefunder investment that I wanted to make. \"Right away\" actually means 2-3 business days which was divulged after I opened my account. Other than that inaccuracy, my first investment was ok."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jackson Webb",
          "Nb_Reviews": 1,
          "Date": "2020-11-07T23:23:02.000Z",
          "Titre": "new company hits the ground running!",
          "Contenu": "Company, customer service investments are too new to give an authorities review, but so far the funding process and response from CS have been stellar.partnering relations ships are a+ but would like to see more info and education on the site. fee structure although stated is a little hazy to me as far as how it is appliedlooking forward to the app hopefully coming out soon.JW"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victor Ng-Thow-Hing",
          "Nb_Reviews": 1,
          "Date": "2020-10-21T16:12:49.000Z",
          "Titre": "It would be nice to try and reduce the…",
          "Contenu": "It would be nice to try and reduce the transfer time of funds. I realize this is not always in your control, but perhaps offering instructions or estimates on how fast each method will take (from historical averages) would be useful for the investor to make decisions. For example, I chose to transfer by check (trying to reduce any wire fees), but it seemed to take almost 2 weeks which I find excessively slow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dylan",
          "Nb_Reviews": 2,
          "Date": "2022-05-24T02:48:52.000Z",
          "Titre": "Waiting on the mobile app is all…",
          "Contenu": "I would give a 5 star if a mobile app was already offered. I know your working on it. But, other than that, the service seems to be working well. Just takes a while for the money to get in the account."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy McKeown",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T18:11:06.000Z",
          "Titre": "I seem to have figured it out",
          "Contenu": "I seem to have figured it out, though understanding what is the responsibility of AltoIRA and what is the responsibility of Carofin has been mostly trial-and-error.I submitted two questions to your help window.  I answered the first question myself, and the second question was answered by Carofin.  So I have no unresolved issues at the moment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 2,
          "Date": "2021-11-23T20:17:36.000Z",
          "Titre": "Great job so far! I actually have some additional feedback….",
          "Contenu": "I actually have some additional feedback that I’d like to provide you guys. Could someone give me a call at 650-906-6920. I think you have a massive opportunity in front of you and I’d love to help you hit the ball out of the park with additional features."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-21T15:51:39.000Z",
          "Titre": "Great to have the email reminders to…",
          "Contenu": "Great to have the email reminders to fund my account. Encouraged me to take the next steps in moving my funds over from my IRA account. One thing I didn’t feel super secure about was the lack of security protocols used when I called customer service related to my transfer. There was no security verification or validation that I was who I said I was and that’s slightly concerning."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T02:10:09.000Z",
          "Titre": "Setting up the Alto account was easy…",
          "Contenu": "Setting up the Alto account was easy and the dashboard is user friendly. Thank you. Alto also has some great cryptocurrencies and will probably become an industry leader due to low fees and low bar of entry. Many crypto IRA services may not do so well because of high fees and high entry costs due to greed. Alto does not have this myopic attitude and seems to be more customer orientated, which is becoming rarer in modern companies, Also, Alto has real people to solve customer service problems, and not just computer systems to send you into an endless loop like some. Well done and best of luck with your company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hemalkumar Vyas",
          "Nb_Reviews": 2,
          "Date": "2021-11-29T23:35:24.000Z",
          "Titre": "There are less features than I would…",
          "Contenu": "There are less features than I would like to but the transaction was easy.There should be an option to verify by phone in addition to google authenticator. I upgraded my phone and now the google authenticator does not give me a code anymore."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Walt Young",
          "Nb_Reviews": 3,
          "Date": "2019-06-26T22:13:29.000Z",
          "Titre": "The concept is relatively new to me",
          "Contenu": "The concept is relatively new to me, so there was a learning curve for me to get my account started.  James and Kate in customer service were very helpful and now I look forward to having my self-directed IRA with AltoIRA.  The savings will be substantial.  Now they just need to establish a way to have any cash in the account swept into an interest-bearing account."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawrence",
          "Nb_Reviews": 1,
          "Date": "2021-11-07T00:55:23.000Z",
          "Titre": "Ok to be honest I have not had a bad…",
          "Contenu": "Ok to be honest I have not had a bad problem or trouble figuring out the trading process. I had a question and called and low and behold someone answered the phone. They where nice and very polite and willing to answer my question. But the only thing I am not happy with the dash board. I am an active stock trader and am use to seeing all the information. Position information for each coin example, my cost basis, what the coin is worth at that time, market value, daily and total gains. This is just me. I can see my account balance but it would be nice to see the coin balance whether up or down on that position. Other then that happy i found you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vinitha George",
          "Nb_Reviews": 1,
          "Date": "2021-09-12T04:18:41.000Z",
          "Titre": "So far so good with Alto still with…",
          "Contenu": "So far so good with Alto still with them despite the hack. Trying to confirm with coin base that they do storage for Alto because there is such little information on them. Hopefully a legit company. Never be too sure lots of scams in Crypto."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Myo",
          "Nb_Reviews": 3,
          "Date": "2019-06-26T17:55:22.000Z",
          "Titre": "AltoIRA makes it easy for investing in Startupd",
          "Contenu": "I invested in a Startup using my IRA money through AltiIRA as my regular investment would not approve in Startups. I found AltoIRA very helpful in making smooth transition. So far I am very happy with their service. Of course I may need their help when the time comes for calculating my RMD for investing in Startups"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 2,
          "Date": "2021-12-22T22:20:07.000Z",
          "Titre": "Needs some work",
          "Contenu": "Couldn’t decide between three or four.  Transfer took a long time to credit after you had check. Don’t like the trading platform because can’t see current market price.  Do like ability of limit orders.  Time will tell."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TIM",
          "Nb_Reviews": 1,
          "Date": "2021-11-06T16:34:20.000Z",
          "Titre": "Great company new features needed!",
          "Contenu": "Great company, good customer service. They respond quicker by email. If they could upgrade the product to include crypto stop market orders, it would be an amazing product and would allow investors to protect there investments."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2020-06-01T19:29:14.000Z",
          "Titre": "So far so good...",
          "Contenu": "Enjoying the Alto platform but haven't had enough experience yet to determine how good support actually is.  So far, the support has been good but we haven't really had any serious issues to contend with to this point.  On easy stuff the support is good though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 3,
          "Date": "2022-01-28T19:30:21.000Z",
          "Titre": "Getting started in my cryptoIRA was…",
          "Contenu": "Getting started in my cryptoIRA was smooth and easy. One concern: the confirmation price is not immediate like on the cash app and strike apps???I wish your platform allowed for DCA for my cryptoIRA."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wesley B.",
          "Nb_Reviews": 2,
          "Date": "2021-12-24T04:00:39.000Z",
          "Titre": "Like it so far",
          "Contenu": "I have recently opened an account with Alto. The process was pretty easy to get completed. Afterwards it takes seven days before you can do anything, but then you can go and put buy orders in for what you want. I love the fact that they have so many different assets to choose from but I wish the trade fees were lower. I understand that this is supposedly a 1.5% trading fee that is charged by Coinbase, but I would think that a large firm like this could negotiate that fee down a good amount. But maybe that is how Alto makes their money on these accounts since there are no other fees. Overall I would give the service a 4 out of 5 and only say that I would like to see some lower fees. Everything else is great so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Annamalai",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T23:33:26.000Z",
          "Titre": "SImple and easy platform",
          "Contenu": "Transferring funds was simple. Creating orders was simple. Filling was slow. Sometimes even market orders took more than 10 minutes to get filled. For market orders, fees are subtracted from the order amount which reduces the amount used to buy (I am not used to that). For limit orders, fees are not subtracted from the order amount which I like. Order history seems to keep only one line per order. Once the order is filled, the order placement history seems to be just overwritten. Most annoying is even when I am working, within short break I am timed out and have to login again. There does not seem to be any place to control that time. There is no way to see any charts. I hope more features will be added."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2020-10-07T20:09:59.000Z",
          "Titre": "Good service overall",
          "Contenu": "Good service overall, and a user-friendly interface. My only complaint is having to resolve questions only via a submission form online; having a phone number to call would be a great help, especially for someone who is new and may have questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jim burns",
          "Nb_Reviews": 2,
          "Date": "2019-09-13T22:18:40.000Z",
          "Titre": "baby's 1st ira investment",
          "Contenu": "i had to open a support request with wefunder to get my first investment in alto - there were apparently AltoIRA api problems, accrding to them. i still can't find a way to do this on republic. oh, well, growing pains! everything worked out (or will work out)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew W",
          "Nb_Reviews": 11,
          "Date": "2019-06-23T02:20:31.000Z",
          "Titre": "So far so good with Alto",
          "Contenu": "So far so good with Alto.  Best things:  very prompt and effective customer service (the aforementioned Kate & James), partnership with the investment platform i do business with and relatively easy to use.   Areas to improve:  website is pretty basic (functionally it's fine, but it has a rather dated look and is overall rather inelegant), FAQs really need to be more complete (to hasten self-service) and Alto needs to find a way to provide REGISTERED USERS the necessary banking info to properly set up accounts (as it is now, you MUST get this info from them via inquiry = an unnecessary extra step)."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "RONALD CLEMENTS",
          "Nb_Reviews": 5,
          "Date": "2021-10-01T18:32:18.000Z",
          "Titre": "The weak point of the journey was a…",
          "Contenu": "The weak point of the journey was a lack of knowing the status of  completion.  After the information was provided, I never heard a thing. The other was duplication of requirements for documentation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Madden",
          "Nb_Reviews": 2,
          "Date": "2021-12-05T14:34:07.000Z",
          "Titre": "So far so good..",
          "Contenu": "So far so good... only \"wish\" is that I wish AltoIRA had an app to quickly and easily access your IRA investments on the go.   Currently only accessible via desktop online platform."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lucas",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T22:57:51.000Z",
          "Titre": "I like having a vehicle to invest my…",
          "Contenu": "I like having a vehicle to invest my 401k money into crypto. I think the website could use some work to provide some analytics to the customers. I like the ability to submit limit orders."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Candece",
          "Nb_Reviews": 2,
          "Date": "2021-12-12T15:07:04.000Z",
          "Titre": "Helpful information",
          "Contenu": "I’m new to this and just set up an account. Still learning how this works but so far, things are running smoothly. Website is user friendly, and the “help” tab explains answer questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2021-09-20T13:49:28.000Z",
          "Titre": "I was happy that when I wrote an email…",
          "Contenu": "I was happy that when I wrote an email about a problem I always  received a phone call the next day. I would of wished I could of called someone at the time though but understand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T03:15:33.000Z",
          "Titre": "Easy to set up",
          "Contenu": "Easy to set up.  Easy to transfer funds in.  Don't know yet about transferring funds out.  I did not see information about a waiting period after transferring funds."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T15:49:45.000Z",
          "Titre": "Alto Crypto IRA Account from existing Alto Traditional IRA",
          "Contenu": "Opened a Alto Crypto IRA Account, went pretty well, was able to easily transfer funds from my Alto Traditional IRA, but still have to wait 7 days to invest in anything."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jarred",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T15:36:45.000Z",
          "Titre": "Wish they had an App",
          "Contenu": "Pretty easy to use, but I wish they had an app that was more like Coinbase, specifically with easy to access help articles and just educational articles."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allen",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T13:26:32.000Z",
          "Titre": "The app and the transaction great",
          "Contenu": "The app and the transaction great. What I would like to see is a stop loss and somewhere where we can put our coins on to get interest."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kayleen",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T20:26:19.000Z",
          "Titre": "This was a very easy process",
          "Contenu": "This was a very easy process! The only reason I did not give this review a 5/5 was the fact I could not buy XRP crypto in my Roth IRA."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 6,
          "Date": "2020-01-16T20:36:04.000Z",
          "Titre": "it works pretty easily",
          "Contenu": "it works pretty easily.  For those with a 401k solo that have more confidence to manage alternative investments as their own trustee that's probably a cheaper option"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T20:39:42.000Z",
          "Titre": "It was a little hard getting info at…",
          "Contenu": "It was a little hard getting info at the beginning, it wouldn’t give the info I needed to set up my account but someone emailed me and fixed it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T07:12:33.000Z",
          "Titre": "Transfer of Assets",
          "Contenu": "Good follow up communication by Alto Team from my online submission request. Transfer of assets from IRA Cash Balance to Coinbase Balance completed less than 24hrs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dave",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T09:02:03.000Z",
          "Titre": "Very easy transfer from a Vanguard 401k…",
          "Contenu": "Very easy transfer from a Vanguard 401k into Alto, and very easy to make a cash distribution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T01:51:14.000Z",
          "Titre": "Seamless",
          "Contenu": "Professional with good response time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T20:37:46.000Z",
          "Titre": "Distribution",
          "Contenu": "I was able to make the request and fill out all forms easily on the website approval and payment were done within a couple of days"
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Dr. Lazaris",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T19:11:15.000Z",
          "Titre": "I am a new client of Alto",
          "Contenu": "I am a new client of Alto.  The onboarding process is a bit more complex than just signing up online.  This is for security reasons, which I appreciate.  The communication and response time with Alto was excellent.  Website has good layout and easy to navigate and do what you need to do.  So far, I'm impressed and highly recommend Alto."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Troy Westbrook",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T23:59:24.000Z",
          "Titre": "good service, simple account set up, coin suggestions",
          "Contenu": "Good selection of crypto on partner exchange, Coinbase, but highly suggest you lobby them to add XRP, XDC, LUNC (luna classic), VOLT (V2) and SHI (shina inu) to their coin list/offering (and then integrate into ALTO platform too.) These are coins that will  perform VERY well imo. Thus far I have experienced good service and ease of account set up. Will likely transfer or fund more to my account in future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T00:12:11.000Z",
          "Titre": "We evaluated 6 different self directed…",
          "Contenu": "We evaluated 6 different self directed Ira companies for doing our own real estate investment. We picked alto on price (not the least expensive but because they don’t charge based on investment size the pricing was fair), online capability, live phone support if needed (it wasn’t), web experience, and simplicity of fees.  It took us about 10 minutes to setup our accounts, and funding was easier. Setup of an investment vehicle requires a lot of approvals from us, the real estate folks and alto, but all Automatted and only took a few days. Very nice support for our first time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rochelle",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T05:12:12.000Z",
          "Titre": "Fast and efficient",
          "Contenu": "Fast and efficient, he was professional and easy to talk to"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Dawson",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T22:34:36.000Z",
          "Titre": "Thanks Alto!",
          "Contenu": "I needed some of my IRA funds quickly transferred in order to meet very tight time constraints related to an investment opportunity that looked strong to me. Max, at Alto jumped in and took me step by step through everything and finalized the transfer the day prior to the closing of the opportunity. Alto is strong, thorough and timely. Thanks to Max, ALTO and the team there, i will be a customer for life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Pavkov",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T22:34:13.000Z",
          "Titre": "So far so good",
          "Contenu": "So far, I'm satisfied with Alto. The fees are high (1%), but until there are more options to trade crypto inside a traditional investment vehicle like an IRA, there isn't much of a choice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenna Smith",
          "Nb_Reviews": 3,
          "Date": "2022-12-27T23:54:27.000Z",
          "Titre": "I've enjoyed the options Alto makes available",
          "Contenu": "Alto makes investing in real estate deals easy. I use the \"bring your own deal\" option in their platform. From this, I work with a real estate flipper to construct a promissory note and put my money to work while watching houses being improved in communities. This option allows me to return a higher rate than traditional stocks allocations. Alto fees are one of the lowest I've research in a SDIRA account and their support staff is always helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LB",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T21:07:17.000Z",
          "Titre": "All star customer care!!!",
          "Contenu": "Working with AltoIRA has been such a seamless delightful experience! From my initial inquiries to after the deal close, Jen Smith, Lindsey Johnson, and Whitney Dawson were incredibly kind, responsive, diligent, supportive, professional and just all around ALL STARS! They made a time-sensitive, nerve-wrecking experience for me so much more manageable and less stressful. I trust both of them fully and plan to continue working with Alto on future deals because of how well they took care of me. Thank you all & the entire Alto team!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clinton Kakazu",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T23:09:23.000Z",
          "Titre": "Agent Jenn Smith made purchasing SpaceX…",
          "Contenu": "Agent Jenn Smith made purchasing SpaceX shares thru FPG an easy and seamless experience. She called and followed up along the way. Very prompt in answering questions. Kudos!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dimitry",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T00:43:55.000Z",
          "Titre": "Solid choice in the space",
          "Contenu": "Between a couole of the alternative asset managers AltoIRA is my preferred choice. It has always been straigtforward to get an answer and get support, as well as onboard the deals. AltoIRA has also improved a lot both in the efficiency of it's processes and the application portal. I am looking forward to continue with the service for years to come."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-01-08T00:07:46.000Z",
          "Titre": "Fast & Easy IRA funds transfer for private placement",
          "Contenu": "I needed to move money from a Traditional IRA into an SDIRA quickly in order to meet a deadline for a private equity placement deal with one of their partner companies. The team at Alto exceeded my expectations during the holiday season and their site made it a simple process to wire the funds.I was surprised that I was able to complete everything within a few days with absolutely no issues. The fees at Alto are lower than another SDIRA service that I've used in the past, so that's another plus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phillip",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T18:53:03.000Z",
          "Titre": "Transfer Process",
          "Contenu": "Carson Krigbaum was extremely responsive and provided the correct steps in the transfer process the first time. My transfer of some extra cash back to another IRA was completed in 2 days. Alto's platform is in a league of its own. Thanks! Brian"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karl",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T21:23:54.000Z",
          "Titre": "AcreTrader Timber",
          "Contenu": "Alto representative, Jennifer’s support and assistance was superb. Her patience and due diligence guiding the processing of my investing funds transaction is much appreciated. Other Alto clients will be in good hands if she is at the helm. I could not have accomplished this feat without her personal assistance. The next time I encounter difficulty I will certainly seek her out. Jennifer, thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T16:44:48.000Z",
          "Titre": "Great Experience with Alto",
          "Contenu": "The entire setup experience has gone very smoothly. Customer support and guidance is excellent. I have made a few purchases online with no problem. The transaction cost is reasonable and I love having access to all the coins/tokens on Coinbase. I have researched a few similar services and Alto easily comes out on top."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T23:15:28.000Z",
          "Titre": "Alto best customer service!",
          "Contenu": "Alto has some of the best customer service that I have experienced with financial services companies. They respond quickly via email. They are quick to understand your needs/issues. They are not just trying to charge you fees. I decided that I did not want to invest in \"Alt\" investments any longer. I asked about transferring funds and closing my account. They treated me as if I was the best customer through the whole process. If you want to invest in \"Alt\" securities I highly recommend Alto for the great service you will receive all the time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed S.",
          "Nb_Reviews": 4,
          "Date": "2023-04-20T02:11:13.000Z",
          "Titre": "Simply put...",
          "Contenu": "Simply put, ALTO offers a CRYPTO Roth IRA, and while everyone else is losing their shirts buying stocks, at least with a ROTH IRA, you won't have to PAY TAXES on any potential crypto gains."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 4,
          "Date": "2022-10-14T14:41:47.000Z",
          "Titre": "Funds transfer was seamless",
          "Contenu": "ALTO made it easy to transfer money into the account so that I could make an investment.  I used the tools on its website -- they were clear, instructive and complete.  I was also provided instructions for next steps to ensure the transaction was made accurately and on time.  The entire process was seamless.  Thank you ALTO!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T15:34:26.000Z",
          "Titre": "With the crypto market so volatile I am…",
          "Contenu": "With the crypto market so volatile I am checking how my investment in Alto is doing more frequently.  Your 2-step validation is quick and efficient and I was able to ponder my investment, thinking about where I might invest more now that we are in a new year.  Thank you for asking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T18:37:08.000Z",
          "Titre": "Alto is a big upgrade to my old crypto…",
          "Contenu": "Alto is a big upgrade to my old crypto IRA at Choice / Kingdom Trust. Alto actually has real limit orders that are good till canceled. (Choice's dumb version of \"limit orders\" cancel daily at 24:00 UTC.)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Daly",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T19:02:18.000Z",
          "Titre": "Unlocked money trapped in old 401ks to invest in alternative assets.",
          "Contenu": "Rolled over old 401ks into a self-directed AltoIRA because I didn’t want my money to sit idle or worse, dwindle as the stock market dips. Now I’m invested in alternative assets like fine art, farmland and commercial real estate in a way that I would never have been able to do with funds sitting in traditional IRAs. Thank you Alto team for helping unlock my money and give me more options to diversify my investments!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T18:47:22.000Z",
          "Titre": "Transfer of Funds - The young lady who took my call quickly…",
          "Contenu": "The young lady who took my call quickly and courteously help me resolve my concern and issue.She was very professional and well-suited to assist me.Thanks for the great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T00:11:50.000Z",
          "Titre": "I have multiple accounts with Alto and…",
          "Contenu": "I have multiple accounts with Alto and love them. Only annoying thing is you need a different email for each account and I’m running out of emails because I keep opening new accounts. But the fact that I have multiple accounts should say great things about Alto."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerTom",
          "Nb_Reviews": 4,
          "Date": "2022-08-27T20:29:29.000Z",
          "Titre": "I put funds in Alto in about April to…",
          "Contenu": "I put funds in Alto in about April to be ready for a land investment when one came along. The money sat there until August when I wanted to make an investment. At that point I paid the yearly fee ($100.00) and the $10.00 investment fee and made an investment on the Acre trader platform. There were several screens to navigate and conditions to read and agree to, and the investment process took me probably about half an hour between going back and forth between the two platforms. By the next day I had conformation that the money had been sent for the investment I wanted to make. I am guessing that I will continue to pay the annual fee by credit card as long as I maintain this SDIRA. It worked for me and now I have a more diverse portfolio than I had before."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T07:48:42.000Z",
          "Titre": "Easy",
          "Contenu": "I initially tried to open an account with the OTHER IRA company that is advertised everywhere.  They refused to open an account for me stating that there was an error with the KYC process.  I emailed their customer service, but never got a response.  I will never know what the problem was.I found Alto IRA easily with an internet search, and I couldn't be happier. It was very easy to open and fund my account.  They've reached out to me to make sure I'm happy with their service.  However, I haven't needed anything.  Everything has been so easy. They have a huge selection of crypto to choose from, and my account is nicely diversified."
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T20:03:22.000Z",
          "Titre": "The customer service team is the best…",
          "Contenu": "The customer service team is the best I've worked within financial services. Clearly smart and always solutions oriented. I honestly love how effective they are — it gives full confidence in the company. 7/5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:12:38.000Z",
          "Titre": "Flawless Transaction",
          "Contenu": "Easy process for opening account and responsive account representatives made sure everything was done properly and in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 7,
          "Date": "2023-01-15T00:51:52.000Z",
          "Titre": "A simple and fast process...",
          "Contenu": "Setting up and funding my Alto IRA was as seamless a process as possible. Once funded, I was easily able to quickly invest in my security of interest. I know I'll continue to use Alto long into the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron M",
          "Nb_Reviews": 5,
          "Date": "2022-10-13T23:03:02.000Z",
          "Titre": "Super Fast Transactions",
          "Contenu": "OK My experience with ALTO IRA has been Fantastic,They have the Crypto I am looking for and when I buy the Crypto it is SUPER FAST.I just wish I would use my Debt Card to Fund My Account like Coin-base Does. I hope that they get the Debt Card Funding thing done ASAP, because it would be so much faster than having to wait 3 to 5 days. Other than that ALTO is Super Great, I wish I knew about them Sooner.Ron M"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T22:21:58.000Z",
          "Titre": "Very easy to set up the account",
          "Contenu": "Very easy to set up the account. Transfer of funds went very smoothly.  My first 2 investments transactions were executed flawlessly.  So, great experience with no hassle.  Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T14:48:36.000Z",
          "Titre": "It took a week to get a response from…",
          "Contenu": "It took a week to get a response from Lindsey who got Jenn then to also help with setting up the account .  They were both wonderful.  Jenn and Lindsey are 5 STARS.  However, the week of not getting through by phone and no response from emails was horrible (rate 0)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fawzia",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T15:49:23.000Z",
          "Titre": "New Client",
          "Contenu": "It has been a pleasure working with Terry. He did an awesome job of assisting me with opening my new account with Alto and provided top notch customer service. He streamlined the whole process with ease. I could not have asked for anyone else to work with but Terry. You are lucky to have Terry in your organization."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T19:42:12.000Z",
          "Titre": "Back door IRA",
          "Contenu": "I needed to reverse a Roth IRA and do a backdoor Roth IRA. Josh walked me through it step-by-step over a series of several phone calls. He was professional, courteous, and helpful. I appreciate his help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HDP",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T19:09:25.000Z",
          "Titre": "My questions were simple and…",
          "Contenu": "My questions were simple and straightforward. The representative was informed and helpful, and everything was taken care of expeditiously."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T22:47:18.000Z",
          "Titre": "Your customer support is outstanding",
          "Contenu": "Your customer support is outstanding! I switched from ITrust to Alto and couldn’t be happier after a year. Coinbase should have support like you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-05-07T22:28:04.000Z",
          "Titre": "Folks at Alto were very helpful and…",
          "Contenu": "Folks at Alto were very helpful and made an IRA transfer easy to accomplish. Also made my investment into an alternative asset simple. Appreciate their help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T19:10:46.000Z",
          "Titre": "Everyone I spoke with was professional…",
          "Contenu": "everyone I spoke with was professional and helpful,and Jenn Smith my advisor was expedient and helpful to get my investment done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T19:37:05.000Z",
          "Titre": "Long wait on the phone for a Rep",
          "Contenu": "Long wait on the phone for a Rep, but she was patient with me and answered all of my questions, which were many. Alto has been in transition for what seems like a long time, and there have been some frustrating things to deal with as a customer. In the past I have talked to Alto Reps and have hung up feeling like the only info I walked away with was so generic that it was basically useless. But this call was the opposite. I recvd info that was substantive and helpful. Any concern about where Alto was going has been addressed. And thank you for that"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T17:18:51.000Z",
          "Titre": "I appreciate the proactive email",
          "Contenu": "I appreciate the proactive reaching out. I only heard of Alto recently so is \"new to me\" and is dealing in the crypto space. Lots of people are getting burned in this space and thus I was a little worried moving over my IRA. But knowing there were real people on the other side helped me feel comfortable. I talked to people via email and on the phone and it helped me feel good about making the move. So far I am very happy I made the move."
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Timothy",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T23:39:25.000Z",
          "Titre": "I HAD A GREAT CUSTOMER SERVICE…",
          "Contenu": "I HAD A GREAT CUSTOMER SERVICE EXPERIENCE WHEN MY OLD IRA COMPANY LOST THE CHECK. ALTO WENT THE EXTRA MILE TO HELP ME GET THE CHECK REISSUED AND TO GET MY INVESTMENT GOING AS SOON AS THEY GOT THE RE-ISSUED CHECK."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy Atherton",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T23:26:31.000Z",
          "Titre": "Nothing but good experiences with Alto",
          "Contenu": "Nothing but good experiences with Alto.  Smart positive people who make what could be a complex process simple and smooth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frederick Bartholomew",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T01:34:06.000Z",
          "Titre": "Long and Short-term investmenting.",
          "Contenu": "Alto gives different types of investing options from traditional to IRA structured portfolio. Signing up is very easy, simple anyone can do it.You can also transfer funds from your preexisting 401k, IRA, or company retirement accounts (listed).For future improvements Alto should have a custodial wallet for its customers or allow internet crypto wallet extensions. Credited crypto wallets should be listed, suggested or provided by Alto or another regulated third party wallet provider with (self custodial wallet(s). It's the most important improvement needed. A self custodial wallet provided or optional options of wallets/wallet extensions. \" Not you keys Not your crypto\"."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ismael",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T21:00:59.000Z",
          "Titre": "Top customer support",
          "Contenu": "Jenn was excellent supporting my on boarding with multiple accounts, rollovers and conversion. The help desk was also very helpful in answering questions about availability of crypto coins and other assets depending on the account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kayla",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T23:32:16.000Z",
          "Titre": "Just a great company",
          "Contenu": "Just a great company. Friendly staff and just overall wonderful experience since I signed up. I will continue to do business with alto for many years to come."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VJ",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T19:36:15.000Z",
          "Titre": "NO TAXES ON CRYPTO GAINS!!",
          "Contenu": "The fact that you can have a crypto ROTH IRA is a GODSEND!! This means I can make crypto trades based on the four year cycles of bitcoin and cash out at the top of the market without having to pay taxes on my gains...EVER!!  So excited to make lots of money for retirement in this catch-up strategy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T20:26:16.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "Customer service was great even though I had a lot of questions.  My transfer from Fidelity was seamless and I like that they offer 2FA.  No complaints here!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill M.",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T23:51:35.000Z",
          "Titre": "The company is very customer-friendly",
          "Contenu": "The company is very customer-friendly. You talk to a live person when you call in, and questions are answered by knowledgeable people who are eager to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HRK",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T08:04:10.000Z",
          "Titre": "Great customer service",
          "Contenu": "Their support is great. The product is also great, but I had to put my account on a pause since crypto market is really not going anywhere. But nonetheless, their customer support is really good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T20:07:21.000Z",
          "Titre": "TREMENDOUS",
          "Contenu": "My experience with Alto was seemless and very professional. I'm new to the investment arena, so the top flight customer service was a blessing. Thank U So Much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Chvasta",
          "Nb_Reviews": 7,
          "Date": "2023-02-27T18:45:38.000Z",
          "Titre": "Jennifer was knowledgeable and helpful",
          "Contenu": "Jennifer was knowledgeable and helpful.   I will work with the Alto team again, much better to work with a person than trying to do it yourself online."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T21:18:39.000Z",
          "Titre": "Easy to use...",
          "Contenu": "The web interface is easy to use and tracks all your trades along with what the crypto prices are currently all on the same page."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Cobb",
          "Nb_Reviews": 4,
          "Date": "2023-03-27T21:25:12.000Z",
          "Titre": "Customer service is great",
          "Contenu": "Customer service is great. Very responsive & professional. Overall the app & web dashboard are easy to use. It's been a great experience so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Hartmann Jones",
          "Nb_Reviews": 2,
          "Date": "2022-09-10T00:14:38.000Z",
          "Titre": "Had issue with enhanced security",
          "Contenu": "Had issue with enhanced security, called and was on the site in 15 mins, able to transfer Roth funds I needed to fix my roof, really grateful for the service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed S",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T12:32:04.000Z",
          "Titre": "My iPhone died and took the…",
          "Contenu": "My iPhone died and took the Authenticator with it. Restoring access was quick, simple and secure. 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T22:22:26.000Z",
          "Titre": "ALTO made it simple to invest",
          "Contenu": "ALTO made it simple to invest in a start up using a SAFE. Planning another investment with a quick turn today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonard P",
          "Nb_Reviews": 2,
          "Date": "2023-01-05T19:42:00.000Z",
          "Titre": "Not your traditional IRA account",
          "Contenu": "Choosing to invest in different options with my 401k money is such a great idea. I love itThe dashboard interface I find to be very easy to use and navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kara",
          "Nb_Reviews": 2,
          "Date": "2022-08-28T20:59:29.000Z",
          "Titre": "Very responsive in assisting with…",
          "Contenu": "Very responsive in assisting with transfer and keeping me updated on status. Site was super easy to buy my Crypto also."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Donahue",
          "Nb_Reviews": 3,
          "Date": "2023-04-25T23:36:03.000Z",
          "Titre": "Alto IRA is a fantastic investment…",
          "Contenu": "Alto IRA is a fantastic investment platform that I highly recommend to anyone looking to take control of their retirement savings. The platform is user-friendly and easy to navigate, making it simple to open and manage an IRA account. The customer service is exceptional, with prompt and knowledgeable responses to any questions or concerns. Alto IRA also offers a wide range of investment options, including alternative assets such as real estate and private equity, which can help diversify your portfolio and potentially increase your returns. Overall, Alto IRA is a top-notch choice for anyone seeking a modern and flexible approach to retirement investing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T18:06:52.000Z",
          "Titre": "Making Alternative Investment Easy",
          "Contenu": "I've been impressed across the board at how easy Alto makes investing, from opening the account to making the investment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Olivia Tumino",
          "Nb_Reviews": 3,
          "Date": "2022-09-30T20:17:42.000Z",
          "Titre": "A Great Little Investment Company",
          "Contenu": "ALTO is a nimble, smart company. They helped me with my issue.I look forward to using ALTO to diversify my portfolio in the future.t"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Keenan",
          "Nb_Reviews": 2,
          "Date": "2023-01-31T03:50:16.000Z",
          "Titre": "Love that I can have a Crypto Roth and…",
          "Contenu": "Love that I can have a Crypto Roth and a Roth for start-up companies.  Would love to be able to combine my two Roth accounts into one account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julia Robles-Scott",
          "Nb_Reviews": 2,
          "Date": "2023-04-22T18:35:31.000Z",
          "Titre": "Even though I was unable to connect via…",
          "Contenu": "Even though I was unable to connect via phone, they were very responsive via email, and had great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Rowley",
          "Nb_Reviews": 5,
          "Date": "2023-03-04T18:04:16.000Z",
          "Titre": "I love using Alto",
          "Contenu": "I love using Alto, they are so responsive and have made it easy to use my IRA for other investment types."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bertrand",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T22:50:39.000Z",
          "Titre": "Very helpful customer service",
          "Contenu": "It took some time to transfer my funds from my 401k to my Crypto Roth IRA but everyone has been very helpful along the way!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T23:33:00.000Z",
          "Titre": "I love these guys",
          "Contenu": "I love these guys! Very simple adn easy to sign up and invest. Great customer service as well when I had a few questions. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pum",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T01:09:55.000Z",
          "Titre": "Great company",
          "Contenu": "Great company. Their interface for buying cryptos in an IRA is extraordinarily easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Blevens",
          "Nb_Reviews": 7,
          "Date": "2023-08-28T17:42:45.000Z",
          "Titre": "Personnel were a great",
          "Contenu": "Alto personnel were a great help in managing my trnasfer of a Roth IRA."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lloyd",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T02:25:13.000Z",
          "Titre": "Everyone I dealt with at alto was very…",
          "Contenu": "Everyone I dealt with at alto was very helpful and super nice. Can't say enough good things about the assistance I received.Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack A. Chase",
          "Nb_Reviews": 4,
          "Date": "2022-08-26T01:26:35.000Z",
          "Titre": "Contacted Alto and asked a question",
          "Contenu": "Contacted Alto and asked a question. Within a reasonable response time, I was provided the answers I was looking for. Kudos!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T19:53:02.000Z",
          "Titre": "LINDSEY WAS G R E A T !!!!",
          "Contenu": "LINDSEY WAS G R E A T !!!!She understood my issue. She made it clear to me that she knew how to resolve it.She resolved it.No muss. No fuss."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T12:43:28.000Z",
          "Titre": "The people at Alto are…",
          "Contenu": "The people at Alto are Professional,Polite,and Customer Service is Excellent.   A 5 Star review all the way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T23:49:27.000Z",
          "Titre": "Different investment opportunity that…",
          "Contenu": "Different investment opportunity that met my needs perfectly! Easy to set up and fund my investment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Asheesh",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T17:01:34.000Z",
          "Titre": "Ease of Investing",
          "Contenu": "I love the ease of being able to invest in alt investments with my Alto IRA acct."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tod",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T13:54:56.000Z",
          "Titre": "Alto has become the most important…",
          "Contenu": "Alto has become the most important partner in the management of my SDIRA.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T04:26:25.000Z",
          "Titre": "Easy",
          "Contenu": "Cheap, fast, easy, and delicious.  Anybody can do cheap, fast, and easy.  But make it delicious and folks come back for second helpings."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendolyn",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T16:36:22.000Z",
          "Titre": "Prompt and knowledgeable.",
          "Contenu": "Prompt and knowledgeable.Thanks for having a real human to work on the transaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rima",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T04:14:59.000Z",
          "Titre": "It was quite easy to make the…",
          "Contenu": "It was quite easy to make the transactions that I needed to do. It was helpful to be able to email a rep with questions, answers came promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dimitri M.",
          "Nb_Reviews": 5,
          "Date": "2023-08-17T23:55:54.000Z",
          "Titre": "I had a fantastic experience with…",
          "Contenu": "I had a fantastic experience with Alto's customer service. They resolved my (fairly serious) issue expeditiously and smoothly (I had lost my google authenticator and needed to reset 2-factor authentication), and they were very friendly and polite. Wonderful experience, especially compared to the atrocious so-called customer service of some other crypto companies I contacted to resolve the same issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Van Zandt",
          "Nb_Reviews": 2,
          "Date": "2022-09-16T05:23:02.000Z",
          "Titre": "It took a bit of time to figure out the…",
          "Contenu": "It took a bit of time to figure out the website, but the customer reps were very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Feruz",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T08:31:11.000Z",
          "Titre": "Really great customer service",
          "Contenu": "Really great customer service. People here listen and and take immediate actions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T19:41:21.000Z",
          "Titre": "Quick response to my request",
          "Contenu": "Quick response to my request. Got my distribution as fast as I could have wanted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T22:20:40.000Z",
          "Titre": "Customer service has been very helpful…",
          "Contenu": "Customer service has been very helpful each time I've needed to do a transfer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurence",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T20:19:57.000Z",
          "Titre": "Alto customer service is great",
          "Contenu": "Alto customer service is great!  Very helpful and quick responses.  Thank You!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter B.",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T07:46:38.000Z",
          "Titre": "Alto IRA is an excellent co., with a great service",
          "Contenu": "The company , ALTO IRA , is Exceptionally great company with extraordinary staff members who follow up with any problems or questions that you are having or experiencing difficulties , and you will definitely see the result, and the problem or whatever the issue is , you will see completed results performed.!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Dale",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T09:41:58.000Z",
          "Titre": "They were very easy to work with",
          "Contenu": "They were very easy to work with, and their customer service was responsive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brahim",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T19:07:27.000Z",
          "Titre": "Quick and attentive service",
          "Contenu": "Quick service and attentive. Carson followed up to update me periodically and had my request completed faster than I had expected!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T22:11:38.000Z",
          "Titre": "Alto let me bring my own deal",
          "Contenu": "Alto let me bring my own deal, it was easier than filling out the paper work myself!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frances",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T22:11:09.000Z",
          "Titre": "Everything is awesome!",
          "Contenu": "Everything is awesome! This is quite simply the best IRA service I have ever utilized. Thank you for existing!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LB",
          "Nb_Reviews": 2,
          "Date": "2022-09-09T19:36:28.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service!  Easy to get hold of, eager to help, very knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arthur",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T18:28:46.000Z",
          "Titre": "Fast And Informed Response",
          "Contenu": "Lindsey and the team are super fast at responding to any question I have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacey Nelson",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T15:27:34.000Z",
          "Titre": "Customer service was helpful",
          "Contenu": "Customer service was helpful.  Had access to real people through email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2022-08-24T19:30:18.000Z",
          "Titre": "Very smooth onboarding and service",
          "Contenu": "Very smooth onboarding and service. Easy process as it should be. Thank you for your help in a smooth transition!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 3,
          "Date": "2022-10-30T21:54:18.000Z",
          "Titre": "Quick Responses to Inquiries",
          "Contenu": "Alto is quick to give responses, to user's questions; always worthwhile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T22:36:24.000Z",
          "Titre": "the amount of cryptocurrencies available to choose from.",
          "Contenu": "I was able to sell and reconfigure my investments for a very small fee."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T02:39:26.000Z",
          "Titre": "I wish I could view timeframes for each…",
          "Contenu": "I wish I could view timeframes for each asset. I love the fact that I was able to start investing in a crypto IRA with just $11!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "MEXMAN",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T18:08:13.000Z",
          "Titre": "Alto improving service & Software",
          "Contenu": "The software works much better than in 2021-22. Customer service response much improved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T03:08:02.000Z",
          "Titre": "Alto support staff was super helpful!",
          "Contenu": "Alto support staff was super helpful. They walked me through every step of the process."
        }
      ]
    }
  ]
}