{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "answerfirst.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RH",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T01:07:28.000Z",
          "Titre": "Bad follow through",
          "Contenu": "We had 4 locations for you to manage. One location was never taken care of even after a few messages telling you that you were not responding to the messages."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Lawler",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T20:53:37.000Z",
          "Titre": "This service was supposed to cost me…$20-$40 per month",
          "Contenu": "This service was supposed to cost me $20-40 per month but it is costing over $100 per month. When I asked my contact with Answer First about this, he ghosted me! The additional monthly fees of $70+ are outrageous. So I will be telling all of my colleagues to stay away from Answer First."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kirk Petrill",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T18:12:08.000Z",
          "Titre": "Initial set up was never accomplished"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Bryant",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T17:18:37.000Z",
          "Titre": "I get overbilled every time I use youl"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maria Todd",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T20:11:16.000Z",
          "Titre": "The method of taking information for a…",
          "Contenu": "The method of taking information for a temporary script change has caused us tremendous grief. It is not followed by every operator, and it is not deleted after the temporary amendment has expired. Also, operators seem \"afraid to think\" for themselves and seem intimidated about being practical. They cling to the script like a poorly programmed Roomba Robot - (hit the wall, back up and keep doing the same scripted thing with total disregard for the result.) They also seem reluctant to transfer to Tier2. This wastes provider time.  Did not follow the protocol for weekend calls to the PA first, Doctor Second and only followed the old temp script to call me first from three or four weeks before. When I argued that I should not be called first, they argued back but did not escalate or offer to call the PA on call. That was the last straw."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "New Life Open Bible Church",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T20:44:09.000Z",
          "Titre": "I pay more for discarded calls than I…",
          "Contenu": "I pay more for discarded calls than I do for actual calls coming in to the call center. I was told it was because I put the call center number on social media or announced it, which I did NOT  do since I when I decide to change companies, I would not have to update our phone number. I also explained we had the service for a month with the number they provided to us and that number had a lot of discarded calls. I am currently researching other companies since it appears that when we do not have a lot of calls coming in it just so happens that numerous “discarded” calls come in to increase our bill. Not happy at all"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yossi Braun",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T04:15:58.000Z",
          "Titre": "They have good service",
          "Contenu": "They have good serviceBut sometimes they don't follow my instructions"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chad Haidet",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T14:13:25.000Z",
          "Titre": "For us",
          "Contenu": "For us, our script is our primary concern.  We have had to redo our script several times in order to achieve results.  When we redo scripts we are told to put in a ticket, however, it is much easier to explain our needs over the phone directly to a live person who may be able to help us formulate it so it works for all parties.  I have been in contact with someone directly, once, and it was very helpful.  I would like more follow-up such as a phone call to see how the new script is working or even to understand our needs more.  I feel like the drive is to handle everything online or through a ticket, but at least for our situation it requires a better understanding which is why direct communication matters so much.  We work as a \"middle man\" and if problems keep reoccurring our clients will demand that we cancel AnswerFirst service and we definitely don't want that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2023-01-21T19:37:57.000Z",
          "Titre": "price of service when I don't even get…",
          "Contenu": "price of service when I don't even get a call"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael D.",
          "Nb_Reviews": 6,
          "Date": "2023-03-31T20:21:40.000Z",
          "Titre": "All in all",
          "Contenu": "All in all, they do a good job. I went through a number of services before I tried Answer First. They record each occurance so you can hear the entire gist of the conversation. There are times the person answering mispronounces the office name (my surname). There are also times the rep seems confused about what they are supposed to say. A recent solicitor was on the line for over 6 minutes and the rep actually put him on hold...we get billed for minutes. Requests and responses are, at times, unclear to the caller. I guess there are always going to be THOSE calls."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeannie Smith",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T18:43:52.000Z",
          "Titre": "The experience so far has been good",
          "Contenu": "The experience so far has been good, the answering service does not get many calls but it is nice to know someone is answering.  I would prefer that my callers to not hear the recording beep but apparently that is not optional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laurie",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T18:11:35.000Z",
          "Titre": "Easy to work with",
          "Contenu": "Easy to work with.  Very friendly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "charles soechting",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T23:19:03.000Z",
          "Titre": "I wish I’d done this years ago",
          "Contenu": "I wish I’d done this years ago. The messages come to me quicker and absolutely flawless in their content and understandability. Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Courtney Winters",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:19:13.000Z",
          "Titre": "We have had a great experience with…",
          "Contenu": "We have had a great experience with Answer First. They have been prompt in responding to all questions and provided excellent customer service. We are very pleased!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauren Harry",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T04:20:40.000Z",
          "Titre": "Excellent Service Providers.",
          "Contenu": "The reports are timely and detailed. Service representatives handle clients well. I am grateful for having the additional support and the peace of mind knowing the phone is answered when I am not available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer O'Brien",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T19:08:51.000Z",
          "Titre": "Answer first has done a fantastic job…",
          "Contenu": "Answer first has done a fantastic job getting all the pertinent info we need from our missed calls. Couldnt be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauren Nadolski",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T15:57:57.000Z",
          "Titre": "Solid set-up and easy to use",
          "Contenu": "Our onboarding specialist was communicative every step of the way. We really appreciated his thoroughness and intelligence. The service has been easy to use and manage. The people answering the calls are always professional and friendly. The service is what we needed and we like that we are only paying for the amount of time we actually use instead of paying for minutes in an expensive bulk package."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaShawn Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T00:02:13.000Z",
          "Titre": "No Complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Snyder",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T15:47:06.000Z",
          "Titre": "Our needs are pretty basic but the we…",
          "Contenu": "Our needs are pretty basic but the we have been very pleased witht he level of care our customers are getting when they call in after hours now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alana Simpkins",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T16:43:01.000Z",
          "Titre": "10/10 Recommend",
          "Contenu": "Our company has been using the services AnswerFirst offers for a little over a month now and they have not disappointed us! We have the ability to listen to each recording which has allowed us to properly identify changes to be made in our script. Each time we've requested a change, it has been done immediately and properly. We are very satisfied with the results we've had so far and have no intention and cancelling our services anytime soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn Schaubert",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T20:45:33.000Z",
          "Titre": "Answer First has been a great…",
          "Contenu": "Answer First has been a great investment for our HVAC company. The communication from the very beginning was very clear and very quick. The customer service reps that answer our after hour calls are very professional and provide clear messages for our office staff. We highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Norreese Haynes",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T02:07:45.000Z",
          "Titre": "I have been with many answering  phone…",
          "Contenu": "I have been with many answering phone services that didn't do a good job sending over our business messages so we lost many sales. AnswerFirst truly stands by their name because they think of the customer First! Since switching to them our sales have gone up and our calls are returned on time and plus they send you a detailed report doing this helps our sales team to scale. If you are with any other company you definitely don't have your company best interest. I know because I have tried them all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael A",
          "Nb_Reviews": 2,
          "Date": "2023-01-27T22:11:44.000Z",
          "Titre": "The Answer to Call Answering.",
          "Contenu": "I've used AnsweFirst for over 10 years. It has been 100% effective for my business. It frees me up and filters out unwanted sales calls. The call takers are super professional. It gives small businesses like mine a larger professional footprint."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerod Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T16:14:38.000Z",
          "Titre": "AnswerFirst is a must!!",
          "Contenu": "For approximately two months we have been using AnswerFirst to streamline our \"on call\" service. They have done a wonderful job helping us implement a process in how we respond to our after hours calls.  They provide us with all the necessary information so that we can triage our calls, as well as, reduce our response time. This allows our employees to execute the job with precision and to better serve our customers.I also like the daily emailed reports. They are detailed, which helps me keep track of the information about each call. AnswerFirst just needs to keep doing what they do. They are a great asset to have on your side."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lance - Manager.",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T11:31:50.000Z",
          "Titre": "AnswerFirst has helped us close more deals.",
          "Contenu": "AnswerFirst has been amazing so far! We've picked up a number of calls we previously would have missed so that's really helped us close more deals for Capitol Hill Boat & RV Storage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynnette Akiki",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T20:52:05.000Z",
          "Titre": "We loved the answering service",
          "Contenu": "We loved the answering service right away, after receiving our first bill we knew we had an issue though. We called Answer First and your team helped us find a solution to our problem and save us money! It is now running flawlessly. We could not be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kiara Cunningham",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T22:19:06.000Z",
          "Titre": "Wonderful Service!",
          "Contenu": "Overall our experience has been positive with AnswerFirst. The service reps answer our calls timely and professionally. One minor issue we occasionally experience is calls are categorized correctly (ex. a call may come in for a question if a guest can check in early and AF has categorized the call as a lockout emergency)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Rogers",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T19:50:06.000Z",
          "Titre": "Service is working well",
          "Contenu": "Service is working well.  Emergency calls are getting right to the person quickly.  I like the texting of emergencies and then the call. Daily reports are informative of what calls are coming in and being divided between emergency and non emergency."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael O'Neill",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T22:09:25.000Z",
          "Titre": "The contact process receiving calls is…",
          "Contenu": "The contact process receiving calls is real simple and easy.  I did have to figure out how to add the staff to the schedule after the initial 8 weeks, but it's pretty easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Nadeau",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T17:30:43.000Z",
          "Titre": "Been with you now several years",
          "Contenu": "Been with you now several years. Excellent service and support is quick. Also appreciate tips on language  response structure to keep conversations short, e.g., saves money. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Wells",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T06:10:47.000Z",
          "Titre": "Read my patience feel comfortable and…",
          "Contenu": "Read my patience feel comfortable and they were there Jennifer immediately when I needed her to help me change phone numbers I hope it’s a long relationship. I have a great weekend Dr. Marc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Harris",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T16:36:36.000Z",
          "Titre": "We are a fast-growing IT company with…",
          "Contenu": "We are a fast-growing IT company with heavy call volume. Answer First has made our communication with our customers much more efficient and I am extremely pleased with their service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Koonce",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T14:58:59.000Z",
          "Titre": "Consistently great work",
          "Contenu": "Consistent great work in handling every kind of call that came in, whether friendly ot not so friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Lamas",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T17:43:36.000Z",
          "Titre": "First month has been great!",
          "Contenu": "Very impressed with the onboarding, and the professional manner in setting up the initial script.  As well, as we have learned and adjusted to using the service, our rep Alison has been fantastic in analyzing calls and suggesting fixes to make it a better experience for us and our customers.  Well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Venola Rolle",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T04:13:15.000Z",
          "Titre": "The attention you give to filtering…",
          "Contenu": "The attention you give to filtering calls that are little more than telemarketing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy M",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T17:11:07.000Z",
          "Titre": "Positive Experience…",
          "Contenu": "We have been with the service for about 6 months now, and we have had a positive experience throughout.  From onboarding, to following our detailed directions, to resolving issues, everyone has been positive and helpful.  We are glad we made the switch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine",
          "Nb_Reviews": 5,
          "Date": "2023-03-31T15:25:45.000Z",
          "Titre": "I absolutely love the service",
          "Contenu": "I absolutely love the service.  Wish I would have started this a long time ago.  AnswerFirst is extremely efficient.  We get excellent feedback from our customers and clients.  Thank you AnswerFirst!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Fillion",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T17:00:35.000Z",
          "Titre": "Great value and functionality",
          "Contenu": "We've found the service is working perfectly. The set up process was easy thanks to the team who helped get us set up. It's also very reasonably priced."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Liebeskind",
          "Nb_Reviews": 2,
          "Date": "2023-03-03T19:58:12.000Z",
          "Titre": "The team does an exceptional job…",
          "Contenu": "The team does an exceptional job ensuring that the same level of care we have internally is represented whether we answer the phone or they do.  Our clients have had positive things to say about the experience with AnswerFirst and we will continue to use them for years to come!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Ragin CPA Consulting",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T13:13:09.000Z",
          "Titre": "The customer service was awesome",
          "Contenu": "The customer service was awesome. They got my company up and running quickly and their staff is very professional when answering my phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trey",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T22:25:45.000Z",
          "Titre": "Great sign on process",
          "Contenu": "Great sign on process. I feel comfortable knowing the call and message are always relayed to me. That was an issue with a past service provider."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina at Bloom Plastic Surgery",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T21:01:02.000Z",
          "Titre": "The reliability and ease of use has…",
          "Contenu": "The reliability and ease of use has been great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheila",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T18:01:50.000Z",
          "Titre": "Highly recommend this excellent service!",
          "Contenu": "Our entire experience with AnswerFirst and Stephanie has been excellent!  Everything has been very organized, efficient, and kindly taken care of."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T20:23:39.000Z",
          "Titre": "They got everything setup quickly",
          "Contenu": "They got everything setup quickly, they always get the information we request,make changes easy.WE have Been very happy with service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Gibby",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T15:51:34.000Z",
          "Titre": "This partnership has been exactly what…",
          "Contenu": "This partnership has been exactly what we need. We need the phones to be answered if someone calls. We rarely have phone calls at night but this is for the \"just in case\" scenario. The system is easy, the company helpful. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacey M.",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T08:15:16.000Z",
          "Titre": "Above and beyond!",
          "Contenu": "Great service. Fast at answering calls and getting back to you when you have requests. All around very happy I made the switch to them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T21:05:01.000Z",
          "Titre": "Very pleased with your service",
          "Contenu": "Very pleased with your service, nice to know my phones will be answered in a professional manor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arie Presman",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T23:00:03.000Z",
          "Titre": "Very nice company",
          "Contenu": "Very nice company, will recommend. Compare to other answering services The Best by far!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "12067129",
          "Nb_Reviews": 3,
          "Date": "2023-03-31T16:14:38.000Z",
          "Titre": "Peace of mind",
          "Contenu": "I am now able to work with client's without the fear of losing business because I missed a call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott McRae",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T18:10:53.000Z",
          "Titre": "Great service at a great price",
          "Contenu": "actually do what you say and charge a good rate. very nice and professional"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Jamison",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T20:42:07.000Z",
          "Titre": "Review for Allison",
          "Contenu": "Allison was very knowledgeable of the product, was able to answer all my questions, and has great customer service skills."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Epps",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T16:49:08.000Z",
          "Titre": "Timely solutions",
          "Contenu": "The team works with you on developing solutions and do so in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katherine Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T17:56:51.000Z",
          "Titre": "AnswerFirst is very professional &…",
          "Contenu": "AnswerFirst is very professional & reliable.  All agents have exceeded our expectations with giving our clients & prospects the correct information about our company & obtaining the information we need to intelligently call people back. AnswerFirst is a KEY element to our continuing success!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan Farnsworth",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T23:31:25.000Z",
          "Titre": "Pricing",
          "Contenu": "Pricing, customer relations, getting us our messages promptly. We are very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "USA HVAC SERVICES",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T00:14:12.000Z",
          "Titre": "AnswerFirst has been great for our…",
          "Contenu": "AnswerFirst has been great for our company, they are friendly to work with , professional, and  affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Parrish",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T15:59:21.000Z",
          "Titre": "Excellent Call Service",
          "Contenu": "Onboarding was very easy.  Reliable service. Excellent communication.  Great attention to detail.  I should have signed up years ago."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vena Fredericks",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T17:00:39.000Z",
          "Titre": "Great service",
          "Contenu": "All questions were answered, the set up was easy and everything is working smoothly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meredith Godwin",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T00:20:38.000Z",
          "Titre": "Excellent Service",
          "Contenu": "AnswerFirst made the start-up process easy and continues to provide excellent service for  my small medical practice at a competitive price.  The messaging process and iphone app is convenient and my patients have praised the kind and professional operators."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Harris",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T22:34:05.000Z",
          "Titre": "We are provided excellent customer…",
          "Contenu": "We are provided excellent customer service. All responses were prompt and professional. Very much recommend for services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ndeto Mwose",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T18:35:18.000Z",
          "Titre": "Responsive",
          "Contenu": "Responsive, and able to take my ideas and turn turn them into actionable processes and procedures."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TaxRelief1.com",
          "Nb_Reviews": 2,
          "Date": "2023-10-21T02:50:50.000Z",
          "Titre": "Very Professional",
          "Contenu": "Very Professional! Great company to do business with... Highly Recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angie Sanders",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T17:52:56.000Z",
          "Titre": "Essential for public utility company",
          "Contenu": "AnswerFirst has been wonderful for our company. Our customers feel their emergency issues are being addressed by speaking with a live operator. AnswerFirst is excellent at communicating with our technicians."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Harvey",
          "Nb_Reviews": 3,
          "Date": "2023-02-23T23:58:45.000Z",
          "Titre": "Don't look anywhere else!",
          "Contenu": "Taking our calls and sending us the details we ask for. Love the service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devin Sarnataro",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T18:20:12.000Z",
          "Titre": "It's simple and allows me to manage my…",
          "Contenu": "It's simple and allows me to manage my time better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Pierson",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T20:52:19.000Z",
          "Titre": "Been using AnswerFirst for over 10…",
          "Contenu": "Been using AnswerFirst for over 10 years great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adan Tapia",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T02:48:39.000Z",
          "Titre": "Had a very good experience",
          "Contenu": "Had a very good experience! Everyone was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheridan",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T22:15:12.000Z",
          "Titre": "good communication",
          "Contenu": "Always a quick response from Answer 1st. Very appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Law Office of Michael Herron",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T01:42:04.000Z",
          "Titre": "I have been a customer for many years…",
          "Contenu": "I have been a customer for many years and they have always done a great job. 5 stars"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T04:05:35.000Z",
          "Titre": "Great Service, Easy to Set Up and Use",
          "Contenu": "AnswerFirst operates exactly as advertised and has eliminated our internal phone answering admin burden.The onboarding process was thoughtful and thorough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Colter",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T15:42:52.000Z",
          "Titre": "Great company",
          "Contenu": "Great company, easy to work with. They captures our calls, when we can't. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Morris",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T23:40:46.000Z",
          "Titre": "Great work team",
          "Contenu": "Quickly resolved my request. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LandSolutions Inc.",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T21:09:40.000Z",
          "Titre": "Highly Recommended.",
          "Contenu": "Highly Recommended.Smooth onboarding (by Stephanie).Professional Agents.Following the script %100."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janeth E",
          "Nb_Reviews": 5,
          "Date": "2023-05-19T16:07:46.000Z",
          "Titre": "Grat Company!",
          "Contenu": "Great costumer service, communication and price.I highly recommend this company. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Mammana",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T21:49:27.000Z",
          "Titre": "When I had an issue it was handled…",
          "Contenu": "When I had an issue it was handled promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen Conder",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T15:21:25.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, timely responses, quality effort/work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mel Cook",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T23:13:13.000Z",
          "Titre": "Haven’t made a dime yet but hopeful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Bell",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T18:17:44.000Z",
          "Titre": "They do great job of taking care of us!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Smith",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T21:33:29.000Z",
          "Titre": "Really great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Lang",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T19:49:14.000Z",
          "Titre": "Great setup service."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Ali Entezar",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T20:55:54.000Z",
          "Titre": "Best customer service experience!",
          "Contenu": "Best customer service experience!Thank you team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AP",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T19:51:08.000Z",
          "Titre": "Great service!",
          "Contenu": "Fast, friendly service every time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Veronique McCowan",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T16:36:10.000Z",
          "Titre": "Customer Service team and Technical…",
          "Contenu": "Customer Service team and Technical support are phenomenal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie Peskay",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T16:10:29.000Z",
          "Titre": "So far doing good!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb A",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T19:56:45.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, fast response!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitchell Jacobs",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T16:07:06.000Z",
          "Titre": "Very reliable service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T22:21:04.000Z",
          "Titre": "Customer Service is polite and…",
          "Contenu": "Customer Service is polite and knowledgeable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John DePaolo",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T03:34:36.000Z",
          "Titre": "The experience was perfect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sylvester Clarke",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T20:04:30.000Z",
          "Titre": "Great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Logue",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T18:31:59.000Z",
          "Titre": "Great Communication"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Harvey",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T20:35:05.000Z",
          "Titre": "Excellent service"
        }
      ]
    }
  ]
}