{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "aperionaudio.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Cash",
          "Nb_Reviews": 1,
          "Date": "2020-04-28T11:28:37.000Z",
          "Titre": "1) I expected better quality",
          "Contenu": "1) I expected better quality.  A very tinny noise at elevated levels.2) If I would have known these were made in China, I would not have purchased.  I thought Aperion was made in the USA."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Antonina Arde",
          "Nb_Reviews": 1,
          "Date": "2019-01-09T21:36:24.000Z",
          "Titre": "Aperion super tweeter.",
          "Contenu": "I just bought a pair of aperion super tweeter and very disappointed it didn’t sound good as I expected. It was very weak hardly hear it. Even if you put your ears directly to it. I even run it direct to the amp by itself and still sound like whispering.It’s a waste of money and I wouldn’t recommend it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2018-06-18T14:03:09.000Z",
          "Titre": "Subwoofer scam",
          "Contenu": "Paid over $1000 for a subwoofer.  Luck for me the first time it died it was just inside the warranty.  Second time not so lucky.  They tell me they did not even manufacture this sub.  It has another companies components inside.  I feel like I got taken.  And I have a $1000 paperweight.Last time I buy from them.BTW I have 2 of their tower speakers and 2 center speakers as well.  No issues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fed up with Aperion",
          "Nb_Reviews": 2,
          "Date": "2018-05-03T21:31:54.000Z",
          "Titre": "One of the worst companies I've ever…",
          "Contenu": "One of the worst companies I've ever dealt with. Sold speakers with a 10 year warranty attached to a wireless head unit with a 1 year warranty that never worked correctly. They knew it. Never tried to work with me to make this right. I gave the useless speakers away and bought new ones from a reputable company.I can't believe these idiots contacted me for a review, they've only reminded me that I should have sued them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T00:25:04.000Z",
          "Titre": "I will never forget the horrible…",
          "Contenu": "I will never forget the horrible condition my new speakers arrived in.  I sent Aperion photos of the Fed-Ex delivery guy and his disheveled truck and the boxes that would not even stand up strait.  Aperion said: \"Oh the speakers are fine inside the box.\"  OK, how about I pick up your speakers and throw them?  Horrible customer service.  Surprised they are still in business.  Actually, they may not be...I heard they were bought out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T16:24:49.000Z",
          "Titre": "Expensive Wireless let down!",
          "Contenu": "Years ago I bought the Aperion Intimus 5t Wireless system and paid top dollar for it expecting to get a premium product. Well, as component entertainment systems usually last years this has not and several speakers as well as the receiver have failed on me. While Aperion was once happy to help the product and support have long since been discontinued and now I am left with a half operating, expensive $3,000+ piece of junk. I should have known and will likely never purchase an Aperion Audio product again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 1,
          "Date": "2018-05-05T01:02:28.000Z",
          "Titre": "Buyer be ware",
          "Contenu": "Buyer be ware. The good is great sound at a reasonable price. The bad is terrible service. My sub-woofer power amp blew out soon after purchase, When I called for help I was told too bad. They can not fix it, provide replacement parts or suggest where to get it fixed. Basically I have $1000 paper weight."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rich W.",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T21:23:16.000Z",
          "Titre": "DO NOT BUY",
          "Contenu": "DO NOT BUY! My purchase of an Aperion Summit 5.1 wireless speaker system is one of the worst decisions I have ever made.  They system started failing within several months of purchase, but by that time, the agreement between Aperion and Summit (owner of the wireless technology) had fallen apart.  No warranty, parts or other support available. For what it’s worth, the people at Aperion are polite, and tried to help me troubleshoot the multiple problems, but unapologetic and offered no compensation or other advice. A $3000 mistake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T21:23:24.000Z",
          "Titre": "Decent products but questionable support",
          "Contenu": "I have had good experiences with their passive speakers but very bad experience with their active electronics.  My Bravus subwoofer has failed and a pair of Allaire speakers stopped working.  The big problem with that was that they had changed the design of the Allaire (after barely one year) and no longer offered replacement parts.  They didn't stand behind their product and they didn't offer me any kind of favorable replacement option.To make matters worse I tried to leave an honest review of the Allaire on their website and they never allowed it to be published."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave FL",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T21:10:19.000Z",
          "Titre": "I bought a set of Intimus Tower…",
          "Contenu": "I bought a set of Intimus Tower speakers and Verus II Grand Center (which is excellent).   The towers get shrill (totally lacking in base) and pushed to higher volumes.  When bi-amped - it gets WORSE.   The biggest problem I had with Towers was a mfc defect in the front base support (yes ... a simple cast aluminum part - that would not hold a screw leg ,,, so the speaker would like fall over).   I tried more than a half dozen times talking to customer service ... they have sent me (over time) 3 different replacement front leg brackets ... not a single one was compatible (different height) with the rear bracket.   I give up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T10:40:25.000Z",
          "Titre": "I thought these speakers were just…",
          "Contenu": "I thought these speakers were just flat.  Turns out the tweeters were non-working.  Aperion doesn't even carry the model to fit their boxes (early generation diaural x-over).  Sub is good, though"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aperion",
          "Nb_Reviews": 4,
          "Date": "2018-04-26T21:18:23.000Z",
          "Titre": "When my Asperion subwoofer blew they…",
          "Contenu": "When my Asperion subwoofer blew they offered no help in fixing it, told me to take it to an audio repair place to have it fixed. My Velodyne still blasting away and giving the best of performance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2018-05-03T21:24:01.000Z",
          "Titre": "Bought a subwoofer from Aperion",
          "Contenu": "Bought a subwoofer from Aperion. Failed after 5 years. Aperion refused to honor warranty and said that they no longer had the parts to fix it. Completely unsatisfactory response. Buyer beware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "“Sub”par",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T16:06:26.000Z",
          "Titre": "Subwoofer blew after moderate use",
          "Contenu": "Subwoofer blew after moderate use. No repair or discount was offered. Just told to buy another one which I of course declined to do. Would not recommend"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Venk",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T21:09:11.000Z",
          "Titre": "refund wasn't issued when the…",
          "Contenu": "refund wasn't issued when the equipments were returnedclaiming it was damaged. equipments returned properly in original packaging"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2018-05-08T20:08:41.000Z",
          "Titre": "Purchased an Aperion Audio 4T Summit Wireless -- bad news!",
          "Contenu": "Purchased an Aperion Audio 4T Summit Wireless system for $3000.00 in February 2013. Sound was very good and system was easy to setup. Initial support was very good. By May of 2015 it was non functional. While speakers were warranted for 10 years, electronics were only warranted for a year. Electronic transmitter went bad. Aperion sold system to us knowing it was going to be discontinued but did not tell us that. When problems occurred they Indicated they would still assist with the electronics mfg. to address malfunctions. Electronics manufacturer discontinued supporting the product. We were offered a paltry $750.00 by Aperion toward a new system, but we would have to return the old system at our own cost. Initially, Aperion's support was very helpful, but once the system was discontinued, the offer for replacement was inadequate as far as we were concerned, especially considering the system must have been known to be unreliable. Aperion took advantage of us as far as we were concerned. Now we have 5 large paper weights too big for a desk! Would not purchase from Aperion again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Castellano",
          "Nb_Reviews": 1,
          "Date": "2018-10-25T11:11:25.000Z",
          "Titre": "Thumbs up",
          "Contenu": "Great customer service,  prompt and courteous.  Also very helpful with  acoustical set up!  I love My  speakers."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "MB",
          "Nb_Reviews": 41,
          "Date": "2018-04-26T21:22:15.000Z",
          "Titre": "Asked to give me a positive review by…",
          "Contenu": "Asked to give me a positive review by (unwanted) email."
        },
        {
          "Note": 2,
          "Lieu": "GH",
          "Pseudo": "Ishmeal Tawiah",
          "Nb_Reviews": 3,
          "Date": "2023-10-29T19:57:14.000Z",
          "Titre": "This company must be help to make more…",
          "Contenu": "This company must be help to make more money and also give them attention seek of the help the unemployed people to Gain something on the internet to cater for them self"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T21:42:38.000Z",
          "Titre": "Quality/Value Issues",
          "Contenu": "Aperion has quality and price (value) issues.  In my 5.1 system, I had both an in-ceiling rear speaker and the Bravus-8 subwoofer fail after a few years of service.  They could not support repair of the sub and I reluctantly ordered a new one.  Apparently, their new design couldn't make it out of the factory and after many months I cancelled the order.  Aperion sales wanted to sell me the 10\" sub for $600, but I bought a Klipsch 10\" sub for under $200 and it sounds great w/ the Intimus speaker set."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "paul",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T01:33:01.000Z",
          "Titre": "Old technology that has lots of…",
          "Contenu": "Old technology that has lots of problems: e.g. puts itself on stand by out of the blue, has to be reset lost of time. I don't recommend it. It lasted only 5 years and then all has become legacy: the UI, the connection standards and the sound standards; SW have never come in after 5 years"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "michael",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T21:24:57.000Z",
          "Titre": "I bought wireless speakers which are…",
          "Contenu": "I bought wireless speakers which are fantastic and I love in 2012. I have wanted to buy more but was told they were out of stock. Now I believe they no longer make them. What a shame as they were a great product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T21:17:12.000Z",
          "Titre": "Abandoned Aperion product",
          "Contenu": "I purchased an expensive system from Aperion in 2011, the Intimus 4T Summit Wireless System. It worked well until 2015 when it began to fail. I called Aperion for help in repairing the system and was told that they no longer sell or support the system. There was nothing they could do to help with repair or replacement.I did receive advice from the tech support person suggesting that it might be a power issue. He advised me to search for a replacement power cable. I took his advice and fixed the immediate problem but I'm now on notice that when something more serious fails I'll have to replace the entire system, 6 speakers and the amplifier. I don't think I'll be purchasing a replacement from Aperion."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "james",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T10:42:55.000Z",
          "Titre": "Meh.......",
          "Contenu": "The fit and finish of the speakers are pleasing, but performance wise I expected more. The treble generated due to the size of the ribbon is negligible in my opinion. In addition, I also found that any adjustments made with the dial or jumpers had zero effect. Take into consideration, that I savor my highs to be extremely bright. Truth be known, I am a self professed treble guy. If you are like me, with the heightened expectation that these little boxes will cut through, or shatter glass with high frequency you will be dissatisfied. If you taste is tailored towards a very light audiophile accent to compliment your system, than these maybe for you.The market is far from being saturated with a choice of super tweeters, so  in all fairness this was a relatively low cost experiment.James"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CLARENCE",
          "Nb_Reviews": 1,
          "Date": "2018-12-04T22:42:11.000Z",
          "Titre": "I purchased a pair of the Intimus 5T…return policy less than desirable",
          "Contenu": "I purchased a pair of the Intimus 5T tower speakers.  I wanted to match the current center channel finish Verus forte (piano black). I did not see this finish available in the piano black as part of their regular online product offering, but found the \"piano black\" offering as an open box.   I received the product and it had good sound presence, especially in the mid-range.  However, the speakers lack the bass output and the overall sound experience I was looking for.   I then call customer service to ask for a return (RMA) since i had only had the speaker approximately three weeks, but was told that since they were open box, I would have to pay to return them.  Highly disappointed in this return policy.  I guess I will have use Amazon going forward.  Amazon stands behind their return policy whether regular or discounted pricing applies to the merchandise. (Order #1518)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peyman",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T21:30:49.000Z",
          "Titre": "The subwoofer is not working properly",
          "Contenu": "The subwoofer is not working properly! No matter how to set it up. The mounting bracket behind the small speakers are not setup to hold the weight."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:36:10.000Z",
          "Titre": "Sound great, except the gouge",
          "Contenu": "Speakers sound great. I rated 3 stars because of a huge gouge taken out of the side of one of the speakers. This was clearly something that occurred prior to packaging since none of the packaging was damaged. A good joke to send white gloves and a cleaning cloth in the box."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JDG",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T21:22:14.000Z",
          "Titre": "Good Customer Service doesn't make up for a poor initial design.",
          "Contenu": "I did not realize when I bought my book shelf speakers that there is no on off button on the speakers themselves, meaning if you loose or break your remote (which is what happened in my case after an 18\" fall) the entire system becomes worthless.  Fortunately you can purchase replacement remote controls.  I bought two for the inevitable future falls from the coffee table.  Customer service was great and accommodating, but the original design and the light duty nature of the remote is horrible.  Wish I didn't have to spend money to fix this design flaw."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Nelson",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T00:20:44.000Z",
          "Titre": "Order was placed on 9-21 and my card…",
          "Contenu": "Order was placed on 9-21 and my card was charged for the speakers that di not ship to me until 10-25.  The late shipping did not bother me because I knew the issues with shipping.  I do object to paying for something I do not have.  Should not have been charged for the speakers until they shipped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leon P.",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T21:16:29.000Z",
          "Titre": "Great sounding speakers, but didn't last",
          "Contenu": "Great sounding speakers (Zona wireless) that died after only 4.5 years -- they just stopped working. To their credit, Aperion's customer service/tech people tried everything they could think of to figure out a solution, including sending new power cords etc, but to no avail. Disappointing..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 2,
          "Date": "2018-04-27T06:07:56.000Z",
          "Titre": "I rate Aperion 5 stars",
          "Contenu": "I rate Aperion 5 stars. great Service, packaged exceptionally nicely, high quality - in a class with speakers costing easillt twice as much, beautifl cabinets and audiophile sound way above its' selling price. I hove bought their best 7.2 systems for my home in texas and my home in Idaho."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T21:10:47.000Z",
          "Titre": "Quality speakers, but...",
          "Contenu": "I loved the quality of the speakers (Versus Grands), but felt that they were a little weak in the bass region, even for 2 channel music listening. I called customer service and their reply was to \"get a subwoofer\" to which I replied \"That is why I purchased these large towers in the first place - not to have a subwoofer\". They were not very cooperative when I wanted to return them either, as I did not have the boxes (they had gotten wet), even though I offered to pay for new boxes to ship them back in. I wound up selling them on e-bay, and loosing a good bit of money. So, not a great experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T00:20:13.000Z",
          "Titre": "Meh..",
          "Contenu": "Meh... to much BS with their sub-woofers:Amp crapped out multiple times and then upgraded to the 12d and had more issues. Ended up with the piano black finish since they no longer offered the cherry which I never wanted."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aperion",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T00:11:17.000Z",
          "Titre": "Legacy products",
          "Contenu": "I like the products and have the original version from 20 years ago. My only complaint is the customer service back then was to replace if anything was wrong with a product now I can’t get assistance"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Franklin",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T20:25:02.000Z",
          "Titre": "Great sound, frustrating experience!",
          "Contenu": "First off, the sound of these speakers are fantastic, as is the bluetooth connectivity. What really puts a damper in these speakers however is the fact that they automatically turn off after a few minutes. Having used these speakers for years now I will say that the experience has really been frustrating. Imagine going to the bathroom or going to get the mail then coming back to play something to then notice the speakers are off, then having to find the remote to turn them on because thats the only way they will turn on. Now imagine doing that everyday for 3 years. Its gotten to the point where I just leave something playing while I go make a lunch or some other random task so I don’t have to keep turning on the speakers when I return. All in all, great sound and features but the fact that it always turns off after a few minutes if I’m not playing some sort of sound makes this a hair-pulling product to own. I wouldn’t buy these again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter D",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T23:59:07.000Z",
          "Titre": "Order experience was highly…",
          "Contenu": "Order experience was highly problematic.  Called before ordering to confirm availability, then ordered a pair of high end speakers plus an integrated amp from another supplier.  Did not receive an order confirmation, nor did I receive the speakers.  When I called, it took a while to sort things out...only to be told my order did not get in on time to reserve the available speakers, and it may take months for me to get them.I already had the amp, and paid for it.Someone finally prioritized my order, and they sent me a pair of speakers that had been returned within a few weeks.  The color of the speakers (Cherry) did not match the photos on the website (they were stained a bright red, not natural Cherry colored as in the photos) so we returned them.The sound was o.k., but not natural enough to warrant the jarring aesthetics of the red speakers.  In all fairness, we expected the sound to be lifelike and on par with some fairly high end speakers we tried that were four times the cost."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KENNETH WILEMON",
          "Nb_Reviews": 3,
          "Date": "2019-07-17T08:48:15.000Z",
          "Titre": "Missing one of the rubberized feet for…",
          "Contenu": "Missing one of the rubberized feet for speaker.That g ok t you Mark's off.Otherwise ......."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Aperion",
          "Nb_Reviews": 3,
          "Date": "2018-04-27T08:29:22.000Z",
          "Titre": "pricing",
          "Contenu": "pricing could be better, the quality against some others may lack for the surround sound, theater"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scooter Storm",
          "Nb_Reviews": 2,
          "Date": "2018-05-03T21:59:31.000Z",
          "Titre": "Great Sales Staff...But Disappointing Product.",
          "Contenu": "I bought a complete set of speakers from Aperion for a home theatre system I was installing in my home. I bought 2 large front facing speakers for either side of the screen, 4 smaller units to be mounted on the walls at the sides and back of the room, a separate speaker for under the screen and a large amplified speaker for bass sounds.My interaction with the company was very good throughout and I had no problems making my order or getting the speakers. They were shipped very well packaged/protected and were handsome to look at.My issue is that they just didn't sound as good as I was led to believe they would by advertising. I bought these over the internet based on others subjective reviews, but have to admit to being disappointed in this expensive purchase. By the time I was finished adjusting and working with them it was too late to do anything about it.The speakers play well at higher volume but are noticeably anemic when played more softly or at regular levels. The large powered woofer buzzes if left plugged in with the system off and also seems not to be very capable of adding any depth to sound when not played at higher volume. I had to return the first woofer I got for other issues...and this one developed it's own sometime after the warranty expired.I really wanted to like this company and their products...I think they handled all aspects of the sale and delivery quite well...and yet the product itself is as I mentioned before a disappointment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donnie Ricciardi",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T02:56:39.000Z",
          "Titre": "Not enough gain"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T21:04:10.000Z",
          "Titre": "Nothing special"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Petro",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T06:34:26.000Z",
          "Titre": "Fantastic cabinet work… beautifully…",
          "Contenu": "Fantastic cabinet work… beautifully made. Sound is big and bold, yet able to communicate musical delicacies. Stage width better than depth, but both may improve after break in and placement changes. Grills are however a poor design- on bass heavy passages, grills rattle and the 8” drivers extend far enough to contact the plastic on the back side of the grills. Larger cutouts for the woofers are necessary to make the grills usable for dynamic passages."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jackie Spivey",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T14:09:58.000Z",
          "Titre": "The appearance of these speakers are…",
          "Contenu": "The appearance of these speakers are beautiful. Compared to several other speakers that I have, these take a lot of time to integrate into my systems. Treble is manageable, bass needs lots of attention, thumpy but not smooth. Overall I can make them sound good, but it takes several adjustments to be satisfied with the sound. Smooth out that bass and these speakers are grand slammers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexander Garcia",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T02:45:18.000Z",
          "Titre": "If you want premium speakers",
          "Contenu": "If you want premium speakers, you're gonna pay premium price. The finish on the Versus is so nice. Their website isn't too bad, definitely wish there were more information about setting the crossover levels."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris V.",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T21:58:55.000Z",
          "Titre": "Very good performance for little money",
          "Contenu": "I chose the basic planar ribbons as super-tweeters for my small system (incl. Odyssey monitors, GamuT amp, MSB DAC) which is room-EQed using Dirac Live DSP and ASI resonators, but the highs were lacking air and presence. The Aperion tweeters are more than easy to integrate, but I needed to choose a higher x-over point to avoid a degradation in uniformity, so 12k/14k was absolutely necessary for my system. Like all good super-tweeters  the ENTIRE frequency range is affected, as we listen to musical overtones and not to HF sine waves. So speaker integration was my priority here, and the outcome was quite good. Matching the goals I had beforehand. I have some IsoAcoustics pucks underneath them. The price is very modest. Very satisfied. As Aperion mentions explicitly, you will need to adjust X-Over freq. (HPF) + attenuation carefully, otherwise you won't be able match them to your speakers well."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Giuseppe Pallotta",
          "Nb_Reviews": 1,
          "Date": "2022-06-30T22:24:15.000Z",
          "Titre": "Happy Find",
          "Contenu": "I had heard of supper tweeters and it was logical to me, same as subwoofers are very popular today. But the ones i had found where all expencive, till i found what Aperion had to offer. Was very happy to find an option to my curiosity and i am enjoying trying them out and Aperion was very accesible to discus how to use them in the best way possible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Labriola",
          "Nb_Reviews": 2,
          "Date": "2021-09-30T19:06:27.000Z",
          "Titre": "After waiting 14 years",
          "Contenu": "After waiting 14 years to finally get my speakers it was a bit disappointing to find they were damaged in shipping or packing. I can only hope the integrity of the speakers themselves were not harmed at all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob Milller",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T04:07:05.000Z",
          "Titre": "Initial response was slow but after…",
          "Contenu": "Initial response was slow but after reply communication and help was great. Part was under warranty and just had to pay shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Miroslaw",
          "Nb_Reviews": 3,
          "Date": "2023-03-03T21:42:49.000Z",
          "Titre": "A most beneficial (and recommended) product!",
          "Contenu": "Wonderful product that provides a myriad of benefits, not just expanding the high end but also adding articulation to the bass, and widening/deepening the overall soundstage. Ultimately my main speakers (electrostatics) are just too inefficient to make these work full time, but I heartily recommend them to all that have 87+ sensitivity mains.Also please note that the company's communications and customer service are outstanding.Well done, Aperion!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 10,
          "Date": "2021-12-21T22:58:03.000Z",
          "Titre": "With the exception of a couple of…",
          "Contenu": "With the exception of a couple of glitches in the connectors, which Aperion immediately rectified (after having to return it twice) due to inadequate solder joint; Aperion sent a new cable but it was longer than my original order necessitating a second return trip back to Aperion (I originally ordered a 3-ft.length) HOWEVER, this is the only reason why I gave it 4/5-stars. Customer service is superb, really aiming to please the client. And the sound of the Silver cables coupled with my Focal Elegia's/Astell and Kearns player is very difficult to tear myself away from because of their musicality, incredible detail and stage-like imaging."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan Constantine",
          "Nb_Reviews": 1,
          "Date": "2022-01-31T18:54:50.000Z",
          "Titre": "I like the rear speaker mounts I got",
          "Contenu": "I like the rear speaker mounts I got - however, the screws were too short to bite through 5/8\" sheetrock and into the studs behind. Had to substitute my own. Seems they should be an inch longer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NWdad",
          "Nb_Reviews": 2,
          "Date": "2021-08-16T18:06:30.000Z",
          "Titre": "Bracket works well",
          "Contenu": "Bracket works well.  It was missing the silicone pads that keep the speaker bottom from resting directly on the wall.  I have reached out to Aperion to have them send me the parts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 10,
          "Date": "2021-12-20T20:39:45.000Z",
          "Titre": "Excellent Customer Service; Amazing Cables!",
          "Contenu": "Initially, had difficulty with a short in the right H.P. plug. Sent it back to Aperion and, after a second glitch, returned it again. But customer service was excellent. Very pleased with Aperion and the cables are superb!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ogden Lopez",
          "Nb_Reviews": 2,
          "Date": "2021-08-11T10:12:28.000Z",
          "Titre": "Everything seems good on performance",
          "Contenu": "Everything seems good on performance, even when my speakers are 98db sensitivity has being doing a good listening experience, BUT I received a pair of the gloss black and I purchase the Brush black as with the intention of get a speaker and system matching… it the only thing that’s is not ok ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael N.",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T22:29:47.000Z",
          "Titre": "Great products",
          "Contenu": "Great products, customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2019-12-28T00:54:59.000Z",
          "Titre": "Aperion Allaire Bluetooth Speakers",
          "Contenu": "I just purchased a pair of Aperion Allaire Bluetooth speakers. My only complaint was the lack of a detailed step by step (with pictures for the challenged) description of the setup process. The speakers and remote were working fine, but I didnt know how to tell, so I ended up searching on the web for how to open the remote and replace the battery and so forth. I eventually requested assistance in a chat window on the web and someone got back to me by phone and they straightened me out right away. No harm done"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Colon",
          "Nb_Reviews": 3,
          "Date": "2019-02-26T23:09:04.000Z",
          "Titre": "Nice to find a part for my 15 year old…",
          "Contenu": "Nice to find a part for my 15 year old speakers. Communication with Aperion was long and drawn out but everything worked out in the end. Thanks Aperion for the part. Wish you had more offerings. Some folks hang on to good speakers and other high end audio equipment for years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MikeA",
          "Nb_Reviews": 4,
          "Date": "2018-04-26T21:27:07.000Z",
          "Titre": "Really good product for the money…",
          "Contenu": "Really good product for the money Aperion can't be beat.  The only fallback is that some of their more popular speakers run out of stock, and there is a long waiting period for restocking to appear.  That's why I give them 4 stars and not 5."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marty Meyer",
          "Nb_Reviews": 2,
          "Date": "2019-03-18T21:25:17.000Z",
          "Titre": "I give the aperion allaire speakers an A-",
          "Contenu": "The company was easy to transact with. I was able to do a chat with a rep who provided me with a new customer discount code which was very much appreciated.  Speakers have excellent sound quality in the midrange to high end. Super clear and full at those frequencies.  I love the fact they accommodate Bluetooth and direct connection. The remote is handy as well. The only negative is that bass response is limited. Given the speaker size this is expected. I paired them with my Martin Logan sub and together they make beautiful music! Would recommend folks look at the bundle offered by aperion with subwoofer or just buy a decent 8” sub to go with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T17:46:14.000Z",
          "Titre": "Our dealings have been first class",
          "Contenu": "Our dealings have been first class. We just wish that there was a coalition to provide some American Made and/or western world products. We don't like buying products made in countries controlled by dictators, i.e. China, Vietnam, etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Freels",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T23:29:10.000Z",
          "Titre": "All good",
          "Contenu": "All good, if I were to comment, the speaker stand for the super tweeters are exhorbitantly priced for what you get. Second signature delivery via USPS is a pain as no options are available for delivery ( unlike UPS and Fed Ex)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Godwin",
          "Nb_Reviews": 1,
          "Date": "2018-07-17T20:13:21.000Z",
          "Titre": "Great natural sound",
          "Contenu": "Great natural sound.  Bluetooth connects easily. Tried the optical connection, haven’t succeeded yet, still futzing with it. Aperion was great - I had mis-ordered, they sent my desired speakers the next day, got them the following day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cordell",
          "Nb_Reviews": 2,
          "Date": "2018-05-07T09:58:16.000Z",
          "Titre": "Aperion Audio is great sounding bliss",
          "Contenu": "Aperion Audio offers great sounding speakers at their price point with amazing finishes. The equipment looks like it costs hundreds, if not thousands, more. Clarity, detail and bass response is good and customer service is great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T15:53:36.000Z",
          "Titre": "Good speakers .",
          "Contenu": "Good speakers .I do have trouble with one of my Verus Grand Bookshelf speakers where the high frequency drops every once and a while.(I think it is a bad solder joint.)The speakers look great and sound good."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "TF",
          "Nb_Reviews": 1,
          "Date": "2019-04-23T23:06:25.000Z",
          "Titre": "The only reason that it wasn't 5 stars…",
          "Contenu": "The only reason that it wasn't 5 stars was because one of my speakers had a random issue out of the box.But to their credit, a part was shipped ( out of country ) immediately and problem was solved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 7,
          "Date": "2018-05-04T00:43:52.000Z",
          "Titre": "Like the tech support and speaker…",
          "Contenu": "Like the tech support and speaker design.  However,  I did have some issues with the model I received,  but Aperion did not have another available pair to exchange.  But I will buy again.."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "picky audiophile",
          "Nb_Reviews": 5,
          "Date": "2021-02-04T20:11:14.000Z",
          "Titre": "Aluminium Ribbon Super Tweeter: GREAT item, packaging mediocre only",
          "Contenu": "Bought one piece of \"Aluminum Ribbon Super Tweeter Speaker Pair Gloss Black\" which is a great item to upgrade speakers lacking treble sparkle, resolution and extension (e. g. these with below top-notch grade soft dome tweeters). Highly recommendable! Do a great job on top of my Polk LSiMs.Item was shipped within 24 hours after purchase.My only complaint is poor packaging. Retail box is so damn tiny that speaker front has only 0.57\" air clearance to cardbord from packaging. On rear side where binding posts stick out it's only 0.35\" clearance to cardboard.It was bound to happen mine were hit centrically at one speaker's leading edge by intrusion in transit, resulting in minor dent visible. As I am not a nitpicking guy it's still O.K. to me. But it could be avoided by using larger foamed inserts and just a little bigger retail box. These sit too close to cardbord in their packaging, at least with their unprotected middle of cabinets."
        },
        {
          "Note": 4,
          "Lieu": "DO",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2021-08-30T21:51:20.000Z",
          "Titre": "Aperion AMT",
          "Contenu": "Extremely pleased with the sound quality and purchasing / customer service representative."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHARLES",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T22:03:12.000Z",
          "Titre": "good but not great",
          "Contenu": "Tower soeakers are good but not great, and wireless bookshelf speakers are problematic in that they need additional attention to turn on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brock S.",
          "Nb_Reviews": 4,
          "Date": "2019-04-22T17:32:05.000Z",
          "Titre": "Over a decade ago I bought an S10…",
          "Contenu": "Over a decade ago I bought an S10 powered sub.  It has had very little use and no abuse.  It went unused for about the past five years and properly stored.  When I went to use it recently it had no output.  I carefully reviewed the owner's manual to no avail.  I called Aperion on two occasions and spoke to two different employees there, Steve being one.  They were very patient, responsive, and helpful.  The problem couldn't be solved over the phone.  I ended up taking the speaker to them where they ran tests and determined the amp was not working.  They could not repair it due to parts unavailability.  In the big picture I was disappointed that the sub failed with so little use and good care.  I was also disappointed that they could not repair their own product.  I can't say I'm happy with the product, but I am very pleased with their customer service and attitude.  I would purchase another product from them.  I found a terrific old school stereo repair shop near Aperion and I believe they can repair my unit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T13:33:51.000Z",
          "Titre": "11 Years after purchase",
          "Contenu": "11 Years after purchase, now you want a rating?  Speakers are ok.  Mounts have broken and had to be repaired."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Talmadge",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T21:13:31.000Z",
          "Titre": "Nice looking High Quality Build",
          "Contenu": "Nice looking High Quality Build. Over priced. Limited at high volume listening...not built for the Disco"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "allan winston",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T21:22:42.000Z",
          "Titre": "eight years and no issues",
          "Contenu": "I have had the speakers and sub for 8 years and everything works. Good value for the money. No issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bret",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T21:46:13.000Z",
          "Titre": "Almost Great",
          "Contenu": "Does not have the range I need, but, it did solve a lot of distribution situations in-house."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aperion",
          "Nb_Reviews": 1,
          "Date": "2018-05-03T21:37:18.000Z",
          "Titre": "No problem with any service or…",
          "Contenu": "No problem with any service or products.  Only suggestion would be little more bass."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2020-09-07T21:09:39.000Z",
          "Titre": "Customer support was helpful",
          "Contenu": "Customer support was helpful. The speaker was sounding good, but not my taste"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T20:26:44.000Z",
          "Titre": "Great equipment",
          "Contenu": "Great equipment, delivered on time and in good condition.  Love it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2018-12-11T00:36:23.000Z",
          "Titre": "I love the sound I’m just not that into…",
          "Contenu": "I love the sound I’m just not that into the look of the speaker."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "US traveler",
          "Nb_Reviews": 7,
          "Date": "2018-05-03T21:50:14.000Z",
          "Titre": "High quality sound at reasonable price",
          "Contenu": "High quality sound at reasonable price. Very attractive too"
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Choo Chun Choong",
          "Nb_Reviews": 1,
          "Date": "2020-11-04T01:00:36.000Z",
          "Titre": "Very helpful of the sales…",
          "Contenu": "Very helpful of the sales representative, well done!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "av",
          "Nb_Reviews": 3,
          "Date": "2018-04-26T21:41:35.000Z",
          "Titre": "Need bigger speakers to compete against…",
          "Contenu": "Need bigger speakers to compete against Klipsch Audio."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karl Gaylin",
          "Nb_Reviews": 1,
          "Date": "2019-06-02T18:02:29.000Z",
          "Titre": "Aperion is great!",
          "Contenu": "Great service. Very responsive and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "srinvasan vijayaraghavan",
          "Nb_Reviews": 2,
          "Date": "2020-09-09T19:38:21.000Z",
          "Titre": "Very good attention and advice"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JAMES",
          "Nb_Reviews": 5,
          "Date": "2018-04-26T22:11:20.000Z",
          "Titre": "Very happy with the speakers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Potenziano",
          "Nb_Reviews": 2,
          "Date": "2019-03-06T21:53:51.000Z",
          "Titre": "GREAT company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "allen archer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:42:05.000Z",
          "Titre": "I was looking for a 3 way center…",
          "Contenu": "I was looking for a 3 way center speaker and after doing way to much research I ran across a couple of you tube reviews. The reviews were very positive so I decided to give them a try and I can say the sound and built quality are superb! Having a 3 way center is a must. I also bought the Novus bookshelf speakers to go with the new center in a small home theater, they are awesome as well. Looking to move the bookshelves to the back and add some Novus towers in the front. The only disappointment is how hard these where to find while doing my research for new speakers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff semone",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:50:25.000Z",
          "Titre": "Service assistance",
          "Contenu": "Aperion's customer service has been excellent!  The guys were all extremely helpful over the phone and even more so in person.  I had an issue with a mysterious popping sound in my subwoofer.  Because I'm in the Portland area, I was able to stop in, and they swapped out the amp for it!  It was quick and seems to have resolved the issue.  Thanks so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Czerak",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:24:02.000Z",
          "Titre": "My first big amp :)",
          "Contenu": "This is my first separate amp for my theater.  The Sales/Support folks were informative and very helpful answering questions. The difference the amp made over my AVR is amazing. By pulling the load off the AVR, even the other speakers improved when playing Atmos related content."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T23:35:42.000Z",
          "Titre": "Love the AMT super tweeter",
          "Contenu": "Love the AMT super tweeter, great product and extremely well built. Love the fact it has gain and frequency adjust can be easily integrated with any speakers where as most super tweeters have just one adjust and becomes very challenging and compromising. Built very solid, extremely robust. Custom service was fantastic, responsive and very helpful. Very happy with the product and very happy with their service, absolutely recommended! I would be recommending this to my friends. 5 stars all the way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T21:45:51.000Z",
          "Titre": "Amazing speakers and helpful staff",
          "Contenu": "Aperion Audio has very knowledgeable and helpful staff who are very focused on customer service. I bought 2 Verus V8Ts, a Verus V8C, and 4 Clearus C8Cs for the ceiling Atmos speakers. The speakers are amazing and I am very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:04:32.000Z",
          "Titre": "Sounds great!",
          "Contenu": "Sounds great! Doesn’t take too much space. Snuck it in when wife was not looking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicolas Sikaczowski",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:59:34.000Z",
          "Titre": "Continues to have great service and the…",
          "Contenu": "Continues to have great service and the absolute best speakers. I’m a repeat customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Tompkins",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T16:54:01.000Z",
          "Titre": "New Tri polars speakers from Aperion Audio",
          "Contenu": "Great service with great product and rapid fed ex delivery. I installed the new Tripolar speakers and luv the way they enhance my home theater experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Held",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T21:23:35.000Z",
          "Titre": "As always the customer service with…",
          "Contenu": "As always the customer service with Aperion Audio is outstanding! Colin was knowledgeable and allowed me to test drive my new subwoofer in the showroom. My old Klipsh sub died, so now I have the matching Bravus subwoofer to go with my Bravus bookshelves and center channel and surrounds, This 10” sub is amazing for its size, plenty deep, punchy and accurate. Thanks again Colin for guiding me to another satisfied sale!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louisville John F",
          "Nb_Reviews": 4,
          "Date": "2023-11-10T22:31:59.000Z",
          "Titre": "A Pleasant Surprise",
          "Contenu": "The speaker is performing well but I was very pleasantly surprised at packaging of the speaker. A lot of work went into insuring that the speaker was not damaged in delivery!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AlexM",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T22:04:44.000Z",
          "Titre": "Great customer support and products",
          "Contenu": "I got great advice from customer support before ordering which helped me choose the correct model. Shipping was fast and the product arrived in perfect condition. I ordered the Planar magnetic supertweeter to pair up with Magnepan main speakers. The synergy is great and I am enjoying the extra level of space and detail the super tweeters have added. I was expecting a lot more subtle effect but this has far exceeded my expectation"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Nicholes",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T23:05:07.000Z",
          "Titre": "Aperion Verus V8T Stereo Speakers",
          "Contenu": "After much searching and review I chose the Verus V8T stereo speakers to upgrade my 1999 rack mount system. My system is anchored with a 1999 Parasound HCA-1500A power amp rated 205 watts x 2 at 8 ohms and 315 watts x 2 at 4 ohms which easily drives the superb V8T's to wounderful sound despite the amps age. Besides the highly satisfactory performance, the V8T includes supreme build quality and features. I am very happy with the V8T's and rate them a 5 star product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T23:00:45.000Z",
          "Titre": "Theatrus Speakers",
          "Contenu": "This is just a preliminary review, was just able to test each speaker in a two channel set up for now.  Once I have complete construction for behind screen installation, I will do another review.  So far, out of the box they sound amazing and I am looking forward to getting them set up permanently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Righthouse",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T10:01:41.000Z",
          "Titre": "I just purchased the Novus N5C center…",
          "Contenu": "I just purchased the Novus N5C center channel speaker. Worth every penny! Crisp clear dialogue straight out of the box. Excellent build quality. Very EASY to power. I am using the Aperion Audio Verus III Grand V5B bookshelf speakers for mains and N5C blends perfectly with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 8,
          "Date": "2023-07-31T20:54:58.000Z",
          "Titre": "Your search can end here",
          "Contenu": "Shopping for audio gear can be a daunting experience. Many audio retailers have a tendency to engage in high-pressure tactics. They sometimes seem to take advantage of a person's lack of knowledge. Such is not the case with Aperion Audio. They are one of the finest, and I've shopped at numerous audio outlets over the years. I have no hesitancy at all in recommending this business. The staff are extremely knowledgeable and personable – – no better place to go."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Leavitt",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T18:44:34.000Z",
          "Titre": "Best pre and post purchase customer service ever!!!",
          "Contenu": "Collin was incredible throughout the pre-purchase and post purchase process.  Made sure the speakers included the grills desired and threw in some Aperion swag too!  This was my third purchase from Aperion in the past month!Phase 3 of speaker upgrade complete, 2 more phases to go, and both will be Aperion speakers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Moti",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T02:03:35.000Z",
          "Titre": "Glorious Glockenspiel",
          "Contenu": "I was on the fence about spending this much for tweeters––especially super tweeters, but as soon as I adjusted the settings to my speaker towers, I had no regrets. They are running full range (8kHz crossover) and -1dB. I adjusted the volume by ear, but the recommendation for my speakers' sensitivity was spot on. The dual-firing tweeters add legitimacy to cymbals, any metallophone, and even improve detail on vocals!Gear used: Towers––Cerwin Vega E710Sub––Ascend Acoustics Rythmik F12DAC––Schiit Bifrost 2/64AVR––RCA STAV–3860"
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Andy Poon",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T02:07:24.000Z",
          "Titre": "The Aperion Dual Firing Air Motion…",
          "Contenu": "The Aperion Dual Firing Air Motion Super Tweeter is indeed very well made , it's high notes very refine & overall this product is definitely worth buying to enhance one's existing speaker system. Also very impressed by the very efficient Aperion sales staff for the replies on enquiries & shipping arrangements to Singapore where I received it within a week over weekend! Kudos and keep it up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Barton",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T18:09:23.000Z",
          "Titre": "Outstanding packaging and performance",
          "Contenu": "The speakers were packaged in an exceptional manner.The sound from the speakers was perfect.I was very impressed with the way the product was protected during shipping.You can save a few parts by reversing the speaker stands when converting from being placed on a carpet to being placed on a hardwood floor.Outstanding service and product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GARY DUMAS",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T02:58:26.000Z",
          "Titre": "Just received Energy 7 amp as promised…",
          "Contenu": "Just received Energy 7 amp as promised (shipping/price). Setting up system first thing in the am. Massive 75 pounds, ouch. Even more impressive is the apparent box build quality. And the speaker terminals are “manly chunks of gold plating”."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ARAM A",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T19:05:26.000Z",
          "Titre": "I've been a long time Aperion fan",
          "Contenu": "I've been a long time Aperion fan.  I have a verus grand setup and most recently added their Dual Firing AMT Super Tweeters.  I am floored by the added clarity and brightness the super tweeters bring to an already amazing sound.  Always great customer service and advice and rock solid products, couldn't ask for much more!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T00:13:03.000Z",
          "Titre": "Very pleased with my Verus setup!",
          "Contenu": "Very pleased with the level of service at Aperion Audio. They took the time to walk me through many different surround system configurations to figure out what I needed for my smaller theater room (10’ X 10’). They provided expert advice based on a solid understanding of acoustics and also what their products capabilities are. We went through several ideas and figured out a 5.2.4 layout that worked. We leveraged the A5 immersive height modules for ceiling speakers, bipole speakers for surrounds. I had some legacy Verus towers I was gifted that needed some TLC and they did a perfect repair! The center channel we used the Verus Grand V6C. After some equalization settings work, it’s dialed in. Perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose C. de Leon",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T18:10:12.000Z",
          "Titre": "Really an amazing improvement on my…",
          "Contenu": "The AMT ribbon STs are an amazing improvement on my Tannoy Ardens.  The Ardens are great just the way they are but somehow I started hearing sounds clearer and with higher definition.  More airy and expansive.   The oddest thing was that the bass was clearer and much more pleasant.  Really enjoyable piano.  I also find that the Ardens always sound better at higher volumes and with the Super-tweeters I could play them at lower volumes without the loss I had experienced."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mark, the git.",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T00:31:50.000Z",
          "Titre": "I wanted a unique product",
          "Contenu": "I wanted a unique product, and I wanted direct to seller purchase experience.I was a little put out that the price of the product dropped by circa $200 2 days after I recieved it, but I supposed that is a matter of timing."
        },
        {
          "Note": 5,
          "Lieu": "IS",
          "Pseudo": "Rich",
          "Nb_Reviews": 2,
          "Date": "2022-02-19T19:57:27.000Z",
          "Titre": "Great products meets great advice and exceptional service",
          "Contenu": "It’s been over 20 years since I contacted Aperion. That’s how good their speakers are as no news is good news. Well I recently updated my tv and needed to spruce up my sound system. Colin was really helpful, appreciated an old customer re turning and helped my upgrade with ribbon treaters and Atmos presence speakers , and they did the trick. a whole new home theater experience with my original Aperion subwoofer, and bookshelves. thanks Aperion , keep this open box specials coming"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Kass",
          "Nb_Reviews": 2,
          "Date": "2023-01-06T23:30:18.000Z",
          "Titre": "Aperion makes incredible speakers that last!",
          "Contenu": "I have owned a 5.1 set of Aperion Intimus speakers for about 14 years and they still produce incredibly fine, detailed sound. This year my old surround receiver (same age as the speakers and purchased through Aperion) gave up the ghost. Long story short, I replaced my TV, receiver, added a 3 channel amplifier for the fronts and of course had to get four height speakers for Dolby Atmos. four that, I selected two pairs of the A5 Immersive Height Modules. one word - WOW! I can't recommend Aperion enough. My old speakers continue to produce incredibly accurate sound and the new ones are just as good. If you are looking for reasonably priced but exquisite sounding speakers Aperion is the brand I will choose every time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence Kaiser",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T02:10:09.000Z",
          "Titre": "Very very satisfied!",
          "Contenu": "I recently purchased a pair of the Super Tweeters to add to my previous purchase of the Novus bookshelf speakers. The super tweeters are incredible! I can listen to that combination all day long with various music genres from jazz to blues to classical to rock. The tweeters blended  seamlessly with the Novus, but now added more high end frequencies that I was missing with the Novus only. Delivery was on time and the speakers were well packaged for the shipment. I could not be happier with my purchase from Aperion. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vn",
          "Nb_Reviews": 2,
          "Date": "2022-06-29T08:23:21.000Z",
          "Titre": "verus iii V6t grand…",
          "Contenu": "Bought a pair of verus iii V6t grand towers. They arrived within 3 days of placing the order. Easy setup and amazing looking speakers! I am driving them with a rotel 1592 mk2. Have been listening to classic rock, fusion and classical cds - love the clarity, depth and lush soundstage! I dont know if they have a burn in period, i only have 15-20 hrs. so far on them and they sound amazing! Highly recommended! Arguably the best speakers under $3K!"
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Hector Riquelme",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T06:19:06.000Z",
          "Titre": "More than I thought",
          "Contenu": "As I told you before, at the end, with the Dual Firing AMT Ribbon Super Tweeter, your support was too valuable. Now I can hear tonalities that were impossible to hear before. The extension of the highs and the breath of my speakers, and I thought that I had very good speakers (Harbeth 40.2), well, they are.Today, after several days \"tuning\" the Super Tweeters, I feel that I have fulfilled my needs over what I was expecting. Congratulations to all of you Aperion Audio Team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Hochhalter",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T19:54:28.000Z",
          "Titre": "Big sound , small footprint",
          "Contenu": "I’m very satisfied with the purchase of the Novus N5B bookshelf speakers. The packaging and shipping was exceptional. The design and finish of these speakers are very appealing. Most importantly the sound is overwhelming from a speaker of this size. I would highly recommend these to anyone looking for a passive speaker on a desktop or small room. Incredible value!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby Lindsey",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T16:02:13.000Z",
          "Titre": "Concert Grands are a home run!!",
          "Contenu": "The team at Aperion was great during the ordering process of my new Verus III Concert Grands. Fast shipping and boy are they sweet!!! Music is fantastic with proper scale, wide sound stage and great imaging, and movies are like being at the theater, only better as you are in your own home!!! A big speaker with a huge sound! (Don’t need a sub IMO) but equally great if you want to listen to music at low volume while taking a nap as they don’t need to be cranked to sound good which is important to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George N",
          "Nb_Reviews": 4,
          "Date": "2023-04-26T17:33:21.000Z",
          "Titre": "Aperion:  Great Quality at a Reasonable Price",
          "Contenu": "The A5 immersive speakers are wonderful!  We now have Atmos surround sound without having to cut holes in our ceiling!  Also, the Bravus II 12-inch Subwoofer really adds quality to our movie watching.  It really is like being in the theater!  The best thing about Aperion is their customer service.  I called to ask how they would integrate this big subwoofer with our older speakers and they answered every question .  They really wanted to help us get the best sound out of our system.  Aperion speakers are the only ones we'll buy.  Great quality and a reasonable price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GlenW",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T19:47:42.000Z",
          "Titre": "Great Bluetooth wireless system",
          "Contenu": "Our old Bose speaker gave up the ghost so I jumped on the chance to bring in a set of the Allaire Bluetooth speakers to hear them for myself.  I have been following Aperion for a while and reading their equipment reviews. This speaker set sounds so great with room filling volume and excellent low level listening. Paired it with a subwoofer for that just-right amount of low frequency oomph."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T01:01:06.000Z",
          "Titre": "Very happy customer",
          "Contenu": "Sir,Last month one of my aluminum super tweeters became inoperative and I emailed Aperion Customer Service for direction and met Dallas. I can’t believe how helpful he was and how satisfied I am. He took care of everything, was responsive and truly a credit to your company. I am seriously considering another pair of Super Tweeters to complete my system and will certainly visit Aperion again. Thanks, Tom"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JEFF SMITH",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T20:27:29.000Z",
          "Titre": "I purchased on wall novus series…",
          "Contenu": "I purchased on wall novus series speakers recently.  The cabinets are a beautiful white and finish is amazing.  They are connected as lcr in a small theater setup.  Sound is even better than they look!  Absolutely awesome purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GARY DUMAS",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T19:03:20.000Z",
          "Titre": "Called to discuss a credit for a…",
          "Contenu": "Called to discuss a credit for a returned item. Phone call was immediately answered (Collin) and resolved in a friendly but professional manner. Within minutes our account was credited accordingly.Some of best customer service every time I reach out to Aperion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EDWARD CANNING",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T22:31:36.000Z",
          "Titre": "The Verus V6C center channel speaker so…",
          "Contenu": "The Verus V6C center channel speaker so far has exceeded my expectations. I am very pleased with the overall performance of the speaker and the build quality seems very high. Even the packaging was premium."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Moore",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T22:17:37.000Z",
          "Titre": "Great People.",
          "Contenu": "Great People.Easy to work with.Best speakers I have had so far.And I'm an audiophile for sure into Wharfedale,Kef, paradigm, Bowers.None touching these so far. I'm Good!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Brewer",
          "Nb_Reviews": 1,
          "Date": "2022-02-12T19:50:07.000Z",
          "Titre": "My Bravus II 10D sub started making a…",
          "Contenu": "My Bravus II 10D sub started making a popping noise every so often. This purchase was to pay for the shipping of the new amplifier to replace in my recent Bravus II 10D purchase. It works better now, but still pops 30 minutes after the last audio has been played. Before it popped every 30 minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terrence",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T01:07:20.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. They answered all my questions about the speakers and install options. Even though I ordered some of the least expensive speakers Aperion sells, they still sound fantastic, and are probably 10x better than the builder grade, in-wall speakers I replaced."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rita",
          "Nb_Reviews": 2,
          "Date": "2023-01-21T00:47:33.000Z",
          "Titre": "Exceptional Customer Service",
          "Contenu": "The Customer Service has been exceptional. The product packaging is some of the best i have ever seen and i am really impressed. I did get one damaged Subwoofer which was clearly the fault of the transportation company (I'm guessing they dropped it on its head) but Dallas and the team were very responsive in getting a replacement sent out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wil Escamilla",
          "Nb_Reviews": 2,
          "Date": "2022-08-30T21:42:20.000Z",
          "Titre": "AMAZING Aperion 🤙🏼💪🏼🤙🏼",
          "Contenu": "Aperion Audio has AMAZING Customer Service, they are always thoughtful, honor their word by following thru on what is said either on the phone or what you see online!! Go with Aperion & you will ALWAYS have a smile! 🤙🏼✌🏼🤙🏼"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "roger mitterling",
          "Nb_Reviews": 2,
          "Date": "2022-10-20T21:27:50.000Z",
          "Titre": "Aperion A5",
          "Contenu": "I received the A5 immersive height speakers two days after ordering. Packaging was great and the speakers fit and finish is beautiful. I chose the matte white ones. I have them on top of my RSL speakers and I'm amazed at the effects when I play a movie that features Dolby Atmos. My room is 18X12 and they are a perfect fit. I'm extremely happy with my first Aperion experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T04:17:10.000Z",
          "Titre": "15 years of Aperion",
          "Contenu": "I’ve been an Aperion customer for 15 years.  I love being in on the secret that these speakers are phenomenal.  Also, the customer service is truly committed to ensuring a world class experience.  Don’t buy these speakers, you aren’t worthy.  Kidding, do it.  Now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manuel Perez",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T20:23:09.000Z",
          "Titre": "\"customer service was Excellent in…",
          "Contenu": "\"customer service was Excellent in providing information and also for helping with ordering my remote that was missing for my speaker pair. he followed up on checking back with me which also gave me sense of being part of The aperionaudio Family. He Even welcomed me To The Family!!! I'm Very satisfied with The my Pair of Allaire Bluetooth speakers.\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T22:32:04.000Z",
          "Titre": "Best experience with a product in such…",
          "Contenu": "Best experience with a product in such a long time. Aperion are definitely a top-notch company with top notch people working there. I really appreciate their help and solution they have offered me when buying from them. Their products speak for themselves, heavenly sounds dropping from the sky."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Sundstrom",
          "Nb_Reviews": 3,
          "Date": "2023-07-28T19:25:32.000Z",
          "Titre": "Small company with big sound expertise",
          "Contenu": "Aperion has the vibe of a small company dedicated to their mission. In this case, quality speakers. I had never dealt with them, and had a question about a product that I emailed. I got a prompt and thorough reply, and a follow-up phone call to make sure my question was answered. It was, and the super tweeters I subsequently purchased sound great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Marshall",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T21:17:55.000Z",
          "Titre": "Just ordered Aperions \"height\"…",
          "Contenu": "Just ordered Aperions \"height\" speakers.  Nice addition to my Aperion system!  I first discovered this company after researching speakers to upgrade my system.  Aperion was a very highly rated brand.  Come to find out it was direct-to-consumer only.  No middle men.  With that, you get very high quality speakers at 30-40% the cost of similar competition.  The workmanship of these speakers is second to none.  All of my speakers have the cherry finish and are stunning.  Aperion manufactures top end speakers, well designed, well constructed and excellent sounding, at an affordable price.  Aperion is definitely an American success story!  Do business with them.  You'll be happy about your decision!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lanny Dalton",
          "Nb_Reviews": 4,
          "Date": "2023-01-03T20:58:58.000Z",
          "Titre": "Ordered products and decided to return…",
          "Contenu": "Ordered products and decided to return them. Products were exceptional, I was just in a financial bind and needed funds.Customer service was great and I promptly received refunds with no issues.I very highly recommend this company to any potential customers. A+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Smerkes",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T08:12:55.000Z",
          "Titre": "Professional in the manner in which…",
          "Contenu": "Professional in the manner in which they addressed my questions. Immediate response with a solution and not bla bla bla. Their speakers are awesome, their response team excellent and iust all around good people. If other companies would model their customer service as Aperion Audio life would be gand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Lee",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T00:14:59.000Z",
          "Titre": "Great system and customer service",
          "Contenu": "I ordered a Novus system in early June. The center channel was on back-order until late July or early August however the Aperion team located one at an Amazon facility and had it shipped to me within 2 days of receiving the rest of the order. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monte Zent",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T15:41:24.000Z",
          "Titre": "Very happy with the 10\" subwoofer",
          "Contenu": "Very happy with the 10\" subwoofer, center speaker and front bookshelf speakers.  I will be purchasing 2 more bookshelf speakers in the near future to complete my 5.1 experience.  I initially had a set up problem with my subwoofer and Dallas from Aperion support was very helpful to resolve and help desk wait was not too long."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Art Waga",
          "Nb_Reviews": 2,
          "Date": "2022-10-04T02:47:29.000Z",
          "Titre": "The Verus lll Concert I purchased were…",
          "Contenu": "The Verus lll Concert I purchased were so beautiful and sounded amazing just as I expected. The promised delivery was on time. The customer service was more than awesome when I had to replace one of the speaker grills. I will highly recommend this product to my friends and family."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "James Pelton",
          "Nb_Reviews": 2,
          "Date": "2022-03-16T18:45:53.000Z",
          "Titre": "I bought the middle level super…",
          "Contenu": "I bought the middle level super tweeter. It was delivered ahead of schedule in fine shape. It works as promised and I am very pleased with its influence on the sound of my Bryston Mini-T's in my living room (which is not a dedicated listening room). The speakers are small (as in tiny) but quite beautiful to look at. My only complaint is with the damn fees at the border but that is the fault of the government of Canada. In the course of this purchase I had two conversations with the folks at Aperion and they were knowledgeable polite and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T11:34:48.000Z",
          "Titre": "Great improvement in my old speaker",
          "Contenu": "It is significantly improve my old speaker sound stage and depth. I final feel 14khz -2dB feeling most in harmonic. The 8-14kHz also useful when the sound quality / source is poor. When setted the Tweeter back to the wall in 14kHz 0dB, the depth seems great improve."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Calvin E. Lawrence",
          "Nb_Reviews": 3,
          "Date": "2023-05-03T20:23:19.000Z",
          "Titre": "Excellent Service…",
          "Contenu": "As always if I had any questions or issues, all I have to do is call, and I get a person and not a recording.  Aperion is always quick with shipping out my orders.  Great company with excellent customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason O'Donnell",
          "Nb_Reviews": 3,
          "Date": "2022-01-13T14:59:08.000Z",
          "Titre": "Went from a 5.1 system to a 7.1 system…",
          "Contenu": "Went from a 5.1 system to a 7.1 system with this purchase. As with the other purchases the items were delivered quickly and in perfect condition. Once out of the boxes they sounded amazing as I would expect from Aperion Audio. You cannot get a better quality or customer service than what they offer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2022-04-15T15:27:08.000Z",
          "Titre": "I’ve had my intimus speakers going on…",
          "Contenu": "I’ve had my intimus speakers going on 15 years now, and they still deliver a solid experience every time. Every now and then I think about upgrading, but then I crank up the volume on a well produced album and I’m happy. Well done Aperion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rowdy C.",
          "Nb_Reviews": 2,
          "Date": "2022-10-05T03:29:13.000Z",
          "Titre": "Great customer service:)",
          "Contenu": "When I came to set up my stereo after being out of my home for a year, I needed to replace a lost power cord for my Bravus subwoofer.  I couldn't locate one locally and called Aperion's customer service.  It was in the mail to me the same day and I happily got up and running in no time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Ballew",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T20:28:19.501Z",
          "Titre": "Excellent build quality, sound, and customer service.",
          "Contenu": "Excellent build quality and sound, plus outstanding customer service.  I bought a pair of Verus Grand Towers used, but when I wanted help and accessories, that was a non-issue.  Instead, they literally said \"welcome to the Aperion family, how can we help.\""
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Spyros Argyropoulos",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T07:10:40.000Z",
          "Titre": "Excellent service !!",
          "Contenu": "Excellent service !!Central speaker delivered to Greece in perfect condition .Will write an other review after testing it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean Gustafson",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T07:06:24.000Z",
          "Titre": "Great service and products!!",
          "Contenu": "I purchased speakers in-person at the Wilsonville HQ.  Dallas was super-helpful in getting me the Verus III Concert Tower speakers.  The speakers look and sound great!  I’m very happy with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Lamp",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T20:45:18.000Z",
          "Titre": "Great service before purchase to get…",
          "Contenu": "Great service before purchase to get the surrounds with white grills before that option was even listed on the site. Everything arrived incredibly well packaged, including documents, literal white gloves for handling, and very thoughtful and well-packaged. Just getting the system set up, but so far very impressed with the sound, especially the Verus center channel."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T00:46:03.000Z",
          "Titre": "Amazing service and awesome products",
          "Contenu": "Amazing service and awesome products! I love my speakers and the connection with this great group of people at Aperion. They have so much energy and love for their products and after a month of ownership I couldn't agree with their enthusiasm more. I will definitely be buying more stuff from them in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon Simons",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T05:20:32.000Z",
          "Titre": "Collin is an awesome associate",
          "Contenu": "Collin is an awesome associate. His customer skill set is beyond reproach. It is refreshing to be treated as well as I was by this young man. I would recommend Aperion Audio to all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Talis Abolins",
          "Nb_Reviews": 2,
          "Date": "2022-06-15T00:40:57.000Z",
          "Titre": "Ears to Aperion",
          "Contenu": "I've been using Aperion Audio to power my music and theatre for over 20 years.  Recently, I have begun to upgrade a few units -- subwoofer and center speaker.   The customer service has been great, as has product support.   Ears to Aperion!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Randy Selzer",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T23:31:45.000Z",
          "Titre": "Great Seller and Product",
          "Contenu": "Great service, fast shipping, and the AMT Ribbon Super tweeters have made a definite difference to my home theater. What surprised me is that there is not just a boost to high frequencies, but there is a noticeable refinement in the midrange and bass as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodolfo",
          "Nb_Reviews": 1,
          "Date": "2022-03-16T21:13:43.000Z",
          "Titre": "Aperion Audio MKII Planar-Ribbon Super Tweeter",
          "Contenu": "Aperion Audio delivered product quickly.Product was their MKII Super Tweeter.Added 6 of them to augment 6 Martin Logan electrostatic speakers.Product added, surprisingly, much more clarity and detail.It takes awhile to properly place and adjust them for seamless soundfield integration, but when properly placed and adjusted, the difference is an amazing improvement."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad Reed",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T18:39:35.000Z",
          "Titre": "Everything now sounds fantastic.",
          "Contenu": "The folks at Aperion were very helpful and knowledgeable, responded nimbly to my special shipping request. The speakers all arrived packed neatly and tight. Relatively simple integration with the Denon Atmos receiver. Very elegant in Black and sound fantastic. I mean WOW, great sound."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashwin CS",
          "Nb_Reviews": 3,
          "Date": "2023-08-17T14:47:02.000Z",
          "Titre": "Excellent top notched audiophile grade…",
          "Contenu": "Excellent top notched audiophile grade quality cables sold here. I definitely recommend Aperion audio cables for any home theater to any audiophiles willing to setup a robust audio system. Customer service is 5 star rated . very helpful and supportive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard",
          "Nb_Reviews": 3,
          "Date": "2022-11-16T04:37:34.000Z",
          "Titre": "Have a kick to the high end",
          "Contenu": "The customer relations staff was great during my purchase.  The tweeters were delayed a few days and I was kept fully informed during this time.  The super tweeters gave a nice airy feeling to the highs.  It’s not a hit you in the face type of sound but rather one that encompasses you.  You won’t be disappointed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Salvador Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T22:11:58.000Z",
          "Titre": "Great add on tweeter!",
          "Contenu": "After reading all the great reviews on this super tweeter, I ordered one. What a fantastic product. I have a pair of Wharfedale Lintons, the placement in my room is not ideal. This tweeter helped bring out more detail and air to my speakers. My Lintons sound great! This gives them a boost especially given my placement. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashim Parmar",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T18:58:48.000Z",
          "Titre": "Great pair of super tweeters",
          "Contenu": "Great pair of super tweeters. The crossover is well designed and performs well with dB selector switch. Perfectly crisp and sharp high frequency response."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason AKA  Channel Listening",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T02:55:34.000Z",
          "Titre": "Novus N6T by 2 Channel Listening",
          "Contenu": "First let me say the packaging is excellent and well above average compared to mainstream brands at these price levels.  The attention to safe packaging cannot be overstated - I've received $3,000 speakers where the packaging is blown to bits and unusable a second time - not the case with Aperion Audio Novus I received.Fit-N-Finish: Top marks for visual finish, design and build quality.  The N6T's are even more handsome in person.  I love the unique reflex slotted port as well as the subtle baffle slope. Bass driver quality is good, crossover parts are above average in this category.  You will not find ceramic resistors in oversees designs at this price level.  The grills are impressive as are the many fine details of a $1700 speaker. Sound: I give the N6T top marks as a dynamic, punchy and well sorted micro detail speaker for movies.  For music, the Novus are cut from the typical American sound profile, lots of hard rocking bass, extra leading edge detail for your brass and symbols, yet a little too light in the vocal department.  Think Hans Zimmer Film Scores - the Novus are up to the task with full range movie scape sound.  You will want a very strong tube amp or high quality class A/B amp that promotes midrange warmth to extract the very best from your N6T's.  *Use thick copper speaker cables, avoid silver cables, the N6T need no assistance with upper treble energy.  Aperion Audio speakers should last you many trouble free years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marvin B.",
          "Nb_Reviews": 5,
          "Date": "2022-06-28T19:28:48.000Z",
          "Titre": "Easy prompt delivery",
          "Contenu": "I had a great experience with Aperion Audio. I ordered the system four weeks ago and it arrived just in time for my vacation. The shipping was super quick and the delivery guy was awesome! He was able to put it together quickly and showed me how to use everything. I am in love with this system!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BM",
          "Nb_Reviews": 2,
          "Date": "2022-05-21T15:36:40.000Z",
          "Titre": "Guys are great with customer service",
          "Contenu": "Guys are great with customer service, always answered in a timely fashion-My third purchase with Aperion [super tweeters], nothing but positives!A+Thanks Guys-Bill M."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erica R",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T01:36:00.000Z",
          "Titre": "Aperion interconnect cables…",
          "Contenu": "Aperion interconnect cables are quality for a very reasonable price ! I will be purchasing more for my home theater system"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JN",
          "Nb_Reviews": 1,
          "Date": "2022-01-06T21:44:23.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, great sound. I had previously bought an older version of the Grand Verus center channel and the time was right to expand and replace my old tower speakers. First a representative e-mailed asking if my order was correct since I bought two different finishes for the bookshelves and towers which was great that they put care into the purchase. Then I received updates about shipping directly as well. On to the speakers. I have a 5.2.4 setup now with the recent Aperion tower and bookshelf purchase. They were packaged very nice. I'll save the boxes for moves in the future. The sound with my Denon AVR and the auto set up is very clean and nice sounding. I had a friend who is a musician with really good hearing tell me what he thought since my hearing is damaged. He agreed.Thanks to Aperion and their staff for providing such a great selection of speakers and adding in the extra care for their customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blake Mooney",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T04:25:56.000Z",
          "Titre": "Absolutely awesome",
          "Contenu": "Absolutely awesome! These speakers are incredible, some of the most balanced I have ever heard. Your customer service is also second to none, top notch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Mlnarik",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T21:12:31.000Z",
          "Titre": "The staff is very knowledgeable and…",
          "Contenu": "The staff is very knowledgeable and helpful.  The orders are processed quickly and they give frequent updates on delivery status. A very well run organization with a great product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blair Gardner",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T14:49:33.000Z",
          "Titre": "Very good experience",
          "Contenu": "Very good experience. Collin was very helpful. He showed a lot of enthusiasm as to how I mounted small black shelves on to the sides of my Acoustat 2+2's. The super tweeters fit perfectly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EL",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T16:07:37.000Z",
          "Titre": "Quality company with quality product",
          "Contenu": "I sent a drawing of my room and the staff at Aperion helped me pick the best set up.  I now have all my speakers installed and couldn't be happier.  Beautiful product.  I would recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "ADRIAN",
          "Nb_Reviews": 2,
          "Date": "2022-06-07T20:42:17.000Z",
          "Titre": "I contacted Aperion in order to buy a replacement remote control for my ALLAIRE BT speakers.",
          "Contenu": "I contacted Aperion in order to buy a replacement remote for my ALLAIRE-BT speakers, which I purchased on 2014.   Speakers are still great but the remote was having some issues (normal wear and tear, although it is very tough, the internals are not as tough, specifically the LED which stopped working and hence my speakers couldn't be used anymore; no universal remote available for these beauties, and there are no buttons to push on the speakers either).    The sale experience for the replacement remote was flawless.  I talked directly to Collin Lybarger who is always friendly and helpful, so everything worked out nicely.   Got my new remote and now I'm again enjoying these incredible speakers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg T",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T21:35:31.000Z",
          "Titre": "I ordered an opened box pair of super…",
          "Contenu": "I ordered an opened box pair of super tweeters and they are AMAZING additions to my system. Just what I was looking for to enhance the very upper register of my system. Beautiful product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Leavitt",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T22:01:09.000Z",
          "Titre": "The pre-sales answers and conversations…",
          "Contenu": "The pre-sales answers and conversations from Collin and the Aperion team were awesome!  I will do business with Aperion again soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Calvin E. Lawrence",
          "Nb_Reviews": 3,
          "Date": "2023-06-06T15:38:20.000Z",
          "Titre": "Great products with excellent customer…",
          "Contenu": "Great products with excellent customer service.  Anytime I have called, I've always spoken with a real person on the first call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis Berkman",
          "Nb_Reviews": 4,
          "Date": "2022-03-01T18:02:12.000Z",
          "Titre": "The supertweeters add just the right…",
          "Contenu": "The supertweeters add just the right amount of extension to my single driver speakers. Also they seem to clean up the bass a lot. Overall an excellent purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Pena",
          "Nb_Reviews": 2,
          "Date": "2022-02-28T20:17:05.000Z",
          "Titre": "Forever Loyal Fan of Aperion Audio -- Then and Now!!!",
          "Contenu": "I have been an early fan of Aperion Audio when I purchased their 5.1 Intimus set of speakers last 2004. Now my new Novus 6T two speaker set didn't disappoint. Aperion Audio is the Best!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Clark",
          "Nb_Reviews": 2,
          "Date": "2022-04-21T15:00:41.036Z",
          "Titre": "I've had Aperion speakers since 2007 at…",
          "Contenu": "I've had Aperion speakers since 2007 at this point. And the quality, and customer service is unlike any other  company I've ever dealt with.They have a customer for life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Kass",
          "Nb_Reviews": 2,
          "Date": "2023-03-28T01:04:47.000Z",
          "Titre": "The Aperion Verus III Speakers are breathtaking!",
          "Contenu": "I bought my first set of Aperion speakers 11 years ago. They have been wonderful speakers for that entire time. But when the Verus III V8T concert Towers reviews came out a couple years back, I started saving my pennies. I purchased the Verus Towers, Surrounds and Center channel and the 12 inch woofer. To say that it was an Epiphany in my musical listening experience would be an understatement. honestly, I have never heard imaging this detailed.  Once I got them dialed in, I was literally transported to the studio with the performers standing right in front of me singing to me. Not all recordings are made equal of course, but every recording that I’ve listened to sounds great, and the best are almost unbelievable in their clarity. While they certainly are not cheap. I can honestly say that for this price point I can’t imagine any speaker being better. I am running them through an Onkyo RZ – 950 receiver, which I am now just using as a pre/pro. As I also purchased the new E5 amplifier, and am powering the four height modules (Atmos) with the Emotiva Basx four channel amplifier. Again, absolutely stunning. Oh, and they look incredible as well. I would encourage anyone who is looking to spend a reasonable amount on speakers to look at the Aperion first before anything else. I can’t imagine wanting a different speaker in this price range. Aperion my hat is off to you! And thank you for the gift of me falling in love with music once again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MikeA",
          "Nb_Reviews": 4,
          "Date": "2023-03-03T18:38:41.000Z",
          "Titre": "I had one of my in ceiling speakers go…",
          "Contenu": "I had one of my in ceiling speakers go out on me.  It took a couple of weeks but Aperion honored their warranty and sent me a replacement speaker free of charge and shipping.  Everything is good once again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eve Gibbons",
          "Nb_Reviews": 30,
          "Date": "2022-01-05T04:08:17.000Z",
          "Titre": "Amazing stuff",
          "Contenu": "Amazing stuff, and shipping was quick and well-protected. I'm having a lot more fun with these speakers than I anticipated. And I had great expectations going in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wen-Zhen Ni",
          "Nb_Reviews": 4,
          "Date": "2022-03-26T15:08:16.000Z",
          "Titre": "I used the AMT double super tweeter",
          "Contenu": "I used the AMT double super tweeter. The first one was broken and the company was very nice to send me a brand new one. And when I listened to it with QUAD-989 electronic city speaker, it soundly very nice and it doesn't change a lot. It just feels more natural and more real and image is wider. I am very satisfied. Also, I found out when I put the AMT, I feel the base is very clear. I highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T01:06:03.000Z",
          "Titre": "Good recommendation on ceiling speaker…",
          "Contenu": "Good recommendation on ceiling speaker choice, they provided great service and even loaded in my car! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "CHAIMAE EL KHATIR",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T23:56:54.000Z",
          "Titre": "With the exception",
          "Contenu": "With the exception of a couple of glitches in the connectors, which Aperion immediately rectified (after having to return it twice) due to inadequate solder joint; Aperion sent a new cable but it was longer than my original order necessitating a second return trip back to Aperion (I originally ordered a 3-ft.length) HOWEVER, this is the only reason why I gave it 4/5-stars. Customer service is superb, really aiming to please the client. And the sound of the Silver cables coupled with my Focal Elegia's/Astell and Kearns player is very difficult to tear myself away from because of their musicality, incredible detail and stage-like imaging."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Gambhir",
          "Nb_Reviews": 2,
          "Date": "2022-08-03T00:33:47.000Z",
          "Titre": "The Aluminum Super Tweeter made a big difference in the sound!",
          "Contenu": "Customer service, Collins answered all my questions.Ordered the Aluminum Tweeter. Made a big difference in the sound. More Air :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T06:10:56.000Z",
          "Titre": "Fantastic Sound and Great customer…",
          "Contenu": "Fantastic Sound and Great customer service.  Had an issue with one of several speakers purchased and they replaced quickly and easily, no hassle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George kowalski",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T14:48:33.000Z",
          "Titre": "The planar super tweeter s",
          "Contenu": "The planar super tweeter s are great l have tinnitus and they help a great deal when I have the money I'm goin to buy the amt  thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Creath",
          "Nb_Reviews": 3,
          "Date": "2022-03-11T16:20:54.000Z",
          "Titre": "All of the Aperion Super Tweeters are…Just Exceptional Products",
          "Contenu": "All of the Aperion Super Tweeters are exceptional, completely able to be integrated in to most any system because of the roll off adjustable choices and the volume attenuation choices.  It really does not matter if you purchase the Planar Magnet design (Least Expensive) or the Full Ribbon design or even the AMT design, all of their super tweeters are beautifully designed and the cabinets are so extremely attractive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JJ Wakefield",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T00:38:34.000Z",
          "Titre": "There was a mistake on their website",
          "Contenu": "There was a mistake on their website, but they definitely made it right and have great customer service. Would buy from them again"
        }
      ]
    }
  ]
}