{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "atlys.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Ajit Kumar Patro",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T13:43:17.000Z",
          "Titre": "Unprofessional approach and misguiding information led to my visa rejection.  Lost total cost for the trip",
          "Contenu": "Applied Australia visit visa expecting this guys will scrutinise and guide to get the visa timely as they gurantee on their website but it's pathetic service, my visa got rejected due to a document that I submitted but the department claims non receipt of the same and rejected due to that deficiency. Who will be responsible  ? . No proper response or support service. Request everyone to think twice before choosing to use their service at 150% cost compared to direct application cost."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Jas Singh",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T13:13:33.000Z",
          "Titre": "I applied for a Dubai Visa",
          "Contenu": "I applied for a Dubai Visa, considering they showcased a decent looking site and fast timeframes.. but right within a few hours it showed \"REJECTED\"..now after multiple calls they say \"it's still IN PROGRESS\"..!Update - Next day I get a confirmation that for one team members the visa is approved..but for others it's still in progres..Just pathetic app and service!! DO NOT USE!"
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "HASHIR",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T11:46:08.000Z",
          "Titre": "DISAPPOINTING SERVICE",
          "Contenu": "DISAPPOINTING SERVICE. APPLIED FOR EGYPT  VISA FEW FEW DAYS  BACK. SINCE THEN NO RESPONSE. CONTACTED WATS APP AND E MAIL. NO RESPONSE"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "proma mondal",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T09:05:27.000Z",
          "Titre": "DIDNT GET VISA AS PER GURANTEED TIME",
          "Contenu": "DIDNT GET VISA IN GURANTEED TIME , MY TRAVEL TIME IS NEXT WEEK , WHAT I AM SUPPOSE TO DO. IT BEEN 24 HOURS I AM TRYING TO REACH CUSTOMER CARE, BUT CUSTOMER CARE DIDNT BOTHERED TO RESOLVE MY ISSUE. HIGHLY DISSAPOINTED"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Mallikarjunappa Channapura Shi",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T13:12:56.000Z",
          "Titre": "It was bitter and worst experience,",
          "Contenu": "It was bitter and worst experience,During my  visa  to vietnam, I paid 200usd as a penalty and waited 5 hours in immigration, no response from Atlys , even after my requestMy name is CHANNAPURASHIVANANJAPPA MALLIKARJUNAPPA,But in Visa , First time it CHANNAPURASHIVANANJAPPA MALLIKARJUNA   \" PPA\" was missing,After I applied for addition of PPA, It was added and sentBut CHA\"NN\"APURA became CHA\"NNN\"APURA, with extra 'N'"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Pradeep Atter",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T15:30:46.000Z",
          "Titre": "Close to fraud.",
          "Contenu": "They purposefully mishandled my application, entered me as female while the passport and my application explicitly stated it was male. Then on top of my 7500 INR fees they levied an extra 4500 INR correction charges (with no receipt) just to correct my e-VISA. Horrid customer support. No calling facility to any of the representatives. Extremely rude staff. They will keep you in dark regarding your application. Zero transparency."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "S A",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T15:28:30.000Z",
          "Titre": "Altys are a fraudulent company..don't…",
          "Contenu": "Altys are a fraudulent company..don't deal with them. I applied for a malaysian visa and they very unprofessionally took my info on whatsapp and applied. Made me take a selfie on post on whatsapp...complete frauds. Be careful. Then they took visa fee of Rs.3700 and said visa rejected."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Abdallah Gamal",
          "Nb_Reviews": 4,
          "Date": "2023-12-03T20:00:04.000Z",
          "Titre": "Support is very unresponsive i had an…",
          "Contenu": "Support is very unresponsive i had an issue when trying to scan my passport and they did not respond to my questions I sent them two times and no one responded at all.and the passport scanning experience is very hard."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Swati Shree",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T17:02:37.000Z",
          "Titre": "Worst experience",
          "Contenu": "Worst experience. Customer care never receives the call or calls back. No response to even mail. My tourist visa got rejected. Despite having 2 way tickets, hotel bookings and working as doctor in India I didn’t get the tourist visa to Malaysia."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Feroz Omar",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T04:19:40.000Z",
          "Titre": "Saudi visas online",
          "Contenu": "Atly’s advertised KSA (Saudi) visas online guaranteed by November 10th or your money back. I applied paid INR 29,000/= on November 8th. Today November 14th it still shows as pending approval. They promised visas by November 10th. They are not responding to my emails. Meanwhile both my wife and I went online to the KSA visa website and received our visas instantly. We are both are UAE residents with Golden Visas.."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Ash",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T04:44:42.000Z",
          "Titre": "Fraud and Unprofessional Avoid atlys Website for visa !",
          "Contenu": "First of using unprofessional words ( f****d up ) word when replying back please find the screen shot attached and Atlys Website is just run by unprofessional people and it doesn't allow you to contact them at any cost either through mail or number , even if you contact them by mail they will be selective to reply. We are supposed to travel oman due to mismanagement by them and they offered refund and which we never recived even after two month of wait . Kindly avoid the website it's fraudulent and go with other Website."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Maulik Patel",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T14:59:24.000Z",
          "Titre": "I had applied for singapore visa I paid…",
          "Contenu": "I had applied for singapore visa I paid fees and after submitting documents the app not showing visa approved or not. It was very disappointing . Also they don’t refund the money neither we can adjust as fees for another country visa and my ETA date gone."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Swati Naik",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T08:33:24.000Z",
          "Titre": "I had applied for Georgia visa  I paid…",
          "Contenu": "I had applied for Georgia visa  I paid fees  and after submitting documents  the app went on showing visa approved and one fine day they put the visa declined  after constantly writing mail  it was not taken in to account also they don’t have any contact no for customer care . It was very disappointing . Also they don’t refund the money neither we can adjust  as fees for another country visa"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Archu Sangwan",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T06:19:07.000Z",
          "Titre": "Totally unreliable company",
          "Contenu": "Totally unreliable company. Never apply for a visa through this company. I live in Australia filled the form clearly mentioned my current address is in Australia so as my contact number. They asked to pay so I did. Afterward they said my interview is in Delhi. While contacted said its was due to my Indian passport. Common when I have mentioned current address and contact number both are from Aus. You should have checked documents before forwarding them to embassy. This company just making money by forwarding your details further not checking anything so pls don’t believe their promise for a GURANTEED VISA. No one taking my call either poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "amrose pradeep",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T03:38:14.000Z",
          "Titre": "I applied for South African visa via…",
          "Contenu": "I applied for South African visa via Atlys. They were applying for evisa. After a month they come back and let me know that evisas are currently suspended. The team is ill informed and I would not recommend Atlys to anyone applying for South African Visa. Kindly use VFS.The only positive is that they refunded the money."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Mohit",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T15:40:51.000Z",
          "Titre": "Atlys",
          "Contenu": "Atlys - A luring platform for Hassle Free Visa seekers. You get to know the real deal after you pay the hefty double fees in the name of courier, service fees and what not. Several observations:Courier charges:If you've applied for visa for 2 persons, the passports can be sent in a single courier (as confirmed by their support over call), yet they charge double of the already hefty fees. While applying they will charge you for Bluedart courier fees but when scheduling pickup a different vendor with a different AWB number will visit to collect your passports.Due to discrepancy in AWB, I denied handing over my passports and made multiple attempts to reach Atlys support (wrote multiple emails, requested callback via app, reached out on instagram). I haven't got any help from either of the channels.Then I did some research and got to know that I am not the only one. I also stumbled upon this review page and noticed people with similar complain. I also noticed some positive reviews but can easily make out with the robotic names that those have been posted with a bot or someone has been paid to post positive reviews.Nevertheless, it could be a scam or it could be just a pathetic service, I am glad that I was not able to handover the passports to them because after all this I certainly cannot rely on Atlys for even getting my passports back, let alone the visa.If Atlys is indeed a genuine platform (just with poor support and operations), they would refund the fees. If I don't get a refund, it would be clear that it is a scam to fund an unethical and poorly designed start-up. One of the founders' name is Mohak Nahta (found on LinkedIn).All the fellow victims of poor service from Atlys, I suggest that a mass section lawsuit be filed against such fraudsters. If not, atleast file an FIR against them in your nearest police station."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Priyanka Pujari",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T17:10:05.000Z",
          "Titre": "Wrong visa issued",
          "Contenu": "I booked 2 visas for my family. One for Egypt and the other for UAE. I was issued the wrong visa for Egypt and I had to pay extra in Alexandria to get the correct visa. When i reached out to Atlys, they kept ignoring me. and they have still not resolved it. I do not recommend this company."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Devesh Batra",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T08:41:14.000Z",
          "Titre": "Fraud App",
          "Contenu": "Fraud App , they lie about the fact that they verify the documents before submitting it to embassy. Customer service is not reachable over email and call. Fraud company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shelly Kerner",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T23:38:06.000Z",
          "Titre": "I applied for a visa for India",
          "Contenu": "I applied for a visa for India. It took four months to get approved. When I reviewed it, I saw the dates did not match what I put on my application. The new dates had a date of expiration before I was due to arrive. Their remedy to the problem was to just apply for a new one. I will, but not through them."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "lakhan",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T10:55:41.000Z",
          "Titre": "Not responding",
          "Contenu": "Hi, I lakhan dhingra applied visa long back, getting no response from your end."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Varun",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T10:33:47.000Z",
          "Titre": "Pathetic service",
          "Contenu": "Pathetic service. I was promised a visa in 3 days - that's how they sold the deal to me. 3 weeks have passed and nothing has come thorugh. To their credit, their help email do respond promptly, however its a generic template message for most queries. After 3 weeks of waiting, I grew impatient and also worried, since I had to travel soon - I went over to the embassy and got it done myself. I informed Atlys and righfully asked for a refund. At this point, I had to expect this, they said 'no. we don't have a refund policy'. So basically the promised date and everything else on their website is bogus because there's a lovely *Terms & conditions apply clause. Great to see a new Indian founded start-up behaving this way - keep going!"
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "Mubeen Ext",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T23:01:09.000Z",
          "Titre": "Disgusting customer service",
          "Contenu": "Disgusting customer service, they offer time guarantee and when they do not meet it, decline to provide monetary relief as promised. Reaching out to their customer care via email is total waste of time as they never respond. I was tired, so gave up on attempts to get a refund for not meeting promised visa guarantee timelines."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Somnath Singh",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T02:34:55.000Z",
          "Titre": "Fraudulent scheme to take money",
          "Contenu": "I applied for hong kong visit visawith atlys which they guaranteed 100% or refund. And in one day they said its rejected you need to apply visa. So, they are just applying PAR which is free online simple form which i had already tried and rejectes then applied for visa as they suggested. When asked for refund they said we can't refund.Don't use this platform totally lying to get your money"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Aaqil ashique",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T08:23:23.000Z",
          "Titre": "Never use Atlys",
          "Contenu": "Never use Atlys. I had applied for Thailand visa seeing their advertisements and not only did they not meet the expected date. They were not able to provide the visa as well.No reason was provided and the only way to contact them is through email which is not at all helpful as they do not respond. Would only recommend this to people i hate or want to scam."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rama Chowdary",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T10:04:46.000Z",
          "Titre": "The worst team..pls don't trust",
          "Contenu": "The worst team... They won't be having contact number...every day they extend visa date. They don't even respond. End of the day ...they say visa rejected... They doesn't even respond for any damn question"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Vishal Saini",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T09:31:28.000Z",
          "Titre": "False Statement They advertising False…",
          "Contenu": "False Statement They advertising False statement. I saw Their Advertisement 100% gurantee visa for Some countries. I applied Hongkong visa they said 100% if they can’t provide give you refund. So they charge me 700rs( Visa fees )  + 300rs ( Atlys Fees ) so they charge me Rs 1000 they my visa is rejected i don’t know they applied or not but they said rejected where as Hongkong pre arrival is free they charge me 700rs which is free & as they promiss they will refund but they denied so it’s a scam kind off so beware"
        },
        {
          "Note": 1,
          "Lieu": "VN",
          "Pseudo": "Richa ahuja",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T10:43:14.000Z",
          "Titre": "No customer support. Scamming",
          "Contenu": "No customer support. There isn’t any number to contact and they don’t reply your emails. My hongkong visa was rejected and I received a mail stating that they have refunded my money but later when I checked, I realized there was no refund issued. And now when I have been trying to contact, there hasn’t been any response. Such scammers!"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Trisha Painuly",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T16:25:41.000Z",
          "Titre": "its a scam please be aware !!!!!",
          "Contenu": "its a scam please be aware !!!!!they dont reply ,doesnt have a legit contact number no way to contact them other than their auto help that doesnt work at all.please dont fall for this and try to get the evisa from legit goverment website.I have been overcharged and scammed"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tanzila Aziz",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T04:24:51.000Z",
          "Titre": "Very rude customer service despite…",
          "Contenu": "Very rude customer service despite contacting them on WhatsApp for the information about the visa. There no reply, and disconnected the call when tried to call. Not sure why they have option to contact via WhatsApp"
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Harsh Bansal",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T09:58:49.000Z",
          "Titre": "HongKong Visa",
          "Contenu": "DON'T APPLY FOR VISA FROM ATLYSI have already tried to fill out the pre-entry form for Hong Kong. However, the application was unsuccessful, so I applied to Atlys and they gave me the same answer. They are just collecting the fees. Actually, they are doing nothing and have very bad customer support."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Karan Singh",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T21:27:19.000Z",
          "Titre": "I applied for Hong Kong visa",
          "Contenu": "I applied for Hong Kong visa, after payment they started showing me 5 months time wich was 2 days only. And they stop responding to any of my queries and didn't returned my payment. Fraudsters"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bhavana",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T20:05:35.000Z",
          "Titre": "My appointment date change was not communicated properly",
          "Contenu": "My appointment date change was not communicated properly. They did send it, but as a Zendesk reply with some auto generated titles, I happened to not click on it, and missed my April 20 appointment date. I opened my atlys paperwork on April 23 since I remember choosing April 24 appointmendate.It would have been helpful if there was a message from them with subject line 'Appointment date changed'"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anoop Dinesh",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T14:22:17.000Z",
          "Titre": "disappointing experience",
          "Contenu": "I regret to share my deeply disappointing experience with Atlys Visa Processing Company, which has proven to be one of the worst services I have encountered. This company has exhibited practices that, in my opinion, raise serious concerns about its legitimacy.I initiated the process for my Malaysia visa at the end of October through Atlys. Despite successfully uploading all required documents, including my passport and tickets, and receiving initial verification and acceptance from the application, my experience quickly turned into a frustrating ordeal.Shortly after the initial processing period began, just days before the promised visa approval date, I was inexplicably asked to resubmit my passport, resulting in a 4-day extension of the approval timeline. Subsequent to this extension, I faced a severe lack of communication and follow-up from the Atlys team, prompting me to repeatedly raise tickets to seek clarification on the status of my application.To exacerbate the situation, I was informed belatedly that my visa interview had been scheduled in Chennai, a city far from my location in Hyderabad. Shockingly, the email notification regarding the interview arrived a full 2 hours after the scheduled interview time. Despite persistent efforts on my part to resolve this issue, the customer service provided was abysmal. A particular individual I reached out to assured me that my interview could be rescheduled in Hyderabad but failed to follow through on multiple occasions.As my travel date approached, and despite my pleas for expedited processing, I received an unexpected email stating that my visa had been rejected, without providing any reason for the denial. Numerous attempts to obtain an explanation were met with silence, irrelevant responses, and a general lack of responsiveness from Atlys. Even a promised callback from a representative named Arushi resulted in further frustration, as she failed to address my concerns after I provided the requested information.In conclusion, based on my harrowing experience with Atlys Visa Processing Company, I strongly advise against utilizing their services for any visa processing needs. The lack of transparency, ineffective communication, and failure to adhere to promised timelines raise serious doubts about the integrity of this company. Save yourself the stress and potential complications; opt for a more reputable and reliable visa processing service."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Ashok Gaikwad",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T16:39:11.000Z",
          "Titre": "I had given correct passport number but…",
          "Contenu": "I had given correct passport number but from your side it was wrong number on visa. I had attached passport image also, still You did nonsense mistake. I have taken this with proper redressal machinery. I do viral on social media. You are not trustworthy for a single Star. Very stupid people you have"
        },
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "Mikan Mili",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T21:36:04.000Z",
          "Titre": "They cheated us",
          "Contenu": "They cheated us, we didn't go to Vietnam and our plane tickets to Vietnam failed because of them. Namely, they took us off the flight because the visas they atlys sent us were not valid. We also had to pay for plane tickets to return to Thailand from Singapore at a significantly higher price directly at the airport. All in all, we had about 600 euros in additional costs because of them."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Rahul Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T09:13:41.000Z",
          "Titre": "Atlys is a scam for Hong Kong Visa",
          "Contenu": "Atlys is a scam. Anybody can open a company like this to scam people. For Hong Kong visa, Indians have to fill a pre-arrival form. Atlys is just doing that. If application will get rejected your money is gone because Atlys Scamster is eating out that money. Same thing happened in my case. When i filled my pre-arrival application for Hong Kong it was rejected. I noticed Atlys claims 100% guarantee for Hong Kong visa so after initial rejection i tried through Atlys and same thing happened. My application was rejected. Atlys claim that they will do 100% refund but the did not return. They started playing around with words. NEVER use Atlys for Hong Kong visa."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Natural Crafts",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T22:43:20.000Z",
          "Titre": "This company is a big scammer and fraud…",
          "Contenu": "This company is a big scammer and fraud I have applied my Turkish e-visa And submitted everything then they approved everything and I paid ,After payment they messaged me within 3-4 hours ,Your visa is rejected by officials,And when I asked the reason they didn’t tell me any reason, Then next day I applied with official website and got my visa same day ,The question is that When I have valid schenegan visa why did they reject my visa,?Then next day I got itSo Basically they don’t forward documents to embassy in many cases they just charged us the money thenSay your visa is rejected without giving any reason,Then they don’t refund any amount So basically this company is doing frauds and scams at large label,Please don’t waste your hard earned money with them Apply directly with official website or other good service providers"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Martina",
          "Nb_Reviews": 2,
          "Date": "2023-03-11T02:55:00.000Z",
          "Titre": "Do not use this app",
          "Contenu": "Do not use this app. Cheaper and easier to go straight to country’s consulate website. I have had an application in for Turkey with them for 3 weeks. App keeps pushing back processing date. Just went in to consular website and got immediately. It is a complete scam and I’ve wasted $200 US"
        },
        {
          "Note": 1,
          "Lieu": "LU",
          "Pseudo": "Sigy and Sue Minkevicius",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:31:59.000Z",
          "Titre": "What a Rip Off - wrong dates!",
          "Contenu": "I applied with my future dates of arrival for India and received my visa valid from when I applied which meant it was expired before I got to India - I wrote to Atlys and received no reply - what a rip off"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Liliana Jurewiez",
          "Nb_Reviews": 7,
          "Date": "2023-08-29T06:53:51.000Z",
          "Titre": "ATLYS made me loose $5,000 I invested…",
          "Contenu": "ATLYS made me loose $5,000 I invested for a trip to India for a retreat. Because ATLYS did NOT processe my visa right I lost all I invested in my trip and they do not want to assume any responsability for it. When i requested my visa they asked me for my traveling date and I said August 26, 2023 arriving in India on August 28. They processed my visa to expired on August 27. When I noticed it, I contacted them to correct the dates and they refused to do it saying that as long as I iniciate my traveling before the visa expiration date I would be fine. We argued back and forth many, MANY TIME about it until I gave up because could get them to make a change on the visa. Then, when I tried to board my international flight, Qatar Airways did not allow me to board it because of my visa expiring before getting to India, DO NOT USE ATLYS TO PROCESS YOUR VISA IF YOU WANT TO TRAVEL AND NOT LOSSING THOUSANTS OF DOLLARS!!!!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Devanshi",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T10:49:46.000Z",
          "Titre": "Disappointing experience",
          "Contenu": "My application was submitted one month after I’d sent in my documents with no regular updates. The application itself was such a mess that I got a call from the embassy informing me that many details were wrong and that even the documents I’d provided had not been attached. I was asked for the same documents multiple times. I missed my travel dates and had to withdraw the application so I can get my passport back. There wasn’t enough communication, the app was not updated to reflect the status. At no point was I given an explanation as to what went wrong. Overall, a disappointing experience from a company I was really excited about."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dong",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T17:31:53.000Z",
          "Titre": "I requested my visa for Argentina 4…",
          "Contenu": "I requested my visa for Argentina 4 months in advance and paid $250. The appointment at the consulate was never made and I couldn’t go on my trip. My flight was not refundable so I lost the money too. The $250 was promised to be refunded to the credit card, but I never received that either."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Sergio",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T02:07:04.000Z",
          "Titre": "Do at your own risk!",
          "Contenu": "The reason being that the estimated times are not correct I did mine over 10 day and due to the re-upload process which I used pretty much the same pictures. All the info was on there. I tried getting ahold of customer service but they weren’t able to help, also took along time to reply. I asked for a refund because my trip was that day. I had to call the Thai embassy to see if I can do upon arrival and luckily I was. Bad thing is I had to pay again from what I already had paid on the ATLYs app. Pretty disappointed but that didn’t stop from me enjoying our honeymoon!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MARIOTTIP",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T19:40:33.000Z",
          "Titre": "Horrible this time the other times I…",
          "Contenu": "Horrible this time the other times I used them they were great this particular time they charged me more money so the prices went up. Then my trip going to Medellin Colombia was April 11. They told me I wouldn’t have the visa to April 12 and try to charge me for it then they change their mind saying it would be ready. But I already got another company to do it faster so I asked for a refund they told me no sorry so I had to file a complaint against him I will never use them again. I found a much better company with no issues no hassles no problems"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T15:22:53.000Z",
          "Titre": "BEWARE! DO NOT USE!",
          "Contenu": "Do not use! I filed for an E-Visa that only takes 2-3 days. Atlys estimated my e-Visa arrival at over 30 days. When ETA day came it was still pending, no word from Atlys. I was on a strict timeline so I decided to file myself through the country's government website, they only charged me $40 and I was granted within 12 hours. Atlys charged me $251 and still shows pending. When I contacted to cancel, no longer needing their services they refuse to cancel and refuse to refund. They also tried to tell me additional medical insurance was required to travel, which was very much a lie, and wanted to charge me another $200 for it. Very unprofessional, very greedy, and very unreliable. If you are a worldly traveler and appreciate efficiency, results, and an equal exchange for money given then DO NOT USE THIS COMPANY!"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T00:15:20.000Z",
          "Titre": "To give people what they paid for, in, this case did you happen.",
          "Contenu": "Every time I think about this and losing so much money on my flight, by having to cancel it because of no visa. It makes me sick. I warn everyone to run away from this company. Even if you do not get your visa, they will not make it or, try to make it right.    They do not issue refunds. No responsibility for its actions. Just another scammer company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Middlebrook",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T12:12:51.000Z",
          "Titre": "Run don’t Walk!",
          "Contenu": "I paid to have a Vietnam Visa completed for myself and my partner. The fees were $70. We had an expected date of delivery of January 2, 2023. We were flying into Vietnam on January 4, 2023. The government website showed a 2-3 day turnaround and we completed all requirements 11 days in advance. They failed to contact us, never provided the service, admitted to their failure claiming they take longer now, and agreed to refund the amount. But they never refunded the amount. Worse yet, we were then required to $498 to get a 2 -hour emergency turnaround time with a reputable company which obtained the Visas in 90 minutes. I’ve had to file a dispute with my credit card company. Absolutely awful company, customer service and simply fabricates its products and ability to help you. To top it off they lie about attempts, status, processes and refunds. Run, don’t walk away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LaMantis",
          "Nb_Reviews": 4,
          "Date": "2023-06-26T17:22:24.000Z",
          "Titre": "If i could give 0 stars I will",
          "Contenu": "If i could give 0 stars I will. I applied for a visa through Atlys thinking on giving it a chance , biggest mistake ever! I paid the requested feed for a service no provided. 🤦🏽‍♀️Their customer service is NONEXISTENT. After sending 10 email request and opening 9 tickets I got a single reply with a receipt of payment to the Argentinian consulate , then I was told it was my visa , however , being a Spanish speaking person I noticed the same receipt stated it was not a visa document , it did not secure entry to argentina 🙄Im about to cancel my trip thanks to Atlys ! However I will make sure to call my CC and let them Know these company scammed me so I can get my money back. Supposedly my visa was approved what makes me question the veracity of Atlys , what is the problem on sending the visa documentation if it was truly approved?Please !!! Dont let them Full you by their reviews online this company is basically a fraud!!!!THEY TRULY ARE SCAMMING PEOPLE..PLEASE DO  NOT USE THEIR SERVICE .. you will regret it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Liliana Jurewiez",
          "Nb_Reviews": 7,
          "Date": "2023-08-09T04:12:34.000Z",
          "Titre": "BAD SERVICE!",
          "Contenu": "I applied for Visa to India saying that i was traveling on August 26, 2023. The Visa i got with Atlys help expires on August 27, 2023 therefore if i do not travel on August 27,2023 I cannot travel to India. Atlys WILL NOT assume any responsibility if for any reason, including weather cancelation, they are simply telling me that I WILL NOT be able to travel to India. If Atlys knew its business, they should know that eventualities happen and that the Visa the help to get should have the traveling date in the middle of its validity to give the passengers peace of mind. I WILL NOT RECOMMEND Processing A VISA WITH ATLYS. I would recommend to process it yourself or with a different agency. Seriously, Atlys and I wrote back and forth extensively and got nowhere with them. Now i am at the mercy of AA not to cancel my departure flight on August 27, 2023. American Airlines is notorious for canceling flight with any reason they can come up with. They canceled my first flight this past January and I had to travel the next day after expending hours to rebook my trip."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "manik reddy",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T13:48:30.000Z",
          "Titre": "Fraud....They take your fee and…",
          "Contenu": "Fraud....They take your fee and flee...no contact info nor they reply to emails. Waste of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ishraq",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T18:03:47.000Z",
          "Titre": "I bought a visa and the day of the…",
          "Contenu": "I bought a visa and the day of the traveling I select, and they select different day for me and ask them to refund my money back or to reapply to select the right day it  the traveling day and they couldn’t help me at all. I got so mad  from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "eshfaq",
          "Nb_Reviews": 3,
          "Date": "2023-04-10T19:53:40.000Z",
          "Titre": "The website is corrupted",
          "Contenu": "The website is corrupted. Entering the phone number has become impossible, to ooen up an account. What type of idiot designed this website? It doesn't work!!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Seerat Saini",
          "Nb_Reviews": 3,
          "Date": "2023-02-04T09:04:44.000Z",
          "Titre": "This company is a con",
          "Contenu": "This company is a con, they issued us a visa to dubai which was wrong, we have contacted them multiple times and they do not reply. Please don’t waste your money. It’s a shame, such a reputable company behaving so badly."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "andyli",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T09:14:13.000Z",
          "Titre": "Don't use scammers",
          "Contenu": "Don't use applied for an Egyptian visa problems uploading documents then no  answer on visa when date had passed I then contacted atlys and was informed my visa had been rejected I asked for proof of application and received a fake looking email back had to travel to Egypt an apply for visa at the airport . Be aware they take all fees upfront and will not refund anything"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Ppriyal Lokhandvwala",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T13:00:03.000Z",
          "Titre": "Its a fraud website",
          "Contenu": "Its a fraud website. No proof of application given and no proper rejection reason mentioned in the mail. They dont even have a customer care number"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Igwilo Chinedu",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T12:00:26.000Z",
          "Titre": "Atlys.com is a very well organised scam…",
          "Contenu": "Atlys.com is a very well organised scam site/app they scammed men $250 just for an ordinary Tanzania e visa….they have no phone contacts 🚩 and they would make you look so stupid!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bokani",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T17:16:51.000Z",
          "Titre": "I wanted help with processing my…",
          "Contenu": "I wanted help with processing my sister’s visa to Dubai and they did nothing but send back a refund with no assistance and $10 short. I am very annoyed by this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pastor  Herrera-Rill",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T23:37:32.000Z",
          "Titre": "Visa didn’t work, refund was refused.Would not recommend",
          "Contenu": "Visa didn’t work, had to pay for a Cisa on arrival anyway and you refused to give me a refund. I would not recommend your services to anyone."
        },
        {
          "Note": 1,
          "Lieu": "KE",
          "Pseudo": "nancy chege",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T20:12:13.000Z",
          "Titre": "This guys are a scam please do not try…",
          "Contenu": "This guys are a scam please do not try them they are dishonest and untrustworthy not to mention thieves the took my money and did not process my dubai visa they have completely refused to refund it this kind of sites should be shut down"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "smitha",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T10:16:22.000Z",
          "Titre": "FRAUD their guarantee means nothing",
          "Contenu": "i have applied for srilanka ETA through atlys as it has given a guarantee fo give ETA by next day 10:45 am I was travelling next day evening but its 1:40 pm so fat i did not get anything and not even a reply to my emails I am soo worried and helpless"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Gustav",
          "Nb_Reviews": 2,
          "Date": "2023-06-18T12:09:15.000Z",
          "Titre": "They did nothing other than take my…",
          "Contenu": "They did nothing other than take my money.  I ended up having to do all my own work.  I see no value in this website.  You can ask for help and wait a week to hear from someone via email.  I am not sure what they do.  I really do not know what they do other than create a document that is of no real value for $250 plus other fees."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LaMantis",
          "Nb_Reviews": 4,
          "Date": "2023-06-30T20:39:51.000Z",
          "Titre": "THIS COMPANY IS BAD, BAD , IS A FRAUD",
          "Contenu": "DO NOT TRUST THIS COMPANY. Sadly IT IS A SCAM, PLEASE DO NOT FALL FOR IT...They advertise what they can not give.!! I have the proof to prove it...please do not fall for them!! CHECK OUT THEIR CANCELLATION POLICY !!!They assure you a date of completion and when the visa is supposedly approved there is no visa document emailed to you because, in fact, they can't get any visa approved...look at all the bad reviews!!! I am pretty sure they are posting good reviews to get people to use their service This company is a true scam!!! I lost my money with them plus the hotel, and airfare money as well. All I have received from their support team has been the same thing: There is a problem at the Argentinian embassy that is out of our hands and we can't do anything, however, I called the Argentina Embassy and was clarified there is NOT ISSUE on their end, and the application request was not submitted under my name by any company. An honest company will refund your money if the issue was they could not provide the service offered if there was a problem on their end.DO NOT USE THIS APP OR THEIR COMPANY..you will regret it.. unfortunately...is a scam!!!"
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Khaled Nasr Hussein",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T09:30:18.000Z",
          "Titre": "Atlys: A new way for anything except getting a visa.",
          "Contenu": "Case: Egyptian, tourist visa to Dubai. Summary: Extremely bad experience, poor customer service, poor case handling, poor communication, poor transparency. Decision: NOT RECOMMENDED. USE TRADITIONAL TRAVEL AGENCY SERVICES DETAILED CASE: It was my first time (and last time) to use Atlys. I wanted to issue a tourist visa to Dubai. One of the fastest and easiest visas to get. I already traveled to Dubai more than 5 times and I was resident in Sweden for for 4 years. Atlys did not got me the visa for Dubai. I hoped that this was the end of the story. I could not get another visa to Dubai after Atlys apologized for not getting the visa because simply they was holding my application while Dubai relevant authority rejected to issue another visa while Atlys application is still open. I contacted Atlys customer service everyday for more than one week in order to withdraw my application. Every time they reply very late and they state that they already refunded me the money (only 90% of my money). The customer service is horrible and unreliable. They don’t have an option to withdraw your application and they don’t have responsive customer service system. Simply, they are careless about your time and your schedule. All my plans to travel was vanished in no time. If you are from a developing country, I don’t recommend their service because simply you will not be able to recover your intangible resources like time and effort."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chang",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T22:44:59.000Z",
          "Titre": "Minimum to no communication during a…",
          "Contenu": "Minimum to no communication during a stressful application. Customer service was truly disappointing for a service that is so crucial to your customers both financially and personally. Will likely not be returning to Atlys. At this point a DIY visa application would've been a less stressful and much better overall experience."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Mausam Singh",
          "Nb_Reviews": 3,
          "Date": "2023-03-10T15:18:04.000Z",
          "Titre": "Horrible Experience, Never trust them",
          "Contenu": "Dear Atlys.com,I am writing to express my disappointment and frustration with the visa assistance services that you provided to me and my family. We had requested for 4 evisa to travel to Egypt from India for my parent and younger sister, and were promised that after payment confirmation and document collection, the visas would be provided to us within a week.Unfortunately, we were informed that only 2 visas were approved and 2 were declined. Despite this, we requested that the approved visas be provided to us so that my mother and sister could still travel. However, we never received the approved visas as promised.We also requested authorized documentation for the rejection of the other two visa requests for me and my father so that we could understand the reasons for the rejection. However, our requests were ignored and we were not provided with any explanation for the visa rejections.Furthermore, we were deeply disappointed and frustrated by your refusal to refund our payment. We did not receive the services that we paid for, and as a result, we lost all of our money.I believe that your company should respect the time and money of your customers and should fulfill your promises. Unfortunately, your lack of transparency and failure to provide us with the services we paid for has left us feeling cheated and disappointed.I urge you to take immediate action to rectify this situation and provide us with either the approved visas or a full refund of our payment. Your company should also work to ensure that this type of situation does not happen to other customers in the future.Thank you for your attention to this matter.Sincerely,Customer"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T00:04:46.000Z",
          "Titre": "You put my  picture on Cameron DeWolf's…",
          "Contenu": "You put my  picture on Cameron DeWolf's  visa and told me I had to pay again, then would not give me my money back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "pardeep singh",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T14:03:48.000Z",
          "Titre": "Garbage website do not use it .no…",
          "Contenu": "Garbage website do not use it .no refund they will take ur money"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Umarfaruk saleh",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T17:07:33.000Z",
          "Titre": "Not happy with atlys I’m holding 5…",
          "Contenu": "Not happy with atlys I’m holding 5 years membership also but atlys team was not helpful…. Don’t west time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Travis M",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T03:23:28.000Z",
          "Titre": "Scammed out of $49!",
          "Contenu": "I was having trouble paying on the Vietnam e-visa site (they did not accept my card, not sure why) so I decided to use Atlys.  They advertised themselves on their website as a wonderful alternative for those having payment issues with the official website. Note that this was 8 business days (1.5 weeks) before my trip to Vietnam, so I anticipated no issues given the 3 business day estimate provided by Atlys.And my payment did go through immediately - but that is where the good experience stopped. The ETA for the visa was originally 3 business days kept getting pushed back and back and then eventually became completely blank.  I reached out to the Atlys representative to help clarify  when I could expect my visa -  they were no help at all, just telling me it was in process and I should wait.Realizing that I could not rely on Atlys, I applied for the visa myself using a friend's card.  I am glad I did so as the visa came in a timely fashion, allowing me to go on my trip.  When the visa from the official website came, Atlys still had no visa or ETA, so I requested a refund. Atlys refused to provide any refund since my visa was \"submitted and in process\". I am so glad I applied for my visa on my own, because Atlys did not get back to me with my Vietnam visa until several days into my trip to Vietnam.  If I had relied on Atlys I would have had to cancel my trip.  Atlys' processing time was approximately 2 weeks at a cost of $49, compared to their initial estimate of 3 business days and the time it took when applying manually for only $25 (1 business day to get a response requesting a higher-quality image, then 3 business days to get the visa).I would not recommend Atlys - they are not a reliable way to get a visa to a country like Vietnam.  Instead they will take your money and refuse to provide a visa by the start of the trip or a refund, leading to a lot of stress and headache.  The ETAs they provide are not meaningful.EDIT: The reply from Atlys is also incorrect.  They claim the visa was \"issued a week before your travel date\". This is incorrect.  My flight to Vietnam was scheduled for May 19th, which I clearly communicated when requesting the visa.  I had  numerous nonrefundable flights, tours, etc. planned immediately after that date.  The visa they provided shows a \"valid from\" date of May 22nd, which is when it was approved (visas are not allowed to extend into the past). So it was in fact AFTER my date of travel to Vietnam, not before.   On a side note, Atlys promised several times to email me when my visa was ready, which they never did (making it more difficult to nail down a precise date and time when my visa became ready).  The only notification was a push notification in the app."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shadi",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T06:03:41.000Z",
          "Titre": "Booked an appointment on your website…",
          "Contenu": "Booked an appointment on your website but never got the confirmation from the embassy and never sat for the interview!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T17:27:49.000Z",
          "Titre": "There were a lot of missing documents…",
          "Contenu": "There were a lot of missing documents from the list like important documents."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stevie Webber",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T17:51:21.000Z",
          "Titre": "i didn't purchase any service from you…",
          "Contenu": "i didn't purchase any service from you people ever in my life."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gurtaj",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T19:46:33.000Z",
          "Titre": "I haven’t got answers for a single…",
          "Contenu": "I haven’t got answers for a single question and I think I wasted my money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elisa",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T19:53:02.000Z",
          "Titre": "Pretty early on application. Still needs maturing and testing",
          "Contenu": "Support not the most supportive and their application is clonky"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Subba",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T17:44:50.000Z",
          "Titre": "Interview schedule never happened",
          "Contenu": "Interview schedule never happened . Paid twice"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anushika",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T18:47:50.000Z",
          "Titre": "I have not got my visa yet",
          "Contenu": "I have not got my visa yet. I have applied 15 days back for egypt visa."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Akintunde",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T17:13:26.000Z",
          "Titre": "Really poor experience",
          "Contenu": "Really poor experience, communication was not efficient"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Hitesh Vyas",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T08:04:14.000Z",
          "Titre": "This company is not good customer…",
          "Contenu": "This company is not good customer support because I will apply my Albania tourist visa and my visa is approved but this company send me Albania application form he not send my Albania tourist visa copy and there no any customer care contact number so how can talk any customer care person this my problem is not solve till now .This is not good response"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GF",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T20:59:50.000Z",
          "Titre": "Slow to answer——when you need them!",
          "Contenu": "We were in our appt for our visa and they looked at our insurance coverage. However, Atlys only has my husbands name on it and my name was not there even if both of us bought the insurance. This caused the consul to tell us to buy additional insurance for me. We tried to email and call Atlys so they could send the COPY of the medical insurance we bought with my name on it. However, THERE WAS NO RESPONSE!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Faruk Cercer & Leman Cercer",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T20:54:10.000Z",
          "Titre": "You could not get an appointment for us…",
          "Contenu": "You could not get an appointment for us from the Italian Consulate for about 6 months. And despite the delay, you didn't even inform me before I asked you.Faruk Cercer"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LISA T",
          "Nb_Reviews": 4,
          "Date": "2023-05-12T16:58:25.000Z",
          "Titre": "Great UIX, but error checking flaws led to VISA problems",
          "Contenu": "On the face of it, Atlys is a superb app, with a wizard AI to guide you through the VISA process required for many countries. The problem is the app never echos back to you what VISA form fields your answers were used to fill in. The Wizard asked for a Departure Date and that date was used to fill in \"Date of arrival in India\". (I have multiple flights, multiple countries.) I never saw the values I submitted until the VISA was approved days later. Therefore neither the user [nor the software apparently]  can catch a date error. In the worst case, like mine, my VISA was approved with the wrong entry dates, an error I would certainly have caught had I been able to see how my input values were interpreted by the app.The VISA approved actually expired before I arrived in India. So big deal, you say, cancel the VISA and reapply? For India at least, you cannot cancel a current active VISA (easily, if at all).  That may pose travel problems for you as a person cannot re-apply for an Indian E-VISA until 10 days before the current (for my case, useless) VISA expires. At that time I will be in a primitive portion of the world without electricity. Result: I am having to pay someone to file my VISA information on time for me, even while I paid for a VISA I cannot use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alena",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T23:34:49.000Z",
          "Titre": "I've rejected by the France consult",
          "Contenu": "I've rejected by the France consult, seems like something was wrong with paper that I received from Atlys"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ALEX SHALL",
          "Nb_Reviews": 4,
          "Date": "2023-04-19T04:53:26.000Z",
          "Titre": "No reply on email",
          "Contenu": "No reply on email. Had to wait long time. Not a good response on issues"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Saurabh Dugar",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T11:01:51.000Z",
          "Titre": "expected a more tech enabled and customer friendly platform",
          "Contenu": "they can do better on customer service and their help line which didn't pick up my all nor called me back so was a stressful experience despite getting my visas after a slight delay. Special mention to vfs global's helpline and email support who responded almost immediately with the e-visa copies when I was unable to connect with the atlys team. Received the copies as well from atlys shortly thereafter."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Raghuram Trikutam",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T08:19:29.000Z",
          "Titre": "Hit and miss",
          "Contenu": "First up, our Cambodian visa came through without much hassle. However, our Malaysian visa got rejected. When I insisted on the scans of the passport uploaded, I realized that they uploaded those which I provided by taking a photo on their app. Those scans would never have made it through (you needn't even ask any other agent about it). I would have expected them to atleast prompt us about the same or reject at their end (they claim to perform a few \"quality checks\" before the application goes to authorities\"). That clearly wasn't done and sadly, we are now sitting with a nice rejection and a lot of dollars spent on this.Very rookie yet. Can't comment for other countries. But I'd be wary of using them again unless I perform all checks at my end (which kind of kills the purpose of having an app like Atlys). And yeah, btw as mentioned by someone else here, no refunds either for such mistakes."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Ganesh",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T16:18:44.000Z",
          "Titre": "If visa is getting delayed it is very…",
          "Contenu": "If visa is getting delayed it is very difficult to contact anyone in Atlys and get an update"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Narayanrao",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T10:12:35.000Z",
          "Titre": "good job by Haja Meeran",
          "Contenu": "Used Atlys for the first time. Applied for singapore visa. Got it one day after their promising date. But Haja Meeran, who handled my visa application at the last leg, was very helpful. His approach, follow up really fantastic."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "shraddha kamble",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T09:07:33.000Z",
          "Titre": "I have applied for Vietnam visa 1 week…",
          "Contenu": "I have applied for Vietnam visa. Initially, they gave ETA of 1 week and got changed for another week.  However, they replied via email and expedited the procedures. I got my visa before given time. The services are good but customer service should be available over the phone. Overall great app and services! Thanks Atlys."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Sneha",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T13:28:59.000Z",
          "Titre": "Very smooth process for Visa",
          "Contenu": "Applying for the visa via Atlys is really easy and the process is smooth, They helped me with the documents for visa review as well. Got my visa approved before time.I did have some trouble with the Web app but the Phone app works fine, they need to improve the app user experience"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Mohamed Rafik",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T04:00:36.000Z",
          "Titre": "Peace of mind",
          "Contenu": "Recently I applied visas for my family to Malaysia through Altys. They've provided a lot of detail on Malaysian visas for first-time visitors than any other platforms as far as I know. Hence, I applied through them. Their website was easy to use. They promised 8 / 9 days processing time and they delivered on time. The great part is that you can communicate regarding all your queries, issues, status follow-up, etc. through their WhatsApp number, they are great at responding to them, which will give you a lot of peace. I recommend Altys."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Akram Khan",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T15:23:26.000Z",
          "Titre": "I used Atlys for my visa to Thailand…",
          "Contenu": "I used Atlys for my visa to Thailand and it arrived in a few days. The process was smooth but I was a bit uneasy without a clear way to communicate with a support team. I'd suggest this app for its speed, but hope they improve customer interaction in the future.I'm sure the experience is going to be smooth the next time as I will be able to apply my next visa faster. For serial travelers, Atlys is a boon!"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Anisha",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T11:36:01.000Z",
          "Titre": "It was fairly easy to get the Visa",
          "Contenu": "It was fairly easy to get the Visa. The only thing is we were stopped for a guarantee letter at the immigration.It was no where mentioned we need one and was a little hassle to convince them to consider invitation letter as guarantee letter. Else, I like the app!"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "A vij",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T16:59:55.000Z",
          "Titre": "Decent experience",
          "Contenu": "Decent experience, received visa within 24 hours. The mobile app needs massive flexibility and opportunity for customer to upload docs and track the status by a reference number or order number, In short make it a user friendly app, also have a customer service number for better touch points.Thank you for the assistance."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "mable chidi",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T15:16:13.000Z",
          "Titre": "Atlys makes the application process a lot simpler",
          "Contenu": "I struggled to apply for my Oman visa as the government website kept on reloading and I had to start over. It was a really frustrating process.I check Atlys and I was able to finish the application quicker than I had expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arun",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T00:40:43.000Z",
          "Titre": "Very easy service",
          "Contenu": "Very easy service Great app. I got my visa well before my trip, but I wish there was a real person to communicate with. I was nervous after submitting, but ultimately I got my visa on time. Going forward, I’ll be trusting this app more."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "osito",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T15:14:38.000Z",
          "Titre": "It's legit, got my Egypt E-visa, but was nervous for a while",
          "Contenu": "Applied in the Android app for a friend (from Colombia). Visa was under review for several days. Still not sent to the Egyptian Authorities?  Then I discovered their Zendesk help site There was a message (which for some reason did not arrive to my e-mail) that since I already had started a application on the official website they could not proceed before this was gone (after 7 days without submitting the application). Monday 30 of january it was gone. I sent a message to Rex at Atlys support about that. Today, thursday 2. feb I got the visa. The visa looks the same as the one I got directely from the officila website. So yes, this service is legit and working just fine, although there's still some work to optimize the app to avoid this problem. To summarize: if you already started an application on the official website and there's an applicant there. Then Atlys can't proceed before this applicant is gone. I feel Atlys should tell about that when applying trough the app"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Harshada Bhamare",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T07:18:43.000Z",
          "Titre": "Atlys has been a great help for…",
          "Contenu": "Atlys has been a great help for applying Egypt Visa. Agents are very helpful too. The process becomes hassle free and very comfortable with Atlys"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jenn",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T16:54:56.000Z",
          "Titre": "Not sure what to say",
          "Contenu": "Not sure what to say, process was easy but I haven’t received my visa yet so when I do I will give a great review"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "SEJUL SHAH",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T22:33:04.000Z",
          "Titre": "Atlys is wonderful app",
          "Contenu": "Atlys is wonderful app. Planning my trip to Thailand was a wonderful experience on this app. Team was great in giving response."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Madhavi",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T22:07:31.000Z",
          "Titre": "Customer service",
          "Contenu": "Need live customer service to answer the questions. Until I sent the email I didn’t get the appointment confirmstion"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customerMahendra Thakrar",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T19:37:59.000Z",
          "Titre": "So far I have not received our visas…",
          "Contenu": "So far I have not received our visas forTanzania n Kenya It’s been ten days"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Ishita Swarup",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T19:46:24.000Z",
          "Titre": "I love it",
          "Contenu": "I love it . It was amazing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ibrahim",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T21:58:16.000Z",
          "Titre": "I cancelled my application and Atlys sent me back the processing fee in a timely manner. Good experience.",
          "Contenu": "Timely response and honest communication"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Aarzu Raka",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T08:27:20.000Z",
          "Titre": "I applied for evisa to Egypt",
          "Contenu": "I applied for evisa to Egypt, the process was smooth. My application was processed by Arjun, he was a superb. He coordinated very well. My visa was approved before the deadline. I must say very trustworthy services with reasonable prices. I would highly recommend their services. Thank you so much Arjun and Atlys 🙏"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "manisha puniya",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:54:44.000Z",
          "Titre": "Easy and quick application process.",
          "Contenu": "Easy and quick application process.. also my visa got delivered well within the given time limit. There was a bit of a problem that occurred in the whole process but it was taken care of by the supportive team of ATLYS. Thank you for your prompt action and response. Would definitely be using their services and future . Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Atul Gupta",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T07:55:37.000Z",
          "Titre": "Received visa in <12 Hr - Phenomenal Experience",
          "Contenu": "We were recommended Atlys by our friends who quotes dubai visa coming in <24 hrs with Atlys, for our trip we opted for atlys. The app experience was phenomenal - Quick image clicks with passport scans (takes <20 seconds for each member) and to our surprise applications submitted at 9PM last night led to visa for all members by 11AM next morning. Totally awestruck with Atlys as visa is usually a 2-4 day affair with loads of physical document submission to agents. Very strong recommendation to all fellow travellers"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Janardhan Pokala",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T12:04:25.000Z",
          "Titre": "Best choice for visa booking",
          "Contenu": "Atlys has been my go-to choice these days - simply because the service is fast, reliable and consistent. They've turned what is an otherwise stressful process into something seamless. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Albert Philip",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T12:45:42.000Z",
          "Titre": "Great service from them…",
          "Contenu": "One of my friend suggested me to apply for Singapore visa through Atlys, and it was a good service from them. After going through all reviews I thought of applying through an agent but it was a good experience from them. Got my visa in 10 days."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sangeeta Nahta",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:50:19.000Z",
          "Titre": "Used Atlys for my Schengen visa",
          "Contenu": "Used Atlys for my Schengen visa. The experience was simple get delightful and the customer support was great. Most importantly got my visas on time."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "sanjay",
          "Nb_Reviews": 7,
          "Date": "2023-12-08T14:23:33.000Z",
          "Titre": "It was one of the quickest turnaround",
          "Contenu": "It was one of the quickest turnaround . Finally we don’t have to go and submit documents to any agent. One of the easiest visa process I have encountered. The support team is swift too ."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Rahul Gupta",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:07:05.000Z",
          "Titre": "very supportive and very cooperative…",
          "Contenu": "very supportive and very cooperative team. Nice and i will recommend to all"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Vickie Thakur",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T13:27:31.000Z",
          "Titre": "Atlys-Best for Visa",
          "Contenu": "I have had a seamless and perfect experience with my Visa process. The app is so easy to use. I have got my Visa in guaranteed time, in fact earlier than what was committed. Also, I must appreciate their proactive approach to connect and share information. I had a top notch experience with Arjun Halwai from their team. Highly recommended service."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Kanchan s",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T13:57:18.000Z",
          "Titre": "Got my visa super fast..",
          "Contenu": "Got my visa super fast... Than expected. I was able to book my tickets and plan my trip immediately thanks to Atlas team. They are very responsive"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "vivek jadhav",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:28:50.000Z",
          "Titre": "Got my UAE visa within time",
          "Contenu": "Got my UAE visa within timeOne the best app came acrossWill definitely recommend Atlys 👍"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Rahul",
          "Nb_Reviews": 4,
          "Date": "2023-11-15T13:35:03.000Z",
          "Titre": "Effortless Visa Approval: Atlys India's Top-Notch Service and Support",
          "Contenu": "Absolutely impressed with Atlys India! They made obtaining my Azerbaijan visa incredibly easy - it felt like a piece of cake. Their customer support is top-notch; they patiently addressed all my queries and provided fantastic assistance throughout. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Naina Dugar",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:17:49.000Z",
          "Titre": "Got my Japan and Singapore visas",
          "Contenu": "Got my Japan and Singapore visas. Love the real time tracking and exceptional customer support!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Neeloy Dutta",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T14:32:55.000Z",
          "Titre": "Applied uae visa for my tour group…",
          "Contenu": "Applied uae visa for my tour group members  from various cities in India .  Everything was perfect ,only  one issue was on a picture size and shadow of a perticular member but they solved that issue within 1 day and updated the evisa as soon as possible for a hassle free experience .."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Pheadra Jacobs",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T14:41:23.000Z",
          "Titre": "Team responds faster on Instagram",
          "Contenu": "Good, the team responds faster on Instagram messages, in case of any delays."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Shefeek Mohammed",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T19:36:39.000Z",
          "Titre": "Hassle free and very easy service",
          "Contenu": "Hassle free and very easy service. Great service. Even though i have had an error in documents uploading customer service called and guided to correct it. Excellent service."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Siddhesh Kale",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:00:29.000Z",
          "Titre": "Got for it !",
          "Contenu": "Got for it !Hassle free service got my visa on time Highly recommended 😊"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Samee Shaikh",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T15:55:51.000Z",
          "Titre": "It was a super fast Visa process by…",
          "Contenu": "It was a super fast Visa process by Atlys... Kudos to Team Atlys .. it was unbelievable many told me that u will get visa 3 - 4 workings days but Atlys gave me in 6 hrs. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Akshay J",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:06:39.000Z",
          "Titre": "Got the visa on given time",
          "Contenu": "Got the visa on given timeA good experience"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "KG Media Works",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T08:46:10.000Z",
          "Titre": "Very Good Experience but….",
          "Contenu": "Quite Good Experience in case if Egypt Visa as rates & visa approval time are by far the best in market.But I see rates of other visas are not that competitive . In order to be break the market & become leader in Visa Industry, rates & time is needed to be top notch"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Poornima Suryanarayana",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T19:04:02.000Z",
          "Titre": "Best experience!!",
          "Contenu": "I am the regular user of Atlys. I have experienced best services here. I have seen great improvements and upgradation of the application. This application made us things go easy. I would like to appreciate Mr Manan for the best services. Very humble and fast responding. Whenever visa needed to done comes in my mind my first Choice is Atlys. Thank you so much team."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Tamasree Ray Chaudhuri",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T09:25:53.000Z",
          "Titre": "5 stars aren’t enough",
          "Contenu": "If I could give you more stars, I would because 5 just arent enough. I was grateful to be assured by Arjun and I couldn’t have asked for a better travel consultant. The visa process and approval was seamless and Arjun was always available for me even on his days off and on weekends. Please know that you’ve found a permanent customer in us. Thank you Atlys and thank you Arjun."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Faran Imam",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T07:00:50.000Z",
          "Titre": "Fantastic job done by Karan……..keep it…",
          "Contenu": "Fantastic job done by Karan……..keep it up man. Just applied with a minimal docs and yah got the visa exactly on the day and even time as stated on application. 👍👍🙏"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sagar Sheth",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T15:43:25.000Z",
          "Titre": "Amazing experience for my Australia…",
          "Contenu": "Amazing experience for my Australia visa! I was planning my honeymoon and my fiance has never traveled outside India so I was quite anxious about the visa. But the Atlys process was very smooth and there were continuous updates on the app and amazing customer service by Sapna on whatsapp. Overall, a very smooth and expedited visa application process with the desired end result!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Pawan Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T06:43:39.000Z",
          "Titre": "Atlys made by Southeast Asia trip easy…",
          "Contenu": "Atlys made by Southeast Asia trip easy and smooth by getting my 4 visas to Singapore Malaysia Vietnam and Thailand"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Shivam",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T08:58:13.000Z",
          "Titre": "Good Concept, but needs better tech and support for this High-Stake Business.",
          "Contenu": "It started with an abysmal experience, but got better support after escalation.Got my VISA on time.Pros are -Easy to fill applicationRe-filling is easyA good initiative for making Visa easierFeedbacks are -Customer support needs to be better accessible, and tickets may need to be responded before waiting for 24 hours.Improve your OCR Reading, it literally read my name as SHIVAH instead of SHIVAM even directly from the passport, and there was no way to edit it, until we had the ticket fiasco.When you say that you verify the application on your sales page, Please do indeed verify it :)The fees does not justify relying completely on your tech for everything, Please do verify it manually aswell just once.Best of Luck and Thank you for the Visa."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Abhishek Navghane",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:04:27.000Z",
          "Titre": "We have applied",
          "Contenu": "We have applied. For Turkey visaAnd got the visa within few hoursGood job by team atlys !!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "ibrahim offline vedio",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T09:33:06.000Z",
          "Titre": "First I thanks to Atlas team because…",
          "Contenu": "First I thanks to Atlas team because I'm applied out side in USA visa it's 2 times I have refused After I'm very fed up I found Atlas ad in website I get the details collected for believeness then me understand its 100%genuine Plotform I'm apply france visa God grace I get visa multiple entering. Thanks for support Atlas team and best guide supnam madam just 10days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheri Harris",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T00:54:09.000Z",
          "Titre": "Atlys Worth the Extra Dollars vs. Frustration and Stress",
          "Contenu": "After 4 failed attempts at creating an account to apply for a Kenya visa, I found Atlys and used them to apply for my visa.  It was SO EASY.  I was alerted each step of the way to my progress toward approval.  I had some reservations about using a third party but I am so very pleased with Atlys.  I checked my visa application number against Kenya's eVisa system and indeed my visa was approved!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "gaurav chandak",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T08:01:07.000Z",
          "Titre": "Great experience hassle free and very…",
          "Contenu": "Great experience hassle free and very smooth.initially very difficult to trust but it proved us wrong and it has saved us from any kind of unwanted expenses.loved it and must recommended for getting visas flowlessly in no time"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Melissa Genovesi",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T12:50:02.000Z",
          "Titre": "I loved the fact that I had a single…",
          "Contenu": "I loved the fact that I had a single point of contact who communicated with me via WhatsApp to ensure that I got what I needed with the minimum amount of fuss. Fast service, delivered well ahead of scheduled. I would definitely use Atlys again!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "nitin upadhyaya",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T15:51:10.000Z",
          "Titre": "This is the best app and platform to…",
          "Contenu": "This is the best app and platform to get visas, it’s hassle free and everything can be done within finger tips…. Great support from the team on any queries or issues and keeps a tab on the TAT as wellOverall very very satisfied with the service"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Prasadrao Vemulapalli",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T11:43:17.000Z",
          "Titre": "it has been a great experience with…",
          "Contenu": "it has been a great experience with Atlys. They delivered more than promised. I strongly recommend them for Visa services. Prasadrao"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Mainak Aggarwal",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T15:12:19.000Z",
          "Titre": "Super Amazing !",
          "Contenu": "Super Amazing !! Fast , its blazing fast . Dont believe their timeline as they outdo themselves . You will get before their committed time."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Duran",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T14:45:52.000Z",
          "Titre": "The Best.",
          "Contenu": "What an amazing experience using Atlys to apply for my Dubai visa for a trip in June. To be honest I was so surprised how easy Atlys made the application process, they stated exactly what I needed and made the application process seamless. I tired to navigate through the government portals but it was so confusing which increased my anxiety. I came across Atlys and don't regret making use of their services at all. They are a top notch company. 10/10 would recommend."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Nikhita Vanwari",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T08:26:22.000Z",
          "Titre": "Prompt service",
          "Contenu": "We were flying out in a month and needed a last minute appointment at the French consultant. The Atlys team was able to get us an appointment within a couple of days, was extremely prompt in helping us arrange the correct paperwork for our application, and followed up with the consulate to ensure we got our passport in time. Thank you for all your help with the process."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kavya Ravi",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T22:02:35.000Z",
          "Titre": "Amazing customer service!",
          "Contenu": "We were skeptical since we heard about some bad experiences with customer service but Akansha Kosha from the helpdesk was super responsive, patient and helpful and connected me with Arjun Halwai who personally handles visas for Egypt. The whole process was stressful and visa got rejected the first time but Akansha and Arjun responded and worked for us even on weekends and helped answer all questions and expedite the process. Arjun was very reassuring and went the extra length to contact the CEO and consulate to help answer our questions. The two of them also helped process refunds for extra charges. We now have our egypt visa after all the hassle. Very grateful for their kindness, support and patience."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Vishal Gupta",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T15:17:52.000Z",
          "Titre": "Superb experience",
          "Contenu": "Superb experience! First time attempted for visa never thought it will be that smooth.Where lots of people guides with the wrong information and makes us hasle here and there but atlys gaves the feeling that it's not that difficult which i was thinking.Great experience!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Smita Puranesh",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T14:54:48.000Z",
          "Titre": "Brilliant and unbelievably seamless",
          "Contenu": "Seamless experience  and while I was nervous (because it seemed unbelievable) thsi app really delivered .I got my visa in 2 working days while travel agents told me the fastest possible is 5 working days .Brilliant app and a product which solves a real complex problem for travellers and takes away the stress of getting visas and the paperwork and appts hassles along with it.While it doesn’t need any human intervention, I reached out to Arjun (as it sounded too good to be true) and he was amazing in reassuring and keeping me updated"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Narendra Jain",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T09:34:18.000Z",
          "Titre": "Super Amazing ,",
          "Contenu": "Super Amazing ,Got my Australia Visa in 6 days and New Zealand Visa in 3 days time without any hassle . Recommend all to use this Atlys app for all Visa needs .Narendra JainPriya Jain"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dheeraj",
          "Nb_Reviews": 6,
          "Date": "2023-05-01T21:05:59.000Z",
          "Titre": "I used Atlys Black to obtain an impossible visa",
          "Contenu": "I used Atlys Black to obtain a visa for a conference where I was speaking. I was about to email the organizers and let them know that I cannot make it because there were no appointments available online. However, I found out about Atlys and they pulled through even though I was on a super tight deadline. From now on, I am confident that obtaining a visa will not be an issue 😎"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Manik Dua",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T13:54:03.000Z",
          "Titre": "loved the overall experience",
          "Contenu": "loved the overall experience. applying was easy - used it for my australia visa. will use atlys app for future visas. thanks team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "anju abraham",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T06:54:43.000Z",
          "Titre": "Atlys was extremely helpful and got an…",
          "Contenu": "Atlys was extremely helpful and got an appointment for a France Schengen visa when it was impossible to find an appointment. We are able to make our travel plans because of the timeliness of the appointment. Superb service! Very happy customer. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William muto",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T19:47:01.000Z",
          "Titre": "Very Positive Experience",
          "Contenu": "Used Atlas for visa application to Egypt.  Had very positive experience in that their price was only slightly higher than government fee, their web page was easy to navigate and they kept us fully informed during the application process.  Would recommend them."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Tejasvi",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T19:01:21.000Z",
          "Titre": "Very easy way to get visa…nice…",
          "Contenu": "Very easy way to get visa…nice experience with you all….Sapna you are very kind n helpful…she help me to get all my documents perfect…very quick……literally in 10 mins I completed all procedures of visa application and I got my France visa in 4 days only🫶YOU ALL ARE GREAT…Next time visa with ATLYS only…"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Bhawar D shah",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T13:56:05.000Z",
          "Titre": "Atlys: The Pinnacle of Efficiency for VISA and Travel Insurance Services",
          "Contenu": "\"Atlys is undeniably the most effective platform for VISA and Travel Insurance services. The staff operates with remarkable efficiency, ensuring a seamless process. What truly sets them apart is their ability to deliver VISA services ahead of schedule, exceeding all expectations.\"Bhawar Shah-Dhwani International (Mumbai)"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Rizwan",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T07:19:44.000Z",
          "Titre": "Place for quick Egypt Visa",
          "Contenu": "For me , it was really amazing and unbelievable experience. I applied for egypt evisa and got the evisa next day only.I travelled hassle free with this visa. Even imigration did not asked for evisa , probably because it was connected with my passport. Thank you Atlys for quick work . I wish you do the same for all other countries in future."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Risa Ganatra",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T08:30:23.000Z",
          "Titre": "Great Experience & Platform",
          "Contenu": "I love this platform. It’s so easy and resourceful. You can apply for multiple people and at ease. What I love even more is their support team. I wanted to arrange a visa for Egypt and Sapna from their team was so proactive in making sure I had a seamless experience! I totally recommend using this app as your go to for any travel related solutions.. Go Atlys !!! Kudos to the team for easing our lives 😅"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristine",
          "Nb_Reviews": 5,
          "Date": "2023-05-30T07:45:50.000Z",
          "Titre": "SO useful for digital nomads!",
          "Contenu": "My friend and I would have had to cancel our Kenya trip if not for Atlys! We tried 5 types of credit cards and the Kenyan government website would not take any of them. Atlys came through for us and we managed to make it into the country in a day or so!I now use Atlys regularly to avoid the risk of dealing with random vendors online or slow govt agencies. They are reliable, very fast, and support is VERY helpful if you need anything. Crazy useful for any digital nomad."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Charmi Gandhi",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T19:36:28.000Z",
          "Titre": "Amazing experience with a great company with wonderful employees!",
          "Contenu": "I had a wonderful experience with this company. The team is great and super helpful. Always responsive- at any time of the day. The head of operations is especially very helpful and quick to solve all queries and questions. The entire process is effortless and time saving. definitely recommend this to anyone who has a busy life. never going back to the old method of applying for a Visa ."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "krupal shah",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T13:32:03.000Z",
          "Titre": "Australian visa…",
          "Contenu": "I requested on app for Australian visa on 24th September they asked for supporting documents and submission was complete by 30th September I got my visa on 12th October, Visa details can be very confusing they made it simple and speed of delivery is admirable Kudos to the team Atlys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharika Kaul",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T04:26:22.000Z",
          "Titre": "Fast and Easy",
          "Contenu": "As someone who’s applied for many many visas in the past, I was so surprised to see how easy atlys made it to fill the application. Their UI is easy to understand, and they give a date when you can expect your visa to come. I wrote an email to them on the day of my estimated visa arrival, but it ended up coming in the evening. Overall had a great experience, and will use them again for future trips."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Gautam Pawar",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T15:08:37.000Z",
          "Titre": "Applying  visa for UAE it’s so simple…",
          "Contenu": "Applying  visa for UAE it’s so simple and fast can’t believe. Half an hour visa was approved . I suggested my friends and all are just very happy to use Atlys"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "HAKKIM B",
          "Nb_Reviews": 5,
          "Date": "2023-07-09T12:27:11.000Z",
          "Titre": "Wonderful experience",
          "Contenu": "Wonderful experience! Whole hearted recommendation.First of all my special thanks to Atlys team.I had appiled Egpit visa 4th day i got it.I strongly recommend to everyone.👍❤️"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Anuj Padvekar",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:25:44.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing serviceGot my E visa without any hassle 😀"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Aditya Sheth",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T12:22:39.000Z",
          "Titre": "Used Atlys once, never looked back!",
          "Contenu": "I used Atlys once and never looked back ever since. I’ve applied for 9+ visas (including Schengen) and received every visa and appointment on time, every time. I just wished they supported more countries but all in due time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gina",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T01:36:12.000Z",
          "Titre": "Atlys made my dream came through Atlys…",
          "Contenu": "Atlys made my dream came through Atlys did all their best in providing what’s needed in my application they are very punctual in  responding my emails.They are the expert in dealing visa applications.I can’t thank Atlys enough for their effort.A big thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shafeen Ali",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T01:45:00.000Z",
          "Titre": "I just love this site",
          "Contenu": "I just love this site, I hold a foreign passport and didn't know how to apply for Australian visa from the States, I found this site online and applied the visa. I am overwhelmed with this site because I was granted the visa within 2weeks. If you submit all the necessary documentions with the application then you won't have any problem with your visa application. Highly recommend this site/app👌👌👌"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Rohit Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T09:42:52.000Z",
          "Titre": "Got my UAE visa within 24 hours!",
          "Contenu": "What I like the most about their services is how quickly you can apply and the specific timeline for receiving your visa. It took less than 5mins to apply and I got my UAE visa overnight. I recommend Atlys."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Swati Sharma",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T14:34:48.000Z",
          "Titre": "Planning my trip with Atlys has been…",
          "Contenu": "Planning my trip with Atlys has been one of the most satisfying experience. Their team at hand has actively helped me get all my documentation on time in a hassle free way. I would like to recommend Atlys to all my knowns and i look forward to collaborate with Atlys for all my future trips"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Komal Wadhawan",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T11:59:32.000Z",
          "Titre": "The Most Awesome App",
          "Contenu": "Hi Everyone Atlys App is one of the best apps i have come cross right from submitting my papers till the day i receive my Visas. Specially Arjun and his team is so efficent in guiding You to the tee and they See to it that your Visas are delivered to You on time keep up the good Work Atlys All the best on your future endeavours best regards Komal Dhingra"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Arasan Tamil",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T14:29:20.000Z",
          "Titre": "Pros and cons on my visa application",
          "Contenu": "Pros:I was applied for Egyptian E visa. The rates are quite low than others. So I had lot of doubts on Atlys. But on committed date I got the visa. Still it's unbelievable to me. Excellent.Contros: I am trying to apply for Malaysia visa. In connection with that I faced some errors and doubts. I wrote mail 3 times to them. No one called so or replied. backConclusionIf you are applying regular tourist visa and having all the papers ( asked by atley app). It quite easy and great. I can strongly recommend"
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Brian Mwangi",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T22:27:43.000Z",
          "Titre": "Atlys Delivers in Record Time. Amazed!",
          "Contenu": "I recently used Atlys to obtain a Visa for my trip to India and I must say, I was pleasantly surprised by their service. Not only did they deliver my Visa in record time - under two days, but their team was also incredibly helpful throughout the process. I was able to submit all the required documents easily and their website was user-friendly. Overall, I am very satisfied with my experience with Atlys and would highly recommend their services to anyone in need of a Visa."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Sanchez",
          "Nb_Reviews": 3,
          "Date": "2023-05-09T01:04:44.000Z",
          "Titre": "My experience utilizing Atlys was it…spectacular",
          "Contenu": "My experience utilizing Atlys was it was super easy, convenient and time consuming. I was able to get my Visa easily and on time. I highly recommend this service to anyone in need of visa. All you have to do is follow directions and you will get results quickly."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Satyajit",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T19:44:54.000Z",
          "Titre": "Hassle-free VISA",
          "Contenu": "It was a truly Hassle-free, Transparent and Smooth processing of my VISA and would definitely come here for my future needs as well. Also will recommend others to use Atlys App for their VISA requirements."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Himani Goswami",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T07:06:33.000Z",
          "Titre": "I used Atlys for obtaining my e-Visa…",
          "Contenu": "I used Atlys for obtaining my e-Visa with Malaysia 🇲🇾 . It definitely caught me off guard when they called me in for an interview but all in all  - Team Atlys is very responsive and tried their best to make it as smooth as possible. I would use the app again for my next visit to the UK 🇬🇧"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sisipho",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T13:12:05.000Z",
          "Titre": "Excellent app",
          "Contenu": "Reliable, efficient and overall great experience. I can’t stop raving about this app. It’s made my travelling so much easier. I love it and it’s so informative. Everything I need with just a few clicks."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Tavishi Blaggan",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T12:39:20.000Z",
          "Titre": "Great and reliable",
          "Contenu": "My go-to app for making all my spontaneous vacations come true. Its super easy and swift process allowed me to get my Hong Kong visa in no time. Would recommend to all."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Diya Kulkarni",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:43:05.000Z",
          "Titre": "Got my UAE visa in less than 4 hours…",
          "Contenu": "Got my UAE visa in less than 4 hours ,will highly recommend atlys visa service."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sana Murad",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T09:57:09.000Z",
          "Titre": "The process is absolutely easy.",
          "Contenu": "The process is absolutely easy.We have applied for visa twice from Atlys and both the time the visa came on time, infact early. Their real time update helps to track the status of the visa which is quite helpful."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "ugwu kelechi",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T21:27:09.000Z",
          "Titre": "Unbelievable",
          "Contenu": "Unbelievable! Was very skeptical at first, but turns out to be a great experience. Applied for Kenya eVisa and got it in exactly 7 days. I had to verify the eVisa via the govt website and it returned VALID."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Narendra Jain",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T10:04:36.000Z",
          "Titre": "Awesome experience",
          "Contenu": "Awesome experience ! Got Australia visa in less than a week ! So smooth and hassle free . Support team was great ! Hats off to Atlys team ! Recommending to many more friends of mine to use Atlys .Happy client Narendra Jain 😊"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "HS",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T12:46:28.000Z",
          "Titre": "Excellent product and service",
          "Contenu": "Excellent product and service. Took only a few minutes to fill out an application for a Dubai visa and received it in a day. Delightful product, will certainly use it again and recommend it to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T22:43:34.000Z",
          "Titre": "ATM TIM’S REVIEW",
          "Contenu": "I’m a first time international traveler. I didn’t know how to get a visa so my sister referred me to this app called Atlys. I was planning on going to Nairobi,Kenya and I needed a visa quick. My e-visa came back in 5 days with no issues and I made my way to Kenya. I would recommend this app if you’re traveling abroad."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Pankaj Goswami",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T08:32:23.000Z",
          "Titre": "Highly recommended application for visas.",
          "Contenu": "Atlys is one of the best service apps I have ever encountered. Its a highly recommended app and the backend team service is par excellence. I am going to use this now always for all my international visa requirements."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "AYUSHI SRIVASTAVA",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T19:36:22.000Z",
          "Titre": "Fantastic experience.",
          "Contenu": "Fantastic experience.They made my visa application process easy. I will surely contact them for all my future trips. The backend and communication team was very good. They made me comfortable  and helped me alot."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "PRB",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T09:42:46.000Z",
          "Titre": "Reliable company",
          "Contenu": "Reliable company : got my visa on time, had constant support and they replied to all my queries within minutes. They have good ratings and great company profile with right backing."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Shreeyagya Khemka",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T09:56:24.000Z",
          "Titre": "I hate international travel BUT",
          "Contenu": "I hate international travel mostly due to visa hassles. With Atlys life is simple. I went to Dubai and was able to do my visa application in a few minutes. The UI is intuitive and simple to use. Great job looking forward to international travel again. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Mayuresh Chavan",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T14:44:08.000Z",
          "Titre": "Best App for Visa Services",
          "Contenu": "Whenever I want to apply for a visa, every time Atlys App comes to my mind. They made my travel very easy in past. The service and the app interface is really good. They take care of your documentation as well as a quick resolution to any query. Give it a try they will definitely simplify your travel."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Kanak",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T11:56:53.000Z",
          "Titre": "Visa at Home is now true",
          "Contenu": "Visa at home is now true, i was always wondering why do we need to spend so much time for Visa, for that Atlys was gave me the right answer in 30 Min all visa process got done :-)"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Raunak Jhaveri",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T08:26:37.000Z",
          "Titre": "I applied for my Schengen visa via…",
          "Contenu": "I applied for my Schengen visa via Atlys. It was the simplest process. Got my appointment date faster than any other service has been able to give me in the past. The app was super easy to use and the team was highly responsive to all of my queries. This really helped solved the pains of visa applications."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Soutik Ganguly",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T15:42:59.000Z",
          "Titre": "A Game changer",
          "Contenu": "A brilliant app, the flow was smooth and the UI easy to understand.Most of all they got the job done. I was booking a Vietnam Visa on priority from Atlas black. I paid as I had to be there urgently and the Atlys team made sure I got it at the earliest. But man o man did they deliver. Will definitely recommend using atlys. It’s a one stop shop for my Visas now."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "KHADEER",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T18:56:51.000Z",
          "Titre": "Team atlys very Helpful",
          "Contenu": "Had great experience with team atlys efforts appreciated team was were very  Polite and and given Quick Response on my query For UAE Tourist Visa and Finally they Made it Thank q Once Again Karan☺️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sanjuli Bewtra",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T22:54:12.000Z",
          "Titre": "Highly recommended",
          "Contenu": "I heard mixed reviews from people, but since my travel date was coming closer and the Indian government site ate my money and never got back to me, I decided to try Atlys. Within 3 days, I got my visa. I had no problems at the airport. Very pleased with the service."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Hasna Andal",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T04:36:24.000Z",
          "Titre": "I am amazed how fast I get my visa…",
          "Contenu": "I am amazed how fast I get my visa without any hustle on my end as what they promised on their app. I am very hesitant at first but when I tried their service I always use Atlys to get visas for my family every time we do travel.  I hoped you keep your best and wish to have more visas with you guys."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Veer Malhotra",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T16:57:16.000Z",
          "Titre": "Is visa bothering you? Atlys is a solution to it!",
          "Contenu": "If visa is bothering you? Atlys is the answer to end up all your travel hurdles!Your travel plans might hamper due to visa issues, here's I found the best & ease solution for myself! Me along with My family traveled to multiple countries and everytime I got stuck on the visa part~~ But Atlys builds up my confidence to 200% that now I don't have to think twice for visa. Atlys will take care of everything, you just have to spend a minute or less on it and everything will be take care by Atlys!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Prithvi Maram",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T14:44:18.000Z",
          "Titre": "10/10 would use it again",
          "Contenu": "Great product with great customer service through which I was able to secure a visa on-time for my business trip."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "KB",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T09:39:42.000Z",
          "Titre": "Loved the experience",
          "Contenu": "Loved the experience. My favourite part was that I could avoid going to a studio and instead take a selfie. Details: 1 visa to Vietnam. Got it before promised time."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "rashi monga",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T05:21:05.000Z",
          "Titre": "I used Atlys for the first time",
          "Contenu": "I used Atlys for the first time , and trust me it was fast as lighting . I got stuck somewhere and needed the support of the team for my visa . The assured me and got my Egypt visa in less then 72 hours! Thanks team"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Poonam Hooda",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T12:33:34.000Z",
          "Titre": "Good experience...The agents are polite and helpful",
          "Contenu": "The agents are polite and helpful. Helped me in each step... Provided time to time update...Sent me the visas over WhatsApp... Overall nice experience."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Akanksha srivastava",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T14:46:51.000Z",
          "Titre": "I had an amazing experience using this…",
          "Contenu": "I had an amazing experience using this app . It made my visa process so easy . Will surely recommend everyone and would surely use this app for my future travels 🤩"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ashutosh Shukla",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T17:23:08.000Z",
          "Titre": "Excellent Service!!",
          "Contenu": "Fantastic experience getting our recent visa to Thailand. The team is incredibly supportive, and are always around to assist in any kind of issues. Our documents had several issues, and the app interface was amazingly helpful in sorting those out. Was very pleasantly surprised to see an active human touch in a service that’s almost entirely digital."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Vilas Menon",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T12:35:19.000Z",
          "Titre": "Very fast and hassle free process",
          "Contenu": "Very fast and hassle free process. User friendly too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Osmar Coronel",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T00:50:26.000Z",
          "Titre": "Got India e-visa super quick!",
          "Contenu": "Got India e-visa super quick!! At first I felt the process was intimidating, but with Atlys I felt comfort when I received my visa so quickly."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jonah Divinagracia",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T14:52:26.000Z",
          "Titre": "I saved money and time",
          "Contenu": "I saved money and time! I had multiple issues in paying for an Indian Evisa. It was really frustrating since I can’t proceed but Atlys took care of it. I have received my Evisa in a day! What a wonderful company!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Rahul Doshi",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T14:40:42.000Z",
          "Titre": "The easiest way to apply visa",
          "Contenu": "The easiest way to apply visa, great way to get the visa done asap, process is too good and smooth.Apply and experience the new revolution happening in the visa industry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mary",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T02:59:35.000Z",
          "Titre": "schengen visa",
          "Contenu": "Really glad i trusted them. i was able to get my schengen visa in less than 15 days. they booked an appointment for me as soon as i was able to confirm. attended appointment 2 days later. they answered and reassured me with everything i needed. thanks for the help guys."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Dikshita Khullar",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T21:47:15.000Z",
          "Titre": "Personalized and Professional: Atlys' Exceptional Visa Application Services",
          "Contenu": "Atlys is a fantastic company that provides assistance to those applying for visas. Their founder, Mohak, personally helped me with my Switzerland visa application and I must say, it was a great experience.The team at Atlys is incredibly prompt, helpful, and nice to talk to. They patiently answered all of my questions and concerns and provided me with all the necessary information and documents to ensure my visa application was a success.I would highly recommend Atlys to anyone who needs assistance with their visa application. Their team is professional, knowledgeable, and genuinely cares about their clients. Thank you, Atlys, for making my visa application experience a smooth and stress-free one!"
        },
        {
          "Note": 5,
          "Lieu": "AZ",
          "Pseudo": "Hitesh Thacker",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T10:00:06.000Z",
          "Titre": "Best Visa Service - Travel made easy",
          "Contenu": "I'm delighted to share my exceptional experience with the Visa service from Atlys India. The process was incredibly smooth and efficient, thanks to the dedicated support of their employee, Sapna. Her expertise and professionalism truly stood out, making the entire process stress-free. I highly recommend Atlys India and Sapna for anyone seeking Visa assistance."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Swati",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T17:39:23.000Z",
          "Titre": "Amazingly delivered",
          "Contenu": "Amazingly delivered. Great how efficiently and efficiently your team got us the visa for Egypt. Surely going to recommend to everyone around."
        }
      ]
    }
  ]
}