{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "automatic-email-manager.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Brian Powell",
          "Nb_Reviews": 1,
          "Date": "2021-07-04T22:53:10.000Z",
          "Titre": "For suck sake.Purchased the update and…",
          "Contenu": "For suck sake.Purchased the update and now not workjing at all. Get it sorted"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2020-07-10T20:54:47.000Z",
          "Titre": "I should be able to get the lifetime of…",
          "Contenu": "I should be able to get the lifetime of licenses due to how many I’ve purchased because you guys don’t respond to my emails! I’ve emailed over and over and never get a response. I’ve purchased 5 licenses and one got deleted. You didn’t respond so I was forced to buy a new one. I’m irritated"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Jesper Larsen",
          "Nb_Reviews": 6,
          "Date": "2019-06-14T10:33:04.000Z",
          "Titre": "Great product - But they suddenly change the terms.",
          "Contenu": "Great product. but suddenly it's has change to yearly license?We have bought a product one cost. U can't change it suddenly..It's like: You buy a car. It's yours now. suddenly after 1½year the dealer comes back to you and says you need to pay a monthly fee if you still wanna use it.... ?? what?So it was a mistake to upgrade? can we downgrade again? Could you just accept the first terms that people signed? or write it, with big letters, so people was aware of loosing their licens?"
        },
        {
          "Note": 2,
          "Lieu": "MA",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T11:13:59.000Z",
          "Titre": "Hectic renewal process",
          "Contenu": "We really suffer for renewing every year. We don't know what is wrong with the payment gateway but this thngvs happening very year for the  past years. Also the price tag is high for what the system is weather first time purchase or renewal."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2019-11-19T03:16:50.000Z",
          "Titre": "Expensive for what it does",
          "Contenu": "Expensive for what it does, especially as it is a subscription."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Florian",
          "Nb_Reviews": 1,
          "Date": "2019-02-06T08:27:41.000Z",
          "Titre": "Way to expensive"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Fabian Umbach",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:55:06.000Z",
          "Titre": "Tax ID function didn't work",
          "Contenu": "Tax ID function didn't work, time and trouble with the bookkeeping..."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Joerg Mueller",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T18:11:20.000Z",
          "Titre": "Email Manager does a good job everyday…",
          "Contenu": "Email Manager does a good job everyday (printing invoices and store them is the task for us) but when I performed a update, the database was destroyed and I had to restore a backup. Furthermore, when renewing the license, they don't add 365 days... the add 365 days from day of booking - you loose some days until the run out of the original license."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy Liljeros",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T18:52:16.000Z",
          "Titre": "I sent an email and no one responded…",
          "Contenu": "I sent an email and no one responded with the information that I requested with regards to my renewal.  So I only renewed for 1 yr."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Anonymos",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T07:59:52.000Z",
          "Titre": "Couldn't enter my VAT ID",
          "Contenu": "Couldn't enter my VAT ID, always got an \"An unexpected error just happened\" message."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "migeek",
          "Nb_Reviews": 1,
          "Date": "2019-08-21T18:30:01.000Z",
          "Titre": "It does allow me to print PDFs via…",
          "Contenu": "It does allow me to print PDFs via email which is nice.The user interface is not very good and clumsy to work with.  I also had some trouble getting my license info and wasted time trying to figure that out.Finally, it's expensive for what it does.  I paid the price because I needed the functionality and it works."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "MK",
          "Nb_Reviews": 1,
          "Date": "2019-08-06T13:06:11.000Z",
          "Titre": "It's a little clunky to get setup and…",
          "Contenu": "It's a little clunky to get setup and the interface isn't great but it is doing the job we need it to which is automatically print attachments from a couple of shared mailboxes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2019-09-04T15:11:32.000Z",
          "Titre": "Had a lot of problems with payment…",
          "Contenu": "Had a lot of problems with payment going through. I had to call payment system and they stating it was my IP address. after several attempts it did finally go through"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jodie",
          "Nb_Reviews": 1,
          "Date": "2018-10-11T19:18:51.000Z",
          "Titre": "New features didn't feel user-friendly/efficient",
          "Contenu": "Please keep in mind I didn't read any information about what the updated version brought.  However, I felt it was very inconvenient that the email's folderpath was identified differently in the new version, all our rules became \"broken\" as soon as we touched them with an edit.  I had to go through each rule that was imported from version 6 (we had 23 rules running) and edit the folder to look in, the folder to move to, and the fields to use when saving the files.  It was as if I had to create all new rules anyway. And I do not like the group actions feature, it feels like duplicate work now for administrating the rules.Oh and I forgot to mention that all the rules were updated with the \"live push\" option, which severely compromised our computer that runs the software.  I hope that was mentioned in the \"new features\" information that I missed. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Devon Vorster",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T18:54:30.000Z",
          "Titre": "Dear namtuk all is working well",
          "Contenu": "Dear namtuk all is working well, I require only but one thing please make it able to send attachments without tags. Other than that any person needing sorting of emails please do not look any further"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sally Pellegra",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T14:54:02.000Z",
          "Titre": "This program is great",
          "Contenu": "This program is great! When the AP staff come in, the invoices are already printed and they can start work immediately. Previously, the AP staff would spend an hour just going through their emails and printing invoices. Only 1 issue that we have experienced. When the invoices are in individual attachments, they all print. If a vendor sends several invoices in 1 attachment, not all invoices print."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Authorized User",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T19:09:28.000Z",
          "Titre": "Works as advertised",
          "Contenu": "Works as advertised,  Needs some features added, I understand it is continuously being worked on and and improved.   Support is fast to respond. I believe it is well worth the cost."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Flyguy",
          "Nb_Reviews": 2,
          "Date": "2020-10-03T23:59:48.000Z",
          "Titre": "All we wanted was an automatic email printer this is it",
          "Contenu": "Overall we like the products. That said it is a little bit confusing in what settings to use if you want to print out certain emails and not others.  ie the user interface could be easier"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Flyguy",
          "Nb_Reviews": 2,
          "Date": "2021-09-05T21:50:59.000Z",
          "Titre": "Over all it is a good system",
          "Contenu": "Over all it is a good systemIt does what it is meant to do ie print our emails as we receive themit does take a bit of effort to  get it to do what you want it to do, but I blame this on my poor knowledge of the program.It would be nice if they could do team viewer or something like that to have access to your computer so you could get it set up precisely the way you want it- maybe that help is there already?>WE have been using it for about 2 years now and do not want to give it up"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hannes Brunauer",
          "Nb_Reviews": 1,
          "Date": "2020-01-09T09:05:42.000Z",
          "Titre": "We can not but your software more then…",
          "Contenu": "We can not but your software more then 1 year (like 3 or 5 years include subscriptions)"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "get real",
          "Nb_Reviews": 4,
          "Date": "2020-11-12T15:08:31.000Z",
          "Titre": "I love this product",
          "Contenu": "I love this product!  The only reason why I couldn't give 5 star was every 3-4 weeks it just stops working for a day and it start back up again.  Otherwise, great stuff!"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Christian",
          "Nb_Reviews": 1,
          "Date": "2020-06-21T11:13:29.000Z",
          "Titre": "Yes, they can !",
          "Contenu": "We use it frequently for our installations. We are happy with the features and the support (if needed)."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Andre Müller",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T06:29:46.000Z",
          "Titre": "nice Software, good Support",
          "Contenu": "nice Software, good Support, everthing i need to save my emails with attechment"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tedy A",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T23:21:22.000Z",
          "Titre": "Easy to use and intuitive interface.",
          "Contenu": "Easy to use and intuitive interface.Quick and courteous email technical support.Suggestion - allow for scenarios to be arranged and executed in order."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Giovanni",
          "Nb_Reviews": 1,
          "Date": "2020-09-09T13:40:18.000Z",
          "Titre": "the product in itself is very good",
          "Contenu": "I tried all automatic printing for Food delivery shops to automatically print online orders and AEM is the only one that actually works so I installed on each one of my clients computers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Les",
          "Nb_Reviews": 2,
          "Date": "2020-03-04T21:46:03.000Z",
          "Titre": "So far so good--works well",
          "Contenu": "So far so good--works well. Easy online purchase!"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Glenn",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T06:44:44.000Z",
          "Titre": "Great product and easy to use.",
          "Contenu": "Great product and easy to use.Also the customer support is very good."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Laura Hirsbrunner",
          "Nb_Reviews": 1,
          "Date": "2020-08-05T05:23:52.000Z",
          "Titre": "Very helpful and a quick response"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Unitec Institute of Technology",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T21:35:58.000Z",
          "Titre": "Straight forward"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Stefan",
          "Nb_Reviews": 3,
          "Date": "2020-10-19T22:11:57.000Z",
          "Titre": "It Works!",
          "Contenu": "It does what it promise. And thats perfect!"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Cook Brothers Bars Accounts",
          "Nb_Reviews": 1,
          "Date": "2019-01-16T21:28:08.000Z",
          "Titre": "Extremely versatile email manager with…",
          "Contenu": "Extremely versatile email manager with lots of options that can be set.  Amazing customer support. Setting up was a bit fiddly as we needed the software to perform 16 different actions, but the customer support was a great help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Matthews",
          "Nb_Reviews": 2,
          "Date": "2022-07-08T22:28:50.000Z",
          "Titre": "Automatic Email Manager is awesome."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2018-09-01T02:58:51.000Z",
          "Titre": "Helpful software",
          "Contenu": "Great software, 98% reliability, 2% of the time the program won't print my attachment somehow."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Philippe",
          "Nb_Reviews": 1,
          "Date": "2019-01-11T09:35:17.000Z",
          "Titre": "Not very easy to grab.",
          "Contenu": "Not very easy to grab.Not very powerful.But quite stable and efficient"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T07:03:07.000Z",
          "Titre": "Very easy to set up and use."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Lokk",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T15:47:32.000Z",
          "Titre": "It's OK",
          "Contenu": "It's OK! It's OK! It's OK!"
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Bianca",
          "Nb_Reviews": 1,
          "Date": "2018-09-28T13:31:49.000Z",
          "Titre": "helpful",
          "Contenu": "helpfull and quick replay"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JUDITH",
          "Nb_Reviews": 1,
          "Date": "2020-06-14T18:38:56.000Z",
          "Titre": "Good product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rolly Hawkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:46:25.000Z",
          "Titre": "Just not having to open an email just…",
          "Contenu": "Just not having to open an email just print it if I already know that is what I am going to do"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 5,
          "Date": "2023-09-14T13:33:37.000Z",
          "Titre": "I’ve been using automatic email manager…",
          "Contenu": "I’ve been using automatic email manager for over 12 years and two of my offices. I have set up multiple emails so that I can either print just a PDF that’s attached to an email or print a complete email and attachment.I am constantly recommending automatic email manager to friends and family and telling them how convenient great it is.The renewal process very easy and fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T16:02:25.000Z",
          "Titre": "Perfect solution for auto-printing emails",
          "Contenu": "This is exactly what we were looking for: Ability to automatically print AND save to PDF an email AND its attachments. Lots of configuration options. Runs as a service without needing user logon.  Also integrates with Pushover app so you can get push notifications on your phone based on email criteria. Works with any standard IMAP, POP, Exchange email account or with common email providers (Gmail, etc) Perfect!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Cressi Sub Spa",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T09:21:41.000Z",
          "Titre": "Good morning",
          "Contenu": "Good morningexcellent your program.We have a problem with the update that we launch it after downloading and it doesn't start. can you tell us something?secondly we would need to have the invoice with our. VAT number? if you are IT00260910104Thank youRossella"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Laurence",
          "Nb_Reviews": 4,
          "Date": "2023-10-10T02:09:59.000Z",
          "Titre": "Great Software with excellent Support",
          "Contenu": "Simple and easy sign up and great software that enables my storage of emails to be independent of any supplier. Nice piece of productive software."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "- Robert TIsdale",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T23:03:00.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product - has saved us a tremendous amount of time!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T01:40:06.000Z",
          "Titre": "Makes saving emails so easy!",
          "Contenu": "We use AEM to save emails as PDF files and also save their attachments. The Regex features allowing file names based on part of a subject line such as our file reference is really good but there are a few quirks. We trialed v8 before purchase (we were using V5) and the responses to our queries regarding the Regex features were prompt and helpful.The ability to add email addresses directly from the message list to black/white and custom lists to manage what actions occur based on email addresses makes management much easier.Adding existing actions to an account could be easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2022-06-08T22:57:31.000Z",
          "Titre": "Saves us a ton of time and frustration",
          "Contenu": "A new customer of ours turned us on to Automatic Email Manager. We've implemented it in our own business to clean up emails before they're seen by our ticketing system. We use it for automatically saving important attachments from vendors. It does so much for us now, it is like having an employee dedicated to cleaning up email for us."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Powerlutzie",
          "Nb_Reviews": 3,
          "Date": "2021-11-04T13:01:54.000Z",
          "Titre": "Very useful and time saving program",
          "Contenu": "Automatic Email Manager is one of the best programs I have ever used. It saves a lot of time once it is configured. Today I had my first problem (which didn't effect any necessary function) and the customer service fixed it within minutes during a remote session.I definitely recommend this program! You can't go wrong at all except not buying it!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Douglas",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T14:30:51.000Z",
          "Titre": "There’s no other program quite like it…",
          "Contenu": "There’s no other program quite like it - Automatic Email Manager saves me, at least, an hour today but automating several tasks. The support for it is second to none with a minor glitch solved within literally minutes."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "John Burrows",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T03:12:36.000Z",
          "Titre": "Was easy to renew",
          "Contenu": "Was easy to renewMust have missed the email about renewal due date so scrambled a bit when it stopped working but otherwise all good"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Glenn Allen",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T05:48:34.000Z",
          "Titre": "Excellent product that saves us time!",
          "Contenu": "Excellent product and makes automated email tasks very easy. We use it for saving attachments for processing and also printing direct to printer. Support is excellent and product updates as required. I highly recommend this product. Check it out their website for more info."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Laurie E",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T00:29:29.000Z",
          "Titre": "Very surprised how simple and easy to use Automatic Email Manager",
          "Contenu": "I am about 6 days into discovering how I can use Automatic Email Manager to process and store my email from Outlook.com and Gmail. So far so good. Works perfectly to enable me to save off each email as they arrive along with any (Selected types ) attachments and then consolidate into one location where I can then have them searchable and stored both locally and in the cloud. I asked a support question at one stage over the weekend and received a response within a couple of hours. Very pleasing and surprising. Good Job you guys.Namtuk.com"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Ignacio",
          "Nb_Reviews": 2,
          "Date": "2022-10-11T12:21:14.000Z",
          "Titre": "Quick and professional attention really helpful!",
          "Contenu": "I great surprise to find a company with a service ans attention so helpful and professional. After instalation of a new version with some new useful features, I hope to have an additional option which make sense to give more flexibility to a concrete feature, and the AEM team answered me they were going to study the case to provide me a solution. Just one day after, they provide the solution even included in a new release of the latest version. And... the attention of any support assistant very friendly and clear in the explanations. Really great!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Caputo",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T21:22:59.000Z",
          "Titre": "Namtuk email manager has been very useful",
          "Contenu": "Namtuk email manager has been very useful.  We are a nonprofit that serves the elderly and people with disabilities and we need them to return documents as an attachment to an email.  The email manager has helped our Consumers and non-technical staff tremendously."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Nicola Holmes",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T21:13:47.566Z",
          "Titre": "Excellent help desk service",
          "Contenu": "Being without email manager for more than an hour is very stressful for us, so after changing computers I couldn't get it up and running again for a day and a half. Finally contacted the help team and they sorted out the issue in 10 minutes at 9.30pm at night.  The help team have always been excellent and I couldn't work without this program now."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T23:58:02.000Z",
          "Titre": "A very easy renewal process",
          "Contenu": "A very easy renewal processThe only thing we struggle with is that we have a number of licenses that were bought on one account but during the renewal process have somehow managed to get spread across multiple accounts. Maybe a bit too easy to forget to log in at renewal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Sopko",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T17:44:22.000Z",
          "Titre": "This program does exactly what we need…",
          "Contenu": "This program does exactly what we need it to do! Makes auto printing things a simple task. Allows you to check different email accounts and set a bunch of different parameters. Nothing like it out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Matthews",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T23:11:28.000Z",
          "Titre": "Automatic Email Manager has resolved…",
          "Contenu": "Automatic Email Manager has resolved numerous challenges, from interoffice communications via network page scanners to network printers via email. inbound email to print from specific users, inbound cloud fax to specific printers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dpad",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T18:50:08.000Z",
          "Titre": "Automatic Email Manager has saved me so…",
          "Contenu": "Automatic Email Manager has saved me so much time. I was using multiple solutions like HP ePrint and Zapier before, and they would stop working after a while for no reason. This software has been working perfectly."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Marc S.",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T18:53:24.000Z",
          "Titre": "Automatic Mail Manager is a great tool",
          "Contenu": "Automatic Mail Manager is a great tool. There are so much possiblities within this software. It's very easy to understand and everything works out of the box. Highly recomendable.Btw. I have a support request regarding a small bug. It was fixed in one (!!!) day, so I got a new version the next day. Newer saw this kind of good support !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nebraska Septic",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T15:22:51.000Z",
          "Titre": "a very simple request",
          "Contenu": "a very simple request, to automatically print incoming emails.  after trying several options, this $300+ option was the only one that worked.  I feel like there is a simple solution, but it works for what I need it to..."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dominic Batty",
          "Nb_Reviews": 2,
          "Date": "2020-10-06T07:59:09.000Z",
          "Titre": "I was looking for a product that would automatically print an email",
          "Contenu": "I was looking for a product that would collect from a googlemail account and automatically print to a bar thermal receipt printer.  This product works brilliantly, reading the mailbox every 20 seconds and outputting the incoming email.  It's going to work great for our purposes and their support also seems good on my initial questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2020-11-17T20:27:42.000Z",
          "Titre": "AEM just works",
          "Contenu": "AEM just works, once it is setup.  Occasionally, there are problems that show up, like happened this time where an email came in with an attachment not being able to be merged with the email body and printed, so I contacted support and got an answer faster than expected, within a few minutes, which worked great to fix the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arin",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T03:04:13.000Z",
          "Titre": "good automation software",
          "Contenu": "I downloaded Automatic email manager to automatically print PDF attachments that are sent to my email and it works amazing.Ty for the good software.The website link is automatic-email-manager.com if you are looking into doing the same thing."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Michael Schärli Salamanca",
          "Nb_Reviews": 1,
          "Date": "2020-09-16T16:52:04.000Z",
          "Titre": "Save and merge e-mail and attachments",
          "Contenu": "I had trouble with one of the functionalities, which was solved inmediately eventhough it implied a special effort from your side. It was amazingly fast and efficient how you solved it.Haven't seen such a good support in years.Many thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Hofmann",
          "Nb_Reviews": 1,
          "Date": "2022-02-13T20:31:03.000Z",
          "Titre": "This program is exactly what I needed",
          "Contenu": "This program is exactly what I was looking for. I needed a solution to help me print product labels for internal parts at our shop. The labels are created on the fly and the old solution we had was not great. After looking around and doing a week's worth of research, I landed here. In literally less than 30mins I had installed, tested, purchased, and deployed everything. I could not ask for a better solution. THANK YOU SO MUCH!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Andreas N.",
          "Nb_Reviews": 1,
          "Date": "2020-11-03T10:01:29.000Z",
          "Titre": "Great software, good support, fair price",
          "Contenu": "The software is easy to handle, fair 30 days testing without limitations.Good software, easy to setup, works great.Quick support, even if you don't own a license and you're just testing.Fair price model, easy ordering. Perfect!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "unnamed",
          "Nb_Reviews": 1,
          "Date": "2020-01-08T22:52:03.000Z",
          "Titre": "Works very well as advertised. I would recommend to others",
          "Contenu": "Works very well as advertised.I have 5 office 365 accounts setup in the program that scans and only prints pdf attachments based on emails with specific subject and body text strings"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ersin",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T08:12:59.000Z",
          "Titre": "Excellently fit to our need",
          "Contenu": "Excellently fit to our need. Automatic email manager is dependable contributor to our manufacturing process now. Easy to set up and all the details we were in need of are considered nicely. Thank you very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric P",
          "Nb_Reviews": 2,
          "Date": "2022-11-14T18:53:28.000Z",
          "Titre": "Time Saved = Money Saved",
          "Contenu": "For a company that works with printed orders, automating that part of the process is key -- especially if the software you use is intelligent to know what exactly you need it to print.  Automatic Email Manager is a robust solution that gives you full control at a reasonable price for the time saved."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Jeffrey Poen",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T17:26:18.000Z",
          "Titre": "Cloud/E-mail print solution",
          "Contenu": "For a cloud-based ERP system, we used the software to print (print to email) to the network printers via a central server, which reads the mailbox every 30 seconds. and prints the attachments. Works great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 2,
          "Date": "2022-09-28T16:30:02.000Z",
          "Titre": "Handles printing of incoming invoices…",
          "Contenu": "Handles printing of incoming invoices easily. Lots of options to configure on how you want it to behave if you need. Have been using for years. Good product and good support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wesley",
          "Nb_Reviews": 1,
          "Date": "2019-12-02T15:57:48.000Z",
          "Titre": "An Amazing product that has increased…",
          "Contenu": "An Amazing product that has increased our productivity dramatically and free up our staff's time to do more important tasks. I'm surprised more people don't use it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven H.",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T22:23:40.000Z",
          "Titre": "Namtuk (Automatic Email Manager) Deserves 6-stars",
          "Contenu": "In my 40 year career in IT, I have never worked with a company or staff as responsive as Namtuk's! I've been using Automatic Email Manager (AEM) for over 5 years and we have processed almost 600,000 inbound emails with AEM.During this time, my company has changed email services, multiple logon security implementations, etc. Namtuk staff AKA \"Ernest\" / \"Ernesto\" has helped us through all of these changes. And if I can contact them been noon Pacific time, I'll hear back from them the same day, otherwise I'll have an email awaiting me when I check the next morning. Yes, we have found bugs in AEM and Namtuk has quickly fixed the issues or explained my misunderstanding, normally by the next day. If the error hard to reproduce, they have worked with us until the issue is resolved.I can remember at least three times that Namtuk has taken a suggestion of mine and added it for everyone in AEM by the next day! Wow!!! (Of course, your mileage my vary.)  Do I recommend Namtuk and AEM: YES! I also like that AEM is readily available to trial for a 30-day trial and their pricing is upfront. No need to be hounded by a pesky salesperson.StevenSenior Automation Engineerfor a large food company"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dan A",
          "Nb_Reviews": 1,
          "Date": "2022-03-13T14:26:52.000Z",
          "Titre": "Easy Printing of Attachments",
          "Contenu": "Software works really well to automatically print email attachments from Gmail.Not programming skills required, very user friendly.I was up and running in a couple of minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ralph Smith",
          "Nb_Reviews": 1,
          "Date": "2021-03-12T14:01:48.000Z",
          "Titre": "Easy to use and works as advertised",
          "Contenu": "Our nonprofit has been using this software for a couple of years now to collect and distribute incoming faxes from various Internet fax accounts and distribute/print them as appropriate.Easy to set up and has worked without issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Murat",
          "Nb_Reviews": 1,
          "Date": "2020-02-11T23:33:29.000Z",
          "Titre": "I only use this software to auto print…",
          "Contenu": "I only use this software to auto print emails. This is the best software for doing this because the competition is just an add-on to Outlook, which is not ideal because if you're trying to keep Outlook open all the time, it will periodically get stuck and then prompt you to enter your account password, which defeats the whole purpose of automation."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Tomas",
          "Nb_Reviews": 1,
          "Date": "2020-09-28T18:04:32.000Z",
          "Titre": "Awesome support",
          "Contenu": "Awesome support. My gmail didn't work for some reason, support reacted within miunutes, connected to my machine and instantly fixed it. Thank you - this is the reason to pay for programs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "scott n",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T15:49:51.000Z",
          "Titre": "google cloud being canceled this year…",
          "Contenu": "google cloud being canceled this year has wrecked our world. We had so many things automatically printing on different printers. We found Auto Email Manager and it works so good! The only downside is that it has to be run on a local machine but as long as you have a power backup on it then this is not a huge deal. It has solved our crisis. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Simon Stainmagen",
          "Nb_Reviews": 1,
          "Date": "2021-07-25T22:55:34.000Z",
          "Titre": "The team here are great",
          "Contenu": "The team here are great. They respond to issues rapidly and take on suggestions for new functionality and deploy them really quickly if they agree its a gap to be filled."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ralph Smith",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T17:54:31.000Z",
          "Titre": "No complaints at all",
          "Contenu": "They are very responsive to questions, they actively update the software.  It does what it says it does, very easy to configure.  No complaints at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JL",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T20:48:38.000Z",
          "Titre": "You can literally automate any printer task …",
          "Contenu": "You can literally automate any printer task. HP ePrint was horrible, and with this software I can literally automate any printer task, from which printer, to which paper tray to all other settings."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "GL",
          "Nb_Reviews": 2,
          "Date": "2021-09-02T09:36:00.000Z",
          "Titre": "Automatic Email manager is great",
          "Contenu": "Automatic Email manager is great, really help me to automatically print my ecommerce orders, simple to set up. Thanks for this great solution!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 5,
          "Date": "2022-09-11T15:32:41.000Z",
          "Titre": "I been using Automatic Email Manager…",
          "Contenu": "I been using Automatic Email Manager for over 10 years.  I have recommended it to over 30 people who also have recommended it to their business partners.  I actually have 6 different email accounts connected to it"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Harry Rogers",
          "Nb_Reviews": 3,
          "Date": "2020-07-29T15:40:00.000Z",
          "Titre": "Great Functionality. Easy to Setup. Fast accurate support",
          "Contenu": "A real Gem. Allows sophisticated processing of in-coming emails. Any support questions are answered quickly and accurately by email. Highly recommend this tool. Allowed us to quickly add functionality to an existing system without the need for a major re-write. Using email as a file transfer mechanism for clients customers makes 'on-boarding' easy and getting 'Automatic Email manager' to route the attachments automatically builds a multi-tenant file repository."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Marc Verbeke",
          "Nb_Reviews": 10,
          "Date": "2023-10-13T10:58:59.000Z",
          "Titre": "Quick replies on  \"how to do\"",
          "Contenu": "Quick replies on  \"how to do\". Even if it not directly product related.   Pls go on with this attitude."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "HBK Dethleffsen GmbH",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T09:48:53.000Z",
          "Titre": "Great kind of software",
          "Contenu": "We use it to extract attachment from mail, mostly invoices.Easy to use, once it is configured no maintenance is needed.Great kind of software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T13:36:46.000Z",
          "Titre": "This program is awesome",
          "Contenu": "This program is awesome. It helps cut down on the time it would take to print all the emails one by one. Would recommend to anyone who has a lots of emails with attachments that need to be printed."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "The Computer Guy",
          "Nb_Reviews": 13,
          "Date": "2021-08-11T07:19:04.000Z",
          "Titre": "Great software :)",
          "Contenu": "Great, second install for a customer now.First install files and prints attachments automatically from website orders.Second install now automatically responds to emails sent to an old address before forwarding them (with the original sender address intact) onto the new email address."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "A Uddin",
          "Nb_Reviews": 1,
          "Date": "2021-03-12T19:03:54.000Z",
          "Titre": "Very good product",
          "Contenu": "Very good product. Works as required. Better options for information to receipt layout would be better but works really well."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Arjan Myer",
          "Nb_Reviews": 1,
          "Date": "2020-08-18T14:47:12.000Z",
          "Titre": "This is an example of a thorough piece…",
          "Contenu": "This is an example of a thorough piece of software. Intuïtive, very practical, stable and not over-expensive. Exactly what we were looking for."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Paul C",
          "Nb_Reviews": 3,
          "Date": "2022-09-30T07:32:33.000Z",
          "Titre": "4 years and still loving it!",
          "Contenu": "I have been using the automatic email manager for so many years now. It run in the back ground and saves so much time by handling so many tasks. I showed my IT support company this product and now they use it too"
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "JUAN G.",
          "Nb_Reviews": 1,
          "Date": "2022-01-06T18:06:10.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, we use it to automatically review our info@... email, since it receives a lot of spam. Only important emails are sent to us by AEM."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "KH",
          "Nb_Reviews": 2,
          "Date": "2021-03-17T17:45:31.000Z",
          "Titre": "really great after sales support!!",
          "Contenu": "really great after sales support!!Ask for changing the license eMail Address, it was done within 3 minutes!Great, thank you again AEM-support!"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Justin Allan",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T02:09:31.000Z",
          "Titre": "The software works flawlessly for the…",
          "Contenu": "The software works flawlessly for the automated printing of driver run sheets at three of our remote sites."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Keadle",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T17:12:05.000Z",
          "Titre": "Prompt reply",
          "Contenu": "Prompt reply - quick resolution.  VERY useful tools within AEM to copy activity to clipboard and attach to case.  Very handy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trent Kammerer",
          "Nb_Reviews": 12,
          "Date": "2022-02-17T14:28:12.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, buying in again for a different company this time. Has worked flawlessly for 3 years or so. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "vimal",
          "Nb_Reviews": 3,
          "Date": "2021-08-10T19:07:19.000Z",
          "Titre": "I have using Automatic Email manager…Highly recommended",
          "Contenu": "I have using Automatic Email manager for over 6 yrs, no issues at all. E-mail to fax perfect.I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Jaime Matos",
          "Nb_Reviews": 5,
          "Date": "2023-02-08T15:56:35.000Z",
          "Titre": "Automate email and print it based on conditions.",
          "Contenu": "The support is amazing. We use this software to Automate email and print it based on specific conditions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Armando Garcia",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T19:33:24.000Z",
          "Titre": "I have 1 year using this app to…",
          "Contenu": "I have 1 year using this app to management emails in a particular funtions and do not give me any problem, I feel good using this app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Gordon",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T20:00:35.000Z",
          "Titre": "Great program, does what is expected.",
          "Contenu": "This continually works and prints our emails and faxes.  Can filter by subject and create different rules."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip",
          "Nb_Reviews": 2,
          "Date": "2020-12-01T16:00:33.000Z",
          "Titre": "Works as advertised",
          "Contenu": "Works as advertised.  Simple to install and configure and is a great price compared with other solutions I've researched."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Ingemar Wederfoor",
          "Nb_Reviews": 1,
          "Date": "2021-04-26T09:14:04.000Z",
          "Titre": "Nice software",
          "Contenu": "Good product!!! The also solved my probleem with transaction. I would recommend thuis software. Great service."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "UDI Droit",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T12:32:47.000Z",
          "Titre": "Do perfectly his job",
          "Contenu": "Easy to install and configure. Adding a default SMTP configuration will be better. Price little high."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Luca",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T12:04:08.000Z",
          "Titre": "This program is great!",
          "Contenu": "With this software I manage the automatic printing of attachments that I receive from a Microsoft 365 corporate email. I have solved also problem with Microsoft 365 Basic Authentication after deprecation.Great product!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Carolin",
          "Nb_Reviews": 2,
          "Date": "2021-03-08T16:36:29.000Z",
          "Titre": "Absolute the best",
          "Contenu": "Needed to automatically print our order email, did test many other software but this is absolute the best"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Pollack",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T12:10:26.000Z",
          "Titre": "Great program",
          "Contenu": "I have been using Automatic Email Manager for over 10 years. It is a fantastic program."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "frank barnett",
          "Nb_Reviews": 1,
          "Date": "2021-01-06T23:22:33.000Z",
          "Titre": "Great Produt",
          "Contenu": "Solved a lot of our problems trying to relay on printer apps that did not work all the time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adriana",
          "Nb_Reviews": 1,
          "Date": "2020-07-24T13:33:12.000Z",
          "Titre": "its been 3 years with great experience…",
          "Contenu": "its been 3 years with great experience with namtuk no only with the software but also with customer service"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ulrich",
          "Nb_Reviews": 2,
          "Date": "2019-12-12T10:16:35.000Z",
          "Titre": "excellent program!",
          "Contenu": "excellent program!great replacement for the (no longer developed) MailPrint, which unfortunately has a few bugs now!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr.Ed",
          "Nb_Reviews": 2,
          "Date": "2020-02-17T16:47:15.000Z",
          "Titre": "Everything I could need in converting emails to PDFs",
          "Contenu": "Very well written software. Has just about everything I could ask for.I love that I don't need to write code, but I have the option to launch scripts if I need to.  Very reasonable and up front price makes it a no brainer."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "CARL MORTON",
          "Nb_Reviews": 2,
          "Date": "2022-01-18T18:28:42.000Z",
          "Titre": "Great automation softwar",
          "Contenu": "Automatic email manager saves our business hours of manual work per month and the customer support from the development team is five ⭐️."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Golden Fluff",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T16:50:10.000Z",
          "Titre": "that i don't need to worry abt printing…",
          "Contenu": "that i don't need to worry abt printing my emails they just print on their own Amazzzzzing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "vimal",
          "Nb_Reviews": 3,
          "Date": "2022-09-01T19:30:00.000Z",
          "Titre": "Great for business",
          "Contenu": "Been using automatic-e-mail manger for over 8 yrs. I highly recommend them"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Christian",
          "Nb_Reviews": 1,
          "Date": "2019-12-13T10:10:42.000Z",
          "Titre": "Good choice for automatic email managmend",
          "Contenu": "Great product, good support. Happy that the unlimited licenses are available again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2019-12-17T15:51:17.000Z",
          "Titre": "Used for years and has been dependable…",
          "Contenu": "Used for years and has been dependable and easy to use with GREAT customer support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 5,
          "Date": "2023-09-12T14:00:33.000Z",
          "Titre": "Very easy to renew",
          "Contenu": "Very easy to renew.  This is a great program that I have been using for over 12 years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karie Murray",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T00:11:02.000Z",
          "Titre": "The software so far has been exactly…",
          "Contenu": "The software so far has been exactly what we were looking for."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Vivien Patterson",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T01:25:26.000Z",
          "Titre": "Easy Renewal/Upgrade",
          "Contenu": "Easy Renewal/UpgradeProduct License has been updated. All good"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Simon Wolf",
          "Nb_Reviews": 3,
          "Date": "2022-02-12T15:08:36.000Z",
          "Titre": "Very useful software",
          "Contenu": "Very useful software, was able to configure it without deeper knowledge. Recommeded!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Verla-Pharm",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T09:39:14.000Z",
          "Titre": "The software is exactly what we were looking for",
          "Contenu": "The Software automatic Email manager offers many possibilities and is variably configurable. Even a request to the support by mail was answered quickly and competently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2020-08-19T19:43:58.000Z",
          "Titre": "Super happy with this software",
          "Contenu": "Super happy with this software, simple to setup and performs flawlessly."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Arnaud CASTEX",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T14:00:05.852Z",
          "Titre": "I have upgrade from version 6 to 8",
          "Contenu": "I have upgrade from version - to 8 without issue and a quick reply from the support"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2020-04-24T20:58:55.000Z",
          "Titre": "Im looking for a long time for a…",
          "Contenu": "Im looking for a long time for a programm with so manny options. The best programm i found and it´s function verry good. Thenk you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Grimm / Design Communications, Inc.",
          "Nb_Reviews": 1,
          "Date": "2019-12-03T18:36:48.000Z",
          "Titre": "Love This Product",
          "Contenu": "I have been using Automatic Email Manager for over 10 yearsand it does what I need it to do every time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell",
          "Nb_Reviews": 3,
          "Date": "2022-07-09T21:25:09.000Z",
          "Titre": "Been using this for years",
          "Contenu": "Been using this for years. Useful in many cases. Simple to set up and totally reliable."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Herke van den Berg",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T19:36:18.000Z",
          "Titre": "Renewel of license wasvery easy and…",
          "Contenu": "Renewel of license wasvery easy and took only a little amount of time"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anthony",
          "Nb_Reviews": 5,
          "Date": "2021-09-01T17:33:03.000Z",
          "Titre": "Very easy to renew",
          "Contenu": "Very easy to renew . No hassle and the printers themselves function well ."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Valeriu",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T10:20:59.000Z",
          "Titre": "Great experience with Automatic email…",
          "Contenu": "Great experience with Automatic email manager.very useful feature for me is the automatic print of selected PDF attachements"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "chafik",
          "Nb_Reviews": 3,
          "Date": "2020-12-22T11:56:28.000Z",
          "Titre": "i am using it since 4 years now ,and no…",
          "Contenu": "i am using it since 4 years now ,and no issue with it.hope there will be soon a MAC version."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "G Wright",
          "Nb_Reviews": 2,
          "Date": "2022-03-10T17:28:45.000Z",
          "Titre": "Good App",
          "Contenu": "Good App for streaming email to print automatically"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Byron",
          "Nb_Reviews": 2,
          "Date": "2022-06-15T22:07:04.000Z",
          "Titre": "Excellent product and even better…",
          "Contenu": "Excellent product and even better support from the developer."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 7,
          "Date": "2022-09-20T17:35:21.000Z",
          "Titre": "Life-saver for doing automated printing…",
          "Contenu": "Life-saver for doing automated printing tasks."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Christian",
          "Nb_Reviews": 3,
          "Date": "2020-02-19T19:16:59.000Z",
          "Titre": "very good program and excelent support",
          "Contenu": "very good program and excelent support, go on!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell",
          "Nb_Reviews": 2,
          "Date": "2020-01-02T21:59:35.000Z",
          "Titre": "reliable program that saves a ton of…",
          "Contenu": "reliable program that saves a ton of time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Takeshi Yoshida",
          "Nb_Reviews": 1,
          "Date": "2022-01-15T22:25:58.000Z",
          "Titre": "We don't have to print order emails…",
          "Contenu": "We don't have to print order emails manually any more.This saves us a lot of time?"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2020-05-14T07:09:30.000Z",
          "Titre": "Fast answering every question",
          "Contenu": "Fast answering every questionReally good"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Roya",
          "Nb_Reviews": 1,
          "Date": "2020-02-20T14:05:20.000Z",
          "Titre": "That program was exactly what I needed…",
          "Contenu": "That program was exactly what I needed .Simple and complete"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Singleton",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T19:08:25.000Z",
          "Titre": "Very reliable and easy to setup and…",
          "Contenu": "Very reliable and easy to setup and manage."
        }
      ]
    }
  ]
}