{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "bettersaferadio.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan Sgouros",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:30:38.000Z",
          "Titre": "Nastiest business owner of all time",
          "Contenu": "Ordered some gear from the owner at BetterSafeRadio.com. Seemed pleasant at first. I ordered the wrong items and re-orderd new ones. I asked for a return on the first order and shipped it back to him asap. It took him weeks to process my refund after my items were delivered back to him, after constant follow-ups. I said I would dispute with my credit card company if the returned order was not refunded. He then goes on to be probably the single nastiest person I've ever dealt with online (seems like the other 1-star review share the same sentiment). Posting some actual emails with the dude below. Best to avoid and take your business elsewhere.\"Wow, such a good Catholic!Are you that thick? I wasn’t asking you to apologize for giving me business or expecting service, which you clearly got. I was talking about your repeated threats of a chargeback, not appreciating what I was going through, especially this time of year, and acting like an entitled pr*ck, which you obviously are.Well, in the end, you have to sleep without yourself, not me, so have fun with that knowing you lack even a basic level of compassion.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob Dozor",
          "Nb_Reviews": 4,
          "Date": "2023-11-28T18:54:01.000Z",
          "Titre": "BSR told me my question was stupid",
          "Contenu": "BSR told me my question was stupid. Maybe it was, but I never got an answer to my stupid question. More argumentative than helpful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Chiurazzi",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T02:05:34.000Z",
          "Titre": "Avoid this loser like the plague",
          "Contenu": "Avoid this loser like the plague. Read all the 1 star reviews and BELIEVE them. He's great as long as you're spending $$ but if you ask a question you're met with insults and profanity. I figured since I spent over $500 with the guy I'm entitled to ask about missing orders (he insists problems with USPS are rare, but it's a common complaint if you read the reviews).  I'm pretty sure he's some kid in mom's basement based on his replies to my concerns/questions. I also know he'll post some snotty untrue response to this (which I won't waste my time reading) but read other bad reviews and a common thread will emerge.Save yourself grief and spend your dollars with a reputable vendor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R. R.",
          "Nb_Reviews": 2,
          "Date": "2022-03-30T10:39:01.000Z",
          "Titre": "Waste of time and money",
          "Contenu": "I am never dealing with this Mickey Mouse “company” has no clue what customer service is, doesn’t understand what 4 weeks are, things everyone has to understand and deal with all the short comings “because he is a one man show”. The POS radio showed up busted, and I’ll just file for a refund thru my credit card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Frank",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T17:44:02.000Z",
          "Titre": "BetterSafeRadio is a Bully",
          "Contenu": "When asking questions about the $400+ in radios and accessories I purchased from him, Mark became impatient and called me \"just another sad ham idiot.\"When I cancelled my just placed order for another radio from him, he refused to give me a full refund.Buyer beware"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry Byrd",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T19:56:01.000Z",
          "Titre": "Not sure",
          "Contenu": "A bunch of customer service errors bad emails back and forth and really just kind of pushing it back on the customer doesn't work for me thank you though have a good day Terry 🇺🇸🇺🇸🇺🇸,.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Pullins",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T00:50:34.000Z",
          "Titre": "Hey guys being 100% real this guy mark…",
          "Contenu": "Hey guys being 100% real this guy mark will screw you over in a absolute heartbeat. He’ll add stuff to your account and ask for payment on said stuff . He’ll hang on to your order for over a month and then say it was your fault bc you didn’t pay for the item he put in your order . On top of all that he’ll act like he refunding your money and cancel on you and say your crazy . Save yourselves a massive headache and please go somewhere else bc it’s not worth it whatsoever. I’ll be happy to post my bank account history and show any and everyone who see’s this review that he hasn’t refunded anything. It’s easy to make claims and you don’t back them up and get this he even said you shouldn’t put a negative review before you get your refund. That should tell you something right there. This is my first and only review on anything and it has to be a super bad experience. Another thing it’s funny how when someone calls someone out as in adding something to your order without permission and just so happens it only happens once outta thousands of orders , go figure guys, I think anyone doin business with this guy should really understand what may happen to them ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darrell",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T15:25:33.000Z",
          "Titre": "Product Not Usable",
          "Contenu": "Buyer Beware. I ordered the radio and waited nearly three months. I knew it was backordered and chose to purchase it anyway.  However when the radio finally arrived the charger/cradle was defective and wouldn't charge the radio. I immediately emailed and messaged the store owner. After about 48 hours he replied. I've sent multiple videos and was respectful with this man. I've read other reviews about his  business practice and purposely stayed calm to attempt to get a peaceful resolution. I have proved to him with videos that the charger/cradle is defective. He is suggesting I purchase a new charger/cradle from his store. I paid good money and waited a long time and have a radio that I cant use because I can't charge it. Now he is trying to force me to spend more money because his merchandise was defective. This is terrible customer service and just flat out wrong. I've pleadedd with him to send me a new working charger/cradle. I've sent multiple videos and a bunch of respectful messages explaining the defective charger. I contacted him within an hour of the radio being delivered to my house. There is no reasonable reason for him to refuse sending a new working charger/cradle so I can actually use the radio I paid for and waited three months to receive.------------------------------------------------------------UPDATE 5/18Store owner is telling me via email that if I don't delete/edit this review immediately then he wont exchange the faulty charger/cradle and i will only be able to fully return the entire product subject to his restocking fees if all bags, packaging, etc... is in brand new condition. All I want is to be able to use the radio that I purchased which I can not since I cant charge it with defective charger/cradle. I shouldn't have to pay a penalty restocking fee because the charger/cradle is defective. He can have the defective charger/cradle back. I don't want it. It doesn't work! He isn't disputing the fact that the charger/cradle is defective but isn't offering a solution other then pay a restocking fee. All I want is to be able to charge my brand new device I waited three months to receive. This guy is unreasonable. Why is this so hard for him to stand behind a product that he is selling?------------------------------Another UpdateSo what exactly is my option here again? To pay to return the whole radio including faulty charger and pay a restocking fee? All he has to do is replace the faulty charger. I am more then willing to send back the faulty charger.  Simple reasonable solution yet here we are.------------------------------------------------Update. Not sure anyone really reads these things but for whatever reason this guy has decided to make this whole thing impossible. He says he left a window open for me to get a working charger but its untrue. He is saying I must send the whole radio back and pay a 20 percent restocking fee and a 4 percent return fee. Give me a break. This is not a window of resolution. Not sure what this guys trip is but all I want is a working charger. Fact- the product he sent me was faultyFact- he refuses to send me a working chargerFact- I am willing to send him back the faulty charger but he is making it impossible. Never sent me a \"required\" RMA number to return defective charger, etc... Please read this guys riddle of store policies before making a purchase. Ive never in my life dealt with a company like this. All I want is to be able to use the device I purchased."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David McClintock",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T23:27:12.000Z",
          "Titre": "Rtsystemsinc software not compable with…",
          "Contenu": "Rtsystemsinc software not compable with KG-UV9GX"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nik",
          "Nb_Reviews": 7,
          "Date": "2022-08-25T06:04:59.000Z",
          "Titre": "Buyer beware (seriously)!",
          "Contenu": "I ordered a back-ordered item from BSR back in June. I was told that it could take up to 8 weeks for the item to ship. After 9 weeks I inquired about the status and was told at least a couple of weeks. Mark told me that if I couldn't wait that he could cancel the order and refund my funds. I cancelled my order, but Mark promptly slapped me with a 4% charge. Nowhere on my invoice/confirmation was this stated. Mark claims that it is all over the website! I did not see that back in June.Updated Aug 24, 2022, at 17:00Well now I feel I need to add additional warnings! In Mark's response there are a lot of lies and misinformation. Here goes:1) I never asked him rudely, but rather inquire about the status of my order. I also said I would need to cancel if he could not give me an estimate. He couldn't and, to his credit, he offered to cancel the order, only to slap me with his fee!  2) I never claimed he was running a scam, rather that it would be a clever scam!3) Back in June there was nowhere on the order screen about the fees (it was buried in a menu). Furthermore, there was no mention of said fees on the invoice/confirmation.4) He says that I 'threatened' to use a VPN to get to his site. Why would I need to do that? When he bragged about that (besides buying used on eBay) I would never be able to buy the product new (I maybe he has a monopoly), I responded by saying if I really, really wanted the item I could use a proxy (a friend, spouse, sibling, etc.). Very simple and perfectly legit!5) Mark claims that I'm 'entitled'. The insults keep coming low and high. All I'm doing is telling my side of the story and that, hopefully, other potential, customers are careful.I'm sure all is great when the order goes as planned, but not so much when there are hiccups (as other reviews indicate).I hope this helps and that you all are careful.BTW this is the first site I've ever done business with, where you're charged for a back-ordered item!Updated Aug 24, 2022, at 19:30And the lies continue! I feel that I cannot let Mark's lies stand. The community needs to know how Mark deals with unexpected issues. Unhinged is the word that comes to me! He has called me thick skulled and many other names insinuating that my mental capacity is diminished. I would never expect that from a retailer.He claims that he does not have a monopoly on the KG-UV9GX. Here you can see a YouTube clip:YouTuber NOTARUBICON (could not post the link, but it's easy to find on the channel) states that KG-UV9GX is only available at BetterSafeRadio. That sure sounds like a monopoly to me! Mark probably thinks that he has a thick skull as well!Mark claims I've threatened him. I guess that truth and honesty is a threat to him. I consider myself more of a whistleblower as there is no monetary benefits in it for me to reveal Mark's sketchy business practices.Mark also makes insinuations that is not based on anything concrete. He says I regretted that I cancelled my order. Why would I want to wait up to another 10 weeks (based on the numbers he gave me).Yet another update. August 24, 2022 at 23:00The backorder estimate had passed. I was told 4-8 weeks. It is now over 9 weeks! Mark offered me a refund which I accepted, only to be slapped with a fee that I was not aware of (you certainly did not mention it in your email). My bad was that I did not know you would charge my card immediately.I could live with that, but the fee was extremely under handed. Later, Mark admitted that he would have split the fee, but for some reason he said I was not nice enough (even calling me thick skulled)!Mark claims that he does not have a monopoly on the radio. You don't have to have a monopoly to have a monopoly on a single item. I certainly have not found the item anywhere else (as the NotARubicon channel claims). Mark, can you enlighten me to who else offers the radio? Just curious about your definition of a monopoly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Knight",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T09:10:24.000Z",
          "Titre": "Haven’t received order yet…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T05:15:19.000Z",
          "Titre": "I never recieved my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Franks",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T18:59:56.000Z",
          "Titre": "Extremely poor service",
          "Contenu": "Extremely poor service! Ordered this weeks ago and still haven't received them! Now they want a review on an item they won't ship to me but it didn't stop the charge to  my credit card for them............ Save your time and money and buy from a reputable vendor. Well here we are 6/18/21 No radios! No contact! Just a picture of an empty promise. Folks beware this man is selling a promise. Buy from vendors that can deliver! don't be fooled by an empty promise. 49 days of this is enough. Filed dispute with Am Exp and simply moved on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 2,
          "Date": "2021-05-05T13:36:37.000Z",
          "Titre": "Terrible Service!!!",
          "Contenu": "Canceled an order due to complexity of making it.  You would have thought I had personally assaulted the owner!  Order was never even sent and was threatened with a 20% restocking fee!  Was overcharged for \"programming\" that was not even paid for, potential credit card fraud.  You cannot phone this company to quickly work out any misunderstandings as the voice mail indicates not accepting calls!  Owner repeatedly said in emails, \"I'm swamped\".  Very volatile personality with terrible treatment of customers when he does not get his way."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andre Smith",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T00:03:31.000Z",
          "Titre": "I purchased a back ordered radio",
          "Contenu": "I purchased a back ordered radio. Upon checking up to find out about shipping date. I was told it would be awhile ...no dates or projections just like that.So I cancelled order and asked for a refund. I was told that it would take 24-48 hrs. That was five day's ago and no refund.Would not recommend BSR because of poor customer service. They still owe me my money . I will never buy from them again.Update: I did receive my refund 24-48 hr.s after posting this review. Thank you (Trust pilot) without this review. This guy would have jerked me around longer than he did."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dale Healy",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T00:06:28.000Z",
          "Titre": "Rude petty & unprofessional",
          "Contenu": "Rude, petty & unprofessional. Not worth the wait. He Canceled my order, because I complained about sending me reviews on an item I didn’t receive. And I pay to have junk mail removed, yet this gets by."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "General BLanton",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T15:47:37.000Z",
          "Titre": "How can I give you a review and I have…",
          "Contenu": "How can I give you a review and I have not received the product that I ordered on April 12 as of May 12 still no product? Not sure how things fell thru the cracks would still like to get product if possible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don Watkins",
          "Nb_Reviews": 3,
          "Date": "2021-05-17T16:34:55.000Z",
          "Titre": "I was in the process of buying two…",
          "Contenu": "I was in the process of buying two radios.  The way this company operates is not to take any customer questions.  If you call you get voice mail saying mail box is full.  I finally got through via email and stated their business practice is less than desirable for a customer.  I got a very nasty response back.  I responded with that is not too smart to treat a customer like he did and then explained what good customer service.  After sever emails back with lots of F-bombs from the company and threats stating he has statement on his website that he would sue if I posted his remarks I had to block him from my email and proceeded to purchase two radios from Gigaparts which was a great experience.  I can't stress enough what a bad experience it was trying to do business with this company.  They can't stay in business long by treating customers the way they do."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Westveld",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T14:09:48.000Z",
          "Titre": "Seller will not reply to my emails…",
          "Contenu": "Seller will not reply to my emails requesting a return or exchange, even though they advertise a 30 day satisfaction guarantee"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Warren Kelly",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T12:35:14.000Z",
          "Titre": "Very rude, would rather have lesser product than deal with him.",
          "Contenu": "Beware, the previous review from Andre is spot on. You can even see it in his responses here. Mark has exclusive sales of a pretty well reviewed product and it seems the booming sales have gone to his head. I had inqured about canceling the order citing concerns about lack of information, and initially agreed to be patient even after is snarky response, but did let him know I did not appreciate it. His follow up response was what made me not want to do business with him. I wanted a part 95 certified product for my kid to get started with and followed the advice of a community icon to support a local American business. After all the radio is just a rebranding and part 95 certified version of one that can be had from many other places, and for much cheaper. He seems to pride himself on trying to make his customers feel stupid with thinly veiled remarks. His follow up remarks in both emails and via Paypal dispute (He wants to keep money for an incomplete order) have been increasingly disparaging, despite my respectful tones. Prime example of the Sad HAM mentality.The reason I refused the refunds was that he kept trying to short me on the amount refunded. This guy will say anything."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oscar Orozco",
          "Nb_Reviews": 3,
          "Date": "2021-11-03T09:11:17.000Z",
          "Titre": "Never received my order or any emails…",
          "Contenu": "Never received my order or any emails with the order status."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Dunford",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T07:55:33.000Z",
          "Titre": "Did not receive this item yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ray Wilcoxen",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T00:10:00.000Z",
          "Titre": "All items on backorder"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven W Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T00:06:35.284Z",
          "Titre": "Reason for poor rating is due to I have…",
          "Contenu": "Reason for poor rating is due to I have not received my order that was placedon March 14th."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Paschal",
          "Nb_Reviews": 1,
          "Date": "2021-09-04T18:34:44.000Z",
          "Titre": "2 stars so far",
          "Contenu": "2 stars so far, how can I review a product that I have not received yet.  Why would you send a link to review a product you have not sent?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Saunders",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T19:14:53.000Z",
          "Titre": "Not the Bee's knees for an expensive GMRS radio",
          "Contenu": "For a GMRS radio, especially for the high price, the UV9GX should be the bee's knees of this type of radio, but it isn't.  It might yet turn out to be, however, it will likely take me weeks and weeks to figure out how to use/program it via trial and error and as many YouTube videos as I can find because the instructions really stink!  They need to publish a thorough user manual that defines each icon and gives step by step instructions for performing the various operations and changing settings.  I likely won't buy another one.  At the price of this radio, there's no excuse for such poorly written user instructions.UPDATE 10/20/2023:  Well, I'm changing my rating from 1-star to 3-stars. Why - because after getting around to going back to the BSR web site to get the info on programming software/cables, I came across a download of the instructions and upon downloading, discovered that my main issue in the initial comment was resolved.  I found that on the UV9GX to help me figure out the menu items and how to select various features, I found another copy of the \"basic\" instructions. there were apparently more instructions that were not included in my order that arrived.  Seems that in my order, BSR left out the 2nd page of the instructions and that page that had most of the information I needed.  BSR said in their reply to my initial review, \"The quick-start manual that I wrote goes over most of the basics ......\".  Yes, it does, IF the customer gets both sheets of the instructions, however, as they admit, even with both sheets, it includes only \"most of the basics\" and I maintain that at the price point I had expected a better user manual.  Granted, not BSR's fault that I had this expectation. It was derived solely from seeing user manuals from other $150-$200 radio manufacturers.  In a personal email, BSR informed me that, \"While I do plan on producing some tutorial content when I have time (this is a one-man operation), to this point, I’ve chosen to spend my time on innovating and bringing these radios to market for a price that people like you can afford, and was hoping that over time, owners and affiliates would put out some useful tutorials.\"  Regarding creating a better user manual, he also said, \"Actually, it’s a skill in itself and very time-consuming to produce a cogent user manual. I welcome you to create a better one and keep the cost down to almost nothing so that the radio doesn’t cost $300 like the Japanese brands you spoke of. (I cited Yaesu and Icom user manuals as examples of good user manuals)\" As a one-man operation BSR has made a business decision to only provide basic instructions and that's certainly his call to make."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DH Lindsey",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T18:29:24.000Z",
          "Titre": "It is a poor business model to not hire…",
          "Contenu": "It is a poor business model to not hire enough people to handle the demand for your products. Operating as a 1-man business needs to be reconsidered. And resulting in customers to wait months for an order to be filled. Still haven't received order. UPDATE (05JUL2023): Still haven't received order. Mark, I never expected my order to get special treatment. A 3-star=average for my experience. I'm not sure why a 4 or 5 star is warranted. So far my experience is average from what I can tell. My original 1-star was to weigh in on the business model (which I felt was obvious). Hopefully, my order can now be processed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rexford Keranen",
          "Nb_Reviews": 3,
          "Date": "2022-06-16T04:37:06.000Z",
          "Titre": "I would love to leave five stars but…",
          "Contenu": "I would love to leave five stars but I’m still waiting for news on my order. The only correspondence I’ve received other than a receipt, has been these emails asking for my feedback. The other order on the programming cable was amazing. 10 out of five stars. Super fast, great price. Now if I could get my radio it will be the same"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WQJR",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T01:12:42.000Z",
          "Titre": "I'm not sure how to rate my experience.",
          "Contenu": "I'm not sure how to rate my experience.I'm still waiting for my Wouxun KG-UV9GX GMRS radio that I ordered 18 May. I will let you know when I get it.I hope it's the 12 weeks after ordering as expected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lee kremers",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T08:00:38.000Z",
          "Titre": "8 days since I placed an order for an…",
          "Contenu": "8 days since I placed an order for an “in stock” that still hasn’t shipped. I ordered the same item from another vendor a day latter and already have it in hand. Not happy with the timeliness of the shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike Senchy",
          "Nb_Reviews": 1,
          "Date": "2021-05-09T16:18:14.000Z",
          "Titre": "I still have not received my order and…",
          "Contenu": "I did not realize it was back ordered over 400 units.Very quick response to my review explaining what is going on very helpful.I guess I’m a little impatient looking forward to the new radio."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adrian Silva",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T20:17:01.000Z",
          "Titre": "Upset with the long wait to receive my order",
          "Contenu": "I can't give a honest review on the radio but I will share that I purchased my order approximately 45 days ago and have still not received it. Definitely not happy!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Cohen",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T01:00:35.000Z",
          "Titre": "DISSAPOINTED WITH SMILEY TRI BAND…",
          "Contenu": "MY ORDER WAS PROCESSED IN A TIMELY MANNER AND ALL ITEMS WERE CORRECTLY SHIPPEDONLY DISAPPOINTMENT-THE RECOMMENDED SMILEY TRI BAND ANTENNA DOES NOT SEEM TO PROVIDE ENHANCED PERFORMANCE VS. THE RUBBER DUCK INCLUDED WITH MY WOUXUN KG-UV9PX"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KwajSunflower",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T02:46:15.000Z",
          "Titre": "Mark seemed personable in the Emails",
          "Contenu": "Mark seemed personable in the communications. Problems with the orders were resolved quickly. However, this is NOT Amazon. Don’t expect quick or full refunds. Make sure you read the store terms and Mark follows them to the letter. You should know what to expect up front. If you return something, just know you will lose a portion of your money for open box, missing wire ties, missing plastic screw bags, DON’T TAKE THE PLASTIC OFF THE SCREEN! My only issue is that it took 18 days after receipt of my returned items to get a return acknowledgement, which said it could be 5-10 more days to get my money back to my credit card. I believe Mark is honest, above board and I would do business with him again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EyeGuy",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T00:53:26.000Z",
          "Titre": "I got my radio…",
          "Contenu": "I got what I ordered and am very satisfied with the radio. The shipping was slow. I paid for an upgraded priority mail shipment which took over a week to be delivered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brent",
          "Nb_Reviews": 2,
          "Date": "2023-01-31T05:49:05.000Z",
          "Titre": "Unrealistic shipping time expectation",
          "Contenu": "Unrealistic shipping time expectation. When I ordered, it said 10+ weeks. Later this time frame increased all the way to 16+ weeks, and as I write this review, 15+ weeks. It took 26-27 weeks, about a half year, before receiving my radio. I suspect the company could track their shipping rate of particular products and get a more realistic estimation. I did this myself tracking my order number compared to the shipping order range numbers shared on the main web page over time. The graphed data predicted that I would get my radio in about a half year, and it proved to be true. I do appreciate that the raw shipping rate data was somewhat transparent so I could calculate it myself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris  Rutherford",
          "Nb_Reviews": 2,
          "Date": "2022-06-01T14:17:40.000Z",
          "Titre": "extended shipping times, but worth the wait",
          "Contenu": "The radio arrived a little later than expected, but faster that other companies. The radio was in perfect condition and extremely well packaged. The radio was sealed in a zip seal bag to protect it from the elements which is more than I expected. I am a fan and will be ordering from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jose Cueva",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T16:05:17.000Z",
          "Titre": "Service to date regardless of subject…",
          "Contenu": "Service to date regardless of subject matter has been extremely good. No issues, complaints or concerns. I would encourage others to look into Better Safe Radio for their personal needs. There good!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T18:57:43.000Z",
          "Titre": "Great radio, long backorder",
          "Contenu": "I got a great radio and love all the preprogrammed info in it and overall am very happy with my purchase.  However, it was very hard to follow the order number scheme on the website and keep track of where I was in cue for my purchase.  It ended up being on backorder for almost 13 weeks. Again, great radio."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Vetor",
          "Nb_Reviews": 3,
          "Date": "2023-07-07T14:56:17.000Z",
          "Titre": "Sales",
          "Contenu": "Sales, packaging was excellent. Communication with them has been great. I would definitely buy from you again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T16:36:14.000Z",
          "Titre": "Love the radio but erased the settings…",
          "Contenu": "Love the radio but erased the settings that were installed. Totally my fault. So I spoke with better safe radio about a fix and they told me to order the programming kit wHich I did. After installing, I have channels back but it is not like when I purchased it?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick Akkerman",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T16:14:57.000Z",
          "Titre": "Mark was great to work with",
          "Contenu": "Mark was great to work with. I made mistakes with my order that Mark helped me correct. I am not computer savvy so I felt the web page a small bit of a challenge as I have my zoom setting advanced to +150."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-09-06T21:28:53.000Z",
          "Titre": "Really liked that he updated order…",
          "Contenu": "Really liked that he updated order status on the website. Although I waited longer for the radio than was projected. Radio is pretty good for a Chinese product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T14:05:45.000Z",
          "Titre": "I very much like the KG-916",
          "Contenu": "I very much like the KG-916: Though I noticed when the battery is in place, it has a slight wiggle installed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arline Lovell",
          "Nb_Reviews": 3,
          "Date": "2022-09-02T17:04:17.000Z",
          "Titre": "Long wait for radio to arrive but…",
          "Contenu": "Long wait for radio to arrive but excellent response from BSR to questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald OC",
          "Nb_Reviews": 2,
          "Date": "2022-10-02T00:39:21.000Z",
          "Titre": "Purchase of Wouxun, KG-UV9G X...Except for a four month",
          "Contenu": "Except for a four month, eleven day wait time, I'm satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geoffrey Peters",
          "Nb_Reviews": 2,
          "Date": "2022-04-04T06:05:02.000Z",
          "Titre": "Local fire services not programmed but…",
          "Contenu": "Local fire services not programmed but radio is great. Lots of national emergency frequencies."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T02:49:16.000Z",
          "Titre": "Remember...",
          "Contenu": "Would be unfair for me to blast the company. Radio has a glitch. Works just quirky. In the end remember this. Save every part of your package including the box, bags, Styrofoam, twisties, lint, wrap... Can't get warranty without it. Four stars for  going above to help. Wish I could have spoken to someone on the phone would have been quicker than two days of emails but that’s that. Overall satisfied. Just wish I knew about the packaging BEFORE I threw it out. Would buy from again. Custom service definitely deserves the stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward Hennessey",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T17:30:07.000Z",
          "Titre": "It's a little early to do a review…",
          "Contenu": "It's a little early to do a review because my order hasn't arrived. But, with that in mind, BSR advises people on their web page about out of stock orders. And that's a plus."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phillip",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T20:59:37.000Z",
          "Titre": "It took a while but I'm glad I got a…",
          "Contenu": "It took a while but I'm glad I got a great product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Nye",
          "Nb_Reviews": 4,
          "Date": "2022-07-05T17:00:19.000Z",
          "Titre": "Radio is back ordered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vernon McIntyre",
          "Nb_Reviews": 1,
          "Date": "2021-09-17T21:39:47.000Z",
          "Titre": "I was glad to see the radio as I knew…",
          "Contenu": "I was glad to see the radio as I knew it was in high demand. you got it out and to me in short order. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Ukrop",
          "Nb_Reviews": 1,
          "Date": "2021-03-16T21:04:55.000Z",
          "Titre": "KG-uv9g pro",
          "Contenu": "Looks like a good product, service is top notch, but have not received my radios yet so cannot give a full review"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James V",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T16:23:07.000Z",
          "Titre": "Shipping",
          "Contenu": "Shipping, and email notifications were timely and accurate.  Arrived in good condition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C Wayne Rhodes",
          "Nb_Reviews": 1,
          "Date": "2021-08-01T02:24:14.000Z",
          "Titre": "Took awhile to get my radio but the…",
          "Contenu": "Took awhile to get my radio but the delay was understandable and was kept up to date via email."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jaime martinez",
          "Nb_Reviews": 1,
          "Date": "2021-09-20T07:11:21.000Z",
          "Titre": "Exelent service and professional…my great GMRS OPTION",
          "Contenu": "Exelent service and professional recommendation for the extra antena for my radio"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Howard",
          "Nb_Reviews": 3,
          "Date": "2021-04-29T16:59:35.000Z",
          "Titre": "Have not received radio yet!",
          "Contenu": "Have not received radio. I will change rating when receive radio."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Galloway",
          "Nb_Reviews": 3,
          "Date": "2021-08-04T20:09:10.000Z",
          "Titre": "Shipping was fast",
          "Contenu": "Great communication, waiting on radio shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Montgomery",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:30:44.000Z",
          "Titre": "Pleased with the whole operation",
          "Contenu": "Received the two Wouxun UV9GX with accessories in about three weeks from ordering.  Considering these had to be programmed, burned-in, and tested, I think that is a fair amount of time.  The packaging was suitable to protect them, and the batteries were charged to about 80% or so.  Ready to go right out of the box.The manual is two printed pages, front and back, and adequate to get going.If anything could be improved, I would encourage a more robust manual, and maybe a quick example or two: Tuning in a NOAA weather station; tuning in an Aircraft band (using one of the regional ARTCC freqs). Setting up to scan a specific bank.Mostly for novice \"get started\" type stuff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Norwood",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:33:35.000Z",
          "Titre": "I got everything I ordered in a timely…",
          "Contenu": "I got everything I ordered in a timely manner. I like that the radio came with best display-yellow letters and black background- programmed in the radio. It’s easy to turn the knob to all the GMRS channels. I just need to learn how to use all the other features. A how to video would be helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Pruna",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T06:32:57.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer service. Nice electronics..cool radios.Many choices. And...They answer the phone and you get to talk to a real actually nice person with lots of knowledge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roy B.",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T16:52:04.000Z",
          "Titre": "Great experience and the preprogrammed…",
          "Contenu": "Great experience and the preprogrammed radio was great.  Turn it on and talk.  Doesn’t get better than that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:37:01.000Z",
          "Titre": "Great Service!",
          "Contenu": "Great Service! The uv9gx radio works Excellent and very fast shipping, I hope you get your car back tnx Mark! Merry Christmas!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Qualls",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T14:40:04.000Z",
          "Titre": "Excellent products and pricing / excellent support",
          "Contenu": "I purchased two Wouxun KG-916 GMRS radios from Mark, BetterSafeRadio for under $100 each.  I thought this was an excellent price for an excellent product.  I subsequently purchased a red programming cable (recommend purchasing the cable when buying the radios).  I had a problem getting the programming software to connect to the radios.  Mark responded promptly to my support request via email message.  His tips enabled me to connect to the radios and program them.  I highly recommend BetterSafeRadio."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JACK PETERSON",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T20:17:17.000Z",
          "Titre": "I placed an order at 9:50pm on a Friday…",
          "Contenu": "I placed an order at 9:50pm on a Friday night, recieved a USPS tracking number at 1:06am that Saturday morning, and shipped from CA to WI, receiving it on Tuesday at 10:26am. WOW, that's incredible service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bear Rivers",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T12:16:36.000Z",
          "Titre": "Mark is great",
          "Contenu": "Mark is great. Radio functions as it should. Everything was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hunter Gibson",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:17:10.000Z",
          "Titre": "Great job adding a discount after…",
          "Contenu": "Great job adding a discount after purchase and catching that I had got an item for another model HT! Great job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph B",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:06:45.000Z",
          "Titre": "Great experience",
          "Contenu": "Order was acknowledged immediately on the weekend and received only a few days later.  Excellent experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MHA",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T00:09:53.000Z",
          "Titre": "Fairly quick customer service reply…",
          "Contenu": "Fairly quick customer service reply considering the holiday season. Addressed and answered all of my questions with additional tips and advice. Prompt delivery of merchandise within the state. Happy with product just have to learn its operation and shortcuts. Will consider other purchases with this company moving forward. 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Clifton",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T03:53:48.000Z",
          "Titre": "Not only did the radio arrive ahead of…",
          "Contenu": "Not only did the radio arrive ahead of schedule, the customer support I received afterwards was prompt and efficient.Both the radio, and the service, exceeded my expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond Gellatly",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T05:50:48.000Z",
          "Titre": "BetterSafe experience…",
          "Contenu": "Better safe not only provides great products and service but also a learning experience to all levels of interest in Radio, preparedness and electronics"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T. Sanden",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T20:16:51.000Z",
          "Titre": "I've been into GMRS for a while now and…",
          "Contenu": "I've been into GMRS for a while now and I usefully buy the cheaper GMRS radios (Tidradio, Baofeng). But I finally decided to get the UV9GX and the smiley antenna and this is by far the best GMRS radio I have purchase. I will be purchasing more from BSR."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Crystal P",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T15:59:39.000Z",
          "Titre": "Welp I truly wasn't expecting to…",
          "Contenu": "Welp I truly wasn't expecting to receive my radio so fast. Even my husband was surprised because he also has 1 or 3 and they didn't come nearly as fast. This is my 3rd radio as well and didn't I expect how fast it would arrive, thank you for being efficient in your turnaround process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Christmas",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T12:27:44.000Z",
          "Titre": "Fantastic buying experience",
          "Contenu": "It isn't often in this day an age that you have the absolute pleasure with working with such a great vendor. The buying experience was seamless, the shipping was fast and BSR not only answered all the questions i had but offered guidance in getting things going as a new radio user. Will look forward to doing business again in the future. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pax Hawthorne",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T22:18:53.000Z",
          "Titre": "Mark goes the extra mile to assure a…",
          "Contenu": "Mark goes the extra mile to assure a positive customer experience. This includes quick concise easy to understand answers to any questions you may have to carefully protected packaging for safe shipment. Wouxon is most fortunate to have Better Safe Radios represent and distribute their products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Siegers",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T02:00:48.000Z",
          "Titre": "Excellent service!",
          "Contenu": "Excellent service from Mark, I had an issue with USPS not delivering my package. Mark was very responsive to my email and was willing to help and escalate if needed! All is well and USPS delivered my package. Quality products and will not hesitate to buy BSR again! Thanks - Sean"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frederick Voss",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T16:19:26.000Z",
          "Titre": "Great Experience with BetterSafeRadio.com",
          "Contenu": "I had a very good experience with my purchase at BetterSafeRadio.com.  The website was easy to use and ordering was easy.  When I encountered a problem with the USPS delivery I contacted Mark and he replied almost immediately and offered suggestions.  My purchase was delivered two days later via USPS.I wish BetterSafeRadio.com used UPS or FedEx instead of USPS.  The mail delivery system is clearly as inefficient as the government."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Mills",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T03:47:38.000Z",
          "Titre": "Better Safe Radio satisfied customer",
          "Contenu": "I purchased a Wouxun KGUV9GX Radio/scanner. Awesome product!!! Better Safe Radio’s customer support after my purchase was top notch. I had a few technical questions regarding programming my radio. They responded to my emails promptly and answered my questions clearly. My radios battery broke a week after receiving it due to a fall at just the right angle. Though the battery was not under warranty, they did what they could to assist me with getting a new battery. I left a positive review on the YouTube Channel “Notarubicon”, where I discovered the radio, detailing my positive experience. I will be ordering from them again as well as giving my full recommendation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ethan",
          "Nb_Reviews": 3,
          "Date": "2023-10-20T02:57:01.000Z",
          "Titre": "Great experience, will buy more from BSR!",
          "Contenu": "I found a great radio with tons of programming from BSR, at a great price. Got the radio quickly and was impressed by how many preprogrammed channels there are. Customer service was great! Dunno what more you could ask for"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carmine Zambrotto",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T07:04:33.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Got excellent service and great quality on handheld gmrs radio Pro model to regular and professional for a 5/8 wave Smiley antenna where's your battery to them people that were very professional very common have no complaints no issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARKC",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T01:46:15.000Z",
          "Titre": "Perfect customer experience!",
          "Contenu": "I love doing business with this company! The amount of time and energy even put a response Mark sent me 2 years after purchasing a product from him shows how much Mark actually cares about customer service and his customers. The fact that I even know his first name and have only done business with him remotely says something itself!  He truly takes the time to make sure he answers your questions, addresses your problems and are happy with his products. If I even need additional products from him, I'll come here first to buy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elias Quinonez",
          "Nb_Reviews": 2,
          "Date": "2023-05-20T15:32:09.000Z",
          "Titre": "Customer service is #1 with B.S.R.",
          "Contenu": "GREAT CUSTOMER SERVICE !!!!!Hello all, i placed an order with BETTER SAFE RADIO that is on back order and while waiting for said order i realized that i ordered  the wrong item!   So i sent Mark an email explaining my situation and mark replayed \"immediately\" in less then 1 day with a quick solution without any delays or issues what so ever !!   Thank you Mark for the great costumer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Forbes",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T20:45:52.000Z",
          "Titre": "Radio works well",
          "Contenu": "Radio works well. I enjoy the scanning option. I find myself listening more than normal. Because I don’t normally listen to scanners. Communication is good. I do get a high pitch when transmitting with a bnc connection in use. But I like the low, medium and high power ratings."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BOBO",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T23:27:21.000Z",
          "Titre": "CONGRATULATIONS BSR",
          "Contenu": "CONGRATULATIONS!  To everyone at BSR, And especially Mark. BSR team programs and sells  the best Prepper GMRS SHTF Equipment in America. Thanks for being so patient with an old guy like me that struggles with new technology. I got my KG-UV9GX and now able to communicate with the other old dudes out there in the desert, This Radio is soooo coooool ! I'm going to recommend BSR to everyone in the future. Again ! BSR is TOP NOTCH ! Hoochmakr WRVT 945"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "charles",
          "Nb_Reviews": 7,
          "Date": "2023-08-04T16:12:00.000Z",
          "Titre": "The company provides a quality product, and accurate information.",
          "Contenu": "The company provides a quality product that rivals other more expensive radios. I wanted to speak with a sales person before purchase but their email response was quite good with good honest replies. I recommend doing business with them and I plan to in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Thumb",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T06:47:18.000Z",
          "Titre": "Awesome",
          "Contenu": "Awesome, the whole idea of the website and accessories to go along with the radio equipment is awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TimH",
          "Nb_Reviews": 3,
          "Date": "2023-09-22T03:37:15.000Z",
          "Titre": "When you're on the learning curve with…",
          "Contenu": "When you're on the learning curve with GMRS or HAM radios, it's very nice to have excellent support available.  I have purchased a couple radios from them so far and their support is beyond just good, it's excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Williams",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:16:51.000Z",
          "Titre": "Prompt delivery",
          "Contenu": "Prompt delivery, the data supplied with to platform was excellent Rad... Will be purchasing again..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrei",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T01:37:32.000Z",
          "Titre": "A+ hardware AND A+ service!",
          "Contenu": "Well, first BetterSafeRadio sells the \"ultimate\" (for the time being) GMRS radio: the KG-UV9GX.  Second, I have found Mark *very* helpful: his replies come very quick, and he will troubleshoot any issue swiftly.  I highly recommend BSR to everybody!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mack Anderson",
          "Nb_Reviews": 4,
          "Date": "2023-07-05T00:20:55.000Z",
          "Titre": "I appreciate that my radio (s) were pre…",
          "Contenu": "I appreciate that my radio (s) were pre programmed and thats the reason I went with Better Safe Radio. The process was so simple. I guess the only criticism I can have is that it would have been good to get the list of programmed changes to the Wouxun radios that I purchased.  I’m impressed with the radios and being new to all of this I am still learning as I study for the technician exam. Thanks for the great radios."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David S.",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T04:50:29.000Z",
          "Titre": "They carry everything I need",
          "Contenu": "They carry everything I need.  Everything I have ordered arrives in perfect condition and is very high quality! A full set of Wouxun KG-UV9GXs with accessories and extra batteries to round it out.  As soon as back ordered items come in, they get them shipped correctly and immediately!I am TREMENDOUSLY HAPPY with all the products and customer service I have experienced with Better Safe Radio!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cullen M",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T14:49:45.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I ordered the wrong part by mistake for my antenna. When I reached out to Better Safe Radio, the owner/consultant, Mark, offered a few options for me to consider. Since the connector I ordered can be used on a future radio, I ordered the correct version and kept the other. THAT is great customer service and I appreciate Mark’s thoughtful and friendly approach  in finding a solution.I will definitely come back and order a new radio from BSR in the near future. Thank you, Mark and Better Safe Radio!Cullen M (WRUL417)"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Christopher Mercado",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T04:43:09.000Z",
          "Titre": "Seller knowledgeable",
          "Contenu": "Very fast shipping and you can contact the seller (Mark) with any questions and he will always help out with anything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ChrisC",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T06:09:39.000Z",
          "Titre": "Service was good",
          "Contenu": "Service was good. I purchased a backordered radio (10 weeks). I felt I was well informed of where I was at in the process, including where I was at in line, order processing and shipping. The information provided by BetterSafeRadio kept my anxiety at a minimum as I waited for my purchase. Would order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Dvorsky",
          "Nb_Reviews": 2,
          "Date": "2023-02-01T22:35:45.000Z",
          "Titre": "I just received a KG-UV9GX and two…",
          "Contenu": "I just received a KG-UV9GX and two Smiley antennas. A few hours after the radio was delivered, I told Mark my experience with my KG-UV9D Mate didn't apply as much as I had hoped. However, it was more a case of working with the UV9GX uncovered a few things that were undiscovered with the Mate, but still applied to both. The UV9GX along with the new Slim Duck is a great combination, and certainly recommend it. The Tri-Band antenna on the Mate was only a marginal improvement over stock, but still like it. The package was delivered on time, as promised. Despite the mild disappointment with the Tri-Band antenna, my experience gets 5 stars.+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elias Quinonez",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T08:20:35.000Z",
          "Titre": "B.S.R. #1 when it comes to customer satisfaction!",
          "Contenu": "Great Customer service, I purchased  the KG-UV9PX and love this radio and everything it does, I had a programming issue that i needed help with and Mark responded to my email for help immediately with the solution to the issue that i was overlooking on my part being that i am new to ham radio.   B.S.R. Stands behind and supports the products they sale!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Nance",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T16:35:05.000Z",
          "Titre": "Great products and support",
          "Contenu": "Great products and support from bettersaferadio. I made a mistake in my order, misunderstood the specs of a product, and Mark reached out via email to get me back on the right track. My GMRS radio has performed flawlessly and the features that BetterSafeRadio added to the Wouxon radio make it perfect for my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly  Cantrell",
          "Nb_Reviews": 6,
          "Date": "2023-02-25T04:28:02.000Z",
          "Titre": "Received my order in packaging for a King",
          "Contenu": "Mark was awesome he helped me order accessories that I forgot to include in my original order then when I received my Wouxun KG-UV9GX in 6 months he packaged it perfectly like it was gold bullion. And he helped me with questions on how to program the darn thing. Great experience accept for the wait, but it was worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "timbo",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T15:43:02.000Z",
          "Titre": "New to ham and just purchased UV9PX",
          "Contenu": "New to ham and just purchased the new px with programming cable. This level of customer service and knowledge is rare these days. Chris took time to answer all my questions. When my package was opened I could tell the product had been personally prepped and I knew it would work properly. All the pre-programming is there and it is assuring to know that Chris would take care of any future needs. He also advised me of the upcoming black Friday sale however I choose to order early for personal needs. Thanks so much Chris"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd R.",
          "Nb_Reviews": 2,
          "Date": "2023-01-17T15:15:19.000Z",
          "Titre": "Very happy with my Wouxun UV9PX",
          "Contenu": "Very happy with my Wouxun UV9PX.  As a new tech, I found it great that it not only has its own software, but also can be programmed by chirp, which gives me a lot of practice with both software.  I had an initial problem with it a driver not installing properly and got excellent help from better safe radio very quickly.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Dvorsky",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T10:49:44.000Z",
          "Titre": "Another Great Wouxun Radio",
          "Contenu": "My KG-UV9GX arrived yesterday, a day earlier than expected. Everything was good. Nothing was broken. This new Wouxun is a welcome addition to my GMRS system.This now includes two KG-UV9GX radios, a KG-S88G, and the KG-XS20G and KG-1000G mobile radios. Got quite the GMRS system if I may say so."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FMJ",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T05:57:57.000Z",
          "Titre": "I recommend Wouxun KG-UV9G PRO GMRS Two-Way Radio & SHTF Scanner!",
          "Contenu": "I did a lot of research into different types of radio as a way to have a backup in case the grid goes down or some other natural disaster makes it hard to communicate. Having no experience in radios at all, I determined that HAM was too much for me so I landed on GRMS. That search led me to Better Safe Radio’s site wherevo learned a lot. Getting a new Wouxun KG-UV9G PRO GMRS Two-Way Radio & SHTF Scanner that came programmed was a God send! I received my Wouxin in a reasonable time and at a great price. I needed that head start of the programming being already set up. I’ve already ordered a few more accessories, and I hope to order a second Wouxin soon for my girlfriend. No communications solution is perfect, but this gives me peace of mind knowing I have more than one option."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ossie Weinert",
          "Nb_Reviews": 2,
          "Date": "2022-11-26T01:26:04.000Z",
          "Titre": "Fantastic Service!",
          "Contenu": "I preordered a WOUXUN KG-UV9G PRO and as soon as the new shipment arrived at Better Safe Radio they had it in the mail and I received it in three days! I sent an e-mail for information on the software download and got a very helpful answer the same day! Fantastic service! Thank you, Mark! Sincerely, Ossie/WRUS-372"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VLADIMIR Boshevski",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T15:59:08.000Z",
          "Titre": "e111🤟👍👍👍👍👍🤟👍👍👍🙋‍♂️arned I have no comment I got what I…",
          "Contenu": "earned I have no comment I got what I wanted the best radio at the moment on the market and the only thing that bothers me and I know that other people who order are bothered by the delivery time.Company  BetterSaveRadio vith Mark is going good job 👏 👍👍👍👍👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aubrey Tucker",
          "Nb_Reviews": 3,
          "Date": "2023-02-09T07:26:03.000Z",
          "Titre": "My First GMRS Radio",
          "Contenu": "Bought my first GMRS radio for hunting and the GMRS radio phenomena !! After a bunch of research, I decided to go with BSR (BetterSafeRadio) for the plethora reasons. I would rather deal with an individual small business than get the same radio from Big Box Sites. BSR is praised on social media outlets for  customer service and custom programming. They are True to their Word. Mark at BSR helped and guided me through the entire process to include personal input on my decision process on my first Radio. All and all the customer service is Outstanding and I am the proud owner of a Wouxun KG-UV9GX GMRS Radio. Great Products with excellent support and extreme knowledge of product. I am very pleased with my purchase and will continue to shop at BSR for my GMRS radio needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. GM Goodwrench",
          "Nb_Reviews": 3,
          "Date": "2023-04-13T16:45:48.000Z",
          "Titre": "Support is Everything",
          "Contenu": "Buying a quality product if all you concern yourself with until you may need support.Fortunately this company has both. This Support Team is one of the best I've ever dealt with. I needed support for a new HT concerning what I thought was an antenna problem. After many emails conversations and I'm sure it was painful for the support  to go thru this with me they never blinked an eye. They helped me without making me feel uncomfortable and got everything solved and got me up to speed.I never had to wait to get support, and something was accomplished every email until we were done.Even though this is a smaller operation they give big service and that puts them at the top of the list for my next purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Haven Beat The Street",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T04:21:51.000Z",
          "Titre": "The bottom line is this....",
          "Contenu": "The bottom line is this....Mark sells great radios and he is a stand up guy. The back order time is long but everyone knew that when they ordered and it isn't Mark's fault. It is a supply chain issue plus the popularity of the radios that he sells. I have purchased and received the KG-UV9G Pro and it is the best GMRS radio I have ever purchased and it is my favorite so far. I am waiting on the UV9GX and I know it will also exceed my expectations. So stop complaining."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colin Smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T02:22:49.000Z",
          "Titre": "Good prices and fast shipping...",
          "Contenu": "Good prices and fast shipping.... that's why I made my first and second orders for my two Wouxun UV9PX's. Awesome radios, thanks again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian M.",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T18:13:36.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Mark went out of his way to pull an antenna from another order (that had a radio backordered) in order to ship my radio and antenna to me.  Quick responses to my inquiry and fast action taken to ship my order.  Some of the best customer service that I have experienced.  Highly recommend Better Safe Radio."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stew C",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T22:44:29.000Z",
          "Titre": "Service was great and they were happy…",
          "Contenu": "Service was great and they were happy to answer any and all questions I had being not savvy with radios. Shipping times were longer than expected but was no problem even adding to my order later to save on shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shane Barton",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T01:39:40.000Z",
          "Titre": "Every order with BSR has been great.",
          "Contenu": "Every order I place with BSR has been handled promptly and shipping updates sent in a timely manner.  I did have 1 order with an issue, emailed BSR and within an hour received a reply.  The situation was resolved and I am very happy with my purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roy E",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T03:14:16.000Z",
          "Titre": "A Quality Experience    “I ordered multiple products and they…",
          "Contenu": "“I ordered multiple products and they all arrived rapidly except one product that is outrageously popular and had to be B/O’d.  I’m confident this will be shipped and arrive in the order of it’s purchase.  All of the products I purchased are of great quality.”"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TimH",
          "Nb_Reviews": 3,
          "Date": "2023-09-08T06:25:25.000Z",
          "Titre": "I haven't had and issues with orders or…",
          "Contenu": "I haven't had any issues with orders or support.  They have been prompt in every aspect.   No matter how small it is they got right back with me with solutions.  If they sell the radio or equipment, that's where I will buy it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Maler",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T17:20:41.000Z",
          "Titre": "A gem of a Radio Shop.  Worth It!!",
          "Contenu": "Very Happy all around, Amazing communication and quick shipping.  From now on If I want to buy a radio or programming, I'm using Better Safe Radio.  Very happy with my UV9G and the additional SHTF programming is definitely worth it.  I enjoy programming my radios and searching RR but Marks programs are tops. I bought a radio and programming for another radio I own."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Koopmans",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T01:39:40.000Z",
          "Titre": "Super responsive",
          "Contenu": "Super responsive!  I had a technical question on a specific way I wanted my radio to operate, and Mark had the answer.  Do yourself a favor.  Stop buying cheap radios and step up to a radio with Superheterodyne circuitry.  The difference is night and day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Reichter",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T12:57:53.000Z",
          "Titre": "Prompt delivery of the adapter I needed…",
          "Contenu": "Prompt delivery of the adapter I needed to be able to completely use all of the functions of my Surecom 102 SWR meter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrian Flores",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T01:37:37.000Z",
          "Titre": "Mark is very helpful and knowledgeable…",
          "Contenu": "Mark is very helpful and knowledgeable about his products. He gives triple “A” customer service.I will be a returning customer for my next ham radio needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rogelio Cavazos",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T18:22:24.000Z",
          "Titre": "Awesome customer service and sales! My go to company for future purchases.",
          "Contenu": "This company has a great reputation in customer care and in sales. I received my radio quickly and in perfect new condition. Will be making more purchases in the future. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Trask",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T19:08:01.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Contact is made by email.  Responses are fast.  I had a few questions about my order and product and they were answered usually within a hour or less.  I would highly recommend this company if they have what you are looking for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ezra Griffin",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T20:39:39.000Z",
          "Titre": "It is a great product it’s very easy to…",
          "Contenu": "It is a great product it’s very easy to operate great communication within 5 miles I wish there was a physical phone number to contact someone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Hall",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T03:38:37.000Z",
          "Titre": "Product was as advertised and good…",
          "Contenu": "Product was as advertised and good price. Company was responsive to questions. No issues.  Will make future purchases from this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew L. Stanley",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T00:47:26.000Z",
          "Titre": "Exceptional Customer Service!",
          "Contenu": "I submitted an order for a particular GMRS Radio in error.  I reached out to Mr. Mark Lindsey – K6LED / WQXR567 at Sales_BetterSafeRadio.com and asked if my order could be modified.  I received an affirmative response on the next business day (a Monday!), with technical advise related to accessories that would ensure my satisfaction with the GMRS Radio that I really wanted.   Mr. Lindsey was up front on backorder times and an additional investment for my complete order.  He then provided clear instruction for settlement for the additional charges through PayPal.  Mr. Lindsey was prompt in responding to my request, provided excellent counsel for an an enhanced GMRS experience, and the checkout process was efficient.  I recommend BetterSafeRadio - Thank you Mr. Lindsey!~Matt (WRVL973)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Mitchell",
          "Nb_Reviews": 4,
          "Date": "2023-08-18T00:43:45.000Z",
          "Titre": "Wouxun KG-UV9PX 2 are better than one.",
          "Contenu": "My first purchase of a Wouxun KG-UV9PX went so smoothly I decided to buy another one. Great communication. Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T04:54:02.000Z",
          "Titre": "Products are great and moreover is the…",
          "Contenu": "Products are great and moreover is the customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Mackenzie",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T06:13:00.000Z",
          "Titre": "Personal customer experience",
          "Contenu": "BSR contacted me about an order that they couldn’t completely fill due to an item being out of stock. I was contacted personally and asked if I would substitute for another item and the order was completed and shipped out immediately."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vincent",
          "Nb_Reviews": 3,
          "Date": "2023-05-06T00:31:35.000Z",
          "Titre": "No question... AWESOME!!",
          "Contenu": "Although I haven't received my most recent order yet, I've NEVER had an issue with Better Safe Radios. And through multiple orders their customer service has always top tier!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "C Kreps",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T19:33:34.000Z",
          "Titre": "Shipping to the UK",
          "Contenu": "In spite of complexities involved with using a third party for international shipping (Stackry were very good by the way) the transaction went well and the radio is excellent. Mark was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fabien",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T15:23:01.000Z",
          "Titre": "Awesome experience",
          "Contenu": "The president/CEO of the company was very willing to help me, and listened to my suggestions on how to make a radio better accessible for the blind like myself. I would definitely recommend this company, since they sell very good quality radios. These radios are on the more expensive side, but they are definitely worth it in my opinion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ricardo Flores",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T03:07:10.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Im really looking forward to another purchase once the new Ham Radio or GMRS radios models arrive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Siverson",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T15:12:44.000Z",
          "Titre": "Outstanding service",
          "Contenu": "I received the product in a timely manner.  Afterday a day, I had a question and emailed it that afternoon and that same evening, well after hours I received the answer.  I was highly impressed to say the least."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ole Smokey",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T04:33:44.000Z",
          "Titre": "Mark was very patient at answering all…",
          "Contenu": "Mark was very patient at answering all of my questions and helping out in any way that he could. The UV9PX has been with me every day and it hasn’t let me down. If you’re on the fence about getting it, just do it, you won’t regret it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHN W",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T03:49:04.000Z",
          "Titre": "Great service!",
          "Contenu": "Great service!Informative website, and quick to respond when I had a question about my order.  Will be purchasing from BSR again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vlade",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T20:16:49.000Z",
          "Titre": "I heave  KENWOOD TK-8302HU-1 50watt",
          "Contenu": "I heave  KENWOOD TK-8302HU-1 50wattAnd baofeng uv-9g  5watt.I ordered  August 2.2022Wouxun KG-UV9GX and I CAN'T WAIT TO RECEIVE IT. I have never used this radio but I feel that it is one of the best made for this purpose. It seems to me that it is the best for now on market.I would like to thank the company and especially Mr. Mark, who is responsible for ordering radios and all related accessories.Superhetrodine  Wouxun KG-UV9GX. I hope to get the radio by the end of the month, so I will write a new comment when I open it and use it.Best regard 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T16:43:26.000Z",
          "Titre": "Beside the backorders Better Safe Radio…",
          "Contenu": "Beside the backorders Better Safe Radio is the place to get all of your GMRS supplies. Service is outstanding reliable and top notch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry, TwiceCrackedCoffee.com",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T14:25:56.000Z",
          "Titre": "Wow!",
          "Contenu": "I first discovered better safe radio.com through a YouTube video reviewing the specific radio that I purchased. After considering it for a week or two and looking at more reviews of this particular radio and more customer reviews being very positive I decided to reach out to mark at better safe radios and ask him a few questions. Very helpful very knowledgeable I have never quite dealt with an individual that was so steadfast and taken care of their customers as I have found in mark. If there's any question or concern about customer service or the quality of their equipment, don't even hesitate to give better safe radios a shot at your business. What an outstanding organization to deal with, thank you Mark for the continued questions after the sale!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Ramsey",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T02:54:33.000Z",
          "Titre": "Buying Experience great",
          "Contenu": "Mark was very helpful when purchasing the radio and the accessories. Recommendations were much appreciated. Arrival time was as expected as well. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emeka",
          "Nb_Reviews": 7,
          "Date": "2023-05-05T13:20:30.000Z",
          "Titre": "GMRS scanner",
          "Contenu": "Fantastic, the product was just as its description. A perfect SHTF scanner for preparedness. Good things come to those who wait."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Kellerman",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T18:22:51.000Z",
          "Titre": "Good place to spend your hard earned money.",
          "Contenu": "Great products and were delivered BEFORE expected.  Will for sure use them again if I buy more radios or related products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Laco",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T20:11:59.000Z",
          "Titre": "It is worth the wait.",
          "Contenu": "Even though they were backlogged, the UV9GX was well worth it. When it arrived, I was listening to it non stop. BSR kept you updated on when it would arrive. I will defiantly be ordering from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Cummins",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T15:53:32.000Z",
          "Titre": "Great first time experience.",
          "Contenu": "Great information and detail on products. Quick shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B Upton",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T14:34:32.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping. Quality radio. Unique radio options led me to BSR. Very pleased."
        },
        {
          "Note": 5,
          "Lieu": "QA",
          "Pseudo": "James Slater",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T18:03:16.000Z",
          "Titre": "Everything was super simple and easy to…",
          "Contenu": "Everything was super simple and easy to find.  Very informational and professional.  They will certainly meet your radio needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Ford",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T22:27:04.000Z",
          "Titre": "Ordered a new handheld games radio just…",
          "Contenu": "Ordered a new handheld games radio just after Christmas and it showed up really quickly. I’m going back o be buying a mobile unit soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T00:22:39.000Z",
          "Titre": "Fast shipping and great customer…",
          "Contenu": "Fast shipping and great customer service! They even attached the belt clips. ⭐⭐⭐⭐⭐"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Cusator",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T00:50:18.000Z",
          "Titre": "New Wouxun UV9GX",
          "Contenu": "I recently received the new Wouxun UV9GX setup for SHTF scenarios. The radios arrived with excellent packaging and instructions. This is the only place to by your SHTF radios with excellent programing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek",
          "Nb_Reviews": 4,
          "Date": "2023-01-07T23:51:59.000Z",
          "Titre": "He was very honest with me concerning a…",
          "Contenu": "He was very honest with me concerning a situation that happened. He also made Accomodations for me with a recent purchase I had made."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Hill",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T10:44:13.000Z",
          "Titre": "Great experience. Highly recommend BSR",
          "Contenu": "Just getting into GMRS radio and found BSR (Mark) to be very informative and responsive to all of my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T03:01:00.000Z",
          "Titre": "Questions are answered quickly",
          "Contenu": "Questions are answered quickly. Orders are exactly as described and shipped fast! Great company to buy from."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2022-12-01T23:41:49.000Z",
          "Titre": "Excellent radio and service",
          "Contenu": "Ordered a UV9PX from the website, came promptly, well packaged, worked as advertised, lots of extras in the custom programming."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Gulick",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T18:05:13.000Z",
          "Titre": "The radio is high quality",
          "Contenu": "The radio is high quality. The pre-programming is very value added and the customer service was great. I will be ordering again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T06:53:35.000Z",
          "Titre": "Everything was great from the service",
          "Contenu": "Everything was great from the service, getting my questions answered to getting the radio in my hands. Highly Recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Simpson",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T04:40:34.000Z",
          "Titre": "Great Service",
          "Contenu": "Mark quickly identified a stock issue with my order, offered me an upgrade, and shipped quickly. Great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amador Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T20:35:53.000Z",
          "Titre": "Great experience with my order",
          "Contenu": "Great experience with my order, kept good informed order progress. The product was excellent!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "zbigniew michel",
          "Nb_Reviews": 2,
          "Date": "2023-02-07T09:22:28.000Z",
          "Titre": "Very happy with UV9GX",
          "Contenu": "Very happy with UV9GX. Mark is great guy. Respond to email, even 3am in the morning, that is commitment. Very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T00:15:43.000Z",
          "Titre": "Quick service. Quality product",
          "Contenu": "Good vendor.  Quality product.  Fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Moorhead",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T02:40:30.000Z",
          "Titre": "Great experience with each order I’ve…",
          "Contenu": "Great experience with each order I’ve placed.  Timely communications, quick shipping with tracking number, and well packaged!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim R. Forsythe",
          "Nb_Reviews": 2,
          "Date": "2022-12-17T18:01:18.000Z",
          "Titre": "BetterSafeRadios #1",
          "Contenu": "BetterSafeRadios, is a top of the line, Radio sales and certified programmers, for Wouxan Radios. Amoung other positives, BSR, has a friendly and efficient customer service and is easy to contact and communicate. I return to BSR,  for all my radio needs and wants, with total satisfaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Desangles",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T04:48:09.000Z",
          "Titre": "You are finally shipping on time…",
          "Contenu": "You are finally shipping on time therefore, the orders are getting much faster to their destination."
        }
      ]
    }
  ]
}