{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "bigskyrecycling.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patty Maupin",
          "Nb_Reviews": 2,
          "Date": "2021-05-15T20:16:19.000Z",
          "Titre": "Didn’t receive my label."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alan\tAnderson",
          "Nb_Reviews": 4,
          "Date": "2020-01-22T12:12:58.000Z",
          "Titre": "It was easy to get the mailing label",
          "Contenu": "It was easy to get the mailing label. The instructions were clear. I only had 3 phones. I had to get my own padded mailing envelope and had to pay for my own postage, It costs $6.00 from my location in Florida. But I feel like I did some part of keeping cell phones out of the environment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Boutte",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T15:56:17.000Z",
          "Titre": "Once I found your site I was able to…",
          "Contenu": "Once I found your site I was able to set everything up quickly.it was finding the site that was not easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allan",
          "Nb_Reviews": 3,
          "Date": "2020-05-28T14:10:55.000Z",
          "Titre": "Had 5 old cell phones",
          "Contenu": "Had 5 old cell phones.  Boxed them up, and shipped using their label.  Haven't heard from them since."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T19:18:18.000Z",
          "Titre": "Great Service",
          "Contenu": "After contacting them, they sent me a postage paid shipping label, expressed their appreciation.  And after receiving the phones they sent me a thank you to let me know they had received them.  I felt they were providing a great service by cleaning and removing and personal information and recycling these used phones to people who really need them!  Thank you all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elisabeth Elsass",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:11:39.000Z",
          "Titre": "What a wonderful service",
          "Contenu": "What a wonderful service!  Was able to finally clean out the drawer of old phones and do some good at the same time. Big Sky made it super easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen Hillery",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T15:36:51.000Z",
          "Titre": "Great customer service.",
          "Contenu": "I was very happy to find Big Sky for my recycling needs.  I contacted them with a few questions and received a very quick response.  They also let me know when they received my package.  I am grateful that I found a caring business who fulfills the needs of others through their recycling program.  Thank you Big Sky."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GMH",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T20:10:55.000Z",
          "Titre": "Awesome Experience",
          "Contenu": "Big Sky was easy to locate doing a search.  We used them a couple of years ago as well and it was super easy.  Providing a pre-addressed label is fantastic.  All we had to do was box them up, print out the label and go to the post office.  Great company to do business with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin Cressman",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T16:56:24.000Z",
          "Titre": "Phone recycling review.",
          "Contenu": "The instructions were thorough and simple enough.  The pre-paid mailing was super.  Leaving the decision up to you as to where these phone would be best used was good too.  Great cause!  I wanted to recycle these phones most appropriately.  So thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott W",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T12:07:16.000Z",
          "Titre": "very satisfying experience.",
          "Contenu": "The overall goals of the company and the institutions they support. Especially the military. My personal donation pick. I inquired about data safety on a Sunday morning and received a very nice reply that same morning and it put my mind at ease. Impressive seeing that other places wait weeks or offer no reply. I received a follow up when my old phones were received as well, nice touch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail Baer",
          "Nb_Reviews": 4,
          "Date": "2023-11-25T17:19:10.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Wow, talk about making it easy to recycle my old cell phones!  I had about 10 old phones going back to our original phones from about 15 years ago.  I looked up how to recycle phones and Big Sky Recycling came up.  I was able to print a prepaid postage label, so I boxed them up and sent them off!  Then I got a nice email from Big Sky Recycling telling me how happy they were to receive the phones!  Win Win!  I no longer have \"junk\" laying around and parts of the old phones are being put to use!!  Thank you to Big Sky Recycling!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Meller",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T20:35:52.000Z",
          "Titre": "The process was fast and simple",
          "Contenu": "The process was fast and simple. They sent me my free shipping label and dropped it off at my local post office. Thank you so much! I'm glad that my old phones will be going to a good cause."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ginger Vukas",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T18:20:54.000Z",
          "Titre": "Big Sky Recycling was very easy to use…",
          "Contenu": "Big Sky Recycling was very easy to use to recycle my old cell phones. Their packaging instructions were clear and I appreciated the free shipping.I also valued their followup to ensure that they received the phones that I had sent.I recommend Big Sky Recycling highly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jauren",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T01:09:22.000Z",
          "Titre": "GRATEFUL FOR YOUR SERVICE AND DONATIONS.",
          "Contenu": "I had several old cell phones and was happy to find Big Sky Recyclables in my internet search.I gave Big Sky their choice of who they would benefit, because all their choices were good.I was happy to learn they erased any & all data inside them.   Thank you for such a vital avenue to send old cell phones.  I appreciate you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Adams",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:10:01.000Z",
          "Titre": "The instructions for sending our cell…",
          "Contenu": "The instructions for sending our cell phones were clear and easy to follow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brigid Bandy",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T19:17:06.000Z",
          "Titre": "It was easy",
          "Contenu": "It was easy, having the shipping label made drop off every quick and simple, thank you for this service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John in NH",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T04:21:17.000Z",
          "Titre": "Eliminated my guilt",
          "Contenu": "So nice to have an easy way to manage old tech. Ours might be too old to reuse, but it beat putting nine old phones in the trash. TBH, we didn't have the ability to power up old phones to delete personal info, but we're hopeful that the company's policies and other ratings mean no one knows anything about us (frankly, it's hard to believe that given the age of the phones we sent in will be anything but reduced to parts)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DH, American Legion Auxiliary",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:30:49.000Z",
          "Titre": "Super easy",
          "Contenu": "Super easy instructions and great causes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie Allen",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T02:06:13.000Z",
          "Titre": "When my sister passed a couple of years…",
          "Contenu": "When my sister passed a couple of years ago, she left 8 cell phones, 2 iPads and 2 iPods.  None of the devices were on, and nobody knew passwords.While researching cell phone recycling, I luckily came upon Big Sky Recycling.  All I wanted to do was be able to recycle all the items so they didn’t end up on a landfill.  I had already checked Apple Recycling and Walmart Recycling.  Too many rules and exceptions for both of them…Big Sky said the would accept ALL of the items, and since there were at least 5 cellphones, they paid for shipping!!!  I mailed everything in one box.  That experience in itself I think is amazing.  But I’m struggling to find the words to express the relief I felt when I mailed off that box.  And it took only one trip to the post office!Thank you Big Sky Recycling!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiffany Ryan",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T17:44:37.000Z",
          "Titre": "So very easy!",
          "Contenu": "I had a large box of phones just taking up space in a drawer. Big Sky helped me to recycle them. I felt better knowing that they are not decomposing in a landfill (or my drawer)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yemina Chava",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T05:22:08.000Z",
          "Titre": "What a relief",
          "Contenu": "What a relief!  Hate the thought of adding to our landfills...not sure what to do w cell batteries.  Big Sky made it easy.  Old phones out of my house and hopefully restored to use in another way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T19:02:44.000Z",
          "Titre": "Effortless Generosity and Seamless Experience",
          "Contenu": "My experience with Big Sky Recycling was nothing short of impressive. The entire process was remarkably easy, from initiating the phone recycling to the final donation to charity. The user-friendly platform ensured a seamless transaction, and the fact that they covered the shipping expenses further added to the convenience. It's not every day you come across a company that prioritizes environmental sustainability by recycling phones and actively contributing to charitable causes. Big Sky Recycling's commitment to simplicity and social responsibility makes it a standout choice for anyone looking to dispose of old phones responsibly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Hardyman",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T23:00:39.000Z",
          "Titre": "It was a very simple process",
          "Contenu": "It was a very simple process.  I printed the shipping label, affixed it to the box and dropped it in my mailbox."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M Spurgeon",
          "Nb_Reviews": 2,
          "Date": "2023-04-09T14:48:15.000Z",
          "Titre": "Super easy process to recycle old…",
          "Contenu": "Super easy process to recycle old phones. Print the label, ship the phones and receive confirmation they have been received. So much better than throwing them in a landfill. I really appreciate that they verify that any remaining personal data is removed as well. If you have over 4 items, they pay the shipping. Will use again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie Fitz",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T01:11:33.000Z",
          "Titre": "You all made it so easy and convenient…",
          "Contenu": "You all made it so easy and convenient to recycle all our old phones and some other electronics. Thanks so very much for all you do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue Williams",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T19:47:46.000Z",
          "Titre": "5 phones",
          "Contenu": "I actually had 5 old phones.  I cant think of a better use for them than to give to military and victims of domestic abuse!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan Blum",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T15:31:43.000Z",
          "Titre": "Feels good to do good for others.",
          "Contenu": "Easy process for sending the cellphones. Prompt, thoughtful \"thank you\" reply."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Smith",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T20:39:11.000Z",
          "Titre": "I am impressed with Big Sky Recycling",
          "Contenu": "I am impressed with Big Sky Recycling.  I am always searching for eco-friendly solutions, and this was it.  Very easy to donate cellphones.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Nokes",
          "Nb_Reviews": 4,
          "Date": "2021-04-03T03:02:39.000Z",
          "Titre": "Was happy to find someone who would…",
          "Contenu": "Was happy to find someone who would make sure phones were scrubbed,  I accumulated quite a few that no longer held a charge.  So hopefully the phones will be recycled in a way that I'm not penalized for trying to recycle, or dispose in a responsible manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Venator",
          "Nb_Reviews": 1,
          "Date": "2021-02-08T22:15:50.000Z",
          "Titre": "Phones to benefit armed forces.",
          "Contenu": "I had two smart phones, one iPod, and three flip-phones and no ideas about whether they had. value to anyone. I discovered Big Sky Recycling and selected processing for our armed forces. Big Sky emailed me the shipping label. I followed instructions to reset all but one flip-phone that was locked, & sent them off. Super easy! I hope some armed forces personnel benefit from them. This is much better than the phones in a landfill."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T20:17:31.000Z",
          "Titre": "Very easy and live the charity donation…",
          "Contenu": "Very easy and love the charity donation choices"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim\tBenesch",
          "Nb_Reviews": 1,
          "Date": "2020-08-04T22:32:02.000Z",
          "Titre": "I had no idea as to where I could…",
          "Contenu": "I had no idea as to where I could recycle several old cell phones from different carriers.  I found Big Sky Recycling online and contacted them.  I received a e-mail with the mailing label and instructions how to package them.  I was very happy to see that they would make sure that the phones has no information on them before recycling."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "W Fong",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:11:04.000Z",
          "Titre": "Easy instructions for processing my…",
          "Contenu": "Easy instructions for processing my recycled items, andprepaid postage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2021-08-06T20:44:27.000Z",
          "Titre": "I had originally planned on shipping my…",
          "Contenu": "I had originally planned on shipping my old cell phones to another organization to be repurposed/recycled, but upon paying for the shipping label at my local USPS, they informed me I was shipping too many cell phones in a single box and the batteries needed to be in the phone (not separated as I thought would be better).  After a quick Google search to confirm this information, I came across Big Sky Recycling.  I found out they would take multiple cell phones and would send a pre-paid label!  (I had over 5 cell phones.)  I was even more ecstatic when I found out they are a B Corp!  Thank you Big Sky Recycling!  I plan to send all my cell phones to you and will spread the word with my family and friends!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry Mcmullen",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T14:53:40.000Z",
          "Titre": "I have been wanting to do something…",
          "Contenu": "I have been wanting to do something with my old phones. A friend recommended this place. So happy to send them in to be reused. Great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Laquatra",
          "Nb_Reviews": 2,
          "Date": "2022-01-21T18:33:51.000Z",
          "Titre": "Super easy and convenient",
          "Contenu": "Super easy and convenient.  Simply requested a shipping label, packaged my phones and mailed it!  Knowing it will help overseas soldiers makes me so grateful for this service!  Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Micki N",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T13:10:27.000Z",
          "Titre": "Thank you very much Big sky recycling…",
          "Contenu": "Thank you very much Big sky recycling for the best service. Highly recommened !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cedar Kris",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T22:14:14.000Z",
          "Titre": "Thank you! Recycling doesn't get any easier!",
          "Contenu": "Thank you for making recycling of our old cell phones so easy and for a good cause.  We had a drawer full of phones we no longer use, no charger cords for them, and the chore of checking them for old data was overwhelming.  I really appreciate that you assure that they're clear of old data if there is any, and that you provide prepaid postage.  It really couldn't be any easier.  I'll use you again in the future.  Thank you for providing this valuable service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jones",
          "Nb_Reviews": 1,
          "Date": "2021-01-27T23:45:13.000Z",
          "Titre": "Try Big Sky !",
          "Contenu": "I was excited to find a place to recycle old cell phones and e-readers.  When I emailed Big Sky Recycling, they responded quickly, and then mailed me a shipping label. All I had to do was pack up the items and drop off at the post office. I appreciate this great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Penny J Fischetti",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T21:37:13.000Z",
          "Titre": "So easy accessible and accurate",
          "Contenu": "So easy accessible and accurate. You can pick your charity and print a label to mail them in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T01:12:13.000Z",
          "Titre": "Their website made it easy to arrange…",
          "Contenu": "Their website made it easy to arrange shipping the phones. Also got a follow up email confirming receipt and stating any personal data on the device would be deleted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MJ Gatslick",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T18:14:22.000Z",
          "Titre": "Peace of Mind",
          "Contenu": "We were downsizing and ended up with a number of old cell phones.  I did some research and ended up using Big Sky Recycling.  I choose them because as part of their service they ensured that any personal data that was left on the phones destroyed.  That gave me some peace of mind.  I would use them again in a heartbeat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina Hughes",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T15:37:23.000Z",
          "Titre": "Easy Peasy",
          "Contenu": "Ease of printing the prepaid label was great. As a domestic abuse survivor, I'm glad that you are doing this. Domestic abuse survivors need help, and I am glad my donation will support them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly White",
          "Nb_Reviews": 2,
          "Date": "2020-09-30T14:15:17.000Z",
          "Titre": "It was so easy",
          "Contenu": "It was so easy!  We had six phones to return.  I was going to pay for the freight but at a local UPS store was told I needed remove all the batteries?!  Your form said clearly to leave them in.  When I logged back on I realized shipment would be paid for five or more...PERFECT!  Received the personalized form within minutes, packed the phones and took the package to another UPS store who gladly took my prelabled package and shipped it for me!  Thank you for helping this recycling effort."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roy S",
          "Nb_Reviews": 5,
          "Date": "2020-10-02T22:43:52.000Z",
          "Titre": "What an easy way to get rid of my old…",
          "Contenu": "What an easy way to get rid of my old phones. I kept finding them and didn't know what to do with them. Big Sky Recycling made it so easy - just print out their shipping label, find an appropriate box and mail away! So much better than ending up in the landfill."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 4,
          "Date": "2022-08-02T15:24:53.000Z",
          "Titre": "Easy to recycle",
          "Contenu": "I had a bunch of old cell phones and needed to do something with them.  Big Sky makes it extremely easy to send as they send you a prepaid label and all you need to do is box up your phones and slap on the label and drop off at the post office."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amra Leo",
          "Nb_Reviews": 1,
          "Date": "2020-11-13T12:52:15.000Z",
          "Titre": "I had a number of older cell phones…",
          "Contenu": "I had a number of older cell phones from different people. Big Sky gave me a prepaid shipping label (I had over 5), I packed 'em in a box, put on the shipping label, and dropped it off at the Post Office. Easy peasy, and they may help somebody..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie Pitchford",
          "Nb_Reviews": 2,
          "Date": "2021-03-21T13:41:40.000Z",
          "Titre": "The whole process was incredibly easy",
          "Contenu": "The whole process was incredibly easy. Everything was explained in detail. I did have to Google how to clear data from 2 of the phones.I have boxed up my phones and attached the prepaid label that was emailed to me and scheduled a USPS pick up for tomorrow. It could not have gone any easier or better.  I feel good knowing I'm supporting our troops and that the phones will not be Ina landfill."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela Charity",
          "Nb_Reviews": 4,
          "Date": "2022-03-10T14:42:33.000Z",
          "Titre": "Simple",
          "Contenu": "This was so simple, fast, and easy.  Going online and printing out a mailing slip, finding a small box for all 8 of my cell phones and then dropping them at the post office.  I wish more people knew about this process as I suspect many old phones are simply put out with the garbage.  I'll use this service again, surely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 4,
          "Date": "2021-01-25T00:35:11.000Z",
          "Titre": "This was so easy",
          "Contenu": "This was so easy. They said what is your mailing address, we'll send you a prepaid mailing label.  Followed their easy instructions for packing the phones, put on the label and dropped it off at the post office."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan in Belleville",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T04:56:45.000Z",
          "Titre": "What a great company",
          "Contenu": "What a great company! They sent me a prepaid label for 10 phone, sent me a message saying they received my package, cleared the data from the phones and answered within minutes when I emailed them! Making good use of phones that would be thrown away and keeping them out of landfills...win win!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eileen Fox",
          "Nb_Reviews": 1,
          "Date": "2021-01-21T14:11:39.000Z",
          "Titre": "You were very quick to respond to us…",
          "Contenu": "You were very quick to respond to us and we are so happy that our recycling efforts will benefit a good cause.  Thank you for the help in recycling our old phones and tablets.  You made the process very convenient and easy.  We would be happy to use your service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LOTEK7",
          "Nb_Reviews": 6,
          "Date": "2020-08-04T20:27:25.000Z",
          "Titre": "Keeping electronic junk from landfills!",
          "Contenu": "They paid for the postage and I was very glad to have a place to responsibly recycle the six phones I mailed them. We desperately need to do more so we don’t leave our grandchildren a polluted mess of a planet!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T23:37:41.000Z",
          "Titre": "Great resource to recycle devices",
          "Contenu": "Happy to find a place that recycles my devices and that goes to a good cause. Liked the free shipping label provided for my 5+ items and the email acknowledgement that they had received my items."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 2,
          "Date": "2023-04-30T16:17:44.000Z",
          "Titre": "Best thing I could have done",
          "Contenu": "It was so easy to send the items to be recycled.It felt good to be able to recycle all these items rather than add to the trash that would just add to the negative environment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T16:53:27.000Z",
          "Titre": "This service is very efficient",
          "Contenu": "This service is very efficient. We received the mailer info immediately and it was on its way the next day. No difficulty or issues at the post office."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-08-27T21:10:11.000Z",
          "Titre": "Recycling done right. Convenient and effortless.",
          "Contenu": "Their website is very easy to use and informative. Got back to my email almost immediately with a free shipping label since I had enough phones to ship. Definitely recommend their services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathryn Vecchio",
          "Nb_Reviews": 1,
          "Date": "2021-05-16T14:52:55.000Z",
          "Titre": "Site was easy to navigate",
          "Contenu": "Site was easy to navigate.  Information was clear and concise.  Shipping label sent within 2 hours.  A perfect way to recycle good used phones and tablets."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Day",
          "Nb_Reviews": 2,
          "Date": "2022-08-04T21:12:40.000Z",
          "Titre": "The process was so easy",
          "Contenu": "The process was so easy.  Wondering what to do with all these old phones, googled the web, up popped you and easy web site and instructions.  Free was another great feature and off to the post office to mail it.  A couple of weeks later a nice email telling me you received it, which was very nice.  I am glad someone can use these phones, for me it was battery issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joelle S",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T14:33:43.000Z",
          "Titre": "Happy to Find a Responsible Recycler",
          "Contenu": "I’ve been looking for a safe place to recycle old phones with data that we cannot delete. I was comfortable with Big Sky Recycling’s program to protect the data and recycle the phones. Glad we found them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "t k",
          "Nb_Reviews": 1,
          "Date": "2021-01-25T14:16:04.000Z",
          "Titre": "everything as expected",
          "Contenu": "After finding Big Sky's information on their web site - I requested a free mailing address for 5 or more cell phones.  The information arrived via e-mail and everything went as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Stem",
          "Nb_Reviews": 2,
          "Date": "2022-12-20T18:03:36.000Z",
          "Titre": "Easy and quick to donate",
          "Contenu": "It was super easy to follow the website. All instructions were listed correctly. Any question I had was listed and the answers clear. The prepaid label was a real bonus!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan M",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T20:47:50.000Z",
          "Titre": "I was happy to find a company that…",
          "Contenu": "I was happy to find a company that would take old cell phones - as well as Kindles, etc - and recycle them for good causes.  I'll send any other items I have to them and will share their info with others.  Thank you to Big Sky for what they do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Summer bird",
          "Nb_Reviews": 1,
          "Date": "2020-10-23T12:49:23.000Z",
          "Titre": "Had a number of old cell phones to…",
          "Contenu": "Had a number of old cell phones to recycle.  Followed Big Sky's directions on removing my info from the phones, boxed them up and took them to the post office.  Couldn't have been easier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol L.",
          "Nb_Reviews": 1,
          "Date": "2021-07-31T12:35:24.000Z",
          "Titre": "Love how easy this task was…",
          "Contenu": "Love how easy this task was accomplished, and your safety assurance. (I was unable to reset several of the cells I mailed). Getting a pre-paid label was the frosting on the cake!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T20:19:08.000Z",
          "Titre": "Great experience.",
          "Contenu": "The whole process was easy from start to finish."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Asa Cerasani",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T23:29:57.000Z",
          "Titre": "Process was easy",
          "Contenu": "Process was easy. Pack up the box and send it out! We had 5 devices that needed to be recycled. I feel good knowing that they went to where they should be taken care of responsibly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brooke Dunn",
          "Nb_Reviews": 1,
          "Date": "2020-12-11T16:11:06.000Z",
          "Titre": "Super Easy..",
          "Contenu": "Super Easy... I went online and requested a label for all the old phones in my drawer taking up space. I am big on recycling. They responded quickly with a label through my email. I took mine to the post office, but you can get it picked up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula Olson",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T20:12:18.000Z",
          "Titre": "I received the mailing label right…",
          "Contenu": "I received the mailing label right away. The information they gave me was easy to read and follow. I sent the phones and iPad and received an email when they received them. Very efficient and I trust them completely. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Lytle",
          "Nb_Reviews": 10,
          "Date": "2023-01-07T01:16:55.000Z",
          "Titre": "I am getting a tax write off for 8 old phones!",
          "Contenu": "I sent my phones and the company confirmed that they were received.  It was pretty much as simple as that.I was able to ship the phones at no cost to me, because I was shipping so many to the company.  So, the only cost to me was the cost of the gas I used to drive to the post office.And I already have the values I can assign to the various phones I shipped off to the company to recycle/donate to a charity.Easy and satisfying."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liana Litzsinger",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T21:33:47.000Z",
          "Titre": "They returned emails promptly",
          "Contenu": "They returned emails promptly. Responses to questions were clear, making it easy to get the cell phones ready for shipping. They provided a shipping label, making it so easy to mail the phones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Robinson",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T15:19:35.000Z",
          "Titre": "It was easy to package and ship",
          "Contenu": "It was easy to package and ship the unused cell phones I’ve had around the house for years.  The company assures security so I’m hoping that’s true because I was unable to wipe some of the phones.  Time will tell."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mrs Whiteman",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T19:00:58.000Z",
          "Titre": "Refreshing",
          "Contenu": "The information about the process was very detailed. It enabled me, who is not a Tech Savvy person, to donate safely and know I supported a great cause."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Schaefer",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T22:34:29.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Found online, Filled out info, print the postage Big Sky sent me. Follow instructions on packaging. Drop off at post office. Quick and easy.Hope items sent get good use for somebody else. Would use them again.Great job, Thank-you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meredith Allen",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T15:33:01.000Z",
          "Titre": "Seamless Process!",
          "Contenu": "What a great way to do good with our old devices -- thanks for providing such an easy solution!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob S.",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T10:57:01.000Z",
          "Titre": "This is a great service that's easy to…",
          "Contenu": "This is a great service that's easy to use. I was able to recycle a handful of old phones and an old tablet that have been sitting in a drawer for years and now will be put to good use to help others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elise Merkel",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T15:50:09.000Z",
          "Titre": "You make it easy!",
          "Contenu": "I've had a box of old cell phones for a couple of years now and did not know what to do with them.  I finally googled 'where to donate cell phones' and your company came up. I was so impressed with all your instructions about wiping the phones clean and how to send and which charity I prefer.  Everything was clear and easy to understand - and what a perk that you sent me a prepaid label!  Great company!!  5 STARS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Autumn Kramer",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T20:00:19.000Z",
          "Titre": "This was a very easy process for me to…",
          "Contenu": "This was a very easy process for me to get rid of my old cell phones. And I am happy to have them all go to our military, I am a military mom! Thanks for doing all great things you guys are doing for our military."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Greenwood",
          "Nb_Reviews": 1,
          "Date": "2021-04-06T23:04:38.000Z",
          "Titre": "Had many old cell phones sitting in a…",
          "Contenu": "Had many old cell phones sitting in a filing draw, some of them are more than 10 years old. Found Big Sky through Google search and they sent me via e-mail a USPS label to box up and send them the phones and chargers for a good cause from the proceeds.Thank you Big Sky."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al U",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T02:32:07.000Z",
          "Titre": "Clear and easy instructions",
          "Contenu": "Clear and easy instructions.  Prompt response when phones are received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Engelhardt",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T18:46:41.000Z",
          "Titre": "Responsible cell phone recycling",
          "Contenu": "My old cell phones were piling up.  Not only mine, but I had my mom and dads old phones as well.  I wanted to be recycled responsibly.  Blue Sky even sent me a label since I had several...12!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "cathy G",
          "Nb_Reviews": 1,
          "Date": "2020-10-06T13:05:49.000Z",
          "Titre": "Great service",
          "Contenu": "Great service.  They sent a label immediately.  Makes you feel good your old phones are doing something worthwhile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael\tGaines",
          "Nb_Reviews": 1,
          "Date": "2020-08-27T20:09:26.000Z",
          "Titre": "Website was informative and user…",
          "Contenu": "Website was informative and user friendly. Wish I would have researched this earlier. Will use again should circumstances warrant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elaine Caron",
          "Nb_Reviews": 2,
          "Date": "2020-09-23T17:40:25.000Z",
          "Titre": "Quick Response",
          "Contenu": "Contacted Big Sky Recycling to send phones to be recycled. They were quick to send me an email with the mailing label. Very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Maria",
          "Nb_Reviews": 4,
          "Date": "2023-08-02T16:16:27.000Z",
          "Titre": "Big Sky made it very easy to recycle…",
          "Contenu": "Big Sky made it very easy to recycle our old cell phones. Instructions were very clear and printing the label is great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2022-10-27T23:02:24.000Z",
          "Titre": "Cell phone recycle",
          "Contenu": "The information provided on how to return was very helpful. The return shipping label made it easy.  Acknowledging the receipt and informing us that all personal data would be removed was reassuring"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon  Keeter",
          "Nb_Reviews": 5,
          "Date": "2021-07-28T18:46:25.000Z",
          "Titre": "never received my shipping label :(",
          "Contenu": "never received my shipping label :(UPDATE: I received an email along with an apology and the shipping label shortly after this posted.  I would like to change this to a 5 star.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 4,
          "Date": "2020-08-07T14:26:33.000Z",
          "Titre": "Easy way to get rid of a pile of cell phones",
          "Contenu": "Easy way to get rid of a pile of cell phones.  Good insructions on how to factory reset and delete information on them.  And free shipping for all 5 of my phones. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn M.",
          "Nb_Reviews": 1,
          "Date": "2021-02-17T17:08:17.000Z",
          "Titre": "Great service!",
          "Contenu": "The mail-in process was so easy! I really appreciate being able to recycle all of these old phones and not have them end up in a landfill!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DA",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T23:32:07.000Z",
          "Titre": "Good experience",
          "Contenu": "Easy shipping process.  It’s a bonus that you can select where your donation goes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Papoccia",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T23:11:14.000Z",
          "Titre": "It was simple to get rid of our old…",
          "Contenu": "It was simple to get rid of our old CELL PHONES and you said the information on them is TAKEN OFF and they will be reused or destroyed .Thank YouRobert Papoccia"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mardi",
          "Nb_Reviews": 3,
          "Date": "2021-02-09T03:23:56.000Z",
          "Titre": "Refurbish or recycle",
          "Contenu": "This is a great site I felt confident that they would recycle or refurbish and provide phones for people that are in need"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa C.",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T15:00:54.000Z",
          "Titre": "Great Service",
          "Contenu": "We donated several cell phones to Big Sky Recycling and the process of receiving a pre-paid mailing label was immediate. Great job for a great cause."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TedB",
          "Nb_Reviews": 3,
          "Date": "2022-12-01T18:57:57.000Z",
          "Titre": "Win-win situation.",
          "Contenu": "It was nice to get rid of the old electronics that were piling up, but it was really great to have them go to a good cause."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 2,
          "Date": "2022-03-12T18:12:20.000Z",
          "Titre": "Could not be any easier to recycle our…",
          "Contenu": "Could not be any easier to recycle our old cell phones.  Just printed out the label, packed the phones in a small box and dropped off at the post office."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa L.",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T03:30:08.000Z",
          "Titre": "It was amazingly easy to recycle our…",
          "Contenu": "It was amazingly easy to recycle our old cell phones and great to know a good cause would benefit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T02:34:17.000Z",
          "Titre": "Customer Service",
          "Contenu": "Easy process would use this service again. Great customer service. Loved that they let you know they received your items."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Earl",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T15:49:31.000Z",
          "Titre": "Your response to my email was quick and…",
          "Contenu": "Your response to my email was quick and the mailing label came just quick, and I will be telling my family and friends about your company, your company did a good job. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Tolbert",
          "Nb_Reviews": 1,
          "Date": "2021-01-25T00:59:00.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, great organization. Will definitely recommend Big Sky Recycling to all the people I know in North Carolina.Thank you for your service and commitment to all you serve."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patty Maupin",
          "Nb_Reviews": 2,
          "Date": "2021-05-17T00:13:05.000Z",
          "Titre": "I guess my label went to my spam folder",
          "Contenu": "I guess my label went to my spam folder.  They contacted me and sent me another label.  No problem, great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie Rains",
          "Nb_Reviews": 1,
          "Date": "2021-01-24T21:41:57.000Z",
          "Titre": "Very prompt to response to request for…",
          "Contenu": "Very prompt to response to request for mailing label. Specific instructions on what to do.  Very easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim DeFeo",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T21:05:57.000Z",
          "Titre": "The process was quick and easy",
          "Contenu": "The process was quick and easy. I appreciated the thank you Email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt S",
          "Nb_Reviews": 1,
          "Date": "2022-05-28T16:41:58.000Z",
          "Titre": "Incredibly easy",
          "Contenu": "Incredibly easy, and they cleared the data from some old phones that weren't powering on for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Irene Clum",
          "Nb_Reviews": 2,
          "Date": "2021-01-27T23:02:29.000Z",
          "Titre": "Great service",
          "Contenu": "Made it so easy to recycle our old cell phones! Feel confident that they will benefit someone"
        }
      ]
    }
  ]
}