{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "billo.app",
      "Review": [
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Rebel Coffee",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T07:21:39.000Z",
          "Titre": "Do not use",
          "Contenu": "First video we got was great. Second took 5 weeks and by the time we received it we no longer could use it for our campaign. We also had to chase up the video for two weeks before we got it with zero communication. It’s now taken two weeks for billo to contact us saying they won’t refund us. Looks like we’ll be actioning a charge back with our bank. DO NOT USE.To add to Billos reply, it was auto approved as there is no option to not approve. What a joke!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thiago Macklin Lima",
          "Nb_Reviews": 2,
          "Date": "2023-08-15T14:07:27.000Z",
          "Titre": "Billo is terrible.",
          "Contenu": "I'm not a \"review\" person. I only did this to warn others that Billo is terrible. Both of my videos have taken much longer than they stated they would take. Can't change dimensions once I've placed an order (not sure why). Customer service is terrible, and they take forever to respond. In the end, the video I received was pretty low quality. Asked for a refund several times and can't get one because, by the time you realize this service sucks, they've closed the refund \"window\". Second creator ghosted me and never sent a video and I had to hound them for it. Stay away."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "alex",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T10:38:02.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Very disappointed. I used the service multiple times and on one occasion I did not proceed with a video and they’re refusing to refund my funds despite their business having no cost from me cancelling the order. Customer service was terrible. Beware!"
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Antonis Toska",
          "Nb_Reviews": 3,
          "Date": "2023-08-01T13:03:42.000Z",
          "Titre": "The worst experience ever! I am waiting for REFUND",
          "Contenu": "So I created the task and I asked the creator to make a \"review\" concept for one of my service businesses. I had a script, I explained exactly what I need from her and also I showed one ad from my competitors to the creator so she could understand exactly what I wanted from her. And the result was her showing just her face moving it up and down and the script was illustrated with voice-over. I never asked her to do voice-over instead I was expecting her to talk to the camera. And customer's service reaction was she has to give an honest review. And the creator's response was I can't remember the script by heart! What is this??????????? Are you kidding me??? I have asked the support either for a refund or some other creator to do the job that I asked!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danny Franchini",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T05:09:18.000Z",
          "Titre": "It began great….",
          "Contenu": "It began great, but after 2 weeks taking my money… still no video! Poor customer service, from Allysa - not sure why they even have her working there, she’s terrible at her job offering support-  they 48 hours to respond to chat or email. Save your money, find another company to do business with!! 👎👎👎👎👎"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Adam Prioletti",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T19:35:06.000Z",
          "Titre": "Absolutely Terrible!",
          "Contenu": "Absolutely Terrible!We hired 5 creators, who thought were going to be incredible, to do videos for our product. We shipped the products out, everything was dandy.It wasn't until 2 weeks later I realised I still didn't receive my videos. I checked the tracking and saw the orders were delivered a WEEK AGO. I was very frustrated as I have a business to run and I needed these ads. I am very busy and haven't got time to chase people up. None of these creators marked it as delivered, I chased them up and some had an excuse about not being in town, which if I knew this, I wouldn't of picked them for my videos. Some marked it as delivered when I chased it up.3/5 of the creators delivered great videos, no doubt about that!One of the creators was making so many mistakes, and put little to no effort into his video.The other creator we are STILL WAITING for the video for and it's been over a month since I placed the order.I mentioned my issues to billo customer service and all their response in summary was 'thanks for the feedback' disgusting.Honestly was looking for a long term partnership but that's not going to happen anymore."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Thomas",
          "Nb_Reviews": 33,
          "Date": "2023-07-19T06:43:14.000Z",
          "Titre": "Abysmal service - Do NOT use!",
          "Contenu": "Abysmal service. Do NOT use!After waiting over 2 weeks, they sent me a video...It had the WRONG creator in the video.When I pointed out it was the wrong creator, they just said the video had been made, so there was no refund.Will never use again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ecommerce website",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T15:32:53.000Z",
          "Titre": "We sent 2 products two weeks ago and…",
          "Contenu": "We sent 2 products two weeks ago and still haven't gotten any updates from both creators. Billo's CS finally answered our numerous emails but still...no updates. So far we feel like we've been robbed. We paid for two videos, for two shipping, for two products.Update with Our ANSWER to Billo's reply:Inga from Billo's customer service has still not giving us any update about our products and videos we paid for.Nothing is happening except our company losing time and money. Please update us asap."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Schrider",
          "Nb_Reviews": 4,
          "Date": "2022-11-04T15:49:55.000Z",
          "Titre": "This company misrepresented themselves",
          "Contenu": "This company misrepresented themselves, their process and level of service.  I was told on the demo that they had dozens of creators. That they dedicated an assigned 'account manager' when we buy the $2,500 package.  Guess what... we did buy it... and we did NOT get anyone.  We purchased on Tuesday afternoon, and didn't hear back until 4pm on a Friday.If you are a company that is trying to create a serious video ads/marketing plan... consider other options.  The level of communication is unbelieveable.  They said that one of their manager's called in sick.  I guess that says a lot about their leadership structure.  To be fair, I did get 1 video that is usable, but not at all like the 'samples' they showcase.  Good luck!"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Nicola Berselli",
          "Nb_Reviews": 9,
          "Date": "2022-02-16T17:55:37.000Z",
          "Titre": "bad experience",
          "Contenu": "bad experience. Received my video after 9 days, with very basic quality, the creator just didn't seem to engage.Also, the customer support was one of the worst ever received, took 5 days to reply to me, they apologized and then once again took 2-3 days to get back to me.You won't see my money again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NA",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T00:27:03.000Z",
          "Titre": "I paid for 3 videos and only received…",
          "Contenu": "I paid for 3 videos and only received 2. The creator is MIA and nobody on this platform will respond to my message. I am not only owed a video or a refund, I will never recommend this app."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sam Elliott-Ellis",
          "Nb_Reviews": 5,
          "Date": "2021-11-02T10:26:48.000Z",
          "Titre": "Please don't use Billo",
          "Contenu": "Please don't use Billo. The video I ordered still hasn't arrived after nearly 2 weeks. I have contacted support numerous times and have received no answer at all! They will constantly send emails with offers though...I would definitely not use Billo again. I have lost over $200!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Quinton Cranford",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T13:56:20.000Z",
          "Titre": "Good concept. Bad execution.",
          "Contenu": "The concept is good, but their execution is bad. Very poor quality of service. The creator reels looked good and then the actual video they produced was so bad. Poor video and audio quality. No quality control."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Ben Spicer",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T02:04:49.000Z",
          "Titre": "Extremely slow, bad support, words spelled wrong",
          "Contenu": "it was extremely slow, especially just to get the txt on there. Then it was finally handed over and some words were spelled wrong. Nearby had a space in it in big letters at Near by.  I didn't even bother to wait for it because it was just atrociously slow and unclear when I would get this content"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vivian",
          "Nb_Reviews": 2,
          "Date": "2021-09-16T19:22:44.000Z",
          "Titre": "Horrible Service!",
          "Contenu": "This is my first experience with Billo App. If your rating system allowed for a lower rating than one star, I would have chosen it.I was initially excited to use the service, but my excitement began to wane once I discovered that the service team ignores a message when there is a problem. My creator was to make a video regarding my recently published book. I was expecting a professional result as I carefully chose the creator.Throughout the video, the creator says the author’s name, but she used A DIFFERENT NAME than is on the cover of the book.My video is useless to me!I have contacted them daily for four days and have yet to receive a response.I initially wanted the video redone since I CANNOT use a video with the wrong author name.Now I just want a full refund since no one wants to take ownership to correct the problem.I will be going the extra mile to receive my refund and share my experience."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Avishai Zarfati",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T08:45:59.000Z",
          "Titre": "No videos, lame compensation",
          "Contenu": "Ordered 2 videos from them. the product arrived on the 23rd, they say up to 5 days for the creator to send the video. still no video after almost 10 days.The product requires assembly but I wrote that in the product description,As compensation, they offered me 15% on my next buy....very disappointing both from the creator and the service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Athens Sciential .Agency",
          "Nb_Reviews": 4,
          "Date": "2022-11-09T22:26:54.000Z",
          "Titre": "Stole $400 worth of my products",
          "Contenu": "Stole $400 worth of my products! Never using again. Saturated same models only submit every time as well as everyone else"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cole Gilbert",
          "Nb_Reviews": 3,
          "Date": "2022-08-24T19:01:25.000Z",
          "Titre": "Alyssa lopez has taken way to long to…",
          "Contenu": "Alyssa lopez has taken way to long to make and send me my video I gave her 1 1/2 weeks to say something or send me my video and nothing, theni have to message her 2 times asking whats going on and she replies 2 days later with she was on vacation it will be done tonight or tomorrow. Of course those says pass and still nothing no update at all absolutely ridiculous its been a month and ive yet to receive anything absolutely terrible alyssa lopez should not be allowed to be a creator."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hannan Sheikh",
          "Nb_Reviews": 2,
          "Date": "2021-12-13T15:47:51.000Z",
          "Titre": "Sent Product 1 Month Ago, Still No Video....",
          "Contenu": "Horrible experience. I sent my products on 11/19 and today is 12/13. Out of the 5 videos I requested, I've only received 4, 2 of which were the same video with a different voice over. The content creators did not seem to have any guidelines or deadlines, one of the content creators delayed making a video until I had to ask 4 times, (3 weeks after receiving my product). None of the content creators post on time, and there was no consequence on Billos end - all of the creators delayed making videos (alarming since I ordered from 4 different content creators). Save your money and go elsewhere, there are far better services for this price. They charge an arm and a leg for these services, promising you a 5 day turn around time, but its been a month. To date, it has been 1 month and counting during a busy Q4 season, and im still waiting for these services to complete. Spent over $800 for subpar service, and responses. After I explained my issue, I was given a 15% compensation for my next video  - when on their website they have a 50% off promo right now. Insensitive and completely missing the mark on customer service - offering me less than the current public promo."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "SBI",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T16:42:57.000Z",
          "Titre": "It just takes too long",
          "Contenu": "It just takes too long. Alot of the influencer look unkept. I had one influencer keep me waiting for 2 weeks which was an edit request."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "shonae jones",
          "Nb_Reviews": 2,
          "Date": "2023-04-23T20:09:24.000Z",
          "Titre": "User experience",
          "Contenu": "User experience, interface and customerService sucks! Process from choosing a creator and to getting the video done is unnecessarily confusing. Email updates are also slow and unhelpful."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Customer Care",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T14:18:03.000Z",
          "Titre": "A poor experience so far.",
          "Contenu": "I can only thank myself for not going ahead with the $2500 package. I never bother to leave reviews but this experience just compelled me to. The intent behind this platform might be good, but the execution is poor and the customer service is poor with no communication on live chat and responses do not come until within the next 24 hours. This is a poor experience given how even smaller apps on Shopify provide instant communication.Now about the experience with the creators. We got the 3+1 mashup bundle and identified 2 creators to start with for 2 different tasks. Firstly their pool of creators are either too small or only certain type apply for a certain type of products, so I had pretty much the same creators apply on all my tasks and not enough of them applied. And it is not that it is a cheap product or won't appeal. Most of the ones that applied were not worth it anyways. We chose to nevertheless work with 2 separate ones. One of them was just terrible with such poor audio and video quality, and this was despite it being passed through billo's audit before being presented to the client. Their standards must be so low that they even allowed it to be shown to me. The whole process is so slow, we sent the products in the first week of Feb, and now in early March we still do not have videos to speak of. Brands cannot work like this with this kind of ridiculous timeline. When we raised the matter of the poor video and audio quality of the creator, the support agreed that it was not an acceptable quality and offered credits to place another video, but stated the product amount would not be refunded. So basically, a content creator fails to deliver as per the requirements, fails to follow the brief, provides poor content, and because they cannot do the job right, they get to keep the expensive product for free. We not only lose time, but we also lose the product amount behind a creator who cannot even offer what was agreed to.In the second order, the creator gave us content with elements missing from the original brief, it has been 5 days, and still no update on the edits requested. They might offer better value with creators applying for your tasks to make life simple, but the very intent is missing when they cannot deliver at every step. There are alternatives around or just work hard directly with creators, because the content here in our experience isn't exactly how it is promised."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kimberly Irene Fowlkes",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T10:14:14.000Z",
          "Titre": "I am writing from a creator standpoint",
          "Contenu": "I am writing from a creator standpoint. I worked for Billo as a creator for less than 3 months. In this short amount of time I was able to complete almost 300 videos and earn over $10,000. I enjoyed creating, and even received personal requests from brands to work with me specifically. I fell sick and was hospitalized after this time, and Billo suspended my account. I still worked from the hospital, but Billo never chose to unsuspend my account when I returned home, and informed them of my situation. They forced me to pay money for products that I never received, and never paid me for the videos and advertisements that I did complete.My problem with Billo is that the customer service team treated me horribly, and stole money from me.From day one, they constantly suspended my account for things that I did not do. One of the consultants told me that they specifically went and told other colleagues not to put me on tasks. As a black woman, it is already difficult to find work in the influencer/creator space, and Billo’s team constantly lied on me to brands in an attempt to hold me back.I sent a message in the app letting Billo know my problems, as well as leaving a comment on their Instagram page, and all they said was sorry. I have been trying to speak with a customer service representative for two weeks now.I am willing to give Billo another chance, because I am great at my job as a creator, and I put a lot of energy and work into my content, but I have not been able to speak with a customer service representative. Brands have reached out to me via my social media pages to complain about the negligence of Billo’s team, and I can only agree with the lack of integrity and customer service.It is unfortunate and despicable that Billo treats their creators (especially one that has brought them so much business in so little time) in such a poor manner. The creators are the backbone of the brand, and without good creators, companies would not ask for advertisements. I even referred friends to use this app to make extra income, and I am now regretting doing so. Billo always states that they are trying to improve, but when asked for those improvements, they do not help. As one of their top creators, it is very unfortunate that I have been treated like this, and after speaking with a few of their smaller creators, I can only imagine the stress they go through. My Instagram is @KimberlyIreneFowlkes, and I am still waiting to speak with someone about my account, and receive my compensation for the work I completed. I hate that I have to leave a negative review, but I am not satisfied with the services of this app."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cristina Guizar",
          "Nb_Reviews": 4,
          "Date": "2023-03-26T16:49:45.000Z",
          "Titre": "The creator didnt follow the brief and billo didnt help",
          "Contenu": "The creator didnt follow the brief, the customer service team dont support the client, I asked very simple things, my product to be ironed to look good, and a wall as a background, I mean, is about the product, the creator was mad about the request, she kept filming on her dark bedroom or against a closet door, like a cheap review and the Billo app customer service did nothing to help, they offered half of the money back and I cant get my product back even that I offered a shipping slip, so I lost money and product in a terrible video, dont bother, hire a model is cheaper and easier to work with, influencers are not good and are soooo difficult to work with, and really, you dont need them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashley Drewes",
          "Nb_Reviews": 16,
          "Date": "2022-10-19T15:50:40.000Z",
          "Titre": "From a Creators POV",
          "Contenu": "From a Creators POVAs a creator, I was really excited about using Billo. I had been on their platform for over a year, but finally opted to delete my account with them today. They had issues on and off since I 1st joined them, some were resolved while others, such as their customer service only got worse. So I guess I'll break it down:1) LOW PAYWhile Billo starts at $59 for brands, creators only make $15-$30 per video. Considering the amount of work involved, the pay rates are pretty low. However, sometimes the item you get from the brands can help offset the cost, but in more cases than not, it does not. Additionally, a lot of brands have a lot of requirements for such a low payout. Now, from their end, they are paying a higher rate, so I could see why they would have a lot of requests, but from a creators stand-point, it's a lot more work than it is worth for many items. Personally, I would avoid such tasks. For the low payout, I would look for the simplist job.2) NOT PAID FOR EDITSOn top of a low pay, there is no additional payment for edit requests. I'm not talking about if the creator makes a mistake, but in the brand wants more voiceover, more scenes, etc. So basically, they want to force the creators to do extra work at 0 pay. Around when I first started, they would at least add on an additional $10, but as I recently found, they are no longer doing that.3) NO WAY TO DIRECTLY COMMUNICATE WITH THE BRANDAs a creator, I may have questions on how to pronounce something, how it is used, etc. I have NO way to contact the brand to discuss anything. I have to go through Billo. Which leads to my next issue.4) TERRIBLE CUSTOMER SERVICE & RESPONSEAs a creator, if I'm trying to complete my tasks, it is important to get information as quickly as possible. The response rate is poor. Sometimes you get a quick response, however, if something is an issue, it seems they can take days to respond or simply they ignore your message unless you basically end up harassing them. I've had quite a few times where I will see that my message was 'seen' however, not get a response for another day or longer. If you saw my message, why not respond? I hated the idea of deleting my account. I love trying new things and getting a few extra dollars, but the treatment by Billo makes this feel like slave work. They make creators look bad to the brands. I've seen so many brands complain about creators, and to be fair, some I am sure are justified. However, the length of time it takes to get their video, lack of quality, etc, I blame a lot on Billo because of their response rate. For example, I upload my video within 24 hours of receiving the item, I submit my video. It then has to sit and wait for Billo quality control check, then if THEY think it needs edits, then that's another wait for the edits to be done. It can take DAYS before their quality control check and more days if edits are needed, before the brand even gets to see the video. So it may look like the creator takes forever, when in fact, at least in my case, that is not so.Between what I'm seeing other creators say, I'm finding that it wasn't 'just me' - but how Billo treats creators as a whole. And quite honestly, the complains from Brands, I don't blame them either. Overall, Billo really isn't worth it for either side. Great idea, poorly executred. I am now offering my services outside of Billo so I can work directly with the brands rather than using a \"middle man\" who doesn't care about either party.UPDATE 10/19/2022Just updating, I was willing to give Billo a 2nd chance since they claim to have improved. Apparently, it's the same terrible environment with terrible customer service. If you're a creator, go on another platform to avoid disappointment and stress."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Ruben Onuha",
          "Nb_Reviews": 7,
          "Date": "2022-09-28T06:54:07.000Z",
          "Titre": "Bad customer service and the content…",
          "Contenu": "Bad customer service and the content creators' quality are not the best."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T20:04:59.000Z",
          "Titre": "The creator was great",
          "Contenu": "The creator was great. Billo's customer service and post-production teams weren't great. Slow response times, several typos."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Destiny Faith",
          "Nb_Reviews": 2,
          "Date": "2021-10-04T16:33:10.000Z",
          "Titre": "Terrible Communication with Creators",
          "Contenu": "I am a Billo creator and have been for a year. Many of my experiences have been positive and I refrain from complaining publicly because over the course of the year, it appeared that Billo was committed to making changes that made the service a better experience for creators and I like to give companies the benefit of the doubt. However, over the past year, there have been grievances that have really made working with them more stressful than need be, and instead of fixing these concerns, I've recently been suspended as a creator. My major concern is how their support team communicates with creators. There isn't consistency in how we are alerted that we have been confirmed to create a video for a brand, and they rely on the system's documentation on when I should receive a product vs when I actually do receive a product. In addition, their customer support team don't seem to be on the same page or read previous notes before making decisions on an account. It's only happened a handful of times where a product will not be delivered on time (which has been an issue  during this pandemic) but then Billo's system will document my making of the video as late even when it's not my fault. I have been overly communicative and keep them updated on my tracking of the product, including screenshots when needed and they still mis-document this. I usually alert them as soon as I see that it shows up as \"arrived\" in my account and this is not correct. So as a result, I have sometimes been incorrectly removed from the product. In addition, I will be told not to worry by one representative but then threatened to be suspended by another rep which had gotten pretty stressful. In the past they've apologized for these errors and have corrected the mistakes and so I felt no need to make a public complaint.In this most recent instance, I had applied for a product but had not received confirmation that I was approved for this product and so after a bit of time, I'm not expecting it. In addition, I never received an email alert about this product approving me. Eventually, I was confirmed for this product but I had to move last minute for a gig out of state. So I was no longer living at the original address but I updated my address that day. However, I noticed in the app that the product was now confirmed, which felt odd because I didn't receive an email. After looking at it some more, I realized that they just confirmed it that day, the same day I updated my address. I reached out to the Billo support team IMMEDIATELY when I realized that the brand could potentially be sending this to the wrong address. I asked them if there was a way to track this. They responded to not worry and to just wait to see if it arrives. (odd, right?). Eventually, I followed up with them to ask for tracking and they were able to provide it to me, and yes, it had been delivered to the previous address. I advised them of this in hopes that we can reach out to the Brand right away, and they instead, asked me to get in contact with the previous address to see if it could be delivered to me. I was super hesitant about this as I didn't think this was a professional, nor safe way to handle this. I also addressed my concern to the Billo team that I'd be asking someone to deliver this to me on their behalf that I might not want to even know my address. Their response was just that they'd reimburse me for the delivery. So eventually, I was able to get a friend of mine to meet the person at the address to then deliver it to me. This took some time, because everyone's schedules did not align. I kept Billo informed of this whole process and updated them whenever I got any updates on this process. They continued to make me feel as though it was fine and time was not an issue. I even suggested, perhaps they have the brand re-send me the product so that I could shoot it right away and then send them back the original product when I could finally receive it. Eventually, the product was shipped by my friend, but it hadn't arrived yet. However, Billo then advised me that the Brand had removed me from the product and that they were suspending my account for a late video.This was a shock to me, considering we had been communicating thus far, and this felt like it came out of nowhere when they knew I was still waiting for the product. The product eventually came, and I advised them and they said that it was too late. The Brand didn't want to work with me.To me, this goes to show that they didn't properly communicate with the Brand about what was going on, but also, to be punished for this was totally unfair to me and I voiced my concerns. The response to me voicing my concerns, didn't not indicate that anyone had read my previous correspondences. Overall, I wish I could've updated my address sooner, so I'll take that, but their handling of this and communication was disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "T Weatherspoon",
          "Nb_Reviews": 1,
          "Date": "2021-07-27T15:51:03.000Z",
          "Titre": "Misleading Timeframe",
          "Contenu": "You will not receive your video(s) in up to 5 days as mentioned. After inquiring about a past due video, I was told that the creator was having “skin problems” and could not complete my video till hopefully the end of the following week. They did not reach out to me to communicate this. I was ONLY aware because I contacted them. Also, they only reply back fast to messages when there is no issue. If there is an issue, they’ll read the message and not respond or won’t respond back in a timely manner."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "onyxob",
          "Nb_Reviews": 10,
          "Date": "2021-03-01T21:27:24.000Z",
          "Titre": "I paid for a video to show the purchase…",
          "Contenu": "I paid for a video to show the purchase of a product, but was still required to send free product to the creator. We are told the video will come within 5 days of receiving the product. Again, we paid to show the purchase of the product, not to review it! The creator already placed the order and received the product 5 days ago, why haven't they uploaded a video for it? I just feel scammed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ravyn Hazelwood",
          "Nb_Reviews": 1,
          "Date": "2021-02-14T01:48:14.000Z",
          "Titre": "Thanks for writing your review",
          "Contenu": "Thanks for writing your review.  I got approached by this company to make videos for products.  I was told that I would get sent a product and then I would get paid $20 for making a simple short (60 second) video about the product.  It’s good to know they are apparently charging companies lots of money for a video review and only giving the person creating the video $20."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "John Larkin",
          "Nb_Reviews": 2,
          "Date": "2022-01-10T11:06:34.000Z",
          "Titre": "Very hit and miss",
          "Contenu": "[EDIT] JUST IN CASE YOU DIDN'T REALISE, MANY OF THE POSITIVE REVIEWS HERE ARE WRITTEN BY THEIR CREATORS, NOT THEIR CUSTOMERS.Very hit and miss. The Billo team have terrible customer service, you can't communicate with creators directly so it's hard to get your vision across. Everything takes forever because you have to message Billo (who read your message and ignore you for days). There has to be better options out there. I wont be using again (I had 5 videos created - and only received 4, one creator didn't bother even though I sent them product)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T16:30:36.000Z",
          "Titre": "Waiting over 4 weeks for my product to be returned to me!",
          "Contenu": "I sent a prepaid label with my product to be shipped back over 5 weeks ago. The company first asked me for a copy of the label so I had to order another one because I didn’t save a copy. Ok sent a pdf copy to the company they passed it on to the creator. 2 weeks passed I didn’t receive my product so I reached out again and was told it was shipped but the tracking on my end shows it was not! I feel like im being lied to the creator doesn’t plan on sending my product back which sucks because we are a small business and need that product for content creation. I would not recommend this service to anyone!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Franklyn Gregory",
          "Nb_Reviews": 1,
          "Date": "2021-08-26T02:32:51.000Z",
          "Titre": "Stay away from Billio",
          "Contenu": "Stay away from Billio. They're the worst. They will take your money and disappear. They have no control over their creators. Their \"creators\" stole my product, and they can't even get in contact with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aijalon Wallace",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T14:12:15.000Z",
          "Titre": "Horrible delays, you'll never get your video in time.",
          "Contenu": "I've been waiting for my video to get made for the last 16 days. This company is very unprofessional and has no sense of emotional intelligence."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 4,
          "Date": "2021-09-03T21:28:58.000Z",
          "Titre": "Their platform is trash",
          "Contenu": "1. You can't communicate with creators that are working on your project.2. There is no way to see the past projects a creator has worked on.3. Billo does not enforce the content deadline for creators - we waiting more than three weeks after they submitted the content.4. The Billo customer service team is terrible and will do things like removing a creator from your task without clearing it with you beforehand. 5. Even if a customer support rep shows as \"online\" you can expect to wait up to 48 hours before they message you back in the \"live chat\". 6. Most of the creators are completely un-vetted, there is no way to check reviews on them, and they normally provide significantly worse content than is shown in their \"preview video\". All around this startup had a great idea and then did a terrible job executing it. It's pathetic to see this since there are SO MANY platforms they could have modeled theirs off of and chose not to. Run the other direction - these people will ruin your project deadlines and do not care about your business at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KB",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T14:36:18.000Z",
          "Titre": "PASS if you are in the pet supplies industry",
          "Contenu": "I work for a small pet supplies e-commerce business and we so wanted Billlo to work for us but no matter how we worded things, we never got exactly what we wanted. You would think that if you were going to make a video about pet supplies, that you would have a pet in your video, but 3 out of the 5 videos we paid for didn't have pets. We thought that would be common sense. Before signing up for Billo, I even reached out to their customer support and asked if they had creators with pets for pet supplies and I was assured there would indeed be creators with pets. One video we requested edits to eventually gave us a pet, but it wasn't the right pet (we wanted a guinea pig or hamster and we got a rabbit). One woman applied to our \"task\" of making a video about our mini dog tennis balls and she didn't even have a dog! For the last task we created, I specifically said do not mention anything, just show your dogs playing with this product, and then come to find out later when reviewing the video (which had mentions) the people working for Billo kept telling the creator to add sound, even though we didn't want any. I do not feel the people running Billo are competent enough to give their customers what they want for businesses in the pet supply industry. We won't be using them again."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Joe Hero",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T18:07:24.000Z",
          "Titre": "the support are unresponsive",
          "Contenu": "the support are unresponsive, worst customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Walter White",
          "Nb_Reviews": 31,
          "Date": "2021-01-13T06:17:48.000Z",
          "Titre": "billo.app video reviews - BAIT AND SWITCH SCAM!!!",
          "Contenu": "So here we go. Stay away from these people as they will charge you and provide you with hideous services. No quality control. If you order product reviews, half of their reviewers will say that they did not receive your product to steal it. The other half is not oriented and videos you will get will be the quality of $5 videos on fiverr. This is bait and switch scam. I tried to work with them, ordered 12 videos. Two were good, the rest, I got another 4, are garbage. For the price they are charging per video, they should be a lot more into quality control. They simply do not care about their business at all. Stay as far away as you can from them. These people are working hard on presentation, but in reality it is garbage - 100% bait and switch. In one video woman can't pronounce my simple company name and reads it from the bottle. In another, she says I am not wearing any makeup when she is wearing thick amount of foundation and lipstick. In another video, she is selling the product, when asked to sound natural. Another video, woman looks like she is PMSing and she is about to murder someone. In another video they do not speak in the camera. Another video, it's a skincare product, they do not even bother to apply the product...  and this list goes on and on.... This is ridiculous. When you approach their customer support over chat, they are oblivious to anything you are asking and pretend they do not understand anything."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Angelo",
          "Nb_Reviews": 1,
          "Date": "2021-09-03T10:55:17.000Z",
          "Titre": "Extremely let down and disappointed...",
          "Contenu": "At first I thought this platform would be an immense help to my business. The ease of use, the simple process and even the great looking UI/UX drew me in.Sadly, my initial impressions were so far from the reality that is this platform. I sent my product over to a creator and after over 3 weeks of not hearing anything, I finally reached out to CS to find out what the issue was (mind you, their proposed timeframe is 5days from when the creator receives your product until you get your final video). Had I not reached out, I would've just been left in the dark not knowing where my money's worth has gone to. Essentially, they said they'd reach out to the creator and after a week of following up, they finally got back to me only to tell me that my creator was deciding to leave the platform. Fortunately, they told me that she finished all her pending tasks including mine and my video was actually ready for approval. I checked my dashboard for the content and I came to find nothing so I messaged them once again only to get left on seen with no response.I write this now, still waiting for a response absolutely appalled at the quality of service of this platform. The big determining factor for me was the CS - had the response times been quick, I would have been happy enough to walk away with a refund no issues.To Mr Deksnys or whoever the fvck is in charge of operations for this company, for the love of god do your customers a favour and hire more customer support staff so they can actually handle the amount of enquires in timely manner."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angie Williamson",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T05:48:58.000Z",
          "Titre": "Save Your Time & Money",
          "Contenu": "Update:Customer Service did email me back and after some back and forth, backed out the auto-approval and I was able to request edits.  I was still unable to communicate with my creator and had to pass messages through CS to her, but they apparently passed the information on.Original review:Customer service number goes to \"busy signal\" and hangs up on you within seconds.  Can't leave a message. I emails to customer svc. go seemingly nowhere.  Creators are unable to manage videos after edits (IF you have the option to request edits at all, which I don't on current video) Once Billo \"automatically approves\" your video (that is stuck and my creator and I can do nothing with) you are no longer able to communicate with your creator.  THE CHAT IS DISABLED!!!! I have worked with 2 creators, and I have 1 video that is not acceptable due to the platform not allowing either of us to manage the videos needing edit.  Creator #1 had to send us the final edit OUTSIDE OF THE PLATFORM.  The second creator offered to do the same, but Billo auto approved while I was waiting for CS to email me back and NOW I CAN'T COMMUNICATE WITH THE CREATOR.  I should also mention I didn't get a video until about 12 BUSINESS days after product was received...but if you don't approve immediately within 3 days...not just business days... (because you're trying to get help from Billo) then Billo auto approves and you are stuck with garbage you can't use and a creator who is helpless to help you. If CS was accessible, it would be better and if you could request and receive a simple reset on the video upload issues by IT, that would also solve a lot of frustration.  My creator was awesome, we really wanted to use her video, but it won't work because she couldn't upload the correct video to Billo. Now it's auto-approved and I can't do ANYTHING.  WORST!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 2,
          "Date": "2021-12-29T18:37:56.000Z",
          "Titre": "Concerns w/ timeliness and communication",
          "Contenu": "Half of the ads so far have been good! The other half have required edits. The proposed/estimated turnaround times have been slower than usual. In one case up to double with no proactive communication or valid explanations. The turnaround time for edits has been extremely slow as well (we still have not received the first edits from a week ago)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nikola Miric",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T20:35:43.000Z",
          "Titre": "You were so slow",
          "Contenu": "You were so slow, one creator never made a video for me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy R. Balfour Dodd",
          "Nb_Reviews": 1,
          "Date": "2021-07-19T20:29:44.000Z",
          "Titre": "Disappointed by the Quality of Service",
          "Contenu": "I wanted so badly to like billo because it sounded like it could be of great value to our company and the reviews looked promising. Unfortunately my experience has not been great. The timelines offered for delivery of videos is completely unrealistic and it has taken at least twice as long to receive my content. There is no easy way to communicate with creators, so there is no opportunity for them to ask follow up questions, and there is no way to give them feedback. Finally, the only customer service offered is a message system. There is no email and no chat, and messages can take 1/2 day to 24 hours to be responded to. Customer service was slow and unclear. I still have no idea why my videos have been as late as they have been, and certainly, nothing was done to make up for it. I am very disappointed that billo did not live up to my high hopes for the service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Savurah Lyfe",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T10:36:22.000Z",
          "Titre": "POOR CUSTOMER SERVICE",
          "Contenu": "POOR CUSTOMER SERVICE. Refuses to let me make revisions on my video content after paying $108 for their services. Slow response time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Desarae Pointer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T03:31:51.000Z",
          "Titre": "The pay is too low",
          "Contenu": "The pay is too low. There are brands wanting videos that require labor: writing a script, filming, and editing and paying less than $100. Moreover, these business will run ads on your work and profiting greatly. The creator is severely underpaid. This app is good for someone brand new at content creation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T14:36:03.000Z",
          "Titre": "The platform was easy to use and the…",
          "Contenu": "The platform was easy to use and the creator did a great job, but there were zero email notifications throughout the process. I had no clue whether my product made it to the creator or not — I had to check the tracking number on my own to confirm delivery, and there were no notifications when the creator uploaded a video. I just happened to think about Billo randomly and a 'wonder whats going on with it' type thing so i logged in and saw the creator had uploaded the first video 3 days prior. Thats a 3 day delay in getting my video. There's no reason for that to happen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debbie Bittke",
          "Nb_Reviews": 2,
          "Date": "2021-11-30T18:21:24.000Z",
          "Titre": "I gave my review only 3 stars because…",
          "Contenu": "I gave my review only 3 stars because it took many weeks and help from the Billo Tech team to even get my  information to an influencer.The end result from the influencer was amazing! I was very happy when I saw the video my 1st influencer created for me.I immediately purchased two more influencer videos."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alejandra Franco Tobar",
          "Nb_Reviews": 1,
          "Date": "2022-04-17T02:50:26.000Z",
          "Titre": "With this update",
          "Contenu": "With this update, now is way harder to get hired for content creation, if it's not weeks or months to get another gig. Still very good but too slow to get more approvals."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Olivier D.",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T09:05:37.000Z",
          "Titre": "subtitling to be improved",
          "Contenu": "Obviously the creator was a bit quick in recording the sequences, with a very uneven quality of light. And above all there were many inconsistencies in the subtitles, to the point of making some sentences completely incomprehensible. I know that Billo's service relies heavily on automation - and that's what makes it so competitive - but such flawed texts should never be presented to the client."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karmine",
          "Nb_Reviews": 2,
          "Date": "2021-12-14T21:39:21.000Z",
          "Titre": "It's ok",
          "Contenu": "I like the video I received but it took over 2 weeks to receive it. Also I had a hard time opening the download on my iMac. I'm also having difficulty using it in a FB ad."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nomxolisi Ndlangana",
          "Nb_Reviews": 2,
          "Date": "2021-12-24T22:40:35.000Z",
          "Titre": "they just upgraded their app",
          "Contenu": "they just upgraded their app, much faster - love that! if only they can get videos approved from companies faster, that would be great! good update billo! keep at it!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nomxolisi Ndlangana",
          "Nb_Reviews": 2,
          "Date": "2021-09-13T19:31:36.000Z",
          "Titre": "Pay is not paid out twice a month like…",
          "Contenu": "Pay is not paid out twice a month like you say so, that needs to be corrected. Communication between billo support and creators needs to be clearer because suggesting that a creator will get paid more and then not honoring that is dishonest and disheartening."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Courtney Blacher",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T15:15:09.000Z",
          "Titre": "You guys need a better platform and an app",
          "Contenu": "Love the idea of the service but your platform is very outdated and a pain to use. First, there needs to be an app. Second, you need to offer the ability to communicate with the creator even if the message needs to be approved before being passed on. I needed to get my creators size because my item was clothing but there was no way for me to ask for those information. I had to contact customer service and wait a day and a half for someone to respond. This made my shipping later and I kept getting email after email reminding me of this but there was nothing I could do without knowing her size. I’m still waiting for my creator to create my video so I can’t really comment on the service but I will once I see the video."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brad Rubin",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T19:14:03.000Z",
          "Titre": "Changed my mind...",
          "Contenu": "Didn’t receive my videos and it was difficult getting an answer from them...UPDATE: Just received one video and it looks like they refunded me the money for the other video so I edited my review."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lexi Balkjy",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T17:01:16.000Z",
          "Titre": "Billo is great for a little side…",
          "Contenu": "Billo is great for a little side hustle, some things can be improved, but overall would recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KE",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T11:45:38.000Z",
          "Titre": "I think the staff at billo.app is quite…",
          "Contenu": "I think the staff at billo.app is quite helpful. The one thing I wish would change is that it may take a little time 1 business day or more to hear a response.What I would like to see from the creators on the app is to see more diversity in the videos they do. It seems as though most are used to doing ads so if you order an honest review or a how to it still comes out like a tik tok ad. It would be great to invite creators from the examples page. Also it would be nice to have a photo option for product images, product photography and modeling product in still shots."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kirstie Knight",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T13:47:13.000Z",
          "Titre": "Easy & Convenient!",
          "Contenu": "Billo has been great to work with; so easy and convenient! I will say there are a few things that could be better which is why I gave 4 out of 5 stars. Clarification on a few video do's and don'ts would be better but overall it is a great app and company!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ace",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T10:49:07.000Z",
          "Titre": "As a creator I want the app to work with me",
          "Contenu": "The constant improvement of the application making the process as a creator more easy and less stressful. Things like giving us a chance to reupload anytime we need instead of having to wait to be denied was a huge game changer. As a creator I need the app to work with me and not against me. Also, the team is always there to help and they are transparent with a great attitude."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Evans",
          "Nb_Reviews": 1,
          "Date": "2021-11-20T23:22:03.000Z",
          "Titre": "Billo is amazing and I love working with them!",
          "Contenu": "I really really love working with Billo! It's a great experience and it has become a good source of income for me. Love all the free products too. Overall, it really is amazing and I love it!The only reason I rate 4/5 stars is because of the communication. Sometimes, it seems that they over-communicate or utilize the wrong channel of communication and that makes it sometimes difficult to keep track of products and tasks. I actually find that it puts me more behind sometimes because I'm checking things I might not need to check (for example, there could be one email thread that they talk about 10 different tasks in). Its hard to find emails with information you need because I never know where to find it easily."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caitlin Goodwin",
          "Nb_Reviews": 1,
          "Date": "2022-06-18T21:37:39.000Z",
          "Titre": "Great app!",
          "Contenu": "I have really enjoyed this platform so far. I am starting my UGC creator journey and this seems to be a great place to start. I love how when you submit your pitch video, you get quick and respectful feedback if it doesn't quite meet the standards. Along with this I love how quick I got my questions answered from the billo team themselves. Great app with great campaigns to apply for!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Déja Denise",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T20:53:29.000Z",
          "Titre": "GREAT income stream; Brands are too ambitious for $25",
          "Contenu": "I do very much enjoy using Billo as a way to supplement my income! If you're working consistently, it's easy to make $1000+ from it a month.However, I have issues with the timer system as you have 5 days to make the video and get it back to the brand. That timer does not pause if you're waiting on a response from the brand or from Billo support (who has taken 4+ days to get back to me at high volume times). Or during the holidays, which I do think is unfair because most people aren't working then, so I think there should be some sort of holiday pause.I also think that some brands ask WAY too much for what they're paying for. They pay $25 for a video expecting to get the quality of something that people pay hundreds and thousands of dollars for. As a creator, it's very frustrating. Otherwise the app is very straightforward, Billo support is very friendly and supportive, and there's such a wide array of products!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RKA",
          "Nb_Reviews": 1,
          "Date": "2022-01-20T04:19:05.000Z",
          "Titre": "Slow but high quality customer service",
          "Contenu": "The CS team was able to complete my request (inviting a particular creator to apply for our task) successfully! We just wish the CS response time were shorter, there is usually quite a lag but then they are very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vivian",
          "Nb_Reviews": 2,
          "Date": "2021-09-22T21:39:49.000Z",
          "Titre": "Upgraded Review",
          "Contenu": "Previously, I submitted a one star review as a result of contacting customer service each day for four days consecutively. Although each of my messages was read, not one actually resulted in a contact to address my concerns.I was finally able to get a response by writing a scathing review and emailing the help desk at Billo.Billo was quick to respond (in less than a day) once I reached out that way.I was fully refunded for my video and the video was reshot.Although they made it right eventually, I would have been much more satisfied had they addressed my concerns on the first contact rather than completely ignoring me until I could no longer be ignored.I highly recommend contacting the help email first to avoid frustration if there is an issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Righteous Nacho",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T19:14:40.000Z",
          "Titre": "So Far So Good",
          "Contenu": "I created my video pitch yesterday, and it was approved in less than 24 hours. Now I already have a product on the way to review!The staff is fantastic. They messaged me to let me know how happy and excited they are for me to get started and told me not to hesitate if I have any questions.Looking forward to the journey!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ali Soomar",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T04:46:57.000Z",
          "Titre": "Billo has been super helpful in getting…",
          "Contenu": "Billo has been super helpful in getting great content creators for my products! The only thing I wish was that the line of chat between me and the creators was quicker. The products that I sell have a lot of customizability with audio and video uploads that I am not able to ask creators for directly in the task so I have to always go through a rep which makes it a little bit longer. Another alternative would be if I could give the creators a discount code to purchase anything from my store, since this eliminates me from having to chat with a rep to get creators' preferences."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allison Lazor",
          "Nb_Reviews": 1,
          "Date": "2022-06-30T21:09:41.000Z",
          "Titre": "I am LOVING Billo.",
          "Contenu": "I am LOVING Billo.My biggest concern is after someone else has been selected for a job, it still shows in my 'applied' list. If  it is no longer available, I would like it to 'go away' so I can see what I still have applied for that is available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juanita Juana",
          "Nb_Reviews": 1,
          "Date": "2022-02-19T01:09:00.000Z",
          "Titre": "So far OK",
          "Contenu": "Its takes a long time to get to someone when you have a problem, due to the chat and hours. I had a log in issue and chases them around internet which got a response. After which they solved it quickly. Can't do 5 yet because I am still waiting to experience the rest of the process."
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "Taiwan OneJoy",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T04:57:22.000Z",
          "Titre": "Amazing",
          "Contenu": "Amazing, due to the creator can catching the feathers from consumer use sight within short time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2021-11-25T22:48:50.000Z",
          "Titre": "Great Side Hustle!",
          "Contenu": "Billo has been a really great side hustle for me, and a way for me to put my acting, videography and editing skills to work! However, the deadline aspect of it can be confusing since items I havent even gotten yet are marked as due within a day or a few hours. I also think that Companies and offers need to be clearer with their directions, and what they would like their ad to feel/look like. I have gotten feedback on videos feeling “scripted”, when all I received for directions was direct quotes and product information, and no mention of making it sound candid or personal. If the descriptions and content direction was clearer, that could save time that is spent on re-filming and re-editing. I also know this is true due to offers that note that they want humor or personal experiences noted are created and approved quickly, because they were clear from the beginning. Other than that, I’ve had a great time using it so far and I’m looking forward to working with Billo more, especially if they continue to make improvements and allow for ways to increase earnings."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vin K",
          "Nb_Reviews": 2,
          "Date": "2021-12-29T21:44:01.000Z",
          "Titre": "Simple and easy",
          "Contenu": "Simple and easy. Great value. Could use some additional features but I assume that'll happen as the platform matures."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danielle Leira Smith",
          "Nb_Reviews": 3,
          "Date": "2021-12-27T17:00:05.000Z",
          "Titre": "Great and easy way to make extra cash",
          "Contenu": "Great and easy way to make extra cash, some companies should be more specific so there is much kickback."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jolie Barreta",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T04:07:12.000Z",
          "Titre": "it is an excellent application.",
          "Contenu": "Without a doubt, the best collaboration software I've ever used! It's a breeze to use, and the service and interactions are excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Javier Urias",
          "Nb_Reviews": 3,
          "Date": "2022-05-27T13:26:14.000Z",
          "Titre": "I guess I’m learning that not every…",
          "Contenu": "I guess I’m learning that not every project i apply for will respond."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Johanna Mullen",
          "Nb_Reviews": 1,
          "Date": "2021-11-29T15:06:19.000Z",
          "Titre": "fun app",
          "Contenu": "fun app, very responsive team, and great source of additional income."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Meg Vill",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T13:45:32.000Z",
          "Titre": "Great app but needs improvement",
          "Contenu": "Overall, I love using the Billo app. It’s a great way for content creators to find consistent work and to work with some really awesome brands. However, the app itself is sometimes buggy/loads slowly and the deadlines for tasks are very unrealistic. Hopefully, this will be adjusted in the future as it minimizes the amount of time, effort and work people have to do in order to create the videos for these brands."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victori’Ahh’s Vanity",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T22:43:33.000Z",
          "Titre": "Billo is a great app!",
          "Contenu": "The app is pretty simple to use. Shortly after I submitted my job description on board, a bunch of influencers applied to my gig! I liked the part that I get to choose who I wanted to hire to do the video. Their staff are also pretty responsive. I would give it a five stars rating, but my influencer took forever time to record the video."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jasper Dewitt II",
          "Nb_Reviews": 1,
          "Date": "2021-09-13T19:10:45.000Z",
          "Titre": "Great Side $$ Just Needs Adjus",
          "Contenu": "This app has been a lifesaver for me! It has helped me tie some loose ends financially many times. The only issue I would have is keeping at the income consist rate. Also there needs to be more control on the brands and how they interact with the creators. There’s been many instances where some brands just didn’t have any respect for the process. I did three edits on their video, and in the end they decided to request a refund. It’s a waste of time to work with a brand that is not working well with the creator. There’s nothing on the app that controls the brands in the number of edits they request."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kaoutar Talibi",
          "Nb_Reviews": 1,
          "Date": "2021-09-13T19:21:04.000Z",
          "Titre": "Brands needs to put more details on…",
          "Contenu": "Brands needs to put more details on tasks for us creators. How to pronounce their brands name and what kind of energy they want - chill or super enthusiastic. Other than that, Billo customer service have Been above and beyond."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karina Williams",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T15:28:18.000Z",
          "Titre": "I love the app but deadlines",
          "Contenu": "I love the app but I have had deadlines go over before I even received the item. I also have had deadlines say one this and then When I refresh the app it says something else. That’s my only concern with the app because it can be stressful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim B.",
          "Nb_Reviews": 3,
          "Date": "2021-05-19T17:28:39.000Z",
          "Titre": "Overall solid experience",
          "Contenu": "Overall solid experience. I tested Billo out with just two videos to see how it went. You definitely have to sift through A LOT of terrible influencers that apply to your openings, but I was able to find 2. Most of the influencers don't do anything spectacular in making your videos, so don't expect them to make you videos that go viral or anything, but for the price compared to what it would cost us to film and edit these on our own, it's a great bang for your buck! I do like how fast Billo moves the process along. A lot of influencers take their sweet time once shipped product, but Billo ensures that they have their videos created in days which is great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica Raia",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T16:02:00.000Z",
          "Titre": "I love this app and it has helped me. A couple notes :)",
          "Contenu": "I love this app and it has helped me make some much needed money on the side of my full time job.The app is pretty slow, takes some time to load each page, when navigating between different jobs to post a bunch by a deadline this can be annoying, but manageable.Sometimes the app sends SEVERAL notifications to upload for a product that wasn’t received yet or sometimes not even sent out yet! This annoys me, would rather only get helpful notifications and relevant/truthful reminders.Aside from that i think alot of more people have joined the app so i dont get accepted to nearly as many jobs as when i first started. Hoping that they start getting alot more open spots so its still just as easy to make a good amount of money on here! :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "zee “milk” goncalves",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T13:54:28.000Z",
          "Titre": "love it",
          "Contenu": "great idea! i love that we are given an opportunity to represent brands we love. unfortunately, all of the campaigns i’ve applied for have been rejected, but i will definitely keep applying!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Provenzano",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T13:36:18.000Z",
          "Titre": "I enjoy creating for the tasks that I…",
          "Contenu": "I enjoy creating for the tasks that I have been blessed to receive so far. I do have some recommendations that would probably make it easier for everyone as I do more and more of these."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deborah Adeboye",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T15:09:54.000Z",
          "Titre": "I really love this app",
          "Contenu": "I really love this app. I started using it in November 2020 and today is April 1,2021. I’ve been paid close to $600 and have completed 30 job opportunities. This may not seems like a lot, but I’ve been able to upgrade my phone to make better content. I really have tried other apps and they aren’t like Billo.app. I wasn’t paid to write this review. I just believe that they are doing a great job. They customer service is amazing 95% of the time. When the task you submit is reviewed they email you with things they would like you to change and there have been a couple instances where the tone of the email seemed harsh. I have this theory that you get approved for more tasks the longer you stay with them. Right now, I have 5 tasks I have to complete and 2 being reviewed that in total is over $100 plus they pay biweekly. I’ve an an amazing experience overall. No big complaints over here. Try it out for yourself!😊"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherlline “Shey” Carillo",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T10:19:30.000Z",
          "Titre": "So far...so good...",
          "Contenu": "Its a good experience out of the first 3 creators I hired. The first two was easy and seamless, but the 3rd creator had so many issues that I ended up waiting more than a month and still unable to do the task. When reaching out for customer service they were able to help and refund my money from the 3rd task. So I am able to hire another one. What I just find inconvinient is that there is no way that I can reach or message the creator. If you have any issue or something I have ti always go thru a third person from the company...which causing alot of delay due to communication barrier. I wish there is a in-app messaging that the your company and the creator can use to communicate. If they are afraid of anything for not giving the creatoes details.. they could atleast set some sort of guidelines. Over all, I will use the app to get creators for my brand due to convinience...esp for me who still have a part-time job and dont have time to create videos."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Charles Larger",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T14:45:18.000Z",
          "Titre": "Great after-sale / customer service",
          "Contenu": "Great after-sale / customer service ! Thanks"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Martin Amodeo",
          "Nb_Reviews": 2,
          "Date": "2021-05-19T16:30:50.000Z",
          "Titre": "Easy to use & saves time when not able…",
          "Contenu": "Easy to use & saves time when not able to find influencers"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Indi Guy",
          "Nb_Reviews": 1,
          "Date": "2021-09-13T20:32:33.000Z",
          "Titre": "Great Up and Coming App",
          "Contenu": "It’s a great app a little slow at times but a great app."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Deepak Singh",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T12:53:31.000Z",
          "Titre": "The service is good but you should know…",
          "Contenu": "The service is good but you should know what you want"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shammar Abdul-khaaliq",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T03:00:58.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, great customer service. Would like higher paying campaigns.But overall great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Wagner",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T07:20:42.000Z",
          "Titre": "I was very nervous initially to make my pitch video but quickly overcame the nervousness because of the simple instructions given to me.",
          "Contenu": "I was very nervous initially to make my pitch video however the rep at Billo, particularly Ausrine, was so helpful in helping me with certain video questions that I just trusted her and the process, followed Ausrine's notes and moved forward!  I am grateful to keep doing the instructions given to me but it started with Ausrine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy Fillpot",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T06:06:46.000Z",
          "Titre": "I’ve been very happy with Billo",
          "Contenu": "I’ve been very happy with Billo. I’ve been connected with several brands and creating content for great products I can really get behind. I’m getting to discover new and exciting products, create UGC videos, and getting paid by the brand for my content."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ron",
          "Nb_Reviews": 3,
          "Date": "2023-09-12T15:48:04.000Z",
          "Titre": "A must in 2023 for businesses",
          "Contenu": "Honestly, if you're not using billo in your business you're missing out. I'm gonna go out on a limb and say most businesses don't have someone who can, will or wants to get on camera and the people you find here are THE camera people you need for your business. There are so many positives here I am afraid to even list them all out."
        },
        {
          "Note": 5,
          "Lieu": "AW",
          "Pseudo": "Estelle",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T02:10:58.000Z",
          "Titre": "like everything about it",
          "Contenu": "like everything about it. How to navigate through the website is easy. I like that people can apply for your task and how that is set up. I do think it's pricey, but the quality is there so it's definitely worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth Smith",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T17:24:56.000Z",
          "Titre": "Great Video for Niche Market",
          "Contenu": "We are in a niche market, so I was skeptical that we were going to get creators who were qualified to speak to our audience. Within 24 hours, 2/4 who applied were definitely qualified, and the one I chose knocked it out of the park!We'll test this video, but we will likely be back for more! As a one-man marketing team, not having to spend time making videos for our ads is fabulous and well worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kollet hardeman",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T01:05:05.000Z",
          "Titre": "I use five different UGC apps and Billo…",
          "Contenu": "I use five different UGC apps and Billo has the largest amount of open/viable jobs in its marketplace. It pays on time, has a clear system and supports the content creator if there are ever any issues. It’s hands down my favorite"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Mowbray",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T16:19:02.000Z",
          "Titre": "Perfect Place to Create an Ad",
          "Contenu": "So far Billo has been fantastic! I had a little trouble navigating through the process, but was able to get the job done and my video was released on TikTok yesterday. It is definitely getting some traction, but people seem to be window shopping the first day. I will continue using Billo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sergey",
          "Nb_Reviews": 4,
          "Date": "2023-01-25T18:49:11.000Z",
          "Titre": "Getting a video here is EASY",
          "Contenu": "Getting a video here is EASY, no matter whether you need 20 videos or just one. The process is fast, easy, and straightforward. Not the case with most other similar services with their MOQs, credits, and subscriptions. The creators here are top notch too, especially if you choose the premium video. Every project usually gets not less than 5 creators."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "alexandra wagner",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T23:43:49.000Z",
          "Titre": "I think this is a great place for UGC…",
          "Contenu": "I think this is a great place for UGC Creators to get started. User friendly and their support team is always very kind and helpful. Ad campaigns are updated almost every day and I've enjoyed earning money by filming videos for products im interested in. In the future I would love to see this app roll out their own in app editor software to make the process more streamline, in addition to making this app accessible on desktop too so I could edit and upload from my laptop. Overall, I think this is a great platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devon White",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T01:45:09.000Z",
          "Titre": "I've been creating on the platform for…",
          "Contenu": "I've been creating on the platform for a while now. It's very easy to use and the creator support I've received thus far has been extremely helpful. As a Creator this has helped me grow my experience and portfolio. The pay is fair for the most part and many other opportunities to earn as well."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Karen Villard",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T07:03:32.000Z",
          "Titre": "The best in the biz - UGC for all sizes!",
          "Contenu": "Billo is like a friend, they're always an email away and can talk to anyone within the 24 hours - someone's always awake, which is quite good for HK businesses like us.  It takes a whole chunk of weight in figuring out how to reach to high quality influencers and/or content creators and still have the control on how you'd love to receive your assets.  It's very flexible from videos to photos, to any social platforms, videos of all shapes and sizes, and diversified crew of options that you will love.  The creators are professionals and are visionaries that takes away the pain (and the hours) in video creation.  I feel like I have a whole team behind me with Billo's help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Scrivens",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T22:06:02.000Z",
          "Titre": "Everything is just so simple",
          "Contenu": "Everything is just so simple. Connecting with these brands makes things extremely easy.You know exactly what you're getting into even before you apply and when you're accepted, you don't need to ask any questions. Billo definitely makes things as easy as possible for creators and brands."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Wagner",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T18:08:59.000Z",
          "Titre": "Billo is fantastic!!!",
          "Contenu": "Billo is fantastic for anyone wanting to work as a full time content creator and work with a variety of awesome brands! I’m so grateful I found this app!! The team is always sweet and helpful and I love getting paid to create :)"
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "amber lin",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T08:44:08.000Z",
          "Titre": "It's user friendly platform to reach UGC",
          "Contenu": "It's user friendly platform to reach UGC. Allysa answered our question promptly and correctly. Even offer more information about Amazon Video regulation to assist us have much better understanding. Excellent service!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mikelle",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T22:33:41.000Z",
          "Titre": "It's been a great experience!",
          "Contenu": "I'm new to the platform and am still trying to learn how it works.  I've made a few requests and edits and the bill team has been incredibly accommodating and helpful.  It's been a great experience.  I've already told a few fellow business owners about it and they've submitted orders already as well.  Great experience!And special shout out to Jalesa (one of my content providers).  Her video rocked!  I watched it at least five times when she first sent it because I loved it so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber L.",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T14:46:15.000Z",
          "Titre": "It’s like having a personal assistant!",
          "Contenu": "I love Billo! It’s like having a personal assistant manage all your clients and you just focus on creating videos. Everyone is very nice and understanding which makes the creative process so much easier. I’m a stay at home mom and it’s been the perfect way for me to use my skills to make extra cash while being there for my kids 24/7. It’s amazing!"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Sabrina Levin",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T14:34:05.000Z",
          "Titre": "5*s for a 5* Platform! :D",
          "Contenu": "Billo has not only been able to provide us with incredible content creators from a variety of ages but also they have been there every step of the way helping us from A to Z. A special shout out to Jomantė who has been the biggest support at helping us achieve all our goals. Billo has everything you need in one place and we could not be more happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Milledge Austin, IV",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T17:25:48.000Z",
          "Titre": "I love Billo.app",
          "Contenu": "I have really enjoyed being able to use Bill.app to make a little extra money, and to work on becoming more creative with my short-form video skills. There is a wide variety of products to apply for. Some have very specific shot lists they are looking for, while others are more open to the creativity of the producer. Either way, you have a chance to use some great products and produce short, portfolio-worthy videos. And while the app is constantly changing, they are changing it for the better, including being able to chat directly with the companies to make sure you make the video they want."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Newman",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T20:31:17.000Z",
          "Titre": "Everything went very smoothly",
          "Contenu": "Everything went very smoothly, and the creator did top-notch work. This project was coordinated outside of the Billo web interface, because it is a 'beta' offering. I suspect that partly explains why I had such a good experience. My only previous experience with Billo was through their web interface and it was a very confusing UI. This time around, I communicated via email with Billo folks and it was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allan Shulman",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T19:32:10.000Z",
          "Titre": "You can spend hours negotiating…",
          "Contenu": "You can spend hours negotiating every detail of a project with an influencer, or you can submit your project through Billo and have dozens of influencers apply... for $59.After using Billo for 2+ years for both myself and my clients, I have nothing but great things to say about the service.Tired of getting ghosted by influencers? BilloTired of drafting model releases? BilloTired? Billo"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Gabby Vargas",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T06:23:13.000Z",
          "Titre": "First Impression Lasts",
          "Contenu": "This was our first time outsourcing a video from Billo. The process is smooth and the UI is user-friendly. We asked for some revisions even it's already outside the given timeframe and the Billo Support Team was really great in helping us. They were able to accommodate all our add-ons without additional cost! We will definitely use Billo again in the future! Great job guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taylor Peters",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T05:15:34.000Z",
          "Titre": "This company and platform is so...",
          "Contenu": "This company and platform is so amazing! It offers creators an opportunity to earn extra income with their work and offers brand a way to get more marketing a brand recognition through UGC ads. 5 star platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erica",
          "Nb_Reviews": 1,
          "Date": "2021-12-04T17:06:52.000Z",
          "Titre": "Very Grateful",
          "Contenu": "I have been able to work with some amazing brands and I loved every single product I had the opportunity to review via the Billo.app. The creative and collaborative process has been phenomenal and I am so grateful for all of the Billo.app representatives and team members that are graciously helpful whenever I need any assistance! Thank you Billo.app for giving me such a wonderful platform as a content creator."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Destiny Armstrong",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T03:29:10.000Z",
          "Titre": "This app and service is great for…",
          "Contenu": "This app and service is great for creators who want to elevate their video skills as well as on camera presence. It's super easy to apply and completes jobs/tasks and I get paid regularly every two weeks. I'm so happy I found out about Billo!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JG byan",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T21:33:50.000Z",
          "Titre": "ok so tbh starting off using the app…",
          "Contenu": "ok so tbh starting off using the app felt a little overwhelming but eventually I was able to figure it out and what really made me rate them a 5 star was my creator I had do my video. I believe his name was David or Daniel? C. Oh I've forgotten his name. David I think! His energy and vibe made our video perform so well in our ad campaigns we were testing... so we were very pleased! Definitely recommend billo and David. (I hope I'm getting his name right!) Solid company. Will be using again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Crable",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T23:00:13.000Z",
          "Titre": "I absolutely loved bill and my creator…",
          "Contenu": "I absolutely loved using billo! my creator david clark… He was exceptionally good at being on camera and he could probably be in movies i swear! Overall im very happy!! Will definitely be using agaim!"
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Стани Иванов",
          "Nb_Reviews": 3,
          "Date": "2021-10-17T19:54:38.000Z",
          "Titre": "Here si the deal",
          "Contenu": "Ok, so I have used the platform twice for now, I gotta say, it is a little bit expensive. But it's definitely worth every dollar. The customer service so far is great and the influencers or models are doing an awesome job as well.I will continue ordering."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cuppa Joe’s",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T18:14:45.000Z",
          "Titre": "Outstanding Platform",
          "Contenu": "You won’t find a better more affordable way to generate UGC videos, ads, reels, tik toks, etc for content to your brand. These people know what they’re doing and it shows!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abimbola Okubena",
          "Nb_Reviews": 3,
          "Date": "2022-01-09T12:18:50.000Z",
          "Titre": "Bilio provides great value for its offerings",
          "Contenu": "Bilio is awesome most especially for the value you get based on the amount spent. This is a wonderful service using near professional videos to promote goods and services. Definitely using again and spreading the words to my Stanford Seed Network group."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MSI Credit Solutions",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T19:21:09.000Z",
          "Titre": "Honestly, they made the experience so easy!",
          "Contenu": "Honestly, they made the experience so easy! We had no trouble easily telling them what we wanted picking the right people for the job and then we didn't have one video that we had to have them re-film. They did such a great job and my applause goes out to Billo!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-11-03T14:19:37.000Z",
          "Titre": "I hired Tracey and Michele",
          "Contenu": "I hired Tracey and Michele, both authorities in their own right. I spent a little time and gave them a sample of what I provide. As a trainer, I’m always happy to provide a service and they showed such appreciation, both in feedback as well as their awesome commercials!!!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Olivia Illescas",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T23:11:54.000Z",
          "Titre": "i discoverd Billo though Tiktok and i…",
          "Contenu": "i discoverd Billo though Tiktok and i wanted to try it since I work in a e-commerce brand, I really like the transparency behind everything; timing, pricing, support answers quickly, so Im gonna be using them for other videos. A tip i would give to people who want to use Billo it so have a clear brief setup: aesthetic, look, instructions, so you get what you are looking for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon Janoski",
          "Nb_Reviews": 2,
          "Date": "2022-09-21T17:24:32.000Z",
          "Titre": "Billo has been a great resource",
          "Contenu": "Billo has been a great resource in connecting me with brand and brand work. The app is super easy to use and the request are formatted in a way that's super easy to understand.Not to mention the representatives at Billo are nice , helpful and very communicative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TIFFANY TAVAREZ",
          "Nb_Reviews": 2,
          "Date": "2021-12-02T20:08:13.000Z",
          "Titre": "Love Billo!!",
          "Contenu": "I love being a creator for Billo. I get to try so many new products and get paid to make cute videos. It’s a great way to work from home  and make extra cash. I am very grateful for the opportunity to work with different brands without having to worry about my follower count or posting on my social media. I’ve learned so much about. Billo sometimes has free classes and bonuses for creators. Also s want to add that the Billo team is awesome!! They have great customer service and are always very helpful."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Mattia Righetti",
          "Nb_Reviews": 4,
          "Date": "2021-10-29T19:32:21.000Z",
          "Titre": "Billo service is amazing!",
          "Contenu": "Billo service is amazing, really great customer service, fast and kindly available to help you with customization of contents, and my video was great at the first time. I'm really happy about this service, and I'll use it another time in the future for other videos for sure. Thank you for the great work.Mattia"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ZitaRose",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T23:07:34.000Z",
          "Titre": "I really enjoy this app",
          "Contenu": "I really enjoy this app. The team is super supportive and responds to questions promptly. I love having the opportunity to choose and review products that I have a genuine interest in. It’s nice to get extra spending money twice a month."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deanna Frazier",
          "Nb_Reviews": 2,
          "Date": "2021-12-09T22:02:08.000Z",
          "Titre": "I’ve been working with them for a few…",
          "Contenu": "I’ve been working with them for a few months. I’ve been very ill and a recent loss. They’re understanding and empathetic! I couldn’t ask for a better team! No problems with applying for campaigns and getting paid. Billo.app listens and follows through!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindi Silva",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T17:49:49.000Z",
          "Titre": "This is my best job ever",
          "Contenu": "This is the best work I've ever had, the billo team is great, everyone is super friendly and efficient, the app works great, it is updated daily with new offers and opportunities. I feel very happy and comfortable with this team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tron McBride",
          "Nb_Reviews": 1,
          "Date": "2021-11-16T14:21:21.000Z",
          "Titre": "My experience with billo has been a…",
          "Contenu": "My experience with billo has been a good one. I always get the opportunity to work with cool brands and awesome people. The chat is great They respond in a reasonable time and is always nice. I have recommended billo to other content creators and will continue to do so."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronda Cook",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T02:32:05.000Z",
          "Titre": "Amazing Services",
          "Contenu": "I’ve had two promo videos, for my online business, created by Billo, and so far so good. The creator’s have done an amazing job, on my videos, and Billo’s support team has always been available when I needed them most. Thank you for your services, Billo. ❤️"
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Merilin Bozhilova",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T07:38:59.000Z",
          "Titre": "I really appreciate the partnership!",
          "Contenu": "I really appreciate the partnership with Billo. The support is great! Also, it's very easy to create tasks and get videos. There is a large selection of creators. I also like that I notice progress in the platform and include new options. Good job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brook",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T14:06:43.000Z",
          "Titre": "It's the great customer service for me",
          "Contenu": "It's the great customer service for me. The billo team is always on it. When ever you have a question or concern they take care of it around the clock. Although I have a small business (for now) they make me feel like NouvoBody is a huge brand and I'm a VIP client. I love that!  Thank you for allowing me to connect with great content creators and proving top notch service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tiffany D",
          "Nb_Reviews": 3,
          "Date": "2022-04-04T17:51:38.000Z",
          "Titre": "so grateful for this service!",
          "Contenu": "Billo has been super easy to use, and has provided great high quality content. As someone who has struggled with influencer content in the past - this company was such a relief! It has a great price point, and such a range of different tips of video you can get. Within two weeks of my first order, I was already getting my second! Grateful for this service!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Mauro Pacheco",
          "Nb_Reviews": 2,
          "Date": "2021-09-29T08:10:25.000Z",
          "Titre": "Great experience! 10/10 will recommend",
          "Contenu": "Our agency has been working with Billo for some time now and I can say that it's a pleasure to work with them! Videos turned out great and getting edits for tasks are straightforward. The team has also been very helpful in addressing our concerns and questions!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Casey Clark Ney",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:55:12.000Z",
          "Titre": "Billo has been a great resource for…",
          "Contenu": "Billo has been a great resource for connecting with brands. I've also worked with members of the Billo team when I had a few questions about my account. They are always polite and encouraging. I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Cindy Viviana",
          "Nb_Reviews": 7,
          "Date": "2021-12-17T17:48:57.000Z",
          "Titre": "Billo has been super mega helpful to me…",
          "Contenu": "Billo has been super mega helpful to me as I make a great extra income they pay on my PayPal on timethey want to create value to the companies that hire billo but at the same time create value to their content creators"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Trachtman",
          "Nb_Reviews": 5,
          "Date": "2022-11-14T17:25:21.000Z",
          "Titre": "Extremely helpful support team",
          "Contenu": "Unfortunately one of the creators I hired was unable to deliver the video. However, Billo's customer service was very helpful taking responsibility for the issue.I've had issues in the past dealing with company support from other companies, but this was a smooth process and a welcome change of pace.In the future I'd be comfortable going with Billo because of their customer service (and because I've ordered before and was very happy with the result).Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Sergii Savchenko",
          "Nb_Reviews": 2,
          "Date": "2022-05-04T16:14:31.000Z",
          "Titre": "Exellent work",
          "Contenu": "Got a top quality video ad for my Amazon store. Billo have a lot of content creators and, what I especially love, their own graphics team. So they make sure you get the best quality for really affordable prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Scott",
          "Nb_Reviews": 3,
          "Date": "2021-10-18T06:51:48.000Z",
          "Titre": "Billo has been fantastic and their…",
          "Contenu": "Billo has been fantastic and their customer service is top-notch. The creator made the changes I requested and Billo went the extra mile for an additional request that was not included in the package. Thank you, Billo!"
        },
        {
          "Note": 5,
          "Lieu": "AM",
          "Pseudo": "Ilona",
          "Nb_Reviews": 3,
          "Date": "2021-12-11T07:32:17.000Z",
          "Titre": "Customer support is TOP",
          "Contenu": "Customer support is TOP! These people here do care about their clients and do their absolute best to help with any problem that may arise!I've already ordered a few videos with them and every time come to the conclusion that they are the BEST in the current market!Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Laura Jacobson",
          "Nb_Reviews": 3,
          "Date": "2022-12-22T02:38:41.000Z",
          "Titre": "Happy with the results",
          "Contenu": "Happy with the results! Super simple process, lovely creators and customer support. You need to be clear and straightforward in your brief to get the results you want."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan Cross",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T14:49:18.000Z",
          "Titre": "The team is very helpful …",
          "Contenu": "I love that fact the new opportunities come up everyday for you to apply for.  Also if you have any questions the team is always very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheldon&sheniia Leslie",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T17:42:04.000Z",
          "Titre": "Mind Over Matter Clorhing sweatsuit",
          "Contenu": "We got our video in a timely manner and the creator included everything we requested in our video. We will definitely be using billo in the future for our content needs."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Spiro Koulouris",
          "Nb_Reviews": 3,
          "Date": "2021-12-10T20:47:04.000Z",
          "Titre": "Find your creators on Billo",
          "Contenu": "Billo is an excellent platform to find creators to help promote your brand and products. I've used it for many video testimonials and I am very happy with their service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Ann Song",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T17:17:24.000Z",
          "Titre": "Our content creator was awesome",
          "Contenu": "Our content creator was awesome! She exceeded expectations in terms of quality, uniqueness, and in how quickly she turned the video around! The platform was so easy to use!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reid Honeywell",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T20:37:16.000Z",
          "Titre": "Working with Monika is awesome!",
          "Contenu": "Monika is always friendly and gives excellent support. This particular time her responses were quick and resolved all my issues. She is fantastic and I enjoy working with her."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Andreas Häggkvist",
          "Nb_Reviews": 4,
          "Date": "2021-12-23T11:56:45.000Z",
          "Titre": "From 0.3% to 7% CTR",
          "Contenu": "I've been a user at Billo for about a year, having bought their services 4 times... and I have honestly nothing bad to say! They do a tremendous job at the company. The UX is very user friendly, the customer support is amazing and rapid fast and best of all: my CTR on ads went from 0.3% to over 7%. Just make sure to give the creators a good brief and you have one of the best services in e-comm atm."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Velasquez",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T23:09:44.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "Monika has been wonderful with my latest experience in ordering testimonial ads. She was very quick to respond to any questions I had and although she originally helped me with my first task, she didn't even hesitate to assist with a new order. Great customer service overall!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Will",
          "Nb_Reviews": 6,
          "Date": "2022-01-07T22:30:16.000Z",
          "Titre": "Amazing service and customer service",
          "Contenu": "The service has been amazing, and I managed to get a discount around Xmas which was great! I've contacted them 3-4 times to ask questions and solve issues and so far and the the customer service has been exceptional!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mell B",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T00:13:57.000Z",
          "Titre": "Billo is great for advertising your business",
          "Contenu": "Billo is great for advertising your business'. When ever I've had an issue the billo team is there to help with online chatting. I recommend Billo to all that are starting out from scratch"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meda T. Pierre",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T19:48:07.000Z",
          "Titre": "Pauline went above and beyond to take…",
          "Contenu": "Pauline went above and beyond to take care of my request. She manage to remain calm and for caring in what was a very stressful situation for me. Million thanks for the great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hobart Brace",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T16:36:40.000Z",
          "Titre": "A great Billo experience",
          "Contenu": "My Billo task was more involved than the typical task, but the creators were totally up for it. The Billo team was patient and worked with my team and the creators to make sure all the videos came out great."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Christina",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T13:31:03.000Z",
          "Titre": "Great Experience for over a year now!",
          "Contenu": "Mich was really responsive to my needs and came up with solutions immediately.  I would recommend Billo to anyone looking for good value for video content creation.  Excellent service all-around!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Mia",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T11:53:36.000Z",
          "Titre": "Excellent Quality of Videos",
          "Contenu": "We've been using Billo since a few months ago and we really like the results of the video that we requested. We will surely be working with them in getting more quality videos."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy M Cohen",
          "Nb_Reviews": 3,
          "Date": "2021-12-02T19:45:35.000Z",
          "Titre": "Everyone it below is fantastic",
          "Contenu": "Everyone at BIllo is fantastic! The best part of working with Billo  as a creator is learning the ins and outs of how to create amazing content and  everybody is always there to support you and help you in anyway that they can I’m grateful and appreciate everyone at Billo!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "george elerick",
          "Nb_Reviews": 1,
          "Date": "2021-09-17T15:31:26.000Z",
          "Titre": "Being a creator on Biillo",
          "Contenu": "I have been a part of the BILLO As a creator for a while now. It is such a great app. A very supportive staff and community. I love the opportunity to be creative and have the freedom to make money along side receiving great products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Honey Hilton",
          "Nb_Reviews": 2,
          "Date": "2021-10-28T20:03:05.000Z",
          "Titre": "Billo responds very quickly when…",
          "Contenu": "Billo responds very quickly when there’s any concern or issue or question. My content was great except one girl was over 10 days late with the content. But Billo pinged her and updated me."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Cindy Viviana",
          "Nb_Reviews": 7,
          "Date": "2021-12-02T18:56:09.000Z",
          "Titre": "As a content creator it has been a…",
          "Contenu": "As a content creator it has been a great extra income. They pay on time and I get cool products for free (in addition to the payment)They are one of the most friendly companies I have ever worked with. I adore working with them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marj",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T07:34:29.000Z",
          "Titre": "in one day I received responses from 9…",
          "Contenu": "in one day I received responses from 9 women with samples of their work! The video is not made yet but so far I was pleasantly surprised at how seamless it is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lakisha Scott",
          "Nb_Reviews": 2,
          "Date": "2022-03-18T15:43:49.000Z",
          "Titre": "I absolutely love the Billo",
          "Contenu": "I absolutely love the Billo. It so easy to use and the quality of video received from influencers have been great! I will definitely be using them often for my video ads"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melanie Corrigan",
          "Nb_Reviews": 3,
          "Date": "2021-09-15T13:49:49.000Z",
          "Titre": "Billo is amazing",
          "Contenu": "Billo is amazing! Not only can you request to have content created as a brand, but you yourself can apply to make money as a creator!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Foley",
          "Nb_Reviews": 1,
          "Date": "2021-11-22T16:36:00.000Z",
          "Titre": "Always quick to respond",
          "Contenu": "Always quick to respond.  Any moving parts get taken care of fast and effectively.  This is a great platform for what they do and customer service is 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noa",
          "Nb_Reviews": 3,
          "Date": "2022-09-29T02:36:37.000Z",
          "Titre": "Easy and affordable videos for UGC",
          "Contenu": "Easy and affordable videos for UGC. There are a ton of creators to choose from and Billo really holds them accountable and on their deadlines. The set up process is easy and the videos have come out great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathariya Burket",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T17:29:00.000Z",
          "Titre": "Awesome concept, good company!",
          "Contenu": "I tried Billo, using promo code during Thanksgiving and I'm glad I did it! I worked with 2 creators and they are awesome. I also love their system, it's very easy to work with. Keep on good work! I would do it again when I have another product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "lo gold",
          "Nb_Reviews": 2,
          "Date": "2021-12-15T22:04:19.000Z",
          "Titre": "⭐️⭐️⭐️⭐️⭐️",
          "Contenu": "as a creator, this app is so awesome!! never thought i’d be able to make an income my creating content for brands. the staff is so sweet, helpful, and replies very quickly!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NaToya Dingle",
          "Nb_Reviews": 1,
          "Date": "2021-11-25T14:34:58.000Z",
          "Titre": "Billo is the best!",
          "Contenu": "I love Billo. It's a great chance for me to make extra $$ while doing what I love which is making content. The best part of the Billo experience is the support team. They answer quickly and thoroughly. It really does feel like I'm working on a team and I love that!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tarcia Smith",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T02:44:12.000Z",
          "Titre": "If you're a new UGC creator",
          "Contenu": "If you're a new UGC creator, this is the perfect place to get started.  My experience has been great so far."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Anna A.",
          "Nb_Reviews": 3,
          "Date": "2022-04-07T11:03:53.000Z",
          "Titre": "I love my video",
          "Contenu": "I love my video, Lean Green is amazing!Billo has a great customer service and a seamless communication channel.Well done !"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rovin Vazirani",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T13:52:10.000Z",
          "Titre": "Great Service",
          "Contenu": "Very quick service offered at a great price. Great end-to-end experience. The support team was very helpful in resolving my questions."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Стани Иванов",
          "Nb_Reviews": 3,
          "Date": "2021-12-02T08:41:17.000Z",
          "Titre": "Beyond impressed",
          "Contenu": "Ok, guys, I just received my 4th video from the billo platform.And I am beyond impressed. It was shot by the model Ethan Corbett and this is probably the best video that I have received so far.Appreciate all of you. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Clark DCmeNow",
          "Nb_Reviews": 3,
          "Date": "2021-12-10T01:14:16.000Z",
          "Titre": "Amazing and comfortable to work with…",
          "Contenu": "The people in the Bilo app are more than reasonable and super polite when it comes to the products that I have to shoot videos for and their constructive criticism have been very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "LB",
          "Pseudo": "Sergio Aoun",
          "Nb_Reviews": 10,
          "Date": "2021-12-08T11:18:28.000Z",
          "Titre": "Billo Is Every E-commerce Marketer's Dream",
          "Contenu": "Billo is the only platform you wish your competitors didn't know about! From their flexible packages for individuals to bigger ones for top brands, Billo offers dropshippers/e-com marketers/brand owners the feasibility to easily create a task within one minute and hire a creator to represent your product live in action within a high-quality resolution that will WOW your audience and break the ice with cold traffic customers!Definitely recommended; it's cheap, fast, effective, and simple!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Socianta Online",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T15:32:38.000Z",
          "Titre": "I'm really surprised of the content I…",
          "Contenu": "I'm really surprised of the content I got for my store.The content creator shows a lot of energy in the TikTok video and the way he record the ad was crazy. I'm 100% satisfied of what I got. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alma Pantaloukas",
          "Nb_Reviews": 1,
          "Date": "2021-12-12T10:21:29.000Z",
          "Titre": "Great for brands that need video content",
          "Contenu": "This is my first time using Billo and I didnt know what to expect. I contracted Billo to work on two videos to test it out. Both videos came out so great and I will definitely be using it again. Writing briefs was a breeze!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LadyOmertà KiccDoe",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T11:06:02.000Z",
          "Titre": "I’m a new starter to this app and so…",
          "Contenu": "I’m a new starter to this app and so far it’s very useful and helpful to make extra money on the side it’s totally worth to try out💕"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ariel M",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T16:21:20.000Z",
          "Titre": "Great app for a side hustle",
          "Contenu": "Great app for a side hustle. The customer service chat is also amazing and they are always available for support and questions."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Imran Akhtar",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T00:30:33.000Z",
          "Titre": "I used this app for the first time to create a UGC Video Ad",
          "Contenu": "I used this app for the first time to create a UGC Video Ad and find it simply awesome, so affordable, and easy to use. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aisha Rand",
          "Nb_Reviews": 1,
          "Date": "2021-11-25T20:46:13.000Z",
          "Titre": "Very nice and accommodating people that…",
          "Contenu": "Very nice and accommodating people that will help you and send you tips on being a better creator! Fun tasks!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Leonidas",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T13:07:51.000Z",
          "Titre": "I have an amazing experience with…",
          "Contenu": "I have an amazing experience with billo. The customer support is fast and very helpful. The creators deliver great videos. I can only recommend the platform!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vinz Leonardo",
          "Nb_Reviews": 1,
          "Date": "2022-04-09T05:24:30.000Z",
          "Titre": "Where Brands and Influencers meet",
          "Contenu": "Billo gave the way so brands and clients meet with influencers and content creators like me. I love using Billo :)"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Marlon Gardemann",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T21:51:40.000Z",
          "Titre": "Great Service",
          "Contenu": "I used Billo for TikTok ads and my supplier did something wrong and Billo helped me to reach out to the influencer to solve this problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T05:13:23.000Z",
          "Titre": "I love working with Billo",
          "Contenu": "I love working with Billo. The people that work at this company are awesome. They are very helpful,respectful,and knowledgeable.I’m so glad that I found this company."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Rodrigo",
          "Nb_Reviews": 6,
          "Date": "2022-06-06T14:05:52.000Z",
          "Titre": "The truth is that it is expensive but…",
          "Contenu": "The truth is that it is expensive but the service they offer is of total quality, good customer service and communication is easy. I recommend it to anyone who needs content for their brand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aurum Oro",
          "Nb_Reviews": 1,
          "Date": "2021-12-24T16:38:48.000Z",
          "Titre": "I appreciate how quickly I get a…",
          "Contenu": "I appreciate how quickly I get a response and clarity about my questions from your team members. Monika is a great help!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Andrew",
          "Nb_Reviews": 3,
          "Date": "2022-02-17T17:07:53.000Z",
          "Titre": "Awesome support from Sheval and…",
          "Contenu": "Awesome support from Sheval and Jomante! They are always quick to reply and are able to resolve my issues efficiently!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaitlyn White",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T14:05:58.000Z",
          "Titre": "Billo is awesome!",
          "Contenu": "The app can be a little glitchy sometimes but the staff is the nicest and very helpful, and the products are awesome which makes the pay that much more worth it! I love being part of the billo team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Destiny Murphy",
          "Nb_Reviews": 1,
          "Date": "2021-12-24T16:02:59.000Z",
          "Titre": "Seriously some of the best people to…",
          "Contenu": "Seriously some of the best people to work with so much love and heart goes into working with there customers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Case",
          "Nb_Reviews": 4,
          "Date": "2021-12-03T14:19:12.000Z",
          "Titre": "Big fan of Billo and really like the…",
          "Contenu": "Big fan of Billo and really like the new video styles theyre coming out with. Makes it a lot easier to get UGC and studio quality videos produced!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T16:39:25.000Z",
          "Titre": "Queens of customer service",
          "Contenu": "Gabi and Mish were so helpful, friendly and conversational. Great work - friendly service is hard to come by these days."
        }
      ]
    }
  ]
}