{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "bloomaudio.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Penny",
          "Nb_Reviews": 2,
          "Date": "2023-05-05T17:18:54.000Z",
          "Titre": "You allowed a fraudulent purchase on my…",
          "Contenu": "You allowed a fraudulent purchase on my card"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tokyo Drift",
          "Nb_Reviews": 1,
          "Date": "2020-07-06T22:37:46.000Z",
          "Titre": "Warning! Bad business practices.",
          "Contenu": "Warning! Do not buy from this scamming place. I purchased this idsd pro open box dac for $1800 and it constantly making noise and randomly shut down. They also forgot to include the usb cable. When requested the cable, they claimed that they send it the next day, however, I waited for 3 days and asked them and they said they never sent it. I asked for return naturally and Bloom Audio insists to charge me a 15% of restocking fee $270. You can see the problems yourself in the video I recorded on youtube by searching bloom audio idsd problem.They would not refund my full amount and claim it has no issue and could be the cable. Well, you can watch the video yourself. Fortunately with the help of Paypal, I was able to get my full refund. These guys, Andrew and the other person are so unprofessional that please think twice before you buy from them. They will charge you couple hundred dollars for return even if they product is open box and malfunctioned."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray Martinez",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T08:06:14.000Z",
          "Titre": "Overall successful purchase",
          "Contenu": "With my recent couple purchases, it was a success. The ear tips fit my earbuds perfectly yet it took me time to get used to them on these earbuds but they’re very comfortable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Tan",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T13:27:15.000Z",
          "Titre": "Item Defect but Excellent Service",
          "Contenu": "Everything else was good but the cable itself was bad. Tried other cables and connections, utilized the jack itself and with dacs. The cable itself seems to have a connection issue. The left/right side cuts out with some movement. Recently I just can't hear from one side. It was extremely disappointing.[Edit] lost among the countless emails, they did immediately reach out to offer a replacement so excellent response and service."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Paul Duffy",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T14:46:03.000Z",
          "Titre": "iBasso DX320",
          "Contenu": "iBasso DX320Still early days but the device received from Bloom is starting to look like a keeper, in that even before full burn in, it’s made a few of my IEMs come alive and I can only imagine once fully broken in, the sound will only keep getting better.Great service and always responsive, Bloom made the buying experience painless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom M.",
          "Nb_Reviews": 2,
          "Date": "2023-05-04T06:02:38.000Z",
          "Titre": "Fantastic products & Service",
          "Contenu": "My record player has been plugged directly into the Phono connection of my Denon amp, and it's never been impressive. Buying the Sennheiser HD800S headphones, iFi ZEN Phono, & iFi ZEN CAN has made me fall back in love with vinyl.And now I can listen to my music & movies without my wife complaining about the volume.2 points:1) iFi really needs to include the Power X power supply with their amps. If it makes such a difference, just raise the price by $100 & give it to me. Don't make me buy what I should already have, & make trash that doesn't need to be.2) Bloom needs to recommend accessories like the Power X (until they're included), and the 4.4mm Male to Male Balanced cable to connect the 2 amps."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Polojro",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T22:15:29.000Z",
          "Titre": "Glass tube amplification from Russia",
          "Contenu": "Found it at Bloom,On the telephone I was told it was the last one left in stock and it was a brand new one,Delivered the following day, must have been an open box as the outside box had been carefully double re tapped with Scotch transparent tape, they were a couple of card box dents and the inside supporting foam support was split,But the unit inside was in good shape and functioning well, overall happy with the purchase and I'll remain a returning customer.Entirely agree with your assessment.Just to let you know: I carefully watched from \"You Tube\" a post from iFI \"Unpacking and connecting the Aurora\"the last step of unpacking is peeling the thin transparent plastic membrane covering the LED.This trivial item was absent thus let me share with you the above requested review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronin Y",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T23:42:56.000Z",
          "Titre": "Great Experience",
          "Contenu": "Great Experience.   Bloom had the cans I was looking for in stock.   Shipping was super quick & their communication was on point.   Thank you and I look forward to our next transaction & if I can steer anyone else you way, I surely will."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Alto",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T15:51:19.000Z",
          "Titre": "good help when needed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rock",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T14:04:24.000Z",
          "Titre": "Hello",
          "Contenu": "Hello, cool company"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard  Lester",
          "Nb_Reviews": 1,
          "Date": "2020-08-17T20:18:19.000Z",
          "Titre": "Missgivings good",
          "Contenu": "Missgivings good - BUT: The cupid ear buds sound good, service was great - but I was told the wire to buds can not be replaced with ones from another brand. . obravo(mfg) is the oldball in buds apparently.  Thats bad when the cable goes bad i have to toss the buds!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terrell Wright",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T19:57:22.000Z",
          "Titre": "Great website"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Johnson",
          "Nb_Reviews": 2,
          "Date": "2021-04-21T22:15:33.000Z",
          "Titre": "Open Box Empyrean Headphones",
          "Contenu": "Bought open box headphones (Meze Empyrean). Product was in pristine condition. Only issue was that product color and cables were different than described (Black instead of copper, 3.5 mm instead of 6.3 mm jack)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicholas  Hyde",
          "Nb_Reviews": 3,
          "Date": "2021-09-27T13:56:58.000Z",
          "Titre": "Restocking fee only reason I can’t give…",
          "Contenu": "Restocking fee only reason I can’t give a 5 star review. Other Andrew was terrific"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Jean-Michel Wins",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T07:12:32.000Z",
          "Titre": "Friendly",
          "Contenu": "Friendly, responsive. Good experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "michael fitzgerald",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:17:26.000Z",
          "Titre": "Best service I’ve received in years …",
          "Contenu": "Matthew has been amazingly helpful with both before and after sale support and info. I bought my Svanar wireless from them after going back and forth with emails. And I couldn’t be happier. Great company , great service, fast shipping and no nonsense."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:34:34.000Z",
          "Titre": "Marvelous customer service",
          "Contenu": "I ordered a product that was out of stock from the manufacturer for over two months. I didn’t realize it upon ordering but discovered that no other retailers had them either. Throughout, Bloom’s support staff, Andrew and Matthew, were responsive and gracious while updating me on the stock trajectory. Big thanks to them for their positive attitudes and kind words."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hoang Nguyen",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T11:12:36.000Z",
          "Titre": "Bloom Audio Very responsive and helpful!",
          "Contenu": "Very responsive and helpful seller! Item was as described. Fast processing and shipping, would purchase from again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Merrick",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:08:41.000Z",
          "Titre": "Solid company that values its customers",
          "Contenu": "Fantastic service! Got my item’s to me fast with a treat & thank you. Their YouTube videos helped me decide on the Thieaudio Monarch II. They sound great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Cardillo",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:15:56.000Z",
          "Titre": "Great experience",
          "Contenu": "Bloom Audio was very knowledgeable and patient in helping me pick out the right product. Shipping was quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jazz1",
          "Nb_Reviews": 6,
          "Date": "2023-12-13T22:22:52.000Z",
          "Titre": "Best Experience I've Ever Had For Purchase Online!!!",
          "Contenu": "I had a lot of questions for the  support person before buying the iFi Go Pods. I was treated well every step of the way in making the decision to purchase. Bloom Audio is first on my list when making audiophile related gear!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Bowler",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T22:26:25.000Z",
          "Titre": "Fast and made my friend’s day with a…",
          "Contenu": "Fast and made my friend’s day with a KitKat bonus.  Wasn’t expecting to be before x-mas but bloom came through."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sonny Rivera",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T20:12:14.000Z",
          "Titre": "Awesomeness! Quick delivery and trustworthy,  will purchase from and recommend to everyone.  Happy Holidays to everyone!",
          "Contenu": "Bloom is such an awesome place to purchase anything audio,  I would definitely be purchasing from Bloom again,  shipping was quick,  also they have great deals on open boxes and coupon codes LOL. I highly recommend Bloom .  Happy Holidays to all at Bloom and the World!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BWT",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:09:22.000Z",
          "Titre": "Fantastic to do business with",
          "Contenu": "Andrew was very gracious and helpful throughout. Five Stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholson",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T23:32:08.000Z",
          "Titre": "Return customer",
          "Contenu": "Return customer, once again they provided great customer service and fast shipping. They are my first stop for high end audio needs."
        },
        {
          "Note": 5,
          "Lieu": "AM",
          "Pseudo": "Andrei Shcherbakov",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:36:38.000Z",
          "Titre": "Super fast shipping",
          "Contenu": "Super fast shipping! One day to my address."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam P.",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:19:12.000Z",
          "Titre": "Bloom matched a price as advertised…",
          "Contenu": "Bloom matched a price as advertised (almost instantly). I was shocked. I chose Bloom because they supported CanJam Dallas, offering S-tier headphones and sources to demo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr Joseph Gizzi",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T15:48:01.000Z",
          "Titre": "I finally purchased an A&K SP3000…",
          "Contenu": "I finally purchased an A&K SP3000 portable music player after years of using my A&K100. I decided to purchase from Bloom Audio after watching their detailed product review videos and discussions with their staff. No sales pressure, extreme product knowledge, coupled with a friendly non pretentious attitude is what helped me make my final decision to purchase from Bloom.  Shop Bloom Audio, you won’t be disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "z y",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T04:02:22.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery. Smooth transaction. First purchase from Bloom. Bloom is my \"go to\" now. Full size Kit Kat and hand written note was a welcome surprise!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Ll.",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T20:22:13.000Z",
          "Titre": "really happy with the purchase and the service.",
          "Contenu": "Out of the 4-5 IEMs I’ve tried up till know this last one really stands out, it starts to make sense why you have to dig deep and invest in them, the more you invest the better it gets. Not sure when this curve levels out, and I won’t try to figure this one out any time soon.Thank you for your advice…really happy with the purchase and the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edda Kuhlmann",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:02:21.000Z",
          "Titre": "We are repeat customers",
          "Contenu": "We are repeat customers. Always friendly and prompt service. Very pleased with this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al Garcia",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T06:22:49.000Z",
          "Titre": "Fast and accurate service",
          "Contenu": "Fast and accurate service. Received my package in a timely manner. Prices are very fair and reasonable. Also applies to shipping costs. Will definitely consider doing business with again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GR",
          "Nb_Reviews": 4,
          "Date": "2023-12-02T01:36:49.000Z",
          "Titre": "Bloom Audio - Simply the Best!",
          "Contenu": "Bloom Audio is the best source for \"sound\" advice and service for all audio needs.  I have been a customer since their beginning and have nothing but praise for their dedication to the customer and providing the best audio equipment out there today."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DT",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T00:27:12.000Z",
          "Titre": "Shipping was fast and item arrived…",
          "Contenu": "Shipping was fast and item arrived without damage. Thanks for the chocolate. I appreciate you guys supported fair trade products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Guo",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:38:54.000Z",
          "Titre": "Perfect packaging",
          "Contenu": "Perfect packaging, product description. And even a tasty extra king sized KitKat. 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "satya sugihjanto",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T13:02:31.000Z",
          "Titre": "“I had a very pleasant experience at…",
          "Contenu": "“I had a very pleasant experience at bloom audio especially services provided by Steve. He was very understanding, helpful and gave excellent customer service. I would have bought more products if I was not in hurry. Because of his services I will buy again.”"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abraham Nicolas Jr",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T15:17:50.000Z",
          "Titre": "Satisfied Customer",
          "Contenu": "The item I ordered was delivered to me earlier than expected a audio device for my studio room although the color isn’t what I selected but the color I got was also great. The customer team apologized also gifted me thanks to Mr Steve. Bloom won them self a customer I highly recommend them satisfied customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JL",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:12:36.000Z",
          "Titre": "Shipped promptly and securely",
          "Contenu": "Shipped promptly and securely, this company is one of the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T15:20:34.000Z",
          "Titre": "I bought the iFI Blu just for fun",
          "Contenu": "I bought the iFI Blu just for fun.  I am still astonished every time I plug that little guy into my iPhone or MacBook Pro at the quality sound I get.  The show here in Dallas was great, busy, and all of the people at Bloom were friendly, helpful, and very knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Ibarra",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:42:21.000Z",
          "Titre": "You guys are seriously amazing",
          "Contenu": "You guys are seriously amazing! My ifi go pod did not come with the mmcx connector for the Sennheiser IE series. Had nothing to do with Bloom audio but they resolved the issue for me I'm really thankful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Gunny",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T03:10:29.000Z",
          "Titre": "Bloom Audio is reliable",
          "Contenu": "Bloom Audio stands by their promise to accept returns.  They did by me and promptly sent an alternative iem after providing excellent advice.They will be my first option in future purchasing."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kimmy Baluyot",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T10:19:42.000Z",
          "Titre": "I must say I am totally satisfied",
          "Contenu": "I must say I am totally satisfied. Your product is really awesome"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "marian muncioiu",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T00:23:58.000Z",
          "Titre": "fast shipping,thank you .",
          "Contenu": "Tat was a fast shipping,thank you .the item very good,even the large size a bit ,to small for my humongous ear canal.Probably an XLarge(14.3mm),will be best,but I will manage somehow with the seal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vinocour",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T01:47:31.000Z",
          "Titre": "Delivered exactly what I ordered fast.",
          "Contenu": "Simple,easy, fast transaction with no glitches.  Great vendor.  Buy from Bloom with confidence."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Loeb",
          "Nb_Reviews": 5,
          "Date": "2023-12-11T19:13:05.000Z",
          "Titre": "Fast same day shipment.",
          "Contenu": "My order was shipped mere hours after I placed it, but I wish it had been sent UPS and not USPS."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gil Leal",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T18:25:51.000Z",
          "Titre": "Bloom Audio answered all my questions…",
          "Contenu": "Bloom Audio answered all my questions and provided excellent fast delivery. Hats off to the chat option, super knowledgable and quick responses. Appreciate Bloom Audio and a shout out to the Bloom's Youtube Channel, full of great reviews. Will definitely buy again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 5,
          "Date": "2023-11-28T01:54:08.000Z",
          "Titre": "Small order, full service",
          "Contenu": "Small order, came across them in a web search..but got 100% attention, speed, info and service as I think I would have with a major purchase. Happy to visit Bloom again if needed."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Saswat Kar",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T05:08:26.000Z",
          "Titre": "I have recently purchased a audio…",
          "Contenu": "I have recently purchased a audio device for my studio. I have so much satisfied with that product from bloom audio. Their products are top in class as well as their service are also better. I am satisfied with the fast delivery of bloom audio."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:26:18.000Z",
          "Titre": "Excellent store and wonderful people",
          "Contenu": "Excellent store and wonderful people. I would buy more ifI had more money just to support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Gunny",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T16:24:31.000Z",
          "Titre": "Attentive and intelligent service",
          "Contenu": "I was very disappointed in the performance of the device I ordered. My lack of satisfaction was completely understood and friendly advice was given as to alternatives.  I have exchanged the first iem and am awaiting the arrival of the new order.  The original arrived extremely promptly and Bloom seems to function like a fine clock.  I recommend this company highly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "nicole",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T23:01:36.000Z",
          "Titre": "Very attentive customer service",
          "Contenu": "Very attentive customer service, which helped me decide on a new DAP. Thrilled with my purchase of the iBasso DX170, thanks to some good & very specific information from Matthew. Shipping was super fast too. First experience with Bloom, & so pleased to have found them. Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:24:52.000Z",
          "Titre": "Bloom's support is excellent",
          "Contenu": "Bloom's support is excellent! I purchased a Chord Poly from them and I would not have been able to set it up without their support. Matthew was patient, polite, and stayed with the issues until they were resolved. I give them my highest recommendation and thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JG",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T16:57:23.000Z",
          "Titre": "Excellent and fast service",
          "Contenu": "Excellent and fast service.  The item color I ordered on line was not in stock though the website said it was.  Bloom offered me the same item in a different color at a slight discount.  I appreciate their fast response and generosity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CINDY HASEK",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T21:45:31.000Z",
          "Titre": "Knowledgeable and honest",
          "Contenu": "Bloom Audio is an excellent place ! They really are down to earth and help you find what you need . They are honest and I would definitely go back to them! I highly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T23:44:11.000Z",
          "Titre": "Easy and Responsive",
          "Contenu": "Easy sale and Andrew was very responsive to my question. Order went out lightning fast!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "peter rae",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T23:18:31.000Z",
          "Titre": "Problems addressed and fixed ASAP",
          "Contenu": "I had issues setting up my device and Matthew went above and beyond to see i was up and running at his earliest convenience.  Great Service!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Pierre",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T22:29:20.000Z",
          "Titre": "I bought my HEDDphones from Bloom…",
          "Contenu": "I bought my HEDDphones from Bloom Audio. Andrew gave me great customer service. About HEDDphones, well they are beautiful. Certainly, they are not light with 718 gr, but after two hours of listening, I don’t feel too tired. Side sound, I love them. The soundstage is very coherent, the clipping of the instruments and the clarity of the voices is perfect according to my old ears. The depth and dosage of the basses give matter and presence. In short, I am satisfied, I am happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ethan P.",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T15:20:09.000Z",
          "Titre": "Good",
          "Contenu": "Fast shipping, got it next business day. They had one specific item that was oos everywhere but they had it so that was awesome. They also gave me a piece of candy. It was a nice experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jeremy hurst",
          "Nb_Reviews": 4,
          "Date": "2023-11-02T02:51:44.000Z",
          "Titre": "Bloom is the BEST!",
          "Contenu": "Bloom is the best! Great service, accommodating, friendly and they go above and beyond. Great selection at great prices. Plus an amazing pre-owner section for the best deals around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Hamburg",
          "Nb_Reviews": 5,
          "Date": "2023-09-29T17:52:37.000Z",
          "Titre": "Much more than a place to buy stuff",
          "Contenu": "The folks at Bloom Audio function more as trusted consultants than as sales people trying to move product. And they are very thoughtful and helpful in their consultative role. For me, this translates into wanting work to with—and purchase from—Bloom Audio as often as I can. I see them as long term partners with me on my head-fi journey."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eyasu Berhe",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T04:03:34.000Z",
          "Titre": "Helpful and they care about there customers.",
          "Contenu": "Great bunch of people that work at Bloom Audio. They shipped my item soon after I ordered it and it came within 2 days. They also answered all my questions and concerns in a timley manner and were very helpful. They even put some candy in my package which made the deliverly even sweeter. I will definitely consider them first when I plan on buying additional audio equipment."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Chandu Allenki",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T10:16:21.000Z",
          "Titre": "The best stuff I've seen and used…",
          "Contenu": "The best stuff I've seen and used before, I really very happy to share my experience with bloom audio. For me,this is the awesome experience, this translates into wanting work to with and purchase from the bloom audio as often as I can. I see them as long term partners with me on my journey."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hasham Shah",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T08:42:50.000Z",
          "Titre": "Adorable speakers and reasonable prices…",
          "Contenu": "Adorable speakers and reasonable prices the base is superb and it's boom"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Brodich",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T19:36:44.000Z",
          "Titre": "Bloom is it",
          "Contenu": "The time and attentiveness shown to me by my advisor, Steve, was fantastic. Not a single question was unanswered. He guided me to the right equipment and I could not be happier with his recommendations. I will not purchase audio products from anywhere other than Bloom going forward. They have earned my trust."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keven c",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T19:58:29.000Z",
          "Titre": "Authenticy and customer service",
          "Contenu": "Bloom audio provided excellent customer service. There's nothing better than knowing that you are guaranteed authentic products. Bloom provides trustworthy products where we live in a world where everything can be counterfeited. Thanks bloom"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tony Jones",
          "Nb_Reviews": 5,
          "Date": "2023-10-18T14:13:41.000Z",
          "Titre": "Extensive catalogue and good service",
          "Contenu": "Bloom Audio have a wide catalogue and gave a rapid and responsive service. They were also helpful when there was a delay in international shipping (beyond their control. I’m happy to fully recommend Bloom Audio"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Lee",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T20:22:16.000Z",
          "Titre": "Excellent selection efficient shipping",
          "Contenu": "Blue audio carries an excellent selection of audiophile products. They have efficient shipping and reasonable discounts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S. Senavinin",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T23:38:50.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I recently purchased a Eletech IEM cable that turned out to be out of stock. No problem. Bloom customer service contacted me about it, apologized and suggested I choose a different cable, with a small but welcome discount. I took them up on the offer. As it turned out, my second choice also was out of stock. It appears that stock levels for Eletech products may not have been updating properly. In any case, I was contacted by the owner or Bloom, with additional apologies for the error. He asked if I would be ok with a much nicer cable than I originally ordered, for the same price. I took him up on his offer and the cable was received very quickly. I didn't go fishing for any sort of discount or freebie, and wasn't really concerned about the two out of stock orders. That said, it speaks volumes that Bloom Audio knew that it was a bad look to have two out of stock mistakes in a row with one customer, and did what I probably would have done if it were my company. In the end, Bloom won me a customer. The next time I'm looking for hardware my first stop will be Bloom."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Slava",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T00:04:02.000Z",
          "Titre": "Exceptional customer service.",
          "Contenu": "Exceptional customer service.I had to swap my product, due to some personal reasons, and also had a couple of special requests for the delivery. The customer service was extremely fast in responding to my emails and accommodating my request. It was even better than having the store next to your house. Very satisfied.Would recommend to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loren Milam",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T16:07:40.000Z",
          "Titre": "A great service",
          "Contenu": "Selection, pricing, service, shipping - all excellent.  I bought an open box item, and other than not being sealed in plastic, it looked brand new.  My next audio purchase will definitely be with Bloom Audio."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T18:04:38.000Z",
          "Titre": "Great Products, Unmatched Customer Service",
          "Contenu": "Bloom Audio is very reliable, honest online audio vendor.  They carry a wide variety off audiophile products, but what differentiates Bloom Audio is their terrific customer service.  They are incredibly helpful with questions, always reply promptly and ship items quickly and well packaged. They even handle returns fairly and quickly. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Nabil Aslam",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T08:11:32.000Z",
          "Titre": "Wow great experience using the Side…",
          "Contenu": "Wow great experience using the Side sound, I love them. The soundstage is very coherent, the clipping of the instruments and the clarity of the voices is perfect according to my own ears."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Antonio Cumba",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T15:53:49.000Z",
          "Titre": "From Demo to Deal",
          "Contenu": "I went over to demo 2 headsets to decide which was a more reasonable purchase based on performance. Once I decided on one, they informed me it was the last open box deal. I ended up saving 100 dollars off my purchase in the end. Excellent service overall!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "joseph presti",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T21:56:10.000Z",
          "Titre": "Easy Check Out",
          "Contenu": "Easy Check Out, Selection of payments accepted, Quality Products, Super Quick Shipping and Packaging..Stella!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Willard Ward",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T04:44:16.000Z",
          "Titre": "Packaged with care",
          "Contenu": "Shipping was relatively fast, the only delay was due to UPS which I am accustomed to. There was even a handwritten thank you note inside along with a bag of Skittles candy. It was a pleasant surprise to find, and it made me happy. I appreciate when care goes into packaging like that. Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dominick",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T19:04:37.000Z",
          "Titre": "Great Service",
          "Contenu": "Buying the product was easy(as it is with most places that want your money😉 lol) but the best part about bloom audio is the customer service is second to none! If you ever purchase from them, you’ll understand"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Salvatore Dicaro",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T22:53:03.000Z",
          "Titre": "Bloom Audio - Highly Recommended!",
          "Contenu": "I have been purchasing from Bloom Audio for a few years and I wanted to say thank you for the awesome customer support.  I highly recommend your organization to anyone who loves high end audio.  It's always a pleasure to do business with you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 4,
          "Date": "2023-11-27T18:10:19.000Z",
          "Titre": "Bloom Audio was super helpful",
          "Contenu": "Bloom Audio was super helpful! Great service and prompt delivery. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stuart Johnston",
          "Nb_Reviews": 6,
          "Date": "2023-12-05T20:17:07.000Z",
          "Titre": "Service orientation",
          "Contenu": "Lots of help before the sale.Missing cord was quickly replaced."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Algirdas Ivanauskas",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T00:51:40.000Z",
          "Titre": "Great experience",
          "Contenu": "I liked how fast the order was processed and delivered, and was pleasantly surprized with those small personal touches during the unboxing. Good job!"
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "Davidson Yaw",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T12:27:01.000Z",
          "Titre": "Wow great experience using the Side…",
          "Contenu": "Wow great experience using the Side sound, I love them. The soundstage is very coherent, the clipping of the instruments and the clarity of the voices is perfect according to my own ears."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 6,
          "Date": "2023-11-11T15:10:46.000Z",
          "Titre": "Really outstanding service .n see they…",
          "Contenu": "Really outstanding service .n see they value their customers The follow up is first class and you ca"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T01:32:25.000Z",
          "Titre": "A+++",
          "Contenu": "I definitely recommend Bloom Audio. This is my second purchase from this company and the experience was even better than the first. They offer competitive pricing, have equipment trade in incentives, and have a great selection geared toward audiophiles, and those just looking to improve their listening experience. Very responsive with any questions asked and A1 customer service. TLDR: Great company to spend your hard earned money with and great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe B.",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T07:29:22.000Z",
          "Titre": "Always great service and fast shipping…",
          "Contenu": "Always great service and fast shipping from bloom audio."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ioannis Sotiropoulos",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T23:03:52.000Z",
          "Titre": "This is my second order from Bloom…",
          "Contenu": "This is my second order from Bloom Audio and both times i received everything fast with a big thank you note which i really appreciate.And as this item was open box the product is impeccable thank you.I would be definitely be coming back to see your offerings."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Gallagher",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T19:49:46.000Z",
          "Titre": "Great service",
          "Contenu": "Great service.  Had everything setup when I arrived.  Excellent demo environment and no pressure sales.  Easy purchase.  I would use Bloom Audio again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Otto Schatz",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:06:14.000Z",
          "Titre": "Next day delivery and Great review",
          "Contenu": "Next day delivery!!!  Doesn’t get better than that. Also liked the detailed video review. Helped a lot. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean R",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T00:26:15.000Z",
          "Titre": "Shopping with Bloom=a great experience",
          "Contenu": "Shopping with Bloom was a simple and pleasant experience. The website is tidy and they have many great brands/products. Their product reviews/takes are great. I had an issue with a product (not a fault of Bloom) and they took ownership, responded, and resolved the issue the next day and sent out a new product. The staff is kind and professional. I will shop with Bloom again for sure.Listen in the dark........"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hoang Nguyen",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T00:44:20.000Z",
          "Titre": "Exactly what I expected",
          "Contenu": "Exactly what I expected. Reasonably fast shipping too. Thanks so much, Will…look forward to buying more audio goods from you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zed",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T15:28:26.000Z",
          "Titre": "My recent custom IEM purchase was a…",
          "Contenu": "My recent custom IEM purchase was a breeze with the folks from Bloom Audio! They were very responsive and friendly via email as I inquired myriad topics from fit to schedule. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T04:17:23.000Z",
          "Titre": "Speedy delivery and excellent service!",
          "Contenu": "From ordering to shipping, it took a few days to arrive. Plenty of packing peanuts were used, and the little added goody in the packing box made it a nice touch. Product looks mint, and immaculate. ❤️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kev",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T20:39:48.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Andrew gave a personalized approach to addressing my concern about expedited shipping. Quick response to inquiry on a Saturday morning, Initially I was worried when UPS estimated 2 business days for delivery rather than the advertised 1 day. He notified me that the initial estimate shown for tracking numbers is not accurate and that it should update soon. The tracking was updated and package was delivered in 1 business day. A bag of candy was in package which was nice of the seller to include, overall you can tell they care about their customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Loeb",
          "Nb_Reviews": 5,
          "Date": "2023-09-01T19:30:58.000Z",
          "Titre": "Wicked fast shipment!",
          "Contenu": "Wicked fast shipment!I ordered an “open box” item and aside from it not being shrink wrapped it was indistinguishable from new; not a scratch, fingerprint, or mark on it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "UR",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T06:39:38.000Z",
          "Titre": "Bloom Audio is the best",
          "Contenu": "Bloom Audio is the best. Customer service has been exceptional every time I had a question or I purchased something. They have been and will remain my source for fine audio gear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl D",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T16:56:09.000Z",
          "Titre": "Bloom Audio Great Communications and Support",
          "Contenu": "Bloom Audio always responds immediately to any questions or concerns.  They have great customer service and support.  All orders are shipped promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEPHEN EHR",
          "Nb_Reviews": 7,
          "Date": "2023-10-03T21:52:49.000Z",
          "Titre": "They Continue to Amaze",
          "Contenu": "They continue to amaze with outstanding support, value and care along with great products.  One of the few around that focus customer first.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nikolay  Zolotukhin",
          "Nb_Reviews": 4,
          "Date": "2023-08-24T04:26:16.000Z",
          "Titre": "Absolutely brilliant customer service…",
          "Contenu": "Absolutely brilliant customer service by Bloom Audio . Very knowledgeable stuff who spent a lot of time educating me on the products without pushing the sale"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEPHEN EHR",
          "Nb_Reviews": 7,
          "Date": "2023-10-30T17:50:09.000Z",
          "Titre": "Wonderful company to work with",
          "Contenu": "Wonderful company to work with, super products, super support, caring and quick to respond.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wesley Bush",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T15:55:50.000Z",
          "Titre": "Seamless",
          "Contenu": "From initially opening the website to listening to music on my new headphones, the process was totally seamless and intuitive.  The free overnight delivery was just icing on the cake."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 13,
          "Date": "2023-10-30T15:22:53.000Z",
          "Titre": "Top Notch as always",
          "Contenu": "Always a pleasure doing business with the team at Bloom. Best selection and advice available for headphone equipment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Goudy",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T17:55:10.000Z",
          "Titre": "Open Box iFi Gryphon",
          "Contenu": "I bought an open box iFi Gryphon dac/amp and it was pristine, including the film over the display.  I saved $100 and glad I was able to buy from Bloom Audio! This was a first time purchase from Bloom, but I wouldn't hesitate to buy an open box item again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Preston Barnes",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T08:47:32.000Z",
          "Titre": "GreGreat Experience at do business  with Bloom",
          "Contenu": "Great do business  with Bloom. Very pleased with my amp."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick D",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T18:25:26.000Z",
          "Titre": "Great service and prices from Bloom",
          "Contenu": "Great service and prices from Bloom!  This was my third purchase from them, and I know there will be more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luke",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T04:54:41.000Z",
          "Titre": "Very knowledgeable staff and very…",
          "Contenu": "Very knowledgeable staff and very friendly. I am lucky enough to live near their office and was surprised because I never get any of the \"cool stores\". This is will be the only place I will get my audio gear even if I have to wait and pay a little bit more"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Brookby",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T13:03:13.000Z",
          "Titre": "Superb customer service and generosity…",
          "Contenu": "Superb customer service and generosity in working a trade in deal.  The Bloom team makes the audiophile hobby even better as a trusted vendor.  I’m a customer for life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon R",
          "Nb_Reviews": 4,
          "Date": "2023-09-08T02:33:24.000Z",
          "Titre": "Everything went well",
          "Contenu": "Everything went well. Ordered some Audeze cans on Wednesday evening, they were delivered Saturday. Was well packaged and solidly packed.Though I have to say feeding my sweet tooth with the skittles was a nice surprise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JASON  D",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T20:07:14.000Z",
          "Titre": "Bloom Audio is simply reliable",
          "Contenu": "Bloom Audio is simply reliable. The selection of audio gear is excellent and placing an order is a seamless process from beginning to end. Everything arrived well packaged and as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Lange",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T00:20:18.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, packed well, looks beautiful, and even included a candy bar!"
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Ryan Obriene",
          "Nb_Reviews": 11,
          "Date": "2023-11-08T10:45:35.000Z",
          "Titre": "they advised me very well",
          "Contenu": "they advised me very well, gave me the advice I needed and helped me with my choice. After I placed the order, the good arrived in 3 days. I am very pleased with the work of this store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Hunt",
          "Nb_Reviews": 5,
          "Date": "2023-10-15T19:39:15.000Z",
          "Titre": "Excellent service and rapid delivery",
          "Contenu": "Excellent service and rapid delivery. My 4th purchase from them and it has been a great experience each time."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Vikrant chauhan",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T09:49:59.000Z",
          "Titre": "Bloom audio all product are good .",
          "Contenu": "Bloom audio all product are good .. shipping on time ...and nice product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T00:24:14.000Z",
          "Titre": "The consultations were spot on!",
          "Contenu": "The consultations were spot on!Matt's guidance was exactly what Bloom delivered - quickly, and in perfect condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Klim",
          "Nb_Reviews": 3,
          "Date": "2023-08-18T14:03:21.000Z",
          "Titre": "Excellent communication and product…",
          "Contenu": "Excellent communication and product exactly as described.  Down to earth folks that love audio.  Not a huge company is a benefit as they are personable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T17:17:24.000Z",
          "Titre": "Refreshing Experience",
          "Contenu": "A perfect product? Fast shipping? A handwritten “Thank You” note using my name? These things add up and make a difference to me. Thank you, and I will certainly be back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Efrain Kristal",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:52:03.000Z",
          "Titre": "My order came nicely packaged a few…",
          "Contenu": "My order came nicely packaged a few days before the expected delivery date."
        }
      ]
    }
  ]
}