{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "bluraysforeveryone.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JR Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T04:36:19.000Z",
          "Titre": "Paid Extra",
          "Contenu": "Paid extra around 8$ more for a mint steelbook and was sent one with rips throughout the plastic and visible dent, jammed in a tight protector. Kept it since returning and everything is a hassle."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ozzie Guerrero",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T01:21:11.000Z",
          "Titre": "Fast x digital",
          "Contenu": "Never got the code for the movie even though it was out on digital already."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T12:18:57.000Z",
          "Titre": "So slow, not friendly",
          "Contenu": "Ugh, this guy. Not very friendly, acts super entitled like we’re lucky to be buying stuff from him. Took over a month to ship my order and I literally had to check in new remind him multiple times. Arrived with a small dent and was basically told “oh well”. Actual date of experience may not be accurate as it was a while ago and I just received this request to complete a review like a year later and clearly have not returned as a customer, which I think says everything you need to know! He’s also “heral-jess” or something on eBay and you’ll get the same attitude there. Avoid."
        },
        {
          "Note": 1,
          "Lieu": "PE",
          "Pseudo": "Anson",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T12:43:47.000Z",
          "Titre": "Terrible experiences but YMMV.",
          "Contenu": "Way overpriced, increíbly slow shipping, terrible communication.  I once sent them a list of my wants and got a reply 2 weeks after saying to check the website cause they didn't have time to manually see if they have them or the prices.  Most of the ones I wanted said \"contact for price/stock\" or similar.  Another time I placed an order that took 3 weeks to ship and it was incomplete and one slip was the wrong version.  Will never buy or even consider buying from them again.  I guess the guy who runs this doesn't have the time or care too much."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T19:11:34.000Z",
          "Titre": "Spam Email",
          "Contenu": "This review is in reference to an experience with this company on November 11th 2022. I received a review request via email on an order placed more than 4 years ago. As this was not a recent experience, I am reviewing my most recent experience with this company. A random email more than 4 years later is hardly a positive experience and borderlines on Spam."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Katlynn Cullen",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T16:24:01.000Z",
          "Titre": "THIS GUY CLIFF LOKER IS A CROOK!",
          "Contenu": "THIS GUY CLIFF LOKER IS A CROOK!! BUYERS BEWARE!! I will be posting this on multiple blu-ray forums to warn other buyers…he DEFRAUDED me!! I sent him movies in for trade in and Cliff took the movies and refuses to issue the store credit!! I even contacted the local police in his city! He is a FRAUD and an outright CROOK!!! BEWARE!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T11:34:27.000Z",
          "Titre": "AVOID ORDERING HERE AT ALL COSTS!",
          "Contenu": "This is a totally shady business run by a single greedy seller named Cliff Loker. He puts limits on the \"HOT\" items but doesn't indicate anywhere on his site that there is a limit of one item per customer, and that is absolutely unfair and confusing and frustrating to customers. I ordered 3 copies of a steelbook from him because I ended up missing out on ordering them from Best Buy, where I always order from. I chose Priority Small Box as the shipping option because that was the lowest price option available. Had he bothered to inform me that there was a limit, I could have saved money by just ordering the one copy and choosing regular mail or media mail to ship. And he already collects payment as soon as the order is placed, so I was charged for all 3 steelbooks and I was obviously upset when I received only 1. I had to call him in order to find out what happened. Luckily, he refunded me for the steelbooks he never sent but he still never bothered to notify me about the situation after the order was placed. This guy Cliff is a total scammer and bait-and-switcher and he definitely made some money off me. This was my first experience ordering from him but I will definitely not be doing so again and I encourage everyone else who is a serious collector like me to avoid buying from him at all costs!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T02:33:39.000Z",
          "Titre": "Ordered a Blu-ray slip case",
          "Contenu": "Ordered a Blu-ray slip case. Wouldn't ship unless I paid a ridiculous amount for shipping. Order cancelled."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Russell",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T01:53:27.000Z",
          "Titre": "Received the wrong movie",
          "Contenu": "Received the wrong movie. I ordered resovoir dogs 4k and got The inhabitant DVD instead."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clint",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T23:55:10.000Z",
          "Titre": "Order not fulfilled",
          "Contenu": "Order not fulfilled. Had to have the charge reversed by credit card company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "theprestigefrogsteel",
          "Nb_Reviews": 15,
          "Date": "2021-09-28T06:48:18.000Z",
          "Titre": "Horrible... just horrible",
          "Contenu": "Communicating with Cliff is not a pleasant experience. He's extremely rude and seems to have zero interest of helping his customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arron Schultz",
          "Nb_Reviews": 3,
          "Date": "2022-12-03T04:07:13.000Z",
          "Titre": "Everything I wanted was not in stock…",
          "Contenu": "Everything I wanted was not in stock and got no help from anyone."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T10:52:44.000Z",
          "Titre": "Don’t charge us so much for shipping"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T01:21:18.000Z",
          "Titre": "Way to high priced!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "PR",
          "Pseudo": "Leslie Omar",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T05:06:39.000Z",
          "Titre": "Outrageously expensive shipping costs…",
          "Contenu": "Outrageously expensive shipping costs for items that weigh literally nothing."
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "okere osinachi",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T16:35:55.000Z",
          "Titre": "Great selection of hard to find titles.",
          "Contenu": "Great selection of hard to find titles.Insanely overpriced however, and the shipping to Canada makes it a last resort. He claims that pricing is based on demand, but as a re-seller it’s up to his own discretion and he chooses to gouge."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jay",
          "Nb_Reviews": 4,
          "Date": "2022-12-03T15:43:52.000Z",
          "Titre": "Purchases are made here out of desperation",
          "Contenu": "Great selection of hard to find titles. Insanely overpriced however, and the shipping to Canada makes it a last resort. He claims that pricing is based on demand, but as a re-seller it’s up to his own discretion and he chooses to gouge."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bradley",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T23:14:14.000Z",
          "Titre": "Great items, slow shipping",
          "Contenu": "The products are great, the prices are fair. Items are packaged well for shipping... I wish I could give higher rating but shipping can be SO SLOW. Ridiculously slow at times.... and that is very frustrating. It should not take as long as it does. That's the only reason I can't give this site a perfect score. Still, this is a really great place to buy from if you don't mind waiting 1-2 months to get what you ordered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rafaela M",
          "Nb_Reviews": 2,
          "Date": "2022-12-03T09:40:17.000Z",
          "Titre": "love/ dislike",
          "Contenu": "I like the selection of movies and slipcovers. I dislike the shipping speed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T09:50:30.000Z",
          "Titre": "As a dedicated movie enthusiast",
          "Contenu": "As a dedicated movie enthusiast, Blurays For Everyone has been my go-to destination for quality 4K titles and exclusive SteelBooks. The extensive collection, including customs-friendly options, ensures that I find the movies I desire. The customer service is commendable; they actively assist in sourcing specific items, such as slip covers, even if not listed on the website.The exclusive 4K SteelBooks, like \"The Mandalorian\" and \"WandaVision,\" showcase a commitment to offering unique and sought-after editions. The user-friendly interface and responsiveness to customer feedback contribute to an enjoyable shopping experience.Whether it's iconic classics or the latest releases, Blurays For Everyone caters to diverse preferences. The availability of limited editions and exclusives, like the XL Full Slip SteelBook for \"The Exorcist,\" adds a touch of rarity to my collection.Overall, Blurays For Everyone is more than a store; it's a haven for movie collectors seeking quality, exclusivity, and exceptional customer service."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "cyborgtrader",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T11:33:22.000Z",
          "Titre": "If you want Blurays with SlipCovers ...",
          "Contenu": "If you want Blurays with (special) Slipcovers (guaranteed - e.g. as collector's item) you have to visit the website of 'Blurays For Everyone'. Yes - the disks arrived in mint condition and were safely packaged. But - order date was May 14th, arrival date July 11th ! Furthermore, customs charged me 1.12 € tax (that's ok ...) and 6 € flat fee because of 'Goods not fulfilling the conditions laid down in Article 28 and 29 of the Treaty on the functioning of the European Union' - meaning the seller should have paid the sales tax / VAT in advance. In the good old times (before July 2021) taxes below 5 € haven't been collected (if the value of the attached customs declaration was accepted ...😃) and there was no delay in your order. Nowadays 'they' try to scrape up every single $ or € 'they' can get 😡 to balance the government deficit ...Nevertheless - the overall experience was positive and I would buy again."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Emmanuel",
          "Nb_Reviews": 2,
          "Date": "2022-12-03T09:45:18.000Z",
          "Titre": "Reliable. But be cautious with import fees...",
          "Contenu": "This website is reliable for ordering rare or otherwise unfindable blurays. The goods came from US to France in about ten days after ordering, and were adequately packed.However, be cautious when ordering from abroad because of elevated import fees. By default UPS may charge you as much as 38€ import fees for a 20€ bluray! These 38€ decomposes into 5€ of mandatory import taxes (depending on the country you live in) which you cannot avoid. Yet, the rest is only vaguely referred to as \"processing fees\" by UPS and is basically no more than racketing!In some country though - such as Canada, for instance - you can ask UPS to deal with the custom by yourself. In such a case, you only have to fill-in a paper for the local custom and pay the ~5€. However, in other countries - such as France - you cannot do that and are you are forced to submit to the transporter's racketing and pay whatever they want..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 5,
          "Date": "2022-11-13T22:50:45.000Z",
          "Titre": "The place to buy blu-rays",
          "Contenu": "The product was as described. The packaging was thorough and professional. The price was generous. The only issue was the lack of communication regarding a delay in fulfilling and sending the order due to vacation. An automated email response to that end would prove effective and considerate."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "MaxGil",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T07:58:54.000Z",
          "Titre": "Good prices and great service",
          "Contenu": "Good prices and great service! I am satisfied! Very good job, great that you develop this for people"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T18:24:36.000Z",
          "Titre": "to fine the unfindable",
          "Contenu": "Just to be able to fine the and receive quality product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Perridon",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T18:58:42.000Z",
          "Titre": "I collect movies and play every single…",
          "Contenu": "I collect movies and play every single movie that I love much."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "carlyle danforth",
          "Nb_Reviews": 2,
          "Date": "2022-12-03T22:01:16.000Z",
          "Titre": "Good",
          "Contenu": "Was worth using"
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T22:46:36.000Z",
          "Titre": "The excellent varíety Of products",
          "Contenu": "The excellent varíety Of products, movies, steelbooks, empty boxes. The customer service Is a súper experience, it always exceeds my expectations."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "SIMON MCDONAGH",
          "Nb_Reviews": 16,
          "Date": "2023-11-07T21:32:07.000Z",
          "Titre": "Highly recommended,the price was…",
          "Contenu": "Highly recommended,the price was great,the communication and the packaging was excellent.i will be using them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T17:59:02.000Z",
          "Titre": "I Can't Believe This Is For Real",
          "Contenu": "But it is for real! Excellent prices for premium collectibles, with nicely secure payment process and quality packaging. It took a minute to get shipped off, but it got here quickly and in top-notch condition. Very satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet F.Gagnon",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T08:24:30.000Z",
          "Titre": "Very satisfied!!",
          "Contenu": "But it is for real! Excellent prices for premium collectibles, with nicely secure payment process and quality packaging. It took a minute to get shipped off, but it got here quickly and in top-notch condition."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "allet",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T23:29:42.000Z",
          "Titre": "Perfect Store for Movie Collectors",
          "Contenu": "Highly satisfied customer since 2012. BFE is my only reliable source for Blurays (and slipcovers) because Cliff ships overseas and packs them securely items always arrive in mint condition. You can request specific items too. Anything movie and physical media related. If you don't find the item you're looking for on the website, just contact Cliff and he will add it to the website so you can order. Fast response too. Reasonable price for items and shipping. He will try his best to fulfill your order. I already have so many Blurays from BFE over the years, even books and movie magazines. I can't thank you enough Cliff. Always appreciate your effort in fulfilling my picky request and orders. To be honest, I feel very grateful that your store exists. You really helped me a lot.Blurays For Everyone never disappoint! Highly recommended!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Broderic Kartholl",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T16:19:50.000Z",
          "Titre": "Excellent deterrent against eBay price gougers",
          "Contenu": "Superb deals for collector items (physical). Especially when the collector edition (4K/BluRay) item sold out quick in retail stores. Excellent option versus price gouging on eBay. 9/10.I would recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "ReviewTechAfrica",
          "Nb_Reviews": 48,
          "Date": "2022-12-03T06:59:12.000Z",
          "Titre": "Good service, secure and fast shipping",
          "Contenu": "Good service , contacted the seller before making a purchase and he responded very quickly.I bought Frozen II blufans One click a very impressive set.Fast and secure shipping ! Box was mint condition no Mark's or anything absolutely  perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T14:39:48.000Z",
          "Titre": "This is an awesome site with fair…",
          "Contenu": "This is an awesome site with fair prices! I needed a refund and he issued it immediately. But then I ordered again and shipment was quick. Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Kent",
          "Nb_Reviews": 5,
          "Date": "2022-10-23T11:39:25.000Z",
          "Titre": "No problems, a great service!",
          "Contenu": "Used blurays for everyone for a couple of 4k discs that were getting tricky to get hold of in the UK. Placed my order, got an automated 'thanks for your order' email and then that was it for about a week and a half. Finally got the despatch note and was able to track my parcel every step of its journey. Finally arrived in the UK roughly 2 weeks later. Items were in perfect condition and exactly what I'd ordered. Can't say a bad thing about the whole experience to be honest. Would definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Quinten",
          "Nb_Reviews": 4,
          "Date": "2023-01-27T14:46:20.000Z",
          "Titre": "A very good website for blu ray collectors",
          "Contenu": "A very good website for collectors all over the world, but do keep in mind if you order outside of the USA you have to pay for import fees. And from anyone who is from the Netherlands and questioned if this site is legit, yes it sure is. Will definitely order again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T21:59:46.000Z",
          "Titre": "A decnt place for blu-rays and rare slipcovers",
          "Contenu": "In October 2021, I had purchased some rare slipcovers and the experience was good. As others have said, it took a while for the seller to ship them out (I believe I waited at least two weeks before they shipped). But in the end, I received my slipcovers in the described conditions. I'd shop there again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek Castaneda",
          "Nb_Reviews": 2,
          "Date": "2022-12-04T17:21:45.000Z",
          "Titre": "Fantastic Experience",
          "Contenu": "The site was very easy to navigate and find exactly what I was looking for. My order was packaged well and came in perfect condition. My experience was so good that I recently ordered again! BFE is truly a gem in the physical media community. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Nicolas",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T01:15:07.000Z",
          "Titre": "100% great experiences since 2018 - friendly and supportive seller!",
          "Contenu": "Very happy with my purchases at BFE since 2018. I used to purchase very regularly over a long period of time and it was always wonderful - customs friendly, safe and secure packaging and fair prices on the many exclusive items. All sold items are genuine, either in brand new or used condition.But above all, it’s the contact with Cliff that makes the experience great. Any issue (of which there were barely any in my case) can be sorted out and he’s always open to take a look into specific requests, such as slip covers and items not listed on the website. He answers very fast, too! In short, he’s a perfect contact for collectors.I try to come back as much as I can and support a retailer like BFE over Amazon. I wish we had someone like Cliff / BFE in Germany, which is why I ordered so much.Buy with confidence!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-07-09T20:31:58.000Z",
          "Titre": "Thank you so much for responding to me",
          "Contenu": "Thank you so much for responding to me, I sent you an email as well the other day, so happy you are still in business and if I wanted to make a purchase while the site is down, how could I go about that. Thank you sir."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin T",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T22:20:17.000Z",
          "Titre": "good price, fast checkout",
          "Contenu": "fast checkout, bought a pre-order item. release date in 1 week, so far 5 star for PRICE (much cheaper than other sites) and ease of checkout,  will see if I get my code next week"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "iain",
          "Nb_Reviews": 3,
          "Date": "2022-11-15T09:47:58.000Z",
          "Titre": "Excellent Service",
          "Contenu": "I have been ordering from BFE for a couple of years now, the products are competitive with other outlets, the service is superb.The items are always well packaged, hence no damaged to the items on delivery, even slipcovers are well protected.There are OOP items which cost can be reasonable to extreme but the supply is there which other outlets don't.I highly recommend BFE for the quality of the items, packaging, shipping cost and marvelous communication."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "fonda panayiotakis",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T18:03:50.000Z",
          "Titre": "the ease to manoeuvre on the website",
          "Contenu": "the ease to manoeuvre on the website, the upgrade to the website helps a lot!.the upgrade is very professional it was a dream to place items in cart, and paypal a dream to go through checkout!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Matteson",
          "Nb_Reviews": 2,
          "Date": "2022-11-15T22:15:20.000Z",
          "Titre": "Perfect for Whovians!",
          "Contenu": "Got my replacement Doctor Who Series 5 Blu Ray case in perfect condition! Great place to get new slipcovers, cases and quality tv shows and films"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "K. B.",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T02:41:07.000Z",
          "Titre": "Delivers exactly what I want every…",
          "Contenu": "Delivers exactly what I want every time. Shipping seems to have improved and I'm now getting my steelbooks faster than before! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Karolina",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T00:25:34.000Z",
          "Titre": "At first I was hesitant to buy from BFE…",
          "Contenu": "At first I was hesitant to buy from BFE as the website seemed a bit sketchy, and the majority of the reviews were negative. Still, I decided to try my luck, because the blu ray I was looking for wasn't available anywhere else - and I haven't regretted it in the end. The owner came back to me quickly, processed the order, there weren't any hiccups (it was a long journey from the US to Ukraine.... ), still, it arrived even earlier than estimated (I even had to pay at my postal office because I didn't pick it up in time, because the delivery time was so fast) - the casing and everything was very well packed; you could see that the person working on it cared. Yes, if you compare prices - BFE might be more expensive, but I think it's worth it, and I wouldn't give a second thought before buying again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T06:09:33.000Z",
          "Titre": "Thank you so much",
          "Contenu": "Excellent service providing slip covers for DVD's and Blu-ray's. I wish it was easier to get these after the fact but luckily Cliff at Bluraysforeveryone has me covered!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean B",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T22:53:25.000Z",
          "Titre": "I found an item on BFE that was sold out everywhere else",
          "Contenu": "I found an item on BFE that was sold out on all other sites. I didn't want to pay ridiculous eBay prices and it was really reasonable here. I had some questions about the item and with quick responses, it was resolved rapidly. The item came wrapped very well and in a box. No complaints at all."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark P******",
          "Nb_Reviews": 22,
          "Date": "2022-10-23T12:47:49.000Z",
          "Titre": "A great bespoke service",
          "Contenu": "Order number 37937I'm in the U.K.A great bespoke 'white glove' service for rare limited editions, out of production titles and editions that are internal to the USA only and hard-to-find slipcovers etc..Yes BFEO prices can be slightly higher than retail prices however that is the business economics of supply & demand of rarities and that they have to pay the retail price eg BestBuy and add their costs on top and it's a bespoke service but this is offset in other ways.This latest order as with previous orders has been really well packed. The shipping method of 'spaces' can be slightly confusing but always found BFEO accommodating in resolving.Always found BFEO easy to contact and quick to reply. You also get shipping notifications etc.. Any human mistakes are quickly rectified.Some things are out of their control such as USPS delays. Freight traffic was slower during the pandemic as less cargo space due to PPE shipments and less passenger planes flying with freight/post in the hold.I have recommended BFEO to others outside of the USA who have also been looking for a rare US item with them being pleased too and will continue to do so.Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T07:02:46.000Z",
          "Titre": "Fast shipping with great packaging.",
          "Contenu": "Steelbook was shipped very quickly and packaged extremely well. Website was easy to navigate. No complaints. Would use again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristopher Robinson",
          "Nb_Reviews": 2,
          "Date": "2023-06-22T23:06:54.000Z",
          "Titre": "Sure",
          "Contenu": "Good selection. Person that answers emails was kind of rude, but the issue was on my part. Make sure to read the title and fine print really well. I ordered a movie and don’t pay attention to the pre order part."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Andreas Riis Paulsen",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T11:48:52.000Z",
          "Titre": "A great litte web-shop where you can…",
          "Contenu": "A great litte web-shop where you can find hard-to-get and limited/exclusive titles. Ships world-wide. Great service and prompt response to enquirements. Reccomended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kirk Barfield",
          "Nb_Reviews": 16,
          "Date": "2023-05-10T00:23:10.000Z",
          "Titre": "Everytime I shop here I always find my…",
          "Contenu": "Everytime I shop here I always find my blu ray needs, especially slipcovers. Thanks for always having what I need!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Adams",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T02:48:47.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, slip cover was shipped with care and packaged to prevent damage, will definitely buy from again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Murgo Jr",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T02:28:07.000Z",
          "Titre": "Great service with great response time.",
          "Contenu": "Great service with great response time.Friendly and helpful.I would recommend buying from this company without hesitation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "King Blood",
          "Nb_Reviews": 2,
          "Date": "2023-06-24T23:30:42.000Z",
          "Titre": "Had the product I wanted in stock with…",
          "Contenu": "Had the product I wanted in stock with easy PayPal checkout. Hoping the delivery and final product are as excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T03:49:56.000Z",
          "Titre": "Excellent communication",
          "Contenu": "Excellent communication, and goes above and beyond to find something you’re looking for that he doesn’t have any stock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sergg",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T04:13:16.000Z",
          "Titre": "Great experience purchasing slipcovers",
          "Contenu": "I very much appreciate the great packaging for the slip cases I purchased in the past always came back in case I needed to find something!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-07-08T18:30:23.000Z",
          "Titre": "Website is down",
          "Contenu": "Hey, I love this company and the slips they offer for 4K but the website is down. Does anyone know why and if they are still in business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JASON",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T01:48:43.000Z",
          "Titre": "All around great company.",
          "Contenu": "Super fast response to messages and super fast turnaround on product manufacture. Very friendly, variety that no one else offers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ayrton",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T05:17:28.000Z",
          "Titre": "Great business!!",
          "Contenu": "Great business!! I got exactly what I wanted and the quality was perfect! Will definitely buy from again, highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "80s90s00s",
          "Nb_Reviews": 4,
          "Date": "2022-12-07T08:45:00.000Z",
          "Titre": "Finally complete on Blu-ray",
          "Contenu": "Delivery took some weeks but it came in undamaged, and the item was as advertised, very happy with the product."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T20:56:26.000Z",
          "Titre": "Great selection",
          "Contenu": "Great selection.  Good prices.  Fast shipping.  Provides a unique service as the items are always as advertised!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2022-11-12T00:58:04.000Z",
          "Titre": "Because they are a very reliable and…",
          "Contenu": "Because they are a very reliable and deliver both 4K UHD Blu-Ray Movies, replacement 4K UHD cases and 4K UHD Blu-Ray Slip Covers to me in a professional and first class way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ross",
          "Nb_Reviews": 2,
          "Date": "2022-11-12T00:38:36.000Z",
          "Titre": "Great Experiences, Repeat Customer",
          "Contenu": "Communication is prompt and friendly. Shipping times are reasonable to quick and my orders always arrive very well packed."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Malcolm",
          "Nb_Reviews": 2,
          "Date": "2023-07-02T12:27:54.000Z",
          "Titre": "well organised everything explained",
          "Contenu": "well organised everything explained got exactly what i wanted and YaY pay in 4 sweet (us dollar's  are expensive) a very professional  and EASY with a huge interesting catalogue"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Sasser",
          "Nb_Reviews": 3,
          "Date": "2022-11-12T00:56:00.000Z",
          "Titre": "It's just a great service for neurotic…",
          "Contenu": "It's just a great service for neurotic collectors like myself. Some of the prices are a bit steep, but worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T02:51:30.000Z",
          "Titre": "Great movies at a great price",
          "Contenu": "Great movies at a great price. Customer Service was great as well :) definitely will purchase from here again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-03T03:15:22.000Z",
          "Titre": "Spectacular",
          "Contenu": "I received it with no damages, and no defects; I was thoroughly pleased when I finally received this steelbook movie."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Yarnell",
          "Nb_Reviews": 2,
          "Date": "2022-11-12T01:05:10.000Z",
          "Titre": "BFE always has hard to find Blu-Ray…",
          "Contenu": "BFE always has hard to find Blu-Ray movies in stock, that are next to impossible to find. Prices are fair, and the packaging is great. I have some more classic movies I need to buy, and I'm buying them from BFE."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve P",
          "Nb_Reviews": 8,
          "Date": "2022-12-03T02:49:14.000Z",
          "Titre": "Great company!",
          "Contenu": "I was able to find what I was looking for and purchase it with ease. I received my item very fast and will definitely use this company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darius",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T00:47:54.000Z",
          "Titre": "Fast and Reliable quality service!",
          "Contenu": "Fast and reliable shipping, slipcovers are always well protected and nicely packaged. Never had any issues with this site! Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sidney Shalders",
          "Nb_Reviews": 2,
          "Date": "2022-11-12T00:44:14.000Z",
          "Titre": "Helped by Customer Service",
          "Contenu": "Helped by Customer Service, delivered product, packaged well. Great Service, great help. Thank you to all! Very Happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T17:46:30.000Z",
          "Titre": "Great packaging and fast shipping",
          "Contenu": "Great packaging and fast shipping! Item is as described! A little pricey for the item but it's getting rarer as time goes by so might as well get it while I can"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Warren Austin",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T13:39:17.000Z",
          "Titre": "Package came secured and accurate",
          "Contenu": "Package arrived as expected and secured and very content with my purchase. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Barry Moth",
          "Nb_Reviews": 4,
          "Date": "2023-07-10T18:30:43.000Z",
          "Titre": "Great service",
          "Contenu": "Great service! The item was dispatched and received very quickly, in great condition. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T03:16:41.000Z",
          "Titre": "I am not a quite sure when was the last…",
          "Contenu": "I am not a quite sure when was the last time I purchased a digital movie(s) from you.. but I know I had no issues with this site.. I am grateful that I got a great deal to purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T01:09:46.000Z",
          "Titre": "Able to get a limited edition",
          "Contenu": "Had a hard to find title and it was in perfect condition upon delivery, it was fast and easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nik",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T03:20:02.000Z",
          "Titre": "Amazing service",
          "Contenu": "There was a minor issue, but the seller was quick to respond and get it fixed. 10/10 customer service"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Pablo",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T03:31:59.000Z",
          "Titre": "Great for collectors",
          "Contenu": "Accurate description of the condition of items and guaranteed to get slipcovers with items if so listed, unlike Amazon (and most large eBay sellers that use stock photos)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dale",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T03:46:43.000Z",
          "Titre": "The shipping packing makes it safely…",
          "Contenu": "The shipping packing makes it safely all the way to Canada.  Never had a problem dealing with this vendor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T15:32:06.000Z",
          "Titre": "Reasonable prices, great customer service",
          "Contenu": "Quick email reply for my question. My Blu Ray shipped in a timely manner and the price for the item that I purchased was reasonable."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "DAVID EVANS",
          "Nb_Reviews": 3,
          "Date": "2022-12-03T12:52:06.000Z",
          "Titre": "good service",
          "Contenu": "Ordered several items from them over time and neverhad any problems.Good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hector Medina",
          "Nb_Reviews": 2,
          "Date": "2022-12-03T02:36:28.000Z",
          "Titre": "it was quick",
          "Contenu": "it was quick. on time. great customer service. product lived to expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 2,
          "Date": "2022-12-11T19:30:22.000Z",
          "Titre": "Great steelbook packaging",
          "Contenu": "Great steelbook packaging, condition of steelbooks accurately conveyed and you can pay more for mint."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Mohammed Ali",
          "Nb_Reviews": 6,
          "Date": "2022-11-14T16:53:34.000Z",
          "Titre": "Good service.",
          "Contenu": "They curate hard-to-obtain blu-rays for someone like me in the UK and ship them (no-frills) from the US. They do \"exactly what it says on the tin\". Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "alejandro",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T17:19:14.000Z",
          "Titre": "Thumbs Up",
          "Contenu": "the steelbook was very well protected when shipped and the process was quick!"
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "edwin langat",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T23:43:40.000Z",
          "Titre": "Blurays for everyone",
          "Contenu": "It has the best services globally.....controlled Adult content for all"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Free",
          "Nb_Reviews": 2,
          "Date": "2023-06-22T19:20:42.000Z",
          "Titre": "New customer",
          "Contenu": "Ordering was easy and movie arrived in a timely matter and undamaged"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse",
          "Nb_Reviews": 2,
          "Date": "2022-10-11T15:20:28.000Z",
          "Titre": "Packaged things really well and…",
          "Contenu": "Packaged things really well and everything arrived in mint condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T19:54:38.000Z",
          "Titre": "Prompt delivery and well protected from…",
          "Contenu": "Prompt delivery and well protected from “carrier mishaps”. exactly what i desired and a reasonable price, i definitely would recommend buying from again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stefan",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T00:39:34.000Z",
          "Titre": "Very well packaged and received item…",
          "Contenu": "Very well packaged and received item very quickly. Will purchase from website again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melanie  Auman",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T00:03:09.000Z",
          "Titre": "They are always quick with purchases",
          "Contenu": "They are always quick with purchases, and responsive to questions or concerns."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T03:17:55.000Z",
          "Titre": "Excellent customer service and fast shipping",
          "Contenu": "The item was quickly shipped and well packaged with excellent customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ESP One One Three Eight",
          "Nb_Reviews": 47,
          "Date": "2022-11-15T18:59:03.000Z",
          "Titre": "Videos and Their Slipcovers for Sale",
          "Contenu": "Good place to find those elusive slipcovers for Blu-rays and DVD's."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "NTN",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T09:37:16.000Z",
          "Titre": "Prompt shipping and thoughtful…",
          "Contenu": "Prompt shipping and thoughtful packaging ensured that my order arrived in perfect condition - absolutely loved it."
        },
        {
          "Note": 5,
          "Lieu": "GT",
          "Pseudo": "Dereck",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T06:08:04.000Z",
          "Titre": "Lovely service and perfect place to get…",
          "Contenu": "Lovely service and perfect place to get limited editions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T04:22:52.000Z",
          "Titre": "Item exactly as described and shipped…",
          "Contenu": "Item exactly as described and shipped super quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David D.",
          "Nb_Reviews": 5,
          "Date": "2022-12-03T06:06:53.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, easy transaction, good value for money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Wold",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T20:35:49.000Z",
          "Titre": "Had the movie I wanted",
          "Contenu": "Had the movie I wanted. Bought it rather easy. Put the code in and it worked. No problems whatsoever."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Tidd",
          "Nb_Reviews": 2,
          "Date": "2022-11-12T17:31:03.000Z",
          "Titre": "This 4k blu ray was hard to find…",
          "Contenu": "This 4k blu ray was hard to find although the price was high at least you provided it"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jay",
          "Nb_Reviews": 2,
          "Date": "2022-11-12T00:29:34.000Z",
          "Titre": "Safe packaging and the steel book was…",
          "Contenu": "Safe packaging and the steel book was in mint condition. Will buy from again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JPMacOriginal",
          "Nb_Reviews": 4,
          "Date": "2022-11-12T13:42:18.000Z",
          "Titre": "Got what I ordered with no problems…",
          "Contenu": "Got what I ordered with no problems what so ever....smooth transaction"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Critic Chris",
          "Nb_Reviews": 124,
          "Date": "2020-04-24T18:59:01.000Z",
          "Titre": "Amazing website with some epic…",
          "Contenu": "Amazing website with some epic steelbook designs"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Leigh",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T00:14:28.000Z",
          "Titre": "secure and reliable shipping",
          "Contenu": "secure and reliable shipping, interesting and sometimes hard to find media with fair prices."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T16:08:24.000Z",
          "Titre": "Great service!",
          "Contenu": "Delivered on time. Item packaged securely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DP",
          "Nb_Reviews": 14,
          "Date": "2023-06-24T06:39:33.000Z",
          "Titre": "Great price, fast shipping",
          "Contenu": "Great price, fast shipping and packaged well"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Andreas Vajcner",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T14:53:10.000Z",
          "Titre": "Fast shipping to Europe",
          "Contenu": "Fast shipping to Europe, Packaging very good!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Troy",
          "Nb_Reviews": 3,
          "Date": "2022-11-12T16:38:11.000Z",
          "Titre": "Excellent source for hard to find videos",
          "Contenu": "Easy to search site,  excellent video choices, and great prices."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Manja",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T11:42:15.000Z",
          "Titre": "Perfect",
          "Contenu": "Perfect. Fast shipping to germany."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T03:07:39.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service, good all around value. Would purchase from this vendor again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T16:08:56.000Z",
          "Titre": "Great experience",
          "Contenu": "Item as described, fast shipping, great prices."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Menno",
          "Nb_Reviews": 13,
          "Date": "2022-12-03T18:01:56.000Z",
          "Titre": "Great movie!",
          "Contenu": "As always great service, keep up the good work, folks!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Ger",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T02:19:24.000Z",
          "Titre": "Recommended",
          "Contenu": "Good stock, well packaged and customs friendly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devin",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T00:07:52.000Z",
          "Titre": "Movie came quick and was exactly as…",
          "Contenu": "Movie came quick and was exactly as described!"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Jesper M",
          "Nb_Reviews": 5,
          "Date": "2022-12-03T13:29:41.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, good packaging :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alberto Palomo",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T09:48:10.000Z",
          "Titre": "Service was quick and convenient."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-12T05:26:36.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service! Very fast and reliable!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Osaren",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T03:56:29.000Z",
          "Titre": "I love the case jacket",
          "Contenu": "I love the case jacket. Plays without issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chase Breaux",
          "Nb_Reviews": 2,
          "Date": "2022-12-03T05:56:20.000Z",
          "Titre": "Great vendor!",
          "Contenu": "Great pricing, great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taylor",
          "Nb_Reviews": 4,
          "Date": "2023-01-08T16:11:39.000Z",
          "Titre": "excellent service",
          "Contenu": "Excellent conditions and boxed very well and very excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl Gildner",
          "Nb_Reviews": 2,
          "Date": "2022-11-12T00:26:24.000Z",
          "Titre": "Great customer service and prompt…",
          "Contenu": "Great customer service and prompt shipping!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "NA",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T07:59:16.000Z",
          "Titre": "Fast service"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gurminder",
          "Nb_Reviews": 8,
          "Date": "2022-10-23T06:26:54.000Z",
          "Titre": "Trusted seller",
          "Contenu": "Honest, fair and great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T00:44:15.000Z",
          "Titre": "Item was clean",
          "Contenu": "Item was clean, arrived on time and packed well m"
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "zeljko",
          "Nb_Reviews": 6,
          "Date": "2022-11-12T08:46:58.000Z",
          "Titre": "ordered several times,",
          "Contenu": "ordered several times,always accurate delivery andpurchased according to description and pictures"
        }
      ]
    }
  ]
}