{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "bossrevolution.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TA",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T00:41:41.000Z",
          "Titre": "I will take my services where I'm appreciated...",
          "Contenu": "I downloaded the app. I attempted to send my first  transfer,  the transfer was  canceled.  I called to inquire about the cancelation. I  was told I am unable to use their services and they can not give any information or change this. I asked so you do not want my services?? The rep respond this can not be changed. I have never used this company before. I guess I will take my services to someone that will appreciate me. Wow.. I feel discriminated against and they will not give any information as to why..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gladys Tambeagbor",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T09:23:58.000Z",
          "Titre": "I have been trying to use your web site…",
          "Contenu": "I have been trying to use your web site to send money you guys are not letting me do it cos of so much information. Just tired of giving my information. So I have finally stoped"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FIKRU ARJA BEDEKE",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T02:04:59.000Z",
          "Titre": "your app is not working things it…",
          "Contenu": "your app is not working in expected way. The most annoying thing it does is that it alters phone numbers (if you touch key pad by mistake). The phone numbers I'm referring are those in my contacts list. When this happens, I have to close boss app and restart again. There is no other way to correct altered number (unless you memorize rewrite).  To restart,  it takes at least  5 minutes. It brings unnecessary ads; rather providing efficient functionalities. I'm not good writer to describe all the inconvenience about boss revolution app."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Woghiren",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:37:38.000Z",
          "Titre": "The Lady lack PRO and she is not fit to…",
          "Contenu": "The Lady lack PRO and she is not fit to be dealing with customers. If boss revelation wants customers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gladys Tebid",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T18:09:28.000Z",
          "Titre": "Please Boss revolution was good in the…",
          "Contenu": "Please Boss revolution was good in the pass but this time around you make me so miserable to make my calls. It is like I was not a good customer. You cannot force me to do what I think will be unfavorable to me. Since then I have been unable to communicate my children or follow up my hospital program in Africa.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Abdurazak",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T21:46:05.000Z",
          "Titre": "Deteriorating quality from time to time",
          "Contenu": "Your call quality is decreasing from time to time. There is no call quality. And also your network is not predictable. And incidentally, we would get a lot of weird feedback. And also your app is in accessible from time to time. The most important thing is the accessibility, but you’re happy is quite in accessible these days, and for some reason you are focusing on the ads, and that is really compromising the quality of the app. So, it will be good if you correct it, but if you don’t correct it also you are punishing your business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Onyewuchi Duru",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:57:31.000Z",
          "Titre": "Not good",
          "Contenu": "Boss money blocked me from sending money to Africa bcos I was in Nigeria for my father's burial and I needed money to I wanna transfer money from my account in USA to my account in Nigeria. All I needed was boss money to verify it was me. Even tried to call a friend to send money, they refused her as well. I have to use another money transfer to do the transaction bcos it was a life issue. If boss money can communicate more with customers it will help a lot. And till now, I cannot send money eith boss"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kassahun Mekango",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T01:41:20.000Z",
          "Titre": "You guys only focus on how to make…",
          "Contenu": "You guys only focus on how to make money from customers,you don't give any incentive or reward for loyal customers. I have been customer for more than 8 years and spent thousands."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T14:46:05.000Z",
          "Titre": "Continually getting disconnected/ time being deducted from the account w/o receiving fair service.",
          "Contenu": "Most times phone goes ringing on the other end, I hang up the phone prior to being prompted by operator that minutes would be deducted if allow phone to continue ringing. I hang up prior to this happening and I still get balance deducted from my phone account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oludele Oje",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T08:10:48.000Z",
          "Titre": "Too expensive calling Nigeria",
          "Contenu": "Too expensive calling Nigeria. Since it’s one of the country with high calling rates, so the discount plans do not apply to us."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victory Eshiet",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T08:17:36.000Z",
          "Titre": "I did mobile pop my account was debited…",
          "Contenu": "I did mobile pop my account was debited up till today my recipient has not yet receive the credit and l have not received my money back l give one star"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Imagard Alexender",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:59:27.000Z",
          "Titre": "I am very happy with your service been…",
          "Contenu": "I am very happy with your service been with you many years and don’t change anything.Merry Christmas"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rita Okaka, PhD",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T06:18:15.000Z",
          "Titre": "Boss Revolution is a terrible company",
          "Contenu": "Boss Revolution is a terrible company. Cheating international callers out of millions of dollars.  Freezing people's calling accounts, abusive, and extreme hostile and incompetent customer service agents.  They did all these things to me.  When you send money to relatives overseas, Boss Revolution drops the ball and offers no help to resolve the issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Ngharamike",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:07:58.000Z",
          "Titre": "Your exchange rate i.e Dollar",
          "Contenu": "Your exchange rate i.e Dollar - Naira is not encouraging!. As a result, I decided to take a break from Boss revolution money 💰 transfer. And besides, recently I decided to make a international money transfer to Nigeria and I discovered that I had been denied access to send some money 💰 to my siblings for family assistance!. I want to remind you that there are a serious competition in the market among the organization, and you need to improve to update! Thanks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aboauday Mohammed",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T15:11:14.000Z",
          "Titre": "Not worth it",
          "Contenu": "It’s expensive and sometimes the network connection is bad. It’s really not worth it but there are not much alternatives"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Margaret Nyamweya",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:28:02.000Z",
          "Titre": "Disappointed",
          "Contenu": "First, and I call home Boss changed my identity. Resulting in people not picking up my phone... I have called and asked why my identity keep changing and no one has an answer for me. Very disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:58:50.000Z",
          "Titre": "Red flag stay away",
          "Contenu": "It used to be a good app, but right now it's not.It's not safe at all, i have seen a lot of contacts, they are not even mine contacts. i don't not Recognize them and the only common thing between all of us is that we  use thr same app.Thatis big Privacy issue for me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sosnasole",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T16:25:32.000Z",
          "Titre": "Cheating the money!!!!",
          "Contenu": "Every day you guys are increased the payment and Chet the money too. I am tired of this sheet and try to get another company after 5 years"
        },
        {
          "Note": 1,
          "Lieu": "ET",
          "Pseudo": "Eyob Fenta",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T15:51:32.000Z",
          "Titre": "You close my account without reason",
          "Contenu": "You close my account without reason, and your customer support team is not responding to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordan Wein",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:36:24.000Z",
          "Titre": "I sent a transaction and they…",
          "Contenu": "I sent a transaction and they immediately canceled it and wouldn’t tell me why. The only thing they would say is I didn’t pass their internal verification process. When I spoke with them on the phone they told me there is nothing they can do and then hung up on me. Don’t waste your time!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Salvador Paniagua",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T14:20:34.000Z",
          "Titre": "I have the app for so many years and I…",
          "Contenu": "I have the app for so many years and I try to same money to the same people, and I ask the same information about me so many times, bank statements, receipts, was a lot information every time that I want to same money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:00:51.000Z",
          "Titre": "Boost Revolution use to be good!",
          "Contenu": "Boost Revolution use to be good with my calls to Guatemala but now my calls don’t go thru it rings once and it takes my money away"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Camah",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:16:07.000Z",
          "Titre": "The worst experience",
          "Contenu": "The worst experience. I have not received credit for my money that was wrongly taken from me. This is the worst customer service experience I have ever had with your company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Namugambe Kauthara",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T16:41:40.000Z",
          "Titre": "This company charges extra",
          "Contenu": "This company charges extra, when your making an international call, the phone starts to ring and counts seconds, then when someone answers the call, it continues to count with the previous seconds and then you charged too with those seconds when someone was had not answered yet. I wish the seconds starts to count when someone answers the call. In the end of the day, your charged for the time which you didn’t even used. So I’m not happy with that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vilma Morse",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:47:06.000Z",
          "Titre": "I had problems with the app and there…",
          "Contenu": "I had problems with the app and there was no one to help every time I called it put me on to the machine. Very frustrating and disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andy Okho attah",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:43:49.000Z",
          "Titre": "Years now you guys have not changed…",
          "Contenu": "Years now you guys have not changed your rates to Ghana.The dollar rate am talking about 1dollar is 11 cedis please change your rates as others have done!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T21:27:37.000Z",
          "Titre": "The customer service is non existing",
          "Contenu": "The customer service is non existing. I called and left a message and no reply what so ever. Horrible service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nega Haile",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:38:20.000Z",
          "Titre": "to expensive for Africa.and you…",
          "Contenu": "to expensive for Africa.and you guys,you don't refund my wrong purchased."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T15:04:32.000Z",
          "Titre": "The app keeps on crashing whenever I…",
          "Contenu": "The app keeps on crashing whenever I attempt to use open."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Badrii Boru",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:02:49.000Z",
          "Titre": "The boss revolution app is not working…",
          "Contenu": "The boss revolution app is not working network sometimes"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dr. Chinyere Obi",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T19:26:04.000Z",
          "Titre": "Boss Revolution is a scam",
          "Contenu": "Boss Revolution is a scam. Yes, you might think you are making a call using your international calling service, but they soon pull out, linking your call to direct through your local service provider. I’ve had to pay AT&T about $1000 due to Boss Revolution carelessness. I want my money back"
        },
        {
          "Note": 1,
          "Lieu": "GH",
          "Pseudo": "BISMARK AGORDZO",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T13:03:21.000Z",
          "Titre": "There has been a number of times I want…",
          "Contenu": "There has been a number of times I want to make a call and the app will tell me my number is incorrect, I should check it. As a result I am unable to initiate my calls the time I wanted. There was a lot of deduction from my debit card when I hadn't done any transaction. I called your helpline he just concluded its because I have enabled auto recharge. Auto recharge when my balance falls below a certain amount can't justify 8 or 9 recharge a day. I don't make long calls. You may check my call history."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth Abongo",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T12:45:06.000Z",
          "Titre": "Terrible!!",
          "Contenu": "Terrible!!! They decided to take 10 dollars from my card without my permission. I didn’t set up my account for automatic recharges. I have used Boss Revolution for years but now I might be forced to look for another way to communicate with my old mom who lives in the village in Kenya without internet"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Patricia Nwokolo",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T16:30:30.000Z",
          "Titre": "Boss Revolution is excellent and very…",
          "Contenu": "Boss Revolution is excellent and very Cheap to make a call. Their network is great and I am using Boss Revolution to call my family and friends."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom Meg",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:32:04.000Z",
          "Titre": "When I calling  most time sounds quite …",
          "Contenu": "When I calling  most time sounds quite  i didn't heir  anything and takes my money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dallin Prowprs",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T13:32:33.000Z",
          "Titre": "I don’t like the facts that when you…",
          "Contenu": "I don’t like the facts that when you call someone and they don’t answer you guys still charge us one minute is that fair and the rate could be in a bit cheaper"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hari",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:33:06.000Z",
          "Titre": "Calls are dropping abruptly",
          "Contenu": "Calls are dropping abruptly. No audio and connection issues"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bright Amano Paintsil",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:07:43.000Z",
          "Titre": "Most of my money sent to family upkeep…",
          "Contenu": "Most of my money sent to family upkeep has failed and money not refunded."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Henry",
          "Nb_Reviews": 3,
          "Date": "2023-09-20T00:14:14.000Z",
          "Titre": "I had a terrible service on Sept 14",
          "Contenu": "I had a terrible service on Sept 14, I called my mother in Nigeria which is the phone number I mostly call in Nigeria. We couldn't hear each other repeatedly and I was being charged even when there wasn't any evidence of connection. It led me to keep recharging my account for more than 4times ($20). When I called customer care to lodge a complain, no one gave me listening ears."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justina Ogumakin",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T04:17:10.000Z",
          "Titre": "Somebody used my account on boss…",
          "Contenu": "Somebody used my account on boss resolution that I used for calling card refill i never used more than $10.00 you let the person  bought ,$87.00 within 2hrs I didn't find out until my credit card sent the bill"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharol Appfullname",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T03:21:54.000Z",
          "Titre": "You guys keep taking my credit when…",
          "Contenu": "You guys keep taking my credit when thee person never answered"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ISAIAH RONOH",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T17:40:55.000Z",
          "Titre": "My account was locked and my cousin…",
          "Contenu": "My account was locked and my cousin back in kenya each time I call they say still under review so I need to know the reason why I can't send money to my cousin he worked for me at my farm an supporting the family .My father he on medication this really wrong me big time I need answers    By Isaiah ronoh"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Meles Abohawi",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T20:22:00.000Z",
          "Titre": "It’s a scam they don’t give you the…",
          "Contenu": "It’s a scam they don’t give you the right minutes when you dial it counts more than 60 seconds after that it rings again more than 60 seconds the whole 2 minutes gone before you say hello"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edwin Paul",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T17:04:53.000Z",
          "Titre": "For some reatson I can't send mobile…",
          "Contenu": "For some reason I can't send mobile topup to my other relatives except one contact.. The app doesn't allow me to send airtime to others in my contact list"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hailemariam Addisu",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T03:31:47.000Z",
          "Titre": "Expensive to call Africa and also no…",
          "Contenu": "Expensive to call Africa and also no discount even holidays"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "adi chek",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T18:37:36.000Z",
          "Titre": "1.Every time I call got charged with…",
          "Contenu": "1.Every time I call got charged with none answered calls. 2. Customer Service representatives picked up the phone and said transfer to another department and never picked up my call as the guy is the same with broken English language like me 🤣3. It is scummmmmmm"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ozioma",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T14:54:06.000Z",
          "Titre": "The trust is not there due to several…",
          "Contenu": "The trust is not there due to several fraudulent activities I encountered on my credit card that was linked to Boss revolution. Since I recharge through shops, I have my sanity back. No more complaints about fraud. Thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Evalyn",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T15:15:52.000Z",
          "Titre": "I can't recharge my app using my debit…",
          "Contenu": "I can't recharge my app using my debit card yet despite of calling two times. I do not understand what's not happening"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Akinrinmade",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T08:54:04.000Z",
          "Titre": "UnAuthorized change on my account by…",
          "Contenu": "Authorized change on my account by automatic change"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Malik Hayyat",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T21:09:40.000Z",
          "Titre": "I have start using this company to call…",
          "Contenu": "I have start using this company to call Pakistan and have realised that they are completely ripping off customers. Their call duration is lass than normal minutes If your phone showing 2 then they will charge you 2 minutes 23 seconds and they will deduct the money for 3 minutes I called the company customer service and asked about it He said I have refunded you the money for last call but nothing was credited back. I asked for internal complaint process and requested to speak to someone senior and was put on hold for 2 hours 52 minutes and call was automatically disconnected.It’s complete rip off. Money should be deducted for the time you speak. Not as soon as number is dialled Moreover when someone hangs up the call at 2 minutes 1 second then company deducts the money for 3 minutes The company system needs to be reviewed and money must be refunded to all customersNothing has been addressed at all. It's a fake reply"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Obatola",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:31:20.000Z",
          "Titre": "Too much delayed in connecting"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jessie",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T21:37:42.000Z",
          "Titre": "Problems stared few months ago, not sure why",
          "Contenu": "Your app has been working great for couple years since I had it, but lately it's just not working well. I have been calling the sates from Canada to my kids dad because he dies long distance driving. When the kids need him, this is the app I put money on to call him. For a good few months now it's just not connecting to his number anymore 😕 no I have been calling straight on my phone and it's costing me more money. Am not sure what going on guys but if you want to contact me directly...sure no problem"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bookee Tafee",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T06:59:12.000Z",
          "Titre": "Not good rate every expensive"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Winifred Frimpong",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T19:37:22.000Z",
          "Titre": "Terrible experiences lately",
          "Contenu": "Terrible experiences lately. Been using the App for years. Now calls can’t go through. You have to dial toll free number, then enter your phone number and security code before dialing your contacts. Too many steps, and even then calls can’t go through"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Iwuchukwu",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T15:50:48.000Z",
          "Titre": "No bonus credit from my offer purchase",
          "Contenu": "I received a text to buy calling credit to receive a bonus. It’s been over two weeks and I have not been credited with the bonus. I called your customer service and spent hours on the phone to get through and for verification of my purchase. I was told I’d receive a call and a possible bonus credit but up until now I haven’t received anything yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mulu",
          "Nb_Reviews": 3,
          "Date": "2023-10-25T17:33:28.000Z",
          "Titre": "Sorry this time when I calll in…",
          "Contenu": "Sorry this time when I calll in Ethiopia I didnt listen calling sound and I fill like the telephone is open anf I couldnt cominicate . could you pls do something"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ijesa Omoobokun",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T05:43:41.000Z",
          "Titre": "I don’t want to do business with boss Revolution anymore",
          "Contenu": "I don’t doing business with boss Revolution because they don’t have good customer service. I sent money to someone last year the person didn’t get the money and it took me more than 6 months before I could my money back bad company, I will never recommend anyone to send money through boss Revolution. Worse customer service experience"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Meridith U Muhonja",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T14:30:10.000Z",
          "Titre": "It’s a hustle setting up an account",
          "Contenu": "I opened my account a day ago with this app. I tried to verify to add my card it could not take it , so I called customer care who said that this needed versification. I give him my card details and said someone would give me a call the following day. The following day I could not access my profile so I reached out to customer care and they told me that my account is blocked! Why is my account blocked, Grace couldn’t answer, when is it getting unlocked? She said 24 hours. Why is setting up an account so hard. If I had not given my bank details this could not have been disturbing as it is now. I need a réponse but no one is giving me anything!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gold",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T02:56:13.000Z",
          "Titre": "The call to Nigeria is too expensive…",
          "Contenu": "The call to Nigeria is too expensive 40mint 5$ you can do better. I spent almost 20$ daily to call but this is too much and expensive. I have never been given any promotional code. This is the high time to switch from bossy revolution"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Feisel Seif",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T12:15:08.000Z",
          "Titre": "U guys finished my money 💰 and even…",
          "Contenu": "U guys finished my money 💰 and even though u don't give any free minit to customers u don't care about customers u just take not give that's not how it works think twice thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kwadjo Opoku",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T18:14:12.000Z",
          "Titre": "Somewhere in February 19 to 22nd 2023",
          "Contenu": "Somewhere in February 19 to 22nd 2023, I was sending $815 to Sayath Seidu Laminu but cancelled it due to the network delay issue and the money was not refunded to me and didn’t deliver to Sayath, my phone number is 6308638846. Trustworthy is the issue now"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chale Yechaltu",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T03:16:07.000Z",
          "Titre": "The rate goes up badly!",
          "Contenu": "They used to give 30 minutes for $5 to call Ethiopia but recently they changed it to 25minutes. Whenever you make a call, there is annoying commercials which you can’t skip. Looking for another options."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mario Figeac",
          "Nb_Reviews": 6,
          "Date": "2023-09-16T17:51:59.000Z",
          "Titre": "I strongly feel that this company is a…NOT A SERVICE TO TRANSFER MONEY",
          "Contenu": "I strongly feel that this company is a scam. What is more concerning is that before I instructed them to transfer $15 to a friend in Central America from my bank, they asked me to provide them with my routing and account information, which I have never been asked before by other similar services. A small funds transfer usually takes minutes to be collected, not in my case. I was informed that it would take about 4 days to have the money readily available. I chatted with what appeared to be a foreign person that could not write in English well at all, I asked if my request to cancel my transaction was still on, it took him quite a while to give me an answer, to confirm that the funds transfer was in effect. He was very vague with his answers. I WOULD SIMPLY ASK YOU FOLKS TO BEWARE OF THIS COMPANY. DONT PAY ATTENTION TO THE PHONY GOOD REVIEWS. I STRONGLY FEEL THIS COMPANY IS A SCAM."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Simeon Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:09:32.000Z",
          "Titre": "I never signed up for the service"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T23:00:00.000Z",
          "Titre": "Bad customer service",
          "Contenu": "Bad customer service. I load my account for 10 dollars but never used or couldn't share with anyone.  The 10 dollar is gone. Even nobody can give me an answer for that.Malachi"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis C. Otieno",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T15:27:07.000Z",
          "Titre": "Works Half the time!",
          "Contenu": "Works Half the time!When I use Boss calling card to call Kenya, approximately half of your calls fail to connect but I still incur charges for dialing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Md",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T14:02:14.000Z",
          "Titre": "Call rate price is high for bangladesh"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Michael",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:47:03.000Z",
          "Titre": "Take my money with out contact me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Francis Olatunde",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T02:06:55.000Z",
          "Titre": "I have deleted your money transfer app…",
          "Contenu": "I have deleted your money transfer app from my phone. You make transactions too difficult to do with you unlike other companies.  I understand you need to do thorough  diligence  but not to the extent of creating a bottleneck for your customers. I'm a thorough bred responsible person who will never soil my name with any dubious act and at age 65, I better look up to heaven than cut any corner to enjoy life. Twice I had to cancel my transactions because despite supplying all you demanded, you kept asking for more and asking 'unnecessary questions' as if I'm a suspect whereas I work hard to earn money legitimately"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Simches Chars",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T15:04:54.000Z",
          "Titre": "when i call to Belgium to a cell nr its…",
          "Contenu": "when i call to Belgium to a cell nr its just doesnt work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T19:43:34.000Z",
          "Titre": "It doesn't work for me when I try to…",
          "Contenu": "It doesn't work for me when I try to call ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Ideozu",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T06:06:05.000Z",
          "Titre": "There appears to be cheating on…",
          "Contenu": "There appears to be cheating on customers. A customer like me was not treated fairly. I had no holiday discounts for a long time now. Besides my charges per minute doubles every time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-12-05T20:15:43.000Z",
          "Titre": "Expensive",
          "Contenu": "Expensive, customer service guys has to be patient and has to be understandable to customers interactions.Need some training ro customer services."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Olayinka",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T03:09:16.000Z",
          "Titre": "I think Boss revolution is fake. You said you do discount / with phone credit purchase but don't give it. I bought $25 worth of phone card. I didn't get my 22% discount.",
          "Contenu": "You guys refused to give me the extra credit of 22% discount on my phone card purchase. I called severs times but unable to speak with a customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T03:02:10.000Z",
          "Titre": "Improvement boos app",
          "Contenu": "I need the call history, but I did not find any call history from your boss  app . I complain to three times about the card his day, but I did not get any call history two numbers I have a two numbers in BOSS Revolution®. I didn’t get the call history."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T20:37:40.000Z",
          "Titre": "I’m gonna tell everybody do not buy…",
          "Contenu": "I’m gonna tell everybody do not buy this one they rip you off specially, the credit card don’t deal with them at all. They didn’t deposit your money the right amount the worst ever"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kayode Ojo",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T15:25:47.000Z",
          "Titre": "Sometimes to call it's not clear",
          "Contenu": "Sometimes to call it's not clear. Even though you did not hear"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "TImi O",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T05:34:44.000Z",
          "Titre": "Billing irregularity",
          "Contenu": "Boss revolution is not straight forward in its billing method. How can a 1 second equate 1 minute? I am disappointed in them"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Donel Pierre",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T15:53:26.000Z",
          "Titre": "The système faild and you charge me anyway on my credit card",
          "Contenu": "6 september 2023 i recharge my sson's phone in Haïti with top up. You charge me on my credit card 5 time for the same transaction while the système was failed.I try to resolve that with the costumer service. I receive a part and you still kept 7 $ for me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elhadji Thioune",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T07:24:10.000Z",
          "Titre": "Not happy at all I have sent money for…",
          "Contenu": "Not happy at all I have sent money for days money never get to the destination no money back ether no call no email so I’m not happy for nothing… Elhadji"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer HI",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:35:15.000Z",
          "Titre": "Very poor customer service personnel…",
          "Contenu": "Very poor customer service personnel who are rude, and full of excuses.No technical support team to address connectivity issues"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Hanaa Chahbounia",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T14:04:18.000Z",
          "Titre": "I called them to resolve problem many…",
          "Contenu": "I called them to resolve problem many times I change new device the app not work in new devices I can not belive they could not resolve problem"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ADEKEMI",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T13:37:48.000Z",
          "Titre": "You ppl deducted my money without me",
          "Contenu": "You ppl deducted my money without me, I called your customer care representative,  she hung up on me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janet Buses",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T19:00:03.000Z",
          "Titre": "My minute’s disappeared",
          "Contenu": "My minute’s disappeared, zero dollars after left with $3.55, couldn’t understand"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "A T",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T13:02:10.000Z",
          "Titre": "Payment Declined but CHARGED my credit card!!!",
          "Contenu": "I signed up for Boss Revolution app, I did an initial top up of £4. Declined. But, guess what? I have been charged on my Credit card. I phoned Customer service straight away, she was dumb, I don't think she knew how their payment system works, charging system works. She is telling me 'your bank should give you the money back'. Hold on, Boss R has charged the Credit card, do you not get it? It's not the bank's fault! you want to take my money and blaming the bank..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cecilia Argueta",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T13:53:06.000Z",
          "Titre": "It is an app where there are not many…",
          "Contenu": "It is an app where there are not many options for El Salvador, I cannot even put a balance. doesn't work well"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Ahiable",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T22:55:12.000Z",
          "Titre": "Poor service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bolanle Olaleje",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T06:31:55.000Z",
          "Titre": "Terrible network ever"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mikael Eshete",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:32:16.000Z",
          "Titre": "Expensive the call per minute"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Olayinka",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T15:41:44.000Z",
          "Titre": "I called the customer service 3 times…",
          "Contenu": "I called the customer service 3 times to upgrade my plan to the latex version, but the call keep hanging up without a call back or resolving the issues from the customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sunny Kuzh",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:37:40.000Z",
          "Titre": "Call connection is so bad"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bassirou Seck",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T09:51:54.000Z",
          "Titre": "Very bad  service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Boss",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:04:49.000Z",
          "Titre": "It's too expensive 😞"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Dalling",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T14:24:46.000Z",
          "Titre": "Bad service",
          "Contenu": "No customer service representative was able to assist with my issue of not able to add my card to my account"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Akisa",
          "Nb_Reviews": 4,
          "Date": "2023-12-05T20:10:52.000Z",
          "Titre": "mOST OF THE TIME CALLAS DROPPED AND I…",
          "Contenu": "mOST OF THE TIME CALLAS DROPPED AND I LOST MY MONEY OVE $60 NOW"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Bashaer",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T19:37:04.000Z",
          "Titre": "At the beginning was nice .it  is also…",
          "Contenu": "At the beginning was nice .it  is also gave long limit but now I don’t like"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tola T",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T20:24:48.000Z",
          "Titre": "Can’t load card for autopay!"
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Jose N Arboleda",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T04:11:14.000Z",
          "Titre": "I was trying cancel my extra service…",
          "Contenu": "I was trying cancel my extra service and had been impossible. I couldn't connect with the boost mobile page."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nanette Niang",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T06:17:10.000Z",
          "Titre": "Worst customer service",
          "Contenu": "Worst customer service Nobody can give me right answer about account verification after several years with you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edward Boro",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T18:32:10.000Z",
          "Titre": "My calls have been interrupted by music…",
          "Contenu": "My calls have been interrupted by music that disconects me. I have not had a decent conversation at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Estil",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:48:29.000Z",
          "Titre": "Put more instructions details with the…",
          "Contenu": "Put more instructions details with the purchase plan and good customer service when you try to contact you guys and when you guys text back the customer stays with the same problem"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T13:29:42.000Z",
          "Titre": "Difficulty access everyone on my contact",
          "Contenu": "I'm not sure what was changed but I've been having difficulty finding everyone on my contact list via boss revolution whenever I want to make a call. This has been very frustrating each time i tried to look up someone to place a call. It was not like that before you changed how the platform used to be."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Philly Vincent",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T05:43:50.000Z",
          "Titre": "I will be trying to make an urgent call…",
          "Contenu": "I will be trying to make an urgent call boss will cut the conversation in the middle, either you'll hear yourself double, or it will create a terrible echo. If you try to call again it will be said you don't have enough airtime it getting worse by the day.Sometimes it will make a strange noise when it rings."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Calvin N.",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T09:46:20.000Z",
          "Titre": "I have called numerous times to request…",
          "Contenu": "I have called numerous times to request some documents and you sent the wrong ones. When I tried to reach you again I was told \"we already sent you what you needed\" Who has time for such bologna? Get it together. Your staff is under qualified. You still charge customers even when calls are not connected. This is broad daylight theft."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Willybroad Rusingiza",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:46:21.000Z",
          "Titre": "The time is always cut short before the given time.",
          "Contenu": "whenever i remain with $3.00 as my credit and I try to dial the next call it recharges my credit to full and the $3.00 disappears in the process .I do not always finish my credits as its supposed to be. The announced time that is given at the beginning is not the actual time spend on a call"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lian Hring",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:56:02.000Z",
          "Titre": "Horrible …",
          "Contenu": "The quality was horrible and whenever we spoke it was laggy so we couldnt understand."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Philip Adarkwa",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T15:44:52.000Z",
          "Titre": "SOMETHING IS NOT RIGHT",
          "Contenu": "I strongly believe I get less talk time for each dollar spent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ESSIAN/SIMON KWESI",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T21:59:52.000Z",
          "Titre": "I couldn't send money to my family…",
          "Contenu": "I couldn't send money to my family anymore,no notifications I don't know what what's going on"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SNW",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:33:01.000Z",
          "Titre": "It is frustrating to use the app",
          "Contenu": "It is frustrating to use the app. It uses random connecting numbers that, most of the time, do not connect to the international number. And the receiver won't know who is calling."
        },
        {
          "Note": 2,
          "Lieu": "PK",
          "Pseudo": "Umar",
          "Nb_Reviews": 4,
          "Date": "2023-12-05T23:37:54.000Z",
          "Titre": "Nowadays App is nomore working good…",
          "Contenu": "Nowadays App is nomore working good dial a number and it will tell u number is powered off and u dial a the same number from another source call will go through and u can talk What  is this"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Abiodun Bowale",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T01:51:25.000Z",
          "Titre": "The app malfunctions regularly",
          "Contenu": "The app malfunctions regularly. Besides misinformation from the automatic response, the home screen shortcut does not work. Account balance is many times faulty. Too many deficiencies with Boss Revolution, especially the app."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Reginald Ebirim",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T16:10:11.000Z",
          "Titre": "The app has failed me",
          "Contenu": "The app has failed me. I have complained several times and through phone and text and still no change. I have to download the app every time I want to make a phone call. It doesn’t make sense."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melvin Paye",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T13:44:39.000Z",
          "Titre": "When I’m talking with my people the…",
          "Contenu": "When I’m talking with my people the people will go off and when u look on ur credit drop most of the time and again the minutes be go so fast now then before"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Precious Ojeide",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T14:19:40.000Z",
          "Titre": "the security check is too much",
          "Contenu": "the security check is too much, when you submit what they want they still want more.they are the lowest exchange rate even when buying top up for your loved once.The only advantage with them is that they accept credit card but trust me, the commission is still high."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Ayodeji Oni",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T14:37:42.000Z",
          "Titre": "I tried to make payment into my account…",
          "Contenu": "I tried to make payment into my account it didn't reflect, up till now my money is neither in my bank account nor is it in my boss rev account Secondly I can't explain or define some charges in my account. Am not too impressed about the app. Despite the referrals I got am not just a happy customer  and make look elsewhere"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jk",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:42:30.000Z",
          "Titre": "You guys don’t reword your loyal…",
          "Contenu": "You guys don’t reword your loyal customers…you’re service price never improved"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dje",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T14:58:13.000Z",
          "Titre": "Minutes used to last longer now it’s…",
          "Contenu": "Minutes used to last longer now it’s $10 for 2mn basically. I will be looking for a new app. Never said it was affordable before but I’ve been using boss for 5+ years so I know the difference. Before I could talk with $10 for a really long time now I had to add for funds within minutes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "lee gal",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T01:17:17.000Z",
          "Titre": "Terrible policies",
          "Contenu": "Today their system was down but customers like myself was unaware, so I was trying to do a mobile top up, I tried many times, only to call and find out the system is giving trouble and try the top up later. Two hours later ,I recieved a notification from my bank, 2hrs later they're pulling all my attempts. When I called the rep i initially spoke with was very rude and hung up l, the second rep was nice but unable to fix anything due to policy. If you cannot process a payment and say try again later, why are you taking the attempts as payment"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Isaac Addo",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T02:52:41.000Z",
          "Titre": "Keep doing good work for customers"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ULOMA",
          "Nb_Reviews": 4,
          "Date": "2023-11-21T21:22:36.000Z",
          "Titre": "Delay connection",
          "Contenu": "Most of the time, I hear the # I'm calling is not a working #  which is not true.  Also it takes forever to connect my call.Network is usually bad with connection"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alfred Dorgbadzi",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T14:02:40.000Z",
          "Titre": "Before your system works very well but…",
          "Contenu": "Before your system works very well but at this time too,bad, you need to improve on it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AROWOLO/DELE A",
          "Nb_Reviews": 4,
          "Date": "2023-08-25T12:25:36.000Z",
          "Titre": "Irregularities",
          "Contenu": "Firstly, connections to Nigeria in most cases do not go well. You either hear number is not reachable or don’t even go through. Secondly, receiver on the other side can’t recognize who is calling because it registers different phone number and codes,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Helen",
          "Nb_Reviews": 3,
          "Date": "2023-06-18T17:03:11.000Z",
          "Titre": "Boss revolution is partial",
          "Contenu": "Boss revolution is partial. Why’s it that African people especially Nigeria can’t recharge their phones with boss revolution when they are out of America?? It doesn’t make sense. Because Africans are your main customers Thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tesfaye Maraye",
          "Nb_Reviews": 6,
          "Date": "2023-12-05T17:56:16.000Z",
          "Titre": "Because to much charge",
          "Contenu": "Nothing upgrades the same and decreases a minute charge to much"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tosh",
          "Nb_Reviews": 10,
          "Date": "2023-06-08T02:45:00.000Z",
          "Titre": "You gave me a promo code which never…",
          "Contenu": "You gave me a promo code which never worked and I contacted you. The agent took forever and never replied. Your rates are sharply declining and no longer unbeatable. I have stopped using the topup because you take my money and insist after several complaints that ONLY the top messages are received by my loved ones and instead of you taking this seriously, you keep insisting that the topup are always successful. I dont even need your message to request more information because this is always your response"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bekele Babo",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T15:00:27.000Z",
          "Titre": "No response for help needed",
          "Contenu": "The first and the most customer service. I need help, there’s no live person to answer to resolve problems. I am long time customer. I tried contact many times, but no response. The most problems are cut minutes. If can not connected for network issues, the part or all money without use.If I send money to family or friends, doesn’t transfer the exchange rate and deliver the small amount. No transparency and itemized how it happened."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T23:29:51.000Z",
          "Titre": "A little unreliable ,one calling…",
          "Contenu": "A little unreliable ,one calling someone either says the person is not available when they’re are available,not sufficient funds when you just loaded money or the number you’re calling is not in services One it chances to call the net work is super bad,customers care don’t help at all"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Salam Abdul",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T19:53:38.000Z",
          "Titre": "Most of the time when I called to Ghana…",
          "Contenu": "Most of the time when I called to Ghana .Ghana number appears on the receiver phone number. Beside that too it takes too long for the phone to ring sometimes it ring but can't reach to the receive.you need to upgrade your system to avoid the problem so your customers will be happy.there other companies doing much better service"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Peter",
          "Nb_Reviews": 4,
          "Date": "2023-06-20T23:46:19.000Z",
          "Titre": "After 10+ years since February/19/2013…",
          "Contenu": "After 10+ years since February/19/2013 of BOSS Revolution's services, it's getting too expensive and very complicated nowadays.I felt very sorry after shifting from Rebtel International calling.Thank you for lending me this opportunity of voicing to you my opinion.Sincerely;Peter Wani"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Salam Abdul",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T15:19:52.000Z",
          "Titre": "It takes to much time ring before…",
          "Contenu": "It takes to much time ring before getting the person and also my phone number most of the time appears different number in ghana.some of my family and friends even ask me if I'm in ghana. You need to upgrade your service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Abdulfatai Kabala",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T13:12:51.000Z",
          "Titre": "Your Compliance department is too…",
          "Contenu": "Your Compliance department is too intrusive. Even after bank statements have been provided and transaction history submitted,  they still want sources of cash deposits. What's up with that? I have no clue how to provide that!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nao",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T12:31:01.000Z",
          "Titre": "The Cost!",
          "Contenu": "Cost of International call is so unfair. You are exploiting people who are in need, who are from poor countries , without internet . No one from countries who have better internet connection use BR. & the fair the costs become, the more I use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Abbas Mehrzad",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T07:52:26.000Z",
          "Titre": "The phone call fails after a few…",
          "Contenu": "The phone call fails after a few minutes sometimes or computer comes online , interupting telling how much money and minutes are left even when there is a good amount left over . The minute calling rate has increased compared to the past greatly."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Simran Simi",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T19:21:43.000Z",
          "Titre": "App sometimes doesn’t work and it’s…",
          "Contenu": "App sometimes doesn’t work and it’s showing error even after restarting the phone. That’s too frustrating. Please improve the quality"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zaccraya Cisse",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T03:22:28.000Z",
          "Titre": "I feel that I was not treated fairly",
          "Contenu": "I feel that I was not treated fairly. I cancelled a transaction from your app that was not being deposited. The next day the transaction got deposited after I put in a new transaction for the same. Boss Revolution representatives could only apologize. I need a refund of the transaction that I submitted a cancellation"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Oneoritsebawo Adams",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T15:30:49.000Z",
          "Titre": "First thing first I wasn't supposed to…",
          "Contenu": "First thing first I wasn't supposed to continue using this app because they stopped me from using my account with 15 CAD balance in it but then again I don't have a choice cause I had to start all over again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Irene Logothetti",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T02:42:12.000Z",
          "Titre": "A customer service representative told…",
          "Contenu": "A customer service representative told me there was a 20% bonus promo during my last recharge. But that was not true. That was on Labor Day."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mazharul Molla",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T19:17:52.000Z",
          "Titre": "I haven’t got my $10 referral bonus…",
          "Contenu": "I haven’t got my $10 referral bonus towards my international calling. Not happy with the customer service. They still pending my case ##4224423. They said with in 72 hours I should be getting feedback. It’s been more than week did not heard anything. It is very annoyed to ask for help but not getting the level of help that I asked for. And then I have to call customer service for the same issue and explain all over again. Please fix this issue and make the customer service team little better. My $10 bonus referral still unanswered even though I meet all the requirements. Hope you can help me to find the answer. Thank you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:38:55.000Z",
          "Titre": "Promotion offer not paid",
          "Contenu": "I recharged my accounts $35, on 2 separate purchases last month due to a promotion offer boss revolution sent in a text message to my phone but that offer never was never paid to my accounts. I tried calling but no response and the time spent on the phone to talk to a customer service agent is just too much so I decided to let it go."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Philip  Akinsoto",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T02:27:00.000Z",
          "Titre": "Whenever I dial internationally",
          "Contenu": "Whenever I dial internationally, it shows up as a local number so the recipients think it is local spam and don't answer sometimes. Rebtel shows your American number and has better rates. Will switching once my credit runs out"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Mihreteab",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T14:54:05.000Z",
          "Titre": "We bought 50 CAD without telling us…",
          "Contenu": "We bought 50 CAD without telling us they took money from our account and we had to contact a agent and they still haven’t refunded us"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Jacob",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T14:34:40.000Z",
          "Titre": "Your rates are too high especially in…",
          "Contenu": "Your rates are too high especially in this Era of internet and VOIP"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hassim",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T02:13:59.000Z",
          "Titre": "CSR are horrible",
          "Contenu": "The app itself is great. No complaints.  However customer service and support is horrendous.  Please don't waste time referring someone,  you will never get credit.  Just horrible service!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Aboauday Mohammed",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T18:59:21.000Z",
          "Titre": "It’s expensive",
          "Contenu": "It’s expensive I use it almost every day these days due to the issue in my home country. Sometimes they charge me even if the call didn’t start.  I spend around 10 bucks daily.  I still use it cause no alternative but if I find alternative I will switch"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Samuel",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T05:00:42.000Z",
          "Titre": "Horrible advertisement at the caller’s expense",
          "Contenu": "It is very annoying and unacceptable that these people play some stupid music at the caller’s expense and even advertise that you should pay to copy the music.All the nonsense is at the caller’s expense o. That must stop"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customerjohn",
          "Nb_Reviews": 2,
          "Date": "2023-08-15T16:46:32.000Z",
          "Titre": "My experience not great because you…",
          "Contenu": "My experience not great because you guys started well but charges too much now. Cut data/credit anyhow"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ify O",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T11:29:35.000Z",
          "Titre": "Boss, The Inconvenient Calling App",
          "Contenu": "Call’s don’t go through most of the time and yet, charges are still deducted even though these international numbers do not have voicemail services. Also, they waste your time by constantly soliciting that you purchase a ringtone or with other irrelevant sales advertisements."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "emem",
          "Nb_Reviews": 3,
          "Date": "2023-09-06T13:30:19.000Z",
          "Titre": "The promo code did not apply",
          "Contenu": "The promo code did not apply. Sat on the phone for more than an hour unable to reach customer service. No instant response email."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mengistu Geletew",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T15:00:52.000Z",
          "Titre": "Without taking you guys you take my…",
          "Contenu": "Without taking you guys you take my minutes even if when I called you,no one responded they are cheating"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:45:22.000Z",
          "Titre": "Too much expensive!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Samuel Adusei",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T05:56:05.000Z",
          "Titre": "Not that great",
          "Contenu": "Not that greatAt this age of technology phone calls should not difficult especially when I’m paying for it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Janet Bryan",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T13:35:06.000Z",
          "Titre": "Discounts Needed",
          "Contenu": "App difficult to use...too much marketing... Not enough time for money also no discounts for frequent use"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Benedicto Cardona",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T22:45:47.000Z",
          "Titre": "They never solved the problem about…",
          "Contenu": "They never solved the problem about buying balance in the application I can't use my card that bad.  every time I have to go to the store to recharge my balance"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kaakyire Badu",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T05:39:03.000Z",
          "Titre": "Can't hear the phone ring at the other…",
          "Contenu": "Can't hear the phone ring at the other end of the receiver which makes it hard to determine if the call went through or not."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Mariealma Elie",
          "Nb_Reviews": 2,
          "Date": "2023-05-26T17:09:05.000Z",
          "Titre": "I sent 10 dollars of minutes on a phone…",
          "Contenu": "I sent 10 dollars of minutes on a phone in haiti, you didn't put the minutes and you took my money.  I called you and you didn't anything. It's organized theft.  I will never do that put minu to Haiti.  it wasn't digicel that stole me, but the boss revolution company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-08-12T23:38:09.000Z",
          "Titre": "To transfer money form bank in America to Liberia banks very fast.",
          "Contenu": "To  transfer money from bank in America to Liberia banks very fast it's a big problems. Please update systems."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Queen R",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T04:19:32.000Z",
          "Titre": "Please use per second billing instead…",
          "Contenu": "Please use per second billing instead instead of per minute. Thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Viktor",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T00:20:26.000Z",
          "Titre": "Connection is very abysmal",
          "Contenu": "Connection is very abysmal. The exact reason why I use your service is to make international calls and that is very disappointing lately."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T00:34:44.000Z",
          "Titre": "Significantly More Expense to Call Poorer Countries",
          "Contenu": "I use the service to call my folks back home in Jamaica, and I'm perplexed that it cost about 8x more to call a Third World country than it is to call a First World country, where folks have significantly more wealth."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Gez",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T18:39:08.000Z",
          "Titre": "Boss using other provider line to make a call and double charges you…",
          "Contenu": "I have been a user of boss revolution to make an international call to Africa but recently I have been  double charged with boss revolution and my phone provider because boss revolution when ever they can’t make a call due to connection they use your phone provider line to make the call happen that way I was double charged by boss and  my regular  phone provider multiple times and I am frustrated and lost trust . I contacted both sides for a refund but for no avail. I know this is all boss revolution fault for using others providers line to make a call and they couldn’t take responsibility."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ndemsah",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T13:33:07.000Z",
          "Titre": "My brother died because your company…",
          "Contenu": "My brother died because your company can not allow me to send money for his treatment.  My brother was sick and I sent 806 dollars twice and it went through. The third money I tried to sent could not go through. For one week I have been talking to your workers to help me send the money needed for his treatment but they could not. I did everything they wanted including uploading my ID, social security number, address, etc. The money I sent was blocked.  Because I was unable to send the money, the hospital could not do the procedure needed to treat him. As a result he died.After his death, I tried sending money for his burial and your system refused me. I called your incompetent employees who once again, could not help me. I was soo disapointed  with your services. The last 806 dollars i tried to send was taken from my account but never paid. After some days I had to call and cancel the transaction but my refund ha not yet been done. I have called your office more that 20 times and no one could solve my problem. I asked to talk to a superior and not manager seams to exist. I have been your customer for years, how can I not be able to send 4000 dollars to safe my brothers life. Your services are the worst. Incompetent workers."
        },
        {
          "Note": 2,
          "Lieu": "DM",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T13:28:39.000Z",
          "Titre": "I am trying to call a phone number and…",
          "Contenu": "I am trying to call a phone number and it's saying not activated. I spoke to the phone company everything is good on their end."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Thomas ansieta",
          "Nb_Reviews": 2,
          "Date": "2023-06-09T14:19:50.000Z",
          "Titre": "I have calm for a complaint never solved",
          "Contenu": "I have calm for a complaint some time ago about someone using my automatic recharge on my account and using it for about 100 dollars until I saw and call to cancel auto. Recharge a pin was put on my account to be used ok but the money was never returned in to my account that is unacceptable my bad review will be published on the web for every one to see them before doing business with boss revolution"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carlos Cabral",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T19:24:30.000Z",
          "Titre": "Some rep. Hang on me , my problem wasn't resolved",
          "Contenu": "I was hanged up  , by one of your reps.Repeatedly tell me what the country code is to Portugal, after I told her that wasn't the reason I was calling."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bukola Kehinde",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T20:40:32.000Z",
          "Titre": "With the App when you are connected and…",
          "Contenu": "With the App when you are connected and no voice the App generated number you use is not seen or identified when customer service is called hence you lose money and the rounding up of minutes use ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gloria",
          "Nb_Reviews": 5,
          "Date": "2023-06-07T11:56:59.000Z",
          "Titre": "Sometimes there are…Not keeping to promises",
          "Contenu": "Sometimes there are promotions,sometimes i get them but other times but i never get them after payment, I feel tricked"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sly Ezeani",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T18:32:32.000Z",
          "Titre": "Twice I sent $100 respectively to…",
          "Contenu": "Twice I sent $100 respectively to Nigeria and to two different persons and they both didn’t make it to their banks and I didn’t get refunded."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ERBETTO/TADDESSE KEBEDE",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T08:49:09.000Z",
          "Titre": "I did send money using 'top up' for my…",
          "Contenu": "I did send money using 'top up' for my wife but you got  her less than half what I send. So it's steeling somebody's money  with out telling your customer. Too bad"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Addo",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T13:44:54.000Z",
          "Titre": "Takes an average of 35 seconds to…",
          "Contenu": "Takes an average of 35 seconds to connect calls, which eats into the customer’s paid minutes."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Abeba Gebru",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T17:04:07.000Z",
          "Titre": "The time given to the money we pay is …",
          "Contenu": "The time given to the money we pay is  small. At list 40 min should be given for 5 dollars like any other company. Otherwise bose is to save the min for longer time.Thx."
        },
        {
          "Note": 2,
          "Lieu": "NG",
          "Pseudo": "A.O Ade",
          "Nb_Reviews": 3,
          "Date": "2023-09-20T12:00:13.000Z",
          "Titre": "Really dissatisfied that the coupon…",
          "Contenu": "Really dissatisfied that the coupon promised was not honored with my $50 purchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Victory Eshiet",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T19:22:06.000Z",
          "Titre": "When l send mobile pop up my account…",
          "Contenu": "When l send mobile pop up my account gets charged but my recipients don't receive the credit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patrick Thelusma",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T15:10:15.000Z",
          "Titre": "since I have the boost I always can…",
          "Contenu": "since I have the boost I always can receive call if my phone cut of but 2 month now it off completely"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Pearl",
          "Nb_Reviews": 2,
          "Date": "2023-05-20T01:51:12.000Z",
          "Titre": "Too expensive and minutes run down…",
          "Contenu": "Too expensive and minutes run down before you know it. Sometimes, calls are not clear. Please work on the connection and rate. Thank you!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RT",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T00:59:15.000Z",
          "Titre": "No promotions",
          "Contenu": "It is good, but last time I invited one of my friend, but I didn’t get the promotion"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Abriil Ghak",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T01:43:11.000Z",
          "Titre": "Isn’t that great at all it’s very…",
          "Contenu": "Isn’t that great at all it’s very expensive to calls my family back home in South Sudan. A lot money with a little minutes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Solange Ngum",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T03:20:39.000Z",
          "Titre": "Navigation",
          "Contenu": "The updated app is not as easy to navigate like the older version"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gilbert",
          "Nb_Reviews": 6,
          "Date": "2023-09-05T20:38:39.000Z",
          "Titre": "Boss Revolution sacks.",
          "Contenu": "For the past week I have been trying to get my issue resolved, but impossible. I  will be put on hold for ever."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T01:58:42.000Z",
          "Titre": "When I buy calling plans always I lots…",
          "Contenu": "When I buy calling plans always I lots of minutes you charge me the one I don’t use  it that isn’t good"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jo",
          "Nb_Reviews": 8,
          "Date": "2023-06-13T23:33:28.000Z",
          "Titre": "A lot of time connection bad and the…",
          "Contenu": "A lot of time connection bad and the other people didn’t hear me it’s not signal"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff Akisa",
          "Nb_Reviews": 4,
          "Date": "2023-06-07T15:03:22.000Z",
          "Titre": "Phone connection was not clear for the…",
          "Contenu": "Phone connection was not clear for the last couple of calls have made and have ended up loosing money"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sherif",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T14:03:37.000Z",
          "Titre": "Not applying cupoon code",
          "Contenu": "After you send me a promo price, I forgot to apply it. I asked to apply but I got refused to apply"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kumlachaw Habtemariam",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T02:55:32.000Z",
          "Titre": "I’m using it but ist too expensive than…",
          "Contenu": "I’m using it but ist too expensive than other apps."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mikru Belay",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T03:05:21.000Z",
          "Titre": "Short time when we compared with other…",
          "Contenu": "Short time when we compared with other or expensive to have a call to africa"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Seth",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T00:25:33.000Z",
          "Titre": "you give reward for the amount which…",
          "Contenu": "you give reward for the amount which somebody has bought"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mr T",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T04:26:16.000Z",
          "Titre": "Calls always hang up and the rates and…",
          "Contenu": "Calls always hang up and the rates and promotions are fraudulent"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "S W",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T02:49:31.000Z",
          "Titre": "Calling to kenya from usa is very…",
          "Contenu": "Calling to kenya from usa is very expensive. The credit just vanish within no time. I hate it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mahawa Camara",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T06:54:26.000Z",
          "Titre": "Bad because they don’t have bundles for…",
          "Contenu": "Bad because they don’t have bundles for my country Guinea I always paye the full Amon"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "cuTitilayo Fakolade",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T14:01:25.000Z",
          "Titre": "Too much charges on making calls and…",
          "Contenu": "Too much charges on making calls and buying data"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "lucky",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T03:18:51.000Z",
          "Titre": "Get used to poor connection to Europe.",
          "Contenu": "Quite often the calls do not get through during “peak” hours. Calls get dropped from no reason.Shame."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Baguma Ndongwe",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T12:40:41.000Z",
          "Titre": "Too much charges that other similar…",
          "Contenu": "Too much charges that other similar calling  platforms , and sometimes the application charges fees without even communicating with anyone or without even anyone picking up the call, most of the time too you have to call more than 3 times sometimes up to 7 times for a single phone number to go through"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justus Kuria",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T20:03:01.000Z",
          "Titre": "The sound is not good",
          "Contenu": "The sound is not good, keeps on loosing connection."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T18:43:50.000Z",
          "Titre": "I had to make emergency calls and all I…",
          "Contenu": "I had to make emergency calls and all I received was error messages."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Raza",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T21:19:45.000Z",
          "Titre": "Customer services needs improvement",
          "Contenu": "Customer services needs improvement, sending airtime gets queued never get refunded and can't use the app directly for international calls and  dialing a number is a long process!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "EniolaIlawole",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T05:45:53.000Z",
          "Titre": "Delays",
          "Contenu": "Delivery of funds are a bit slower than Send Wave, app also not too user friendly. Fees are higher than Send Wave."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Tsegay",
          "Nb_Reviews": 3,
          "Date": "2023-05-22T07:36:08.000Z",
          "Titre": "Many times",
          "Contenu": "When you call long distance the line is so difficult and when the call is disconnected by itself Boss Revolution always charging me,and sometimes when I purchase certain amount the balance doesn't change and they charged me more,I  subscribed for years but the problem didn't solve it yet that's very tough to stay with Boss Revolution!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maculeuse Pierre",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T17:46:45.000Z",
          "Titre": "When I bought minutes online you don’t…",
          "Contenu": "When I bought minutes online you don’t give promotions."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Helen",
          "Nb_Reviews": 3,
          "Date": "2023-08-14T16:39:56.000Z",
          "Titre": "Why is it that Nigerians can’t call…",
          "Contenu": "Why is it that Nigerians can’t call with Boss Recharge card. Only data"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carolyn Akhimiomoh",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T11:51:07.000Z",
          "Titre": "Call rate is too expensive and too many…",
          "Contenu": "Call rate is too expensive and too many connections issues."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "krishna biswas",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T17:31:16.000Z",
          "Titre": "Without knowing me",
          "Contenu": "Without knowing me , they recharged ,,. I didn’t mentioned auto charges,,,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Franco Gowolo",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T21:16:19.000Z",
          "Titre": "Needs improvement",
          "Contenu": "I like to that I’m able to connect to my family overseas in South Sudan Africa but the rate is ridiculous. 40cent for minute, very unfair compare to other countries rates, it should be 15-25 cent. I’ll guarantee there will be a lot of calls going to South Sudan which will improve n increase boss revolution business n funds. I also don’t like the facts that my phone # or caller ID doesn’t shows to my family members there. Very sad,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MOMANYI/JUSTUS KAYAGA",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T19:10:18.000Z",
          "Titre": "Recent update has made the app to crash…",
          "Contenu": "Recent update has made the app to crash repeatedly when opening it. Shows contacts without names. Today it could not show me the option to add credit. My phone advises me to Uninstall the app due to constant crashing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gilbert Agninde",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T04:17:12.000Z",
          "Titre": "I like boss revolution.however,i have…",
          "Contenu": "I like boss revolution.however,i have to point out that sometimes  the service is not good like we expect it to be. I like the promotions of boss revolution but i have noticed that whenever there's promotion it becomes a headache to make calls.The last thing i would like to mention is the rate.I would really appreciate it if BR reviews the service cost towards some African contries."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nnenna Ozoalor",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T08:29:19.000Z",
          "Titre": "Hello",
          "Contenu": "Hello, before now, you always send a notification about promotion to our phones or thought emails  like this one, but  I no longer get such information. And for many months now there was no promotions and  if there was at all I did not  get the information. It will nice if you give us some  bonuses or promotions. Thanks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lucy Ekanem",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T05:30:53.000Z",
          "Titre": "Promotional minutes purchased should not have expiration.",
          "Contenu": "When trying to make a call overseas sometimes the system say “Boss Revolution does not recognize the number” whereas I have made calls for years with the same number. I have to suspend the call at that moment and come later. Secondly, when the company gives Holiday promotion minutes, they dictate when that purchase of promotional minutes should be used until a certain short time otherwise not valid."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amos Ototo",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T07:24:19.000Z",
          "Titre": "Sometimes saying numbers are out…",
          "Contenu": "Sometimes saying numbers are out service, long waits to connect to other people’s phone, calls being cut short suddenly, poor connection"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joyce",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T18:17:17.000Z",
          "Titre": "Lowest rate for money transfer to…",
          "Contenu": "Lowest rate for money transfer to Nigeria, and lately, calls hasn't been going through but fee is taken; sometimes quality is very poor"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ebere Ralph  Nwafor",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T16:59:01.000Z",
          "Titre": "My phone company Verizon still charges me for call I make on boss Rev",
          "Contenu": "I don’t understand why my phone company VERIZON still have to bill me for international calls after paying for same on your boss revolution app through my bank. Pls look into it and sort it out. This might make you lose clients."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Antoine Appfullname",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:33:59.000Z",
          "Titre": "Mid November until now,it's difficult…",
          "Contenu": "Mid November until now,it's difficult to have communication with my born country. Multiple times, voice cam:Boss Revolution does not recognize the phone number. Before I didn't receive this message."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TAGAY ABEBE",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T15:02:53.000Z",
          "Titre": "I been valued customer for too many…",
          "Contenu": "I been valued customer for too many years,  But you guys super selfish never give give Special discounts & offers. To be honest with you, if I get better company right away delete Boss revolution ap from my phone!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Kihiko",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T04:05:11.000Z",
          "Titre": "Difficult n getting contacts",
          "Contenu": "The upgrade interfered with the contacts making it difficult to get a contact person. Wish it would have remained as it was"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Abdul Rahaman",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T08:29:18.000Z",
          "Titre": "Previously when I send money to ghana I…",
          "Contenu": "Previously when I send money to ghana I had the option of sending it to the recipient wallet but now that option is not available its either pick up or bank account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Caroline Nyakundi",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:48:36.000Z",
          "Titre": "You market now is going  low many…",
          "Contenu": "You market now is going  low many member decided to use what ,s up and messanger reason the boss revolution decrease the rate of minute to talk to international  goes faster."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lilian",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T07:10:20.000Z",
          "Titre": "I have to use boss revolution because…",
          "Contenu": "I have to use boss revolution because there’s no more cards to call my people but unfortunately all the time when I’m taking I can’t or my people can’t hear me or the call end so I’m not happy with that card but I have no choice so I have keep using it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amaka Ejimbe",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:20:36.000Z",
          "Titre": "The app is reliable however it’s…",
          "Contenu": "The app is reliable however it’s connections when calling Africa is not so good for"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sherifat",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T22:09:39.000Z",
          "Titre": "Sometimes you when trying to use my…",
          "Contenu": "Sometimes you when trying to use my card for the first time in a day or two or three days, it says it’s already in use, which is always a lie, and it’s been coming constant nowadays, and it runs out quickly too"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Gire",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T18:29:23.000Z",
          "Titre": "Aside from the calls not always being…",
          "Contenu": "Aside from the calls not always being clear, sometimes numbers that are in the contact list do not display in the Boss app"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T13:39:49.000Z",
          "Titre": "The 20min international call after…",
          "Contenu": "The 20min international call after every recharge does not call for mr"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mohamed Nyei",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T15:06:14.000Z",
          "Titre": "They must refrain from charging fees…",
          "Contenu": "They must refrain from charging fees when a call fails to connect. I've noticed charges being incurred even when the other line is busy, or there is no response. Despite reporting this issue multiple times, it seems that my complaints have not received the necessary attention. They must review and address this matter promptly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Taiwo Bamigbade",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T05:42:19.000Z",
          "Titre": "Whenever the call got disconnected…",
          "Contenu": "Whenever the call got disconnected after 4 seconds. You charge 12 cents. Just as what you charge for 60 seconds"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Berhanu Weldearegay",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T14:09:37.000Z",
          "Titre": "Sometimes when I am taking with someone…",
          "Contenu": "Sometimes when I am taking with someone  suddenly other party voice is disappear or dis connected and what ever the voice isn't clear but it is happening Sometimes not always."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ermias Abraham",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:50:34.000Z",
          "Titre": "The overseas calling rate per minute is…",
          "Contenu": "The overseas calling rate per minute is quite expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Kibira",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:58:53.000Z",
          "Titre": "Calls not clear",
          "Contenu": "Calls not clear. Echo most of the time,  doesn’t connect sometimes, should be cheaper"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "A satisfied customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T14:57:08.000Z",
          "Titre": "rates are decent but not willing to assist customers when needed",
          "Contenu": "rates are decent but the lack of willingness to make corrections when customers make mistakes plague this company.If a mistake is not on their end, they turn a blind eye and coldly reject any pleas to make ammends"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bones Mathew",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T01:38:02.000Z",
          "Titre": "From the beginning was so good but now…",
          "Contenu": "From the beginning was so good but now I can’t talks more if I put 10$, please improve this issue"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fatimoh Atanda",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T14:28:07.000Z",
          "Titre": "Rate and Wi-Fi",
          "Contenu": "Before you can use Wi-Fi calling but now you can’t and also the rate of calling to Nigeria went up ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "alphonse",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T13:51:09.000Z",
          "Titre": "Very poor customer service",
          "Contenu": "Very poor customer service. When you call customer service make sure you have time waiting on the line. If you get someone, there’s nothing he can do. On the other side your services are reliable for calling . My units are safe and ready to be use anytime I need it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dimanche Tubman",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T14:34:04.000Z",
          "Titre": "First Class Manipulation",
          "Contenu": "Some of my units on my calling card mysteriously decreased. When I called the representative argued with me that I was lying. I think this was done to enable me to increase my unit automatically."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Concerned customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T13:44:39.000Z",
          "Titre": "You route calls with a local number and…",
          "Contenu": "You route calls with a local number and because of the high fraudulent activities in my country, people don’t like picking up calls from a number they don’t know. You need to stop doing that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Femi Adesina",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T16:16:56.000Z",
          "Titre": "We still hav connectivity issues",
          "Contenu": "We still have connectivity issues. You need to fix it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Femi Oladimeji",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T13:56:03.000Z",
          "Titre": "Hiding Caller’s ID",
          "Contenu": "Hiding Caller’s IDDifferent, different numbers appeared to the receiver when I called.The time in the country you are calling should be shown on caller’s phone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Margaret Awusa",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T07:52:09.000Z",
          "Titre": "Review",
          "Contenu": "Like the fact that l can send top ups to love ones when needed,  although, the connections are not great sometimes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lucas Ramirez",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T13:46:52.000Z",
          "Titre": "App is ok",
          "Contenu": "App is ok, but sometimes not sound or signal from the app is gone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mapro Lola",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:38:01.000Z",
          "Titre": "The background I not as good as it used…",
          "Contenu": "The background I not as good as it used to be most of the time it frozen up"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Franck",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T22:21:49.000Z",
          "Titre": "Credit going faster than I thought",
          "Contenu": "I don't like the way the calling is going through. It going to fast"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Oluremi",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T07:00:48.000Z",
          "Titre": "I dont like you charging minutes on my…I dont like you charging minutes on my calls even when still ringing. I believe ethically minutes should only start counting from when the caller is through to t",
          "Contenu": "I dont like you always charging minutes on my calls even when still ringing. I believe ethically minutes should only start counting from when the caller is through to the receiver at the other end. You have to stop this practice of cheating and exploiting me, and your other customers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ajibola Adebiyi",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T13:15:03.000Z",
          "Titre": "Cheap to use but need to improve",
          "Contenu": "There's always lot of struggle to get call through. Most time boss revolution say phone number switch off or not available but that is not true if you use other means the call goes fine. Also most time boss revolution is loss internet compared to other. Overall not bad because it is cheaper to use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cornelia",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T14:59:26.000Z",
          "Titre": "My bad moment",
          "Contenu": "Thank you for everyone who is working hard to make sure that I’m very satisfied with the service. Sometimes the rate is lower than moneygram but I always choose boss revolution. Please make sure to keep me updated on the technical issues so I won't have to send money during that period . Last time I called several times my bank and they tried hard to solve the problem and finally the realized that it from boss revolution. I hope this review will help.  Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Josiah",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T22:16:03.000Z",
          "Titre": "The app crashes regularly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer  Cecilia",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T22:05:40.000Z",
          "Titre": "Don't have a review title",
          "Contenu": "The network connection is very bad, can barely talk to my family abroad, got to do something about it. Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rose of Sharon Travels",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T18:39:45.000Z",
          "Titre": "Clear network",
          "Contenu": "Network not always clear and sometimes credit keep reading."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BeckSee Lady",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T13:28:56.000Z",
          "Titre": "It is a decent app but expensive to…",
          "Contenu": "It is a decent app but expensive to use, and sometimes lines get crossed and you can hear other callers in the background or obvious strangers answer calls. I recommend that BR offer month-to-month plans to customers and send a reminder to pay. I don't like automatic refill because it seems to debit money from bank every day or every other day. I also recommend a quicker notification during calls to inform that only 2 or 3 minutes are left before call disconnects. With that courtesy notification, customers would have time to add balance before calls abruptly cut off. I have had very important calls cut off because I did not realize my balance had declined to zero. Usually only a short, maybe a few seconds notice, is given before call drops. Sometimes no notice at all comes before call drops. Thanks for your attention."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Afewerki Ghebreigziabher",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T21:35:07.000Z",
          "Titre": "High service price",
          "Contenu": "I like the smooth connection of the app. But on the other hand the rate for Eritrea is too expensive , and I hope this will be corrected in the future. Because today there are a lot of online phone services with good connection that are more cheaper than Boss Revolution."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ejike Amadi",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:42:35.000Z",
          "Titre": "The network is not always strong and…",
          "Contenu": "The network is not always strong and high tariff too."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Demissie Birhanemeskel",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T15:41:07.000Z",
          "Titre": "I like the app it helps me to call any…",
          "Contenu": "I like the app it helps me to call any time every where.What I  don't like is I was Charged with no connection and communication several times by simply listening a ringing tone.The other problem is I can't hear the other party or vice versus .Your price per minute to call to Ethiopia is too expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bay",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T16:47:28.000Z",
          "Titre": "More discount for loyal customer.",
          "Contenu": "More discount for loyal customer and attractive advertisement for new users.   Make sure to extend the time per rate without increasing the fee charged.What about 30 minutes for $ 5.00!  It is possible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lk.",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T13:05:07.000Z",
          "Titre": "Just an okay app",
          "Contenu": "Just an okay app. Automatic recharge could be untrue for call bonus and call bonuses may not apply for call recahrge and sometimes for external transfer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tesfaye Mengesha",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:11:00.000Z",
          "Titre": "That's better to extend time from 24…",
          "Contenu": "That's better to extend time from 24 hours to 48 hours please for $5 call to Ethiopia"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julian",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T15:33:12.000Z",
          "Titre": "It too expensive in this day and age to…",
          "Contenu": "It too expensive in this day and age to call some country while cheaper to call other"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:33:40.000Z",
          "Titre": "Apps sometimes malfunction abd calls…",
          "Contenu": "Apps sometimes malfunction abd calls won't connect"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Franco Gowolo",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T05:04:53.000Z",
          "Titre": "I like the apps cause it help me…",
          "Contenu": "I like the apps cause it help me connect to my family overseas but what I don’t like is that rate to South Sudan 40 cent par minute, that’s too much. Try to cut the rate down to 20-25 cent for minute so ur customer who have family over in South Sudan or Africa continent can enjoy talking and using ur apps more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KHALIL",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T16:06:42.000Z",
          "Titre": "Not really bad",
          "Contenu": "Not really bad , but I think your application needs improvement. Sometimes data is  crossed and twisted together and lines overlapping. Many times I give up making calls because lines are mixed up"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Olu Mide",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T04:35:43.000Z",
          "Titre": "It's taking long time before you get…",
          "Contenu": "It's taking long time before you get connected when you make a call, and it starts counting before you get connected. That's not fair, it's not like that with other company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Muweesi",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T15:07:58.000Z",
          "Titre": "International phone calls are clear",
          "Contenu": "International phone calls are clear. I like BR Club promotions. Top up, sending MTN mobile top up, calling time received is not much."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Olu Faboy",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T16:35:19.000Z",
          "Titre": "It will be helpful if Users friendly !",
          "Contenu": "It would be helpful if your apps is User friendly.Good customer service like perhaps someone to contact immediately when there are issuesIt get frustrated when there is an issue and no one to contact immediately"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Lova Guilbeault",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T12:45:04.000Z",
          "Titre": "Expensive than competitors",
          "Contenu": "Well.the time you get per sec should be improved. It's getting shorter and shorter,means it's expensive .. communication cut and loose our money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Odion O",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T00:40:31.000Z",
          "Titre": "Reduce your call rate to Nigeria",
          "Contenu": "Reduce your call rate to Nigeria. I’m sure majority of your customers are from that country, and you can do well to make them pay less for their patronage!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gilbert Agninde",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T06:46:13.000Z",
          "Titre": "We really appreciate your…",
          "Contenu": "We really appreciate your service.helping people to be connected with their families. Thanks for the promotions. But i think you can do better with rate and service quality.Sometimes the service is very disgusting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T18:49:52.000Z",
          "Titre": "i like voice quality  and the app in…",
          "Contenu": "i like voice quality  and the app in all, but the price is to high for Eritrea per minute .27 Eritrea has the one expensive in Boss revolution pleases help us."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Salimata  Dia",
          "Nb_Reviews": 4,
          "Date": "2023-09-13T03:05:36.000Z",
          "Titre": "I sent money twice the same day but the…",
          "Contenu": "I sent money twice the same day but the 1 st one didn’t get through until the following day and I didn’t get any notification about the issue. I saw “ready” and nothing else. I was very upset"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fanta Diallo",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T00:09:42.000Z",
          "Titre": "1-Y’all need to give rewards to your…",
          "Contenu": "1-Y’all need to give rewards to your loyal Customers like Prime, coupons, etc.. !! 2-y’all are expensive to call from GuineeOtherwise, the app works well. Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kafayat Bello",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T12:13:59.000Z",
          "Titre": "My opinion",
          "Contenu": "As long as ther s money on my call card am good to call anytime I want but sometime boss did cut you off bcos the cards is about to finish"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sylvester Simeon",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T16:51:50.000Z",
          "Titre": "High rate",
          "Contenu": "High rate, needs to be competitive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rasaki Eluku",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T03:55:26.000Z",
          "Titre": "Improve on your network."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ALIATUDAWDA",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T18:11:46.000Z",
          "Titre": "You all not raning special any more …",
          "Contenu": "You all not raning special any more  like thanks giving"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Reginald Ebirim",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T16:06:26.000Z",
          "Titre": "your i phone app is no longer easy to…",
          "Contenu": "your i phone app is no longer easy to use since you merged the BR money and the BR international calling. Also your customer service is very slow to respond to my calls"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kaleda",
          "Nb_Reviews": 6,
          "Date": "2023-12-05T19:19:57.000Z",
          "Titre": "The calls don't always go through",
          "Contenu": "The calls don't always go through. Have to call more than once sometimes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Menfo",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T20:37:38.000Z",
          "Titre": "Fair",
          "Contenu": "Fair. This has been working for me to reach my people in Africa but it’s not doing enough to reduce cost of call on both to & fro Africa knowing the economic situation."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Omar Carrazana",
          "Nb_Reviews": 3,
          "Date": "2023-09-15T16:04:30.000Z",
          "Titre": "I was very satisfied the service…",
          "Contenu": "I was very satisfied  with the service since the beginning  ,I was paying 27 Dollars recharging my family cellular phone but once I reinstalled  the app on my phone I started paying 31 Dollars while my friends were paying 27 like what I was paying before ..I called the company 3 times  and they could not help me .they told me there was going to be an investigation  and contact me but it never happened  so I am not using your service anymore I use now Megaconecta  that even paying in American Dollars I am.paying only 21 Canadian Dollars"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wendy Mkhize",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T00:57:32.000Z",
          "Titre": "App Needs To Be More Reliable!!",
          "Contenu": "I have been using this app for about 5 years now, if not more. I does get the job done however too often I’ve had to dial a number more than once because the app give up. “We are unable to make this call.” Or “Server Unavailable.”"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Fasiku",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:38:03.000Z",
          "Titre": "The line sometimes doesn't get through"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sisay Kokiso",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T21:41:57.000Z",
          "Titre": "I like the access to get quick but the…",
          "Contenu": "I like the access to get quick but the amount I spend on is just unbelievable..I also see u guys take off /closed the windows of options for example we used to have $2 options but not now .make sure that option should be open"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Divine Grace",
          "Nb_Reviews": 15,
          "Date": "2023-10-09T16:52:14.000Z",
          "Titre": "IT IS VERY UNFAIR HOW BOSS REVOLUTION…",
          "Contenu": "IT IS VERY UNFAIR HOW BOSS REVOLUTION CHARGING YOU WHILE YOUR PHONE HAS NOT BEEN CONNECTED TO THE PERSON YOU ARE CALLING, VERY UNFAIR INDEED."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ola Rotimi",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T14:57:50.000Z",
          "Titre": "Appears Boss was placing the blame on…",
          "Contenu": "Appears Boss was placing the blame on me, until I decided that a refund of my money was wanted. Rather, it was the app that did not come up with the 22% discount on offer on the 16th."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dipo Adepoju",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T13:00:05.000Z",
          "Titre": "Sometimes it ceases and the other times…",
          "Contenu": "Sometimes it ceases and the other times it says the phone number is illegal"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jean Eddy",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T19:16:29.000Z",
          "Titre": "When I buy minutes for my family in…",
          "Contenu": "When I buy minutes for my family in Haiti more than 1 time in day, I never got them. When I call customer service they told me the send it, but it is a lie.I buy last time for $20.00 you got my money, by you never sent the minutes. Please verify 617-549-4015 and 857-308-7555 these 2 numbers buy minutes verify often and some of them never go through."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T16:17:58.000Z",
          "Titre": "Money issue",
          "Contenu": "The fact that you take money authomatically without permission. That is giving you a bad reputation. Becareful about it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alelx",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T16:43:38.000Z",
          "Titre": "I like the sound quality when I speak…",
          "Contenu": "I like the sound quality when I speak to my family outside USA but With out any notification the calling price/minute is extremely increased from 12 cents/minute to 19 cents/minute it doesn’t make sense"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jhonny Gon",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T20:39:47.000Z",
          "Titre": "Every time customers send money should…",
          "Contenu": "Every time customers send money should be able to have like points toward a free fee that’s a downfall not having a free fee"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Peter Nyahoro",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T14:52:22.000Z",
          "Titre": "Interrupted Calls",
          "Contenu": "A lot of times a call is interrupted by music that goes on for a long time, which is included in the charges."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mohammed",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T17:51:56.000Z",
          "Titre": "Rate is too high to many African…",
          "Contenu": "Rate is too high to many African countries which is too bias as I believe to be an exploitation against Africa."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Anei",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T21:55:24.000Z",
          "Titre": "It started cutting off during call and…",
          "Contenu": "It started cutting off during call and it's getting expensive per one minute. It used to be $0.25 per minute but now is something else. A dollar can only gives you 2min instead of 4min."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jawad Rizvi",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T03:10:42.000Z",
          "Titre": "Some times it won’t be connected to…",
          "Contenu": "Some times it won’t be connected to calling number and sometimes contacts to wrong number, but if it’s connected to home you are calling then it’s good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erika",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T13:29:42.000Z",
          "Titre": "The prices have increase so much and…",
          "Contenu": "The prices have increase so much and you can no longer send a recharger under $13 dollars total I want to be able to send a recharge of $5 and no more the same we can reload here in the US."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T01:18:40.000Z",
          "Titre": "some times net work problem ,the same…",
          "Contenu": "some times net work problem ,the same number I call always some time it did not recognize the number ,disconnet etc"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ANGELA",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T15:58:45.000Z",
          "Titre": "Boss is usually reliable, in connecting…",
          "Contenu": "Boss is usually reliable in connecting to the International calls,  which are usually clear in the call quality.  There are however occasions where calls are not connected yet the boss balance is reduced."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 3,
          "Date": "2023-09-16T16:58:01.000Z",
          "Titre": "I've always given 5 stars but this time…",
          "Contenu": "I've always given 5 stars but this time they had a promotion code to use that would not go through."
        },
        {
          "Note": 3,
          "Lieu": "JM",
          "Pseudo": "Leithe Russell",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T22:30:27.000Z",
          "Titre": "I'm good customer and I never get extra…",
          "Contenu": "I'm good customer and I never get extra credit. I think sometimes it's less than my usual amount. You have to treat your customer right"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elkhateeb Adam",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T18:33:30.000Z",
          "Titre": "good choice for the international…",
          "Contenu": "good choice for the international calls. but sometimes calls interrupt  while the talking , in addition to poor quality of calls"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "በውቀት",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T13:35:24.000Z",
          "Titre": "Rate per minute is so expensive for…",
          "Contenu": "Rate per minute is so expensive for those who are calling everyday or extended period of time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Mensah",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:21:25.000Z",
          "Titre": "Too much delays",
          "Contenu": "Too much delays, kindly more inprovement or make faster when you send money to  Ghana..thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dauda Kaze",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T15:27:32.000Z",
          "Titre": "Sometimes my phone number doesn’t…",
          "Contenu": "Sometimes my phone number doesn’t appear on the phone that I am calling, they though I am a scammer and they hanging the phone up on me. You do better please."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adebayo Oyewole",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T20:17:22.000Z",
          "Titre": "Difficulty to connect",
          "Contenu": "Difficulty to connect. One has to dial many times to connect or the app telling you the number dialed is a wrong number!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Selvin Gomez",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T21:08:01.000Z",
          "Titre": "Is good app but with $5 dollars I get…",
          "Contenu": "Is good app but with $5 dollars I get only 30 minutes other’s app like Rebtel provide more minutes for last money I spent thousands of dollars on boss for a lot years and I don’t get any rewards from they yet bring back the 20 dollars unlimited all month for any phone number to Guatemala"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Akinyemi Aluko",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T14:32:14.000Z",
          "Titre": "The rate is a bit high especially…",
          "Contenu": "The rate is a bit high especially calling Nigeria. However, clarity of voice calls is excellent 👍"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dj",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T07:09:35.000Z",
          "Titre": "Some times no good",
          "Contenu": "When I m try to refill it Said that sorry net work problem but it take more money than what I expected"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mohamed Nurhussein",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T02:39:33.000Z",
          "Titre": "You donot keep your promises!!",
          "Contenu": "You donot keep your promises!!! Got nothing for referral.I reffered a friend of mine and enjoing your sevice."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T13:59:01.000Z",
          "Titre": "PRICING",
          "Contenu": "With phone data becoming cheaper and cheaper, i believe $0.34/min is a rip-off. Your pricing is very high."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chukwuemeka  Odika",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T12:22:56.000Z",
          "Titre": "Tariff too high and connection had been…",
          "Contenu": "Tariff too high and connection had been pretty poor recently"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "King",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T14:29:36.000Z",
          "Titre": "Expensive",
          "Contenu": "App crashes, it sometimes displays incorrect numbers on the receiving end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rufus",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T07:39:40.000Z",
          "Titre": "Good app, money transfer made easy. Good customer service experience.",
          "Contenu": "Good app. Money transfer made easy. But your rate from Dollar to Naira need to increase like your other competitors."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abdoulaye Bamba",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:49:24.000Z",
          "Titre": "The convenience made my experience with…",
          "Contenu": "The convenience made my experience with Boss satisfactory. The easy access to the App and making call from anywhere I happen to be . This opportunity that Boss offered to the consumers must be recognized and saluted.Thank you Boss.    A . Bamba"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nwadibia Ezemmuo",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T09:54:25.000Z",
          "Titre": "very easy to use right from your phone",
          "Contenu": "very easy to use right from your phone. No pin numbers or card numbers to enter before placing a call. BUT, But, but very expensive to call Nigeria, 12 cents per minute is too high."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mulugeta Balecha",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T13:40:34.000Z",
          "Titre": "I like the simplicity to call",
          "Contenu": "I like the simplicity to call I don't like: 1. Progressively Increasing call rate 2. In accurate charge for the top up I never gave 3 very annoying commercial's, 4. Some of you staff are not professionals to satisfy the busy customers need  5. I encourage you to diversify your staff"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beatrice Parris",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T18:42:29.000Z",
          "Titre": "Boss is a fast reliant and reliable way…",
          "Contenu": "Boss is a fast reliant and reliable way to call my family and friends overseas, but recently some calls do not go through like before because when I dial the number the system tells me Boss cannot recognize the number am trying to call or Boss tells me that the number which am trying to call is no longer in use but when I try again once or twice the call goes through.  This never used to happen before so I don’t know why now.  In that case I will give Boss Rev a four-star"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amadou Ndiaye",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:11:20.000Z",
          "Titre": "The calling quality and the lines…",
          "Contenu": "The calling quality and the lines accessibility are great. But the calling price to my country, Guinea is too expensive. I am thinking to find right another way to call my country because of the high price have offered me so far. I hope you are going to do something as soon as possible.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hellen Maritim",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:55:13.000Z",
          "Titre": "So far so good slight improvement on…",
          "Contenu": "So far so good slight improvement on the quality and customer care .Sometimes its all about best services . Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Nwoke",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T18:20:32.000Z",
          "Titre": "Boss Revolution has been outstanding…",
          "Contenu": "Boss Revolution has been outstanding for international calls with reasonable rates, although it has gone up some in recent months.  I appreciate your service.  It would be great to see your rates come down some."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margaret Egbueze",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:44:42.000Z",
          "Titre": "It was easy to just load and reload.",
          "Contenu": "It was easy to just load and reload calls account, but not so tryiing to sending money"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Kuol",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T07:07:37.000Z",
          "Titre": "Boss Revolution is a great company it’s helped people  all the world to call their love one and easy to get, and thank you so much",
          "Contenu": "Boss Revolution is a helpful to people , and they can not lose your minutes no , that made them honest, when you want to buy airtime they give you and you don’t want to buy you stay like that and they don’t take anything from you, that made them a great company and great service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Olalekan Akinyokunbo",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T05:12:30.000Z",
          "Titre": "The app has been very good and useful…Boss Revolution Experience",
          "Contenu": "The app has been very good and useful for me ever since and would recommend for anyone who's always on the go like me and makes long distance phone calls.Only downside to it just like what one could encounter in anything is connection issues. You never knew when that would happen that would require you to redial multiple times which could be annoying sometimes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Esther Afolabi",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T08:02:41.000Z",
          "Titre": "You are a good service but sometimes…",
          "Contenu": "You are a good service but sometimes may because of network it difficult to reach out people"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robinson",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T14:36:29.000Z",
          "Titre": "I have used BR for many years now and…",
          "Contenu": "I have used BR for many years now and it's charges are very competitive. I will and have continued to recommend."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Friend",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T06:40:59.000Z",
          "Titre": "I had no issues with my call.",
          "Contenu": "I had no issues with my call, although in previous calls the connection were sometimes not that clear."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nze Mekee",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T09:42:46.000Z",
          "Titre": "Ease of reaching people",
          "Contenu": "Ease of reaching people internationally. The bulk billing frustrates users. It's not right paying 12 cents for extra second if my call ends in, say, 2 minutes 1 second. It's better to bill per second please."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kassim Adam",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T13:36:28.000Z",
          "Titre": "boss revolution is always my favorite…",
          "Contenu": "boss revolution is always my favorite very quality more than others i call ethiopia most of time i would like if you guys increase a minute also starting payment from $2 dollars will be good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ganiat Adebisi",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:04:29.000Z",
          "Titre": "YesYour company doing good about to call…",
          "Contenu": "Your company doing good about to call international,  if u call is going faster for long am using boss revolution and is not disappointe"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Veronica Osei",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:36:14.000Z",
          "Titre": "The great experience is that I’m able…",
          "Contenu": "The great experience is that I’m able to call home easily which  very helpful. Keep up the great job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick Mokaya",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T15:42:10.000Z",
          "Titre": "Compliant: Easy to operate and faster to",
          "Contenu": "I have used it for sometimes now.it’s reliable.Have recommended others to use Boss revolution."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Riana",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T08:40:38.000Z",
          "Titre": "It helps me to reach out to my family…",
          "Contenu": "It helps me to reach out to my family in Nigeria anytime, everyday but it is more expensive in recent past with 12 cents per minute!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jimi Adetula",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T04:56:34.000Z",
          "Titre": "Most times when I call my contacts in…",
          "Contenu": "Most times when I call my contacts in Nigeria, the caller id at the Nigerian end shows all kind of numbers that looks like the call originates from Nigeria rather than from the USA."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yini Guva",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T15:43:12.000Z",
          "Titre": "The service is great",
          "Contenu": "The service is great. There are many channels but all aren't accessible. Most channels such as Aljazeera, CNN, etc. freeze a lot. Could the problems be because of my local connections? There are echoes of a speaker as well. One person talking multiple times at the same time. Weird, isn't it? Overall, the system is affordable and great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julius Nwosu",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T02:18:27.000Z",
          "Titre": "PLEASE WORK ON EFFICIENCY",
          "Contenu": "PLEASE WORK ON EFFICIENCY WITH THE CALLS. IT REPEATEDLY HANGS FOR 2-3 MINUTES BEFORE CALLS ARE MADE"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Augustine",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T16:45:17.000Z",
          "Titre": "You are taking too much money on every…",
          "Contenu": "You are taking too much money on every minute call. Reduce it per minute like the other."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Solomon",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T19:02:58.000Z",
          "Titre": "Everything is fine except BOSS…",
          "Contenu": "Everything is fine except BOSS REVOLUTION SUPPORT forgotten me to BOSS Club promo codes for holidays."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacob Akpan",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T19:57:27.000Z",
          "Titre": "Empathy and timely response to complaints",
          "Contenu": "They listened to my complaints with patience and empathy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erastus Marete",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T04:12:42.000Z",
          "Titre": "Able to reach the deepest parts of the…",
          "Contenu": "Able to reach the deepest parts of the globe where network is a challenge. Very reliable and the end option after others fail."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Esther Oni",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T05:24:08.000Z",
          "Titre": "I like the fact I can call Africa…",
          "Contenu": "I like the fact I can call Africa cheaper but they need to fix the issue of me getting a separate bill from my carrier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Esubalew Adane",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T08:20:47.000Z",
          "Titre": "Every day I charge  but  there is no…",
          "Contenu": "Every day I charge  but  there is no bonus"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anastanciah Mose",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T13:48:43.000Z",
          "Titre": "Making a good call",
          "Contenu": "It gives you a credit to call but sometimes it is down to make call. Overall it is not bad."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Georgina Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T12:43:32.000Z",
          "Titre": "Fees for long distance calls are …",
          "Contenu": "Fees for long distance calls are  reasonable priced. I sent money to my mom to the Dominican republic and is always reliable,  quick and fees are more often than not ti reasonable priced. The app makes everything so much easier.  Gave it a 4 out 5 stars only because I wish they would be more consistent with the fees charge to send money overseas."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-11-21T17:20:37.000Z",
          "Titre": "IThe app os user fruendly",
          "Contenu": "IThe app os user fruendly. It is also affordable for calling overseas. However the updated app is a little more confusing to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julius Uwansc",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T15:19:48.000Z",
          "Titre": "Sometimes your system is clear",
          "Contenu": "Sometimes your system is clear, audibly perfect and at other times it is disappointing. Please stop using the phrase \"switched off\" rather use \"the customer cannot be reached\". 99% of people don't switch off their phones at day times. Generally, your system is working and very good.  94% good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 10,
          "Date": "2023-12-13T14:22:12.000Z",
          "Titre": "Good service",
          "Contenu": "The are reliable and they have good customer service"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Adina Mekonnen",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T07:46:59.000Z",
          "Titre": "It’s very clear but sometimes the air…",
          "Contenu": "It’s very clear but sometimes the air time is short"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victoria Ogunlowo",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T12:27:10.000Z",
          "Titre": "It’s not bad Useful Calling Experience but sometimes",
          "Contenu": "It’s not bad but sometimes, there’s delay in getting a call through across the country.Most times, my number doesn’t appear at the receiving end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Uche Akujieze",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T03:01:28.000Z",
          "Titre": "I can make calls when ever I wish with…",
          "Contenu": "I can make calls when ever I wish with Boss revolution"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abdallah",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T10:34:16.000Z",
          "Titre": "Money transfer experience",
          "Contenu": "Provide exchange rate comparisons, prompt delivery of transfers, internal transfers charged by agent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T06:37:05.000Z",
          "Titre": "Calls go through to all Ghana lines…",
          "Contenu": "Calls go through to all Ghana lines fast. Lines are clear.  Charges are bearableAny problems I encounter are quickly and knowledgable felt with by receptionists quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dr. ADEGBOYEGA/MATIN REMI",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T14:08:08.000Z",
          "Titre": "I have been using BOSS Revolution for…",
          "Contenu": "I have been using BOSS Revolution for so long a time I can remember for my international calls, and It has always been positive experiences"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christiana Ofori",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:10:46.000Z",
          "Titre": "Boss revolution is quick and fast when…",
          "Contenu": "Boss revolution is quick and fast when it comes to foreign calls."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin Brew",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T14:52:32.000Z",
          "Titre": "Ways of skinning a cat",
          "Contenu": "First was good choice when you call and the receiver picks up then clock starts. Now, you call and no answer and your money has shorted"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Boma Afiesimama",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T04:00:35.000Z",
          "Titre": "Calling Experience",
          "Contenu": "Calls are successful most of the time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Grace Amoo",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T06:24:58.000Z",
          "Titre": "Good services"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ahmadou DIALLO",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T16:12:06.000Z",
          "Titre": "Fast when your send money and Hight…",
          "Contenu": "Fast when you send money and Hight rate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T08:09:13.000Z",
          "Titre": "I can't call international call when I…",
          "Contenu": "I can't call international call when I call my relatives"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "P Clarke",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T02:27:37.000Z",
          "Titre": "Boss Revolution User.",
          "Contenu": "I have been using Boss Revolution Card and App for many years. I find it very reliable efficient dependable. However I believe there is much room for development and I appreciate the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vladimir Julien",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T15:28:53.000Z",
          "Titre": "This is your best thing u do to  keep…",
          "Contenu": "This is your best thing u do to  keep me connect to my family only the minutes are too expensive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Salif Goudiaby",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:43:17.000Z",
          "Titre": "I called senegal number they gave me…",
          "Contenu": "I called senegal number they gave me Ghana number"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Crystal Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T03:54:06.000Z",
          "Titre": "I haven't been reaching my dad…",
          "Contenu": "I haven't been reaching my dad voice-mail comes on immediately and I am being charged. Please reimburse me at least 5 dollars at 40 bucks in one day"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ahmadou DIALLO",
          "Nb_Reviews": 5,
          "Date": "2023-09-21T00:08:56.000Z",
          "Titre": "I notice that know your transfert is…",
          "Contenu": "I notice that know your transfert is faste and no more bug in your App. I also notice you're keeping have a high rate ($) and still doing promotions like no fees when sending money. Thanks for your services."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Queen Idemudia",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T14:09:04.000Z",
          "Titre": "It has been a great network since I have been using this international line to get through to my families and friends back in my country, I have not had any problems or disappointments using this inte",
          "Contenu": "It has been a great network since I have been using this international line to get through to my families and friends back in my country, I have not had any problems or disappointments using this international network, so please keep doing the best you can to help us.thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chibuzo Anoruo",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T21:35:32.000Z",
          "Titre": "Great",
          "Contenu": "You guys are reliable, though you're a little bit pricy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonah Nobore",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:25:38.000Z",
          "Titre": "Good  service nice net work"
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:58:51.000Z",
          "Titre": "The communication was clear but if it…",
          "Contenu": "The communication was clear but if it could be cheaper, that'll very great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Manga",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T22:52:07.000Z",
          "Titre": "I want you to provide automatic rewards…",
          "Contenu": "I want you to provide automatic rewards for those, like me, who have online applications on Boss revolution. It must be automatic rewards for us,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Celestine Eguzo",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T17:20:11.000Z",
          "Titre": "Most times the connection is clear and…",
          "Contenu": "Most times the connection is clear and you can hear the person on the other end. The rate is creeping up every time."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Amare Yarit",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T16:51:47.000Z",
          "Titre": "The balance is what you have on the…",
          "Contenu": "The balance is what you have on the place you can share your balance to your friend that good thing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jimmy Sandi",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T15:19:27.000Z",
          "Titre": "It gives me a direct link with people…",
          "Contenu": "It gives me a direct link with people not  on WhatsApp in Africa, and the network is far more effective to connect with those people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customerusagambia",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T06:50:06.000Z",
          "Titre": "overall experience",
          "Contenu": "Easy access and convenient. Sometimes it seems as though boss is having issues with the isp or very poor network"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Kollie",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T17:41:08.000Z",
          "Titre": "Let your customers know how many…",
          "Contenu": "Let your customers know how many minutes left, not just how much amount of money left."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ARUNGWA/VICTOR UGOCHUKWU",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T05:51:27.000Z",
          "Titre": "Good service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:03:17.000Z",
          "Titre": "I can not make vedio call",
          "Contenu": "I can not make vedio call. The rate is also high."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Muhammad Sajjad",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T18:05:24.000Z",
          "Titre": "It’s very good service but little…",
          "Contenu": "It’s very good service but little expensive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Femi Okundero",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T06:01:00.000Z",
          "Titre": "your service, is fast  and ease of use",
          "Contenu": "very reliable, fast and promptly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chizite Dumkwu",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T16:47:16.000Z",
          "Titre": "Its alwagood experienceys good and easy to make calls",
          "Contenu": "Its always good and easy to make calls"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rosa Arias",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T18:54:31.000Z",
          "Titre": "The service is very good",
          "Contenu": "The service is very good, but many times the call drops off in the middle of a conversation and regardless you have balance in your account."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Zemenfes",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T15:06:33.000Z",
          "Titre": "I don't know  but for someone from my …",
          "Contenu": "I don't know  but for someone from my  contact  I could not  call by  boss revolution  otherwise it is nice."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "B Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T13:55:26.000Z",
          "Titre": "I get connected easily to the called…",
          "Contenu": "I get connected easily to the called numbers in Nigeria. There is never a time the call gets dropped before connecting or during actual calls."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Agnes Benjamin",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T11:10:05.000Z",
          "Titre": "Give us more time to dial the number",
          "Contenu": "Give us more time to dial the number. The machine is too quick to say it’s an invalid number.  Then you have to start all over. Other than that, you’re doing great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Isaac Agunbiade",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T16:11:26.000Z",
          "Titre": "I easily connect to other networks and…",
          "Contenu": "I easily connect to other networks and rechargeable without stress"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer Matthew ojeh",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T09:49:21.000Z",
          "Titre": "Easy to use and the connection is OK."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Yash",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T12:36:39.000Z",
          "Titre": "All good",
          "Contenu": "All good. Sometimes very hard too make call"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:57:51.000Z",
          "Titre": "Very good perfomace"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margaret Adekunle-odeleye",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T23:51:33.000Z",
          "Titre": "Best connection home so far.",
          "Contenu": "Best connection home so far.But still expensive.Network connection problems at times"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dereje Solomon",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:28:36.000Z",
          "Titre": "Good service all time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Adeniyi",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T05:27:21.000Z",
          "Titre": "Quick respond on every call."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Marie Lordeus",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T15:06:41.000Z",
          "Titre": "What I don't like from Boss Revolution is that when you make a phone call,even you do not reach the person you are looking for you loose your money. I suggest to you boss Revolution people to solve it",
          "Contenu": "What make my experience to be great is reaching out the person without going out to do the top up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nur sani",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T15:38:59.000Z",
          "Titre": "All  services are excellent",
          "Contenu": "All  services are excellent. However calling fee is high."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Asuquo Essien",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T20:00:19.000Z",
          "Titre": "The representatives I have interacted…",
          "Contenu": "The representatives I have interacted with have been attentive, responsive and knowledgeable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 3,
          "Date": "2023-09-15T16:47:16.000Z",
          "Titre": "The best international phone call!",
          "Contenu": "Love the quality of the calls, after the years I seen your company improvement and the quality and clarity of the calls over sea.I can’t wait to give you 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ramona Santiago",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:21:37.000Z",
          "Titre": "communication",
          "Contenu": "communication, the reception is clear, very goo"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T05:52:34.000Z",
          "Titre": "Very good but the tariff per minute is…",
          "Contenu": "Very good but the tariff per minute is on the high side. No incentive for regular customers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick Igharosa",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T15:20:48.000Z",
          "Titre": "The ease of connecting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Biar",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T02:08:56.000Z",
          "Titre": "It's great calling and the only problem…",
          "Contenu": "It's great calling and the only problem is how expensive it's when I'm calling my family from south Sudan"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abiyu Ewuentu",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T16:20:54.000Z",
          "Titre": "Your price is going up"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gracelyn",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T17:12:26.000Z",
          "Titre": "The instant refill in international…",
          "Contenu": "The instant refill in international calls is great but your rate in money exchange needs to improve."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawrenzo Smiles",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T00:24:20.000Z",
          "Titre": "Boss rev is a very good platform for…",
          "Contenu": "Boss rev is a very good platform for calls and other monetary exchange but needs improvement as per the app needs to recognize and integrated with the siri."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emmanuel Frimpong",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T14:10:05.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great network"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wahome Kinyanjui",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T22:05:36.000Z",
          "Titre": "Fast connections to the receiver."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "StephenQuaye",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T12:29:41.000Z",
          "Titre": "Easy to use and smooth and clearer than…",
          "Contenu": "Easy to use and smooth and clearer than other companies"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mercy",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T13:18:39.000Z",
          "Titre": "Able to call at any time , sometimes it deducted money without me getting through or even talking to my loved ones",
          "Contenu": "I’m happy with the calling sometimes, but when there is a glitch it doesn’t let me talk but takes my money"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T12:30:49.000Z",
          "Titre": "It is very good yes",
          "Contenu": "It is very good, fast, easy and reliable to communicate with our loved ones or friends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lilian",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T14:05:10.000Z",
          "Titre": "It’s ok",
          "Contenu": "Not as great as I expect it to be especially the calling rates are too high but it’s ok."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reuben Okonkwo",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:48:40.000Z",
          "Titre": "Calls are going through most of the…",
          "Contenu": "Calls are going through most of the time and clear."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Titus Jobir",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T15:54:52.000Z",
          "Titre": "Give as boons",
          "Contenu": "You not give as boons because  another company is give boons  your not  even 5 minutes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samuel",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T18:48:15.000Z",
          "Titre": "Your service is relatively reliable and…",
          "Contenu": "Your service is relatively reliable and affordable."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Weldezghi Mana",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T17:31:12.000Z",
          "Titre": "My experience it was great I hope it…",
          "Contenu": "My experience it was great I hope it will be continue. You are working a good job."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Concilia",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T15:15:12.000Z",
          "Titre": "Voices were clear but it takes a long…",
          "Contenu": "Voices were clear but it takes a long time to connect your calls."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Nazmul",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T19:32:12.000Z",
          "Titre": "Rate is still high",
          "Contenu": "Rate is still high. There were rewards such as promotions before, but now I do not see any!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seynabou Counta",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:15:51.000Z",
          "Titre": "So far so good nothing to complain…",
          "Contenu": "So far so good nothing to complain about my experiences with customer service has been great so far each and every time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynda Ogbonnia",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:32:30.000Z",
          "Titre": "Good service :Boss revolution is easy to manage and…",
          "Contenu": "Boss revolution is easy to manage and affordable  too.its my number one anytime,they should give out more promo code especially at this festive period of good service. Keep up the good service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Isaiah Oyeleru",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:55:33.000Z",
          "Titre": "For the fact that you  don't have to…",
          "Contenu": "For the fact that you  don't have to scratched the calling card made it easy also able to see the balance is also great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan E Manchester",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T08:33:07.000Z",
          "Titre": "I make calls to a remote village In…",
          "Contenu": "I make calls to a remote village In Burkina Faso. You all have made it so much easier to get clear communication which is vital when putting in a well or building the Ancestral School.  Thank you Thank you Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Obsinon",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:10:09.000Z",
          "Titre": "Making calls is easy, and the price is comparatively reasonable when compared to similar technologies.",
          "Contenu": "Making calls is simple and the pricing is reasonable compared to similar technologies. However, one downside is that unless you set up auto-recharge while on a call and your balance runs low, it sends a notification. If you add balance at that point, your call drops, requiring you to reconnect to your destination. Ideally, once money is added to the account, I expect the system not to terminate my ongoing call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Gibson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:35:21.000Z",
          "Titre": "This service is effective",
          "Contenu": "This service is effective, fast responsip p no m. ble, thank you for collaborating this year"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T18:29:42.000Z",
          "Titre": "Whenever l place a remittance request",
          "Contenu": "Whenever l place a remittance request, it is executed on time and within thirty minutes l will receive a message that the funds are ready for a pick up at the destination. You doing outstanding service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roseline Meier.",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:21:24.000Z",
          "Titre": "Customer service is number one.",
          "Contenu": "Customer service is number one.. They help me a lot when I was trying to put my card number in. And the line is clear I like this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josephine Gitahi",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T21:45:41.000Z",
          "Titre": "Conversation went so well without…",
          "Contenu": "Conversation went so well without distractions.Audibility was awesome.I like Boss Revolution as I can talk with my relatives as much as possible as the connections are fabulous.Keep up and thanks."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Patrick",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T08:16:08.000Z",
          "Titre": "I've been using bossrevolution.com when…",
          "Contenu": "I've been using bossrevolution.com when I was in US since 2008 and till today there's no regret for my choice by chosen boss revolution. Then the fact that I moved in canada in 2012 till now, all I got as a result is: Great rates, easy to use Fast service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roy",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T01:33:08.000Z",
          "Titre": "Boss app is good but need more discounts",
          "Contenu": "Using it makes very easy to get in touch with my loved ones back home. Its so conveniently usable though sometimes the network might not be good or the connection. Love it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Binyam",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T10:08:23.000Z",
          "Titre": "I have been using BOSS Revolution for…",
          "Contenu": "I have been using BOSS Revolution for long periods of time and love it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T18:33:32.000Z",
          "Titre": "I use Boss Revolution to make my call…",
          "Contenu": "I use Boss Revolution to make my call to Africa, my experience has been great in terms of calling cost and with the easy of topping up. oh! there is also lots of promo with Boss Revolution. for me Boss revolution is the best"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mirelys Salazar",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:02:31.000Z",
          "Titre": "I very thankful with the service and…",
          "Contenu": "I very thankful with the service and not complain at all. Sometimes is because of the internet we lost connection but still working great for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcela",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T22:57:11.000Z",
          "Titre": "All the time when I need help with an…",
          "Contenu": "All the time when I need help with an address change or sending money urgent Boss Revolution is the best way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Abanobi",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:25:04.000Z",
          "Titre": "Honestly",
          "Contenu": "Honestly, I don't have any reasonable things that I can complain about.  I am satisfied with your service  More Grease to your elbow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Folakemi Olagunju",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T23:56:33.000Z",
          "Titre": "Excellent service. Customer-friendly.",
          "Contenu": "Yes, it has been a great experience thus far for money transfers to international calls. Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T18:52:51.000Z",
          "Titre": "Good customer service care anytime I…",
          "Contenu": "Good customer service care anytime I need to speak to someone about anything they help me out so much thanks for being good customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Mambondiumwe",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T16:15:35.000Z",
          "Titre": "Was able to communicate with my friends…",
          "Contenu": "Was able to communicate with my friends and family abroad"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nasse",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T17:30:27.000Z",
          "Titre": "Verry cheap and network quality No #1.",
          "Contenu": "I like boss revolution because of good quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justine Nalumu",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T08:02:22.000Z",
          "Titre": "I always call overseas at a cheaper…",
          "Contenu": "I always call overseas at a cheaper price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victoria",
          "Nb_Reviews": 6,
          "Date": "2023-12-13T21:40:04.000Z",
          "Titre": "I have been using Boss Revolution…",
          "Contenu": "I have been using Boss Revolution calling card now for few years and I never have any issues with the card it is always very clear when I used it to make international calls."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adeola Sanni",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:01:48.000Z",
          "Titre": "Calling Nigeria is easy",
          "Contenu": "Boss Revolution makes calling Nigeria 24/7 easy for me. On a rare case, the network may be bad. But most of the time the network is good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shakir Mashwani",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:23:36.000Z",
          "Titre": "It’s a good company everything is good…",
          "Contenu": "It’s a good company everything is good we can call easily to others countries this is the best one good luck."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Iheonunekwu Arisa",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:56:18.000Z",
          "Titre": "For 5 years now",
          "Contenu": "For 5 years now, I have been using Boss Revolution in sending money, is very reliable, and delivers on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T23:37:55.000Z",
          "Titre": "Cheap and efficient.",
          "Contenu": "The company is doing well in terms of calling rates, clear network and convenient online  money transfer ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr Batetambie Ayukbessem",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T14:19:32.000Z",
          "Titre": "I have never had any issues using Boss…",
          "Contenu": "I have never had any issues using Boss Revolution and they have lower fee as compared to their competitors."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Fabio Arboleda",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T05:57:20.000Z",
          "Titre": "Is easy to used",
          "Contenu": "Is easy to used, easy to charge and clear communication to the countries I use to dial!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Thomas Tito",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T17:42:27.000Z",
          "Titre": "Customer service and care the mos."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bayode Adebayo",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T21:02:18.000Z",
          "Titre": "The rate of call is really great and…",
          "Contenu": "The rate of call is really great and communication with my friends and family is very effective"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "OKWUMO/ISAIAH NWACHUKWU",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T00:08:06.000Z",
          "Titre": "Reliable  service",
          "Contenu": "Connection is prompt and transmission is very clear. Would recommend to any friend."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Mudirat Spencer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T08:30:47.000Z",
          "Titre": "It make it easier for me to call and…",
          "Contenu": "It make it easier for me to call and send money to my family in Nigeria."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nkem Oti",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:44:53.000Z",
          "Titre": "You made my international calls…",
          "Contenu": "You made my international calls possible with ease."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emma Nosa",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T05:27:05.000Z",
          "Titre": "Reliability!",
          "Contenu": "I've been using it for some years now, but haven't had any reasons to regret. Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abu Alhassan",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:33:58.000Z",
          "Titre": "The service is been great though we do…",
          "Contenu": "The service is been great though we do experience technical difficulties once a while otherwise I really enjoy using this app for my mobile money transfer than any other app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manirou Ndao",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:56:52.000Z",
          "Titre": "Bad job",
          "Contenu": "Bad. Honestly these last months you are doing bad job"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wilson Kabwizi",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:54:45.000Z",
          "Titre": "It's best with good rate",
          "Contenu": "It's best with good rate, but the rate need to be adjusted little bit thanks for good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roseline k K jared",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:16:07.000Z",
          "Titre": "Boss revolution is the best means of communcation and sending money to your loved ones",
          "Contenu": "money is received instantly and free, no strings attached."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Silas",
          "Nb_Reviews": 6,
          "Date": "2023-12-14T02:05:52.000Z",
          "Titre": "A reliable app for calling folks back…",
          "Contenu": "A reliable app for calling folks back in Kenya.Excellent app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T17:19:13.000Z",
          "Titre": "There are minor errors you need to…",
          "Contenu": "There are minor errors you need to rectify otherwise you are doing well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tibebu Bele",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T12:05:44.000Z",
          "Titre": "Conveniencey",
          "Contenu": "Cheaper and call quality good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ibrahim Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:35:07.000Z",
          "Titre": "Call is clear",
          "Contenu": "Call is clear, my first choice calling family back home in Kenya.🇰🇪"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Francis Kumawu",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:15:38.000Z",
          "Titre": "Boss revolution has made connecting…",
          "Contenu": "Boss revolution has made connecting with family and friends easier and affordable.Calls are clear and uninterrupted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Comfort Appfullname",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:38:10.000Z",
          "Titre": "Very good service",
          "Contenu": "This service is extremely good I have been using it for years I love it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nkechi Njoku",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T21:53:28.000Z",
          "Titre": "Has been using it for 4 years now and…",
          "Contenu": "Has been using it for 4 years now and I'm satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina Owho",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:40:14.000Z",
          "Titre": "Prompt and clear network services.",
          "Contenu": "Prompt and clear network services.Cost effective."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nader Tadros",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:14:44.000Z",
          "Titre": "Very good",
          "Contenu": "It is very great token clear sound quality very high nice"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Carlos Vargas",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T18:58:05.000Z",
          "Titre": "Communication was clear and easy. Thanks for the service",
          "Contenu": "Easy to call and clear communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mamadou Diouf",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T14:06:58.000Z",
          "Titre": "Your Exchange Rate for Senegal is low…",
          "Contenu": "Your Exchange Rate for Senegal is low compared to TAP TAP"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kwame Yeboah",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T10:25:41.000Z",
          "Titre": "Yes but any  improvements"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edi",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T14:05:28.000Z",
          "Titre": "AWESOME service and speedy service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tariku Zemene",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T15:22:47.000Z",
          "Titre": "The great service and reasonable prices…",
          "Contenu": "The great service and reasonable prices for the most countries."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gandha Sara",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T05:21:53.000Z",
          "Titre": "Excellent",
          "Contenu": "ExcellentI like very much Boss revolution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Buabeng",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T05:05:27.000Z",
          "Titre": "Fast and safe Recipients receive their money fast…",
          "Contenu": "Recipients receive their money fast without any problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oluwayemisi Babatunde",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T12:07:49.000Z",
          "Titre": "Good response to questions and fast…",
          "Contenu": "Good response to questions and fast transfer of money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alimatu Sulemana",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T09:49:29.000Z",
          "Titre": "My experience",
          "Contenu": "My experience was great. Boss is easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pierre Fye",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:24:06.000Z",
          "Titre": "Easy and very convenient"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amal Hassan",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:08:49.000Z",
          "Titre": "No thing",
          "Contenu": "This company connect me with my far family and this time of the war"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tenaw Gebru",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:42:06.000Z",
          "Titre": "The connection and the services are…",
          "Contenu": "The connection and the services are outstanding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sjames",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T04:17:45.000Z",
          "Titre": "Quality connection",
          "Contenu": "Good phone connection almost every time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christiana Fonkwa",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T16:56:57.000Z",
          "Titre": "Your Service is great and trustworthy",
          "Contenu": "Your Service is great and trustworthy.  I am very pleased.  Continue the good job. You are the Best 👌."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bolanle Mogaji",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T03:15:12.000Z",
          "Titre": "Still doing well",
          "Contenu": "Still doing well. Answer questions promptly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mathewos",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T04:39:39.000Z",
          "Titre": "Great services!",
          "Contenu": "Great services!I love it!I have been sharing with my friends and family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abdi Muhumed",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T10:37:46.000Z",
          "Titre": "Am so Happy nice thanks you Boss…",
          "Contenu": "Am so Happy nice thanks you Boss Revolution 🙏"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hardev Singh",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T15:01:45.000Z",
          "Titre": "Awesome service.",
          "Contenu": "Reasonable calling rates and crystal clear calls."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Omowunmi Ariyo doing well",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:04:03.000Z",
          "Titre": "The boss Revolution are the best 👌 i…",
          "Contenu": "The boss Revolution are the best 👌 i recommend the company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Khalid Mahmood",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T18:04:19.000Z",
          "Titre": "My experience Good some time I receive…",
          "Contenu": "My experience Good some time I receive bonus"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kidisti Senere",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:37:44.000Z",
          "Titre": "I am very happy with to use Boss…",
          "Contenu": "I am very happy with to use Boss revolution. It is clear to talk overseas"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Haj Solo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:10:46.000Z",
          "Titre": "Good job",
          "Contenu": "You guys are doing a very good job"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HABIYAMBERE/LEONIDAS",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T18:46:35.000Z",
          "Titre": "You are the best because of your good…",
          "Contenu": "You are the best because of your good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:49:16.000Z",
          "Titre": "It helps me connect with my family back…",
          "Contenu": "It helps me connect with my family back home with a fair price. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawit Okbay",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:44:45.000Z",
          "Titre": "This Good app",
          "Contenu": "This Good app. I apologize if giving us more time is the best"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aissatou",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T01:46:40.000Z",
          "Titre": "The money gets to its destination…",
          "Contenu": "The money gets to its destination faster Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "carole natale",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T17:31:36.000Z",
          "Titre": "great phone connection"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benard Onyaru",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:05:40.000Z",
          "Titre": "Best rates ever",
          "Contenu": "Best rates ever. Reliable and trustworthy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VICTORIA V WHEATLEY",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T17:34:10.000Z",
          "Titre": "Absolutely wonderful,lower rates and…",
          "Contenu": "Absolutely wonderful,lower rates and clear waves!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana Day",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T23:05:25.000Z",
          "Titre": "I wish y'all would bring back the bonus…",
          "Contenu": "I wish y'all would bring back the bonus on when you add money to your card"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Malick Diop",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:00:40.000Z",
          "Titre": "Good and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kebede ergudo",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T17:01:27.000Z",
          "Titre": "It is easy to use. Have clear instruction",
          "Contenu": "It is easy to use. Having strong connection."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adedeji Ogunde",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T23:38:45.000Z",
          "Titre": "Good and excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Owusu",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T16:09:56.000Z",
          "Titre": "You are doing great job keep it up"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CLEMENT OGU",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T04:11:40.000Z",
          "Titre": "Available at all times of the day…",
          "Contenu": "Available at all times of the day though the rate has gone up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delphine Kanla",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:19:43.000Z",
          "Titre": "Great app",
          "Contenu": "Easy to send money to my family and friends"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rita Kimbrough",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T05:11:40.000Z",
          "Titre": "Good",
          "Contenu": "The boss revolution app is good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholes Assah",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T11:19:37.000Z",
          "Titre": "Good exchange rate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T20:39:10.000Z",
          "Titre": "I used every week it is fast and…",
          "Contenu": "I used every week it is fast and perfect phone website"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pierrot Germain",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T22:03:22.000Z",
          "Titre": "The fact you are always consistent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Adebiyi",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T06:41:53.000Z",
          "Titre": "Getting my money on time and the…",
          "Contenu": "Getting my money on time and the exchange is fear enough"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lydia Khamete",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:34:34.000Z",
          "Titre": "Best experience i have ever had."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yudelys R",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T03:49:30.000Z",
          "Titre": "I am satisfied with your service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Muheebat Mojisola Osho",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T01:04:11.000Z",
          "Titre": "Very efficient",
          "Contenu": "Very easy to use for international calls"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Belange",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:16:06.000Z",
          "Titre": "I don’t have any with boss revolution. I have been using boss revolution for for long time, sometimes I shared minutes with my friends. I didn’t have any problem. Thank you for your service!",
          "Contenu": "I don’t have any with boss revolution"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce Njuguna",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T03:31:37.000Z",
          "Titre": "Doing a good job in general."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yared Girir",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:28:47.000Z",
          "Titre": "I love boss revolution!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oscar",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T00:11:39.000Z",
          "Titre": "Easy to use and very economical"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Basem Alqadasi",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T21:51:59.000Z",
          "Titre": "The best app in USA for calling…",
          "Contenu": "The best app in USA for calling international"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benson Mungai",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T20:08:04.000Z",
          "Titre": "Connectivity on the highest level"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonora Masiga",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T20:12:34.000Z",
          "Titre": "Calls are very clear and affordable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tezera Cardiff",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T22:51:16.000Z",
          "Titre": "Fair pricing and quick access."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T05:22:37.000Z",
          "Titre": "The best of the best",
          "Contenu": "The best of the best,  anytime.."
        }
      ]
    }
  ]
}