{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "buddyboss.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryan C.",
          "Nb_Reviews": 5,
          "Date": "2023-11-16T06:51:38.000Z",
          "Titre": "BuddyBoss - A Nightmare Experience I'd Avoid at All Costs!",
          "Contenu": "I had high hopes for BuddyBoss, but my experience with their software and customer service has been a complete nightmare. The software itself was a struggle to use, and I encountered numerous issues trying to get it to work as expected. Doesn't help that it's on WordPress which is equally frustrating. The customer service team was shockingly unprofessional and unhelpful, making the experience even worse.While their website may look fantastic in theory, the actual product and support are far from it. I wouldn't recommend them to anyone. Additionally, their 14-day trial period is confusing, and if you happen to go even a minute past it, good luck getting any of your money back. They hold onto it like hostages and are not even the slightest bit reasonable in trying to help you out. I used the software for only a couple days. Had issues with my understanding of how to cancel which put me a few days beyond what they consider the trial end and stuck paying for an entire years license I can't even use. Beware! I feel these guys are complete garbage."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Rav",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T06:46:15.000Z",
          "Titre": "Do Not Buy Done For You",
          "Contenu": "I purchased the Done For You believing the entire web app was done for you. In fact, they just created the design. No connections, no courses migrated or uploaded, no images, no gamification or quizzes. $2000 for that? You can hire someone on Fiver for a fraction of that price to do that. I asked for a refund within several days after purchasing because they told me they did not do any courses. They had not even started the design, but refused. Then I saw how bad their customer support was through the process which was frightening. It would take days and sometimes almost a week to get a simple response to get the site loaded properly. After seeing that I got scared, what if once the online web app is up and I have any breakdowns how will their customer support respond? Well in fact, if you check here on Trustpilot you can read many reviews of terrible customer support and things breaking for months without a fix. That would severely damage my business so I have taken a $2000 as I will not risk using a product with such terrible customer support."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jon Turvey",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T22:16:12.000Z",
          "Titre": "DoneForYou app service - do not buy!!",
          "Contenu": "I purchased the DoneForYou app product in April 2023 and had a positive experience to start with, the creating and working with the team was good. Ever since the deployment of the app everything has gone down hill. The mobile app has repeatedly crashed and not functioning properly. I have support tickets going back months now and no solution has been reached. My current supper ticket trying to resolve this is nearly 3 months and I have been repeatedly ignored when I have asked to discuss a refund. No clear solution and repeated negative reviews/emails from my customers regarding my platform all due to a failing buddyboss app. I have been really disappointed especially given the positive reviews I see others write. My experience with specifically the DoneForYou app service has been appalling and I do not recommend. As a part of this review I have provided my order email which only BuddyBoss can see as proof of my purchase. I am ~£2000 out of pocket and continuing to apologise to my customers. Do not recommend."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Aaron",
          "Nb_Reviews": 10,
          "Date": "2023-09-21T13:04:33.000Z",
          "Titre": "After Five (5) Looooong Months",
          "Contenu": "After 5 loooong months of fighting my case (it's your issue not us kind of case), BuddyBoss was able to replicate the issue I was facing and found out that the issue was with their side after all.You really need to have the \"skills\" to deal with BuddyBoss Support, because if you give up, you will not get your issue resolved and they will just close your ticket as resolved even if it's not.When I say skills, it's like pre-handling objections in sales. You need to have the skills to pre-handle excuses and gaslighting from BuddyBoss support.PS: While fighting for my case, I wasn't able to use my app fully and I am PAYING during those months. So if you want to save your money - run far away from BuddyBoss."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Onur Kahraman",
          "Nb_Reviews": 3,
          "Date": "2023-08-17T14:44:24.000Z",
          "Titre": "SCAMMER !! DONT BUY PLATFORM FROM BUDDYBOSS",
          "Contenu": "I bought a lifetime license and order #265397. BuddyBoss is very difficult to use and not as described. I requested a refund but I canceled my BuddyBoss License Key. so they didn't have to refund my money back.I told them that I want to cancel my lifetime license. They sent me copy-pasting and posting the same silly answers over and over. The bank I reported the fraud you have committed. I want nothing but a refund. cancel the license and refund my money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 6,
          "Date": "2023-04-13T02:24:06.000Z",
          "Titre": "We tested BuddyBoss but didn't find it…",
          "Contenu": "We tested BuddyBoss but didn't find it to fit our needs.  They auto-renewed us and when we asked for a refund (after we filed a dispute with PayPal), they refused to refund until we cancel our dispute (which leaves us with zero protection).They \"claim\" a 14-day no questions-asked guarantee, where is it?  All I'm getting is questions and requests to remove their liability."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "CMB professional events",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T15:44:25.000Z",
          "Titre": "app doesn't work as advertised and…",
          "Contenu": "app doesn't work as advertised and crashes under load, support is completely useless with the default answer to install the buddy boss platform and app plugin, which we have done. They still reply with the same answer. All the issues are never with the actual app but apparently our hosting provider. We wont be renewing our five app plan. Simple!"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Maria Wadsworth",
          "Nb_Reviews": 9,
          "Date": "2022-12-19T21:39:55.000Z",
          "Titre": "Buggy platform was new and not working but they started starting us anyhow and refused to credit us for the launch delay",
          "Contenu": "Paid to get started before the platform was ready, when is was there were lots of bugs but they started charging us the monthly fee. Paid over $1000 and the help desk NEVER sorted out our app and got it working and refuses to credit us for the months they charged but the app was not ready. Basically ended up paying 3 months for their development and lost income. Ended up going with passion dan. Buddyboss could have recovered the sale and got 3 more of our businesses on board but chose the costly way - not looking after customers who in good faith tried signed up BEFORE the site was ready."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Caitlin M.",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T08:50:45.000Z",
          "Titre": "Nightmare Experience with Buddy Boss! STAY AWAY!",
          "Contenu": "I had high hopes for Buddy Boss, having seen their impressive website, but my experience with their platform and customer service has left me deeply disappointed. In short, I strongly advise against engaging with this company from my experience\"Don't TRUST THEM, THEY WILL TAKE YOUR MONEY AND GIVE YOU TRASH THAT DOESN'T WORK.\" This statement resonates with my experience as well. The LearnDash and Buddy Boss system, while promising on the surface, turned out to be a nightmarish ordeal when it came to backend functionality. During our trial period, I found the process of cancellation confusing, and the company consistently adhered to policies that prevented them from issuing a refund, even when the product was clearly not working for us. By the time we figured out how to cancel with them directly which was just slightly outside of their 14 days window they absolutely refused to issue any refund even though we had shown proof of deletion and no use for it moving forward.In hindsight, I deeply regret not heeding the warnings from numerous negative reviews. My advice is clear: \"STAY AWAY\" from Buddy Boss, unless you want to risk being thoroughly disappointed and frustrated by their products and horrible customer support. Don't get duped like I did; it's best to explore alternatives with better track records and more reliable customer service.Take it or leave it but this experience left us from highly albeit blindly recommending them to others because their site looked beautiful to being complete absolutely appalled by the product and will never use or recommend it again."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "pardha saradhi attuluri",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T19:39:08.000Z",
          "Titre": "the product is stagnant. I would not reccomond for any new costomers",
          "Contenu": "the product is stagnant since the beginning of 2021in comparison to the previous year. each item in the road map is taking ~1.5 years of delay before getting implemented. it seems the company moved all it's resources to app development and custom development. I used to like the product but no more. There were times customers used to say \"you guys are seems to not taking any rest. please do not burn yourself\". It is not that company anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katherine Schneider",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T00:02:19.000Z",
          "Titre": "Don’t walk… Run!",
          "Contenu": "Paid for the done for you app service, it was not done for me, the amount of work I had to do was insane. My app never got launched and customer service sent me around in loops for months while charging me a monthly fee for an app that never went live, eventually I gave up. Wasted over 5k for nothing!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "HR Whiz",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T15:26:56.000Z",
          "Titre": "Horrible experience with buddy boss App",
          "Contenu": "Horrible experience with customer support, they will never solve any questions. For everything, they tell its custom development. The app is a sham,horribly slow and buggy. Very sub standard service, never have seen anyone so bad. Now they have all fake reviews. You should look at all the tickets, and see how bad your service is. Any good business will shut down after buying your service."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Taner",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T17:59:53.000Z",
          "Titre": "My worst investment",
          "Contenu": "This company seems to be spending their sales revenue for SEO and PR using the reputation of the plugin which they are a fork of. Once you need to dive deep into the platform you will recognize that there are not enough documentation and each support request will end up with a paid service while you can do the same thing with a few hacks on free plugins. I'm not sure if they are selling a free plugin developed in years by changing its name or just the theme, since it is not clearly explained. If you are a beginner without any wordpress experience, happy with what you see with this theme! and willing to pay for extras go for it. For me it has been the worst investment in my wordpress journey last ten years."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mohammed Alex",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T00:21:46.000Z",
          "Titre": "After quick money",
          "Contenu": "Terribly disapointing, quick to charge but delivery is slowwwwwww ... and the are not sorry about it and the refund is even slower and happen only if you decide to sue.Nobody knows where they are located, they puff a lot about the size of their ... team ... and all this ended up like it started a solution we dont use anymore because of stagnation of BB team."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phocian Ramsey iv",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T15:53:57.000Z",
          "Titre": "We paid for a phone app with buddy…",
          "Contenu": "We paid for a phone app with buddy boss, it took them 5 month to get working then google took us off apple worked for 5 months but they want to rip you off for another $2100 it was the worst mistake that AmericanCivilDebate ever made . Now they turned off our social media platform because they are blackmailing us for money. You pay for what you get . Pay a cheap company and get cheap results. As buddy boss says the license expired but they left out social media platform work now they turned it off. It’s better to hire an American company to do your phone app. It’s more expensive but well worth the price. I have wasted too much time on a horrible company. Buyer be where."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger Blankenship",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T22:17:56.000Z",
          "Titre": "I just don't like being deceived",
          "Contenu": "I just don't like being deceived. I already have a theme for my membership site that I like and do not want to change. Only after I installed the BuddyBoss plugin, watched 40 or so of the training videos and then began to work with it did I realize it not only looks terrible without the BuddyBoss theme, you can't fix it. CSS Hero does a great job normally, but it can't help BuddyBoss. They have deliberately made it look awful so you will buy the theme. They wasted my time. Perhaps after you read this they won't waste yours."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Gaurav Garg",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T22:08:00.000Z",
          "Titre": "Very poor customer service",
          "Contenu": "Very poor customer service. We would have asked for 20 odd features, and none of them were available. When we contacted support for guidance on how can our WordPress developers find a workaround for them - we were told to hire their agency developers. This ain't fair. I have already purchased 10x Lifetime Licences and 5x MobileApp Licences, and even then I don't have a customer success team/manager to directly support. The MobileApp has some major product bug and for last 8 days, nothing is moving ahead. When we ask for timelines - we are told that BuddyBoss doesn't provide any SLA.The top management at App is only busy marketing and are not available for any chat. This is'nt going to take the company anywhere good."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joy Akwarandu",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T23:40:21.000Z",
          "Titre": "This plugin broke my website",
          "Contenu": "This plugin broke my website! The customer support team was supposed to fix the plugin, but instead, broke my website completely! They don't know what they are doing. Using this plugin completely frustrated me to no end, and it ended up not working; and not to think of the fact that a paid so much money thinking i was getting some premium plugin. I mush cheaper theme used with memberpress has provided me everything I need."
        },
        {
          "Note": 1,
          "Lieu": "ID",
          "Pseudo": "Jenny Hansen",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T02:51:06.000Z",
          "Titre": "Horrible customer support - 35 days+ waiting times",
          "Contenu": "Horrible customer support 😅😂 Its been 40 days now and NO one has resolved our ticket. This is HORRIBLE. Our whole team literally wants us to switch away from buddyboss because of the  bad customer support. Here are 3 tips for you guys: 1. Resolution time shouldnt be more that 2 weeks ever days (2-3 days max might be acceptable)2. The response time isnt up to speed sometimes I am waiting 2-3 days for someone replying running a business this type of unreliable support just doesn't cut it. 3. I am not getting time frames on when problems are being handled ! Its minimum standard to give a timeframe and updates when handling client's problems.PS: For example Kinsta support is phenominal 😎 Or salesmate support! Definitely recommend to check how they do it. Resolution time 1 hour, response time a few minutes."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jamila Wing Chung",
          "Nb_Reviews": 8,
          "Date": "2022-03-10T15:43:27.000Z",
          "Titre": "BB- issues - waiting for Graham to respond",
          "Contenu": "Im writing this - as I missed the response deadline from Graham and its only fair to give BB the opportunity to address the issues raised B4.Lets how Buddyboss team  UK work.Dear Graham. my ticket/compliant number is 162796"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Kevin",
          "Nb_Reviews": 22,
          "Date": "2022-10-23T22:50:58.000Z",
          "Titre": "FLEE from this masquerade... They are not up to it!",
          "Contenu": "This company claims to be a social network, but it's not at all... We've been waiting for months for basic social network features (reaction, poll, hashtag, etc.)They are so slow to release new products while they are still a team of more than 150 people working in this company.Not to mention their main competitors on Wordpress starting with the letters PEE**** with a number of collaborators much lower than theirs, they do better and above all they really listen to their client.Buddyboss claims to be a social community but must have its own group on Facebook so that these customers can express themselves while the competition welcomes their customers and future customers on their own solution 😅😅In short, all that to say FLEE from this masquerade... They are not up to it!PS: oh yes they had to make a last video to present their new feature, hang on you it's heavy \"We can now report a user account\" WOW fantastic 😂😂"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Aaron",
          "Nb_Reviews": 10,
          "Date": "2023-06-20T13:16:18.000Z",
          "Titre": "RUN! How BuddyBoss Mislead/Bait People So They Can Grab Your Money",
          "Contenu": "1. So you are excited about building your own app. 2. You have seen features that you want for your app. 3. And just to make sure before committing your effort and money, you read BuddyBoss articles and your impression is that the feature you want actually exists. That once you commit, you will get what you expect.For example: If you look at Gamipress and BuddyBoss app integration articles, your IMPRESSION would be: They are working well together and you will get that Gamipress+BuddyBoss App experience.Why? Because it's how the articles are written. They don't put disclaimers that it's NOT ACTUALLY WORKING well on the BuddyBoss App and BuddyBoss will admit that behind closed doors AFTER YOU PAID, instead of admitting that BEFORE YOU PAY.So now you spent money for the BuddyBoss App and Gamipress License without actually getting what you want to achieve.BuddyBoss will entice you and you will fall for it, but their service is actually the opposite of enticing. And this is evident in the BuddyBoss Facebook Group (both official and unofficial), you will see 90% frustrated users. They even kicked out someone that expresses frustration towards their service.Be careful! Hope this helps."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Maria Wadsworth",
          "Nb_Reviews": 9,
          "Date": "2023-06-05T01:29:03.000Z",
          "Titre": "Absolutely terrible app & service. Intentially stalled on refund so they could say too late and did not fix the issues as promised.",
          "Contenu": "Absolutely terrible product and service/support - took our money and ran. App launch was delayed (we were one of the first to sign up). There were many bugs which they would not resolve and all they would say is the next update will fix it. This was a tactic to avoid actioning our request for a refund. They charged us a monthly fee for a service that was not ready and would not function, and no resolution despite bugs. We had asked for a refund earlier as the delays had already gone on too long, they stalled on giving as a refund as per their promise - then refused it saying it was past the refund date. They asked for a chance to fix it so they could say no refund even though we had asked for it within the appropriate time frame. Really dishonest money grabbing company. I've been in the online business for 20 years, and this was intentional so I am gong out of my way to warn others. Don't go near Buddyboss software!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Tulia",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T00:06:44.000Z",
          "Titre": "24/7 Customer Support is False",
          "Contenu": "24/7 Customer Support is False.  I've literally been waiting a month for a simple yes or no answer.  I have been trying to insert a simple line of code from google admob so that I can monetize my app.  It took a month for them to finally come up with an answer instead of just saying yes or no.  Then the solution was for me to pay an additionally $100+/month for developer access when all I need to do is add the line of code in the files Google requires.  There is no purpose for most businesses to have an app that does not have the ability to carry ads.  Why they wouldn't have this feature is beyond me, then to make people pay an additional fee when the solution they provide is a \"workaround\" that they're not even sure if it will work or not.  Good idea. Nice effort but buddyboss overall has not been worth it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steve E",
          "Nb_Reviews": 8,
          "Date": "2022-09-09T03:26:38.000Z",
          "Titre": "BuddyBoss has almost bankrupt me",
          "Contenu": "BuddyBoss has almost bankrupt me.  Having run my site for seven years now with sales growing year on year, I now face the very real reality that I will have to file for bankruptcy due to the very poor management of this company. Don't be fooled by the glossy presentation and the chirpy videos. The reality is the product is badly coded, regularly breaks when fixing one module it screws up another, they are more interested in their app than their core web product and support is almost non existent with virtually all tickets having to be forwarded to their development team. A team of one.  Even if I do get all the outstanding issues resolved by the end of tomorrow I fear its too little too late and I will not only lose my business but my home too. Do not work with this company you will waste your money."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Info de la Fabrica",
          "Nb_Reviews": 13,
          "Date": "2022-04-18T06:02:47.000Z",
          "Titre": "It is a SCAM:The get my money and…",
          "Contenu": "It is a SCAM:The get my money and RUN!!!This people never answer support, part of their refund policy says 21 days and some 14, so after waiting 15 days for a support reply i ask for my 21 days money-back warranty. And they say \"sorry for no reply to you for 15 days, but we have a strict refund policy\".The plugin also offer features who depend on third-party plugins who broke my site, their knowledge base refer to those plugins and even do, they don't refund. This is a SCAM and everyone should know this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott K Wilder",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T07:37:13.000Z",
          "Titre": "BuddyBoss isn't the boss",
          "Contenu": "I have tried to set up BuddyBoss for the past few days for a friends website. It is difficult to understand how this product sells. Their support is subpar --- while they are responsive, they really don't solve anything and blame a lot of the issues on WordPress. All their support is via email; they could learn a lot from WordPress' own support which is amazing. The Chat team deserves a medal. Secondly, BuddyBoss has not analytics for their Community. They outsource to a third party, but a) that product isn't compatible and b) when you open up a ticket with them, they say they will not support any of their plug-ins. Thirdly, BuddyBoss lists several plug-ins they integrate with on their site, but few of them actually work. The only good thing I have seen about BuddyBoss so far are the instructional videos. I am looking for other options to build a Community on WP platform."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Alisa M.",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T19:26:53.000Z",
          "Titre": "Maybe a ok platform depending what you…",
          "Contenu": "Maybe a ok platform depending what you are doing but the app is very limited not to mention you try to get a refund and they give you a run around for over a week so now I have to take it up with my credit card company the first customer service rep \"denied\" me a refund saying I wasn't within 21 days, well its based on the \"time you got access\" he then realized he was wrong then I got a whole email to try to keep me to stay when they didn't understand what I was doing even though I asked their team at the very beginning for answer which again they couldn't give.Just really bad support and makes you wonder. Their app is also super expensive per month. Taking my business elsewhere. 6 days still no refund. Now going to my credit card. Pathetic support they should be ashamed."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "sd",
          "Nb_Reviews": 2,
          "Date": "2022-07-23T20:48:17.000Z",
          "Titre": "so far its been a waste of alot of time and hope that changes",
          "Contenu": "I bought this product two weeks ago. Since then there has been an ongoing problem with programming. And it seems questions although they keep saying are escalated to higher support .. nothing in response. I can see better reviews on here so i hope there is a turn around.Its definately not been a product as advertised and the support has definately lacked. the theme appears to be full of bugs compared to anything i have used before. I have had a lot of emails trying to sell me more and nothing to match the product i already paid for."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "TheMoonCarl",
          "Nb_Reviews": 3,
          "Date": "2022-02-16T04:00:50.000Z",
          "Titre": "Support sucks, App is still in beta, updates are always late",
          "Contenu": "So much of their information online is outdated. They claim updates will be release each quarter, but they're always delayed. Do you have your own suggestions? Don't waste a breath because they'll never respond to any suggestions that you write on the roadmap. They're too preoccupied fixing their buggy app which is still in BETA! It's not ready for public release. Anyone who has purchased the BB App so far is being conned. The product is not ready for public use.If you have problems and need support, here's the answer: \"please reinstall the plugin\" - or \"sorry, that requires custom development\"... total bs! Their support is a total con and they don't even know their own products! That's because their support is uneducated folk from \"cheaper\" countries. When you talk to the big-dogs who run the company, they are nice and helpful... but their generic support blows.Don't buy the app, and don't expect useful assistance beyond \"reinstall the plugin\". They also delete negative comments and reviews from their social platforms which makes them look perfect. It's obvious why they don't showcase something like Trustpilot because the reviews here are REAL and cannot be filtered in their favour."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Luke Martinez",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T01:00:26.000Z",
          "Titre": "$3000 Stolen",
          "Contenu": "We were double charged when using Buddyboss for a client for the app ($3,000 x 2!).Once this was discovered they refused to refund the double charge and cut communications.Very questionable behavior, BEWARE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle Carvalho",
          "Nb_Reviews": 18,
          "Date": "2023-01-14T20:26:26.000Z",
          "Titre": "Buddy Boss Product is BUGGY",
          "Contenu": "I've been going through the poor support and buggy Buddy Boss / Pro - theme products for 5 miserable years. It gets to a point where a creator doesn't know if learn dash or BB is responsible for sites crashing and pages breaking after their updates, which usually come in around the same time. I've never worked with such bad plugins. I understand things can happen but the lack of consistent and reliable interest and effort for helping their clients solve these issues is maddening. Right now they claim to have a new 3.0 Theme, yet on their site in my account I only see a 1.0 Child theme and a 2.2.4 Theme for download. These 2 pieces of software are conflicting causing my page to break, issue with php folders and more. Going on 4 days of messages stating \"we have escalated your case to so and so.\" I cannot wait until a developer comes out with a better learning / course delivering product so I can end this relationship. There are too many bugs to list in this review / vent. Beware and do not put your hopes in Buddy Boss. Something will always go wrong and it's so hard to get help. My site's main member area page has been reading \"critical error' for one whole week after updating the plugin in wordpress. I hired 2 different people from Fiverr and neither could locate nor solve the issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hate Buddyboss",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T15:45:34.000Z",
          "Titre": "BuddyBoss is such trash",
          "Contenu": "BuddyBoss is such trash! Trash company, trash customer service, and built to steal your money!Don't TRUST THEM, THEY WILL TAKE YOUR MONEY AND GIVE YOU TRASH THAT DOESN'T WORKThey got me for $3300!"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Liewilyn Baynosa",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T20:00:34.000Z",
          "Titre": "Very poor customer support",
          "Contenu": "I never had any good answer from them its always them saying that what I'm facing is a customization that needs additional cost. Sometimes it feels like the product itself was made so their development team will have income with \"CUSTOMIZATIONS\".What pushed me to the edge is my last issue regarding the repeatable fields that I need to output in the front end as an array. I asked customer support for guidance but they are saying that it falls under customization. I even mentioned that their code is messed up in the user extended profile field, all the entries under repeatable fields are written inside a single field. I can write simple PHP code so what I really need on that is guidance and direction regarding specific hooks and actions I can use but their support team is really no use at all... Very bad experience..."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Ditlev Kjeldsen",
          "Nb_Reviews": 2,
          "Date": "2022-10-25T09:02:58.000Z",
          "Titre": "A year with support... without fix",
          "Contenu": "Hi BuddyBoss I hate to do this but i think that this is the only way to get your attention regardless of my issue with my BuddyBoss App that breaks down every month and sometimes inbetween weeks! I have talked with your support team and developer team MANY times, and we have come no further for 12 MONTHS! you keep saying that the developer team is working on the issue... BUT 12 MONTHS? How? The app keeps crashing and says that 'the app is not available' so you have to delete the app and download it agian. I have paid memberships on the app, so my customers is gettin pissed when they can't asses something that they have paid for, so I am forced to get my buisness on hold until this problem gets solved. I am running low on resources to get this running further, since I have alot of different expenses in connection with my buisness that is now on hold.I hope you see my messages and takes care of this issue as soon as possible.And let this message be an warning for other people that is considering to buy your product.I wish all the best of luck for everyone who is trying to build a buisness and I hope you dont get stuck in a problem like mine..."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Aaron",
          "Nb_Reviews": 10,
          "Date": "2023-07-06T13:10:54.000Z",
          "Titre": "Deceptive Marketing",
          "Contenu": "Are you hooked on BuddyBoss marketing about the gamification of a community? That's BuddyBoss + GamiPress integration.Here's the thing. They will never be upfront that GamiPress and BuddyBoss are not really well integrated (it's only marketing hype). But...You have already paid the license - based on the assumption that it's working (but it's not). That's how they market. 1. They bait you in2. Spend hundreds of dollars (because the marketing looks great)3. And you are left using a problematic softwareNow you ask for support due to issues.1. They will make you wait for days or months (while you are paying).2. They will make it look like only you have this issue.3. They will discover it is their issue (not yours).4. If they can't fix it, they will find anything else to blame.So why market it as if it's working, if it's not really working? Money Grab. Of course, how can they sell if they say upfront that the integration is not fully working? That will invite doubt and won't get your money.Be careful about these deceptive practices. PS: 1. They might say there's a trial period, but look at this: The trial period is 14 days, and support takes months. How can you be within the trial period if support takes months? Be careful. They are really good at grabbing your money without accountability. It's you who will lose in the end. 2. They might reply to this review saying they have upgraded their support system, etc. That's only a facade. They upgraded the \"Looks\", but not the process."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "You Know Who",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T01:07:19.000Z",
          "Titre": "I would give them a big fat Zero if I could",
          "Contenu": "I don't normally leave reviews because my time is precious. But after several attempts at communicating with Buddyboss support and seeing the same crappy service being provided, it is time.Beware, you are not paying for any \"support\". The only communication you will receive from them is \"this cannot be fixed\". The only reason they say this is because they want everyone to pay for their \"custom\" development services.I can't imagine why anyone would want to pay any more for their rubbish service after paying hundreds for their theme and plugin.My last support ticket was with a \"Wasiur\" who after 3 weeks, informed us that a Buddyboss setting doesn't do what it is supposed to do. When he was asked for the CSS code to hide a particular button (which the Buddyboss setting is meant to do), he claimed \"there is no CSS code\" that does that.Surprise, surprise Wasiur, any Wordpress developer will tell you that is utter BS and we have actually managed to hide the button with CSS code. So much for \"support\".Avoid this business at all costs unless you can afford your own developer and do not under any circumstance pay extra for any of their services unless you enjoy banging your head against a wall.Theirs is the worst service provided by any Wordpress plugin developer."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T01:03:57.000Z",
          "Titre": "Platform and app full of bugs",
          "Contenu": "They have a platform and mobile app with a lot of potential but unfortunately instead of focussing on minimal quality, making sure most of it works correctly and especially having a decent support team, they prefer to focus 90% of their efforts on marketing and selling as much as possible of those unfinished beta products as a fully tested version with a very unexperienced support team.Don't be fooled by their expert marketing and the beautiful screenshots of the apps on their website. It all looks beautiful but is very buggy (both platform and app). Even without any custom coding. Definitely check the reviews here on Trustpilot before you buy...We are a client already for 2 years so we know what we are talking about and it will cost us a lot of money to migrate everything to another service but unfortunately we don't have another choice. We get too many complaints about the platform and the app from our clients. Working with Buddyboss has caused us a tremendous amount of frustration, lost time and income.The end result: a platform and a mobile app full of bugs and a hardly trained, way too small technical support team (with freelancers working somewhere remote in a cheap country) that has hardly any experience, works super slow and super inefficient. They probably get rewarded based on the amount of tickets they reply to instead of the quality or resolution of an issue.It's clear that they prefer fast money over quality and long term success.A pity..."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Aaron",
          "Nb_Reviews": 10,
          "Date": "2023-06-15T00:13:27.000Z",
          "Titre": "Unusable App for $250/month",
          "Contenu": "If you want to pay $250 per month for a problematic, unstable, and unusable app, use BuddyBoss."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Aaron",
          "Nb_Reviews": 10,
          "Date": "2023-05-06T19:43:13.000Z",
          "Titre": "This service is a SCAM",
          "Contenu": "1. You will pay hundreds of dollars for a service full of bugs.2. You will receive support responses for weeks or months (not days) while paying hundreds of dollars - THIS IS NOT A JOKE. PS. Do not believe their \"improvement\" for support changes.3. Their technique is to act dumb and ask for more info from you so they can delay actually fixing your issue. I say act dumb because they have TECH supports and they expect you to be smarter than the TECHS. For every reply, it will take an average of 5 days to get another response. So they act dumb to delay fixing your issue.4. You will be forced to update your plugins but will have more website issues after updating. Try joining their Facebook Group and all you can see are issues but they will delete negative posts.5. If they cannot solve your issue, they will tell you they are looking into it even if it's been already months WHILE YOU ARE PAYING HUNDREDS of dollars.6. If you have Mobile App issues, they will tell you it's your issue and not BuddyBoss, then later on find out the issue is with BuddyBoss - but their strategy is to make it look like the issue is unique to you only.7. If you post issues in the Facebook Group, they delete the post to hide their scam.8. Remember paying hundreds of dollars? If you tell that to the Facebook Group, their response is \"Other BuddyBoss users are earning using our platform\". That's how they dismiss your issues. Others are earning using their platform so don't complain about paying them for a lousy support and service full of bugs.If you don't believe any of this. Try BuddyBoss and leave a review here later to prove how horrible they are and warn other potential users."
        },
        {
          "Note": 1,
          "Lieu": "UY",
          "Pseudo": "Gonzalo Arce",
          "Nb_Reviews": 3,
          "Date": "2022-07-07T15:19:19.000Z",
          "Titre": "Incompetent technical support",
          "Contenu": "I feel cheated and insulted by the buddyboss, really his capabilities are extremely limited and border on stupid… 2 weeks trying to get them to understand that One Signal push notifications DO NOT WORK…. Surely no one here has achieved that when a user sends you a private message, a “push” notification from OneSignal is produced….The arguments of the technical support team are an insult to my intelligence, it seems like a team of clowns… first they argue that the iPhone does not work, WHEN I NEVER TALK ABOUT iPhone…. I just want it to work on Android and chrome, I asked them to show me that they can cause a successful push notification and they haven't shown it, this is a total lack of respect, waste of time and an insult to people's intelligence, they launch an immature, incomplete product that DOES NOT WORK… and they also have a bunch of clowns as a technical team….The support guy, who surely has some kind of intellectual deficiency, tells me that everything works \"fine\" by sending me a screenshot of the push request, but not of a push notification as such... (they are clowns) SCAMMERSUpdate 7/7/2022 When you complain strongly, they also threaten you with legal action, they also cancel your license, making you lose months of work... This company is not only inefficient, but also HOSTIL with its customers. You may notice this in your customer service manager's response.Really disappointing."
        },
        {
          "Note": 1,
          "Lieu": "ID",
          "Pseudo": "JMR",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T04:20:54.000Z",
          "Titre": "Horrible service and website user interface.",
          "Contenu": "Horrible service and website interface.Reading the other reviews I seriously start to wonder if these 5 star are real, i mean video support, instant answers ??? Just make an account and you can see this can not be possibly true as their chat is never online, and a replay takes longer then 24 hrs and if you are in bad luck you get a very small answer and have to wait with your follow up question at least longer then 24 hrs. Super in-efficient anyone telling otherwise is either lying or just shows more how ineffective their customer service is.In the first instance you seem to be able only to buy budy boss theme but after paying you can see that there are additional products which are hard to find from the home page. These are the stripped down version of the buddybos theme and also cheaper. This is basically where their scheme starts. Support is nihil and not 24.7 or even close to priority. The chat is not active, ever! Be aware of this.Then the whole interface is just confusing, where it is poorely explained what you exactly buying.WE bought a lifetime set up spend around 500+dollars... could not find anything in downloads. We thought it was our own mistake or something as we didnt get it we try to disconnect it from the website and start all over again.Disconnection is not disconnecting it is actually stopping your subscription. But when you buy lifetime you would think you can re-activate it.Wrong they expect you to pay again for a lifetime that was already paid as lifetime.No support available no solution provide. We got one answer that clear did read anything about our problem and asked a random question.We got no where yet. Truly dissapointed for such expensive product. I had first class assistence for 25 USD subscription this company should be ashamed of themselves in stead of hiding behind a huge FAQ. Fact they got a huge FAQ already shows they did not figure out how to make a efficient website as their priority is to collect first and ask questions later."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Luc",
          "Nb_Reviews": 3,
          "Date": "2023-04-08T16:48:52.000Z",
          "Titre": "So many bugs... Support worth not much...",
          "Contenu": "I don't quickly write a review about a company but I feel like I have to do this to warn other entrepreneurs.We feel scammed by this company. We must admin that their website looks great and when you check their demos it all looks very promising. We were fooled to buy a liftetime license for the platform and pay a few thousand EUR for the app...Turns out both the platform and the app are FULL of bugs, often crash and their support is 1 of the worst we have ever experienced...And even worse: they don't even seem to care. The only thing that interests them is sales.Ok, they give a money back guarantee but it's impossible to test everything during that time...Be also very careful with updates! Often you are desperately waiting for an update in the hopes a few bugs will be fixed but be very careful! Those updates can ruin so many things on your site or app... If you don't have decent backups, you can lose so many valuable data.And no, we don't use any custom code at all...Their customer support isn't much better. Unfortunately you can't search for similar issues on a forum or a knowledge base. You really need to get in contact with them via ticket (or since recently also chat but that's even worse). First you lose 1 week replying to a first line agent who literally doesn't have any clue at all what he/she is talking about, then they transfer it to a real support agent, those most of the time don't have any clue either, then it goes to senior support but then you are almost 1 month further and the quality of service you get from them isn't much better either...Their platform and app looks nice but what does all that matter if it's full of bugs and you have customers complaining about it all the time?The 4000 EUR we paid them is wasted and the real total cost for our company is probably around 100.000 EUR...Be careful with this company..."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "Abe",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T17:24:26.000Z",
          "Titre": "It's a terrible service that's falsely packaged with a good promotional image",
          "Contenu": "Before using this service, I had seen information online that it provided poor service for Buddy Boss, but I thought it would be an exaggeration. However, as I purchased and used all the platforms/apps, I eventually found that the evaluation was all really true.Are you fascinated by the company's clean demo image? Are you especially into apps? If the positive circuit works despite my warning, try buying it. Unless it's a waste to lose your huge amount of money.The company's app products are not perfect, and there are too many bugs. There are also bugs that didn't exist at first, but the problem is that they can't solve the problem. CS and the development team will make demands to solve the problem and you will respond accordingly. In the process, time really flies indefinitely. It's a relief if the problem is solved. The problem of keyword search not working properly has not even been solved for nearly a month. In the process, your month just flew away, and if you had opened the system to customers, you would have to close your business.For your information, don't be relieved that there is a 21st refund period. There is a bug after the 21st, so the app does not open. CS is saying nonsense that a six-month service can be temporarily suspended for refund requests. I spent the first 21 days asking for action on service issues. And next month, the app will not open, so it will not be able to use it. Service team? Development team? Basically, each communication is contacted after two to three days, and three to four weeks are quickly spent after waiting for their increasing authority requests. As I said earlier, I can't catch the problem. In the end, it makes me give up and not use the function.For reference, despite not providing normal services, this company, which only mentions the 21st refund standard and does not refund, now has no answer at all even if it inquires.If you want to blow away money and time coolly and experience garbage response services, try Buddy Boss."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Storm Cunningham",
          "Nb_Reviews": 5,
          "Date": "2022-09-15T14:41:54.000Z",
          "Titre": "Caution: read this before buying BuddyBoss",
          "Contenu": "I just spent the past six months trying to create a new website using BuddyBoss, and have given up. I had high hopes for BuddyBoss, but the product doesn’t live up to the hype. The one claim they make that they live up to is support, which is good.If you want to build a site that’s a straightforward clone of Facebook, with no unique functions or features, BuddyBoss might work well for you. But if your members need functions beyond ordinary social media, you’re probably better off with a plugin like Youzify that allows you to add these social media features to a regular WordPress site that allows you to do anything.Here are just a few of the major problems we encountered:1) They  have a \"BuddyBoss Integrations\" webpage with a long list of plugins that supposedly are compatible with BuddyBoss, but I think they just mean your computer won’t blow up if you combine them.  For instance,  Elementor is on that list, which was a major plus since we use it heavily. But it turns out that none of the core BuddyBoss pages (like Groups, Forums, Members, etc.) are editable in Elementor: you can only create new pages in Elementor using their Sample page.2) Don't believe their claim of requiring fewer plugins: you’ll need tons of them. It’s true that you don’t need BuddyPress, but that’s about it for cutting down on plugins.3) Many of our support requests got the reply that we would need to hire a professional developer to get what we want. Sometimes it seemed like sending business to developers was the reason they created BuddyBoss.4) The turning point came when we realized that we were spending half our development time trying to work around BuddyBoss limitations. We bought it to make our lives easier, not harder.We were far beyond the 14-day money back guarantee. But, since we never used BuddyBoss for even one minute on a live site, I was hoping for at least a partial refund, since it turned out to be useless to us. (There’s no way you can really discover that in just 14 days.) No such luck: $228 and six months of work wasted.I worry about the future of the company.  They regularly have lifetime license offers that they push really hard. They are sacrificing future revenues for a cash infusion now, which makes me wonder whether they have staffed-up too fast and created too much overhead."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Aaron",
          "Nb_Reviews": 10,
          "Date": "2023-03-05T15:49:47.000Z",
          "Titre": "INFORMATION For the Prospects!!!",
          "Contenu": "INFORMATION For the Prospects!!!If you are here looking for reviews because you are thinking of using BuddyBoss for your project - then this will be the REALEST review you will ever get based on first-hand experience.If you search around the internet, you will see all the features of BuddyBoss and it's true - the platform looks good, the features are good, and the marketing pages look good which is why you will be tempted to use it.BUT1. If you are a small business owner.2. If you consider time = income.3. If you will be using additional plugins aside from BuddyBoss.Then BuddyBoss is not for you. BuddyBoss is for big businesses that have the funds to pay for the service and at the same time wait 10 days for one (1) support ticket - Imagine if you have more than one (1) support ticket.Here's a sample for one (1) support ticket:*You: I want to ask for support about .....***9 days waiting.*Support: Thank you for your patience. Just to be clear...*You: (responding right away, 2 minutes after receiving their response) Yes, that's what I need... ***4 days of waiting. *Support:  Thank you for your patience. We will submit this to the technical department.***5 days waiting.  While you are stuck waiting for a response, you are paying for the service, and can't fully use your site for the business because you are waiting for a resolution.So if you have an army of developers in your business where you won't be needing support from BuddyBoss to get your business up and running, BuddyBoss is for you.Make no mistake, I am a BuddyBoss user because I've already invested effort and time on my project - I just want to inform you if you are a prospect who values time.I am using other premium services too but I always get a response within 12 hours ALL THE TIME that is why I have a reference to compare from.As for the trial period, if you do not need support - the trial period will work for you.But if you need support, the trial period will be over before you get support.1. If FAST support is VERY IMPORTANT for you and your business2. If you value your time as well as how it can affect your business3. If every dollar you spend on premium service is important to you Then find an alternative. You will not just lose money for paying for the service while waiting for responses, you will lose time = income on your business side as well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryan Lowe",
          "Nb_Reviews": 1,
          "Date": "2022-01-28T15:44:37.000Z",
          "Titre": "Poor Leadership, Unfair Policies, Be Careful Doing Business",
          "Contenu": "This review is based on the leadership team at BuddyBoss and their policies. I will make this as short as possible. I was an early purchaser of the BuddyBoss app and purchased the annual app license for $2,148.00 USD. It took BuddyBoss 3+ months (+/- 90 days) after my purchase date to put together a system that would even allow their app build system to operate correctly. This is obviously past their return policy deadline. I had previously positive experiences with BuddyBoss's desktop platform and the communication from them and decided that we would stay the course and try to wait for them to catch up with their software that was released too early to be a successful launch. Almost a year later, I've tried everything in my power to use their app software. This is including hiring an ex-developer from BuddyBoss who was hugely responsible for a bulk of the commits in their github repository. We have concluded that the app software will not work for my use case and we have not used the software, cannot use the software and will not be able to move forward with it. As a matter of fact, BuddyBoss can look in their system and see that we were never able to even submit an app build from their system so we obviously have not been able to use the software. I have asked that they consider a refund or at the very least, they consider a partial refund as we were never able to even use their product. You would think that morally, they would be competent enough to understand that a cash strapped startup could definitely use the funds that they allocated toward software that they have not and cannot use and provide some sort of refund. I have used ZERO of their resources on this subject so there has been ZERO overhead on their end when it comes to my case specific. They have refused to provide any refund or any real solution except to offer me a service that goes with the software that I cannot use as they know I cannot use it and at this point it's moot. All I can say is that if you aren't absolutely 1000% positive this software will work for you, please be very careful purchasing anything from BuddyBoss. Unfortunately, in this case, their greedy business practices have shown to supercede their morally competent human practices. I have zero reason to believe that if they cannot be understanding in a case like this, I'd be surprised with their decisions in cases that even less favorable. Good luck!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jamila Wing Chung",
          "Nb_Reviews": 8,
          "Date": "2022-01-25T10:45:05.000Z",
          "Titre": "horrible customer services... try alternative products",
          "Contenu": "horrible saleshorrible support..money makers not a service - try alternatives"
        },
        {
          "Note": 1,
          "Lieu": "UY",
          "Pseudo": "Gonzalo Arce",
          "Nb_Reviews": 3,
          "Date": "2022-07-11T21:51:03.000Z",
          "Titre": "Low level technical support and…",
          "Contenu": "Low level technical support and mistreatment towards the client, censorship in facebook groups and."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T20:03:57.000Z",
          "Titre": "Terrible customer support",
          "Contenu": "Terrible customer support. They do not know their product. All their support does is to tell you, once every 7 days, to install a plugin, or they give you some irrelevant answer. And then you have to wait 6 days for them to reply. Stay away from BB. Their code is faulty and they know it. Look elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Ruud van Beek",
          "Nb_Reviews": 9,
          "Date": "2021-08-23T12:10:05.000Z",
          "Titre": "100% totally bad support!",
          "Contenu": "100% totally bad support!! Never before have I experienced this type of NO support at all.I have reported 4 very serious issues. After all types of \"polite\" nonsense replies, I was promised a serious support member would look into the issues.After 6 days no action was taken, all issues were proclaimed to be no issues but \"development suggestions\". Totally ridiculous of course.If someone can mention as serious and better working product with a REAL support team, please let me know. I will switch the same day!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2021-06-08T19:24:22.000Z",
          "Titre": "Terrible with Maintaining Products",
          "Contenu": "Company is terrible with maintaining their products. Products/themes/plugins cost 3x as much as equivalents on other websites, yet BuddyBoss doesn't keep them properly updated. Contacting support falls on deaf ears. Products are 8 months out of date and counting, yet still priced at hundreds of dollars."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2021-05-01T21:07:58.000Z",
          "Titre": "I highly don't recommend that plugin",
          "Contenu": "I highly don't recommend that plugin - it does great job but support takes ages and there is no reply from them at all within days! Absolute surprice for me and I think their support has a lot to improve - most 20 usd plugins have better tech support then this 200 usd plugin - be aware of it when buying!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Tulia",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T17:02:35.000Z",
          "Titre": "Very buggy with slow customer service",
          "Contenu": "Very buggy with slow customer service.  Definitely wouldn't recommend"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jamila Wing Chung",
          "Nb_Reviews": 8,
          "Date": "2021-08-07T18:32:35.000Z",
          "Titre": "It's Buddypress with makeup- with no support",
          "Contenu": "It's Buddypress with makeup. and the support team are as technical as my grandmother.. zero support..no point spending on developers on this.. pay money and develop buddypress for yourself"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "EJS London",
          "Nb_Reviews": 3,
          "Date": "2021-12-23T15:21:53.000Z",
          "Titre": "They screwed me over",
          "Contenu": "They ended up completely screwing me over! Never going to use again. All their services are absolute crap what a waste of money. PLEASE DON'T BUY THIS!!"
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Anna",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T11:59:17.000Z",
          "Titre": "super poor support",
          "Contenu": "super poor support - their support have lack of knowledge about product, very very weak - it's a buddypress with nice theme but lack of support!"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Andy Berg",
          "Nb_Reviews": 11,
          "Date": "2021-03-27T11:22:35.000Z",
          "Titre": "Refuse to refund order",
          "Contenu": "Unfortunately the buddy press that this is a fork of is just too slow. Their fork is no better. Even with a really fast server it's too slow. It is simply not optimized enough. I ordered a site licence that i then upgraded to a lifetime license. They failed to deliver the lifetime license for ages. After over 30 emails back and forth I decided to cancel and they refused to refund my purchase even though I did not get my order complete. They claimed I still had to pay for the initial site license because it was an individual purchase but I think it was just one order. They didn't show me a confirmation that my \"first\" order was complete but instead made a one time offer that I perceived as the same offer. Beware! The sites in their showcase are all dead. They used to have a page with high traffic sites using their theme but they are also dead or using a different solution. The 14 days refund is on purpose that short so you don't have time to actually evaluate the product."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Wilkinson",
          "Nb_Reviews": 3,
          "Date": "2021-11-29T23:45:33.000Z",
          "Titre": "Not happy",
          "Contenu": "Not happy. They took $3000 for the app, and said I have the app, which I don't and they refuse to refund. Stay away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James M.",
          "Nb_Reviews": 2,
          "Date": "2021-12-07T18:31:20.000Z",
          "Titre": "HORRIBLE communicators. incomplete project",
          "Contenu": "Still waiting on clarification on next steps. This team will stop at nothing to make their life easier by not working."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katherine S",
          "Nb_Reviews": 3,
          "Date": "2022-03-29T03:25:16.000Z",
          "Titre": "Warning! Do not purchase app services!",
          "Contenu": "I paid over $3,000 for their app services, to have it \"done for me\" which it was not. After 5 months the app could never be published, I received error after error, and support were no help sending me to watch countless videos and me needing to send endless screenshots of the problems that were never fixed.They would send me a solution, then I would get another error and be asked for another screenshot. They just send you around in circles while taking your money, I paid for the done-for-you service, so I shouldn't have been the one needing to figure out all the issues, it should have been done correctly in the first place.After paying $2,000 for them to do it for me and a continual $215 a month which totaled over $3,000 I had no app published.I finally gave up not willing to be charged any more money for an app that would never get published.When I asked for some money refunded they flat out refused.They did not deliver what I paid for and they don't care as they already have your money.UPDATE: Response to BuddyBoss Response below.I supplied the keystore, I supplied everything that was asked, this response is the exact type of response I received every time, no help, just run you around in circles.And, yes I did sign off, after a long-drawn-out process where I pretty much had to do everything. I signed off expecting my app would be launched, what a con this was, once I \"signed off\" there is no care to actually get the app launched. THAT'S WHAT I PAID FOR!!!  I switched and used MobiLoud for my app and it's fantastic, they actually get your app launched without the headache."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2021-08-18T07:34:18.000Z",
          "Titre": "Absolutely terrible support",
          "Contenu": "Absolutely terrible support - lack of replies!"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Mathew",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T07:16:09.000Z",
          "Titre": "Platform can be useable but very slow…",
          "Contenu": "Platform can be useable but very slow and comes with terrible support and lots of bugs.Our site was crashing up to 10 times a day, when contacting support they kept trying to pin it on us and eventually nailed down the issue to their software after months of going back and fourth. We lost over 50% of our company and they didn't care the slightest.We also tried to contact the agency to get some custom work done and they came back and said no. The app is horrendously slow, dont even go near it better off building your own otherwise your customers wont even use it. We had load times of up to 20seconds just to open it. Customization is very limited and lots of missing features.At one stage i even had to reach out to the director of the company just to get my support tickets looked at properly. Its a joke"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Daniel Clow",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T12:01:17.000Z",
          "Titre": "To many issues.",
          "Contenu": "1. The more I'm testing this plugin the more issues I'm finding. The way the moderation and banning works just isn't good enough. Organizers are given way to much control. I highly doubt promoting someone to an organizer you'd want that person to be able to delete an entire group for example. Give admin the options to turn these abilities on and off!!!2. Also there is no front end moderation options as seen on the backend, admin have enough to deal with in maintaining the site. Give organizers or other roles ability to actually moderate the reports. All this is given to Admin role on the backend. I'm sure an admin don't want to promote other users to admin role just to help with moderation reports! Admin won't want to sit there looking at reports 24/7 so let other roles help with reports from the frontend.3. Banning. So many issues.Once a user is banned and kicked as the name puts it the handling of this is very poor. They are redirected to the 404 page not found if the group was invite only. Extremely poor way of handling banning. They should be told they are banned from entering the room not directed to the error 404.Another issue with banning. If someome is banned and an organizer thinks Ill remove the banned user from the group because they dont want them in the group that ban is then reset and does not apply. A banned user can then request to join again OR even worse if the group was not set to request to join they can come straight back in the room and start messaging!! Why on earth is banning being removed after you remove a user from a group! Where are you telling organizers that if they remove someone from a group the ban does not then apply?So to keep someone banned you cannot actually remove them from a group they have to stay in a group to stay banned. Again this just isn't an acceptable way to handle banning. And give those banned an option to request to be unbanned!I'm not quite sure how the developers of this plugin are not aware of all this and perhaps they are not actually thinking or real world use case with a busy site.I can go on and on with other issues. I would urge the developers of this plugin to really think about real world use case and how all this actually functions on a live busy site."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "TrueSapien Challenge Life",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T22:45:13.000Z",
          "Titre": "Great product wih some flaws, but truly awful support",
          "Contenu": "BuddyBoss was glorious when we first bought, after using for a few years there is some odd decisoons made on the direction it is going butits still a prety awesome tool...until things go wrong, then you have to contact their support Support takes ages to respond, and this is worse because they constantly do not read the question. On top of that it is clear they just don't care about their customers through the lens of their support. So try BB, use BB, but set expectations low when it comes to support."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Janette Braverman",
          "Nb_Reviews": 7,
          "Date": "2023-03-22T18:35:37.000Z",
          "Titre": "BuddyBoss has been responsive to most…",
          "Contenu": "BuddyBoss has been responsive to most theme issues and have helped resolve them in a fairly decent timeframe. Some have taken longer than others. I have noticed that their theme still has several incompatibility issues with other plugins. Especially, WP Rocket and caching plugins. Recently, there was an issue with their Ajax site search where page code was reflected in search results. I had to turn off search functionality across my entire site. This is a big deal. This issue, which was caused by their theme incompatibility with the Divi Builder had been outstanding since December 2022. I use Divi for various reasons. If you’re using a Buddy Boss theme, be aware that there are plug-ins that you may no longer be able to use effectively. I am using it for the community, groups and news feed functionality. So just understand that there will be limitations. I worked with several developers from Elegant Themes to finally resolve the issue in March 2023."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "elmo pienaar",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T16:32:48.000Z",
          "Titre": "Bulk admin options non-existent",
          "Contenu": "There are many things we like about BuddyBoss but unfortunately, it offers an extremely frustrating and laborious admin experience. Considering the platform is built on the idea of user groups, in other words working with potentially larger numbers of connected users, there is no bulk way to filter notifications and accept, decline, or delete requests to join groups. Sure there are a number of plugins (though not spot on) but this should be core to the platform."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "izmlife",
          "Nb_Reviews": 16,
          "Date": "2022-02-07T18:23:41.000Z",
          "Titre": "Decent, but absolutely awful support",
          "Contenu": "This is a business that cares a lot about their product, but really couldn't care less about their customers. Avoid at all costs if you think you will need some level of half decent support, otherwise, a great product."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Albert Sola",
          "Nb_Reviews": 5,
          "Date": "2022-09-29T09:46:49.000Z",
          "Titre": "The plugin/theme good, support awful",
          "Contenu": "The plugin is one of the best on WordPress, although their support team is awful.Reported a bug with all the technical documentation and identified the exact 3 errors they have (I'm a developer).We are 20 days in support messaging back and forth between the technical team and me and they do not read the messages. They have 0 capacity to do any basic testing to the point I had to provide a server for them to test.After providing the server and step-by-step instructions and the 3 bugs BuddyBoss has the support/development team is unable to follow them. They end up changing the configuration of the server by mistake and messing everything up. Which I had to keep maintaining so they can keep working.Days and days lost, videos recorded with step-by-step guides so they are aware of what it is going on on the software they write, but not even with the videos. I request to speak with someone technical so we can increase the technical discussion and that person would see the bug just in front of their eyes, but there is no one technical in the company. They need time as they can’t replicate.In the meantime my client has a broken service, I have one of my servers taken over by buddy boss (support/development/technical team) and spend a substantial amount of unbillable hours every week messaging the support team which can’t follow a step-by-step guide/video.If you are an agency/developer avoid this plugin. If you are non-technical and have no capability to glue alternative plugins together and your only option is BuddyBoss, good luck, my friend.Update: After filling this complaint I got a message that the issue was resolved and got 3 days to answer. I was away and the ticket got closed without being fixed. I have reopened the ticket and buddy boss support claims the issue is fixed, which is not."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T08:55:04.000Z",
          "Titre": "it took 3 days to react on a critical…",
          "Contenu": "it took 3 days to react on a critical issue"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "izmlife",
          "Nb_Reviews": 16,
          "Date": "2021-05-25T22:24:52.000Z",
          "Titre": "Not to be trusted, but great product!",
          "Contenu": "This is TrustPilot and for Trust, this company gets zero stars. They was happy to take my money but provided a faulty product. I was an early bird on their app and they had many problems on go live. 3months later and i still had no functioning app, yet they maintain that the app was not faulty and continued to charge me even though there was clear evidence it was. To be honest though, it was their disrespect and blatant lack of care that got to me. Things can go wrong, it happens, but you just don't treat customers the way they have been. The support is also terrible, one example telling me we had an issue with a conflicting plugin but it turns out it was nothing to do with any plugin but an incorrect setting. Digging further it turns out they never bothered testing it at all in the first place! In short, BuddyBoss is great product but DO NOT TRUST them!"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Matt",
          "Nb_Reviews": 5,
          "Date": "2021-05-15T14:39:49.000Z",
          "Titre": "Poor communication and awful support",
          "Contenu": "Poor communication. Communication has been an absolute mess. They are heavily focused on the app, the platform is obviously being neglected. This can be seen in their roadmap: features that were on there for Q2 2020 still haven't been completed a year later.Yet the app is still a complete mess. They're charging people hundreds of dollars a month for an app that should have been a beta (to be honest, even alpha). Truly terrible.Support is completely incompetent. Tickets created take a week to get a response to and support staff is obviously not knowledgeable. Had especially bad experiences with Michelle R. Graham and Jason are nice, but I sincerely dislike the recent developments in the FB group. They noticed customers were dissatisfied, and basically took over the group, turned on post-approval and rejected any posts that criticized them (they created a new rule \"Good Vibes Only\").To anyone considering buying this plugin, I advise you to join the BB Facebook group to get an overall feel of real customers think. TLDR: Poor communication, completely incompetent support and bad management (sometimes it seems like Tom is blaming the users in his video?). My advice? Find another solution, but don't go with BuddyBoss."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Daniel Clow",
          "Nb_Reviews": 3,
          "Date": "2023-07-31T12:26:23.000Z",
          "Titre": "Some issues need fixing!",
          "Contenu": "Not tried the mobile App as yet but would like to see some issues for the Web version sorted first. Will update this review once it's done. There is a problem with the video uploading feature on Browsers. Tested on there own Demo site and the same issue is on that. When using different browsers the video uploading is failing. Especially so on iPhone and Chrome browser. Works fine on Android and Firefox but issues is with iPhone and Chrome browser for different MP4 files.Also a CSS issue on Forums for the report moderation button for normal members showing off screen after clicking the button. Again same style problem is on the demo site. Flex and absolute positioning of the popup and button is causing this. Using absolute positioning of the button to fix it.Some other issues with the Gif container on forums looks to be recently fixed so that's good..Would highly recommend they use additonal front end moderation options. Not many people will want to set users as admin role to help with moderation reports. Currently this is done by admin role only. This really needs changing to include front end moderation help and for moderator role to have ability to ban members from Groups. Banning is currently handled by organizers and admin role.But unfortunately organizers have to many options for the settings in the Groups. Admins may not want certain Organizers to have that much control over there groups and ability to delete them and edit them. I'm having to write custom functions to block this ability for organizers. All just seems a bit backwards and really needs changing.Moderators really need the ban member feature added so this doesnt have to be handled by organizers and admin role.Also when a member is banned and removed from the room the banned member can re-enter the room and still post. The banned member needs to stay in the group for the banning to work. This needs fixing."
        },
        {
          "Note": 3,
          "Lieu": "CZ",
          "Pseudo": "Venkata Pardha Saradhi Attuluri",
          "Nb_Reviews": 3,
          "Date": "2022-07-06T18:45:08.000Z",
          "Titre": "Avarage product",
          "Contenu": "Hello,It is just an avarage product that survives because of lack of tough compilation. Development is too slow. Occasionally finds bugs. My experience with tha support is above avarage."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dave W",
          "Nb_Reviews": 7,
          "Date": "2023-04-05T10:54:04.000Z",
          "Titre": "Be careful when doing the app thing...",
          "Contenu": "The plugins for the website are good but buggy at times where you have to delete and reload new plugins because something went wrong. Their quality control isn't the best. The BB theme also presents a few compatibility issues but it's the app side of things I am reviewing here. I went (and paid) for the \"Done for you\" service to build an app. Don't believe their hype. Some of it is 'done for you' but you will be spending days trying to navigate their processes (most of which is laid out, but the instructions are confusing at times as they appear to have one set of instructions regardless of whether you are on the DFY service or not) and you are going to be spending a fair bit of time doing things in Apples App store connect and the Android Play store as well as other bits. Little things they gloss over like you having to get a legal agreement drawn up for the app!I have lost count of the number of times I have had to reach out to support for help in navigating the process. They do respond positively but it can take a bit of time. The problem is they say things like \"Your provisioning profile probably expired. If that's the case, you will need to create a new one.\" and then don't tell you what that is or how to fix it so you have to go back again and ask. Really time consuming and frustrating.I have found the done for you 'service' frustrating, complicated and very time consuming process and I'm still in it, months later. To be fair I am busy but 'Done for you' it isn't by any stretch of the imagination. I am still hopeful of getting my app out, but boy it's not easy or quick.Given the amount of support time it takes you would think it would be less hassle (and cheaper) for them to genuinely have a 'done for you' service."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Dror",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T16:11:55.000Z",
          "Titre": "It is taking too long to fix the ISO…",
          "Contenu": "It is taking too long to fix the ISO app problem"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jamila Wing Chung",
          "Nb_Reviews": 8,
          "Date": "2021-04-16T05:40:52.000Z",
          "Titre": "Great For lazy developers",
          "Contenu": "Great For lazy developers, this Buddypress (2.0) with makeup is great.. buy and off you go!!For those of us who want the ability to customerise. I  A better investment would be in rolling up ur sleeves, and starting from scratch on buddypress.Their support is also HORRIBLE!! - 4 DAYS TO RESPOND ... t \"we're to help\"- promise, doesnt materialise once you spend your money..There is a great idea behind this... but BB fall short of complete delivery...Great idea - Great for plugin and go websites.. limited for any real customisations!! Sadly even minor customisations such as modifying certain BB pages, grabbing part of BB pages and creating a single page, fully integrating 3rd part (Elementor & Block's dont seem to connect)..."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "MMCrypto",
          "Nb_Reviews": 3,
          "Date": "2021-07-21T10:49:43.000Z",
          "Titre": "Terrible service, false promises, and faulty products.",
          "Contenu": "Good products, but terrible support, and terrible pricing! Their app should not have been released so soon. They promised it would be great and all, but it's really not... it still feels like it's in beta mode almost 6 months after it's release! They promised features that arent even available yet! They said it would be available for tablet, amongst other features, but now they've just added it to their \"roadmap\" for later in the year??Buddyboss are loaded with false promises. You'll see plenty of \"positive\" reviews from blogs and YouTubers (because they're all paid out), and they always remove complaints about their products or services from their social media (this is pathetic)! Moral = wait a few years for them to polish up a product before you buy it!"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Gabriel Fredrich Romor",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T08:58:31.000Z",
          "Titre": "Great platform & APP",
          "Contenu": "I love the BuddyBoss Platform and APP, wouldn’t use any other platform for our community and courses Need some improvements specially with some of the integrations that are already in place, examples are Zoom, LearnDashThe roadmap for suggestions / ideas could send a confirmation that you sent one, as you have no idea if you already sent one for that or not."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Swami",
          "Nb_Reviews": 3,
          "Date": "2023-04-29T06:14:55.000Z",
          "Titre": "Issue was resolved but some plug-ins…",
          "Contenu": "Issue was resolved but some plug-ins were deleted without our knowledge"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T19:34:31.000Z",
          "Titre": "Buddy Boss is definitely paving a new…",
          "Contenu": "Buddy Boss is definitely paving a new path and has definite potential.  I would have given 5 stars but they do lack a sense of transparency and customer service that could be improved.  I have always lived by under sell and over deliver.  That may be something they should implement into their messaging."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Mr.Jensen",
          "Nb_Reviews": 3,
          "Date": "2022-09-25T00:50:35.000Z",
          "Titre": "Being using the Buddyboss…",
          "Contenu": "Being using the Buddyboss platform/theme since 2020 and love it. (seven years with Buddypress was a drag). The company have a clear roadmap that gives great security in what you can expect for the future.Tons of integration with the best plugins on the WP market.Support is great for sales/billing questions and in general very kind.Minus 1 star for their shift to solely focus on App customers and the technical support with Ticket/mail.Technical support is bad so I rarely use it, which might be why they have so poor support, people do not use it = less cost.- They always reply 1-3 times with stalling questions, that clearly shows they didn't take the time to read or find the answer in the first place.- The answers you finally receive indicate that the Tie 1 support team are not well versed in the Buddyboss system, the plugin integration features, or development.I understand your focus on the App customer as it is monthly revenue, but you could get monthly revenue from the web customers as well. I would happily pay a monthly fee for CHAT SUPPORT! WPMUDEV, DIVI and others have 24/7 chat support. you could have two support plans, \"Buddysupport\" which includes support for WordPress and Buddyboss. \"Buddy+support\" which includes help with the plugin integrations."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Dr Andrew Atter",
          "Nb_Reviews": 3,
          "Date": "2022-10-11T11:31:09.000Z",
          "Titre": "Good recovery after problem with account access",
          "Contenu": "After getting locked out I had trouble getting reconnected to my account. The response was effective although there’s a few things they could do to improve the account recovery process"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Manuela",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T10:03:02.000Z",
          "Titre": "The problem was solved",
          "Contenu": "The problem was solved, but it took more than two weeks from the development department. The problem service were very friendly"
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Saim Turan",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T19:43:12.000Z",
          "Titre": "Its good after all",
          "Contenu": "I edited my review. I used other free themes for 6 months but nothing is close to the Buddyboss theme. They have a long way to go but so far I understood that Buddyboss is very good. And thought that I should go and fix my review. Thank you guys"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "André",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T19:55:43.000Z",
          "Titre": "Love it!",
          "Contenu": "I am user since 18 month now. Great wordpress products with great and helpful support. The customer support could be a bit faster."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Rena A.",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T14:31:36.000Z",
          "Titre": "Good Platform. Excellent Technical Support.",
          "Contenu": "Great for basic private membership networking sites, forums and blog posts. Requires custom code and other premium plugins for more professional or advanced networking sites. Excellent customer and technical support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T18:46:19.000Z",
          "Titre": "Great platform with room for improvement",
          "Contenu": "Great platform! Wonderful and flexible features. Wish customer support was a bit faster."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T23:11:26.000Z",
          "Titre": "Great plugin if you know your way…",
          "Contenu": "Great plugin if you know your way around Wordpress. Support is somewhat slow and not very good. The plug in and pro theme is great"
        },
        {
          "Note": 4,
          "Lieu": "AO",
          "Pseudo": "Jerry",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T09:23:34.000Z",
          "Titre": "The experience has been great so far",
          "Contenu": "The experience has been great so far, the opportunities for many entrepreneurs like me to thrive in life are endless, but I truly believe that buddyboss still has a long way to go compared to others communities platforms out there, Buddyboss is on the right track I truly believe it."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Gavin Jack",
          "Nb_Reviews": 5,
          "Date": "2022-03-18T07:20:44.000Z",
          "Titre": "Great platform and theme for online…",
          "Contenu": "Great platform and theme for online communities. Due to its poularity I feel the BuddyBoss environment would benefit greatly from focusing on more integrations with popular plugins."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ron",
          "Nb_Reviews": 2,
          "Date": "2022-02-22T12:21:07.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product, and great support overall. New implementations can cause issues, so recommend upgrading to staging area first and doing a thorough test before implementing on production site."
        },
        {
          "Note": 4,
          "Lieu": "DZ",
          "Pseudo": "Fawzi",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T22:13:10.000Z",
          "Titre": "the issue were soved",
          "Contenu": "the issue were soved, thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Micheal Shallop",
          "Nb_Reviews": 5,
          "Date": "2021-09-15T01:16:39.000Z",
          "Titre": "Great (PRICEY) product",
          "Contenu": "Great product - esp since you can trash bbPress and BuddyPress.  -1 star for being overpriced.  A low-end sub will cost you ~$200+/year which is really hard to justify for a starting ecom site.  They're obvs going after bigger fish.  Was easy to set-up and looks great! Support was responsive and provided clear answers.  Unfortunately, I had to request a refund for the product, which they happily provided."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2022-02-20T01:48:08.000Z",
          "Titre": "Quality support and tools for…",
          "Contenu": "Quality support and tools for solopreneurs and agencies"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcus in Arizona",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:58:42.000Z",
          "Titre": "We Chose BuddyBoss After Careful Research",
          "Contenu": "We anticipate a large number of members. Don't we all?! LOL!So we chose BuddyBoss over Peepso for this reason. We have been setting up BuddyBoss for a week or so now, and their Videos for each option are incredible. Also, we have had to use their Ticket Support system and it is great. Their support is thorough and straightforward.The BuddyBoss Demo which includes a Sandbox that creates your own BuddyBoss community and allows access to the entire backend of the demo is really a smart idea that has helped us throughout the build. We use the demo almost daily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ian.",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T02:20:47.000Z",
          "Titre": "Buddyboss is critical to my buisness website.",
          "Contenu": "I spent a ton of time trying to figure out how to add a social component to the group I coordinate activities for. Wish I would have started with Buddyboss. Would have saved me a ton of time. Light years beyond the competition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 5,
          "Date": "2023-12-17T17:45:36.000Z",
          "Titre": "Nothing Outside Their Scope",
          "Contenu": "I thought for sure my problem with a domain name was outside the scope of the Buddy Boss platform, but the team quickly showed me how to resolve my issue, and it worked perfectly! Thank you BuddyBoss - you're the best!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MM",
          "Nb_Reviews": 7,
          "Date": "2023-12-10T08:06:14.000Z",
          "Titre": "Cannot fault these guys",
          "Contenu": "Cannot fault these guys. Always happy to help quickly and efficiently no matter how simple or complex the problem is. Thanks to Mahmudul and Eduardo for helping me promptly with the last issue I had. Which wasn’t really an issue, more like something I missed that I shouldn’t have. So it goes without saying I definitely recommend buddyboss and their support team."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Ari Steele",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:29:10.000Z",
          "Titre": "Really helpful above and beyond service…",
          "Contenu": "Really helpful above and beyond service when Nayeem kindly went through and found a plugin conflict that was forcing an error. Wonderful to see such dedicated service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryon",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T14:08:30.000Z",
          "Titre": "Above and Beyond",
          "Contenu": "The support team at BuddyBoss goes well beyond their scope all the time for us. They don't hesitate to deliver the absolute highest quality of service and support any customer could possibly want. This is - without a doubt - the best operation I can remember experiencing in my career as an entrepreneur and business owner."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jim J Davidson",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T12:17:17.000Z",
          "Titre": "There are many things that can go wrong…",
          "Contenu": "There are many things that can go wrong with a membership site that has many moving parts and integrations. On this occasion I had an issue with videos that previous embedding not embedding. While the issue was out with their remit, they took it upon themselves to resolve the issue for which i am grateful. BoddyBoss it a great platform and have a great support team which is vitally important to the running of a membership site."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Katie T",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T14:44:04.000Z",
          "Titre": "Above and beyond",
          "Contenu": "I have been using BuddyBoss for a few years now and they are usually pretty helpful. I recently asked for help with some styling issues that I was having and Nayeem went above and beyond to help me solve it. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Eric Hinz",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T19:30:17.000Z",
          "Titre": "CSS problem solved quickly",
          "Contenu": "Quick response and a solution of the problem soon."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Tobias Guggemos",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T19:38:40.000Z",
          "Titre": "Best social community on Wordpress",
          "Contenu": "Simply the best social community solution that Wordpress currently provides. Good design. Great customer support. All basic features of a social media platform. Facebook like. Hopefully more recommender features in the feed in Future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Castello",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T16:47:51.000Z",
          "Titre": "The BuddyBoss DFY Web process was very…",
          "Contenu": "The BuddyBoss DFY Web process was very well laid out.  It provided video explanations of each step and instructions for completing those steps.  The questionnaires at the beginning of each stage help to set the expectations of the upcoming work.   They also offer a full service agency approach if you would prefer to not be involved in the setup at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryon",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T14:43:03.000Z",
          "Titre": "Super responsive",
          "Contenu": "Super responsive, professional, thoughtful - they go above and beyond time and again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George LaRocque",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T15:34:16.000Z",
          "Titre": "Responsive, Thorough, and Kind - Great BuddyBoss Support",
          "Contenu": "Responsive, thorough, and polite. Also recommended that I added my suggestion to the roadmap. Always a good experience with BuddyBoss support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T14:30:10.000Z",
          "Titre": "Outstanding Support and Unmatched Service - BuddyBoss Exceeds Expectations",
          "Contenu": "BuddyBoss's team demonstrated a deep commitment to not only resolving my issues but also ensuring a smooth and enjoyable experience with their products.Every ticket I submitted was handled with utmost professionalism and efficiency. The support team's expertise and responsiveness were remarkable, addressing my queries promptly and effectively. Their ability to provide timely solutions to complex problems is a testament to their technical proficiency and customer-centric approach.What truly sets BuddyBoss apart is their dedication to customer satisfaction. They went above and beyond to understand my needs, offering tailored advice and practical solutions that greatly enhanced my experience with their platform.Their support has been a crucial factor in my success with the platform, making my journey with BuddyBoss not just satisfactory but exemplary. It's rare to find such a high level of service and support in today's fast-paced digital world.I wholeheartedly recommend BuddyBoss to anyone seeking a reliable and supportive digital platform partner. They deserve nothing less than a 5-star rating for their exceptional service, and I look forward to continuing my journey with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vince King",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T16:09:49.000Z",
          "Titre": "Great support and lots of possibilities",
          "Contenu": "I've been using buddyboss for almost a year to create a community platform. It is open source and has lots of built in integrations with other WP plugin that gives me tons of possibilities. In addition, their tech support are awesome, tickets are well managed and techs are always helpful and on time.great job guys!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "NIMHANS Digital Academy",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T14:36:39.000Z",
          "Titre": "Great addition for a non-tech individual with less resources",
          "Contenu": "Thanks . We used buddyboss web for basic learning on \"tobacco cessation\" 1.Our mission and focuss is more to democratize knowledge and looking out for large solvable solution  by bidirectional flow of knowledge and wisdom in addiction and mental health domain.2. Initially we spent some time to install and integrate buddyboss web into existing learndash. There was some issue in payment gateway specifically conflict between in-built Learndash payment (razorpay) . We have small course fee of 5USD. (We donot have technological expertise )  3. The best part is the buddyboss tech team chipped in and helped in set up the initial flow. Then we took up from there4. The best part for us is the help from tech team of buddyboss was timely.There is no doubt that buddyboss is truly democratising the technological knowledge. Hopfully once we arrange more resources, will like to go for buddyboss app.If you are a non-tech person and have limited resources, should explore thisregardsDr Prabhat Chand  MD PsychiatryNIMHANS Bangalore(we donot have any conflict of interest)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Malene",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T12:08:41.000Z",
          "Titre": "Great DFY Team",
          "Contenu": "Their DFY Team had been one of the best experiences in customer service I've ever had. Very caring, supportive, and kind in ensuring the project gets off. System isn't too hard to use and when there are issues, Customer Support works well with you to resolve them. Generally good experience."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dave Massey",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T11:23:17.000Z",
          "Titre": "Fantastic Company and Fantastic…",
          "Contenu": "Fantastic Company and Fantastic Customer ServiceAny time I have had an issue that been responsive immediately and have done more that I could've expected. Buddy are Class!I do want to point out then when I say issue I dont mean a problem with the product, its usually my ignorance of being unable to find a specific setting.They take the time to explain with screenshots or recordings and really walk me through everything.Amazing guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel GIL",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T18:42:32.000Z",
          "Titre": "Best WordPress theme for communities",
          "Contenu": "Best WordPress theme for communities, and the platform is constantly adding new features.I'm not using the BuddyBoss App because it is insanely expensive, so I can give my opinion about the its quality. That's my only concern about Buddyboss products. I'd wish you'd reconsider the App price in the future unless only big companies will use it."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Samir",
          "Nb_Reviews": 10,
          "Date": "2023-08-08T13:38:10.000Z",
          "Titre": "BuddyBoss is pinacle of WordPress plugins, the end!",
          "Contenu": "The simple and easy to follow guide, the support that fixed the issue after my failure is what made my experience with BB great. Also the product is beatiful and and elegant. The company? I do know that BuddyBoss is top notch company in this field and what I appreciate the most is their dedication to make their product the best as well as their support. You can kinda compare them to the Apple who make only PREMIUM quality that lasts for many years to come. In simple words it´s like candy for the kids once you taste it you wont ever want to leave it or try something else, thats how good BuddyBoss product is and their support! You gotta love it, You gotta love BB!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HP",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T21:09:53.000Z",
          "Titre": "Great software for a social media site!",
          "Contenu": "I've had a great experience with Buddyboss.  I tried BuddyPress first, but it was missing quite a bit compared to BuddyBoss.  I also needed support when I was setting up the system, which worked out great.Recently, I've had to make some code adjustments to accommodate my multisite setup and my integration with outside databases, but their code has been easy to work with.Our community gives us great feedback as well."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Werner Destrijcker",
          "Nb_Reviews": 7,
          "Date": "2023-12-07T21:07:02.000Z",
          "Titre": "Very flexible and fast support"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Allviewsite.com",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T23:09:01.000Z",
          "Titre": "Wonderful Services",
          "Contenu": "The services offered are excellent and well structured. Customer assistance is very fast, with high skills and knowledge on the subject for the resolution of every type of problem, they help the customer for every minimum need, even just to give advice. We are very happy with Buddyboss.com!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryon",
          "Nb_Reviews": 5,
          "Date": "2023-07-31T18:10:53.000Z",
          "Titre": "Best Support Ever!",
          "Contenu": "Every time we have an issue and reach out, the BB support team always responds right away, and then shortly after that they investigate the issue, sometimes solving the problem, sometime not. But always incredibly fast and courteous."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Samir",
          "Nb_Reviews": 10,
          "Date": "2022-12-31T12:59:08.000Z",
          "Titre": "Excellent product",
          "Contenu": "The BuddyBoss regular updates, new features and excellent support are combination of the best.The fact that you get one theme and 2 plugins with all these functions is impossible to beat and that's what makes BuddyBoss above everyone else. The BuddyBoss is closely listening to the customers and doing their best to give You the best possible Client Experience. Well if you put all of this together how can you not be satisfied? You gotta love it. That's why I recommend BuddyBoss!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Julie Doherty",
          "Nb_Reviews": 4,
          "Date": "2023-08-06T01:33:02.000Z",
          "Titre": "I truly appreciate the Buddy Boss Team",
          "Contenu": "I truly appreciate the Buddy Boss Team, with their support in a situation that was actually connected with LearnDash. However, as when the issue was brought to my attention, it mentioned the connection with Buddy Boss. So I was informing your team, throughout this issue of the process, believing that it may help if you had other customers, experiencing the same issue. The Buddy Boss Team agreed that this was helpful. This was a difficult time it took 3 weeks before we got the correct response from Learn Dash that helped fix the issue. It was the Buddy Boss's continued support and connection throughout this process, that made it so much less, stressful having someone else to share this with. Thank you so very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mickey Gordon",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T22:22:51.000Z",
          "Titre": "BuddyBoss is the answer to your community woes!",
          "Contenu": "Buddyboss support is great.  Awesome response time, thorough & helpful, and easy to understand & communicate with.  The product itself is very well supported with easy to follow videos for almost everything you can think of that you want to accomplish.  If you have even basic technical skills, you can deploy & manage BuddyBoss!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Samir",
          "Nb_Reviews": 10,
          "Date": "2022-10-10T14:33:14.000Z",
          "Titre": "Excellent service and support.",
          "Contenu": "Excellent service and support.BuddyBoss is ultimate package of services where you can build your own community with ease.Every time whenever some issue appear the support is there to assist you on solving the matter. And each time I learn few interesting things about BuddyBoss, WordPress and how much I have still to learn.Thank you BuddyBoss for everything. You guys are awesome. You have my gratitude and respect."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ole Mai",
          "Nb_Reviews": 2,
          "Date": "2022-06-08T13:54:46.000Z",
          "Titre": "Opinion changed by 180°",
          "Contenu": "Opinion changed by 180°: At first, I wrote a negative review, due to long support times and fatal errors which occurred on our website.But since, BuddyBoss has solved those issues in a timely manner and helped us even out with another error, that was caused by another plugin.Further, I would like to say especially “thank you” to Graham, who has offered us great support today.BuddyBoss 2.0 is looking good, but you really have to be careful with other plugins that might interfere with BuddyBoss. We learned this one the “hard” way."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Samir",
          "Nb_Reviews": 10,
          "Date": "2023-04-19T13:31:49.000Z",
          "Titre": "Quick response and quick fix!",
          "Contenu": "BuddyBoss is really awesome platform. The fact that they are putting so much efforts to make their product as near perfection as possible says a lot. Their support is always there when you need them. I for myself can say that I made many mistakes but learned great deal from my mistakes and BB support has been always there to help out.BB is not just any premium plugin but the very best. You can say that BB is like Apple they are providing only the best possible features, highly stable, optimised and super premium way ahead of any competition. That's why I really love and appreciate these guys. From 10/10 I say 10!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tory",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T03:12:26.000Z",
          "Titre": "outstanding tech support and tutorials for the non-developer",
          "Contenu": "beautiful theme and app, self-service tutorials are very thorough and well paced. Tech support has been transformed in the last 6 months. always a human response/solution within 24 hours... was previously a weakness, now a massive \"plus\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendell Harness",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T20:39:58.000Z",
          "Titre": "Excellent software and support",
          "Contenu": "Support response times are incredibly quick and helpful. I also find that their official Facebook group is very helpful as well and monitored by their support team. Overall, the BuddyBoss experience has been great for me and my users and I am excited to have a long-term relationship with it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T11:09:54.000Z",
          "Titre": "BUDDYBOSS as a package is second to none",
          "Contenu": "From my experience there are not many options out there to work with a Company/Team like Buddyboss who give you so much as a  package.  I can build a platform of my own design and add as many features as i want on web and Mobile App and have full confidence that if there are issues I can rely on BB to help resolve them in a timely fashion.  There are cheaper options out there but then your left on your own more or less after purchase.  5 Stars for BUDDYBOSS, Its worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "milapminc",
          "Nb_Reviews": 1,
          "Date": "2022-04-23T23:37:52.728Z",
          "Titre": "Your customer service was exceptional",
          "Contenu": "Your customer service was exceptional. You even extended the two-week money-back guarantee to four weeks so that we could fix the one remaining issue we were facing. However, your extension arrived a couple of days late and by that time we had already moved on to buy a different theme.We appreciate that you earned our goodwill by processing the full refund even though you could not earn our money. However, we left on good terms, and under those circumstances, there is always another time in the future. If we decide to give it another shot in the future, we will come more prepared to tackle the same issue in a different way.Thank you for being there.Amrik"
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "Heidemarie Huber",
          "Nb_Reviews": 5,
          "Date": "2023-07-20T02:23:53.000Z",
          "Titre": "The technician provided helpful suggestions…",
          "Contenu": "The technician gave me many suggestions to resolve the problem and said if these suggestions don't work they are willing to go into my website from the back end and fix it. It turned out that a new update for the BuddyBoss platform came up and in updating, my problem was resolved."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Rudy Ls",
          "Nb_Reviews": 7,
          "Date": "2022-09-17T12:24:09.000Z",
          "Titre": "BuddyBoss Customer is a satisfying experience",
          "Contenu": "I'm a long time customer who've been working in customer service, let me tell you this: BuddyBoss Customer is a satisfying experience. Always doing their best not only to find a solution, but also to fix the issue. They know how it is to be in the shoes of business people. They also have a great technical knowledge."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Samir",
          "Nb_Reviews": 10,
          "Date": "2022-08-06T13:31:49.000Z",
          "Titre": "Excellent support!",
          "Contenu": "I moved recently to Buddyboss and I had few smaller issues mostly caused by me. BuddyBoss support fixed all issues and showed me few tips. I can say only the best about the Buddyboss platform and It's support. Having so many features in just one plugin and theme is one heck of work guys. This is why I pick BuddyBoss you can't beat the performance, support and features the BuddyBoss provides."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Flirtian",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T20:54:39.000Z",
          "Titre": "BuddyBoss is great",
          "Contenu": "BuddyBoss is great! I started with zero experience with WP or coding, and now I manage an online community that works like a charm. Perhaps a bit complex at first, there are so many options and possible plugins to integrate.... but this means that there are literally no boundaries to what you can achieve. Many many thanks to the GREAT tech support, very patient with me as a newbie. They always gave prompt and quick solutions to all my issues. I feed I got 100X VALUE back for what I paid. Thanks again."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Anja",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T12:10:41.000Z",
          "Titre": "Super fast reply and individual help via video",
          "Contenu": "Super fast reply and the Buddyboss Team is always there to help and even send us a personal How To Video to make our last chances to publish our app. Thank you so much! What we also like: nearly every week new features in the theme, app and on the platform. The only thing that could be improved: automatic uploads of the updates :)"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Roy",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T14:34:59.000Z",
          "Titre": "BuddyBoss is excellent.",
          "Contenu": "The whole team of  BuddyBoss is excellent. It is not often I am impressed by a company.  BuddyBoss sure is on the very small list of impressive companies.I recommend their product for anyone who has some kind of organisation. Intranet or otherwise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Circle One",
          "Nb_Reviews": 2,
          "Date": "2022-04-25T20:22:09.000Z",
          "Titre": "Great Partnership & Support Team",
          "Contenu": "Their line of products are consistent, elegant, and well thought out to build social platforms. Their support team is one of the best I've ever experienced and we owe our success to their entire team, especially their support staff who are organized, prompt, and reliable. Their support team is above the rest and is essential to the operations of our business and the future of our company's growth. The new releases and the continual improvements the BB team does is excellent! They really know what their doing, consistently deliver, and we're so thankful to have partnered with them two years ago."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "SpotAndFluffy.com",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T16:36:52.000Z",
          "Titre": "BuddyBoss Platform Pro is fantastic",
          "Contenu": "BuddyBoss Platform Pro is fantastic! The support is also fantastic, my issue (my fault btw) was solved quickly. There are tons of help videos and how-to's. Seriously pro-level team here."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Godwin Eagles",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T11:43:46.000Z",
          "Titre": "BEST CUSTOMER SUPPORT",
          "Contenu": "I have been using BuddyBoss for over one year now. One thing they don't fail at is CUSTOMER SUPPORT. They are always available to provide technical support for any misunderstanding. I am a client from Africa, and have enjoyed their services and continuous improvement"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darien Fawkes",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T05:03:43.000Z",
          "Titre": "Great regular updates and new features",
          "Contenu": "Great regular updates and new features. Of all my WordPress plugins buddyboss is the most updated and new features always a pleasure each month to see what they have added."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T15:07:25.000Z",
          "Titre": "Profession and prompt support service from BuddyBoss and Rezwan",
          "Contenu": "I use a combination of LearnDash LMS and BuddyBoss to display and build an online community. Owning a lifetime licence to the buddy boss theme and the pro plugin has been a pleasure. I experienced some glitches with the recent updates of the Elementor page builder. The support team at Buddy Boss responded efficiently and professionally, resolving these issues."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Harry Johns",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T16:31:40.000Z",
          "Titre": "Customer first, always",
          "Contenu": "Customer first, this is one of the best ways to judge the quality of any business. Buddy boss consistently puts the customer first. The ability to customize and leverage buddy boss in a bespoke manor means that having the support there is essential. The Theme + App is a powerful took and the amount of plugins available can lead to some levels of confusion. But not really, with the sheer level of sensational support you get, the ticket system is great and the team that work there are beyond. I have been consistently excited about the product, the roadmap and the ability to make it align to my business and enable my team to leverage it meaningfully. IF I could give buddy boss and the team 100 stars I would, just brilliant!!"
        },
        {
          "Note": 5,
          "Lieu": "EE",
          "Pseudo": "coachme.yoga",
          "Nb_Reviews": 3,
          "Date": "2022-11-07T13:38:21.000Z",
          "Titre": "BuddyBoss is a way of life",
          "Contenu": "When I use BuddyBoss products, I literally feel in every detail, every update, every system feature how much these guys love what they do with all their heart. For them, BuddyBoss is not just a way to make money by providing their services to the market (which is not a bad thing in general), it's their way of life. Very cool, well done! Keep up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward S.",
          "Nb_Reviews": 3,
          "Date": "2023-01-16T00:50:15.000Z",
          "Titre": "There is an extensive Knowledge Base…",
          "Contenu": "There is an extensive Knowledge Base built up over the years that really helps with many of the small problems that may arise.   Again, though.. just sending in a ticket for help results in quick, friendly, and professional assistance.   The Techs really know their stuff are are always willing to help.   This new BuddyBoss is marvelous!  a lot of work has gone into it and it shows.   Well worth the price of admission!   Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Samir",
          "Nb_Reviews": 10,
          "Date": "2022-07-13T21:48:33.000Z",
          "Titre": "BuddyBoss is excellent",
          "Contenu": "BuddyBoss is excellent. Powerful, fast and light weight. You get everything in 2 plugins. The pricing plan is also very good. If you really want plugin all in one for future community websites then I believe Buddyboss is the right choice. It's super easy and simple to install, configure and use. Support is top notch. I could keep counting but you better try it out and see for yourself.The best thing about Buddyboss is that they keep getting better and better, not just in GUI but performance, speed, features and support.I recommend Buddyboss because they are doing their job really good. They know what their clients need and they are providing that to them with each update."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Hendrik",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T10:39:59.000Z",
          "Titre": "Buddyboss is a lifesaver",
          "Contenu": "Buddyboss is a lifesaver. I have no coding experience but with the help of their tutorials and excellent customer services I was able to create a website in 3 weeks. I have only used a limited amount of features they offer so far and can't wait to learn more. Thank you for your support"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Julie Doherty",
          "Nb_Reviews": 4,
          "Date": "2022-10-06T00:42:08.000Z",
          "Titre": "Incorrect Charge to my Account",
          "Contenu": "I had paid for a Lifetime Membership; my yearly reoccurring payment was charged to my account. As soon as I received the receipt of payment email from Buddy Boss, I responded to explain. I received an immediate response and within two days, I was credited the incorrect charge with an explanation of what had happened. I am very happy with Buddy Boss."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2022-10-24T09:49:05.000Z",
          "Titre": "Great Support",
          "Contenu": "Great Support, Buddyboss support team assisted me and stuck with me even with my limited knowledge in the wordpress space to solve an issue that was not a Buddybosss issue and in fact was another legacy plugin conflict with Wordpress erroring instead. I am extremely happy with the swift effect response by support on this. Many thanks"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2022-04-28T10:34:15.880Z",
          "Titre": "Creating a coaching site can be a…",
          "Contenu": "Creating a coaching site can be a hassle, but with BuddyBoss you are on the good site.Setting up your website is amazingly easy - and the best thing: the plugins and theme are always improved - to full satisfaction!Happy to be a BuddyBoss user. You guys rock!"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Marcel Mieszkalski",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T10:32:25.000Z",
          "Titre": "Quick and effective support",
          "Contenu": "Every time I ask for help with a BuddyBoss platform or app, I get a quick and efficient response. You can always count on BuddyBoss support! 🤗I wholeheartedly recommend products from BuddyBoss ❤️"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Jody Sinclair",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T23:02:58.000Z",
          "Titre": "Amazing platform that goes above and…",
          "Contenu": "Amazing platform that goes above and beyond expectations! Really can't short Buddyboss, their product is fantastic and there isn't anything else like it on the market. Great roadmap and their customer support is excellent!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ally",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T22:11:19.000Z",
          "Titre": "Amazing Customer Sevice",
          "Contenu": "I don’t usually write reviews but Buddy Boss has to have some of the best customer service I’ve ever experienced. The Plug-in is fantastic and constantly getting updated, and the Buddy boss team are always happy to help"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "FFO",
          "Nb_Reviews": 2,
          "Date": "2022-05-29T10:29:50.000Z",
          "Titre": "Exceptional!!",
          "Contenu": "Fantastic support. It is really like having a friend and colleague on board your enterprise - you cannot get better than that. Please keep this going, as it is exceptional customer care."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Samir",
          "Nb_Reviews": 10,
          "Date": "2022-12-15T11:31:21.000Z",
          "Titre": "Excellent support as always.Whenever…",
          "Contenu": "Excellent support as always.Whenever and wherever I get some errors on my website caused by me, my team or if caused by something else the BuddyBoss always is there to help and provide support."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "WiredWhite",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T15:55:57.000Z",
          "Titre": "Great Theme and Platform!",
          "Contenu": "We really enjoy using BuddyBoss. The theme looks nice and the platform plugin offers almost everything we need. The support is always very helpful."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "greg carroll",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T23:04:52.000Z",
          "Titre": "I left a 1 star  - now its a 5 star review",
          "Contenu": "As it turns out I left a 1 star review today, and Graham the head of customer service said that they would make everything good. He dealt with the issues and then came across the fact that I was having a delivery issue on my email.So basically Buddybosses slowness was nothing to do with them which was a bit surprising given I have been using them for 18 months. The long an short of it is that all is well and although it turned out to be my email's issue, what was admirable was that Graham focused on making things right and did. No company (or in this case customer) will always get it right but it makes a huge difference when they make the effort to be part of the solution. Great work from the Buddyboss team"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T18:16:25.000Z",
          "Titre": "Before installing BuddyBoss",
          "Contenu": "Before installing BuddyBoss, I used many plugins to support functions to satisfy requirements; however, just BuddyBoss can replace most of them. Then, my plugin list has become concise, and I feel comfortable with it."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Samir",
          "Nb_Reviews": 10,
          "Date": "2022-10-22T23:44:26.000Z",
          "Titre": "BuddyBoss is TOP Notch",
          "Contenu": "BuddyBoss team is always open for new ideas and they implement them really quickly. They provide the help always more than I expected and they keep surprising me with their solutions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corey Cooper",
          "Nb_Reviews": 7,
          "Date": "2023-08-25T06:44:27.000Z",
          "Titre": "Social Media APP & Website Only Possible Through Buddy Boss for non coders like me.  Awesome tech and tech help.",
          "Contenu": "We are launching a new social media site/app and every question or issue we've had the Buddy Boss team has OVER delivered.  The team is amazing and the tech is awesome.  All of the guides help a ton as I am not a coder but was able to build the website and app in no time.  We are happy to be apart of this new type of tech.  Its amazing and our time is excited to grow with Buddy Boss as we grow ourselves.  A#GameChanger"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristiane Schweitzer",
          "Nb_Reviews": 8,
          "Date": "2022-08-16T19:57:50.000Z",
          "Titre": "Awesome Plugin & Service!",
          "Contenu": "BuddyBoss is incredible! Such a great plugin and the customer service is fantastic! I've been with BuddyBoss for over two years and whenever I have a question or an issue the customer service is always eager to help. I really appreciate the attentiveness and patience of the BB reps, considering I'm not a programmer or developer. So awesome!"
        },
        {
          "Note": 5,
          "Lieu": "EE",
          "Pseudo": "coachme.yoga",
          "Nb_Reviews": 3,
          "Date": "2022-09-29T19:20:48.000Z",
          "Titre": "BuddyBoss' high level of technical…",
          "Contenu": "BuddyBoss' high level of technical support inspires confidence in their products and gives me peace of mind. I am confident that I can always reach out and they will simply solve any problem I have. This is very cool. All the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trey",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T17:03:48.000Z",
          "Titre": "Incredible Customer Service",
          "Contenu": "Great user interface, super easy to use and setup, and absolutely incredible customer service! Their customer service will make you feel like you are ordering a Chicken sandwich at Chick-Fil-A!! Seriously could not be more pleased!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Tomas",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T20:35:23.000Z",
          "Titre": "Great experience!",
          "Contenu": "I’ve used BuddyBoss for about two weeks now and so far it’s been a great experience. Their support has been on point, and the product is amazing. I will update this review as time goes on, but so far it’s been top notch."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Maarten",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T16:54:14.000Z",
          "Titre": "Swift response",
          "Contenu": "The response of their tech support is swift and to the point. Issues always get fixed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyler Boudreau",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T23:11:57.000Z",
          "Titre": "I've used 4 competitors. This is the best.",
          "Contenu": "I've helped built a niche community on Drupal. Used Discourse, Mighty Networks and Circle. BuddyBoss blows all of them out of the water. ZERO contest. I'm an so excited to have moved my private community and training to this platform."
        },
        {
          "Note": 5,
          "Lieu": "GE",
          "Pseudo": "Levan",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T19:53:51.000Z",
          "Titre": "I had to make adjustment to the invoice…",
          "Contenu": "I had to make adjustment to the invoice I have received.I had just sent off my support ticket to the BuddyBoss-Team and almost instantly got not only the response, but the invoice as well!I wish everybody had a service like the BuddyBoss-Team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2022-11-06T15:42:17.000Z",
          "Titre": "Tech Support has been great",
          "Contenu": "Tech Support has been great. Any issues I have had they have taken the time to resolve even if it took more time they didnt just give up and continued to look at a way to resolve items. I enjoy the community plugin and product."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Maarten",
          "Nb_Reviews": 6,
          "Date": "2023-09-17T18:14:35.000Z",
          "Titre": "Great support",
          "Contenu": "Great support. Adequate & comprehensive. Never have to wait too long for a reply. Very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Escalle",
          "Nb_Reviews": 6,
          "Date": "2022-10-21T14:49:31.000Z",
          "Titre": "Best customer service after the sale",
          "Contenu": "Best customer service after the sale! Thanks to the team members at BuddyBoss who are making an impact by providing a great platform to grow with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Giuseppe",
          "Nb_Reviews": 4,
          "Date": "2022-11-02T17:07:27.000Z",
          "Titre": "One of the best companies to work with.",
          "Contenu": "Honestly, this is one of the best companies to work with. They keep their customers very aware of what they are working on with their road map, and they have one of the best support teams that I've ever worked with."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tom",
          "Nb_Reviews": 4,
          "Date": "2022-04-29T11:44:13.000Z",
          "Titre": "Platform - Theme 2.0",
          "Contenu": "Last time I reviewed buddyboss as an A star company with a ground braking app setup that allowed customers like myself to create my dream for what I would class as next to nothing compared to Buddyboss's closest competitors and or building natively from scratch (Which I know I have done..).This time I felt Buddyboss was worthy for another review for Theme 2.0. I installed this as soon as I got it and I am extremely impressed, yet again! The look and feel of the designs and the extra features under the hood really give my site a fresh minimal looking design... I definitely feel Buddyboss understands what their customers want and need with the flexibility/customisations they allow for and managed to create another WordPress leading product/plugin. For every new update and every new feature that Buddyboss releases just adds more and more value to my own brand that I built of the back of the Buddyboss platform so I cant wait to see whats next...!A Big Thank You to visionaries and most of all the teams of people that sit in the background and create this!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T02:25:14.000Z",
          "Titre": "Less than a day problem SOLVED!",
          "Contenu": "I had, what to seemed to me, to be a very complex glitch, but the support showed me exactly what to do to fix it and it worked amazingly. To like a few seconds to a minute to complete resolve it. The test to verify the fix took way longer than the actual fix did."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Wybe",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T09:54:14.000Z",
          "Titre": "widget error json",
          "Contenu": "problems on youre site can have multiple causes. BuddyBoss looked at the complete picture and provided a solution"
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Peter",
          "Nb_Reviews": 14,
          "Date": "2022-05-01T11:51:07.000Z",
          "Titre": "BuddyBoss is Cutting Edge",
          "Contenu": "BuddyBoss is cutting edge. The best. Pioneers! Thanks for all that the team do for us. You’re onto something BIG!Would recommend this platform and theme to anyone looking to go deep with their business. So many opportunities. Not as easy or quick as Kajabi or Squarespace… but incomparable. BuddyBoss is an exquisite surface for multiple other integrations and ideas. Your mind and as entrepreneur is the only limitation, as BuddyBoss seamlessly connects with the entire WordPress ecosystem. The sky, really is the limit! And the best bit? BuddyBoss grows WITH you, and releases new features that are robust, cutting-edge, and always beautiful.Thanks! I’ve been with BuddyBoss for two years, and I’ll be with them for the long haul. Thanks again for being an excellent company and to the forward thinking and hardworking management team. We appreciate your work to improve and optimize the system, and build out BuddyBoss with new social features, integrations, and regular and consistent functionality enhancements. BuddyBoss is playing the long game. They care about the quality and presentation of their product, truly! And it shows.Thanks to BuddyBoss and all of the team. 🙌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Z",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T17:17:48.000Z",
          "Titre": "I love BuddyBoss",
          "Contenu": "I just started a web site using buddyboss. Highly recommend the software. Great support and I love their podcast. And we have tons of options for setting up how our site looks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reza",
          "Nb_Reviews": 4,
          "Date": "2022-09-20T19:44:23.000Z",
          "Titre": "Outstanding",
          "Contenu": "Any tickets I have opened with the support team were resolved. I wish other companies had the same customer service as Buddyboss has."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brie Clayton",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T16:45:09.000Z",
          "Titre": "BuddyBoss is willing to help us find and fix issues",
          "Contenu": "BuddyBoss is willing to help us look at issues to determine what is happening, and how we can fix it. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "SMK",
          "Nb_Reviews": 2,
          "Date": "2022-07-20T18:22:28.000Z",
          "Titre": "Just had an issue with a payment made 2…",
          "Contenu": "Just had an issue with a payment made 2 times for the same licence. Buddyboss has been very reactive to answer my request and make the reimbursement."
        },
        {
          "Note": 5,
          "Lieu": "AO",
          "Pseudo": "Jerry",
          "Nb_Reviews": 2,
          "Date": "2023-01-29T20:54:28.000Z",
          "Titre": "Best choice I ever made and what made…",
          "Contenu": "Best choice I ever made and what made me make this choice was that you guys have pay attention and hear our concerns and ideas, to me this means we are gonna grow together, I truly appreciate the buddyboss services!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tye",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T20:11:13.000Z",
          "Titre": "Excellent customer service and tech…",
          "Contenu": "Excellent customer service and tech support. If I didn’t know any better, I would think they were apart of our team."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Deniz Sayman",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T22:09:27.000Z",
          "Titre": "I love my BuddyBoss & Their Great Support",
          "Contenu": "I have switched to BuddyBoss in the beginning of 2023 and I am using it with LearnDash.I switched to this theme because it looks elegant, simple, professional yet fun at the same time.First of all the most important aspect of a company for me is their support. There will always be minor and/or major problems with all software depending on how a person uses it, server configuration etc.The BuddyBoss support has been great so far. They've been very helpful and insightful. I've learned a lot especially from Tom, a member of their customer success team and that eventually increased my conversions and helped me build foundations for the future.BuddyBoss also has an official Facebook Group where all the users and some of the support members & admins connect and share actively. I always find an answer to my questions or problems that would lead me in the right direction.So my experience with them so far has been great.Other great stuff is the BuddyBoss roadmap. They are listening to customers and developing new features or improving existing ones. It's like I'm presenting my customers new features without putting any effort.At first I thought I didn't need the social add-ons but day by day they are becoming more crucial to me and my future plans.Once configured with the necessary server and plugin settings it runs very fast and smooth.I love my BuddyBoss platform, thank you guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janette Braverman",
          "Nb_Reviews": 7,
          "Date": "2023-02-09T08:39:30.000Z",
          "Titre": "Shafin was an amazing representative",
          "Contenu": "Shafin was an amazing representative! So kind, patient and thoughtful. I really needed this great support experience after the past 4 stressful months of settling up my complex environment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T23:36:47.000Z",
          "Titre": "Fast and accurate troubleshooting",
          "Contenu": "Fast and accurate troubleshooting, no guessing, when the cause of an issue is identified, it is fixed or solutions are provided."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "cris williams",
          "Nb_Reviews": 5,
          "Date": "2023-02-06T10:58:38.000Z",
          "Titre": "I like their plugin.",
          "Contenu": "BuddyBoss is a good choise. We have used BuddyBoss plugin app.  I must say that its Very fast &I am very passionate about it. Recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raj M.",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T11:13:53.000Z",
          "Titre": "Great product and customer care",
          "Contenu": "Great product and customer care.   Highly recommended this company and their BuddyBoss theme.  They are very responsive and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenton Rodgers",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T13:17:44.091Z",
          "Titre": "Super Awesome Product",
          "Contenu": "I am very satisfied with the support and product. in fact I'd say i have been blown away. I've not encountered a Wordpress product (with support service to accompany it) that I place at the caliber of Buddyboss.Hat's off to you guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raj M.",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T17:21:30.000Z",
          "Titre": "Their support team is very responsive…",
          "Contenu": "Their support team is very responsive and helpful.  They usually get back to you within a few hours.  Definitely within 24 hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristiane Schweitzer",
          "Nb_Reviews": 8,
          "Date": "2022-05-26T02:04:48.000Z",
          "Titre": "Great Tech Support!",
          "Contenu": "The technical support rep who helped me, Mazharul, was so knowledgeable. Helped me fixed my problem in a timely manner. Such a great company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandip Patel",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T06:37:40.000Z",
          "Titre": "Best Social Networking Platform with great support from technical team",
          "Contenu": "I reviewed several social networking platforms. Buddyboss is one of the top social networking tool with great technical support team ready for you 24X7. Although my several request requires custom work, buddyboss team help me a lot resolving my issue related to customizations. I highly recommend Buddyboss."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tom",
          "Nb_Reviews": 4,
          "Date": "2023-06-07T09:05:56.000Z",
          "Titre": "App Customer from Day 1",
          "Contenu": "Its been over a year since I last left a review for Buddyboss, I have been with them from day 1 which was rocky in the beginning, but I have stuck with them and grown with them, I can honestly say I love the buddyboss web and app more than ever. I use the Web and App in conjunction and due to the product has made my brand noteworthy within my niche. When things don't go as smoothly with the platform support have always done a good job and I am also quite forgiving for the times it does take them slightly longer but I have never experienced a bad service with them. Also I keep in mind that their technology of allowing me to use my wordpress database with a native app opened up the doors for me to start my brand and platform with full control of my data and website with full transparent prices at a fraction of the price of other solutions, which has helped me budget in my business. As Buddyboss are the only ones in their industry that I could find providing this solution I see them as industry leaders. This is all compared to other solutions for me to have an app that ranged from over a hundred thousand building from scratch and other hosted app solutions that up the prices on you depending on what features you want to use and how many customers you get! So a lot to be said for Buddyboss!!!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Kene David Nwosu",
          "Nb_Reviews": 3,
          "Date": "2022-11-08T15:14:52.000Z",
          "Titre": "Fantastic products and support",
          "Contenu": "Excellent products, excellent support, quick turnaround time on debugging requests. I think you should raise your prices!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristiane Schweitzer",
          "Nb_Reviews": 8,
          "Date": "2023-06-10T22:33:25.000Z",
          "Titre": "BuddyBoss Is Always There To Help Me",
          "Contenu": "BuddyBoss is always there to help me. I am not a developer and they have patience with me as I stumble through my tech concerns. They never make me feel like an idiot. Thank you, BB for all you do!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T05:36:45.000Z",
          "Titre": "The best customer service ever…",
          "Contenu": "The great access we have to customer service and the quick response we got to help resolve our issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristiane Schweitzer",
          "Nb_Reviews": 8,
          "Date": "2022-09-18T19:41:27.000Z",
          "Titre": "I appreciate BuddyBoss",
          "Contenu": "I always appreciate the help BuddyBoss tech support gives me. They really want to help me or answer my questions. Very cool."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Leon Staege",
          "Nb_Reviews": 7,
          "Date": "2022-09-29T17:26:56.000Z",
          "Titre": "The help you need in no time",
          "Contenu": "Awesome and quick! It won't take long that you get the most helpful answers from the support!With screenshots, links or screen flows so that you get the help you need in no time :) Thanks Buddyboss I love it."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Fabien",
          "Nb_Reviews": 5,
          "Date": "2023-10-30T14:57:19.000Z",
          "Titre": "Great !",
          "Contenu": "Perfect plate-forme to have a private social network"
        }
      ]
    }
  ]
}