{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "buildbunker.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barnabas Bucao",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T18:13:52.000Z",
          "Titre": "I used Bunker to find the best value…",
          "Contenu": "I used Bunker to find the best value insurance for my business last year. This year I requested a quote for less coverage and was quoted almost double what I paid last year for less coverage. When I questioned them about this, they just said the carrier I used was replaced. I’m sorry but that simply isn’t a good enough answer. On top of that they simply didn’t respond to my emails when I pointed out a massive difference between what I was quoted and what the new carrier came up with. When I called, the guy I spoke with was not accommodating and was not even apparently capable of editing the coverage on the quote. I was able to find a slightly better insurance policy for half the price elsewhere. My advice: go directly to the main carriers they work with who will be more flexible and responsive in customizing quotes or try a different broker altogether."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T18:32:53.000Z",
          "Titre": "Contacting the broker by phone is next…",
          "Contenu": "Contacting the broker by phone is next to impossible, just always leave VM and not getting answers to questions."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick Camm",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T15:31:01.000Z",
          "Titre": "My companies policy had expired and…",
          "Contenu": "My companies policy had expired and Bunker never advised me of this.  My customer notified me that we were in default of our agreement due to this.  Turns out, multiple days after I started trying to run this down, Bunker did an automatic renewal without telling me, or asking me.  You then proceeded to send me a bill.  TERRIBLE CUSTOMER SERVICE!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ravi",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T16:34:39.000Z",
          "Titre": "A simple COI issuance on a new…",
          "Contenu": "A simple COI issuance on a new Additional Insured company should NOT take days and hours. Our previous broker would issue one within minutes if there is no special wording"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NO",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T20:13:15.000Z",
          "Titre": "Did not explain in detail requirements…",
          "Contenu": "Did not explain in detail requirements needed. This resulted in a delay in employment onboarding and multiple rounds back and forth with the insurance company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T20:08:17.000Z",
          "Titre": "No is answering my emails",
          "Contenu": "No is answering my emails.  I have to follow up multiple times. I'm super close to considering using someone else at this point."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jena",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T21:43:59.000Z",
          "Titre": "Long Delays in Adding Coverage",
          "Contenu": "Still waiting on adding hazard insurance to my company policy. Its been 14 days. For Hazard insurance. Support takes 2-3 days to return emails/calls. I'll be moving away from Bunker."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T00:25:48.000Z",
          "Titre": "Technical Problems",
          "Contenu": "Nearly a week after purchasing the policy, several emails to address additional insured, additional payments, and over 35 minutes in queue to speak to someone, I still do not have a correct policy due to 'technical problems' at Bunker. Not likely to happen until next week, which is impacting my ability to be contracted for a significant project. Disappointing to me and to the company wanting to contract my services."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 2,
          "Date": "2022-06-06T04:54:13.000Z",
          "Titre": "Not a fan of Bunker",
          "Contenu": "Not a fan of Bunker.  I will change insurance brokers as soon as i get to it.  My recommendation:  Go elsewhere.  I am not even going to bother to explain my concerns and complaints."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Hardik Bansal",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T12:53:58.000Z",
          "Titre": "Super Slow support",
          "Contenu": "Super Slow support , getting replies by them in a line in 4-5 days that too after hard rigorous follow up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Muhammad",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T17:03:52.000Z",
          "Titre": "Disappointed",
          "Contenu": "Disappointed. Sent two emails to get my COI. No reply at all from support. Even called no one picked up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Von",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T16:02:57.000Z",
          "Titre": "I am trying to get the insurance in my…",
          "Contenu": "I am trying to get the insurance in my Company name and not me individually and seems to be problematic."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allan",
          "Nb_Reviews": 2,
          "Date": "2021-09-22T16:41:33.000Z",
          "Titre": "After payment made, Rep will not answer emails. Really???",
          "Contenu": "I am not thrilled with how hard it is after I paid, to get my rep to respond to my emails. All I am wanting is a copy of my policy info, 3 business days now, 4 messages, no answer. But prior to me signing up and paying, my rep was rapid fire with questions. Now I just want what I paid for....No answer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vivek",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T00:15:00.000Z",
          "Titre": "Insurance",
          "Contenu": "COI not provided on a timely manner."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2020-12-16T15:25:40.000Z",
          "Titre": "Promises Broken",
          "Contenu": "Bunker made several promises regarding delivery of an Insurance Certificate by a specified date and time.  Their date and time.  That time came and went and no Certificate was delievered.  Not getting off to a good start.  After 36+ years in business my expectations of a business partner are simple.  Deliever what you commit to deliver.  Period.  I am not at all interested in false aspirations.  Deliverables and accountability are what matter.  Bunker in my first experience with them FAILED.  -Daniel"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "heredan",
          "Nb_Reviews": 3,
          "Date": "2022-04-21T00:07:21.625Z",
          "Titre": "Got charged after formally requesting…",
          "Contenu": "Got charged after formally requesting to terminate the insurance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ELISE",
          "Nb_Reviews": 1,
          "Date": "2019-08-28T16:54:05.000Z",
          "Titre": "This insurance is basically a rip-off",
          "Contenu": "This insurance is basically a rip-off.  I purchased the insurance because I have a vendor that requires liability insurance with them named as the beneficiary.  I carry liability insurance already - a million dollar policy - and pay $211 per year, because I am low risk.  I am not a mechanic, perform construction, etc.  I am a technical writer.  I also pay $65 per year for helicopter evac in case I get injured when I am out hiking in the middle of nowhere.  In contrast, Bunker charged me $211 for three months of coverage.  This is a scam, but if you have a client who requires liability coverage with them as the beneficiary you don't have a lot of options.  The best thing you can do is charge the client back for the cost and write it off your taxes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T19:30:40.000Z",
          "Titre": "Forced products will always get a 1 star"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2019-11-20T17:54:25.000Z",
          "Titre": "My ability to get jobs got…",
          "Contenu": "My ability to get jobs got ssuspended.Because bunker did not get my info to klick soon enough."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2022-07-23T17:13:58.000Z",
          "Titre": "No customer service"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Balasaheb",
          "Nb_Reviews": 1,
          "Date": "2019-11-21T16:13:26.000Z",
          "Titre": "Didn't get policies yet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:00:24.000Z",
          "Titre": "You send me a quote and it says to call…",
          "Contenu": "You send me a quote and it says to call to pay. When U call you say you only have on line support. Terrible communication. Terrible customer service. Will move to a firm that values their customers and understands that sometimes you need to talk to a live person who know the insurance business. Texting does not work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T19:09:10.000Z",
          "Titre": "Can’t get a hold of anyone on phone",
          "Contenu": "Can’t get a hold of anyone on phone. Only emails which are delayed in response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T16:19:09.000Z",
          "Titre": "Disappointing Service this year",
          "Contenu": "I was not provided with a renewal option until the day after my policy expired. To my knowledge, I still don’t have one yet, 4 days later, even after making payment. I need a COI for a business matter that I’m now delayed for. The service is traditionally superb, but this year renewal has not been reflective of my years of experience with Bunker."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-08-24T17:13:34.000Z",
          "Titre": "Unexplained increases",
          "Contenu": "I have worked with them for over 2 years. This year, I got a dramatic increase in my premium without any context or explanation, as I never submitted a claim. I'm not sure why."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nisha",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T15:41:26.000Z",
          "Titre": "Didn't get much support",
          "Contenu": "Didn't get much support. I had to call multiple times to understand the status of my request..I personally had to go to generate my certificate from Liberty portal..Didn't see mu value in getting this policy from Bunker.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frustrated",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T15:39:11.000Z",
          "Titre": "Customer Service Not What it Used To Be",
          "Contenu": "I've used Bunker for years.  In the past, someone would answer the phone or return calls quickly in order to have a conversation with you allowing you to easily get a policy, renew a policy or have questions answered.  This created a very personal experience and made the customer feel important.This last experience required five days to get my policy reinstated.  When I called and someone answered the call, they advised to send an email instead of attempting to resolve the issue,  If calls were not answered by a human, you could leave a message which was returned four to five hours later or the next day.  If something was done incorrectly and required follow-up, it was another four or five hours for a response.  I don't have five days to wait by my phone for Bunker to return calls.  When a client requires proof of insurance, five days is to long to wait.   It appears that at least some of the staff is very competent and hopefully this is just a temporary manpower shortage that Bunker is correcting.  Bunker needs to get back to the previous level of customer service they provided."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Emma",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T16:41:02.000Z",
          "Titre": "Terrible, Inconsistent, Confusing Communication",
          "Contenu": "I was in a hurry to get insurance sorted out in order to set up a contract. I initially got a quote from Bunker. Then I got a notice that the quote wasn't valid. Then I got a new quote. An employee from Bunker was communicating with me via email, and then abruptly vanished. I followed-up at least 6 times over the course of a week and a half before he finally replied again and sent info about the insurance. It was very bizarre."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sabeeha Nagarwala",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T14:30:20.000Z",
          "Titre": "There was a name change needed on the…",
          "Contenu": "There was a name change needed on the policy and it took a long time to make the change. I’m still getting communication with the incorrect name (including this survey). Very difficult to get a person to talk with. I left multiple voicemails requesting a call back but did not get a call back. Hoping there is better customer service in the future"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Recent User",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T16:44:47.000Z",
          "Titre": "Quotes are not accurate.",
          "Contenu": "The quotes are not accurate.The online quote confirmed and the first email received.Second email comes with the actual price which is 60$ more.Then asked to correct typo in the address.Then the final email came with 20$ more.In the whole process, the coverages are same.It took me 4 days to complete the whole process."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pierre",
          "Nb_Reviews": 1,
          "Date": "2021-08-14T14:14:30.000Z",
          "Titre": "The online subscription process can be…",
          "Contenu": "The online subscription process can be misleading, as there is not step consisting of viewing/confirming the policy before proceeding to the payment. In my case, I ended purchasing the wrong terms, and had to follow-up with an agent afterwards."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 4,
          "Date": "2022-06-08T16:56:10.000Z",
          "Titre": "Under Staffed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T14:04:55.000Z",
          "Titre": "Had to submit the request for coverage…",
          "Contenu": "Had to submit the request for coverage a second time before I recieved a response and had to call 2 times to follow up on initiation of the polcy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2021-09-23T23:06:04.000Z",
          "Titre": "So so experience",
          "Contenu": "So so experience.  Never got through to talk to anyone.  Lines were always busy or no one was available to talk.  Most impersonal."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Umamaheswari",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T19:50:59.000Z",
          "Titre": "Not good experience..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Margaret",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T20:47:03.000Z",
          "Titre": "It was confusing to get two different…",
          "Contenu": "It was confusing to get two different policy quotes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 3,
          "Date": "2023-10-20T21:02:19.000Z",
          "Titre": "I received a strange email after making…",
          "Contenu": "I received a strange email after making payment that seems suspicious.  I have forwarded that to ezpay at usli.com"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AF",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T22:23:21.000Z",
          "Titre": "Payment options",
          "Contenu": "I did not like the lack of on-line information on how to simply pay the premium via check or credit card versus having to use an ACH. When I did call the customer service number, the person was very helpful and did take payment over the phone. Having the ability to pay by credit card without making a call would be beneficial."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rajesh Shah",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T16:48:51.000Z",
          "Titre": "Great Agents, Product / Bad Support",
          "Contenu": "Great agents and product.  Was able to get quotes for what I needed and was easy.  Support / contact experience was bad. Very difficult to get hold of folks, phone system bad, once directed to a wrong department, slow response via email. But once you get to an agent they are great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eliatt",
          "Nb_Reviews": 1,
          "Date": "2022-04-02T19:59:29.000Z",
          "Titre": "Good follow up",
          "Contenu": "It was difficult getting someone to assist me, however once I spoke to the representative he was very good at getting me what I needed. At a time when customer service is vital in competing markets, response time to the client is important. By not having a live person answering the phones, you risk losing potential business from people who do not have time for \"call backs\". Spencer was excellent at getting back to me once I voiced my concerns and reviewed all of my insurance options. It didn't take long for the policy to be in effect and to complete my coverage needs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T01:57:32.000Z",
          "Titre": "Needed just the basic pages that…",
          "Contenu": "Needed just the basic pages that companies I work with need. Just the coverage amounts per event. Was hoping for more help seeing that I'm a new cliant."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T17:08:32.000Z",
          "Titre": "The link to set up the payment wouldn't…",
          "Contenu": "The link to set up the payment wouldn't work and it took over a week to actually purchase the policy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-03-05T17:19:15.000Z",
          "Titre": "Mixed review",
          "Contenu": "The rates were very competitive, but the ability to speak with my agent was very poor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T15:07:15.000Z",
          "Titre": "Not much interaction with Bunker in my…",
          "Contenu": "Not much interaction with Bunker in my transaction."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T23:35:25.000Z",
          "Titre": "My first attempt was unsuccessful",
          "Contenu": "My first attempt was unsuccessful, I called and got phone instructions.Once done, they sent me policy with an incorrect company. I resent the information via email, they made the correction, but again misspelled the company name. I left it as it is for now. Will try another day.They were quick in responding via email, but I still don't have the correct info in my policy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gail",
          "Nb_Reviews": 2,
          "Date": "2020-07-18T19:56:17.000Z",
          "Titre": "I need insurance by Tuesday",
          "Contenu": "I need insurance by Tuesday, 7/21. I applied online. Took me two hours to navigate the website and (I think) I now have the insurance needed. I understand it was a Friday and your people were no longer working when I finished. I hope everything was completed as needed. Insurance was affordable and specific to my need (fractional CEO)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JCB",
          "Nb_Reviews": 1,
          "Date": "2021-06-30T14:25:04.000Z",
          "Titre": "Rates are very reasonable, would appreciate better availability",
          "Contenu": "Rates are very reasonable, I would appreciate faster response to my quote request. Somewhat disappointing hours of operation (only 8A to 5P Central). As a small business owner I would appreciate the opportunity to speak with someone outside of 8-5P."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jeff",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T15:40:14.000Z",
          "Titre": "Website needs work!!",
          "Contenu": "The sign up process was relatively straightforward, but using your website to find and review policies, payments, invoices, etc. is absolutely terrible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AI",
          "Nb_Reviews": 1,
          "Date": "2020-12-19T17:28:37.000Z",
          "Titre": "Need to fix the website so it works",
          "Contenu": "Need to fix the website so it works.  It's never a confident feeling to buy something when they can't even get the website working properly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2019-11-08T15:05:13.000Z",
          "Titre": "File upload of employment history…",
          "Contenu": "File upload of employment history documents did not work for me. Tried multiple browsers and document formats"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SCL",
          "Nb_Reviews": 1,
          "Date": "2020-09-21T02:58:00.000Z",
          "Titre": "All went well except one of the…",
          "Contenu": "All went well except one of the documents did not reflect my change of address. Still working to resolve."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2020-06-09T21:00:30.000Z",
          "Titre": "It was confusing and I had to make …",
          "Contenu": "It was confusing and I had to make  several contacts to complete the transaction."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2020-04-09T15:41:39.000Z",
          "Titre": "unremarkable",
          "Contenu": "nothing special to report"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Mauk",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T03:53:49.000Z",
          "Titre": "Initial quote for general liability…",
          "Contenu": "Good experience overall.Initial quote for general liability came back at a different cost and different provider than I selected. The policy was also incorrect. I had to submit again to get the correct result which took extra days while the consultancy job waited."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John M",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T17:20:20.000Z",
          "Titre": "Had to change carriers",
          "Contenu": "I was given advance notice of my carrier exiting the business insurance space. Bunker worked out an option for me to consider. I was disappointed that I only had one option to consider (and at a much higher annual premium). Communication has been responsive and timely"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MJL",
          "Nb_Reviews": 2,
          "Date": "2021-11-03T14:14:14.000Z",
          "Titre": "Some notes.",
          "Contenu": "This was a pretty smooth process though for someone who doesn't know anything about business insurance I think it would be nice if some more of an explanation from the coordinators on how it works, the premiums, and what happens if you want to cancel, telling me up front rather than me having to ask. For someone like me, I'm not even sure what questions I should be asking so someone to walk me through would have been helpful. Also, a lot of the time it was hard to get someone on the phone when I call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trent",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T19:31:55.000Z",
          "Titre": "The staff was very nice",
          "Contenu": "The staff was very nice. only had one annoyance which caused a lot of lost time- the online application would not work on any of our devices. otherwise, the whole experience was great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2021-11-13T15:48:31.000Z",
          "Titre": "Process Efficient, yet policy issued not what I ordered?",
          "Contenu": "I was able to obtain insurance within a few minutes.  The website and processing was excellent.I gave 4 stars due to a lack of clarity and ability to get in touch with someone.  I selected \"Professional Liability\", NOT \"General Liability\" in my initial selections.  When my insurance was issued, it stated \"General Liability\".  This is not what I wanted.I called and could not get a live person.  Left a message yesterday mid-afternoon and have not heard back from anyone to help me correct this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Monica",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T15:36:10.000Z",
          "Titre": "Good experience overall, but took a little longer than I expected.",
          "Contenu": "Good experience overall, but took a little longer than I expected. I was referred to Bunker by MBO Partners to get required insurance for a contract job. They only provided me one option with one price point, but I guess that is what met the requirement for job. Communication was good and each individual step was quick, but every step was a 24-hour turnaround so the whole thing end to end took me a full week. It was 1 day to ask for a quote, 1 day to get the quote back, 1 day to clarify an item on the quote, 1 day to finalize the quote, 1 day to get the invoice, 1 day to confirm the invoice was paid, 1 day to wait for the insurer to process it, and 1 day to get the final paperwork. I was expecting I could get a quote and purchase insurance instantly within a few days max because it seems like a pretty canned offering. But at least i know I got the right insurance. I would not have worked with Bunker if I wasn't referred and probably wouldn't use them again unless someone recommended I use it for the job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shounak",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T17:04:40.257Z",
          "Titre": "Initially I got a policy quote which I…",
          "Contenu": "Initially I got a policy quote which I was not happy with. I was having problem reaching an agent to talk to.  However, once I got talking to Spencer, he was great.  The policy got issued within hours."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vivek",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T15:19:50.000Z",
          "Titre": "The process was seamless and quick",
          "Contenu": "The process was seamless and quick.  I sent an email asking a clarifying question now about 24 hours ago with no response."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T15:23:12.000Z",
          "Titre": "commitment to resolving customer issues promptly",
          "Contenu": "I recently obtained the Certificate of Liability, while there was a slight delay in receiving it (approximately 1 month), I eventually received it. However, what stood out to me was their prompt response and attention to my concerns. When I reached out to express my dissatisfaction with the delay, their customer service team reacted swiftly and addressed my complaints with utmost professionalism. Despite the initial delay, their responsive approach and willingness to rectify the situation left a positive impression. I appreciate their commitment to resolving customer issues promptly."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "MIRIAM  C.",
          "Nb_Reviews": 2,
          "Date": "2023-07-10T23:36:10.000Z",
          "Titre": "It was easy to communicate",
          "Contenu": "It was easy to communicate, they were fast enough, just a bit unpersonal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T14:50:41.000Z",
          "Titre": "Very easy process once I got someone on…",
          "Contenu": "Very easy process once I got someone on the phone. I did leave a message and no one called back. I had to call again. Otherwise it would have been a 5 star experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "V. Walker",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T22:46:51.000Z",
          "Titre": "The rep",
          "Contenu": "The rep. Good Customer service means a lot & gose a long way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T02:00:59.000Z",
          "Titre": "I appreciate the reminders to renew…",
          "Contenu": "I appreciate the reminders to renew each year.  However I would appreciate even more time to consider the renewal since my professional liability insurance is so expensive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janine",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T22:10:38.000Z",
          "Titre": "My business name needed to be corrected",
          "Contenu": "Thank you for addressing my issue!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GC",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T14:39:32.000Z",
          "Titre": "Only challenge is being on hold for so…",
          "Contenu": "Only challenge is being on hold for so long."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2020-11-04T15:07:30.000Z",
          "Titre": "Everything was fine except that the…",
          "Contenu": "Everything was fine except that the initial response took some time especially since my application got stuck in their system.  They said that they are fixing that.The price was very reasonable.  They have good choices for coverage and the carrier is rated A by AM Best.Definitely would refer a friend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph Parisi",
          "Nb_Reviews": 2,
          "Date": "2019-10-24T16:18:45.000Z",
          "Titre": "Bunker was quite efficient and all…",
          "Contenu": "Bunker was quite efficient and all responses were timely. The only issue I have is not directly with Bunker but will the entire experience including talking to Geico. It seems I could not get any definite answers to questions regarding rental car coverage. I'll have to read the fine print of my policy when I have a bit of time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Menges Design",
          "Nb_Reviews": 1,
          "Date": "2019-07-31T14:21:26.000Z",
          "Titre": "Very glad Bunker is our vendor for…",
          "Contenu": "Very glad Bunker is our vendor for business insurance. Prices are sane, and the option to buy short term insurance engagements is critical to our business. One star removed for less-than-optimal communications from the staff at times. Feels like we don't have someone assigned to us consistently. But other than that, highly recommended."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LM",
          "Nb_Reviews": 1,
          "Date": "2021-05-22T16:54:57.000Z",
          "Titre": "Independent Contractor Insurance",
          "Contenu": "I was fortunate to have been referred to Bunker by an agency to quote on New independent Contractor Insurance. I’d never heard of this requirement to go to work. In providing the Bunker agent my Insurance clause of my contract, she was able to bundle three liabilities required and advised WC was not necessary in my state. A different agency was not as thorough to assist in all aspects of obtaining new insurance which would’ve cost me a significant amount more. Thankful for the referral, the knowledgeable Bunker agent and relieved I shopped three companies and I wasn’t overly insured. Positive experience."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Pawel",
          "Nb_Reviews": 6,
          "Date": "2020-08-11T14:30:49.000Z",
          "Titre": "Fast & Easy",
          "Contenu": "Fast & Easy. However it took a day to add co-insured, even though I requested it right away. Got insurance papers without co-insured first. Then waited over 24 hours to get papers with co-insured. This seems to be standard procedure. Otherwise excellent! And recommended."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T14:25:06.000Z",
          "Titre": "The agents were very responsive and I…",
          "Contenu": "The agents were very responsive and I was able to quickly secure the requisite policies for my business needs.  It's new territory for me, the guys were able to help clarify what was required and why. Definitely would recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2019-09-05T19:30:49.000Z",
          "Titre": "All went fine except I had to ask 3…",
          "Contenu": "All went fine except I had to ask 3 times for the coverage I needed. Seemed like my emails weren't read very carefully. For example, I specified 200,000 liability coverage and received 100,000. It was corrected once I asked, but took longer because of this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Holly",
          "Nb_Reviews": 4,
          "Date": "2020-06-30T18:54:17.000Z",
          "Titre": "Alison was great once I got ahold of…",
          "Contenu": "Alison was great once I got ahold of someone.  Please never send emails on the weekend saying payment did not go thru!! Horrible service as we have updated CC and you only gave us 24 hours and on the weekend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Colin",
          "Nb_Reviews": 1,
          "Date": "2021-01-06T15:12:28.000Z",
          "Titre": "The people from Bunker with whom I've…",
          "Contenu": "The people from Bunker with whom I've communicated have been great, namely Ryne, but the site to upload and communicate wasn't as easy to maneuver. Still overall, vey good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 1,
          "Date": "2019-08-03T16:22:29.000Z",
          "Titre": "I had trouble understanding your…",
          "Contenu": "I had trouble understanding your website to purchase coverage, but your chat person Allison was fabulous.I look forward to receiving my certificate of insurance by email.Thanks,D"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel DeWald",
          "Nb_Reviews": 1,
          "Date": "2020-02-13T17:21:14.000Z",
          "Titre": "Bunker met my expectations",
          "Contenu": "Bunker met my expectations. When- ever I had an issue, customer service resolved it.  The coverage was timely and allowed me to proceed with the proposed project."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ravi Iyer",
          "Nb_Reviews": 3,
          "Date": "2020-07-30T15:46:51.000Z",
          "Titre": "Timely follow-up and prompt execution!",
          "Contenu": "Timely follow-up and prompt execution; I do not do comparison shopping but happy to renew since I like the professional approach and prompt service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cal Safety",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T16:10:32.000Z",
          "Titre": "Good company to deal with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2019-08-25T12:03:03.000Z",
          "Titre": "Bunker is modern and easy",
          "Contenu": "Over all I was happy with the experience. I do however think there should be more detail and access to your policy through the website"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kerry",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T21:46:49.000Z",
          "Titre": "Spencer was very helpful and reassuring"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LaMarr",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T15:17:44.000Z",
          "Titre": "website was easy to use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenny",
          "Nb_Reviews": 1,
          "Date": "2019-10-23T14:07:21.000Z",
          "Titre": "Bunker was very reasonable",
          "Contenu": "Bunker was very reasonable, but mostly made the process easy, friendly and timely. Would recommend them to anyone!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ramon",
          "Nb_Reviews": 1,
          "Date": "2020-04-04T14:40:21.000Z",
          "Titre": "Bunker was able to fulfill my Insurance…",
          "Contenu": "Bunker was able to fulfill my Insurance needs in a fast and efficient way.   Spencer did an outstanding job!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2019-11-26T15:13:36.000Z",
          "Titre": "Extremely easy process to get a quote…",
          "Contenu": "Extremely easy process to get a quote and make purchase. Not much in terms of explanation of plan though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T15:46:11.000Z",
          "Titre": "The process was easy to use and I…",
          "Contenu": "The process was easy to use and I received a policy to review within the time frame described."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2020-12-12T14:13:37.000Z",
          "Titre": "Quick and professional response",
          "Contenu": "Quick and professional response. Good selection of options."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2020-03-07T03:05:25.000Z",
          "Titre": "Simple",
          "Contenu": "Simple, helpful staff to provide my business insurance needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "fei",
          "Nb_Reviews": 2,
          "Date": "2019-07-31T15:30:45.000Z",
          "Titre": "Helpful",
          "Contenu": "The staff was very helpful and response emails quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2020-07-24T14:30:12.000Z",
          "Titre": "Too much paper work but other than that…",
          "Contenu": "Too much paper work but other than that it all good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yorlanda",
          "Nb_Reviews": 1,
          "Date": "2020-09-13T16:57:08.000Z",
          "Titre": "The process was easy",
          "Contenu": "The process was easy. Even saved money. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GCAS, Inc.",
          "Nb_Reviews": 1,
          "Date": "2019-11-12T21:11:18.000Z",
          "Titre": "Dependable",
          "Contenu": "Dependable, Concise and Market Rates."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Letitia",
          "Nb_Reviews": 1,
          "Date": "2020-01-10T21:01:12.000Z",
          "Titre": "Easy process and fast turnaround"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tw",
          "Nb_Reviews": 1,
          "Date": "2020-03-19T14:38:19.000Z",
          "Titre": "Pretty helpful without problems"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 1,
          "Date": "2020-12-16T16:01:20.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, easy and reasonable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sihang",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T20:54:02.000Z",
          "Titre": "Great pricing",
          "Contenu": "Great pricing, slow response."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cheryl",
          "Nb_Reviews": 2,
          "Date": "2019-08-14T04:14:17.000Z",
          "Titre": "Very easy and fast response"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T20:32:57.000Z",
          "Titre": "Good people",
          "Contenu": "Good people.  No issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 1,
          "Date": "2019-08-04T17:03:41.000Z",
          "Titre": "over all it was good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Grant",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T18:43:16.000Z",
          "Titre": "Great service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T16:58:04.000Z",
          "Titre": "great company"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2019-08-15T22:30:57.000Z",
          "Titre": "Great Service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T01:08:20.000Z",
          "Titre": "So slick",
          "Contenu": "So slick. Great value and user experience off rhe charts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Avi",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T17:01:33.000Z",
          "Titre": "Super easy to get small business…",
          "Contenu": "Super easy to get small business insurance. I contacted them with what insurance I needed and in less than a week I was covered. Couldn't have asked for a better experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Makini",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T20:45:03.000Z",
          "Titre": "The agent went above and beyond to help…",
          "Contenu": "The agent went above and beyond to help me with getting me business insurance up and running safely. I would recommend this company for your insurance needs. Bunker has done"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T23:04:03.000Z",
          "Titre": "Proactive customer service",
          "Contenu": "Great customer service.  Super quick response to my question.  Really appreciated the check in and reminder to renew my agreement."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MIKE FABIAN",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T03:49:42.000Z",
          "Titre": "#1~EMILY+BUNKER ==>> CHUBB!!!",
          "Contenu": "Emily @ Bunker was TOPSSS in setting up my renewal & notifying me of the deadline to renew, not to mention she showed exquisite patience with me during this process! I take it that Chubb has been \"handed the ball\", as it were, here in these matters?!...Do trust that Chubb will attain/ preserve the same high standards that Em & Bunker displayed in their high~level service! Thank you ~ grateful, I remain,MIKE"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alin",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T18:57:11.000Z",
          "Titre": "Great experience over years",
          "Contenu": "I have been a customer for a couple of years and the experience has always been great—prompt, anticipative, and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert McKay",
          "Nb_Reviews": 6,
          "Date": "2022-07-12T18:19:22.000Z",
          "Titre": "Bunker has been great",
          "Contenu": "Bunker has been great, very high-touch onboarding experience as long as I stay proactive. They sourced really competitive quotes, went out of their way to fit my idiosyncratic requirements, and saved my contractors a ton of money vs. Thimble or similar. While I haven't really used the platform yet, it's very impressive in the demo and I'm excited to explore how the API can help me automate compliance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vincent Booker",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T19:10:14.000Z",
          "Titre": "I needed insurance for my LLC",
          "Contenu": "I needed insurance for my LLC.  This process was fast and I was quoted a great price for insurance.  I bound the insurance within 24 hours after recieving the quote.  Service and follow-up was excellent.  I would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "gopal khadka",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T20:25:30.000Z",
          "Titre": "Easy to nce charge…",
          "Contenu": "Easy to buy but insurance charge monthly extra 10 dollar processing fee each month this is very bad thing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trent",
          "Nb_Reviews": 3,
          "Date": "2023-05-02T16:27:27.000Z",
          "Titre": "Professional, Responsive and Reasonable",
          "Contenu": "The wedsite was easy to navigate.  I submitted my application smoothly.  Bunker was very responsive and kept me updated throughout each step of the process.  They found an insurer quickly and the rates were reasonable.  When the COI needed to be changed to another company, they did it within 12 hours of the request--fantastic, professional customer experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julia and Antonio Muniz",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T16:50:00.000Z",
          "Titre": "We are extremely satisfied with the…",
          "Contenu": "We are extremely satisfied with the services provided by our account representative.  We couldn't have achieved and completed the process without his guidance and assistance.Thank you once again for the help and support received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracey",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T17:01:35.000Z",
          "Titre": "Very helpful agent Ian Ewers",
          "Contenu": "Very helpful agent Ian Ewers, provided information very quickly, and the quote came through with two options to choose from. The follow up was great, and I am delighted to stay with Bunker."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T18:17:50.000Z",
          "Titre": "Professional team",
          "Contenu": "I had to call several times to get my coverage sorted out and it was so refreshing to have the phone quickly answered by friendly humans who not only helped me efficiently but took time to share jokes. Excellent customer service skills."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miriam",
          "Nb_Reviews": 5,
          "Date": "2022-03-25T14:10:26.000Z",
          "Titre": "Highly recommend them",
          "Contenu": "I had a great experience with my insurance purchase for my business. Spencer my representative went above and beyond to help and guide me through all steps. Thank you very much for making this step easy and smooth for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Serena",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T22:27:19.000Z",
          "Titre": "Great and fast service!",
          "Contenu": "Very responsive and answered questions in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T23:53:28.000Z",
          "Titre": "One less thing to worry about!",
          "Contenu": "Bunker was totally proactive about notifying me of my coming term expiration and the option to automatically renew. Once I responded to go ahead, they took care of the entire renewal process on my behalf, so I didn't have to do a thing. Very easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Venkat",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T15:12:44.000Z",
          "Titre": "Customer service is great",
          "Contenu": "Customer service is great. Customer service rep provided prompt quotes and exactly he knows what my requirements are for the insurance which i requested."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betty",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T17:23:52.000Z",
          "Titre": "Bunker Insurance  Experience",
          "Contenu": "It's been a delight to work with Bunker . They are very responsive . They pick up the phone and answer any questions and they complete every task needed for my liability insurance for my Amazon product ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elise",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T18:21:33.000Z",
          "Titre": "Liability Insurance Made Seamless",
          "Contenu": "The process of getting liability insurance through Bunker was seamless. A quick online survey led to a solid quote...and the follow-up phone call led me to get my insurance in minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thoroughly happy client",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T19:27:12.000Z",
          "Titre": "It is such a pleasure working with an…",
          "Contenu": "It is such a pleasure working with an insurance broker that is on top of their game in every way. Emails responded to within an hour, communicating professionally, documentation requested is received within 24 hours, making my clients very happy with me. We are very happy being a client of Bunker."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert F Hanley Jr",
          "Nb_Reviews": 2,
          "Date": "2022-03-18T19:04:00.000Z",
          "Titre": "This is my second time around with…",
          "Contenu": "This is my second time around with Bunker Insurance. Their prices are fair and their service is excellent. They make business insurance very easy for me, AND I have recommended them to several of my LLC colleagues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 2,
          "Date": "2021-10-22T18:06:53.000Z",
          "Titre": "Excellent service from Stephanie and…",
          "Contenu": "Excellent service from Stephanie and Ryne.  I appreciated that they were able to answer all of my questions and provide the coverage I need.  The best part of this experience was that I was actually able to get Stephanie and Ryne on the phone when I needed them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liliana",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T17:26:39.000Z",
          "Titre": "Bunker was quick and efficient in…",
          "Contenu": "Bunker was quick and efficient in looking for  a lower premium than the one I previously had. They responded to all my emails rapidly and remained in touch with me throughout the process. I had a really positive experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2022-04-02T14:09:53.000Z",
          "Titre": "Polite, professional and efficient.",
          "Contenu": "The turn-around from request for quote to completed deal was super fast -- all in under two hours. Stephanie was polite, professional and efficient. She did a terrific job"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "eprasek",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T17:02:42.000Z",
          "Titre": "Timely service",
          "Contenu": "Timely service, great price, easy to apply for and receive insurance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamara",
          "Nb_Reviews": 2,
          "Date": "2022-10-23T00:16:05.000Z",
          "Titre": "So easy!",
          "Contenu": "Everything was easy and easy to understand. Getting insurance has literally never been so easy! Thank you Bunker! Great customer service and a great service! 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T23:43:38.000Z",
          "Titre": "Great communication",
          "Contenu": "Great communication, great assistance when an adjustment was needed after the fact - made an arduous process SO much easier (and faster)!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T16:49:25.000Z",
          "Titre": "I'm a pretty big fan of Bunker",
          "Contenu": "I'm a pretty big fan of Bunker - I didn't really know what to expect buying my first business policy but Bunker made it a great experience: I got an easy to read general liability policy, responsive customer service, and a competitive premium. All great stuff for my small business"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Che-Min",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T17:54:57.000Z",
          "Titre": "When I asked the staff to help me to…",
          "Contenu": "When I asked the staff to help me to target the insurance,they are very positive  and happy to give  a big assistance,thanks for their service,excellent performence  !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddie",
          "Nb_Reviews": 1,
          "Date": "2022-02-06T00:57:23.000Z",
          "Titre": "Super Easy and Fast",
          "Contenu": "Very easy to apply in the context of an onboarding process and a response with a high value quote within 24 hours.  Execution could not have been simpler."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guy",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T18:32:38.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, prompt, always informative and easy to follow the procedures. Hard to think how you could improve it, other than giving out the insurance for free.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elisabeth",
          "Nb_Reviews": 2,
          "Date": "2023-04-22T17:15:55.000Z",
          "Titre": "Policy Renewal",
          "Contenu": "My experience with the company pertained to policy renewal. As a return policy holder, I appreciate how a reminder was sent for annual renewal time & then again each month when payments are due. Being able to complete the renewal & payments online is convenient and easy to do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ava",
          "Nb_Reviews": 3,
          "Date": "2022-06-23T17:13:07.000Z",
          "Titre": "The Bunker team has been such a help to…",
          "Contenu": "The Bunker team has been such a help to us navigate our insurance needs and manage policies. Responses are timely and the staff is always friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ORLANDO FRANCO",
          "Nb_Reviews": 4,
          "Date": "2022-08-17T20:03:08.000Z",
          "Titre": "Affordable rates for small e-commerce…",
          "Contenu": "Affordable rates for small e-commerce business that fit into my budget.  Professional and fast service on quotes.  Highly recommend to any small businesses who require or want insurance coverage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vinay",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T00:44:03.000Z",
          "Titre": "Very simple process",
          "Contenu": "Very simple process. On time communication and effective communication. All got done in a total of 30 minutes over a period of a few days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Korel",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:32:42.000Z",
          "Titre": "Great Quality of Customer Service",
          "Contenu": "My experience with Bunker is always streamlined and without issue. Great communication and assistance throughout the whole process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carla",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T16:53:22.000Z",
          "Titre": "Patience",
          "Contenu": "My bunker rep was very patient and understanding. He worked to understand my needs and wnsire they were addressed and that I was comfortable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T16:45:37.000Z",
          "Titre": "Consistent and dedicated support",
          "Contenu": "Your company makes the insurance process simple and user friendly.  Thanks for support as always."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MsKP",
          "Nb_Reviews": 2,
          "Date": "2022-07-23T03:04:48.000Z",
          "Titre": "Stephenie is a gem!",
          "Contenu": "Stephenie from Bunker is proactive, professional and really a pleasure to deal with.  She’s made the renewal process quite simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devon",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T14:55:45.000Z",
          "Titre": "Surprisingly easy",
          "Contenu": "Fast. Easy. Extremely convenient for a self employed type who doesn’t have time to deal with business management stuff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cassandra Hall",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T16:53:21.000Z",
          "Titre": "I was very happy with the service that…",
          "Contenu": "I was very happy with the service that I received from Bunker.They work today as a team when I needed something done they took care of it right away,most Insurance agency will said,you need to talk to your agency about your problem.Thank you Banker,Cassandra Hall"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T19:30:59.000Z",
          "Titre": "You resolved my problem",
          "Contenu": "You resolved my problem. My insurance was being cancelled because I lived in Florida. Your representatives took care of it and now my insurance continues in force."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T18:07:05.000Z",
          "Titre": "Easy & Valuable",
          "Contenu": "Bunker's team and process make getting the GL coverage I need so easy, and the policy is a great value for the price paid. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T16:23:07.000Z",
          "Titre": "Bunker is easy.",
          "Contenu": "Bunker has a very easy renewal process that only takes minutes.  They communicate well through the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ava",
          "Nb_Reviews": 3,
          "Date": "2023-08-01T17:32:49.000Z",
          "Titre": "Great team!",
          "Contenu": "I find the Bunker team so easy to communicate with and the service is always timely and accurate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aimee P",
          "Nb_Reviews": 2,
          "Date": "2022-01-01T23:34:11.000Z",
          "Titre": "Bunker got it done!",
          "Contenu": "Bunker was very helpful in securing insurance for my Amazon contract. Both Spencer and Stephanie were responsive and patient as I navigated the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Herb",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T17:45:16.000Z",
          "Titre": "Quick Turnaround. Quality Service.",
          "Contenu": "Bunker provided the appropriate entrée to insurers, and I had a policy within hours. Well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LADY CCB",
          "Nb_Reviews": 3,
          "Date": "2023-04-17T21:30:20.000Z",
          "Titre": "It was easy to get a quote for my…",
          "Contenu": "It was easy to get a quote for my business. It was a very easy process with Bunker just answering a few questions and I received a quote quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stanley",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T20:52:27.000Z",
          "Titre": "Informed staff was able to answer all…",
          "Contenu": "Informed staff was able to answer all my questions and provided clear details regarding relevant options with no push to oversell."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PRASANNA",
          "Nb_Reviews": 2,
          "Date": "2021-12-28T16:38:23.000Z",
          "Titre": "Great customer service",
          "Contenu": "Spencer Galbavy was great, he quickly got back with quotes, followed up on the changed insurance limits from the client and completed the process efficiently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felisa",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T16:12:17.000Z",
          "Titre": "Ease of use and they make the process…",
          "Contenu": "Ease of use and they make the process super easy to cover my business insurance needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EJ",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T17:57:23.000Z",
          "Titre": "The support I've been getting from…",
          "Contenu": "The support I've been getting from Bunker is very impressive.  Very quick and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 2,
          "Date": "2022-09-01T21:52:34.000Z",
          "Titre": "Bunker makes small business insurance easy",
          "Contenu": "Bunker could not make small business insurance any easier or affordable. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "beth",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T23:15:13.000Z",
          "Titre": "Simple solution",
          "Contenu": "Staff were very responsible and helpful.  The process was simple and straightforward.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wasim",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T00:36:06.000Z",
          "Titre": "Smooth online process",
          "Contenu": "Very smooth online process for getting a quote.  Just as easy to buy insurance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T19:17:49.000Z",
          "Titre": "I was impressed by the responsiveness…",
          "Contenu": "I was impressed by the responsiveness of the Bunker team.  Most helpful and efficient.  Kudos."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judith",
          "Nb_Reviews": 2,
          "Date": "2022-08-04T16:20:09.000Z",
          "Titre": "Effortless and efficient means for…",
          "Contenu": "Effortless and efficient means for acquiring a first business insurance policy required by a new client. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joselita",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T23:10:55.000Z",
          "Titre": "Great experience",
          "Contenu": "I received great help with understanding and signing the contract from the person that I spoke with it."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Adalberto",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T17:07:53.000Z",
          "Titre": "Service is excellent",
          "Contenu": "Service is excellent! All my questions are addressed in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 2,
          "Date": "2021-11-15T15:29:40.000Z",
          "Titre": "They Make It Easy",
          "Contenu": "Bunker quickly gathered the coverage I needed for a competitive price - made it easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zahir",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T21:11:11.000Z",
          "Titre": "Easy process",
          "Contenu": "Easy process. Clear and no hidden complications for what can be a complicated topic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T20:43:51.000Z",
          "Titre": "Bunker takes all the hassle out of…",
          "Contenu": "Bunker takes all the hassle out of getting solid coverage VERY quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Stanfield",
          "Nb_Reviews": 2,
          "Date": "2021-12-22T15:21:09.000Z",
          "Titre": "Rapid response and resolution",
          "Contenu": "Rapid response and resolution - the process was easy and I was on my way in minutes. Thanks, Bunker!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AR",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T17:24:30.000Z",
          "Titre": "Bunker Rep Supports Our Business",
          "Contenu": "Our bunker representative looked for the right insurance for our business that also had an affordable price."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Nima Alsamarai",
          "Nb_Reviews": 1,
          "Date": "2021-10-27T08:49:10.000Z",
          "Titre": "Very satisfied with the speedy process",
          "Contenu": "Very satisfied with the speedy process, very professional, trustworthy.I'm glad I found this company.Highly recommended !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jayakiran",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T18:24:02.000Z",
          "Titre": "Awesome company to work with",
          "Contenu": "Awesome company to work with. As soon as I had reached out Bunker made the process easy and seamless. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Azar",
          "Nb_Reviews": 2,
          "Date": "2022-05-24T17:33:05.000Z",
          "Titre": "Team was efficient and thorough",
          "Contenu": "Team was efficient and thorough.  Stayed on top of things.  Responsive.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackson",
          "Nb_Reviews": 1,
          "Date": "2022-03-20T14:05:14.000Z",
          "Titre": "Great customer service",
          "Contenu": "Each experience was awesome from the phone down to the online service it was amazing special thanks to ein and spencer who helped me and made this moment a great and the best professional help I ever received those guys made the process so easy bunker thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelley",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T18:58:14.000Z",
          "Titre": "Prompt and Helpful",
          "Contenu": "I received very prompt service as well as helpful answers to my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mom of 3",
          "Nb_Reviews": 2,
          "Date": "2021-12-23T16:01:26.000Z",
          "Titre": "Easy and Quick",
          "Contenu": "Easy and Quick. I appreciated this for quickly responding to my client.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joy",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T15:42:27.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service! Spencer was quick to respond to my emails. I highly recommend Bunker."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenn Kaye",
          "Nb_Reviews": 2,
          "Date": "2022-04-14T14:23:13.000Z",
          "Titre": "Top Notch Customer Experience",
          "Contenu": "I appreciate Bunker's clear communication from initiation to renewal. They make me feel like a valued customer and I appreciate the ease of use on the website. Their customer experience is top notch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T16:38:56.000Z",
          "Titre": "Bunker team especially Spencer Galbavy…",
          "Contenu": "Bunker team especially Spencer Galbavy are excellent in what they do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 3,
          "Date": "2023-02-04T17:20:18.000Z",
          "Titre": "The company worked very fast and…",
          "Contenu": "The company worked very fast and provided a big and reliable insurance company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T15:59:00.000Z",
          "Titre": "Fast service",
          "Contenu": "The bunker team as always was very responsive to meeting my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Lippolis",
          "Nb_Reviews": 2,
          "Date": "2022-08-12T17:36:43.000Z",
          "Titre": "Quick response",
          "Contenu": "Quick response, shows different options, answers questions. We like them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T14:36:53.000Z",
          "Titre": "Awesome Experience",
          "Contenu": "Quick quote, reasonable price, excellent customer service, and quick payment. 100% LOVED doing business with Bunker."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T17:38:02.000Z",
          "Titre": "Bunker was very responsive in getting…",
          "Contenu": "Bunker was very responsive in getting my insurance set up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanessa Stringer",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T21:27:03.000Z",
          "Titre": "Ciara is very helpful and…",
          "Contenu": "Ciara is very helpful and knowledgeable. I highly recommend her."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T16:46:01.000Z",
          "Titre": "Easy and good customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darrell",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T15:23:00.000Z",
          "Titre": "I requested a Business Liability…",
          "Contenu": "I requested a Business Liability Insurance quote.  That same day got the quote and was able to get insurance within 24 hours of requesting information.  Both Professional and Knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken B",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T15:35:40.000Z",
          "Titre": "Competitive prices",
          "Contenu": "Competitive prices; User friendly website - very easy to shop"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Niwech, DBA, MSc, SCJP, SAFe",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T15:34:40.000Z",
          "Titre": "Fast and affordable coverage in the…",
          "Contenu": "Fast and affordable coverage in the market. Good for small businesses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T23:29:13.000Z",
          "Titre": "Customer service was great and made the…",
          "Contenu": "Customer service was great and made the process very easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 2,
          "Date": "2022-07-09T17:48:31.000Z",
          "Titre": "They have been very helpfull",
          "Contenu": "They have been very helpfull, appreciate all their help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T18:22:39.000Z",
          "Titre": "General Interface",
          "Contenu": "Very easy to work with and straight forward from quote to completion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T23:30:31.000Z",
          "Titre": "I was a little apprehensive about…",
          "Contenu": "I was a little apprehensive about applying for insurance online, however after dealing with Bunker that apprehension disappeared. The experience was outstanding and everyone was very helpful. Turned out to be a wonderful experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2022-03-05T17:20:33.000Z",
          "Titre": "Excellent and quick service",
          "Contenu": "Excellent and quick service.  Very happy to be your customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Good Umana LLC",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T19:27:32.000Z",
          "Titre": "Bunker is so easy to work with and I…",
          "Contenu": "Bunker is so easy to work with and I feel confident my business is insured with Bunker. Thank you to the Bunker team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harve",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T16:34:11.000Z",
          "Titre": "Very easy process that was very…",
          "Contenu": "Very easy process that was very efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Lesko",
          "Nb_Reviews": 2,
          "Date": "2022-07-01T17:52:05.000Z",
          "Titre": "Bunker met all my insurance needs in a…",
          "Contenu": "Bunker met all my insurance needs in a timely manner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rowlett Montessori School",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T17:02:46.000Z",
          "Titre": "The team was Professional in putting up…",
          "Contenu": "The team was Professional in putting up this quote."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T14:10:58.000Z",
          "Titre": "Fast service a d quickly responded to…",
          "Contenu": "Fast service a d quickly responded to changes to my policy I asked for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHN",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T16:09:50.000Z",
          "Titre": "Good service polite and ease of doing…",
          "Contenu": "Good service polite and ease of doing business! Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris from Manhattan",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T15:17:55.000Z",
          "Titre": "Great end to end process and all…",
          "Contenu": "Great end to end process and all digital .No calls Great timelines"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katherine",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T20:43:44.000Z",
          "Titre": "Class act",
          "Contenu": "They are proactive - and great at follow ups."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T17:21:45.000Z",
          "Titre": "It was quick and easy to get my…",
          "Contenu": "It was quick and easy to get my liability insurance started."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 2,
          "Date": "2022-05-26T17:22:29.000Z",
          "Titre": "The entire renewal process was…",
          "Contenu": "The entire renewal process was efficient and professional and Bunker made sure all details were covered and did a great job of communicating."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arbor Roofing",
          "Nb_Reviews": 2,
          "Date": "2021-12-09T19:20:17.000Z",
          "Titre": "5 Star",
          "Contenu": "The team in Bunker is great especially Sarah Griswold."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TASK LLC",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T17:35:04.000Z",
          "Titre": "Was easy and competitive price",
          "Contenu": "Was easy and price was competitive. Customer service was quick and efficient too."
        }
      ]
    }
  ]
}