{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "busykid.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:35:11.000Z",
          "Titre": "Very difficult to navigate app",
          "Contenu": "Very difficult to navigate app. Not what I was looking for. Tried to cancel and was still charged. Very poor experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T14:14:30.000Z",
          "Titre": "This app is a great idea but…",
          "Contenu": "This app is a great idea and my kids quickly like the idea; however, the cards don't work. It's so frustrating and I don't have time to sit on the phone with any type of customer service. I just need things to work, especially when I'm paying for it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Plano Kathy",
          "Nb_Reviews": 10,
          "Date": "2023-10-22T03:11:11.000Z",
          "Titre": "Ghosting",
          "Contenu": "This app was not working out for my kids so I discontinued it a month after signing up. In September of this year I was charged an annual fee on an account that I had closed. I contacted the company but they have ghosted me and did not acknowledge my request for a refund. This shows lack of integrity and very disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T01:19:56.000Z",
          "Titre": "I went in ap to approve payment",
          "Contenu": "I went in ap to approve payment, thinking I'd have the chance to put check marks besides what payments were approved for what child.  Instead, it sent an amount to be paid that was incorrect.  Emailed help desk and called customer service and never got a call back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cara Bunn",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T03:07:00.000Z",
          "Titre": "Save yourself the trouble and don’t use Busy Kids…",
          "Contenu": "The program is great but trying to use the card is horrible. The customer service for the card is horrible. No responses from phone calls to Busy Kids and days before anyone responds to emails. We paid for an annual membership and ended up just losing our money and closing the account because it wasn’t worth the hassle. Super disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melanie Russo",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T02:53:36.000Z",
          "Titre": "\"Disappointed with Busy Kid's Customer Service and Limited Banking Options for Children\"",
          "Contenu": "I was disappointed with the customer service provided by Busy Kid. Despite being initially impressed, I found myself waiting for 10 minutes on a chat queue (#1). As my daughter grew older and I decided to transfer her savings to a traditional bank account, I was informed that this option was not available. Consequently, I now have to incur ATM fees to withdraw her cash and deposit it into a real bank account. I am dissatisfied with the way these situations were handled. While Busy Kid serves as a basic means of monitoring a child's spending, it proves challenging for a responsible child who wishes to progress and transition to the next phase of financial growth."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ChrisC",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T23:27:56.000Z",
          "Titre": "Card, Security Issues and NO response from Customer Services.",
          "Contenu": "We were finding a lot of issues with the Busykid application and card. 1. Card Refusal 2. Being allowed to be used Online purchases from age-restricted sites3. Fee \\ Charges being levied on the Child's account4. No security protocols in place to ensure card security.5. The phone application security can easily be bypassed if you have the correct training. 5. Support for the card and services is terrible; I've waited over a week for a response to an email, and still no reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wanda",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T00:03:58.000Z",
          "Titre": "It has been good, but may be time to move on",
          "Contenu": "Busy Kid is a great application for my daughter who is learning about money, credit, saving, and investing. The customer service part of this company is glitchy and sometimes the card has glitches.  It's important that my daughter is able to use her card when I am not with her and sometimes the site is glitchy and so is customer support."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T23:22:54.000Z",
          "Titre": "Dollar limits = useless app",
          "Contenu": "Pointless dollar limits on every kind of action make the whole thing useless. What a shame.The \"solution\" offered below of dribbling funds from bucket to bucket over time is not convenient or practical. I don't want \"protection\" from myself. I want a functional app. GreenLight.com has no such limits."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T17:10:01.000Z",
          "Titre": "Predatory practices and no Support",
          "Contenu": "It is a really good concept, but the execution is very poor.Support is non existent. I have only one question - instructions on how my kids can login to see their balance.... None of my emails were answered. The chat bot on the website produces only generic answers...Another serious issue - they charge $0.50 for every declined transaction. So, without the ability to see their balance, my kids just keep trying ...We spent probably $60 or more in the last 3-4 months on decline fees. I have a feeling, the company does it on purpose (preventing kids from reviewing their balance and charging outrageously high \"decline fees\"... None other debit or credit cards charge these fees. But this company is hunting our kids for these $0.5)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "K",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T18:11:15.000Z",
          "Titre": "Customer support was very unfriendly…",
          "Contenu": "Customer support was very unfriendly and didn’t seem to care that I was having issues. I was given an answer of “we can unlock your account and you can try again or we can just cancel your account”. I understand there may have only been two options but it was completely unprofessional the way it was presented. I kept getting the same response about my funding account not working but no real help on how to fix it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T03:25:15.000Z",
          "Titre": "haven’t gotten our cards",
          "Contenu": "So far we still haven’t received our ATM cards and it’s been over a four weeks since the first order and now we are still waiting for the second set of cards.  Customer service is responsive but aren’t expediting the process at all and our daughter went to camp without any ATM card.  We are very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erica Baca",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T02:33:53.000Z",
          "Titre": "Hidden Fees",
          "Contenu": "I originally got this app to help my kids make money for their chores but in the last year or two busykids has been adding more and more fees. At this point it’s easier for me to go purchase a visa debit from Walmart and my kids won’t be losing money to these “fees”"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Rogers",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T19:09:12.000Z",
          "Titre": "Clunky, Unintuitive and Delayed...",
          "Contenu": "The interface is incredibly non-intuitive. I think I have approved things or transferred things and it turns out they are \"pending\" for a long, long time.  I just want to be able to get the funds needed to the kids when I want without having to go through some long, cumbersome process."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Johnnie",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T02:14:45.000Z",
          "Titre": "Absolutely the worst company",
          "Contenu": "Absolutely the worst company. I regret getting my kids the cards. Will be canceling when I can and leaving the worst reviews everywhere possible. Customer service is atrocious and rude. They don't have your back with purchases."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "andrea salinas",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T17:50:18.000Z",
          "Titre": "nobody picks up the phone",
          "Contenu": "nobody picks up the phone, only a machine.I already left messages, emails, nobody answers.In the meanwhile they charge me for a renewal that was never authorized.  Their phone number AZ time is only a machine."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Levi Freedman",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T02:14:03.000Z",
          "Titre": "My tweens racked up hundreds upon…",
          "Contenu": "My tweens racked up hundreds upon hundreds of dollars in $0.50 insufficient funds fees because who knows what music & game subscriptions and trials they signed up for continually try to charge their accounts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nunya Famunda",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T04:00:23.000Z",
          "Titre": "My son's card was charged nearly $100…",
          "Contenu": "My son's card was charged nearly $100 in fraud charges. After calling Busykid to remedy the fraudulent charges, they contracted with Cliq to investigate. Months later, Cliq sends a letter stating \"we have thoroughly investigated your claim and determined that no error has occurred.\" We never claimed there was an \"error,\" but rather fraud. And I'd love to know what kind of \"investigation\" was conducted, because we did not make 16 purchases at Apple.com. We will be canceling these cards immediately. Please do yourself a favor and do not do business with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gurvinder",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T06:20:50.000Z",
          "Titre": "No help from the customer care",
          "Contenu": "No help from the customer care. A supervisor with the name CS was the worst customer service representative  I have ever chatted with till date. He was rude and did not deserve to be in customer service at all. I have saved the chat I had with him. The customer service did not had any control in resolving the issue. I wud hv not gone ahead with this if I had not paid for it. Bad exp but still a customer"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T18:46:31.000Z",
          "Titre": "Good service until you need support.",
          "Contenu": "I had been using BusyKids for awhile for my 3 kids and loved it until I needed support. Two of them recently got jobs and no longer needed the card or the chores. I submitted a request to have the two cards cancelled and their accounts as well. Specifically stating only the two and not the third child. The confirmation was only for the two kids and things seemed good. Until a day later when my third child tried to use his card and was declined. Only to find out someone messed up and accidentally cancelled his card too. Wife had to leave work in order to go to my child and pay for his items he needed. Now I’ve cancelled everything with them and won’t use again or recommend.Update 9/15/23: I was contacted with an apology and was considering changing my review until the customer support person suggested for me to change my review in an email. Appears they only cared enough to apologize so that I’d change this review and not about the mistakes and time/embarrassment it caused."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shelima Smith",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T20:26:09.000Z",
          "Titre": "Busy Kids is not a trusted platform",
          "Contenu": "Busy Kids is not a trusted platform. Everything is fine until you encounter a problem. Their customer service number is a dead end. When you call, you will never get a person on the line. It goes straight to prompting you to leave a message or email. No one will ever call you back! When you email them you will hear back the next day, sometimes a few days. You will get very vague convoluted responses. Is this company ran by robots? I wouldn’t recommend Busy Kids."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Edge",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T12:28:48.000Z",
          "Titre": "Not being clear about annual cost",
          "Contenu": "Not being clear about annual cost. Making it hard to contact customer service effectively. Hard to cancel the service. Providing an at best untransparent service to both kids and parents. I had high hopes but am very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg T.",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T12:41:24.000Z",
          "Titre": "High Membership/User Fee",
          "Contenu": "I shouldn’t have to pay such a high fee for my child to hold this card or for replacement cards. The app is bland and there’s no real perk to maintaining this particular card. Will cancel before next renewal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dorothy blair",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T21:46:37.000Z",
          "Titre": "Soon as I linked a bank you closed my…",
          "Contenu": "Soon as I linked a bank you closed my account. I personally think it's bulls that your company gives you the option to link a bank but once you do the account automatically closes. What the f kinda crap is that? I'm one pissed mama and I have one very disappointed daughter. Thanks for nothing, your company false advertise all the companies customers!!! My advice would be Go Henry parents or Greenlight at least they don't say you can do something and then close your account. 5 STARS***** Go Henry/Greenlight 💯 SATISFACTION BUSY KID 💯 MAD AS Hello-o PARENT 🤬DISAPPOINTED CHILD 😭💔😭"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kosaka Ohana",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T23:09:01.000Z",
          "Titre": "First Time Card Use - maybe waive the fee if the pin doesn't work",
          "Contenu": "The first time my son attempted to use his card, the pin did not work. He tried several times and then he was both embarassed and got a fee. He doesn't even want to try to use it again the experience was so bad. I think, truly, it was the fee that put him over the edge towards the negative. On the bright side, it was super easy to change the pin once I called. He still has not tried it again..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "UlyM",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T12:39:40.000Z",
          "Titre": "Closed my sons account an took almost…",
          "Contenu": "Closed my sons account and took almost $200 with it saying since he is a minor there is no refund. I’m trying to get them to return money and reactivate the card. Bizarre. Never again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Good citizen",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T20:02:35.000Z",
          "Titre": "Held up momey",
          "Contenu": "I've repeatedly contacted customer service about adding a funding source but two dozen or so emails later I still have the same issue so now busy kids is saying I owe hundreds of dollars and froze my kids freaking allowance. Why anybody would use this app idk"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 4,
          "Date": "2023-08-14T01:58:09.000Z",
          "Titre": "Can't use the app.",
          "Contenu": "The app isn't even working. Unable to send or transfer money to my kids. Seriously considering canceling the account. Please get the android app fixed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T16:37:53.000Z",
          "Titre": "The money never came off my card",
          "Contenu": "The money never came off my card It was scheduled for the 15th of this month to come off and it wind up saying that it was going to come off the 17th and it never came off and it still wanted to charge me 84 cents each transaction already paid for 3 months so I wouldn't have to pay the change not happy with this busy kid thing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria Brice",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T02:39:02.000Z",
          "Titre": "App not best",
          "Contenu": "App not most user friendly when it comes to loading directly.  If you just do a transfer it splits in the different options.  Also missing alot features in mobile app like set pin or resting so you have to wait on hold to talk someone which is not quick to get thru.  Had issue resolved but no could tell me why card was decline though app said it was active.  They would tell me it active over phone. It's a great concept just not friendly for use.  Maybe after a few more months but given frequency of use makes it hard.  I don't use it every day, it's a tool my kids save money on it and use maybe 1x a month."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Beth Friesen",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T18:08:47.000Z",
          "Titre": "I don’t recommend this company",
          "Contenu": "I don’t recommend this company. They charge excessive fees - NSF even when it’s the vendor who is charging the incorrect amount. For a kids card this is absolutely ridiculous !  In response to the company’s comments, our child did have sufficient funds. Your system is seriously flawed, and blaming customers is unacceptable! Greenlight doesn’t pull this attitude or excessive fees on their customers!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adrienne Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T13:53:44.000Z",
          "Titre": "It is a debit card that won’t take a…",
          "Contenu": "It is a debit card that won’t take a pin and gets denied when money is there then get a fee for trying to run it again when you know money is there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ChristopherM Simpson",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T02:39:17.000Z",
          "Titre": "Your customer service reply time is way…",
          "Contenu": "Your customer service reply time is way too long, when we have a problem it takes days to fix! Half the time the card is not accepted in the platforms my child likes to use"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy Willis",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T03:18:38.000Z",
          "Titre": "BusyKid is not a good service",
          "Contenu": "BusyKid is not a good service, extremely hard to contact support. Transferring money back to your account is not a ray process"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ruth Corlee",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T23:32:25.000Z",
          "Titre": "There's no way to get money off of a…",
          "Contenu": "There's no way to get money off of a spend card. Also, no way to set up weekly chores where the child gets to just do a chore on any day. It has to be on specific days. I asked if my feedback could be submitted for improvement ideas and they said no."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Latoya Morris",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T22:58:32.000Z",
          "Titre": "The fees are unclear",
          "Contenu": "The fees are unclear. We will be leaving busykid. I am extremely irritated at the service amd lack of clarity."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T14:50:50.000Z",
          "Titre": "Think it's kinda shady I get charged…",
          "Contenu": "Think it's kinda shady I get charged for the account before I even received the debit card to use. Still have yet to get the card I ordered over a month ago for my son soo...what's the deal?? I mean $4-$5 a month isn't expensive I'm just not into wasting money for a service I'm not receiving and/or using."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alyssa Garrido",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T02:07:59.000Z",
          "Titre": "I was charged $48 for a subscription…",
          "Contenu": "I was charged $48 for a subscription that I had no idea about!! I was never sent a notification or anything. I never even knew about it when I signed up a year ago."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Enda Cormican",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T02:16:05.000Z",
          "Titre": "The get cash function doesn’t work",
          "Contenu": "The get cash function doesn’t work. You cannot get thru to the phone number. Not for me. I had $1200 at stake and no way I can get on the phone with some one. They can spend a day texting me nonsense but cannot answer a phone for a 5min conversation. I finally had to beg for them to call me. This is simply not good enough, not when there are thousands of dollars at stake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura Poulin",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T02:25:09.000Z",
          "Titre": "I tried to give my grandson $5",
          "Contenu": "I tried to give my grandson $5. Instead it transferred as $500. While it was still pending I tried to contact BusyKid to fix the mistake. No one got back to me and the transaction went thru. All they had to do was answer the phone!  Instead they had me leave a message and they never called back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jamie Lynn",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T01:45:52.000Z",
          "Titre": "Never received card",
          "Contenu": "Signed up for an account on 8/31. Never received the card. Contacted customer service multiple times and finally a new card was ordered around the 18th I believe. As of today, 10/5 I still have not received the new card. I will be canceling my membership and going elsewhere. Hard to believe that 2 cards did not make it to me. I get mail everyday."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T19:52:52.000Z",
          "Titre": "Very restrictive and charges fees",
          "Contenu": "Very restrictive and charges fees. No way to just put money into savings and also no way of transfering money back to parent account. DO not recommend"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Candace “Bugaboo” Harris",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T06:45:08.000Z",
          "Titre": "If I could give 0 starts I would",
          "Contenu": "If I could give 0 starts I would! Do not use this company! It automatically closed my account as soon as I linked my bank account. I had money in my account so I'm not sure why this would happen & I really do not care why. I should've chosen greenlight or gohenry to begin with! My daughter's are so upset. As am I. Don't bother leaving a reply saying \"I'm so sorry for your experience with us. Your account was closed for such and such reason.......\" Save your BS for someone else. I will make sure I let everyone I recommended busy kids to that I was WRONG & to NOT use this company! I'm cancelling my bank card and ordering a new one. It's definitely Suspicious that you close my account soon as I link my bank."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T19:04:47.000Z",
          "Titre": "Set up an account",
          "Contenu": "Set up an account. Paid for it and never received the card. Have call the support number several times and left messages. No one ever responds back. Maybe they will see this and get back with me, otherwise I guess I’m out the $48 they charged me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T01:13:39.000Z",
          "Titre": "Customer service has not been helpful…",
          "Contenu": "Customer service has not been helpful on the past. Service causes interruptions in home network and devices."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T16:48:40.000Z",
          "Titre": "We haven't gotten our card in the mail…",
          "Contenu": "We haven't gotten our card in the mail at all and when I called customer service the lady was extremely rude. I will probably cancel the subscription and find a different company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T17:08:23.000Z",
          "Titre": "I tried setting up BusyKid MANY times…",
          "Contenu": "I tried setting up BusyKid MANY times for SEVERAL weeks... yes, weeks. I added all of my bank information, and it was good for a few days and my kids were so happy to get their cards in the mail. Until... everything fell apart, and my account said set up/payment failed. I emailed and called many, many times, trying to get help. Tried setting my personal checking up once again more than once. Finally, after a lot of time spent trying to figure out what the problem was, a BusyKid representative said they don't \"connect\" or work with my bank. That would have been great information to know weeks before I spent so, so, so much time trying to set everything up over and over again. I would give BusyKids one star or even less."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T05:07:43.000Z",
          "Titre": "I waited almost 6-8 weeks for my sons…",
          "Contenu": "I waited almost 6-8 weeks for my sons card due to card being sent back for whatever reason then when I asked if it could be expedited I was told it would be a 50$ charge so I decided to cancel but my son wanted his card after waiting so long so I asked for account to be reinstated against my better judgement then in the matter of 2 days charges went from 3.99 a month to 50$ annually when actually i should’ve just been grandfathered into the original plan I had ! I did not enjoy my experience at all and it was short lived customer service reps seem very short when a customer is not happy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben Bullock",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T03:21:57.000Z",
          "Titre": "It started good but it’s turned into a…",
          "Contenu": "It started good but it’s turned into a money grab for BusyKid. I would rather give my kids the money than pay the fess. Ther are plenty of other companies that do this for free."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Considine",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T13:32:15.000Z",
          "Titre": "After reporting card stolen and…",
          "Contenu": "After reporting card stolen and requesting a new card. I am still receiving emails on attempts to use the card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T01:40:47.000Z",
          "Titre": "My kids debit cards don’t work",
          "Contenu": "My kids debit cards don’t work, despite sufficient funds. I called customer service to troubleshoot and no one returned my call"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T06:32:00.000Z",
          "Titre": "Rude",
          "Contenu": "I called twice and both representative were rude and not helpful. I asked to speak with a supervisor and was hung up on both times. I will no longer be using this product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lakeisha GreenPetty",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T14:25:37.000Z",
          "Titre": "Cancellation",
          "Contenu": "I had no problem until I cancelled one of my kids card but was charged again for it at the renewal. I called and no one help me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T20:54:47.000Z",
          "Titre": "Not very good at making deposit happen…",
          "Contenu": "Not very good at making deposit happen on time kickback your money to your bank and charge you ridiculous fees"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T18:43:45.000Z",
          "Titre": "Took entirely too long to receive card",
          "Contenu": "Took entirely too long to receive card It has been 4 weeks and nothing.  My husband reached out and got no response"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "No drinks",
          "Nb_Reviews": 3,
          "Date": "2023-08-14T05:53:59.000Z",
          "Titre": "The app does not work well",
          "Contenu": "The app does not work well. When you go to the activity section to do payday- you have to scroll through all of the old dates to get to the current ones. And it’s very slow."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deyon Finnels",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T20:15:06.000Z",
          "Titre": "I've never received my daughter's card…",
          "Contenu": "I've never received my daughter's card but I have been getting charged for it as if I have. It's been a year since I ordered it and haven't heard anything from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T23:22:46.000Z",
          "Titre": "Ordered the card a while ago",
          "Contenu": "Ordered the card a while ago. Still haven’t received it. I will not continue to deposit money into the app with no way to withdraw"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T20:36:39.000Z",
          "Titre": "Closed my account because they said I…",
          "Contenu": "Closed my account because they said I didn't make a payment but they never tried to take it from my account"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-31T01:18:17.000Z",
          "Titre": "It doesn't tell us what is the last…",
          "Contenu": "It doesn't tell us what is the last password we put in so we can't unlock our kids card that's why"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rachel Fields",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T02:31:35.000Z",
          "Titre": "I have been trying to get ahold of…",
          "Contenu": "I have been trying to get ahold of someone to call me. I am getting charged for a card we don’t have and can’t use. Either send me a new card or stop charging me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T02:34:46.000Z",
          "Titre": "Tries to sign up doe the year",
          "Contenu": "Tries to sign up doe the year. Verified my bank account and it won't take my money for my kids ro use. Keeps giving me an error. Tried to use a credit card and debit card and same error. Waste of tim3"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marvin laroda",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T17:10:23.000Z",
          "Titre": "My account closed on me,I was trying…",
          "Contenu": "My account closed on me,I was trying take from my checking account but my money was in my credit account 🙃"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MyMochaFabLife",
          "Nb_Reviews": 5,
          "Date": "2022-11-11T21:26:14.000Z",
          "Titre": "I requested to have my account closed…",
          "Contenu": "I requested to have my account closed for non-use and instead I was charged an annual fee that was refused to be refunded. When I attempted to chat with the company the individual was rude, inattentive and unhelpful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-07-13T20:29:11.000Z",
          "Titre": "Closed my account with no notification",
          "Contenu": "Closed my account with no notification, and I am unsure why. Can't get ahold of customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T15:25:57.000Z",
          "Titre": "When I first got the cards I thought I…",
          "Contenu": "When I first got the cards I thought I could transfer funds from my account to my kids cards and it would be there immediately but you cannot do that and when I realize that I called customer service and no one has yet to respond to me or give me a call back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Krystal Lane",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T20:17:50.000Z",
          "Titre": "Maybe I didn’t understand the…",
          "Contenu": "Maybe I didn’t understand the guidelines but I have literally spent almost $100 put money on and they’ve taken every bit of it are y’all taking every bit of it saying it’s fees and stuff like that my children haven’t received any of the money that I put on their cards it’s crappy this card is crappy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T22:28:53.000Z",
          "Titre": "Still haven’t received card this is…",
          "Contenu": "Still haven’t received card this is disappointing hope it’s not a scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chrystal Meyer",
          "Nb_Reviews": 2,
          "Date": "2022-07-24T03:44:31.000Z",
          "Titre": "Upset",
          "Contenu": "You guys caused my account to go into overdraft I had written you guys and asked you guys cancel sending my cars and to not charge me for anything and you guys still charged me and I got an overdraft charge and I'm in the process of losing my account so I'm very upset about this and I would appreciate if you can refund me anything you've charged me and cancel my account I did indeed contact you guys before the free trial was up please give me a confirmation number that you have credited me and that you cancel my account and possibly even giving me my overdraft fee that I got charged so I can keep my account if not I understand I guess. Hope to hear back from someone soon thanks hope to hear.Chrystal Meyer"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Herb Breiding",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T02:16:43.000Z",
          "Titre": "Cost too much",
          "Contenu": "The cost is too high since my own debit card doesn't cost.  will be canceling."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DavidC",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T06:43:25.000Z",
          "Titre": "To expensive",
          "Contenu": "The option to set chores are great but cost is way to high cash app is way to go"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T18:25:01.000Z",
          "Titre": "I never received my cards and it’s 4…",
          "Contenu": "I never received my cards and it’s 4 days to a month. I cancelled I was very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T18:52:42.000Z",
          "Titre": "Your company won’t allow me to link my…",
          "Contenu": "Your company won’t allow me to link my bank account!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ilegny Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T18:13:40.000Z",
          "Titre": "I would like to close the account",
          "Contenu": "I would like to close the account. Please deposit the money back to my account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T13:05:01.000Z",
          "Titre": "Hi I got the card two weeks ago and I…",
          "Contenu": "Hi I got the card two weeks ago and I can’t put money on he card yet please tell me how to do it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T23:39:57.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible. I will make sure everyone I know knows how terrible this company is"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T18:10:17.000Z",
          "Titre": "I cannot load money onto the card",
          "Contenu": "I cannot load money onto the card. I have emailed to request access, but no response"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T16:16:25.000Z",
          "Titre": "This app is a scam",
          "Contenu": "This app is a scam. Took money right when I put funds. Even tho its only $20 it shows that this app isnt trustworthy. dont register for this app"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Evhen Halynski",
          "Nb_Reviews": 3,
          "Date": "2022-07-17T19:11:30.000Z",
          "Titre": "Can’t contact you",
          "Contenu": "Can’t contact you, can’t transfer money from my bank account to card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T18:24:38.000Z",
          "Titre": "TOO MANY FEES",
          "Contenu": "FEES, FEES, FEESI HATE this card. Paid for the year before I seen there are FEES to add money if not main card. Fee for each transaction. % of purchase fee...HATE THIS CARD"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Judith Santillan",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T02:22:13.000Z",
          "Titre": "Money was withdrawal from my account…",
          "Contenu": "Money was withdrawal from my account without previous notice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T12:02:04.000Z",
          "Titre": "I never received the debit cards"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt Baldwin",
          "Nb_Reviews": 1,
          "Date": "2022-07-02T17:06:23.000Z",
          "Titre": "My son never received the $25 bonus"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-10-10T03:04:34.000Z",
          "Titre": "I was in a lot of hope that I was able…",
          "Contenu": "I was in a lot of hope that I was able to give my great-great-grandson a little credit card to teach him how to spend money and save money but since I purchased this card with your parent is a complete waste of my damn time and I did say damn time cuz I might go old man I can see what I want and what I'm very upset and frustrated the password I really put in it doesn't work y'all have sent me like 20 passwords and they don't work this is all complete waste of time I will give you all a call at some point this week for the last time from that point I'm going to put you out on blast cuz this is so disrespectful to waste my time and waste my hopes for my grandson having his own credit card that was the premise of this whole procedure."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T17:19:08.000Z",
          "Titre": "they closed my kids because we use to…",
          "Contenu": "they closed my kids because we use to much cards like what?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-28T01:12:38.000Z",
          "Titre": "Well I thought it was something good to…",
          "Contenu": "Well I thought it was something good to work with your children teaching them how to use a debit card but apparently I did something wrong before my child even had a chance to use it because my account was closed, but I feel like it's good to help your child use a debit card. No hard feelings I think it's good. I just misinterpreted the wrong thing before I had a chance to understand why my account was closed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristin Carter",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T21:28:18.000Z",
          "Titre": "Awful Company!",
          "Contenu": "After careful consideration I choose to go with this company for a debit card for my son, ordered the card, and then all the sudden they close my account. I hadn’t even received the card in the mail, nor placed any funds in his account. When asking for an explanation, they would not provide one and told me the decision had been made, and they wouldn’t open it back up. Yet they send me emails all day long! Not a good company!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T18:22:18.000Z",
          "Titre": "Tried to steal from me",
          "Contenu": "I opened an account and paid the $4.42 monthly membership fee and ordered the card. About 5 days later they tried to charge my funding source for another $4.42 monthly membership fee as well as a $38.99 annual membership fee. Thankfully I had my bank’s debit card turned off but when the charges didn’t go through they proceeded to close my account for no reason other than that they couldn’t steal from me. I hadn’t even received the card yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Ratcliff",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T23:54:40.000Z",
          "Titre": "Ridiculous I signed up.for this to help…",
          "Contenu": "Ridiculous I signed up.for this to help benefit my child and ask for help 1 time and u say ur closing my acct bc my card won't let me approve chore payment and I can't replace my funding source in app..? I paid a month service already and I literally just activated her card this last Sunday. This is awful customer service. Qe qere owed 25 for a sign up referral bonus and I am so upset with this service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T15:52:56.000Z",
          "Titre": "Still haven't received our cards",
          "Contenu": "I signed up with BusyKid at the beginning of April. I have STILL NOT received my kid's cards. This was the 3rd time that they were supposed to be mailed out. I am quite frustrated. I will say the only positive thing is that the customer service has been good. They have responded to my emails promptly and have stated they would get new cards out. My kids keep asking where their cards are because they have been doing their chores and can't spend their money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dolly Walker",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T19:33:10.000Z",
          "Titre": "Never received the cards I ordered for…",
          "Contenu": "Never received the cards I ordered for my 3 kids"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T18:15:11.000Z",
          "Titre": "Customer caught in the middle",
          "Contenu": "I have had your card for a couple years now. The card expired and every card that I receive which I am on the third card.. I am told it does not work... Between the actual bank and the app... This has all been a nightmare... I just spoke to someone yesterday with three app and I am told again they can not activate three card in the app and that I would need to call the bank yet again and get another card... That is it you win and I give up... I will take my business elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T20:35:08.000Z",
          "Titre": "Horrible company/ Scam",
          "Contenu": "Horrible company. Signed up, paid fee for debit card, activated card, then they closed account. I was never even able to use the account. They never gave me a reason for the account closure. Apparently this in an in-going problem with this company. I would go with other companies like GoHenry, Greenlight, ect."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scotty B",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T23:30:58.000Z",
          "Titre": "I DO NOT recommend this company to…",
          "Contenu": "I DO NOT recommend this company to anyone. If you want a good card for your kids use greenlight or go henry they are excellent with great customer service. BUSY KID IS NOTHING BUT JUNK, THERE A VERY DISHONEST COMPANY WITH FALSE ADVERTISEMENTS!!!***GREENLIGHT IS THE PLACE TO GO****"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-03T10:03:49.000Z",
          "Titre": "I want a refund and to cancel the…",
          "Contenu": "I want a refund and to cancel the subscription because it took out money from my bank account without my approval. I keep asking for my refund and customer service acts like they don't want to refund my money. Also it's not letting me load my kids card anyway. I just want my money back and to cancel. I've been trying to get my refund over a week now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kwm",
          "Nb_Reviews": 2,
          "Date": "2022-05-05T14:10:01.000Z",
          "Titre": "Had an emergency issue with my funding…",
          "Contenu": "Had an emergency issue with my funding source in which was beyond my control and my bank closed my account, i emailed support to let them know and ask if i could cancel that payment and change my funding source and they emailed me back saying because of that they are closing my childs account.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rodney",
          "Nb_Reviews": 2,
          "Date": "2022-04-16T01:03:04.000Z",
          "Titre": "AWFUL!!",
          "Contenu": "AWFUL!!! The customer service is absolutely terrible. Making contact or canceling is a nightmare and don't expect to get your funds back if you cancel. Still trying to get money back in my bank account after canceling the account. Do not do business with this company. If I could give 0 stars I would."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T08:34:50.000Z",
          "Titre": "I needed assistance with changing my…",
          "Contenu": "I needed assistance with changing my bank account, because I accidentally linked the wrong account, and my account was immediately closed down and customer support gave no help to fix the problem.Horrible company... Horrible customer service...Update: my subscription did NOT fail... I had just paid it. It had not been a month yet. And I wanted to change the bank account because I didn't realize which account I had originally linked. Yes it had no funds, that's the reason I wanted to change it. DuhAs you can see, the company tries to cover up its short-comings"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 8,
          "Date": "2022-05-01T05:18:31.000Z",
          "Titre": "They closed my account and then said…",
          "Contenu": "They closed my account and then said cause I asked which I didn't then said I had tried to add money which didn't go through and it was extreme like really it's a joke right when my 50 in reference bonus huh seems. FishyAnd firstly that was someone failed attempt to pay my son's card not me trying to add it. Not to mention your stating false information cause I got emails and screenshots of what I am saying can you show me what your saying cause I been writing support with 50 in referrals that just go away sorry Mike your representative told me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-18T18:51:32.000Z",
          "Titre": "It sucks kids can’t withdraw money they…",
          "Contenu": "It sucks kids can’t withdraw money they have to send money back to the parents and wait for it to post to their account for the parents to give it back to them in cash ….cards can’t be used on cash app or aren’t recognized at some places"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dad",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T22:24:40.000Z",
          "Titre": "The idea is good",
          "Contenu": "The idea is good, but in practice, it can be tedious and our son's pin doesn't work at most places so the card is useless to us and him.  We always end up having to send cash with him in case the card doesn't work with defeats the purpose of having the convenience of the card."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrea Helaine",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T20:02:01.000Z",
          "Titre": "Issues",
          "Contenu": "We have recurring charges that we are not sure where they are from and therefore can't stop them. Fees occur when this happens. There are often times when the card fails to work. The customer service rep subsequently claimed it was my son not knowing how to use a pin or running it wrong. We do know how to use a card, thanks. I'm not satisfied with how this card works, but it helps to be able to put money on their accounts for lunch, grocery pickup, etc.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bruce Hamlett",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T13:47:43.000Z",
          "Titre": "Customer service was unhelpful in…",
          "Contenu": "Customer service was unhelpful in answering my question regarding a replacement card that was taking too long to arrive. The response was simply to wait a few days and then call back. At the very least, the rep could have let me know that the card had shipped and that it should arrive within a few days. It was extremely frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "¯\\_ツ_/¯",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T04:46:33.000Z",
          "Titre": "New platform, new problems",
          "Contenu": "The switch to this new platform, and the annual subscription was not welcome. All (visable) progress with my child's stocks within the app were reset, and those stocks in stockpile are now functionally orphaned because they will need to be sold. As soon as we find a better alternative, we will be moving away from busykid."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa Wood",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T20:17:47.000Z",
          "Titre": "Vendor not being approved and declining transactions",
          "Contenu": "Card was declined with sufficient funds and when I inquired about it I’m told by customer service that vendor “is not compatible with BusyKid”. The vendor was Venmo. How would I know a popular vendor like Venmo would not be compatible ? On top of that we got charged for the decline..although the funds were sufficient."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Leslie Slingsby",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T01:54:07.000Z",
          "Titre": "Upset about the limited options…",
          "Contenu": "Upset about the limited options regarding stocks…that was the advantage of when we purchased.  I will be exploring other options."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen in Seattle",
          "Nb_Reviews": 3,
          "Date": "2023-08-18T03:11:28.000Z",
          "Titre": "Poor service when fraud happens",
          "Contenu": "The difference between my bank card and this card when fraud happens is significant! Once I reported the fraudulent charges I had to file a dispute for each one which took weeks and all that time my son was out the money stolen from him. I suggest looking at other cards."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T23:26:11.000Z",
          "Titre": "There are quite a few improvements that…",
          "Contenu": "There are quite a few improvements that could be made. Investment matching. Credit building and checks. A better dashboard that shows all available tasks including ones that are not for that day (general tasks)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keedran Thorpe",
          "Nb_Reviews": 4,
          "Date": "2023-08-29T16:52:49.000Z",
          "Titre": "Find something else.",
          "Contenu": "This card is a giant pain in the ass.  It never works right, I end up with \"credits\" that should just go back to my payment source that don't.  I think you are basically trying to scam parents.  I just haven't had the time to figure out something better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shawna",
          "Nb_Reviews": 4,
          "Date": "2023-08-29T02:05:59.000Z",
          "Titre": "Not worth the price in my experience",
          "Contenu": "Not worth the price in my experience. When my daughter would go to use it, it got rejected more often than not (even while using the correct card)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susan Pritko",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T20:23:10.000Z",
          "Titre": "Fee to transfer money is very high"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eli",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T03:57:24.000Z",
          "Titre": "Too many changes in terms and pricing",
          "Contenu": "Too many changes in terms and pricing. Increases in prices then told you get a locked on price then it changed again. Very frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gloria",
          "Nb_Reviews": 3,
          "Date": "2023-08-18T04:27:11.000Z",
          "Titre": "Different amounts charged",
          "Contenu": "Called re: a charge that differed from the actual cost. Representative unable to answer the questions was like he was reading a script and not hearing any of the questions"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Martina Smith",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T08:29:40.000Z",
          "Titre": "I was intending to switch my grandson…",
          "Contenu": "I was intending to switch my grandson to Capital One before I incurred the fee. Your card is too fee laden, and this is my last year with you all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah Dancer",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T15:26:19.000Z",
          "Titre": "card hard to use",
          "Contenu": "card hard to use my children are not allowed to use their card at certain shops even though there is money in their account. It is very embarrassing to have your card declined when you knowly have money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica Kopec",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T03:01:27.000Z",
          "Titre": "Transferring money off card",
          "Contenu": "Once the money is transferred to the card it is too difficult to get back. You have to either spend it or withdraw it. I should be able to transfer it back to the child’s or parents account. The card and the account are too separate…need to do a better job linking them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie Donahue",
          "Nb_Reviews": 3,
          "Date": "2023-04-30T09:41:15.000Z",
          "Titre": "I have had such a horrible experience…",
          "Contenu": "I have had such a horrible experience with customer support. When I received the cards. They were not the cards I ordered and when I sent money using the bonus  option My children card kept declining. I notified customer support let my name and number. This company never called me back but instead sent a email stating the card worked. I emailed over 6 times before they resolved the issues"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Celeste",
          "Nb_Reviews": 2,
          "Date": "2022-08-15T04:19:12.000Z",
          "Titre": "WHY MONTHLY FEE?",
          "Contenu": "WHY THE MONTHLY FEE? I SERIOUSLY HAD TO SEE PROS AND CONS MYSELF. LOTS OF OTHER COMPANIES OFFER NO INTEREST, NO FEES, UNLIMITED TRANSFERS AND STILL OFFER CASH BACK OF 5%. ITS TOO SOON TO TELL WHAT MAKES BUSYKID STAND APART FROM THEIR COMPETITION."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T00:17:59.000Z",
          "Titre": "My child never received the card…",
          "Contenu": "My account was never properly verified SO money was pulled from my account  and put on child's card..But child NEVER RECEIVED THE CARD. I had to cancel account due to unresolved issue. Could not SPEAK to anyone; Only Email back and forth. Finally TALKED TO TRUIST BANK who put a stop on the account since I did not receive the child's debit card  from busykids. They could not ever resolve this but DID FIND A WAY TO CHARGE ME (?)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Toni King",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T17:31:53.000Z",
          "Titre": "It’s difficult to reach an actual…",
          "Contenu": "It’s difficult to reach an actual person. I’ll have to check to confirm the actual date"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "P Duncan",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T02:13:56.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "I have been with busy kids for over a year.  Things were going well until recently at least twice when I have transferred money to one of my kids accounts (I have 2 kids on the account) it double charged me.  I tried reaching out today and they refuse to give me a call to discuss.  They will only email and Cindy continues to say it’s because one of my kids have the same pin and maybe she sent money to herself be mistake.   This makes no sense with when the transactions happen only when I transfer the money and it always immediately a double transaction (same amount of money twice at the same time)!  I have requested a call back but they only keep emailing me.  Then they tell the transactions are coming from my home address every time when I did my last transaction while at my work address and no one was home at the time.  Either their system needs updating or something is not right with their app.  This is frustrating and I’m thinking it’s time to look elsewhere!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Desi Degollado",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T02:00:33.000Z",
          "Titre": "Need more simplicity",
          "Contenu": "I’ve been having trouble figuring things out. Like loading money to the spend account. Having trouble with my daughter using the pin. I feel like it needs a little more work. Simplicity"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eddie H",
          "Nb_Reviews": 1,
          "Date": "2022-09-18T21:25:23.000Z",
          "Titre": "This card is very confusing",
          "Contenu": "This card is very confusing. I am sure it will work when we figure it out, But it has been trial and error. My son has had his card declined multiple times due to invalid pin. One was set, but may not be the pin that is requested? Like I said we are learning by trail and error. I have read the FAQ, but doesn't really explain our situation. The icing on the cake, we are getting charged every time the pin is wrong. Our education is now coming at a price and... no one to talk to."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elisha Nitschke",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T05:05:14.000Z",
          "Titre": "Card rarely works",
          "Contenu": "Card rarely works, we have to email asking why.  Again our Daughter tried to use her card twice this week and it dod not work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brandie H",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T23:35:17.000Z",
          "Titre": "LOAD CARD ERROR",
          "Contenu": "The app would not allow the transfer from SPEND to LOAD CARD. Also, the pin number does not work on the card. This has not been a positive experience so far."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer breugnot",
          "Nb_Reviews": 3,
          "Date": "2023-07-19T22:52:28.000Z",
          "Titre": "not worth it",
          "Contenu": "not worth itI do not find this app user friendly at all. My son didn’t know his pin and because he tried several times they charged us a fee."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-26T16:39:07.000Z",
          "Titre": "Initially ordered 2 cards for my grand…",
          "Contenu": "Initially ordered 2 cards for my grand boys 11/27 so they would be here for  ChristmasAfter 15 days had to call and reorder cards to be mailedFinally got them Christmas Eve and Boys were out of tien"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T15:05:25.000Z",
          "Titre": "We haven’t received her new card yet-…",
          "Contenu": "We haven’t received her new card yet- even though you have the same address on file that we’ve used for 2 years."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mom",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T01:56:49.000Z",
          "Titre": "You are charging too much for…",
          "Contenu": "You are charging too much for overdrafts!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julia Scott",
          "Nb_Reviews": 4,
          "Date": "2022-03-06T03:01:24.000Z",
          "Titre": "Owner Did nothing To Improve The app I lost money",
          "Contenu": "I'm glad That The Owner Awnsered But He didn't Say He was adding The Notification Like what I Think MY Son Was not The problem It was me But Also The app Should have told me I shouldNot Have to repeat Telling them That I have done This Aagain Now I Lost $20 Im Going To Stop Using This app IF Further looked into it is not done I'll remind My freinds To Quit using this app!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T17:53:14.000Z",
          "Titre": "Issues with Card...not using app yet.",
          "Contenu": "The concept of BusyKid is great. However, it took over a month to receive the card for my son, and within a couple of weeks (before I had even given it to him), I received an email saying there would be a new card servicer/issuer and to keep an eye out for the new card. Still no new card, and I paid for the annual subscription 2 months ago. We haven't even gotten to use the app and frankly I'm hesitant to even start now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julia Scott",
          "Nb_Reviews": 4,
          "Date": "2022-03-03T01:27:18.000Z",
          "Titre": "My child spent more than he had",
          "Contenu": "My son Was using Busykid And he says chores Done donated all to charity So sweet :D But then I realize he Spent more money then I have! He Donated $80 Dollars My account Has $73 I think I should know if I have enough money for him to make and it should say Something like ( Uh oh Not enough money Cant do that ) But No So MY bank calls me Saying You have -7 dollars And MY cards Being Canceled do to *glitching* He clicked Pay for So many Times After it said ( Not enough money) Because it looked like enough money to him That it Allowed him and went through MY cards being cancelled Now Besides that Good app"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2021-07-24T22:33:26.000Z",
          "Titre": "Over a month, no card",
          "Contenu": "This seems like a great concept and the app is easy to use, but I ordered the card over a month ago and haven't received it yet.  Sent an email to the busykids help email, and no response. Checked my inbox and junk mail, and no correspondence regarding my card, just ads and requests for ratings."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard and Kathy Bachman",
          "Nb_Reviews": 1,
          "Date": "2021-08-19T05:10:10.000Z",
          "Titre": "We have not been able to use the cards",
          "Contenu": "We have not been able to use the cards. Every time my daughter tries to use it. It says wrong password. And it’s not the wrong password. I have even tried it. Getting frustrated with it. And i have referred so many people to this because of the concept. But now i may be getting rid of it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "carterlynn",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T12:31:30.000Z",
          "Titre": "I think the idea is great and we were…",
          "Contenu": "I think the idea is great and we were excited to receive the card. However, it arrived with my social security number printed in place of my kid's last name. Customer service didn't understand how that could happen so I got routed to another department. I am now waiting on a new card and if there are hidden fees or some such thing, I'll give up on it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allison Radford",
          "Nb_Reviews": 3,
          "Date": "2020-05-27T18:47:10.000Z",
          "Titre": "Parents get charged for each credit…",
          "Contenu": "Parents get charged for each credit card transaction to pay kids, unless you use a bank account. They want your user name, password and PIN. No way! To pay out on the savings, they will simply put $ back on the credit card you used and then you pay your kids cash. Setting up chores is not that intuitive first time around. Also, previously documented chores are not saved in drop downs. You have to recreate it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rachel Hoffman",
          "Nb_Reviews": 2,
          "Date": "2020-05-27T19:29:53.000Z",
          "Titre": "The app is poorly organized and…",
          "Contenu": "The app is poorly organized and sometimes confusing, particularly the delegation and scheduling of chores. The spend/save/invest feature should be easier to adjust and the ability to adjust the ratios of spending to saving and investing should be adjustable, easily, from the main home screen. Too.many fees and cards should be customizable if they are priced the way they are."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Natalie",
          "Nb_Reviews": 2,
          "Date": "2020-10-26T18:37:19.000Z",
          "Titre": "Easy to Give Money, Impossible to Spend It",
          "Contenu": "Each time my kid has tried to use the debit card, it is declined. This is very frustrating because the whole point was for us to not have to have cash around. So instead we just have unusable money sitting in an account that we can't access. There is no info about this in the FAQs or anywhere else, as far as I can tell."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Benson",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T02:37:24.000Z",
          "Titre": "Should not charge for declines",
          "Contenu": "Devv can liner fees are done wrong."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GEM",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T21:35:55.000Z",
          "Titre": "What's the point of paying if you don't get the card?",
          "Contenu": "The biggest thing that drew us to this app was the debit card that the child can use. However, we still haven't received the card and have no idea when/if it will actually get delivered. It's been almost 2 weeks and we are still waiting. Since we do not have the card and I'm afraid of it getting lost/stolen, I'm not moving money onto it. Which means we aren't using the full features of the app so I'm feeling like paying for it was a waste. Wish we had just stayed with the free version."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jenny Richter",
          "Nb_Reviews": 1,
          "Date": "2020-06-26T00:07:09.000Z",
          "Titre": "Funds did not load onto the card we are…",
          "Contenu": "Funds did not load onto the card initially, there was a lengthy procedure to add funds to the card. I did a lot of research on this and similar cards before buying and I didn’t come across the procedure to add funds in my research and I didn’t see it included in the info that came with the card. There were also hidden fees for loading the card that weren’t clear up front. Busykid was responsive to my complaint but I can’t say I’d recommend this card based on these experiences."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carly Barone",
          "Nb_Reviews": 1,
          "Date": "2020-11-27T23:59:29.000Z",
          "Titre": "Hidden Fees and recurring charges",
          "Contenu": "The app is good. Works great, but it charged me a recurring payment for a bonus that I sent my daughter. It also doesn't tell you about the fee it charges you to send the money to the card. It may be a small fee of like 50 or 75 cents but I'd like to know all of that before I signed up for it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Natalie Floyd",
          "Nb_Reviews": 2,
          "Date": "2020-05-28T20:51:45.000Z",
          "Titre": "App is fine, wouldn't recommend the credit card",
          "Contenu": "The app is fine, could use some updates to make it easier to assign and delegate chores. I'd like it if someone marks the chore as done that it doesn't show as an option to other kids. Their credit card is also questionable, my daughter has made a few returns that haven't been returned to the card."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "HeidiB",
          "Nb_Reviews": 4,
          "Date": "2021-11-23T14:43:21.000Z",
          "Titre": "I have not seen any reimbursement for…",
          "Contenu": "I have not seen any reimbursement for the additional card that I got and the card that I did receive has it printing and a logo on it that is nothing like the picture showed. It's barely legible. The other thing that would be nice on this which is something that multiple other companies do is to have a photo of the child on the card. I want hundred percent got the runaround from this company and the company that provides the actual cards because nobody knew who should be helping me out which made it so I had to write and respond to multiple other emails. It just became a hassle hey and I do like the program but this was kind of a mess. Yet"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Paula Bielecki",
          "Nb_Reviews": 13,
          "Date": "2020-05-31T18:27:05.000Z",
          "Titre": "My kids have lost interest in marking…",
          "Contenu": "My kids have lost interest in marking and I find it frustrating not being able to always get the payments made as quickly as I would expect.  Its hard to navigate.  If I hadn't already paid for the visa cards and didn't know how to use them without the app I probably wouldn't be using it still"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Liza Window",
          "Nb_Reviews": 1,
          "Date": "2020-07-10T00:10:28.000Z",
          "Titre": "Good idea in theory but the execution…",
          "Contenu": "Good idea in theory but the execution is flawed. Some things just don’t work and getting in touch with someone to help is nearly impossible. Can’t see the bank account as an option to load card. Just a really bad Ux and needs some more testing because many functions just don’t work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer not sure",
          "Nb_Reviews": 1,
          "Date": "2021-11-22T15:40:13.000Z",
          "Titre": "Can't give a raving review because we…",
          "Contenu": "Can't give a raving review because we haven't received our cards, almost 2 months later. But you have been great about spamming me with information on how to use a card that we don't  have or requesting feedback."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Gurley",
          "Nb_Reviews": 2,
          "Date": "2020-05-27T20:25:29.000Z",
          "Titre": "Web interface is useless",
          "Contenu": "Web interface is useless. Phone interface is incomplete. They know this is a problem... this is a complicated solution to try to shove into a phone interface but they are hanging on by their fingernails with the attitude of we...must...make...this...fit.... you end up with features that you just can't find a second time and are nonsensical... why, because it is 23 clicks OVER THERE... if they'd just break down and let my computer with my massive screen maintain the data there, I could have lots of options and type much faster than with my thumbs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Martha Flores-Olivas",
          "Nb_Reviews": 1,
          "Date": "2021-01-24T16:33:23.000Z",
          "Titre": "I used the app to track chores and…",
          "Contenu": "I used the app to track chores and dollar value. I did use it to transfer funds because it was cumbersome to figure out how to. I had to email for instructions. Still after that I was a bit lost. I since stopped using the app & found another one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Parker",
          "Nb_Reviews": 2,
          "Date": "2020-08-01T18:58:44.000Z",
          "Titre": "I loved the idea of this but not user…",
          "Contenu": "I loved the idea of this but not user friendly at all.  Spent 3 days trying to get card loaded the 1st week b4 I had to call customer service.  He loaded it for me but when the 2nd week rolled around I was stuck again.  Not worth all the time to figure things out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stevi Shepherd",
          "Nb_Reviews": 1,
          "Date": "2020-05-28T02:37:04.000Z",
          "Titre": "I don’t like the fact that if I move…",
          "Contenu": "I don’t like the fact that if I move money from the save or share accounts that it has to go back to my account to be put back on the card. Also I don’t like that when I put the allowance on the card none of it goes to the spend side of the card"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MM",
          "Nb_Reviews": 1,
          "Date": "2021-08-20T22:38:24.000Z",
          "Titre": "I still haven't received the debit…",
          "Contenu": "I still haven't received the debit card, so the whole process has been slow for our family to get started. I also had trouble linking my bank account, so overall not too impressed with this service thus far."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Blackman",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T16:10:34.000Z",
          "Titre": "The card is an amazing teaching tool",
          "Contenu": "The card is an amazing teaching tool; however you have to go through several vendors just to have a question answered. In addition, when they finally get you to the correct vendor (question not answered)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Courtney",
          "Nb_Reviews": 2,
          "Date": "2021-03-21T03:08:40.000Z",
          "Titre": "Sad child",
          "Contenu": "My daughter went to use her debit card for the first time and it was declined. She only purchased a $3.69 item and was super sad it didn’t work. We activated the card, so their should be no reason for this"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T13:13:32.000Z",
          "Titre": "Did not receive the card"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack Godwin",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T20:09:56.000Z",
          "Titre": "Not as good as it sounds",
          "Contenu": "One of the cards I ordered didn’t show.  The hidden fees on the card are stupid. $0.50 for debit and $0.50 for declines, you’re stealing money from kids.  Will likely switch to a regular bank card."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angela Hahn",
          "Nb_Reviews": 1,
          "Date": "2020-05-27T21:16:21.000Z",
          "Titre": "A lot of fees associated with this",
          "Contenu": "A lot of fees associated with this- I get it- how does busy kid make money without fees- but there are other apps to track it and then you can simply pay your kiddo- there is a fee with everything"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer Self",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T13:24:35.000Z",
          "Titre": "Its all very confusing",
          "Contenu": "Its all very confusing for both of us. Where do I load money? Where does it go? If he wants to spend it, where does it need to be? There are so many apps better than this one"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rachel Morrison",
          "Nb_Reviews": 3,
          "Date": "2020-08-20T00:02:44.000Z",
          "Titre": "Poor customer service from BusyKid",
          "Contenu": "When calling when calling BusyKid customer service for help it took way too long for me to get through to an actual person and I had to send numerous emails to get a response - not good!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Review er",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T00:15:42.000Z",
          "Titre": "Just let Down",
          "Contenu": "There is a lot about the app that should be more up front.  Cannot transfer funds to my own account (investment)Cannot set up my own charityGood for chores and that is about it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-07-17T16:41:58.000Z",
          "Titre": "I love and hate this....",
          "Contenu": "I love the fact that my kids have their own card and that we receive them quickly thank you.But what I dont like is how when ever I do any transaction anywhere the money comes out or loads asap this takes forever i paid my kids early this morning think they would have there money they called i checked it's still pending i absolutely dont like that at all but I'll find them another card company that loads instantly I dont like pending that means that it wont be until tomorrow and they had plans today I'm uo set now I have to leave my home get cash from the atm and then meet up with my children this is highly upsetting to me but thank you anyways they were excited to get there cards I'll see if we can load them in the store if that's faster I'll keep the cards"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tiffany Barber",
          "Nb_Reviews": 1,
          "Date": "2020-07-19T23:24:14.000Z",
          "Titre": "I was excited to use this app to help…",
          "Contenu": "I was excited to use this app to help my children to learn about money.  I have had a hard time being able to donate the money my child wanted to donate and it is discouraging me.  When I give my permission to  allow my children to donate to a charity I shouldn't have to make the donation.  It should be taken care of by the app.  I like the way they have the stock set up that you click on it and the kid has the stock.  That was also a challenge to get set up and I accidentally sent $10 to the stock site from my child's busy kid debit card by mistake but I figured out how to do it right eventually.  The app needs to have better step by step instructions.  I'm going to continue to try and use this app mostly because I have already spent the money to get my children their debit cards and because they are excited about it.  I hope that it gets easier to use as I go along."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Haley Sitton",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T23:47:30.000Z",
          "Titre": "I'm giving this 2 stars.....",
          "Contenu": "I'm giving this 2 stars because my money was approved by my parent and I still haven't gotten anything and its been over 24 hours now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melinda Justice",
          "Nb_Reviews": 1,
          "Date": "2020-07-19T21:47:43.000Z",
          "Titre": "Who's fault is it really??",
          "Contenu": "Ok, I guess I should not be surprised by doing something online that sounds to good to be true! I received the card and wouldn't you know I encountered issues from the beginning! You always have to use the pin you set up to move around the account, so when I got the card, I immediately put in my number and come to find out it was the last four of the card! I had even tried my last four of my social. Nope it's the last four of the actual card! This of course put us into being blocked! So you'd think to call the number for help right?  Nope! You have to send an email to busy kids for help. How often do THOSE get answered quickly?! Sorry, this was mainly my fault, but I need to vent! So again, I've learned folks that we really don't get things for free and things really aren't easy!!😉😜 So now we're waiting again! At least it's teaching her one thing. Patience! Maybe not me, but her! 😂😂"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Moyer",
          "Nb_Reviews": 1,
          "Date": "2020-06-14T15:38:41.000Z",
          "Titre": "The Busy Kid card cannot be added to Apple Pay",
          "Contenu": "The Busy Kid card cannot be added to Apple Pay which is a real issue since my kids like to use some of their allowance for iPhone games."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "La Sharon Adkins",
          "Nb_Reviews": 1,
          "Date": "2020-10-17T15:02:23.000Z",
          "Titre": "Inconvenient and slow to communicate",
          "Contenu": "I ordered 3 cards for each of my children. I found it a bit inconvenient that the card issuer's customer service couldn't assist me with activating all 3 cards at once because you can only use the automated system. So, I had to hang up and call back 3 more times in order to activate each card.Not to mention it's been over 12 hrs. And I am still unable to unlock the activated cards in the app to get started. It's also annoying that communication with busykid is through email only  and once you get a response they will most likely not be able to assist you but refer you to the card issuer who has a limited function. Also, Im not sure how the kids login to there accounts to view balances because I am unable to unlock each card... I was interested in Greenlight for the kids but chose Busykid because the fees were less and the feature of donating to charities etc. is a great idea. But, at this point Im unsure how its going to work out because I am currently in the sunken place with the app."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ramneet Virk",
          "Nb_Reviews": 1,
          "Date": "2020-10-21T01:01:49.000Z",
          "Titre": "The automatic allowance only works for…",
          "Contenu": "The automatic allowance only works for the one and not for the other one. I have to do a bonus transfer on every 1st and 15th."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michelle Ramos",
          "Nb_Reviews": 1,
          "Date": "2020-09-01T17:59:04.000Z",
          "Titre": "Can't really review yet",
          "Contenu": "I have not received the cards yet, 16days, some I am not able to review yet, I will give actual review when I start using it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Hinton",
          "Nb_Reviews": 1,
          "Date": "2020-05-28T00:17:02.000Z",
          "Titre": "Not as great as I thought it would be…",
          "Contenu": "Not as great as I thought it would be ..had issues customer service took forever to message back and was very little help"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2020-06-07T00:43:38.000Z",
          "Titre": "Problems if you miss approving payday",
          "Contenu": "Problems if you miss approving payday. The ability to give a payday for past things is not always available."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DB",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T14:57:27.000Z",
          "Titre": "Set up",
          "Contenu": "Set up, linking my banking account and even transferring money within the app has been challenging."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debby",
          "Nb_Reviews": 1,
          "Date": "2021-01-24T12:31:03.000Z",
          "Titre": "App somewhat complicated",
          "Contenu": "App somewhat complicated. Wasn't able to load $ for st least a week after received card in mail"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mrs Sneed",
          "Nb_Reviews": 3,
          "Date": "2020-05-27T22:39:46.000Z",
          "Titre": "There was purchase done on my sons card…",
          "Contenu": "There was purchase done on my sons card that he wasn’t responsible for... I never got a refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gabriel Kemm",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T10:45:11.000Z",
          "Titre": "Not very impressive",
          "Contenu": "I have not received the card or any communications on next steps.  Not impressive so far."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gabrielle Bacon",
          "Nb_Reviews": 1,
          "Date": "2020-08-29T01:23:45.000Z",
          "Titre": "I haven’t received my card",
          "Contenu": "I haven’t received my card. It’s been 3 weeks. They said it’ll get here early September."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dorothy Carter",
          "Nb_Reviews": 2,
          "Date": "2020-08-10T13:51:58.000Z",
          "Titre": "Still haven't received the card",
          "Contenu": "Still haven't received the card. I've reached out to customer service. First to update the mailing address as it was different from my billing address. Immediately, I was directed to the issuer of the card. No big deal. They said they resolved it after multiple copies of my driver license was emailed. Waited another week. No card. Reached out to customer service again. I was assured it would be here any day and they would continue to follow up with me until the card arrived. We will see how this pans out or if I will receive the card. At least customer service responds rather quickly - whether they have a resolution or not. I do sincerely appreciate that. ***edited to add that this card was ordered July 9th and the change of address was requested on July 10th. ***Update - I did receive a card and although had issues \"unlocking\" it in the app upon receipt, it did work the following day. With the delays aside (although a bit frustrating, it wasn't the end of the world), I personally would suggest obtaining a debit card through your financial institution. It is cool that kids can check off chores as they complete them but the same could be done via a sticker chart or any other chart. There is also a significant delay when loading the allowance to the card. I will probably cancel this and go through my bank. The customer service representatives are responsive so that is a plus."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joy Snyder",
          "Nb_Reviews": 1,
          "Date": "2020-05-27T19:19:22.000Z",
          "Titre": "Had issues setting up funding source",
          "Contenu": "Had issues setting up funding source. Card cannot be used with Facebook Pay."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer Moore",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T11:22:49.000Z",
          "Titre": "no response",
          "Contenu": "I I sent an email three days ago and still have not gotten a response"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Toni",
          "Nb_Reviews": 3,
          "Date": "2020-08-25T17:00:17.000Z",
          "Titre": "Ordering a card takes way to long",
          "Contenu": "Ordering a card takes way to long. Also the fees are high."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2020-09-02T01:22:42.000Z",
          "Titre": "Cannot load the card",
          "Contenu": "Cannot load the card, though I am selecting load card"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jasmine Butler",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T17:37:15.000Z",
          "Titre": "Three weeks and still no debit card for…",
          "Contenu": "Three weeks and still no debit card for the kid!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremy Peterson",
          "Nb_Reviews": 1,
          "Date": "2020-06-04T00:15:03.000Z",
          "Titre": "To expensive to give my kid money"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Helen Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:14:13.000Z",
          "Titre": "The app is not user friendly",
          "Contenu": "The app is not user friendly.  You have to read about how to put money in card directly than more steps for placing in buckets."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joey Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:22:21.000Z",
          "Titre": "An OK service, but largely a disappointment.",
          "Contenu": "Their debit card has too many fees.  Many online purchases get hit with high foreign transaction fees.  Previous stock provider, StockPile was a pain, and then added unreasonable fees.  Based on that it is hard to trust BusyKid on the new investment provider.  I would like a simple way to pay a selected interest rate on savings balance.  Busy kid could offer a low base rate, but parents could supplement.  They have a savings match feature but that only makes sense if you lock savings. I would prefer my kids have more freedom to learn about time value of money and investing.  The branding is not good for older kids. Sure you have a debit card, but it is embarrassing to use in front of peers.It does work.  The app is fairly good.  It was pretty easy to set up.  But given the upfront fees, it seems like they should provide a card without all the excessive transaction fees."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex Marks",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T05:56:52.000Z",
          "Titre": "app is mediocre…",
          "Contenu": "Your ease of use on the app is mediocre and the inability to transfer back off the busy kid card if it gets lost or stolen isn’t very convenient considering you dealing with kids as the responsible parts for their cards. And it takes a long time to get a card initially or to get a replacement card"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Winfield",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T21:05:52.000Z",
          "Titre": "Solid features, bad UX/mobile app, why no web app?",
          "Contenu": "The core features are useful (integrating with our bank account for funding, investments managed via Apex clearing), but the usability and ability to execute what I want to do with the app is super frustrating.Why is there no web application? Why is there no iPad version of the app?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronald Dooley",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T03:40:33.000Z",
          "Titre": "Once I contribute funds there is no…",
          "Contenu": "Once I contribute funds there is no option to have funds go the other way. They become locked, so my kids can’t pay me back when they borrow from me. Disappointed the link to stockpile is no longer. The card provided isn’t as universal as say a visa debit card. It doesn’t work in all places, so my kids are constantly asking for $$ via Apple Pay. Can’t believe you are asking for a date of experience. These are ongoing issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeremy Muir",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T01:35:18.000Z",
          "Titre": "Overall decent",
          "Contenu": "Overall decent. Kids run into problems when using their cards where it will say wrong PIN but the same pin works on the app. Another issue is being declined and they have to run the card multiple times to get it to run through."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clark M",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T15:35:03.000Z",
          "Titre": "I wish BK were set up more like a…",
          "Contenu": "I wish BK were set up more like a typical bank account, which would prepare kis for that transition. I tried to set up the Investment account. Had to unfreeze my status with the big 3 bureaus but BK didn't get it set up in the 3 days my status was unfrozen so I'll have to do it again.This all may be due to the BK learning curve so there's that. I'm only marginally happy with the app. I'll add that the customer service response is phenomenal!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rita Goss",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T16:42:00.000Z",
          "Titre": "was difficult to get the program up and…",
          "Contenu": "was difficult to get the program up and running smoothly.  Kids wanted to go back to Greenlight. Customer Service was good when I called.  INSTRUCTIONS FOR USE OF THE PROGRAM AND EASE OF USE A PROBLEM--INSTRUCTIONS ARE EMBEDDED UNDER SUPPORT AND HARD TO FND"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tierra Moorman",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T15:05:05.000Z",
          "Titre": "Doesn't grow with your child",
          "Contenu": "The app started out being exactly what I needed for my 14 year old, but as he got older it became more of a hassle. There were certain places he couldn't use his card, and once he got a job he could not set up direct deposit. This is ultimately why we ended things with busy kid. No longer met our needs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lindseh McIntosh",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T13:28:53.000Z",
          "Titre": "Pricey",
          "Contenu": "The app is a little confusing and I don't like how it automatically takes out the allowance off my bank card and it was a bit pricey to start and there is a fee for everytime I want to put money on their card. It's just a little much. I think I'm gonna wait until they are 13 and get them a monitored cashapp card for free from my account. Seems much easier and less complicated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carlos Williams",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T13:51:27.000Z",
          "Titre": "Clunky and inconsistent",
          "Contenu": "I like the concept of BusyKids but there are a few frustrations: 1) the app interface is not as easy as it looks. I want an easy way to find where to approve Pay Day each week. Also switching between kids from the parent dashboard is awkward. 2) sometimes when paying at a store, the card doesn’t work by swiping, so my kids have to enter their pin. Then sometimes that doesn’t work. It needs to be more reliable and consistent. They get embarrassed when with friends and the card doesn’t go through."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T22:22:09.000Z",
          "Titre": "Missing Bi-Weekly Chores",
          "Contenu": "The app is missing the ability to do a bi-weekly rotation of chores between children. You can make it happen by manually entering them week by week, but the only repeat option is every week."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patti Garner",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T01:20:16.000Z",
          "Titre": "It is difficult to understand where the…",
          "Contenu": "It is difficult to understand where the money is going. I deposited $25 into my granddaughter's account and it was spread out over several \"accounts.\" I'm not sure why. Also, the app overall is difficult to understand. Like, I want to just give my grandkids each $5 per week without attaching it to chores. I just find it confusing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debra M",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T19:43:10.000Z",
          "Titre": "It took 2 months to receive the card",
          "Contenu": "It took 2 months to receive the card. I had to escalate the situation to a manager to get help. They take the allowance money out of my bank account on Monday but do not pay it until Friday.  It used to come out on Wednesdays and that was reasonable. What do they do with it for 4 days? The kids love having a credit card and the various options to save, spend, invest, and donate. Some online vendors do not accept it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jamie Jewell",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T13:43:13.000Z",
          "Titre": "We get logged out a lot and have to log…",
          "Contenu": "We get logged out a lot and have to log back in, the app also takes money when my kids try to use the card but the balance is low.  They do not get the notifications so they keep trying and it keeps charging fees."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SGriffin",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T22:58:34.000Z",
          "Titre": "Disappointing",
          "Contenu": "It took a very long time to receive the spending card, which is frustrating.  It also took five emails back and forth with customer support to actually activate the card and put money on it.  We previously had a greenlight card, and busykid is not as user-friendly as that was.  I'm still not sure how to do an automatic allowance."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paradis",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T00:54:19.000Z",
          "Titre": "We have had trouble figuring out how to…",
          "Contenu": "We have had trouble figuring out how to get the card ready to use and then actually using it.  I don't like the fact that they were charged 50 cents each time they tried to use it while in this process with no explanation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CC",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T16:05:30.000Z",
          "Titre": "The card is decent",
          "Contenu": "The card is decent, but I don’t like that money can’t be transferred off card back into savings and I do t like the amount of times I get credits when my kids want cash."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 2,
          "Date": "2022-10-06T00:53:15.000Z",
          "Titre": "The app is a little bit tricky to…",
          "Contenu": "The app is a little bit tricky to figure out. It’s not real clear how you deposit money and change it in between sources. And often times there’s a fee associated with transferring money. I like how the kids are able to learn how to manage money and have access to a card, but the features of this app could be streamlined and made much easier to use. Also, the chore tracking can be confusing sometimes. Overall, I still haven’t decided whether the card is worth the time, effort, and fees it takes to manage."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 2,
          "Date": "2022-09-16T00:19:47.000Z",
          "Titre": "Lacking Functionality",
          "Contenu": "The basics of the app is fine. But it is missing the ability to rotate chores between multiple kids without manually entering each chore separately per instance. This takes an incredible amount of time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer Thompson",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T12:27:13.000Z",
          "Titre": "Overall I like the app",
          "Contenu": "Overall I like the app.  New to it so I haven't explored everything just yet but I do have a question. I noticed another review talking about the money not going on there instantly and then an updated comment that it does. How do I set it up to go on instantly?! I check the box stating to put it directly to their spend card and the first time I loaded money for each kid, it showed up immediately but every time after its been a day or more before it goes on. Is there something I'm doing wrong or is there just no way for it to be available immediately each time I add money to one of their accounts?!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T17:45:19.000Z",
          "Titre": "Good. But needs improvements",
          "Contenu": "I love being able to keep track of chores and payments. What I don't like is there is no way to move their savings $ into their savings account, because you can only have one funding account. So I have to move $ into their account and then back out to my account and then into their savings account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jasmine Barnard",
          "Nb_Reviews": 3,
          "Date": "2023-08-18T11:49:33.000Z",
          "Titre": "not bad",
          "Contenu": "Customer service is nice but the platform isn’t as intuitive as it can be. The pin often gets confusing for my kids… there is one for the app and one for the card. Should be the same."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Parent_",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T04:15:08.000Z",
          "Titre": "Having repeated difficulty funding my child's account",
          "Contenu": "Having repeated difficulty funding my child's account so that the money is deposited into the three separate areas (save, spend, share). I've had to send the money as a bonus in order to put money on his card which defeats the purpose of the save and share accounts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VG",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T23:28:55.000Z",
          "Titre": "Hidden Fees",
          "Contenu": "I hate that on top of the charge you get at an ATM, busykid also charges an additional fee on top of that. Actually, anything you really do there is a fee...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-06-21T23:21:50.000Z",
          "Titre": "We are currently looking to see if we…",
          "Contenu": "We are currently looking to see if we should switch to another card service for the following reasons:1. The charges my kids receive when their card does not have enough on them. 2. We are not able to move funds from one child to another."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "P Lan",
          "Nb_Reviews": 12,
          "Date": "2023-08-14T12:58:39.000Z",
          "Titre": "The app and service is great, but lots of denied fees for kids",
          "Contenu": "The app and service is great.But, a little unforgiving for learning kids.  Lots of 50 cent card denied fees eventually wipe out their accounts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicole H.",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T18:11:31.000Z",
          "Titre": "Works but could use improvements",
          "Contenu": "So far things have been going okay.  The kids really like having a credit card and the ability for me to put cash on their card instead of them having to carry cash.  A change I would love to have or maybe an enhancement for the system is the ability to change the allowance for the week. All I can do is approve. I can go in one chore at a time and change turn it on or off.  I would like to be able to just change the allowance amount manually, especially if a kid did something extra that week that I want to reward for.  Instead of doing a bonus, I want to add to the allowance I was paying and only have one transaction hit my account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mackensie",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T07:36:49.000Z",
          "Titre": "Great app! I've tried others and this is the best one! Room for improvement though!",
          "Contenu": "I really like the pricing structure and the automatic distribution of allowance for spending, saving/investing (and having the option of a savings match like many 401Ks have), and giving.  I feel that it really helps to teach financial responsibility.Here is where I think BusyKid can improve:- More charity options in the list or the ability to have my child choose the charity that I can approve.- Drastically improve the chore scheduling feature to add more conditions and variables.  This \"BusyMom\" would like to set up the chores once and not have to check and modify them each week.  Here is what would be great to have:   * Allow the assignment of a single chore to rotate between kids based on the day of the week.  For example, if I want to have each of my 3 kids vacuum one day a week on different days, I have to create the chore 3 different times.   * Have the ability to set a repeat to happen every other week (you can have a chore repeat daily, weekly, or monthly).- Have a daily reminder notification to remind kids to do their chores.I feel that if they really work on making the chore area of their app more robust, BusyKid will be leaps and bounds ahead of all of their competition by a mile!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 3,
          "Date": "2022-10-20T11:52:26.000Z",
          "Titre": "Update",
          "Contenu": "I have used other kid debit card apps. I have to say that the BusyKid app & card takes a little time to get use to. From the time you approve a payday to the time it arrives on the app takes about three days. The reason for this can be shared between the funding source & the BK app. Either way I have to approve funds on a Wednesday in order for the funds to be available on a Friday. It's kind of frustrating.10/20Today I approved an allowance. I received a message that my funds are being processed & the allowance was moved into spend. Now I will wait. I want to get the funds loaded onto the BusyKid debit card by tomorrow when I pickup my daughter. Fingers crossed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richella",
          "Nb_Reviews": 2,
          "Date": "2022-12-29T18:21:12.000Z",
          "Titre": "I like the app",
          "Contenu": "I like the app. But it isn't easy to work. Doesn't show correct amounts. Is actually really hard to figure out how to work it. If I hadn't already paid for the subscription,  I would probably stop using it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T21:29:03.000Z",
          "Titre": "I enjoy being able to pay my child and…",
          "Contenu": "I enjoy being able to pay my child and manage the account. I would like it better if I could set his pay day. The app is not very user friendly. It separates his money how they want and then he has to deposit it to his card and await my approval. The money should go straight to the card."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 2,
          "Date": "2022-08-30T04:30:11.000Z",
          "Titre": "Good but there are a few quirks…",
          "Contenu": "We enjoy being able to have a chore chart, check list, and payday. The kids love the feeling of freedom and I love the visual of savings/spend/share. I wish I was able to set certain chores on certain days for each kid but it seems to blend the same chore in with each kid if I try to say to do it monthly. A couple of things we are having a hard time with. 1. The inability to move money off of the card. Once it's on, you cant take undo it. 2. Inability to pause card usage. My son accidentally put in for an automatic payment instead of a 1 time payment and the company kept trying to run the payment and the card kept declining. We couldn't figure out how to cancel the payment so I went to see how to freeze the card. You can only report card as lost or stolen. 3. Maybe there is this and I have missed it in the instructions, but a way to not allow automatic payments. This isn't the fault of the card and I'm not even sure it's a possibility, just an idea."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Plano Kathy",
          "Nb_Reviews": 10,
          "Date": "2022-11-11T00:19:42.000Z",
          "Titre": "Simple app but difficult to learn",
          "Contenu": "The app is hard to find what you are looking for. It needs to be made simpler for kids and old people. My biggest problem is finding how to make a one time deposit. I eventually find it but every time I use the app to add money, I have to look for where to deposit it. I believe it should be in the child’s profile as well as the parent. That is where I go first."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mama",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T21:55:36.000Z",
          "Titre": "Chore organization",
          "Contenu": "This app makes it very easy and has streamlined paying my children for their chores on a consistent schedule. So, from the banking perspective it’s great! The usability for the chores could be better. I wish there was a way to add my own chore and keep it so it pops up when I “add chores” instead of only being able to select from the preloaded chores. Also, I would love to be able to list the chores each child is assigned in the optimal order for completion. For example brushing teeth in the AM should be followed by making the bed, not brushing teeth PM. Finally, scrolling for the date is confusing. When using the toggle to go to the next week, I would prefer for the highlighted day be the first day of the week, not the day of the week that was highlighted when scrolling. For example if I’m on Wednesday, but I want to see the next week, I want the highlighted day to be Sunday. The reason for this is, if I’m scrolling to the next week, I’m scrolling to view the next week as a whole, not next Wednesday. Also, my children often accidentally check off chores for the next week instead of the current week because they get confused and think the arrow takes them to the next day. I’ve taught them to make sure the date matches the date we are on, but still, this would easily resolve if the arrow took you to the beginning of the week."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie in Illinois",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T15:24:12.000Z",
          "Titre": "It was great initially",
          "Contenu": "It was great initially, but my sons have lost interest it.  I am considering cancelling it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T13:45:40.000Z",
          "Titre": "Great idea…love the savings…",
          "Contenu": "Great idea…love the savings aspect…continues to get held up when trying to send a bonus to the kids. Very frustrating."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Wendy",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T08:22:23.000Z",
          "Titre": "Great product for use in the USA but not for traveling",
          "Contenu": "Great product for use in the USA, but useless overseas as the overseas use charges add up really quickly!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tony Mendolia",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T16:20:54.000Z",
          "Titre": "Recently the transfers are taking hours…",
          "Contenu": "Recently the transfers are taking hours to process instead of minutes...  This is not great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Helen Cerda",
          "Nb_Reviews": 3,
          "Date": "2022-09-23T01:26:58.000Z",
          "Titre": "Expensive always have had free…",
          "Contenu": "Expensive always have had free checking/ debit - am only doing until my granddaughter is old enough to get a bank Acct"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jasmine Barnard",
          "Nb_Reviews": 3,
          "Date": "2022-12-13T23:29:55.000Z",
          "Titre": "Interface is not very clear",
          "Contenu": "Interface is not very clear. Trying to put spending money isn’t intuitive. I’d change my UX."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Arin",
          "Nb_Reviews": 3,
          "Date": "2023-03-02T05:03:07.000Z",
          "Titre": "What we like and don't like",
          "Contenu": "What we like: Great chores to pick from, also the ability to add chores and that everything is editable as well as being able to insert photos. IE: Chicken Chores with our own Chicken photo. We like that the chore amounts to be paid are editable as well. We're not a family that's going to pay $2.00 for our child showering, so that is a great feature.Why we've given it 3 stars: Cannot edit paydays, doesn't keep a running allowance to be paid if you don't pay on the 1st and 15th - which in our family we don't. We pay bi-weekly (like we are paid). We don't like the function that is built in that allows us to pay the \"missed payday\" - we also do not like this membership to use the app needs to be paid upfront for a year. Some families cannot afford that. You may not believe it's a large upfront cost for some families, but it is and that shouldn't deter a family from trying to incorporate the value of money. We also tried to use the BusyKid cards at a POS and use the debit function and the pin # doesn't work. When we received the cards it said that the pin # is the last 4 digits of the main phone # that registered the account, either we are wrong or there is a glitch with this. We also give it 3 stars because we're not necessarily wanting to invest in the stock market, use the save option (which we find unclear on what that option actually is) and there will be a max of $2K the cards can hold (which seems unclear as well and if that's divided between all categories). I suppose at that point we'll just move the money to a banking system so that the children can continue to be paid for their chores. We have continued to use this chore app as it has been something our (11 & 8) year olds have enjoyed and has held us all responsible for our parts of being a family unit.I have recommended the app and find it is useful - but some tweaking of the app would also be useful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer Brown",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T14:31:48.000Z",
          "Titre": "I like how I can instantly transfer…",
          "Contenu": "I like how I can instantly transfer money to my sons card. I don't like how his grandma has to pay a fee on order to load money on his card!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T15:24:04.000Z",
          "Titre": "Confusing as to adding money",
          "Contenu": "Confusing as to adding moneyConfusing as to scheduling choresNeed to be able to add Money on website instead of just app ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melissa Bland",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T02:57:42.000Z",
          "Titre": "I hate that it keeps on taking $0.50…",
          "Contenu": "I hate that it keeps on taking $0.50 off whenever an auto payment doesn’t go through. These are kids! Stop the retries and let us know about it to add more money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nancy Dellamonte",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T14:58:20.000Z",
          "Titre": "I am finding it impossible to move…",
          "Contenu": "I am finding it impossible to move money to the stock part of Busy Kid.  That was one of my three main reasons for starting this.  Can't find help to do it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T12:49:56.000Z",
          "Titre": "Overall BusyKid seems ok",
          "Contenu": "Overall BusyKid seems ok. I can’t seem to adjust the pay day and it’s not as easy to navigate as I expected. I’m still learning."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T16:44:07.000Z",
          "Titre": "The setup was frustrating",
          "Contenu": "The setup was frustrating. My bank cleared for one portion but for payment it made me setup my bank card which charges you. I have been unable to talk to a real person and now everytime I send money to my daughter I’m charged."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer Lora waller",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T01:09:39.000Z",
          "Titre": "I dislike how long it takes for funds loaded to appear …",
          "Contenu": "I dislike how long it takes for money to appear in the account. I like that I’m able to load it into savings and charity"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthonydad Dimaria",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T06:57:17.000Z",
          "Titre": "The app is confusing .",
          "Contenu": "The app is confusing .. Transferring from spend to save etc."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T21:26:31.000Z",
          "Titre": "When I give a bonus it’s take about 2…",
          "Contenu": "When I give a bonus it’s take about 2 days to go through. Sometimes the app glitches and take a while to post money to card or won’t let you!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T18:10:55.000Z",
          "Titre": "There should be no charges for…",
          "Contenu": "There should be no charges for overdraft or fees of any kind. Kids should not be able to spend what they don’t have."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rodrigo BarrosdePaula",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T03:36:03.000Z",
          "Titre": "You should add more features for our…",
          "Contenu": "You should add more features for our kids like Venmo or Zelle"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Apolla Red Shirt",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T22:32:05.000Z",
          "Titre": "Because it won’t let me put money one…",
          "Contenu": "Because it won’t let me put money one my child’s busy kid card"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sharon Singh",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T03:10:48.000Z",
          "Titre": "My son card was a hacked and they took…",
          "Contenu": "My son card was a hacked and they took 49.71I don't know how to get the money back.please call me at 347-777-5125"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristie",
          "Nb_Reviews": 2,
          "Date": "2022-05-10T18:35:18.000Z",
          "Titre": "The app initially  seems intuitive",
          "Contenu": "The app initially  seems intuitive, however what is not  intuitive is adding in money and not being able to transfer money from the card back to savings. That is a missing feature that I figured out once I googled it, how are kids supposed to save, if they have money on their card they don’t want to spend!?!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 1,
          "Date": "2022-05-07T19:22:21.000Z",
          "Titre": "I contacted Customer Support multiple…",
          "Contenu": "I contacted Customer Support multiple times and given different answers each time for the same issue.  It took a month and intervention by the president of the company before I was given correct info and the issue was resolved.   Most of my frustration could have been avoided if you had actual phone support. The system you have now is frustrating and time consuming.**update**I should mention again that despite the early communication issues, the issue was resolved professionally and promptly.  Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-28T23:09:44.000Z",
          "Titre": "Great tool for teaching children the…",
          "Contenu": "Great tool for teaching children the importance of managing finances. Only issue is the time it takes to post funds to the account and then to load the balance to the debit card. It’s several days after the funding source has cleared."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T14:59:17.000Z",
          "Titre": "Not sure why when you add money to the…",
          "Contenu": "Not sure why when you add money to the card the app decides to spread it all around. I don’t care for that option. My daughter doesn’t need to be investing or saving her money unless she chooses to. It should go directly to her card for her to spend as she wants without having to put it where it should of gone in the first place."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristal Strong",
          "Nb_Reviews": 2,
          "Date": "2021-08-10T17:40:42.000Z",
          "Titre": "We are enjoying the app and setting…",
          "Contenu": "We are enjoying the app and setting chores and payments up, but navigating and learning what/how to change/set things, as the parent, is not easy. My son recently started investing in stock and that process was very confusing and very difficult to find information on how to complete the process and what exactly was happening with that aspect of the money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michele Myers-Heard",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T22:13:31.000Z",
          "Titre": "Rules and instructions are vague",
          "Contenu": "Rules and instructions are vague and not easy to use. My grandson lost his card I ordered another one, 4 weeks later the card company told me no card was ordered. I ordered another card they said it would be 7-14 days. My grandkids have not been able to use the money I sent from Easter. You have got to make this easier to use. If the card does not come when they said I will close all accounts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luis Cordero",
          "Nb_Reviews": 2,
          "Date": "2022-05-08T08:27:04.000Z",
          "Titre": "Lack of consideration.",
          "Contenu": "I really wish this company was understanding. My first payment was blocked by my banking institution so it was declined. I immediately rectified this and as quickly as possible paid the first declined transaction which was literally the first transaction I have ever had with them EVER. The second attempt was successful and they received the money but still closed my newly opened account with no hesitation and regard to my son's opportunity to have his very first very own debit card. Now I'm looking for other options with a company that is willing to be more UNDERSTANDING and CONSIDERATE. Good luck Busy Kids I hope your future is better than your forgiveness."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JW",
          "Nb_Reviews": 1,
          "Date": "2021-05-05T14:57:08.000Z",
          "Titre": "Engages kids to do more chores for money",
          "Contenu": "It engages the kids to perform chores to get paid and teaches the kids about stock purchasing. We haven't fully tested the app, but ran into a minor issue with the kids purchasing stock. Didn't like the idea of managing 2 apps for purchasing stocks. Make the mistake of redeeming stock purchase under my name instead of kids, therefore had to add bonuses to the kids account to fix problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amanda S",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T17:32:56.000Z",
          "Titre": "I love the idea",
          "Contenu": "I love the idea. As a parent it helps me coordinate tasks (manage chores, allowance, etc.) and teaches my son financial literacy (stock purchasing, managing a debit card, etc.).  But the interface is really challenging to use.  Every week I struggle to figure out how to approve payment.  And when I need to give my son extra money I don't think of \"bonus\"."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason Y.",
          "Nb_Reviews": 1,
          "Date": "2021-02-04T16:03:06.000Z",
          "Titre": "Mixed Bag",
          "Contenu": "While the app is well structured and, so far, that structure has greatly improved my child's contribution to household tasks, the card I received for her was a disappointment in that it's not a chip card like some of the competing services provide, instead relying on an antiquated, magnetic strip. I was shocked by this failing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T19:26:08.000Z",
          "Titre": "BusyKid is mostly great",
          "Contenu": "BusyKid is mostly great, but it would be nice to have a transaction history. This is the second time I have attempted to load my kids' cards from spend only to have the money disappear and I can't track it. It's quite frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alicia Smith",
          "Nb_Reviews": 2,
          "Date": "2020-09-25T16:06:20.000Z",
          "Titre": "I love the app but not the customer service",
          "Contenu": "I love the app.  It works great for motivating my children to be responsible ans earn money. However the customer service call I received was so unfriendly.  The representative  was irritated just by my interaction with him.  He thought I was lying about my phone connectivity... Just rude until I mentioned it to him and then his attitude changed.. I hope to never deal with customer service again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-30T02:10:45.000Z",
          "Titre": "Hard to figure out how to put money on…",
          "Contenu": "Hard to figure out how to put money on hard other than bonus. Can't set your own allowance date. Was unable to add my credit union even trying both methods of linking accounts. Had to link a card and pay a fee."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2021-06-20T12:39:42.000Z",
          "Titre": "This is not divorcee friendly",
          "Contenu": "This is not divorcee friendly. My ex wife doesn't want to get in on this program to teach out child because she feels like I will be taking her bank account information. This would be much better if parents had their own log in with their own password (not pin) so they feel more secure."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "katie clopton",
          "Nb_Reviews": 1,
          "Date": "2021-12-19T21:13:17.000Z",
          "Titre": "Balance",
          "Contenu": "I do like the card. I did look under the history tab where it shows you where all the expenses are. After looking at how much my son has on the card total and subtracting all the transactions, he should still have a higher balance then what is shown."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dayna Frank",
          "Nb_Reviews": 1,
          "Date": "2020-09-15T01:05:58.000Z",
          "Titre": "I like the app",
          "Contenu": "I like the app, but find it difficult to use.  I would like to archive the chores that we don't use.It would be great if the funding went immediately onto the card if i needed to advance money, and also have a way for the child to 'repay' the money.I do like the new features you recently rolled out- perhaps this would be better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Papineau",
          "Nb_Reviews": 2,
          "Date": "2020-06-03T23:52:10.000Z",
          "Titre": "User Error",
          "Contenu": "I would like to access the program on my computer.  I love the idea, and I feel that the lack of use of the app is our fault, but for some reason the strategy has not caught on with my 10 year old.  I can get her to do chores the old fashion way - can’t play on any device until your chores are done.  No real negative review, just has not been as productive as I would have liked."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dee Hall",
          "Nb_Reviews": 2,
          "Date": "2020-09-12T22:47:04.000Z",
          "Titre": "App Not really user friendly...",
          "Contenu": "App Not really user friendly...Difficulties figuring out how to change percentages in spend, save, donate accounts. The instructions under help link was not correct. ALSO, difficulty with changing payday dates and setting profiles.However, when I emailed customer service for help on issues I couldn't figure out, they responded quickly!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrice Arend",
          "Nb_Reviews": 2,
          "Date": "2021-11-07T00:20:45.000Z",
          "Titre": "Great idea",
          "Contenu": "Great idea.  Interface with Stockpile could be improved from the beginning.  I’d also like to just be able to identify chores that remain on the list until they’re done.  I don’t care if a chore is done Saturday or Sunday, and weekend schedules change.  Being able to list them and have them stay there until they are finished would be helpful.  Also, I don’t care which kid does which chore.  Whoever has the ambition gets to do it and get paid.  If one kid does it then the chore just needs to go away.  Great idea and kids excited to do chores for money.  But app still needs some development work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan M Gaudreau",
          "Nb_Reviews": 2,
          "Date": "2021-05-08T22:43:00.000Z",
          "Titre": "The app is intuitive enough",
          "Contenu": "The app is intuitive enough, and I will continue to use it.  Annoying start however as my children's debit cards arrived at different times and one taking 3 weeks. Additionally I was charged a fee for transferring a balance and that fee was not disclosed at the time of the transaction."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marianne H.",
          "Nb_Reviews": 1,
          "Date": "2020-12-12T01:48:17.000Z",
          "Titre": "Love the concept, app needs work",
          "Contenu": "Love the concept, card works well, but app needs to work better.  Right now we have to call in to get our daughter’s balance, app says her card has been ordered; we got it last week & activated it right away.  Hopefully this is fixed soon, it has helped our older daughter understand how to earn money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Denomme",
          "Nb_Reviews": 1,
          "Date": "2021-03-21T08:46:01.000Z",
          "Titre": "I'm liking the app and debit card but…",
          "Contenu": "I'm liking the app and debit card but there is a big learning curve on how to set up the accounts so it works with our family situation.  Holding off final judgment until I have everything set up how I want it.  I expect things will improve as I become more adept and using the app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2020-08-21T11:04:21.000Z",
          "Titre": "Took a minute, but this is a great app",
          "Contenu": "It took about four weeks to get my cards, I get covid-19 changes things but man that's a long time. I do like using this app I do like one of my kids can see on their phone about money so this is a very great program. And it's very simple to pay him that's what I like click of a phone paid their done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Caroline S.",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T18:57:09.000Z",
          "Titre": "Technical Difficulties",
          "Contenu": "The app is cool. The kids like it. Only thing is, as the parent, I’d like to be able to add a second payment source to pay the other kids in the household with. We’ve had a few technical difficulties. I had to uncheck chores completed by one kid that I didn’t want to pay for just yet. Now, we can’t remember what was done and what wasn’t. Also, all kids now have a BusyKid card, but two still say to order card, so I can’t add funds to card. Only the other parent can. It would be nice if both parents could do it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kimberly Ross-Edwards",
          "Nb_Reviews": 5,
          "Date": "2020-08-29T12:50:56.000Z",
          "Titre": "App is a little tough to figure out",
          "Contenu": "App is a little tough to figure out.  Could be a little more user friendly.  I kept trying to order card from app, w/o success. I was told not to use app to order it, but to go thru an online site.  Why would you have \"order card\" button, on app. if we cannot do this here?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leah",
          "Nb_Reviews": 2,
          "Date": "2020-09-12T20:29:11.000Z",
          "Titre": "It would have been five stars if the…",
          "Contenu": "It would have been five stars if the process wasn't so difficult. It took days to get the cards ordered which is partially my issue. Because I leave in a rural area and the address situation caused problems. But all the customer service people were great. And then, when we finally got the cards and activated them, my kids couldnt load them or use them. Again it took nearly a week to link the cards to the accounts where they could be used. So overall, we like so far, customer service is great, just a long drawn out process. I think it could be simplified."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AD",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T21:55:14.000Z",
          "Titre": "Great tool but link to bank is troublesome",
          "Contenu": "Great tool for kids to document their chores and be accountavle. The need to connect to a bank account is troublesome. Hard to reconcile that all the $$ taken out and put back in at cash-out. Not sure how to access a reconciliation report. Not seeing all credits in my bank account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KD",
          "Nb_Reviews": 1,
          "Date": "2021-05-08T17:23:37.000Z",
          "Titre": "It takes a while to get the hang of…",
          "Contenu": "It takes a while to get the hang of this app. I  tried emailing to get some info but my email kept coming back. My prob with funds eventually worked itself out. After the learning curve it seems good though, and a much better price that similar apps."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kate McLaughlin",
          "Nb_Reviews": 2,
          "Date": "2020-06-15T14:32:25.000Z",
          "Titre": "Unless I am there is an option that I…",
          "Contenu": "Unless I am there is an option that I do not know about, I wish there was a way to cash out payroll without having to order the card or enter a bank account. I downloaded the app just to keep track of chores that the kids are doing and what I would owe them. The same as I would on a piece of paper. Because everything has become electronic these days I decided to try an app, however I do not see any other way to cash out the payroll other than giving a large amount of the allowance to the Busy kids app or by adding personal banking information. Which i do not feel comfortable doing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronald Diemicke",
          "Nb_Reviews": 1,
          "Date": "2020-05-27T19:23:47.000Z",
          "Titre": "The idea is great and mostly works…",
          "Contenu": "The idea is great and mostly works well. There are a few confusing things around when payday is for kids and how you get money in and out in the UI. Also - some of the items around how saving and giving works seems a bit wonky. But nothing that can't be fixed!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Meca Nichols",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T22:07:44.000Z",
          "Titre": "I didnt realize that when you approve…",
          "Contenu": "I didnt realize that when you approve allowance money or bonus it doesn't automatically show up on the account I dont have the option giving instant cash to my child and reading the instructions it's very vague about how it works .... its frustrating"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GN",
          "Nb_Reviews": 1,
          "Date": "2021-01-16T12:45:16.000Z",
          "Titre": "Not all inclusive",
          "Contenu": "I was really excited about this. We still like it, but I don’t love that we have to use another app for stocks and that only certain stocks are available through Busy Kid. I also don’t appreciate the extra process to obtain the spending card."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Molly Cooper",
          "Nb_Reviews": 1,
          "Date": "2020-06-08T07:55:10.000Z",
          "Titre": "I think the fees associated with the…",
          "Contenu": "I think the fees associated with the card are ridiculous.  My son is more motivated to fo chores though, and we don't think it's only because money is part of it.. he likes being able to use th5r app, being that's s.o.p. for his generation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis F",
          "Nb_Reviews": 4,
          "Date": "2020-05-27T18:57:29.000Z",
          "Titre": "Good start, but needs work.",
          "Contenu": "The app seems to be pretty solid, and I'm satisfied so far. There are some features that would be nice to have:- ability to use via web. Granted, most are, but not everyone is glued to their phones.- push notifications so kids can be notified when a chore should be done- ability for a child to add a chore, where adult can approve and choose payment amount.- choose payment amount by directly typing instead of choosing from dropdown. In some cases, chore amount could exceed $50.There's always room for improvement in any app, but this would make the BusyKid app experience better for our uses."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erik",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T00:22:04.000Z",
          "Titre": "Great concept, not great execution",
          "Contenu": "They currently don’t have a website option for managing the account. While I can appreciate an app being an option for accounts, sometimes I prefer using my laptop. Charges take several days to reconcile on the card balance, although it’s a debit card. As a result, my son frequently thinks he has money that isn’t actually there because his card hasn’t been debited for what he previously bought.One other thing is that the number on the back of the card goes to some type of administrator. They have no knowledge of the program and can’t answer any questions about it. The only thing they may be able to help with is suspending the card or something basic like that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle Bowman",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T03:13:18.000Z",
          "Titre": "Approval of payday is far too…",
          "Contenu": "Approval of payday is far too complicated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anna",
          "Nb_Reviews": 1,
          "Date": "2021-01-10T18:37:07.000Z",
          "Titre": "Good for Paying Allowance",
          "Contenu": "For the most part, I am very happy with the app. I appreciate the suggested/pre-populated chores and payment for each. I also like the emphasis on save/spend/share.I was under  the impression that when she chose to donate to one of the charities that the funds would go directly there. We had some relatively small transactions going back to our linked bank account and are supposed to make the donation then on our child's behalf. We have now instructed our child not to donate until there is at least $25 in the share allocation so that we aren't moving small amounts of money back and forth and then trying to remember to donate for her."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T16:35:12.000Z",
          "Titre": "Okay so far",
          "Contenu": "Okay so far - chores app isn't intuitive or flexible like others. pay tracker seems to be fine. love the ability to pair the card with Apple Pay for ease/convenience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tamara Kraft",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T18:26:58.000Z",
          "Titre": "Limited saving/donation options",
          "Contenu": "I wish there were other saving and donation options.  My son would like to donate to our church, but the charities are too limited on the app.  Also, I'd like him to have the option of putting the money saved into his savings vs. stocks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T13:49:01.000Z",
          "Titre": "Seems to work reasonably well",
          "Contenu": "Seems to work reasonably well. Interface can be a bit confusing, and while I am sure there is a rationale I haven’t discovered, sometimes the numbers don’t seem to add up. Simplifying the app a bit would go a long way to improving it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason Jacobsen",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T19:22:32.000Z",
          "Titre": "Still haven’t got my kids cars and it’s…",
          "Contenu": "Still haven’t got my kids cars and it’s been a few weeks. They can’t hook card up to their savings accounts so money must stay on busy kid account.But the chore list is super cool giving the kids daily objectives"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maui’s mom",
          "Nb_Reviews": 1,
          "Date": "2020-08-05T18:38:43.000Z",
          "Titre": "Great idea and we’re getting used to…",
          "Contenu": "Great idea and we’re getting used to using the app. It would be nice to group some chores together for a larger value, or 1 amount for completing all chores. Also, the debit cards do not have the security chip like other prepaid cards."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tina Diehl",
          "Nb_Reviews": 2,
          "Date": "2020-12-30T14:07:24.000Z",
          "Titre": "There isn't much explanation of things…",
          "Contenu": "There isn't much explanation of things for the app, you kinda have to wing it and figure it out. I even watched 2 youtube videos to figure things out. Other than that I like it, it's easy for my kids to save and spend."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ty Wms",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T17:27:05.000Z",
          "Titre": "Please make a way that funds can be…",
          "Contenu": "Please make a way that funds can be immediately deposited to my child’s card. When he’s away with his dad, I want to be able to send money immediately, if need be, instead of having to wait til next day to be deposited.. a Thank You"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Abbie Mzira",
          "Nb_Reviews": 1,
          "Date": "2021-01-23T18:38:37.000Z",
          "Titre": "It’s so so",
          "Contenu": "It’s so so. There’s nothing to rave about but there isn’t anything I really hate about it either. The one thing I definitely don’t like is that my children can mark off that they did their chores without me confirming it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TT",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T16:57:41.000Z",
          "Titre": "Great product to immerse our kids in managing money",
          "Contenu": "Great product for introducing my kids to value on money and how to manage it.  Helps my kids be more goal oriented on their own.  The app is relatively easy to navigate and manage the account.  I also like the ability for relatives and friends to send funds directly to the kids for special occasions.  The only snag we’ve hit is some acceptance issues on the debit card at a few merchants."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:01:38.000Z",
          "Titre": "No Frills Allowance App for Families",
          "Contenu": "I love how simple it is to set up but the app interface could be a little better. I am not in love with the investing feature, I know it's not robinhood but it would be helpful to have more context to the company you are investing in. I am also not in love that you can't change your child's card's pin on the app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda Deich",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:01:21.000Z",
          "Titre": "I just haven’t figured out how to set…",
          "Contenu": "I just haven’t figured out how to set it to my account to be able to transfer money from it to my kids account. Being  overseas it’s very important and can’t call customer service with the time differences."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sumbird41",
          "Nb_Reviews": 4,
          "Date": "2023-10-14T14:05:17.000Z",
          "Titre": "Works for the Family - Encourages Responsible Decisions",
          "Contenu": "My family has been using BusyKid for just over a year now, and overall - no complaints. It was tough getting the kids interested in doing chores prior to giving BusyKid a try. Now, it's almost like they look forward to helping knowing that some level of a reward is attached (instant gratification). BusyKid helped my children learn more about the importance of being responsible. The part I, as a parent, enjoy is that the kids are learning how to invest their money and save early on too vs. just being able to receive and spend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victoria Peters",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T02:45:24.000Z",
          "Titre": "The only thing is when my daughter…",
          "Contenu": "The only thing is when my daughter wants to transfer savings into another account we get multiple deposits notices. It would be nice if the money is there in Busy kidsIt would be “one” transaction not 20 in increments.Please advise as my husband said let’s not use this app this is ridiculous have 20 transactions for $ 100 depositI hope you can tweak the app.Other then that we love it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andras",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T02:14:12.000Z",
          "Titre": "Great app with one shortcoming",
          "Contenu": "I think it’s a great app to teach kids to use - save, invest and spend - their money and learn its value, we’ve been using it for years. The only shortcoming is that besides these options they cannot transfer money from their account, only the parent can take it - that is the reason for 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca S.",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T22:30:11.000Z",
          "Titre": "Very convenient!",
          "Contenu": "I love Busykid!  It's a digital world, and kids lose cash.  It's so convenient to be able to send him cash when I get stuck at work and he is at his sporting events.  I do wish I could add another person to be able to pay onto his card after the initial setup.  Otherwise, this card is fantastic! Convenient in every way and I tell everyone about it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T02:27:22.000Z",
          "Titre": "BusyKids encourages ownership of finances",
          "Contenu": "I appreciate how BusyKids has encouraged my kids to take ownership of their earnings by making it their responsibility to track their chores and monitor their spending. I have two complaints though. It takes several hours for money to transfer to their accounts. If my child is out with friends and is short on money, it’s easy to send a “bonus” but she won’t get it for many hours, making it a useless feature in an emergency. I also wish that my kids could send me a request for pay for things that are not a daily chore. Ex. Occasionally my oldest babysits her siblings. She can’t add babysitting to her chore/pay list. I have to either add it as a daily chore for her to check when we do go out or send a bonus each time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GHE55",
          "Nb_Reviews": 3,
          "Date": "2023-09-06T16:41:32.000Z",
          "Titre": "I am optimistic that this app will serve my family's needs",
          "Contenu": "The BusyKid app is a little challenging at first and the promo code I was given did not work. But, Lisa from support was very helpful and I am optimistic that this app will serve my family's needs over time.....Fast forward to the next day....The follow-up from the company President was impressive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Grieneisens",
          "Nb_Reviews": 3,
          "Date": "2023-09-02T17:24:07.000Z",
          "Titre": "I love being able to send my reward…",
          "Contenu": "I love being able to send my son money quickly so he can run in to the store or buy extra tokens at the arcade. This process keeps me in the loop when he’s with friends and allows me to reward him when he deserves a little something extra."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T23:10:09.000Z",
          "Titre": "Great Educational Platform",
          "Contenu": "Very happy with BusyKid overall. The app is intuitive to use, and we received good support from Mike in getting my daughter's investment account set up. I would like a little more flexibility in how we credit chores, but that is a very minor complaint. What a wonderful way to intro personal finance to your kids"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hilary Hogan",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T01:18:43.000Z",
          "Titre": "It’s a good app but a few edits would help",
          "Contenu": "It’s a good app in theory but misses key elements. For example, my kids can only see balances of each category (Save, Spend, Share) so to my son who is obsessed with saving, he has to “do the math” to see his balance. It should just have the option to display your total balance. It would help with other spendier kids to see “I have $1000 but I can only spend $200” so they actually learn that we don’t spend all that we earn. A few other glitches too, our PIN#s didn’t work on the debit cards and I couldn’t fix from the app. We were on vacation and it was a weekend so it wasn’t an easy fix. All in all, it is ok and it’s much cheaper than Greenlight."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel Jacklin",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T14:21:50.000Z",
          "Titre": "Solved my issues",
          "Contenu": "There wasn't a person available when I called in for support but then I noticed the chat icon on the website.  Within a minute I had someone helping with my login issues.  A quick hold to involve tech support and voila... Everything is now functioning and my family can access via their apps.  Well done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "N Goodman",
          "Nb_Reviews": 4,
          "Date": "2023-08-14T02:56:32.000Z",
          "Titre": "Been using this for almost 2 years for…",
          "Contenu": "Been using this for almost 2 years for my kids. For the most part, we do not have any issues. My only complaint is that my kids can't transfer funds between each other despite being under the same account. If they want to send funds to each other they have to do it like everyone else and pay the fee. They should really get a feature for transferring between accounts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "L Carter",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T02:24:57.000Z",
          "Titre": "Easy for our teen to use",
          "Contenu": "The BusyKid app is easy to use and a good way to encourage motivation for our teenage son. I wish there was a feature where I could lock the BusyKid debit card as a consequence but for now, we just physically take the debit card away until the consequence period is completed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristina Ingvarsson",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T07:31:35.000Z",
          "Titre": "Great tool to teach kids money management",
          "Contenu": "I like BusyKids because it is a great way to teach my kids spending, savings and how to manage money with a debit card. The feature that they can move and view their accounts instant is great. I can manage controls of their accounts is also great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie  Miller",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T19:59:47.000Z",
          "Titre": "Good customer service",
          "Contenu": "I didn’t receive my card. I reached out to customer service and they sent another card and it has been 10 days and I still haven’t gotten that one either.After my review, I received a personal phone call from the director of customer service. They addressed the issue and I received my card today. Hoping to now get to experience using the BusyKid app with my child."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lou",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T15:20:31.000Z",
          "Titre": "Good tool to teach kids money habits",
          "Contenu": "To encourage my kids to do chores and to teach them financial responsibility, we established a BusyKid account when they were 7 and 10. The kids loved that they could see their chores and how much money they earned. They also liked being able to select charities to donate and buying stocks in companies that they knew. Three years later, the kids are on autopilot with chores and have learned good saving and sharing habits. Thank you for the tool."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ansley-Mom of  boys  and",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T05:56:53.000Z",
          "Titre": "Must Have for Parents and Children …",
          "Contenu": "My children love having credit cards and I love the freedom it gives them to be off with other friends and not rely on their parents to pay for everything. It teaches them responsibility, allows us to help motivate them to complete chores, and lately they have even been learning about the stock market and taking advantage of this feature available when using BusyKid."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katie Birish",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T20:57:33.000Z",
          "Titre": "Great app for kids that normally neglect their chores",
          "Contenu": "It is a great app for kids that have trouble self motivating. Prior to the app my kids neglected their chores but now that they can see and manage on their own they are more inclined to do the chores without being nagged. Improvement opportunity would be to send the kids a notification after their payment is issues with the amount they neglected to earn during the week"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica Decker",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T02:33:34.000Z",
          "Titre": "I like it",
          "Contenu": "I like busy kids but I think it would be helpful if we could refund the money back to us if they were bad or not doing what they were supposed to like a punishment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AKWill",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T04:41:07.000Z",
          "Titre": "Almost Perfect",
          "Contenu": "We've been using BusyKid for about a month. It's mostly met our needs. It's fairly easy to navigate the app and the help videos explained anything I couldn't figure out on my own.I do wish there was an option to create an \"up for grabs\" type chore -- where the chore only needs to be done once each day by one of the children, even though they both are \"eligible\" to complete the chore --a \"first to do the task gets paid\" type of chore."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chas G",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T13:26:11.000Z",
          "Titre": "Cool concept",
          "Contenu": "Cool concept! It teaches my children the importance of money. I do wish my younger children could have a spend card so they can take full advantage of the app but other than that Busy Kid works for my family and I."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ARit",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T16:33:40.000Z",
          "Titre": "I am pretty happy with BusyKid",
          "Contenu": "I am pretty happy with BusyKid, I’ve had issues in the past with my children’s cards but the staff did help answer my questions. The date of my experience with the cards is only a ballpark date."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JJosie",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T20:57:59.000Z",
          "Titre": "BusyKid App!  A great tool!",
          "Contenu": "We have really enjoyed BusyKid and the App is simple to use and allows us to give our daughter an introduction to financial management as you can automate teh percentage of funds into 3 buckets...Charity, Savings/Investment and Spend.  The chore list is easily modified, you can set reminders and payout automation.  The only issue we have had is with the provided card working at some locations.  This has been a disappointment to my daughter as she looked to spend money with her own card independently.  That said, the CEO himself responded the same day to provide feedback and support for this and they are actively working to fix these issues.  Overall a great app and tool for kids and their parents."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherée Wiedeman",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T17:15:56.000Z",
          "Titre": "I love the service, makes sharing money easy",
          "Contenu": "I love the service and it makes things extremely easy for me to give money to the kids.  My only complaint was the amount of time it took to process requests. Since I would like for my kids to get the money instantly, which seems to have changed recently to this format. May only other complaint, is that the kids are charged fees if they do not have enough on their cards.  They should just be declined, I don't believe kids should be charged these feesThanks for responding so fast!!!  Amazing! I would love to leave a reply, but don't feel as if this is the best place.  Overall, I love the app/card and praise it to anyone whenever asked about it. Our experience has been great and it is a prefect way to teach kids about credit without them getting into trouble."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RG",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T19:37:15.000Z",
          "Titre": "A great start in fiscal responsibility…",
          "Contenu": "This is a great start in educating our children regarding financial responsibility.  There is a learning curve.  We had to research the internet and ask friends who have used BusyKid what steps to take to use the investment and charity tools."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristina Ingvarsson",
          "Nb_Reviews": 3,
          "Date": "2022-09-15T00:58:40.000Z",
          "Titre": "Really like the set up and layout of…",
          "Contenu": "Really like the set up and layout of this application m. My kids are very motivated to keep up with their chores to make the weekly allowance. The only issue I have is that we get charged foreign fee when using the card outside continental states."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah K.",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T03:07:12.000Z",
          "Titre": "Good product but expensive for just one child",
          "Contenu": "All in all, Busy Kid works well for what we need it for. We mostly use it for an auto allowance and to load a set budget for spending for things like gifts stores when we are on vacation or back to school shopping. My one complaint is that the cost is steep for anyone who just has one kid. I wish there was a single child option. This would be a much better deal if I had three or more kids."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T20:02:00.000Z",
          "Titre": "I did receive an answer in a very…",
          "Contenu": "I did receive an answer in a very timely manner. The answer did not directly address the issue I had, but it did give me an alternative to get my child paid.UPDATE: Mike did contact me directly to address my concern. Customer service at BusyKid is very attentive and I appreciate that very much!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rita Goss",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T02:24:27.000Z",
          "Titre": "Friendly customer service",
          "Contenu": "Friendly customer service. A bit hard to get it all set up.  Not as intuitive as other programs,but the kids like busykid better."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mirian K",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T06:47:36.000Z",
          "Titre": "We’re all happy with BusyKids",
          "Contenu": "We use this app to give our 10 year old power to buy her own things. She loves having a card and also loves having a savings option to build up funds for something bigger. The app is easy to use and we’re really happy with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AMANDA CROOT",
          "Nb_Reviews": 3,
          "Date": "2023-08-14T04:43:05.000Z",
          "Titre": "Great for Kids",
          "Contenu": "The best part is not having to worry about your kids not having money - just load their card. This has helped us in several instances where my kids needed some money and all I had to do was send it their way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paradis",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T05:12:48.000Z",
          "Titre": "Busy family lives busy kid",
          "Contenu": "My kids and I really like the busy kid system they can buy what they want when they want.  They like to have the freedom and control.  We love the chore functions that teach them how paychecks work. The cards even work in Canada but I'm not sure about the fees especially with our money being worth more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Bregenzer",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T16:05:40.000Z",
          "Titre": "Great for teaching kids how to earn and manage their money",
          "Contenu": "Ok, so I LOVE busy kid! I've recommended to several people and they love it too. It not only holds my kids accountable, but me too! I gave 4 stars instead of 5 because I have one complaint. We get charged fees if the card gets declined. Now, let's keep in mind these are kids using the card. There have been times my kid has accidentally signed up for a recurring charge, didn't realize what he was doing because he's a kid. So when the next charge comes through and gets denied bc he doesn't have enough in his card, we get charged a fee. Or when he has only $10 on his card but his total at the store is $11, it gets declined. He thinks it's because he put in his pin number wrong or whatever and has the cashier try again and again and we get charged the fee. That's really my only complaint with busy kid. Aside from the fact that we are incurring fees for dumb things our kids do bc again, they're kids and are learning how to manage money and the importance of earning it, I have no complaints!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T05:58:22.000Z",
          "Titre": "The Busy Kid Visa card allows me to…",
          "Contenu": "The Busy Kid Visa card allows me to reward my child for getting chores done. It's convenient and educational."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah Nichols",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T01:27:44.000Z",
          "Titre": "You are making it possible for my son…",
          "Contenu": "You are making it possible for my son to learn how to budget. He has been earning money and learning there are limits to what can be done.Thank you for making this easier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dawnva",
          "Nb_Reviews": 3,
          "Date": "2023-09-17T22:26:20.000Z",
          "Titre": "My experience with this company is…",
          "Contenu": "My experience with this company is amazing. As a child  and so young  it is be great so far.even though my mom punish me some times and don't put money on my card, wherever I go out I can use it.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T17:35:23.000Z",
          "Titre": "Not sure what happened to the $20 I’m…",
          "Contenu": "Not sure what happened to the $20 I’m supposed to get for signing up with my friend’s link. Other than that, it’s great.Edited to add that I see the response from the company. Prior to writing this review, I had seen the $20 pending in my activity when I first signed up, but then it disappeared completely. I could not find any record of it. After I received a response from the company I went back and the pending $20 was back in my activity list. I’ll add a star to my review, thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AE",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T18:43:59.000Z",
          "Titre": "Overall",
          "Contenu": "Overall, we had a good experience with BusyKid. There were times I needed to send money, and it wouldn't go through fast enough so my son got into a bit of a pinch, but the customer service was great. Cindy made a change in our account flawless! Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clarissa Turner",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T20:52:28.000Z",
          "Titre": "Easy to Use!",
          "Contenu": "I like being able to load the card securely from my bank account. I also like the card being compatible with Apple Pay!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOHN SILVA",
          "Nb_Reviews": 4,
          "Date": "2022-07-08T18:12:53.000Z",
          "Titre": "The card seems work fine for on line…",
          "Contenu": "The card seems work fine for on line purchases, however when it is used for retail purchases the pin number does not work. Many attempts to correct this have all failed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Infusino",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T20:28:39.000Z",
          "Titre": "When I need help with a card…",
          "Contenu": "When I need help with a card replacement the customer service team was extremely helpful. Reason for not 5 stars was the replacement took well over 2mo to resolve"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Byrne",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T07:46:55.000Z",
          "Titre": "It seems to be ok I couldn't figure out…",
          "Contenu": "It seems to be ok I couldn't figure out how to put money on my kids cards so I use send bonus but I haven't given them the cards yet"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sheridan Phinezy",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T23:01:46.000Z",
          "Titre": "The price isn’t bad",
          "Contenu": "The price isn’t bad, I got my kids cards in a timely manner, the only downfall is the the fee they charge for sending kids money. I feel that this should be free if other family or friends wants to gift my kids money. Cash app doesn’t even charge a fee for sending money. And I wish my kids were old enough for me to sign them up under me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason C Watkins",
          "Nb_Reviews": 2,
          "Date": "2023-05-21T04:04:37.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. Very accommodating to changes so I’m just waiting for the BusyKid card arrives so we can experience it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 4,
          "Date": "2022-09-27T20:27:12.000Z",
          "Titre": "I'm still new to this but I am finding…",
          "Contenu": "I'm still new to this but I am finding it difficult to navigate to the settings for each child. There should be a way for the children to transfer funds back to the parent. Maybe there already is. Again, very new to this app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jnsch Sch",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T03:41:16.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use. Putting money on their card is easy. Setting chores and paying them after they do them is easy. Can send QR code to other people who want to give them money. They can keep up with their own spending."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richella",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T08:04:32.000Z",
          "Titre": "Is a great service",
          "Contenu": "Is a great service, could be easier to work and understand. Wish you could make your own chore list and price with ease."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T15:23:03.000Z",
          "Titre": "Still no cards - Updated",
          "Contenu": "Update:I did receive an email shortly after submitting my original review and he was helpful in getting a new batch of cards shipped out.I made it clear that yes, I'd like to have the cards, but the most frustrating part was that the app didn't tell me anything aside from 'card processed'. That is fine if everything goes correctly, but is a black box of nothingness when you are trying to figure out if the cards actually shipped, when they shipped, where they shipped from, and when I should start worrying. Everything else ordered online and shipped here in 2022 seems to generate more emails/notifications than I need. Having no information was frustrating.Once received cards were activated through the app. I changed the funding source (I think you can only have one - ?). It would be easier for someone like me who usually has two or three full-size screens within arms reach with the password manager to work with a web page instead of reaching for the tiny screen and having to copy and paste 16-char random passwords from the password manager since the password manager screen overlay wasn't working in-app when adding (changing) funding sources, but I realize I may be an edge case there. Sometimes things are easier from mobile, sometimes things are easier from a web page. I think it would be nice to have a web page to manage the account as an option.Once up and running the app looks straightforward. With only hours sunk into the process there isn't too much to report back on so far.Original Review:According to the app the last activity was July 30, new card processed. It is now Aug 27. Is there a new card still on the way? Is there a problem on their end? Did it get lifted from our mailbox? Is there an ETA?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelley Coalier",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T18:02:11.000Z",
          "Titre": "Would recommend",
          "Contenu": "My son lives this and I really like the flexibility to give him extra money for extra chores as well as being able to instill the habit of setting a percentage aside to donate to causes you believe in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel H.",
          "Nb_Reviews": 5,
          "Date": "2023-08-14T02:22:56.000Z",
          "Titre": "I love this app I think it's o This is absolutely the best chore payment system that I foundne of the…",
          "Contenu": "I love this app I think it's one of the best if not the best one out there I love how you can put chores on there and put amounts on there and then the child can go in and mark off the ones they did and that the end of each week the parents are notified of what they should be getting and that you have a chance to verify that they did in fact do the chores and then you get to pay them onto a card that they have access to that's awesome The only absolute only discrepancy I see in the whole system is it's actually very difficult for me to move money from my son's card to my account. So for some reason my son needs cash and so I want to move it to my account to take it out and you I think if you put it onto the card to be used as a credit and then you change your mind it's nearly if not completely impossible to move it back to where you used to have it I haven't completely figured that all out so I can't really say that you can't do it If you can it's difficult. That's such a minor minor minor issue for me. All of the other benefits absolutely outweigh that one negative"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel K",
          "Nb_Reviews": 3,
          "Date": "2023-01-12T22:46:38.000Z",
          "Titre": "Look for a Different Solution",
          "Contenu": "When I signed up and money was going in, things worked very smoothly. I tried to close the account when they changed from a monthly premium to an annual contract.  Now, when money flows in the other direction things are a mess.  I started corresponding with \"Scott M\" via email.  He was VERY quick to respond to all emails and he supposedly closed the account and sent me the check in mid Dec.  After two weeks I followed up and was told the check was sent and that if I did not get it by weeks end he would have a new one sent.  The week ended and I never got it and now Scott has gone dark.  No response for 5 days.  So now I call back and am told the account was never actually closed and they will do so now and that I will have to call again to have the check sent.  All this on top of a claim that the account holds less than half of the funds that I was told were in there originally.  I'd like to look at the transaction history but I can no longer see any details of the account in the app and have been locked out (does this mean it actually was closed?). What a mess.  I look forward to the Presidents response to this like all the other complaints on here.  If you are looking for a credit option for your kids, do yourself a favor and look for another solution.Edit: Literally the next day the President reached out and made an apology and a good offer to keep my business.  I accepted.  I think their systems are pretty mucked up but I have to appreciate the effort to make things right.  Adding 2 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MN Outdoorsman",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T19:40:59.000Z",
          "Titre": "BusyKid is a great idea for several…",
          "Contenu": "BusyKid is a great idea for several reasons but sometimes there are \"glitches\" that can cause real problems. Pros:* Total control over how much money kids get* 100% visibility into where the funds are spent* Self-contained so parent's funds are not at risk* Widely accepted (on-line, retail, etc...)* Kids can see how much money is in their account* Deposits to account can be allowance or a \"bonus\"* Bonuses generally available immediately* Helps kids manage their funds and plan purchases* Set up is pretty simple and user friendly* Easy way to send emergency fundsCons:* Occasional lag in crediting bonuses to kid's account* Fees when the card is declined ($0.50/per)* Some transactions not permitted (Venmo)* No way for kids to deposit funds if they have income* Little to no live customer support* Lag time in responses from customer supportOverall, this is a descent solution for our purposes. We have 1 kid in college and 2 in high school. All are driving so gas money and some money for food is always needed. We used to let them use a credit card but we had no control over spending until after the fact when they racked up big bills. This helps significantly and it is generally seamless once it is all set up. One key tip is that many transactions require a PIN and the kids need to set that up. We had a few glitches when the kids thought they were using the correct PIN but we learned that we did not set that up properly. Once that was done, things started working much better and there were no more declines. I would say that this is the best way to go if you give a regular allowance and the kids can stick to it. It is a good solution to send emergency funds too but the occasional lag in crediting the kid's card could be a problem is there is a real emergency. I deducted one star for 3 reasons: 1) lag in crediting bonuses to the kid's account, 2) lack of real-time customer service, and 3) the process to set up a PIN was not obvious. That said, I do recommend this for parents who need a way to control and monitor the money given to the kids."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Addie Trevino",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T17:39:03.000Z",
          "Titre": "It was easy to obtain and the website…",
          "Contenu": "It was easy to obtain and the website was very helpful and easy to navigate!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T17:06:45.000Z",
          "Titre": "Good App, Easy to Use, A little Expensive.",
          "Contenu": "It would be nice to be able to update the debit card key code with the app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JenniA",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T15:22:46.000Z",
          "Titre": "I really have enjoyed Busykid but...",
          "Contenu": "I really have enjoyed Busykid, the only downside is the price you pay for it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heather Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T22:22:59.000Z",
          "Titre": "Great customer support",
          "Contenu": "Great customer support to help when in a jam"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Walter Bellini",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T23:16:26.000Z",
          "Titre": "BusyKid Setup works but needs a few tweaks",
          "Contenu": "We have been using the BusyKid App for over one year, and it works well. We have two accounts, one for each child. My daughter's account had a few fraud charges hit at the beginning but Support took care of it within a few days, no issues there. My son's account has never had any problems to date so far. This posting is to put in the RADAR for BusyKid, hopefully, the following issue and request to change the interface a bit to help reduce confusion. In the app, there is a \"GET CASH\" button; this button should be changed to something like \"RETURN MONEY TO PARENT,\" or \"RETURN TO SENDER,\" and the paragraph within that button should read as: If you choose this option you will NOT add any money to your BusyKid Card but in fact give money back to your parents!This button is very confusing and shouldn't be on the main page; perhaps something found in Advanced or Accounts/Settings. This button is confusing to kids as it looks like this is the method to add cash to your Card but it is not. Yes, I know there is an approval process, but if you're not paying attention, parents will approve it without understanding the result, thinking it is just an extra layer of protection to move money to the card. The option to LOAD CARD is the correct method and should be the only thing they can use. Yes, I know you can Send a Bonus directly to the Card, but that is not how I teach them to use the card. We put money into their Spend Bucket, and they Transfer only what they need to the card at the time of purchase. This way, any fraud is minimized as they control what amount is available on the card at all times and no more, as you can't take back money from the card.The other issue is that I recently added my wife to the BusyKid App, and she added her own Funding Source. So last night she added $40 to my daughter's Spend bucket account, and then my daughter went out on her school trip, but she mistakenly used the GET CASH process and sent all the money back to my wife's funding source and she had nothing. The wife checked her debit card account and found nothing listed as credit. I checked my debit card account and found the missing money there, where it should not have been, since my debit card was NOT used to fund my daughter's account. I called and spoke with super friendly and helpful Lisa S, and she told me that BusyKid only credits back to the primary account holder's funding source and not where the funding came from if it is from another person's funding source. This makes no sense at all! Plus the credit amounts were not precise and were broken up into three separate amounts that have no correlation to match up to any transactions on any card accounts.I also asked Lisa which is the fastest way to get customer service, as leaving a phone message and waiting for a call back when there is an issue is sometimes frustrating waiting 3 to 4 hours. Lisa mentioned chatting, which is the method I will use when I need immediate support, and phone support when it is not an emergency. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Baca",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T01:51:06.000Z",
          "Titre": "Your kind of expensive",
          "Contenu": "Your kind of expensive.  This cuts into what my child has to spend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harvey",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T02:17:48.000Z",
          "Titre": "Great solution for kids who are…",
          "Contenu": "Great solution for kids who are interested in financial management. The matching and giving features are particularly beneficial in teaching our son to appreciate banking and fiscal responsibility."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Virginia Moore",
          "Nb_Reviews": 3,
          "Date": "2023-09-02T02:28:17.000Z",
          "Titre": "Jumpstart To Learning Money Management",
          "Contenu": "Great way to have my children learn fiscal responsibility."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T22:16:11.000Z",
          "Titre": "Only issue I have is not being able to…",
          "Contenu": "Only issue I have is not being able to change the cards pin."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helen Cerda",
          "Nb_Reviews": 3,
          "Date": "2023-08-18T04:46:07.000Z",
          "Titre": "Just using til she gets a real bank acct"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debbie Hudon Kinsey",
          "Nb_Reviews": 2,
          "Date": "2022-06-14T22:19:31.000Z",
          "Titre": "I think for the kids it's a great app",
          "Contenu": "I think for the kids it's a great app. I didn't mind spending the initial money to get into the program. However I did not realize that every single transaction would also have a fee connected to it. Other than that I was in there it's great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-01-23T11:53:59.000Z",
          "Titre": "Everything is pretty awesome for the…",
          "Contenu": "Everything is pretty awesome for the most part. I am only uncomfortable with the level of difficulty it is to actually speak to a live person when an issue arises. I've had to call customer service/ tech support twice & has never spoke to a live person. Although both issues were resolved, this still leaves me a bit uneasy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris G",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T01:41:39.000Z",
          "Titre": "BusyKid is great, but could use refinement",
          "Contenu": "BusyKid is great. Try it. However, I would like to see the stock purchase mechanic change. When you buy a stock you are actually buying a gift card that is redeemable on StockPile. That's fine and works well. But, there is no transparency between StockPile and BusyKid, so in BusyKid you don't actually see your total savings (BusyKid + StockPile). You only see what you haven't \"spent\" in BusyKid. To see your other savings you have to log into StockPile which is a different app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracy Shields",
          "Nb_Reviews": 1,
          "Date": "2021-07-19T16:20:23.000Z",
          "Titre": "Will recommend to friends",
          "Contenu": "I love the chores and Busy Kid card. I would have given it 5 stars, but the donation feature is cumbersome. Buying stocks is also a mutli-step process. Make sure you set up and connect your bank though Stockpile before you introduce your children to Busy Kid. My son was super excited to start buying stocks, but it took almost a week to get everything registered and confirmed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mrs.",
          "Nb_Reviews": 2,
          "Date": "2021-07-29T13:09:57.000Z",
          "Titre": "Card not automatically ordered once account is funded",
          "Contenu": "I thought that once the account was funded that the card I had selected would automatically be ordered.  When I emailed customer support, they said it had to be ordered AFTER the card was funded, so my grandson is anxiously awaiting his card.  It would be helpful if this information was more clearly communicated during the enrollment process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-04-19T01:25:31.000Z",
          "Titre": "I have paid for service for 3 month…",
          "Contenu": "The president reached out to me and made an honest attempt to make things right. We received our cards finally today, 4/18, and we were refunded and our account was credited. I will update after we have an opportunity to use the services."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Fulton",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T20:25:03.000Z",
          "Titre": "Some fees, but not many if you know what to do.",
          "Contenu": "Hidden transfer fees when they specifically say there are none.Edit: The president DID reach out to me and ensured that I understood how to avoid the fees.Updating my review to reflect that it IS a convenient solution. Just know that unless you are transferring straight from your bank account, there will be fees. Again, it's not actually a huge deal but it would be nice if that was mentioned aside from a small disclaimer after paying and trying to set it up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynn E",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T21:30:41.000Z",
          "Titre": "Busy Kid has been a great motivation…",
          "Contenu": "Busy Kid has been a great motivation for my teen.  He is enjoying buying stock, supporting charities & loves the preloaded credit card.  The one thing I wish it had was a bucket for extra chores that isn't based on date. My kid is busy, and if I put them on a calendar date and they don't get accomplished, it's easy to forget what day they were assigned. I also wish we could choose our own charities. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jolpn",
          "Nb_Reviews": 2,
          "Date": "2021-06-15T14:40:37.000Z",
          "Titre": "BusyKid is a great option to help teach kids about money!",
          "Contenu": "BusyKid is a great option to help teach kids how to make wise choices. They can learn through real time application. The chores feature is great! Money doesn’t grow on trees, you want it, you earn it. I’m a senior raising two grandchildren. Some of the applications have been challenging for me. Overall, it’s a great product!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristy Dominy",
          "Nb_Reviews": 1,
          "Date": "2021-02-26T21:35:03.000Z",
          "Titre": "I really like this App for tracking…",
          "Contenu": "I really like this App for tracking chores and the kids love having their own cards. The only thing I would say could be improved upon is once you load money on the card you can't take it off. Kids like to order things online (card doesn't work for online purchases) and they can't pay me back the money because you can't remove money from cards."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kasey Gannon",
          "Nb_Reviews": 2,
          "Date": "2021-08-19T13:10:24.000Z",
          "Titre": "I really like this app",
          "Contenu": "I really like this app.  It is a affordable solution vs other kid debit card apps.  -1 star because when my son looks at his chores on his Iphone SE, all of the text does not show, nor can he tap on the chore to see the full text or zoom out to do so.  I would also like to see the option for bi-weekly or monthly paydays.  I understand I can physically pay bi-weekly by approving 2 pay days at a time, but the child only sees that he was not paid on \"pay day\" according to his app,  not realizing we pay bi-weekly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dalelene ML",
          "Nb_Reviews": 2,
          "Date": "2021-09-09T21:59:55.000Z",
          "Titre": "Our Whole Family Loves BusyKids",
          "Contenu": "My whole family has enjoyed using busy kids! I would appreciate child-friendly informational videos embedded in the app, however, that explain and teach kids about investing. There is the option to invest, which I LOVE, but nowhere that teaches kids exactly what it is before they do it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon Davis",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T00:22:55.000Z",
          "Titre": "The idea is great to be able to pay for…",
          "Contenu": "The idea is great to be able to pay for chores.   Some of the features could be better.   I would like to see where you assign a chore to all your kids and once it is complete it 1 goes away from the list for the day and 2 that you're other kids don't have away to mark it off too, because then I wouldn't have to manage ebay kid did what chore."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 2,
          "Date": "2021-09-21T18:58:32.000Z",
          "Titre": "Just getting started(UPDATED)",
          "Contenu": "Card takes a bit to get. I advise not letting your kids know about this untill you have the card, as my daughter was very excited got busy with earning, but the excitment slowed when it took a while for the Card/reward. We have had the card for about a month. App and card work well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica Johnson",
          "Nb_Reviews": 1,
          "Date": "2021-03-20T20:09:42.000Z",
          "Titre": "Simplified, easy chore scheduling",
          "Contenu": "I was writing a chore list everyday and this app has completely simplified the process. I love scheduling repeat and recurring chores ahead of time. Pre-set rates for the chores are a little high, I had to massively adjust or my boys were earning a ridiculous amount weekly. They were going to have to start paying me to live! I'd love more options for savings. I don't really want to delve into stocks so some sort of savings account program would be great. Overall we love Busy Kid!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dianna Green",
          "Nb_Reviews": 1,
          "Date": "2020-09-01T18:36:28.000Z",
          "Titre": "Busy kid has been great",
          "Contenu": "Busy kid has been great! It has motivated my kids to do their chores and actually see the money add up. Week 2 and they check their chore list everyday! One recommendation I have is the option to auto delete a chore that was not completed on assigned day or the app to mark it as incomplete and will not be paid unless approved by a parent. But, overall, a great app and fees are minimal if any based on your chosen methods."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michele Rookwood",
          "Nb_Reviews": 1,
          "Date": "2020-08-22T21:15:02.000Z",
          "Titre": "Just the motivation needed",
          "Contenu": "So far this app has motivated my 12 year old to actually do her chores.  The app has been easy to navigate .  I like the bonus feature that allows additional money to be added. My daughter has been asking for more tasks which is a blessing to this busy family .   We choose to order the busy kid credit card this has given us the opportunity to have meaningful money discussions .  I look forward to additional features."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sheila Castellano",
          "Nb_Reviews": 1,
          "Date": "2020-08-24T02:41:13.000Z",
          "Titre": "A Lesson Learned",
          "Contenu": "My daughter and I are really enjoying the benefits of this app. It helps her learn how it feels to earn her allowance and with the spend, save and share distribution she is learning how to set funds aside to help support causes and for rainy days. In my opinion both very invaluable lessons. At 14, she is becoming more financially responsible and I really appreciate that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason S",
          "Nb_Reviews": 1,
          "Date": "2020-09-12T21:10:54.000Z",
          "Titre": "Great app! Motivates kids and helps to get them organized.",
          "Contenu": "Great app!  Gets kids motivated to complete chores around the home. Like that a value can be assigned to each type of chore. App could be improved by offering get cash option upon pay day approval or if the bank transfer could complete sooner. It would also be helpful if the chores could be approved daily and keep the pay day approval weekly or every other week."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela Allen",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T20:09:23.000Z",
          "Titre": "I like the price of the cards",
          "Contenu": "I like the price of the cards. Only a yearly fee. I did have trouble selecting a certain background for the cards when I first ordered them, which means I will have to buy again out of pocket cards. Also, the app can be tricky when adding a chore. It doesn’t always stick.   Other than these two issues, I really like the use of the cards."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-09-30T03:39:32.000Z",
          "Titre": "I love the ideas and spirit behind…",
          "Contenu": "I love the ideas and spirit behind BusyKid. The android and ios apps are functional but have a lot to be desired in terms of user experience. The app seems designed for phones and not tablets/ipads. Both my kids have ipads and on one of them, the app constantly freezes. Overall though, 4 stars from me b/c the app serves its purpose and my kids are learning about spend/save/share, and I don't have to carry around cash :-D. Thank you BusyKids!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kaylie Walkington",
          "Nb_Reviews": 2,
          "Date": "2020-10-08T04:31:21.000Z",
          "Titre": "I had a really hard time ordering the…",
          "Contenu": "I had a really hard time ordering the two debit cards. It was a very complicated process, and in the end I got four cars instead of two. After talking with Busy Kids they said it was an issue with their card provider. So the real review should go to them. Busy kids fixed the problem and my kids are loving their cards!  Problem solved.  Also love the app!"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Mirian",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T12:52:26.000Z",
          "Titre": "It could be more intuitive, but it’s working for us",
          "Contenu": "It’s taking me a while to figure out how to use the app. All I wanted was to give my daughter a card with funds, but with this app your child can have money accumulating and use the card less. It’s going well for us, I just hoped dor it to be more intuitive to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle Stickel",
          "Nb_Reviews": 2,
          "Date": "2020-08-24T03:49:09.000Z",
          "Titre": "I love the convenience of the app...",
          "Contenu": "I love the convenience of the app to transfer money to my boys' debit cards.  I also like that it works with Stockpile.  My boys have already started buying stock at the ages of 10 and 13!  I wish they could pull money out of an ATM with their debit cards.  Also, I read that soon kids can donate to local charities.  We are waiting for that!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andy Hill",
          "Nb_Reviews": 2,
          "Date": "2020-09-24T11:43:18.000Z",
          "Titre": "My Kids Are Busy Helping",
          "Contenu": "My kids are really enjoying the app and how it ties to their debit card.The chore and reward functionality fits with our family plan. I’m so happy to see my kids busy helping out the family every day.My wife and I would like to see the app have more flexibility with “Payday” as that has already become a sore point for our family."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Devra McNeely",
          "Nb_Reviews": 1,
          "Date": "2020-09-01T18:27:27.000Z",
          "Titre": "I do like this app a lot",
          "Contenu": "I do like this app a lot. However there are a few things that I wish I could have more control over. For example I would like the option of changing when \"Payday\" is or frequency ie. every 2 weeks instead of every week. Also some more options as to the chores. Like how often they can be done.  An example is if a chore is weekly but can be done any day of the week so once it has been done it no longer shows up for that week or it shows that it was already completed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-09-07T00:03:38.000Z",
          "Titre": "Busy Kid has Made Chores Less Boring for my Kiddos",
          "Contenu": "I have been very happy with Busy kid! It's been a great way to manage chores with my kids while helping them to learn valuable money skills.  The app is easy to navigate and use. My only nit-pick is it would be nice for there to be a \"kid friendly\" side that kids see. With small icons/graphics and a chart to help little kids (ages 4-6) to be able to take control of keeping track of their chores (Since they're learning to read at this age). Definitely recommend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle Moore",
          "Nb_Reviews": 1,
          "Date": "2021-04-04T16:56:29.000Z",
          "Titre": "Need more time",
          "Contenu": "Haven’t been using it quite long enough to say whether I like or dislike it. Wish we could cash app money to them since their aunts and uncles want to send money.So I just heard they will have it available soon for other family members to send money. So excited for this. Thanks BusyKid"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clint Woodruff",
          "Nb_Reviews": 1,
          "Date": "2020-09-09T20:40:09.000Z",
          "Titre": "Great way to pay our kids",
          "Contenu": "We've had a good experience so far. We recently received our cards and the setup was pretty quick and easy. However, creating an online account wasn't as simple as other applications. The app itself is simple and user friendly. Overall, we've been pleased with the app and look forward to continued use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Piazza",
          "Nb_Reviews": 1,
          "Date": "2020-11-25T15:00:41.000Z",
          "Titre": "Useful app for engaging the kids with…",
          "Contenu": "Useful app for engaging the kids with their chores and providing a streamlined mechanism for getting their allowance to them instead of using cash. There are a few UI changes I'd recommend to make the app even better but it is intuitive enough for me and for the kids and we are seeing use with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sophea Thach",
          "Nb_Reviews": 1,
          "Date": "2020-12-08T23:46:00.000Z",
          "Titre": "This is a great app",
          "Contenu": "This is a great app!  Wonderful way for kids to earn money and parents to keep track of their chores.  The only complaint I have is that I wish the cards had the \"no contact\", tap capability.  The card needed to be swiped a few times at the merchant.  Other than that, we love this app!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy Achey",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T21:21:25.000Z",
          "Titre": "Took about 3 weeks to get the BusyKid…",
          "Contenu": "Took about 3 weeks to get the BusyKid card. But once we did and activated it, it is super easy for her to use, and easy for me to add money to it if she is going out with friends or away that needs extra spending cash. The money is there and accessible right away."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C Brown",
          "Nb_Reviews": 2,
          "Date": "2021-08-06T14:51:22.000Z",
          "Titre": "So far, so good",
          "Contenu": "So far, things have been good. Our three kids - 12, 10, and 6 - all have cards. The only issue I have is with the instructions. The cards should come with clear directions (not small print) on the card usage and online functions. Otherwise, we really like it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thaddeus Bridges",
          "Nb_Reviews": 1,
          "Date": "2020-09-16T13:46:15.000Z",
          "Titre": "Customer service was great",
          "Contenu": "Customer service was great. Activating the cards were simple. You call to activate cards. Then unlock cards within app. I panicked when i thought i had to pay a monthly fee but its only if you opt in to pay for paper statements. You don't pay for the paper statement unless you actually opt in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jae",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T13:15:41.000Z",
          "Titre": "Overall I enjoy the app",
          "Contenu": "I enjoy this app and it helps my kid remember his daily responsibilities. I also wanted to find a way to start teaching him that we all have to work for our money... and slowly I think he is getting it. If I could change anything it would be to add a paid option.... my son had a bank account before using this app so we have no need for the card.. I don’t like having to transfer to him and then having him transfer it back just to clear out his balance. I would prefer an easier way to clear his balance without all the transferring."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lyndopo",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T18:59:10.000Z",
          "Titre": "Great concept but be aware that ONLY the main account holder can make payments",
          "Contenu": "**UPDATE**We figured out the problem. It doesn't say anywhere that the second adult on the account can NOT pay the allowance. It MUST come from the main account holder. The second adult can only send bonuses. Had we known this beforehand, we would've set up the account differently. ______________________________This app is highly glitchy. While it's cool to have the features of the chores and setting prices, whenever it's pay day, it logs us off when we try to approve the funds. EVERY. SINGLE. TIME..... MULTIPLE. TIMES. It's extremely frustrating."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Norgaar",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:17:14.000Z",
          "Titre": "A Debit Card that gives more bang for your buck!",
          "Contenu": "Compared to other similar banking programs for parents/kids, BusyKid has the most bang for your buck. It's more than just a debit card that can be controlled/monitored by parents. It's a beneficial tool that teaches kids realistic expectations in regards to money once they become adults, things like earning, saving, donating ,tracking purchases, receiving bonuses, and plenty more incredible features! What I like most about BusyKid is how it's set up for kids to complete chores while also earning money they receive on their set paydays. There are also customizable features which provides an even better, more realistic experience for all involved. I am a happy parent with a happy, financially responsible teenager."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Bensmail",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:29:55.000Z",
          "Titre": "I am loving the app so much!",
          "Contenu": "I am loving the app so much!! Customer Service is amazing and specially Norma!!! She was great and gave me all the help I needed to make my decision of subscribing to Busykid 😃😃"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Bingham",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:15:37.000Z",
          "Titre": "Great customer service",
          "Contenu": "Have used BusyKid for my daughter for a couple of years and have always been happy with it.  Never had the need to reach out to customer service until this week and Lisa did a great job assisting me.  Would recommend BusyKid to anyone looking to get their kids started with learning about money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Schiller",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T06:13:50.000Z",
          "Titre": "BusyKid has taught my kids appreciation for money",
          "Contenu": "My two daughters use BusyKid all the time and it has really helped them learn to manage money. By having some measure of control over their saving, spending and charity they value what it takes to earn money and appreciate how it can be used."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean P.",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T02:07:08.000Z",
          "Titre": "BusyKids helped teach my kids responsibility!",
          "Contenu": "I signed up for BusyKid when my kids were young children. My daughter is in college now, and my son is in middle school. Both have learnt that money doesn't grow on trees, it is earned, by doing their chores or tasks. It has also taught them to save their money and only spend what they can afford. My son thinks twice about spending his money on things that he wants versus what he needs! I look forward to see how BusyKid evolves with new services to help kids as they become teens and young adults! I look forward to a BusyTeen app, I'm sure they are working on it! responsibility"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T15:56:27.000Z",
          "Titre": "Wonderful app",
          "Contenu": "I've used this app with my daughter for about 7 yrs now. I added her brother 4 yrs ago. I love this app. Busy kid customer service always responds to even the most simple questions.  Thanks Busy Kid!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan Lemmon",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T05:33:59.000Z",
          "Titre": "Great app",
          "Contenu": "We just started using the app and have really enjoyed it. They have thought of everything and I love how my son is learning financial literacy and the importance of saving. He is only 6 but I expect we will continue using the app for many more years. As first time users we had some questions for customer support and Scott quickly responded with clear and helpful answers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kayla Cuba",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:13:21.000Z",
          "Titre": "Issue resolved in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHERRY",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T02:23:48.000Z",
          "Titre": "Great app for kids to learn about money",
          "Contenu": "Great app for kids to learn financial responsibility and learning to.save. iI like that my.kids ate able to donate to.chatity causes as well as invest in stocks and learn about the stock.market. My kids are tweens and teen boys so they do not do.much.of.the chores.list; but it is great for.them to.learn how to follow the news and stock market ups and downs. Wish I had this when I was younger."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ERIN  Musick harris",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T01:52:04.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Chelsi helped me out with my account and was understanding and patient with me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Caughlan",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T01:27:35.000Z",
          "Titre": "Great quality customer service!",
          "Contenu": "Chelsi was excellent.  I had a fairly simple request but didn't realize that there were several ways that it could be resolved.  Chelsi explained them and I was able to decide on what worked best for me.  Chelsi also offered to provide a follow up notification via email to make sure things were resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T20:38:26.000Z",
          "Titre": "Love it!",
          "Contenu": "Great customer service. I love this app. My kids are always asking to do something more and I’m happy to use the app. I would recommend to anyone who has children needing to do chores. Great savings again, great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T23:27:40.000Z",
          "Titre": "Great tool to teach financial responsibility",
          "Contenu": "BusyKid was a great tool to teach my boys how to earn and be responsible with their money.  As a single mother, there are options to make life easier like automating allowance and giving them interest.  We have been using for about 5 years and I feel confident that my 16 year old will now be financially successful in transitioning to his own bank account. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsay",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T03:43:08.000Z",
          "Titre": "Love this app",
          "Contenu": "Love this app! Its motivated my kids to do more around the house, helped us better establish after school routines, and is teaching my kids financial responsibility. I’ve recommended to multiple already and will continue to do so!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ullie G",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T21:00:20.000Z",
          "Titre": "Easy to use app with great features.",
          "Contenu": "Easy to use app for both parent and child, with savings match and investment features. My daughter has never had an issue with her card, can use it everywhere. It's also great that she can easily keep track if her allowance and spending, and the convenience of a card instead of kids having to carry cash is great! The chores feature for the kids to mark down extra chores they do, and earn extra monies for it is an extra bonus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "paul mittan",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T00:16:24.000Z",
          "Titre": "The app works great for both of our…",
          "Contenu": "The app works great for both of our boys. Whenever we have questions about using the app, we receive a near immediate response. Recently, we had questions about the features and Chelsi provided a bunch of great guidance! Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allie Mason",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T02:19:28.000Z",
          "Titre": "Best chore and finance app I’ve found",
          "Contenu": "I use this for my daughter’s daily chores and tasks. I love that I can set a zero dollar amount for expected tasks and pay her for extra jobs. It also helps her learn financial skills because she controls her own spending and sees how much her savings builds by contributing consistently over time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Regina McQuiller",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T09:21:33.000Z",
          "Titre": "Busy kids is a wonderful program to teach fiscal responsibility.",
          "Contenu": "Busy kids is a wonderful program to teach your children about budgeting, investments (stock), giving( giving to a charity), saving, earning(chores, babysitting etc.) and spending. It takes all the guess work out and focus on teaching a child to find a balance and how to build a financial infrastructure by providing tools that can apply for life. Would be a great program for adults who had never built a financial spending balance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roderick Ehlinger",
          "Nb_Reviews": 4,
          "Date": "2023-09-14T19:56:43.000Z",
          "Titre": "I love Busykid and everything it does…",
          "Contenu": "I love this app and everything it does for both parents and their kids. We have been using it for a few years now. It is a great way to start a child’s journey into finance and teach them the value of saving, investing, giving, and most importantly, spending their money. One of my favorite features is the ability to purchase stock for each child and watch them learn how these vehicles help them invest into their future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Gaia Member",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T20:14:27.000Z",
          "Titre": "Great tool to give kids independence",
          "Contenu": "Busy kid has been a great tool in helping my child understand the importance of money and making him feel independent as well.  It has led to interesting talks about investments and allows my child to control how much is allocated to investing.  He feels proud when we go into a Costco store (for example) to know that he has the option to buy shares in the company in addition to growing his savings.  Thanks Busy kid for offering this great app!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen in AK",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T19:43:04.000Z",
          "Titre": "Busy kid has been great for our family",
          "Contenu": "Busy kid has been great for our family. Cheaper than many options with multiple kids and you don’t need cell phones to use it. Transferring funds is super quick and easy and assigning chores is also easy to use. We’ve been using it for several years and they keep it up to date and make frequent improvements."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Sims",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T06:10:52.000Z",
          "Titre": "You need this for your children's sake",
          "Contenu": "The Busy Kid platform is easy and it will teach your kids to not be entitled.Yes, they have to actually have work and be respectful to earn their allowance. They can even suggest activities and get renumerated for their work. No, it will not make for 'money-oriented-reward' for every task they complete and you won't have a spoiled brat on your hands."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beewithbabes",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T04:04:46.000Z",
          "Titre": "Easy to use and set up",
          "Contenu": "I really like the ease of connecting to my bank account, bro g able to put money directly on the kids cards if needed but also having accounts with 3 separate categories helps my kids so much. The fact that they keep our kids data secure was absolutely of the utmost importance to us. Really happy so far"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Willard",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T20:12:47.000Z",
          "Titre": "I have 5 children and keeping their…",
          "Contenu": "I have 5 children and keeping their allowances, birthday & Christmas money organized could not be easier.  As with any application you have to learn how to use and it's simple enough to figure out things.  My children can check what they have earned and encouraged to achieve more.  I would like to be able to invest more in stocks for each, but there are limits.  Even with that short coming I am very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Casabianca",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T03:51:12.000Z",
          "Titre": "Worlds better service than alternatives",
          "Contenu": "I turned to BusyKid after trying and failing repeatedly to connect with another similar service. I was so pleased at how well everything either worked \"out of the box\" or was very quickly and professionally addressed through the email help tickets. We've been using BusyKid heavily with our 3 kids (9, 11, 13) over the past few weeks, and we're all enjoying the experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FabFilter",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T18:10:58.000Z",
          "Titre": "This allowance app is positive reinforcement!!!",
          "Contenu": "This allowance app is positive reinforcement for my 17 yr old son with Autism! Now...he actually wants to do simple chores! I have added a reward for Bonuses. As well as a Cooperation bonus for $5! This has helped him visualize about earning a \"paycheck\" and how money  is used in society!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Fallon",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T23:32:56.000Z",
          "Titre": "We Love Busy Kid!",
          "Contenu": "I love the independence my kids have with managing their money and I think this app has the right amount of parent control.  We’ve used for a number of years now and it’s become a regular way of communicating about chores and making and saving money.   The flexibility is great and family can gift money easily too and it’s all in one place!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawna Eaton",
          "Nb_Reviews": 3,
          "Date": "2023-09-15T06:29:38.000Z",
          "Titre": "Great app for chore management!",
          "Contenu": "My kid is very money-driven and she loves crossing things off lists, so this app is great for her. I love that we can set the allowance amount due for each chore and that we can customize chores and modify them as she gets older. I also love the QR code that can be shared for my kid's birthday or other events."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel Carboni",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T17:04:31.000Z",
          "Titre": "This has been great for our kids to learn about money management!",
          "Contenu": "This has been great for our kids to learn money management and the value of money.  Also, their bedroom has never been cleaner!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marni Coleman",
          "Nb_Reviews": 3,
          "Date": "2023-09-02T04:38:04.000Z",
          "Titre": "Great monetary education for the littles",
          "Contenu": "My 11-year-old has learned so much from having their own debit card and busykid account for the past few years. They love saving for things they want, and seeing their end-of year donations to homeless shelters and food banks warms my heart!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jones",
          "Nb_Reviews": 3,
          "Date": "2023-09-05T19:57:24.000Z",
          "Titre": "Good company and card, not the best money transfer.",
          "Contenu": "Easy interface and responsive. Low cost to use. Transferring money back to the funding source is a bit problematic. Limits to 100.00 a pop and the transfers come in broken up into multiple values. Strange. Overall, the better of the options available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christa Mazzone",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T01:45:02.000Z",
          "Titre": "Great experience!",
          "Contenu": "We've had a great experience with Busy Kid! It has really helped my son gain independence and the customer service was very quick and positive when his card wasn't working. Cindy was very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T14:11:02.000Z",
          "Titre": "Busy Kids is a great way to pay kids…",
          "Contenu": "Busy Kids is a great way to pay kids for chores, give them spending money for trips, or money for birthdays and holidays. My child enjoys having a card instead of cash, especially since I can add money instantly in case of an emergency or something like that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esther Helser",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T03:27:54.000Z",
          "Titre": "We’ve been using BusyKid for several…",
          "Contenu": "We’ve been using BusyKid for several years now. It makes tracking chores and paying allowance super easy. It also shifts accountability to the kids. They can track their progress and manage their own money without us interfering or nagging. Do the work and get paid. Don’t do the work and you won’t.  BusyKid is well worth it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T. L. Chapman",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T00:46:15.000Z",
          "Titre": "My child loves to Earn Money using Busy Kid!",
          "Contenu": "We love Busy Kid.  My grandson loves completing his chores and homework goals on the app.  When he see that his funds are adding up quickly, it motivates him to want to do more.  It teaches him about saving, investing and charitable giving."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenni Brand",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T13:24:23.000Z",
          "Titre": "Best app of its kind",
          "Contenu": "Probably the best app of its kind. Great customer service. We love the responsibility and accountability lessons it helps us teach our son. And he loves using his BusyKid card to be in charge of his own purchasing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ian Wilson",
          "Nb_Reviews": 5,
          "Date": "2023-09-14T22:28:51.000Z",
          "Titre": "Great service, simple and intuitive, still using it after 6+ years",
          "Contenu": "We've been using BusyKid for quite some time now, like 6+ years I think.  The ability for the kids to have their own debit card they can use for online purchases, or in-store purchases is our key feature.  Being able to add money to their card instantly any time means that we don't have to plan around transfers, so if they come up a few bucks short I can help them out easily.  The chore tracking is also nice and simple, though my kids would always forget to claim their chores so we switched to an automatic $10 per week allowance and moved the \"chore tracking\" to a white board in our kitchen.  I love that BusyKid allows us to adapt our use of it to match our needs.I've only had to reach out to support a couple of times, and the interactions have always been overwhelmingly positive and helpful!Thank you BusyKid for being a part of our family for so long :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsay",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T19:42:15.000Z",
          "Titre": "A parenting tool that actually sticks!",
          "Contenu": "It is rare you find a parenting tool that actually sticks, but I’ve been using the BusyKid app for years with huge success. My children have learned valuable life skills managing money without the burden being placed on me. I love this app!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T16:50:43.000Z",
          "Titre": "Just what we needed!",
          "Contenu": "Recently started using this app. So far it is great! My 17 yr old is using the debit card. Great for emergencies and gas as well as being responsible for managing the balance. I love the ability to modify parent involvement and the ability for him to save and invest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Willow J. McIndoo Willow McInd",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:28:23.000Z",
          "Titre": "Fantastic customer support",
          "Contenu": "The customer service agent returned my call promptly and solved the issue completely. I wish all customer support ran this smoothly! A thoroughly pleasant and professional experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny Zinn",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T00:33:25.000Z",
          "Titre": "The app is so easy to use for adults…",
          "Contenu": "The app is so easy to use for adults and kids alike. The transactions are quick, no wait time when moving money around or giving bonuses. It’s such a great responsibility and money management tool for our kiddos."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hsyda Wallen",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T23:13:40.000Z",
          "Titre": "Best card for teens and pre teens",
          "Contenu": "My family has really enjoyed using this app and card. It is a great way to teach the responsibility managing money. The savings and giving options allows my pre teen to manage the monetary gifts received as well as her weekly allowance. I highly recommend 👌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TS",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T06:19:46.000Z",
          "Titre": "Highly recommended to parents!",
          "Contenu": "I have recommeded BusyKid to literally dozens of parents. We've been using it for several years, and I love the control it gives users over designing how they use it, and it's fantastic for teaching kids financial literacy and responsibility in a thoughtful, encouraging and fun way. The kids love having their own debit cards, and the app has opened up conversations about how they should spend -- and save and donate and invest -- their money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie Coleman",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T06:05:47.000Z",
          "Titre": "No complaints",
          "Contenu": "We have been using Busy Kid for more than a year and are happy with it. You have to run the card as credit, not debit, but other than that it works great! We especially love the options to donate to charity and invest in stocks, although I do wish the charity donation went straight to the charity rather than back to the parent to donate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacie",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T19:50:25.000Z",
          "Titre": "Kids enjoy using their own card",
          "Contenu": "Easy to use and setup. Can have a profile for each child/card. The kids enjoy using their own card and are responsible for knowing where it is and how much is on it for spending. The annual fee is a little steep. Could use a few different designs (I have 2 children and 1 has the white while the other has the black - even with names they’ll look similar if more than 2 children have a card)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer. L.E. Brown",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T00:21:25.000Z",
          "Titre": "This is the first card I had permission…",
          "Contenu": "This is the first card I had permission to get for my Grandson. The bonus transfers are always instant, giving me peace of mind that no matter where he is traveling, I can monitor his spending and know that as long as he’s got his card, I can supply him with funds, when necessary."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Raetz",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T22:53:57.000Z",
          "Titre": "Without delay",
          "Contenu": "I had a minor issue and I wrote to the help email.  Lisa S. wrote to me and assisted me.  Norma wrote a follow up to make sure my request was followed up on and completed to make certain I was satisfied.  Please thank them both and I’m sure it’s the entire team for being on the ball and working towards customer satisfaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marina",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T20:07:35.000Z",
          "Titre": "Love busykid",
          "Contenu": "Love busykid! My daughter is learning to help out around the house and this helps give her  independence and accountability. She will definitly continue to get much use out of it as she grows up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Whitney Watkins",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T23:18:42.000Z",
          "Titre": "We love this card for my daughter",
          "Contenu": "We love this card for my daughter. We have it set up to where she gets her allowance on certain days of the month. There is also a feature where you splits it into share and save and we love that because she has wanted to save up her money and this way she can put however much she wants in her save account. You can also put a certain amount on the card too, so that comes in handy, if your child has 100$ on their card and you only want them to spend 20.00 of that then you can go in and make it to where their only allowed to have that specific amount."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Roth",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T21:38:06.000Z",
          "Titre": "Great company to work with",
          "Contenu": "Great company to work with. And they are a wonderful service for your children. I highly recommend any parent who is trying to get your kids involved with understanding Budgeting and saving money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 5,
          "Date": "2023-08-29T04:34:18.000Z",
          "Titre": "Total package app",
          "Contenu": "Mastering delayed gratification is one of the biggest predictors of future financial success. Teach kids financial responsibility by providing them with incentives that differ in value. I love that this app not only encourages kids to develop a strong work ethic, but it teaches kids how money is earned, encourages long-term goal setting, instills real life financial skills, and connects the whole family with a fun approach to chores. With options for investing, saving, and giving available as well. My son and I have enjoyed the app for several years now. And it has yet to disappoint."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T15:32:18.000Z",
          "Titre": "My kids doesn't get their bonuses or pay day",
          "Contenu": "Where is my kids money going after its approved"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "gsheezalady",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T17:45:47.000Z",
          "Titre": "We are very happy with Busy Kid…",
          "Contenu": "I have been very happy with Busy Kid for my children allowances and special gifts. I have reached out to customer service maybe one time I think and I remember them responding very quickly. My children like having their cards. It has actually helped them to save money, I believe that it is because they aren't able to physically see the money, so they sort of forget about it. I would recommend Busy Kid to anyone who is looking for a simple, not complicated way to help their children with their homework, chores etc. If those things aren't completed, you run the risk of your card being declined due lack of funds. It is also great for grandparents to do what we like to do and give the grandchildren money. A+ and 🌟🌟🌟🌟🌟"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna Marie Leyes",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T03:22:07.000Z",
          "Titre": "We have been using Busy Kid for several…",
          "Contenu": "We have been using Busy Kid for several years. It is a challenge to NOT just give money - earn it or go without! But it has helped with budgeting, saving, and my favorite, the phenomenon of \"I want this\" and then when I point out that \"you have your own money\" that oh, I don't want to waste MY money on that!!  Great customer service, easy to use app, and the card is a great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie Huff",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T20:48:53.000Z",
          "Titre": "The app works well for my family",
          "Contenu": "The app works well to send my kids allowances and have them log their chores and I can send them extra money immediately. Wherever we’ve had a question customer service gets back to us and helps us wuickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy Vaughan",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T16:48:26.000Z",
          "Titre": "Great way to teach kids financial responsibility",
          "Contenu": "BusyKid is an easy way to pay your kids an allowance and to pay them for doing chores around the house, as well as teach them financial responsibility.  We've been using it for 2 years and it works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dayle Truax",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T16:08:41.000Z",
          "Titre": "Good experience teaching my son work…",
          "Contenu": "Good experience teaching my son work and reward and how to use debit cards for purchases. Wish i had started younger. He was a little too old for this but was still beneficial."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Britany Sproul",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T03:14:55.000Z",
          "Titre": "We've been happy",
          "Contenu": "We've been happy. It does what we need, which is give kids a way to spend their money, to make it easy and easy to care for (and no more loose dollar bills floating around the house for someone to \"find\" and keep), and makes it easy for Mom and Dad to reward them for their hard work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cleetus Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T05:01:04.000Z",
          "Titre": "I was looking for a card for my…",
          "Contenu": "I was looking for a card for my daughter who isn’t 13 yet. I wanted a way for the grandparents and family to be able to send money electronically to my daughter without me having to go to the bank ! BusyKid is awesome. Not only can I pay her allowance for doing chores ( parents set the chore and the amount) I can send her a bonus if need be and she can use the card wherever visa is accepted. I can monitor her purchases and even invest some of her money to show her how investing works. Hands down money well spent. Thank you BusyKid !! You are a millennials parent banking assistant. Awesomely done app! I forgot to mention. They can get paid for jobs by the neighbors by a “ q r “ reader. Now cutting the neighbors grass or letting their animals out comes with a payday from the neighbors !! Well done BusyKid. Well done !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachael Eaton",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T07:58:17.000Z",
          "Titre": "I love using busykid",
          "Contenu": "I love using busykid! I can change and update tasks. It has helped me keep my kids motivated, and as they get older, I can adjust the tasks accordingly. What I really love, (and has saved me so many times), is the feature that lets you \"send a bonus\". Anytime my kid is somewhere without me, and in need of money, I can transfer funds to them immediately. It is a great app and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Johnston",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T15:30:05.000Z",
          "Titre": "Busy Kid is a game changer",
          "Contenu": "I love Busy Kid! It’s been integral in teaching my daughter the value of money as well as balancing spending with saving and sharing (donations). I have recommended to other who like it as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allison",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T19:34:01.000Z",
          "Titre": "Beware of gaming purchases",
          "Contenu": "So far so good. We been using it for a little bit now. Just be cautious that any purchases for online gaming are probably foreign and thus have the foreign transaction fee."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CC",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T01:38:54.000Z",
          "Titre": "Customer service via email is very responsive",
          "Contenu": "My son recently reached 13 so we transitioned him to a regular bank account. The process of closing his busy kid account was simple. My daughter will have her busy kid account for a few more years though."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gareth Hooper",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T17:34:36.000Z",
          "Titre": "Great functionality",
          "Contenu": "Great functionality, well thought out. Excellent way for a kid to learn."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mellow mom",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T13:19:54.000Z",
          "Titre": "Great app for chores and extras",
          "Contenu": "This has been a great app for my kids. Both my 7 and 17 year old use it. From chores to sending monry to my 17 year olf for groceries or gas. And the reminders are great for payday for me. An idea for the kids side would be some sort of congratulations for working hard on their chores when I approve payday to remind them where their money came from.- They worked for it, it didn't just show up.- and also a reminder for me to congratulate and thank them for their work at the end of the week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley Crockett",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T19:37:52.000Z",
          "Titre": "I love that it's all the things",
          "Contenu": "I love that it's affordable, the kids can go in and check their chores off, it's editable. It's user friendly + so so perfect for big families or busy families."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel Kenney",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T14:36:36.000Z",
          "Titre": "Great teaching tool for money management!",
          "Contenu": "It's eeasy to use, my daughter is really learning and getting the hang of managing her allowance.  She now sees the value in charitable giving, saving, and spending."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David McNary",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T18:37:13.000Z",
          "Titre": "Easy to use and assign chores",
          "Contenu": "Easy to use and assign chores. Our kids have done really well managing their own money and love the responsibility of earning and taking care of their own card."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina Y",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T02:21:15.000Z",
          "Titre": "Children earn their money",
          "Contenu": "It is easy to show my children how working towards a goal by earning your own money is more rewarding than just being handed something."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fabian Hamilton",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T08:38:38.000Z",
          "Titre": "BusyKid is a great concept",
          "Contenu": "BusyKid is a great concept for developing children. Making them discipline and responsible foremost, and teaching them about money and finance at the same time.We love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Virginia Moore",
          "Nb_Reviews": 3,
          "Date": "2023-09-18T23:29:38.000Z",
          "Titre": "Teaching Financial Responsibility Early",
          "Contenu": "The app is easy to use & a convenient way to reward my children for the chores that they complete. It also helps to teach financial responsibility & the appreciation of working for wages earned."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eva Kosir",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T15:47:09.000Z",
          "Titre": "Caring, Capable, and Convenient: A Remarkable Banking Experience for My Child\"",
          "Contenu": "My experience with my kid's bank has been exceptional. The bank's expertise is evident in its seamless services, making it incredibly user-friendly. I appreciate the ease of use and the peace of mind of knowing my child's financial matters are in capable hands."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T02:24:53.000Z",
          "Titre": "Easy to  set up and use app",
          "Contenu": "Easy to  set up and use app. Kids seem to be motivated to earn their allowance and extra money by doing assigned chores."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chantel Kindblade",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T03:51:35.000Z",
          "Titre": "The BusyKid app and cards are very easy…",
          "Contenu": "The BusyKid app and cards are very easy to setup and use. We haven't tried the \"share\" or \"save-invest\" options yet. The Spend option has been a great way to pay my kids their allowance. They LOVE having their own cards. There are a lot of great features and I definitely recommend this app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sadie Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T02:49:16.000Z",
          "Titre": "The busy kid card is easy to track…",
          "Contenu": "The busy kid card is easy to track purchase and load money. I can approve or deny any purchases before my son buys an item. The option to add chores for my son, which he can check off when they are completed and then a notification is sent to me...is a helpful feature. There are alot more features as well. I really like busykid card."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dee L",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T04:37:47.000Z",
          "Titre": "Easy to use app",
          "Contenu": "Easy to use app.  I can give my kids access to a card to have a monthly allowance without giving them access to a lot of money( like a credit card). They can see how much money they have and learn to be responsible with it. I like that I can give them extra as a bonus as needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica D",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T23:12:13.000Z",
          "Titre": "Helps to build good habits, responsibility and independence!",
          "Contenu": "This app has helped to build good habits for my kids by making chores a regular part of their routine and also empowering them to submit the chores they are completing on their own.  They have learned responsibility with managing having a debit card and also how to prioritize the things they would like to purchase and supporting them in growing their independence."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonio Perez",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T13:44:34.000Z",
          "Titre": "It works fantastic and in second",
          "Contenu": "It works fantastic and at the second. My kid can have a card for online purchase and keeps him on track of his duties. I wish the stock option was removed and there was an option for a statement for him to know what his spending is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stefani Stokes",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T19:59:50.000Z",
          "Titre": "Great app for teaching responsibility…",
          "Contenu": "Great app for teaching responsibility to kids and makes it easy to give/take funds.  Support is also readily available and easy to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Camille",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T02:23:24.000Z",
          "Titre": "This has been the easiest way to help…",
          "Contenu": "This has been the easiest way to help teach my child responsibility and work ethics.  We began using BusyKid when he was 9 and he is now 14 and still uses the app and the card."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 3,
          "Date": "2023-09-14T19:55:02.000Z",
          "Titre": "This has helped my daughter learn the…",
          "Contenu": "This has helped my daughter learn the value of money and created a love of saving money. the app is easy to use and the customer service department is helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia T",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T20:02:13.000Z",
          "Titre": "Love Busy Card!",
          "Contenu": "Love Busy Card!We have been using Busy Card for 2 years now - I have 2 kids with cards and about to get one for my 9 year old. The card is easy to load, I love that it tracks purchases, and the price point is great. My 14 year old forgot her pin number so I can go call customer service. What an easy call! The customer service rep was polite and efficient. Happy user!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KW",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T14:58:57.000Z",
          "Titre": "BusyKid is a great way to start your…",
          "Contenu": "BusyKid is a great way to start your child's financial journey.   Easy to use (for the parent and the child) accepted everywhere a regular card is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:49:18.000Z",
          "Titre": "So far it is a good program",
          "Contenu": "So far it is a good program.  The kiddo likes to know what he has earned and I am still learning."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Empress",
          "Nb_Reviews": 8,
          "Date": "2023-09-14T19:55:22.000Z",
          "Titre": "Really like the company",
          "Contenu": "Really like the company. Their banking app is pretty easy to use. Any issue you can most likely resolve right in the app or call the number for the card. Customer service have always been great. My child loves his card and he feels like an adult"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Reynoso",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T05:21:11.000Z",
          "Titre": "Great learning card for my children",
          "Contenu": "Busy kid always makes everything so easy,  I love the way my kids are into saving money and managing money every week. And when there is an issue with the card busy kid handles it right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommie Hargus",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T03:10:00.000Z",
          "Titre": "I love BusyKid",
          "Contenu": "I love BusyKid. My daughter and grandson live with me. It’s a perfect way to teach him that if he wants something, he can earn the money. I love being able to teach him about giving to Charity and saving for a big item. The app is easy to use. Easy to change values on chores, add or delete chores and send a bonus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kristin M.",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T04:39:38.000Z",
          "Titre": "Fantastic app concept",
          "Contenu": "Fantastic app concept, and great customer service to go with it. Thanks for making it so easy to teach my kids fiscal responsibility!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "April J",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T19:33:48.000Z",
          "Titre": "First step to financial education and…",
          "Contenu": "First step to financial education and earning for your child :) wonderfully created app and shared services.  Thank yoyu"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Wood",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T14:55:02.000Z",
          "Titre": "Good for More than just Chores",
          "Contenu": "We love Busy Kid for chores and special projects - you want spending money? Earn it.  It teaches the value of money. But as the older kids are growing up and going out without me if they are somewhere and need a few dollars I can send money to their card instantly. Or I can gift it for a special suprise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Goff",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T04:14:54.000Z",
          "Titre": "I have only been with busy kid for a…",
          "Contenu": "I have only been with busy kid for a year, but have been very satisfied with your service. The most important thing to me is the Safey issue. I have had no issues with your service at all and I thank you for offering it. Signed,Happy Customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 3,
          "Date": "2023-09-14T20:20:10.000Z",
          "Titre": "Perfect solution for young kids",
          "Contenu": "This is a great card that makes it easy for kids to use their allowance and make money for doing extra chores, etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BARRY",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T14:01:33.000Z",
          "Titre": "Busykid was a fantastic introduction to…",
          "Contenu": "Busykid was a fantastic introduction to earning, saving, investing, and sharing. It gave my kids their home chore and allowance framework for 5 years. Excellent product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grace",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T22:57:42.000Z",
          "Titre": "I love busy kid!",
          "Contenu": "I love busy kid!My kids love that they have the flexibility to save and spend their money all from and easy to use app. I love that I don't have to find cash every time I want to give them money for something, or pay out their allowance. Busy kid is perfect for us. I also love that I can see where my kids are spending their money, and how much they have left. So user friendly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Snyder",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T19:54:02.000Z",
          "Titre": "Busy Kid works great!",
          "Contenu": "Busy Kid works really well for our family.  I like the pricing of it and how the product works.  Kids really find the app easy to use as they like to track their income.  They enjoy being able to go in and pick stocks they want to purchase and also where to donate money too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryant W.",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T20:42:44.000Z",
          "Titre": "The beginning of money management for my child.",
          "Contenu": "Busykid does so much - giving my child experience in managing money, giving us oversight while helping us administer rewards and incentives.  We love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Funmilayo Vaughn",
          "Nb_Reviews": 4,
          "Date": "2023-09-19T00:33:05.000Z",
          "Titre": "I like how I could easily send funds to…",
          "Contenu": "I like how I could easily send funds to my children through my bank account. I like that I receive updates when my children use their cards."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Regina H.",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T05:00:31.000Z",
          "Titre": "I love BusyKid",
          "Contenu": "I love BusyKid! I have 2 teenagers that do chores for allowance and they have it hooked up to their ApplePay. It’s so easy to give them bonuses when they are earned or money is needed. The best part is the no monthly fees just to have the card. I highly recommend BusyKid!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ferria CharlesKydd",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T20:50:07.000Z",
          "Titre": "Very nice I send my kids cash this way…",
          "Contenu": "Very nice I send my kids cash this way when we're apart from each other if I forget. Also if they assit with a task payment is no Hassel"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlton",
          "Nb_Reviews": 3,
          "Date": "2023-08-30T14:13:51.000Z",
          "Titre": "Great App",
          "Contenu": "The app has all the features needed to help my kids learn about finances and being responsible. Now that they have cell phones, they can keep up with their own money."
        }
      ]
    }
  ]
}