{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "buybackboss.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Fisher",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:09:04.000Z",
          "Titre": "They of course had the highest price…",
          "Contenu": "They of course had the highest price for my Iphone 14 Pro and my wife's Iphone 14.  I sent them both phones separately in the original box.  I had my phone in a case for the entire year I had and also my wife's.  We also had screen protectors on and they were removed when I sent both in.  They were in excellent condition. Original offer was $567 - When they received, the offer went to $32 because of deep scratches on body of phone and screen?  They sent me pictures and the pictures showed a phone that was probably 5 years old or more?  When I complained, they upped the offer to $426.   Then when my wife's phone showed up, the original amount was $357 and they offered $239 because of Deep scratched on the screen???I told them to send back.  When I got them back, I examined them and both phones had zero damage or scratches on the bodies and mine had a minor 1/4 inch scratch that was not there when I sent in.  This company is definitely a bait and switch company that takes advantage of people by not giving them what they quoted on new phones.  Most of the positive reviews were on older phone.   Doing business with them is a valuable waste of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura Sample",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T03:56:38.000Z",
          "Titre": "Poor experience",
          "Contenu": "Poor experience. My phone went to them in perfect condition and was returned with two punctures and large scratch after I declined their revised offer. I would not have believed it if it had not happened to me. I would carefully photograph and document your property before sending."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Torrey",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T02:10:34.000Z",
          "Titre": "Kept my device and received nothing",
          "Contenu": "Kept my device and received nothing. I would not recommend them. Somewhat deceptive. If your simply recycling the product, why bother sending to you all. I could have recycled myself for free."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KJ",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T02:43:00.000Z",
          "Titre": "They made up that my phone had scratches to deduct $50 from what they originally told me",
          "Contenu": "I sold them my iphone 13 pro which has been in a case since day 1. There's no noticeable scratches unless you really look for them and you'll see tiny soft scratches which is still impressive for a phone that's been used for hours for 2 years straight. They deducted $50 because it wasn't in flawless new condition which felt like a way to just get my phone mailed into and turn around and pocket $50 for themselves."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Huz",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T23:12:21.000Z",
          "Titre": "Bait and switch, avoid at all costs.",
          "Contenu": "Bait and switch, definitely suspicious, most likely scammy.Here are the facts. They quoted me a price for buying my phone ($622) which was much higher than the phone was selling for, used, on eBay ($560). Already this is \"too good to be true\" but I decided to give them a shot based on good reviews online.When they received the phone, they tell me something is hazy in the front facing camera (there has never been an issue I noticed using any of my cameras), and now are quoting me $172. Complete BS. I request the phone to be sent back to me, now worried they are scammy and may not even send the phone back. I said no. They say wait now we'll offer $258 to \"save me the time\" of shipping back. Scammy.I said no, give me my phone back. They come back with a $310. Now I'm really worried they're not going to send my phone back.I said no, they eventually send it back, and I proceed to trade it into Apple for $500+. Complete waste of me time dealing with this company, super scammy feeling."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shawn Tackla",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:34:51.000Z",
          "Titre": "Bait and switch company",
          "Contenu": "Bait and switch company.  They’ll find a way to reduce your offer.  They even sent me pictures of a scratched phone that wasn’t mine.  Avoid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gordon",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T04:35:31.000Z",
          "Titre": "After my offer of $161.00 from Scam…",
          "Contenu": "After my offer of $161.00 from Scam Back Boss I mailed my iPhone 10 in the original box with the power cord to them. I received an email from them saying it was worth $43.00. They said the screen was separating from the case. I said that prior to shipping my iPhone 10 to Scam Back Boss it was thoroughly inspected by the manager at the phone store. Then Scam Back Boss said we’ll pay you $65.00. I said no I want you to ship my iPhone 10 back to me. Today I received my iPhone in a box without the original box and they stole my power cord. Buyer Beware. I am going to give my phone to a member of my family."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pedro Sardinas",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T02:58:02.000Z",
          "Titre": "Complete Disappointment and Misleading",
          "Contenu": "Will never do business with this company again. The price they quote you is not what you will receive. They don't tell you they charge you their portion of a PayPal fee, something another vendor I used for my Galaxy Watch did not do. They took longer than their stated time to send payment and customer service was extremely poor and non-existent. I am terribly sorry, but I cannot recommend this company to anyone I care about."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vincent J.",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T20:00:39.000Z",
          "Titre": "Horrible experience",
          "Contenu": "Horrible experience, never using this service again. Payout was extremely long and price decrease for whatever reason when both devices were mint, bad taste in my mouth."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "james pascotti",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T11:07:34.000Z",
          "Titre": "Bait and Switch. Beware",
          "Contenu": "Total scam. Offered 625 for really good condition 14pro 256 unlocked. They get it and say it's a heavily scratched 14 plus and offered 225. I told them it was a mistake and provided serial number they than said ok it's a pro and offered 300 so told them it was an insult and then they kept offering smaller amounts and sent a pic of my screen with fingerprints acting like it was scratched. Finally offering 500. I declined and had it sent back and it was  close to a perfect phone! Don't fall for the big offers they are very dishonest"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Wollaeger",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T06:17:12.000Z",
          "Titre": "Bait and switch! Good offer then say device is broke and offer half",
          "Contenu": "Gave a very good initial offer for 3 iPhones. All phones were used but always in cases and no signs of visible wear when I sent them.  I sent the phones to them and they didn’t get back to me for over a week after I sent them. I had to reach out them them. They said 2 phones had cracks in the screen and one was in good condition but offer $100 less than initial offer. Non of them had scratches or cracked screens. I have requested they send the phones back. We will see what happens. I took pictures of the phones before I sent them. Hopefully they send them back and without broken screens."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T05:34:49.000Z",
          "Titre": "RIP OFF COMPANY",
          "Contenu": "Looking at the reviews from BuyBackBoss, I decided I would give them a try.  I've always sold my old i-phones through an internet company and made out well.  The phone was in fantastic shape and I was told I would get $237 for it.  Email came 2 weeks later offering me $144.  I've never had an experience like this before.  They eventually came up after discovering the phone was unlocked and worth more but never offered the original amount.  They admitted they were there to make me happy and that didn't happen.  I eventually got my phone returned in the mail....4 weeks of B.S."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sebastian Orozco",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T22:51:27.000Z",
          "Titre": "Bait and switch",
          "Contenu": "Bait and switch, they offer a high amount and then take weeks to review your order before sending you a revised low ball offer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Jeansonne",
          "Nb_Reviews": 3,
          "Date": "2023-06-16T02:38:02.000Z",
          "Titre": "High offer to lure client, then wham!",
          "Contenu": "High offer to lure client in then lowball offer with excuses. Multiple bartering options to not return product back to client, ultimately bringing price higher to client's asking. Felt the entire process was a scam and would definitely not recommend or use again.I couldn't reply to Brittanys reply so I edited mine to answer. That was a flat out lie on any financial obligation. Phone was completely paid for 6 months ago. The only thing wasbrhe screen had been changed by Apple. Because of that you stated it wasn't flawless, yet it was completely free from visual defects or scratches of any kind. Your company is a scam artist and sellers beware, they will rip you off. If my product wasn't up to par, why did you eventually raise your offer oeivecto avoid returning it after I refused twice????? Liars and scam artists to the fullest. Hopefully others will see this and run far away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dipak Shah",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T02:39:51.000Z",
          "Titre": "The company is very slow to respond",
          "Contenu": "The company is very slow to respond.  Poor customer service.  They offer payment by gift card as option.  However, do not describe the option much.  I reached out to them by email (only option).  They informed me I will have 1000+ card options.  Upon receiving the payment via Prizeout, i discover, i had only approx. 20 card options.  Again, not much support at Prizeout.  In addition, Prizeout dynamically changed the prices of the card while I was selecting it.  I would not do business with them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Simon",
          "Nb_Reviews": 4,
          "Date": "2023-09-22T04:13:39.000Z",
          "Titre": "Bait and switch",
          "Contenu": "Bait and switch, I sent in an immaculate phone, for a quoted buyback price of $288. This was quckly reduced down to $78. Acording too them my battery would only charge to 78%. Their standard is 80%. Which would of qualified for the orginal quoted price. I flat out rejected this offer as well as two more low ball ones that followed.  I then offered to come down to $240 final offer. If they didn't accept I'd just like my phone back. They sent me my phone and I traded it in to Samsung for $315 on a new phone. Which is what I was going to do with the money anyways. It pays to shop around. Buyback Boss is betting on you taking what you they offer and not going through the hassle of waiting for the return and selling it someplace else. This business model counts on you being desperate for cash or too lazy to shop around someplace else. \"Just take what the Boss is offering peasant. Your lucky to be getting that much.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Spence Jordan",
          "Nb_Reviews": 2,
          "Date": "2022-12-31T04:00:40.000Z",
          "Titre": "Misleading customers",
          "Contenu": "This company is very misleading because on sellcell.com where they have their ads it says payment speed next day. But In fact it’s 10 business days. I think they need to fix that and they can’t say that’s not their website because if you are advertising on someone else’s website your information should be correct. I know you see your ads on their website. So I give this company a 1 star because people choose a website based on payment speed.  And even on your website it doesn’t even give a timeframe"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John M Stephanos",
          "Nb_Reviews": 3,
          "Date": "2023-05-13T23:43:32.000Z",
          "Titre": "Never again!",
          "Contenu": "They jerked me around for almost 3 weeks, the phone I sent them was perfectly fine in good shape and they told me they were going to pay me $257. They examine that phone for three weeks and all of a sudden at the last minute they said oh there’s a small chip on the phone. How do I know they didn’t put the chip in the phone or if there even was one,when I had it there was in great condition so they offered me $84 and I said you’re a bunch of crooks so they offered me 124 and I accepted, only reason I took it because I didn’t want to deal with them anymore,  I would never ever ever use them again,I have a history of selling my phones online(10) to various other dealers of used iPhones and I have never ever had a problem. This was a total catastrophe and very unprofessional people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean McGarry",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T18:55:27.000Z",
          "Titre": "Missing device and then low ball offer",
          "Contenu": "I sent in my iPhone 15 Pro Max, which they quoted online as $757 for Good condition. My phone had spent its entire life in a case and the battery health was at 90%. I took pictures before sending it in and wrapped it up securely in the manufacturers box. A week after the phone had been delivered I reached out as I had not heard anything. They stated that it had arrived and that they would inspect the phone within 10 business days of delivery. 11 business days go by and I don't hear anything so I reach out again. They respond that they need my IMEI number because they can't find my phone. After providing, they said they found it and will have it inspected right away. Another 2 days go by and I don't hear anything. I reach out again and am told someone will reach out with my estimate. I then receive an email that my phone has heavy scratching on the screen and they are reducing the offer to $455 ($300 less than original quote). They provided no pictures of the scratching in their first email. I respond back with pictures of the phone clearly showing that no scratches were present the day the phone was sent out. I tell them to send me my phone back. Another 2 days goes by and someone from another company, GadgetGone, responds back and now offers $520. In this email they do provide pictures of the phone. They claim they did not scratch my phone purposely to reduce the payout. I request my phone back. I believe that both Buyback Boss and GadgetGone are quoting high payouts but as soon as you send it to them, they offer significantly lower payouts. Additionally, since phone value is highest right before or after a new iPhone has been released their slow response times and losing my device reduced its value. I am waiting for my phone to be shipped back to me so I can inspect it and consider what action to take next. Luckily I documented my phone's condition with a lot of pictures before sending it to them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Honesty Gaming",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T06:26:56.000Z",
          "Titre": "Dont sell devices here!!!",
          "Contenu": "I sent in a ipad and over the app they offered $412, I had taken pictures and know the exact quality of my ipad. Sent it in in safe shipping packaging. They emailed me with a $200 offer. When I asked why they said there was deep scratches on the back, I asked for pictures because that was outright insane, knowing it has not a single scratch when I sent it. He sent pictures of a ipad with scratches on the back. They either are trying to scam people by sending pics of a different device or they are making damages so they get to pay less. I will never recommend this place to ANYBODY."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gavin Garfield",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T17:07:27.000Z",
          "Titre": "Answered all the questions on the app…",
          "Contenu": "Answered all the questions on the app truthfully was told I would get $136 for my phone. Once they received it, they said they didn’t like the life of the battery and offered me $30. When I said no then they upped their offer. Why didn’t I get an honest offer right from the beginning?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clint Murray",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T23:55:49.000Z",
          "Titre": "Complete Scam",
          "Contenu": "Complete Scam! Save you're time and find someplace else. I sent in a like new device and was told my device would be reviewed in 3-4 days after delivered. 8 Days after delivery I had to reach out first, and they claimed employee shortage. Sure, I can understand tough times. But then they get back to me and give me a quote less than 30% of my original quote claiming excessive and deep scratches. I said no send my phone back or reevaluate. Then they \"reevaluate\" and claim that I had told them the device was something other than it was, my order receipt shows I input the correct device. But they also attached photos of \"my phone\" Showing bad scratches, but they look nothing like the pictures I had taken right before I sent my package. They either took pictures of another phone, or they damaged the phone when they received it. I hold technology in high regard and can successfully say I have never damaged a phone in my life. I have no idea how they get so many good reviews that made me originally think I could trust the place. But they are a complete scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DAN SCHMIDT",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T21:00:17.000Z",
          "Titre": "I would steer clear of this company",
          "Contenu": "I would steer clear of this company.  I sent in a phone that had no scratches and always had a screen saver on it.  I got a message that my phone was deeply scratched and the offer dropped by 60%.  I asked for it to be returned and now it is badly scratched.  Beware! Update:BuyBackTronics just paid $95.  BuyBackBoss had offered 85 and lowered to 35 after they scratched it!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jthorsen",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T18:21:16.000Z",
          "Titre": "I sold my iPhone 8 to buybackboss.com",
          "Contenu": "I sold my iPhone 8 to buybackboss.com, order no. 183286. I was offered $77. When I tried to contact them two weeks after I sold it to them and sent it to them, the email would not go through. I think it is a big scam and I am pissed off that they would not provide a phone number to contact them. They did finally get back to me by text or email and said that due to a battery issue, they were only going to pay me $17 with no proof of the strength of my battery vs. what it should have been band still did not provide a phone no. to contact them!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T01:56:17.000Z",
          "Titre": "Bait & switch",
          "Contenu": "Bait & switch.  Total baits & switch offered $77 paid $50 when the condition of my phone was exactly as described for the $77 offer.  Rip-off, don’t trust these people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Watson",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T04:23:43.000Z",
          "Titre": "Buybackboss is a SCAM!!",
          "Contenu": "This place is a Scam!!Sent them 2 Luke new samsumg s9+ phones and the website said in excellent condition would give me $210.00 for both phones. Don't get me wrong, I know I'm not getting rich off the phones but 210 is 210!Get and email saying that both phones where broke and both had \"ghost\" images burned into the screen!! They said they'd give me $44.00 for them, SCAMMMM!!NOTHING I CAN DO.I have to pay to get them returned and I guarantee they will break them just to prove a point.Just keep you old phone, maybe you might need a phone in an emergency. If you want to sell your phone DO NOT GO TO THIS COMPANY!! IT A SCAM!! GIVE THE CUSTOMER A FEW BUCKS, THEN SELL YOUR PHONE FOR HUNDREDS!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "anthony deroma",
          "Nb_Reviews": 2,
          "Date": "2023-04-21T14:32:03.000Z",
          "Titre": "BUYBACK BOSS - RIPOFF COMPANY",
          "Contenu": "I sent my iPhone to these rip-off artists. I took 10 pictures prior to sending it in as proof of what it looked like before I sent it. Well, they had offered $144, but when they sent me what they thought it was worth, they said $38. I told them to send me my phone back. They responded by telling me that you could pull the glass screen away from the phone as it was supposedly cracked there. They even sent me a picture of the damage on the phone. The phone had NO damage before I sent it to them. They then told me they could offer $58. I told them to return the phone to me AND if my phone is damaged, I will add more to this Review for their abhorrent behavior. BE AWARE! These people WILL RIP YOU OFF! NEVER USE THEM!! THERE ARE MORE REVIEWS LIKE MINE. 😡"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aram Takvoryan",
          "Nb_Reviews": 2,
          "Date": "2022-08-16T12:12:37.000Z",
          "Titre": "They are so deceptive",
          "Contenu": "They are so deceptive. I would stay away from them if you can. They offer you a price and take forever to pay and then offer you a ridiculously low amount."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Stark",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T22:58:45.000Z",
          "Titre": "Sent in a like new IPhone XR",
          "Contenu": "Sent in a like new IPhone XR. They claim there are deep scratches in the screen that were not there when I sent it in. Only giving me half of my quote."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DT",
          "Nb_Reviews": 2,
          "Date": "2022-09-09T03:19:58.000Z",
          "Titre": "I will start with what I expected",
          "Contenu": "I will start with what I expected, had just traded the same phone Samsung note 20 ultra 5g) in the same condition to T mobile for 800 (added a line to my account) took less than 10 minutes to clear data and unlock!  Saw their ad on sell your sell, advertised same or next day on payment....I had downgraded the phone to good (always in a case and screen protector) Sent phone in on Aug 8th the same day I received authorization to send it in and secure the \"offer\" . I had sent in the original box, charger and cord.   I received a couple of emails checking to see if everything was accomplished and ask if any questions. Everything seemed fine and very positive....expected the same experience trading the phone in....even followed mobile instructions on erasing the phone. First issue (after phone was sent) discovered (from reviews) they throw away everything but the phone on receipt.... It wasn't theirs to show away! They didn't buy it ....what is the term or word for taking someones possessions without compensation? I can think of a lot but stole comes to mind.... I had a pristine phone with box, instructions, charger and cord....reminds me of a Pink Panther movie , Peter Seller wrecks a piano and they say \"this was a priceless Steinway .... he responds ...not anymore! \" I then get an email saying they (buyback) will get around to it in a week or so (so much for same day) Also responded elsewhere they don't have room to store boxes Maybe buy a bigger van to work out of? They had NO RIGHT to throw away something they didn't own (that now I have to buy to sell the phone) thieves or incompetence ? I finally get a reply saying the phone was locked because of iCloud or google or Samsung .... The phone was not on any such plans and gave them the screen lock code (but have no idea why)  They offered me $0000 and ask if the should recycle it (a phone that T mobile gave $800 for on trade in)  Just got the phone back, bought the stolen parts, charged it up and works perfectly after initialization setup procedures ....I didn't need the screen passcode or my social security numbers the ask for ?????? What I did find is my phone is worth a lot less now than several weeks ago and buyback no long seems to give any value on my phone.  The only thing I can conclude is they decided to no longer buy this phone (Samsung note 20 5 g) and this was an easier way for them to not pay.... I don't believe they are at all honest or a reliable \"company\" and they owe me for stealing not to mention the inconvenience I Read their reply , in response they did ask for my ssn# at the same time they wanted my screen pin. The last 4 digits of an ssn# can be just as damaging and when they say they didn't ask its a lie. Two points , the fact that they destroy charger, box and cord should be on the same initial instruction page not after the device was sent according to instructions for shipment (device was already gone and after a check up email not much later) Also when I checked on sell your cell to find another buyer it stated buyback wouldn't purchase this phone (maybe correcting their original statement that they advertised ...Same Day...) and lastly the stinking phone was not locked when I sent it and when it was returned ....I charged it (again after having purchased what they stole ) it fired up without any screen passwords ...ssn # ...all my data was gone. So \"locked \" is a lie... This is not a company to do business with...if they had any integrity they would have apologized , acknowledged and offered to pay for what they stole instead of excuses ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sheri Lenze",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T17:45:41.000Z",
          "Titre": "How is this company getting great…",
          "Contenu": "How is this company getting great reviews?? I originally told I would get $496 for my iPhone 12 that apple had just refurbished with apple care. Phone was still in original box with screen still covered by apple, clean and honestly looked brand new. The told me it was in fair condition and only offered $240. Said there were deep scratches. Not sure how that is because apple had just replaced the glass. It’s a bait and switch. I asked for it back,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T22:14:09.000Z",
          "Titre": "I sent in an iphone6S in perfect condition",
          "Contenu": "I sent in an iphone6S in perfect condition. I was offered $60 for the phone. When they received it they said it had a scratch on the screen, which it didn’t and still doesn’t. They offered $20 and I told them to send the phone back. It came back damaged so that I can no longer sell it elsewhere. The screen now has vertical lines going through it, which it didn’t have when I sent it to Buyback Boss. Don’t use them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sefa Aksoy",
          "Nb_Reviews": 1,
          "Date": "2022-02-19T00:18:07.000Z",
          "Titre": "I sent them a samsung glaxy note 20…",
          "Contenu": "I sent them a samsung glaxy note 20 ultra in very good condition.Then they sent me some pictures.In the pictures, they made new scratches on the screen to lower the price of the phone.Then a phone expert with poor eyesight prepared a report that the phone had a heavy scratch.I wanted the phone back.The phone did not come with the original box and charger.These thief arizona lizards stole those too!These are Arizona lizards!They think they are very smart.A few little b.tch.s and a few little b.star.s turn all this stuff up!Definitely stay away from these Arizona lizards!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "deidra mcafee",
          "Nb_Reviews": 1,
          "Date": "2021-07-27T01:02:05.000Z",
          "Titre": "DO NOT USE BUY BACK BOSS",
          "Contenu": "I sent in a brand new note 20 ultra in its original box with all accessories, had only been opened in the tmobile store to confirm imei etc.   when did not get the quoted amount from buyback boss asked for phone to be returned.   I got ONLY the phone, the original box and accessories did not get returned.   THIS IS BULL, phone is worth next to nothing now.  THEY ARE A RIP OFF.   Guess not being able to leave a review on the site should have clued me in."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean Tracey",
          "Nb_Reviews": 6,
          "Date": "2021-06-23T17:02:14.000Z",
          "Titre": "BuyBackBoss tried to swindle me",
          "Contenu": "BuyBackBoss tried to swindle me!  I shipped my \"mint\" condition iPhone 8 to BuyBackBoss. They originally quoted me to buy it for $137.  When they received it, they \"inspected\" it and said it had earphone damage and would offer me only $55.  I refused and had it returned. I sent it to Apple's trade in partner Phobio.  They inspected it and found it all good condition. They paid me $110. Don't use BuyBackBoss."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A. Wrazien",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T02:19:40.000Z",
          "Titre": "Scam",
          "Contenu": "I was offered 196.00 for my mint condition IPhone XR. After they received it they said it had large scratches on the screen and offered me much less. I cleaned it and packaged the phone myself in the original iPhone packaging. I have the original photos of my phone prior to sending it to them. There is no way that it got scratched when I mailed it. I have not received my phone back or a tracking number as requested. They do not respond to emails. This company is a scam. Do not use them!Updated 9/8/22- Just got the response months after my post stating that my phone was not in mint condition. 😂 I sold it elsewhere in mint condition. This company promises you a lot until the get your device and then offer much less. Complete scam…run."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave Ellis",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T16:27:42.000Z",
          "Titre": "Seems like a scam to me",
          "Contenu": "I sent an iPad with cracked screen but otherwise worked fine. The day I sent it I reset it to factory settings. When they got it they claimed it didn't work at all. Instead of $200 I got $30. They can now repair the screen and make more money. I still accepted the offer because I didn't want to deal with having them mail it back. Seems like a scam from my experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Victorson",
          "Nb_Reviews": 1,
          "Date": "2021-08-29T21:52:09.000Z",
          "Titre": "This sight is a total ripoff",
          "Contenu": "This sight is a total ripoff, they get your phones that have been in life proof cases since purchasing, and take them out and box up and send to them, they tell us the phones are not in great condition but they are fair to damaged condition, SO BEWARE, YOU WILL Not Receive The Money THEY PROMISED you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob Hackney",
          "Nb_Reviews": 2,
          "Date": "2021-05-21T20:41:45.000Z",
          "Titre": "Sent my samsung note 9  phone to them…",
          "Contenu": "Sent my samsung note 9  phone to them after being quoted $280. My phone is in mint condition, always hard cased with screen protector.  No scratches,dents or cracks. Upon their inspection they claim i have a screen issue which is an absolute lie. Tried to pay me $48 instead of $280. Do not send them your phone you will regret it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Douglas Rieder",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T21:16:31.000Z",
          "Titre": "Minimal edge of case damage and fully…",
          "Contenu": "Minimal edge of case damage and fully functional nearly new Microsoft Surface Duo (original box, paperwork and cord) and they offer $15?!  Save your time and don't use this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ty Russum",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T02:04:03.000Z",
          "Titre": "Systematic bait and switch via manipulation",
          "Contenu": "Wow I wish I would have done more research. Buybackboss has well documented cases of systematic “bait and switch!” They offer one price associated with a specific and well described condition and then offer a price associated with a condition not representative of the device they received. They are taking advantage of human “immediate gratification” nature to scam people into choosing them over a competitor. Their use of manipulation gives companies with honest marketing tactics a bad name."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teava Lotfi",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T09:49:12.000Z",
          "Titre": "A COMPLETE RIP-OFF!",
          "Contenu": "I had my screen replaced on my 2 year old iPhone XS Max. It was in almost perfect condition. Sent my phone to BuyBack and they offered me $70. Got them to send it back, took it to Best Buy and got $400. Don’t send your phones here. I contacted customer service about this 2 weeks ago and no response. You can also trade in your phone with Apple for cash. Don’t waste your time and money with BuyBack."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brett Epps",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T22:40:02.000Z",
          "Titre": "Provided a honest assessment of my…",
          "Contenu": "Provided a honest assessment of my iPhone, it was damaged and I was quoted $65. Mailed it in and got hit with even more things to drive the price down more even though it met the damaged description. $20 offer from them when they just scrap the things. Go elsewhere, don’t buy into the high priced guarantee hype."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Austin Rains",
          "Nb_Reviews": 1,
          "Date": "2021-09-14T12:44:56.000Z",
          "Titre": "Never returned everything I sent",
          "Contenu": "They offered me $400 for my iPhone 11 Pro then dropped it down to $70 upon receiving the phone because of one problem in the settings I also sent the phone with the original box, charger and headphones and when I denied the price the only sent back the phone not happy with the service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Guilmain",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T23:42:58.000Z",
          "Titre": "Most phones will be considered damaged.",
          "Contenu": "Beware the fine print.  Unless your phone battery is operating at above 80% they will consider it damaged despite its actual condition. An iPhone 8 in near perfect condition was originally offered $160 but only received $70. To replace the battery at Apple would be $49 so the offer should have been $110. An average phone degrades 1% per month so if it’s more than two years old it will be considered damaged.  You can check your batteries capacity in the settings section under battery of your phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brad Wolk",
          "Nb_Reviews": 1,
          "Date": "2021-01-09T17:45:44.000Z",
          "Titre": "Avoid this company BUYBACK Boss",
          "Contenu": "Avoid this company.  They are a scam.I gave them an absolutely like new iphone and they paid less than what they promised.Their plan, get your phone and downgrade the price and hope to beat you down.I will never do business with them again.I am in contact with the Arizona Attorney General.YOU HAVE BEEN WARNED!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joey Mannon",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T23:39:31.000Z",
          "Titre": "Won’t use again",
          "Contenu": "Gave me a quote of $70 for my iPhone XS Max that I bought new and owned for 2 years. It no longer worked, hence the $70 quote. They received it, but took forever to confirm. I had to initiate contact 3 times to get an update. They informed me that they would not be sending my any money for my phone. They said it was stolen (nope, I’d owned it ever since I bought it brand new) and offered to “recycle” it for me. I successfully sold it to another buy back company for $100. Won’t use these guys again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rob Flaz",
          "Nb_Reviews": 1,
          "Date": "2020-02-13T19:27:25.000Z",
          "Titre": "I am very disappointed",
          "Contenu": "I am very disappointed in the quotes provided. None of the 3 phones have any visible signs of damage. All phones worked perfectly fine with the exception of the decreased battery life, which is expected from a phone that is 4 years old. I feel like your company found things “wrong” with the phones in order to de-value the devices. I would have been better of trading them to Verizon or Apple"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Craig",
          "Nb_Reviews": 1,
          "Date": "2022-01-02T15:06:18.000Z",
          "Titre": "I had sent a brand brew refurbished…",
          "Contenu": "I had sent a brand brew refurbished apple i phone…re done by apple itself and was told the camera did not work … I do not believe iPhone/Apple would send me a defective product… So therefore $40 was taken off the price… Not very happy… Jeff"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Matthews",
          "Nb_Reviews": 2,
          "Date": "2019-12-25T18:08:32.000Z",
          "Titre": "What a headache.",
          "Contenu": "Paid me twice. I refunded them and they then opening a claim case against me on PayPal. This made my account almost $500 negative. They put money into my account to fix it but my account still sits at a negative balance. The process was super easy and they paid quick but after having a case open against me for 2 weeks now I will probably never do business with them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T16:36:53.000Z",
          "Titre": "Giving one star but should be zero",
          "Contenu": "Giving one star but should be zero. Was quoted $638 trade in on my iPhone 12 Pro. When it was received the revised quote was half that as buybackboss claims extensive scratching that was barely visible in the pic they sent me. Definitely a bait and switch as they quote the most and revise the offer once they have your phone and assume you just want to finish the transaction. It’s been 5 days since they low balled me and they still have not sent payment. I have sold phones else where and recommend trying any other service to buy used electronics. They obviously take advantage of people and use sketchy practices ti offer the most and pay the least."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Guy that got lied to",
          "Nb_Reviews": 1,
          "Date": "2021-10-22T23:05:55.000Z",
          "Titre": "Wish I could give 0 stars",
          "Contenu": "Wish I could give 0 stars.   Tried to buy a used phone - they said 11 available and took my money but low and behold ---  oops sorry we were wrong we don't have any in stock and will hold your money for up to 5 days (if I get it back).   Don't trust these people.   Update - they also tried to flag my review saying it wasn't them - once again trying to avoid responsibility!!!Yet another update: they tried a 2nd time to flag this review but trustpilot has now marked my review as verified - time to own up buyback boss!  They do NOT want to accept any responsibilty for their actions or let the truth be exposed...sad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gabe",
          "Nb_Reviews": 1,
          "Date": "2019-06-12T16:01:17.000Z",
          "Titre": "Website listed broken buttons for…",
          "Contenu": "Website listed broken buttons for iPhone under damaged. Didn't mention that if it was the touch sensor that was damaged then it is considered broken and payout was half. Phone was in great condition otherwise. Felt like I was ripped off but didn't want to bother with having them send it back so took the crappy deal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Wilson",
          "Nb_Reviews": 2,
          "Date": "2020-10-10T00:22:47.000Z",
          "Titre": "Right after I sold my phone to Buyback…",
          "Contenu": "Right after I sold my phone to Buyback Boss, I had login attempts on many of my accounts from Spotify to Facebook. I cleared the data off of my phone and cannot make a definite connection between this Buyback Boss and the login attempts but it was alarming and confusing. Be careful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jared Farnum",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T15:58:29.000Z",
          "Titre": "Not even one star",
          "Contenu": "I have no idea why they have so many positive reviews unless they are paid. The online quote system is buggy and inconsistent, when you email customer service they ask questions you already answered in your original email, I had wanted to send in both an iPhone and and iPad on the same shipment. It would save me on finding two boxes and them on the shipping cost. Anyway, they failed to adequately answer my questions on the iPad, which caused delays (especially with my busy schedule) and the next month, they said they could only pay me $6 instead of $76! Wow, such a drop in just a few weeks? Not even worth it at $6. I had suspicions that this company is not ethical and I would not advise sending in a device to these guys."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2019-10-16T00:36:00.000Z",
          "Titre": "Scam!!!",
          "Contenu": "Scam!!!! Sent my phone back and they say there’s still money owed on it when it’s long been paid off. I had the phone with Sprint and Sprint says there’s no balance due. They send me a screen shot from Ting.com, NOT Sprint, saying it’s not paid off. Sounds like a total scam to get the phone for nothing!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Guillermo",
          "Nb_Reviews": 3,
          "Date": "2017-12-10T08:58:51.000Z",
          "Titre": "fraud",
          "Contenu": "I sent my phone in November 20/ 2017 to them, they get my phone Saturday November 25/17. I have a lot of email where they said my check was sent on November 27/17. But I never get my check, the policies said they i have between 3 to 5 Business to get my check, but today is my 12 day waiting the check. I will demand this company for that reason."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ram krishna Hona",
          "Nb_Reviews": 5,
          "Date": "2020-12-03T21:35:58.000Z",
          "Titre": "I bought Iphone 6 but it did not work…",
          "Contenu": "I bought Iphone 6 but it did not work with sim cards I have. I tried to return it but could not because I could not find its contact to get help. I am going to loose over $100. I suggest everybody to first think of returning things before you buy things from buyback boss."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2019-07-26T20:14:06.000Z",
          "Titre": "They offer you a price after you give…",
          "Contenu": "They offer you a price after you give them a full description, then change the price once the item arrives. They suck, I receive an email later about they respond, and I do understand the employer's opinion, but I give Buyback Boss the full description with the problem before it was sent. I was promised that the price will be the same, and it was not the same. I admit that I accept the recounter offer, but it was 30 percent of the initial offering. So, all I am saying is Buyback Boss will deceive you..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "justin bobeck",
          "Nb_Reviews": 1,
          "Date": "2019-10-17T22:29:40.000Z",
          "Titre": "So for bad experience",
          "Contenu": "Well I sent my phone in they told me $300 and ended up giving me $260 cause they said something was wrong  with the phone which work well for me and been in a cover it hold life. And needless to say it's been 3 weeks now and still have not received my check so hopefully I get my money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erica C",
          "Nb_Reviews": 1,
          "Date": "2021-09-13T21:55:51.000Z",
          "Titre": "THEY ARE A SCAM THEY GOT MY IPHONE 11…",
          "Contenu": "THEY ARE A SCAM THEY GOT MY IPHONE 11 pro max never reached out I  had to Hunt them down and then they finally said oh yes I sent them an empty box when on my mothers grave I did not.  Now I will make it my life to sue them!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PcGaming MasterRace",
          "Nb_Reviews": 1,
          "Date": "2017-08-29T23:04:37.000Z",
          "Titre": "30 bucks for an iphone 7 plus ??? are they crazy",
          "Contenu": "Never paid won't email or text me back suspicious much? still waiting maybe they will pay me maybe not :(    EDIT they offered me 30 bucks for an iphone 7 plus at@t perfectly fine but bc it was passcode locked they wanna give me that crap although I can sell litterally anywhere more than that"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff B",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T16:25:04.000Z",
          "Titre": "Absolute trash company",
          "Contenu": "Absolute trash company. Sent my phone in perfect condition and they said the screen was cracked when it got there.  No way it was cracked. Packaged the phone in a bubble wrapped envelope inside of a box with more bubble wrap and packing peanuts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry Bunch",
          "Nb_Reviews": 1,
          "Date": "2019-05-03T18:04:14.000Z",
          "Titre": "My experience with the transactions…",
          "Contenu": "My experience with the transactions were decent. A little longer then expected but decent.My concern is that my wife sent it some merchandise at the same time and has not received any money nor was her items returned. I would not do business with this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RYAN COX",
          "Nb_Reviews": 4,
          "Date": "2021-07-02T19:15:32.000Z",
          "Titre": "LIARS AND SCAM ARTISTS",
          "Contenu": "LIARS AND SCAM ARTISTS. Sent them 2 BRAND NEW devices, SEALED, UNLOCKED, and they tried to say both were opened and knocked $100 dollars off the payment I was supposed to receive. DON'T DO BUSINESS WITH THESE CRIMINALS!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rachel Barrett",
          "Nb_Reviews": 1,
          "Date": "2020-09-10T16:43:56.000Z",
          "Titre": "Take pictures of your phones before…",
          "Contenu": "Take pictures of your phones before sending!!!! Had two later model phones sitting around in perfect shape. Mailed them out to buybackboss. Had to reach out to them several days later to ask for an update. There was an issue with resetting one to factory settings is what I was told. A few days later I was then offered over $100 less than what my original quote was for. They claimed one phone screen had a crack and one had several scratches. Both were in mint condition upon shipment! Didn't want my supposedly busted phones back so I took their offer but it was a lot of back and forth and very disappointing overall."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2017-06-30T04:29:52.000Z",
          "Titre": "Service sucks",
          "Contenu": "Service sucks. Didn't pay what they said that would. Sent a couple extra screens to go with the phone bc I didn't need them. The company didn't even acknowledge it and not only that didn't pay what they said they would on the phones. Process wasn't easy either."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Miley",
          "Nb_Reviews": 1,
          "Date": "2021-01-08T20:36:39.000Z",
          "Titre": "I can’t believe they honestly received…",
          "Contenu": "I can’t believe they honestly received this many 5 star reviews. I read some negative ones before I send my phone but saw so many positive thought it would be a good transaction. I was wrong what I read was correct they will lower your offer then you are pretty stuck. Either take it or pay shipping back nearly a month after sending off and the price of the iPhone is lower everywhere else as well. I would not recommend using them as they have bad business practices. My phone was always in an otter box with screen glass covering and the battery life was over 90%. They switched it from mint which is what I selected to “used” which isn’t even a choice...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Greatbatch",
          "Nb_Reviews": 1,
          "Date": "2017-07-11T02:14:09.000Z",
          "Titre": "Sent in my iPhone 6 per the quote of …",
          "Contenu": "Sent in my iPhone 6 per the quote of $140.  I received an email today stating the frame was \"slightly bent\" which usually falls in their \"Broken\" category.  The new offer is $60.  This is after a store rep offered to take it in trade for account credit as it was in excellent condition.  I feel this may be a bait and switch or some damage occurred there.  This phone was kept in one of two rigid cases during the two years of my ownership, had no scratches or dings.  I emailed that I wanted it returned.  Very disappointed in what I thought was going to be a simple transaction."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeri Ruddy",
          "Nb_Reviews": 1,
          "Date": "2021-06-05T02:49:23.000Z",
          "Titre": "Got a quote",
          "Contenu": "Got a quote.   Then the amount went down every time I turned around.   Started at $260.  Ended up only getting $5 after I already paid for overnight shipping.   Lost money on this deal .  Got totally screwed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lelan Warren",
          "Nb_Reviews": 1,
          "Date": "2020-12-21T04:04:17.000Z",
          "Titre": "Changed the price on me",
          "Contenu": "Changed the price on me. This is twice. I will find some one else.Update. They Changed there mine after this review or because of this review. And paid me the original amount. I still don’t see  using them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ash Mothershead",
          "Nb_Reviews": 1,
          "Date": "2020-12-07T01:20:44.000Z",
          "Titre": "Very disappointed in service",
          "Contenu": "Very disappointed in service. I was told I would receive $305 as the phone was in pristine condition and was offered $165 after phone was received.I would have sold to another vendor and will do so in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T20:34:52.000Z",
          "Titre": "Very upset",
          "Contenu": "I am honestly very upset.  I sent in an iphone that was no longer working as the screen was black and would not turn on, so I was unable to swipe my phone clean.  After I submitted my non-working iphone to buyback boss, I started getting emails of of individuals trying to access apps that were on that phone.  It's very upsetting and had I know that somehow someone could get into my phone I never would have sent it in.  Apple was not able to access anything, but I don't feel it was coincidental that the apps that were on that phone are now trying to be used, as I have been notified by 3 different applications that someone is trying to get into my accounts.  Very upsetting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carson Liu",
          "Nb_Reviews": 2,
          "Date": "2021-03-08T00:41:25.000Z",
          "Titre": "Don’t trust buybackboss!",
          "Contenu": "Sent in a pristine iPhone. They wanted to deduct $50 for a scratch on the glass and discoloration on the back. I told them that it was impossible since the phone had a glass protector and it was always in a case. They offered pictures but I asked to send it back without my iPhone box or SIM card.  Sent off to Whiz Cells and they paid more than buyback boss and they agreed it was in pristine condition and paid what was quoted. BuyBackBoss is shady. #14333THERE WERE NO SCRATCHES ON THE FRONT AND NO DISCOLORATION ON THE BACK.  WHIZ CELLS COULD NOT FIND ANY! They matched the original price quote. Buyback Boss also took my SIM card and box! This was the worst experience.  We go through four phones every two years, and I would not recommend using buyback boss."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kay G",
          "Nb_Reviews": 1,
          "Date": "2019-10-03T22:00:07.000Z",
          "Titre": "This company bait and switched me.",
          "Contenu": "This company bait and switched me.They offered the most. They waited over a week to contact me and then said they found a noticeable scratch on one device that Comcast/Xfinity considered mint and an aftermarket screen on the other so they would reduce they pay out by more than 30%Mind you, the site never mentioned repaired screens being disqualifying or anything.Don’t trust them. Don’t do business with them.I can’t get any of the other offers I had now. It’s been too long.BuyBackBoss CEO Jack knows that. It’s their business model. It’s what they bank on. So go with Gazelle or Someone trust worthy. They may look like they’ll pay you less, but in the end, most anyone else would have paid you more than BuyBackBoss"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tammy",
          "Nb_Reviews": 1,
          "Date": "2016-12-27T01:35:34.000Z",
          "Titre": "They didnt dend me back my phones when i sent them the wrong one also the check i was told i would get was alot smaller than told",
          "Contenu": "I was lied to i sent 2 additional phones to them by mistake the company emailed me and told me they would mail them back and they never did. Also they sent me an amount on my check that was alot smaller than told."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenneth P. Thompson",
          "Nb_Reviews": 5,
          "Date": "2019-05-30T21:13:57.000Z",
          "Titre": "Typical bait and switch",
          "Contenu": "Typical bait and switch. Was offered a good price on a barely used iPhone with no visible marks, but of course when they received it, they stated it was heavily scuffed and scratched. BS!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry Hunt",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T07:48:39.000Z",
          "Titre": "I sent an iPad Mini 5 in perfect…",
          "Contenu": "I sent an iPad Mini 5 in perfect condition and they told me that the iPad is damaged and wants to give me $5. This company is ripping people off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Caron",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T20:16:00.000Z",
          "Titre": "Sent in two phones and the…",
          "Contenu": "Sent in two phones and the condition/price offered was significantly less than what was advertised online.  I would use another company next time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryant",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T18:47:20.000Z",
          "Titre": "FRAUD",
          "Contenu": "FRAUD, BAIT & SWITCH, BUYER BEWARE! Company offered price online based on criteria on website. Upon receipt offered substantially lower amount without reason for lower quote. When called out about this they responded they made a mistake and didn't realize the phone was unlocked and raise the price by a small fraction. Still the phone was in mint condition and they assessed it as fair lying and saying their was a scratch on it quoting it at 20% less than the correct value based on their website. The phone was sent with pictures prior to it arriving at location in mint condition with no scratches and was kept in a case with a screen protector the whole time. The level of lying, fraud and deceit that this company engages in is beyond comprehensible. Company will offer you a lower ball offer hoping you accept without any explanation, not the offer you were quoted. This is illegal and classic bait & switch."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Harry S",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T23:14:18.000Z",
          "Titre": "Bad experience - lowball offer",
          "Contenu": "After looking at all the reviews, I selected Buybackboss to sell my Samsung 8+. This Verizon phone I mailed them was in excellent condition and I was quoted $100. When I followed up, they said it had slight burn on the screen and offered me $20 (again, the phone I had sent them was in excellent condition with no burn), I requested that they mail me back my phone and they responded that they would increase the offer and give me $27 for the phone. I responded that for $27, I would just keep the phone as a back up. They agreed to mail me back the phone and ending up sending me a different phone that was a T Mobile Samsung 8+ which was in very marginal condition with lots of scratches on the glass, and was clearly not my phone since I am with Verizon. At this point it was just not worth the hassle. Overall, a bad experience, I should have gone with my gut and sold the phone to Gazelle."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fred Malmlund",
          "Nb_Reviews": 1,
          "Date": "2021-02-16T19:20:39.000Z",
          "Titre": "Wow!",
          "Contenu": "Wow! $13 for a fine iphone6. Keep your expectations low guys. They offer you way more than you finally receive. Don’t recommend them and wouldn’t use again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amber",
          "Nb_Reviews": 1,
          "Date": "2017-04-24T20:03:58.000Z",
          "Titre": "Gave me a  fake quote",
          "Contenu": "Gave me a  fake quote No stipulations until they got the phone then the price went way downWould never reccomemdThis company do NOT  I repeat do NOT send your phone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Seth",
          "Nb_Reviews": 1,
          "Date": "2018-05-25T19:11:01.000Z",
          "Titre": "Choose buybackboss after a friend…",
          "Contenu": "Choose buybackboss after a friend recommended them was told $65 when I filled in all the details of my said phone. Mailing to them was painless printed the sheet and sent it via USPS. Three days later got an email saying their offer was lowered to $44 dollars for stuff that I made perfectly aware to them when I filed out the initial information. I told them that I had been offered more from three different places but stayed with them because of my word, my friends referral and their guarantee. They didn’t care about that just like they didn’t care about me. So now my option is send it back across the country and start over. Such a giant waste of time. It sounds like people have had great experiences on here and I wish I could say the same but feels more like a bait and switch with my time and their postage costs being held hostage all for a $21 difference."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis Gordon",
          "Nb_Reviews": 1,
          "Date": "2018-09-10T23:02:42.000Z",
          "Titre": "STILL WAITING",
          "Contenu": "I was promised payment for my iPhone within three to five days... I’m still waiting.  🤨  Get me what you owe me and I’ll be happy to change my Rating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian S",
          "Nb_Reviews": 1,
          "Date": "2017-11-24T18:52:40.000Z",
          "Titre": "whatever",
          "Contenu": "Sold them my functioning iPhone 6. It was damaged. Misrepresented their buyback price paying out 25% what they quoted, enabling them to make 1000% off me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Casey Lawless",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T19:11:06.000Z",
          "Titre": "I DO NOT RECOMMEND!!",
          "Contenu": "I DO NOT RECOMMEND!!I shopped the sites and chose BuyBackBoss based on the offer they quoted. I received an email many days later that the value was drastically reduced. I reshopped based on the condition they graded it and sent the link as they asked me to so they could match it. I even contacted the other company to ensure I was giving an accurate description of my Iphone 7 - 128GB. Their issue was the battery life - 78%. The competition did not devalue the phone unless it was below 50%. They responded after I did exactly as they asked and was denied based on their explanation of: \"Unfortunately, their standards are different than ours, so since we do deduct for poor batteries (anything below 80% according to Apple standards) we are not able to match to their \"Good\" pricing.\"Why have a guarantee of price matching if you are going to change your policy in mid transaction? I checked their site for the conditions of the price match and could not find any \"qualifiers\" concerning who they will match.What a waste of time and aggravation. I DO NOT RECOMMEND!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 7,
          "Date": "2019-08-19T22:59:24.000Z",
          "Titre": "If you want to get half of what they…",
          "Contenu": "If you want to get half of what they offer on line mail your phone. Bait and switch tactic. Look for somewhere else to sell your phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jabie Gray",
          "Nb_Reviews": 2,
          "Date": "2021-01-24T21:56:46.000Z",
          "Titre": "I would have given a five star except…",
          "Contenu": "I would have given a five star except the agent tried to negotiate the price quoted down based on supposed \"poor condition\". He claimed that there were \"scratches and wear\" on the phone. This was NOT true. The phone lived its whole life in a heavy case and always had a glass screen protector. When I shipped it in the (factory box for protection), I carefully inspected all surfaces including the screen to check for any defects.  There were NONE, It met their standards for the condition stated and quoted a price for, yet they claimed it was not in great condition after they inspected it. They were basically calling me a liar. I noticed on their site that they were were now quoting a lower price for the same phone, so I can only assume that they were trying to renege on the price quoted because the market went down. I held my ground and told them to either return it in the same condition I sent it in or pay me what I was quoted. If there was any damage it occurred once they received it. They paid me what I was quoted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Do",
          "Nb_Reviews": 1,
          "Date": "2019-03-06T16:11:12.000Z",
          "Titre": "Told one price for phone then cited a…",
          "Contenu": "Told one price for phone then cited a tiny scratch that was not there when I shipped the phone then told me it was worth well less."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Asma Weathers",
          "Nb_Reviews": 1,
          "Date": "2019-12-06T17:34:23.000Z",
          "Titre": "They never answer the phone",
          "Contenu": "They never answer the phone. I called 3 times and left several emails. Now I’m not sure if i wanna send my phone"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Mike B.",
          "Nb_Reviews": 4,
          "Date": "2020-12-31T20:31:06.000Z",
          "Titre": "Bait & Switch.",
          "Contenu": "Bait & Switch.Quote the price, but once received found a way to drop their actual payout. UNSAT!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "India Mckenzie",
          "Nb_Reviews": 1,
          "Date": "2020-12-27T16:40:17.000Z",
          "Titre": "Payment was way lower than expected",
          "Contenu": "Payment was way lower than expected. Sending out payment was unorganized, lots of miscommunication."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TA",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T20:48:48.000Z",
          "Titre": "False promises",
          "Contenu": "False promises. Initial estimate was $150, but then actual offer was $30... Watch out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alberto",
          "Nb_Reviews": 1,
          "Date": "2017-02-28T22:26:59.000Z",
          "Titre": "They lie to my about the money",
          "Contenu": "They lie to me about the money they were gonna give me for the phones"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Havrilla",
          "Nb_Reviews": 1,
          "Date": "2020-05-10T04:56:40.000Z",
          "Titre": "Worst company I have ever dealt with",
          "Contenu": "Worst company I have ever dealt with.  Unethical, unprofessional, crooks.  I have tried doing business several times with this company in the past and they are the biggest con artist/ripoffs on the face of the planet.  Do yourselves a favor and before doing business with them or mailing our device consider facebook marketplace, the eco atm at any local shopping mall, or even trading it into the retailer you are getting your new phone from.  I have sent them several devices in the past including two recently.  All of my devices are always in pristine condition the only problem is they state they will \"price match\" and I try to price match them with declutter and they always find something \"wrong\" (this time they stated my device wouldn't turn on) yeah okay good thing I took a picture of it on while I wrapped it up and took a picture of the serial number before I sent it .  Then they try to tell me my devices are broken and devalue them to near broken condition and try to pay me close to nothing $50.  Then they try too bait and switch I'm sure they are going to send me back a device I didn't originally send them, or swap out the internals like logic board or send me back a bricked device.  Extremely suspect, the car salesman of iPhone resellers.  This company is a joke.  They do not answer their phones, their email is just some face they hide behind.  Regardless of what resolution you try to offer this review isn't coming down.  I also will never send you another device or recommenced you again.  You have lost a customer permently and hopefully many more future ones once they read this review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Selhorst",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T16:10:03.000Z",
          "Titre": "Its been 3 weeks and still have not…",
          "Contenu": "Its been 3 weeks and still have not been paid"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Loyal Customer",
          "Nb_Reviews": 6,
          "Date": "2019-01-08T21:56:03.000Z",
          "Titre": "Form Communication is the Norm--Incorrect and Sent When Office Closed",
          "Contenu": "Ok transaction--somewhat better than trying to sell on Craigslist or eBay.  Continuous form communication, not relevant to the actual status of my sellback, was NOT appreciated.  I received multiple form email messages and a form text message.  One of the email messages stated that they did not receive my phones--even when USPS reported them retrieved from the post office.  Replies to those form messages, including use of actual email address instead of form letter reply addresses, went unanswered--they did not respond \"immediately\".  Form communication sent over the New Year's holiday, even when it was stated that the office would be closed for the Christmas / New Year's holidays.  A telephone call to the company did not receive a response.  No bounce messages received when I tried communicating via email.  These communication problems would not have been an issue except they used intercom-mail.com to send their form communication and did not pay attention to details.  Experience not good--will be much more careful in purchasing cell phones to avoid needing to sell them.Reply:  Note that OPEN communication is NOT maintained.  NO responses were received to my emailed messages--both to your form letter email addresses and your standard email addresses.  Including the form letter inquiry stating my phones were not received when, in fact, they were picked up at the post office earlier that day.  Urgency is not maintained as no responses were received.  I will not be sending any emails to you as time appears to be wasted in doing so.Reply 2:  ANY missed email message is bad--however, MULTIPLE \"missed\" email messages = unprofessional.  I am an IT pro and know how email systems work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stacey Nduati",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T05:55:24.000Z",
          "Titre": "Ended up buying my phone for less than…",
          "Contenu": "Ended up buying my phone for less than promised"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pam Osborne",
          "Nb_Reviews": 2,
          "Date": "2021-04-06T18:14:49.000Z",
          "Titre": "Bait and switch",
          "Contenu": "Bait and switch!  Quoted $500, received $157."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charlie",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T04:38:43.000Z",
          "Titre": "Buyer beware — protect yourself before sending in",
          "Contenu": "Make sure you take detailed pictures of your device, front and back, including in direct light and with the IMEI number showing. I sent my phone in using their provided packaging and they sent me back photos of a device with all kinds of scratches on the screen and offered me a much lower price than I was quoted. I negotiated and took a deal because I didn’t trust them to send me my phone back in any sort of condition to sell to someone else given the shenanigans that happened with my submission. I will not personally be using this company again. If you do, take as many steps as possible to protect yourself and document the condition of your phone before you send it in because I suspect I am not the only one they have tried a bait and switch on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Crowley",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T14:12:44.000Z",
          "Titre": "Significantly reduced the amount of…",
          "Contenu": "Significantly reduced the amount of money they gave me for phone based on their inspection. I do not agree with their assessment, but was not worth it to argue with them.I should have just sold the phone back to T-Mobile for more money than Buybackboss gave and a quicker turn around of getting the money.Their process was easy but be warned they will not give you the full amount of the original estimate and the turn around time is not fast."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin Mueller",
          "Nb_Reviews": 5,
          "Date": "2023-09-25T04:23:00.000Z",
          "Titre": "Smooth, dishonest transaction",
          "Contenu": "I signed up on with Buyback Boss, put in the information for an iPhone 12 Pro Max, and iPhone 13 Pro Max and a third generation iPad Air. I received their offers and accepted them and began the process.  Before I sent my items in, I read a couple of reviews which stated that they sent in phones in excellent shape then were told that they had scratches when received. When I get a new phone, I have a new case and screen protector before I open the phone. I then open the new phone, inspect it, and put on the protection. I am over the top ridiculous when it comes to protecting my phones.  Just to protect myself I videoed my phones and myself wrapping them. I even wrote to them asking if they wanted the original boxes and charging cables. As I said, I am over the top.  They did not. So I removed the protective screens, removed the cases, cleaned the phones and then wrapped them in foam, and then in bubble wrap before sending them. I received an e-mail when they were received and the e-mail said that I would be hearing from them in 5-9 days. On the 9th day I received e-mails that stated that I returned my items after the allowed 14 day return policy, so I would be getting a reduced amount.  After I had to bother myself sending them all the paperwork showing that I did not return them late, they agreed and said that I would not be charged extra for a late return. The next day I received my changed offers based on the deep scratches on my phones.  As I stated earlier, no, my phones were in perfect shape. I have the video since they had done this to others and I needed to protect myself. After mulling over my altered offers and thinking about the fight that I would get, the offers were not lowered enough to waste my time arguing with someone who would run such a scam for a few bucks.  I did get my money the next day. Now I have received my new iPhone 15 Pro Max and have an iPhone 14 Pro Max to sell.  It is in perfect shape, but I will be looking for a more honest company to sell them to."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Reuben Turner",
          "Nb_Reviews": 2,
          "Date": "2023-06-10T18:07:34.000Z",
          "Titre": "Phone was brand new",
          "Contenu": "i included the case and everything was brand new. for them to tell me it has scratches that are \"noticable\" so instead of 90$ they gave me 50$ instead. I would go somewhere else to get a better quote but I wasn't going to mess with them shipping it back just to wait even longer. I don't think I'll be using them again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Rubink",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T05:51:36.000Z",
          "Titre": "Could have gone worse, could have gone better",
          "Contenu": "Gave them a like new iphone 13 pro that I barely used.  Glass screen protector and case installed at the store.  Then discovered when buyback got the phone that somehow the screen had been keyed.  Nearly 200 dollars value up in smoke.  And if they returned the phone it would be sans the case and glass as that's their policy to trash everything but the phone on receipt.  I even offered photos of the phone that I took before I shipped it.  No scratch there but they also had a photo of a gold 13 pro with a scratch.  Who you going to believe?  Doesn't matter.  They offered me 30 dollars to sweeten the pot.  Anything good about all of this?  The customer service is professional and the process in general is good even if it took two weeks to unbox the phone and process the return.  Technically 10 business days. At the slowest end of their stated business process. Definitely strip the phone down and take a lot of good photos otherwise an unboxer might decide to use his brand new house keys to peel screen protector off.  Doesn't do them any good, to be fair, but it also doesn't do you any good.   I guess the adage \"never attribute to malice what can be just as easily attributed to ignorance\" applies here.  Whelp."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kit Hentzen",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T21:24:03.000Z",
          "Titre": "I did some research on these “phone but…",
          "Contenu": "I did some research on these “phone but back” companies. Tons of them are scams and have mixed reviews. This company quoted me and then when the received it, they said phone was inoperable. They tried to send me a video of the phone not working and it wasn’t even the same phone! (Different color). Then I told them to send it back, they then increase the super low ball number and I still said no. They mailed me the phone back, luckily but did not send back all the original box, packaging, and charging cable I sent with the phone. They then told me, we throw all of that away, we do not send back.STAY AWAY FROM THIS COMPANY!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sue Herndon, customer",
          "Nb_Reviews": 3,
          "Date": "2023-05-12T22:21:43.000Z",
          "Titre": "Actual amount paid well below what…",
          "Contenu": "Actual amount paid well below what condition of the phone showed due to \"battery life\" I have no way to confirm that"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Esperanza H Natal",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T05:12:44.000Z",
          "Titre": "The website said that it would take a…day to receive payment it was not received till Nov. 2nd.  I just feel they should be truthful of expected time it would take.",
          "Contenu": "The website said that it would take a day to receive funds the label went out ground service then by when they were able to check device it actually took almost like 7 business days to receive payment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marisol VelaChiu",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T15:16:56.000Z",
          "Titre": "The buy back price was lower than…",
          "Contenu": "The buy back price was lower than expected."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MD BMD",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T22:00:34.000Z",
          "Titre": "I would be cautious with their…",
          "Contenu": "I would be cautious with their estimates, the website purports a high quality estimate but once they have your equipment, they low ball you. However, having said that, their process is seamless and quick.—Thanks for your reply, however as we stated in our interchange, the battery health was fine when shipped (I have a screenshot), it is ‘convenient’ that when you ran ‘diagnostics’ the battery health was just below your stated 80% threshold. I stand by my recommendation to be cautious when interacting with your business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jason novotny",
          "Nb_Reviews": 2,
          "Date": "2022-03-23T12:07:44.000Z",
          "Titre": "Had submitted 2 devices and 1 was not…",
          "Contenu": "Had submitted 2 devices and 1 was not able to be unlocked, so only provided an offer for one.  This device was valued online at $57 but once they inspected the battery, only offered $16.  I believe this could have been something that they illustrated how to check before sending the device to them for a valuation, so to me it felt like a bait and switch"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Veronica Smith",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T03:53:51.000Z",
          "Titre": "Not what I thought it would be..",
          "Contenu": "Not what I thought it would be... this company gives the impression that they will give you the most for your phone. When they receive they change the price.... Then using paypal is a entirely different situation..... not worth what I went through."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dmitriy Redka",
          "Nb_Reviews": 4,
          "Date": "2022-03-13T19:20:47.000Z",
          "Titre": "Bait and switch ploy to renege on advertised price",
          "Contenu": "My phone was only 2 months old and I had the screen protector installed at the store as soon as the phone was pulled out of the box.  Yes despite it's condition, Buyback Boss came up with BS excuse of scratches on the screen to reduce the advertised online price.  This place is a scam."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A H",
          "Nb_Reviews": 1,
          "Date": "2022-01-20T01:05:30.000Z",
          "Titre": "Cased Phone Magically Has Deep Scratches",
          "Contenu": "The phone was sent without any scratches and with a  screen protector still on it in case there were issues with shipping.  I was quoted at about twice the worth that I ended up receiving in payment because supposedly by the time it reached their office, it had deep scratching on the screen and \"heavy deep wear\" on its body.  I assume they did not remove the screen protector and there must have been issues with shipping because the phone had stayed in a case its whole life.  They are dishonest and part of the reason I trusted this company were the falsely inflated reviews on Trust Pilot."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J Sharpe",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T02:58:01.000Z",
          "Titre": "Company did not honor their quick…",
          "Contenu": "Company did not honor their quick turnaround timeline. My phone was at their office for nearly two weeks before they inspected the phone to cut the check. On top of that an employee emailed me to try to lowball my original offer. I then provided all of my documentation of tracking and previous conversations with other staff members. They promptly paid my initial offer once I stood my ground and told them they could return my phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christan Branch",
          "Nb_Reviews": 1,
          "Date": "2021-02-22T01:05:42.000Z",
          "Titre": "2 out of 5 for me",
          "Contenu": "I sent my phone 2 months and I just got my check 3 days ago. The process was easy but the wait time and process was so long that I forgot about it. My phone was in excellent condition but during the process of shipping it must have gotten smashed up so I only got $30 it was a waste of money and time. $1,000 phone and I sold it for $30 SMH"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Peery",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T11:52:33.000Z",
          "Titre": "I filled out the form before I sent the…",
          "Contenu": "I filled out the form before I sent the phones and was very honest about the condition of the phones. After their “technician” looked at the phones the price dropped considerably. I felt it was a bait & switch but I didn’t want to deal with it anymore I just accepted the new proposal. I’ll never use the service again and won’t recommend to my friends & family."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Don Walton",
          "Nb_Reviews": 1,
          "Date": "2020-12-21T23:53:50.000Z",
          "Titre": "Kind of feel like they screwed me",
          "Contenu": "Kind of feel like they screwed me. I was offered $100.00 for a 3 year old I-phone in like new condition. Once they got the phone it was only worth $60.00 as the battery was not up to standards. Wouldn't you assume that a 3 year old battery wouldn't be perfect. So the $100.00 offered seems to me to be a bate and switch."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mary s conlin",
          "Nb_Reviews": 2,
          "Date": "2021-07-27T02:13:29.000Z",
          "Titre": "If it seems too good to be true, prob is……",
          "Contenu": "I was very excited after completing questions, honestly and accurately,  online and getting my quote. Sent my phones in and 5 days later learned it would be less than a third of what I was offered.  Reasons were ridiculous, nothing of what was mentioned in initial bid or disclosed as possibility during buying process.  CSR basically said that was that, offered to send back but of course they know they’ve got you and who is to say what my phones what have been like when I got back.  FYI buyer beware, if sounds  too good to be true probably is🙄"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Carter",
          "Nb_Reviews": 1,
          "Date": "2020-09-07T01:40:47.000Z",
          "Titre": "Had a good working phone",
          "Contenu": "Had a good working phone, sent it in the mail and now it’s not working and it’s value has diminished. Isn’t this the typical situation in which you trade in an old phone? It’s working but slightly old and then after being exposed to the summer heat in the mail the battery gets damaged? Think about that before you put your smart phone in the mail."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Grace Hewlett",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T19:19:48.000Z",
          "Titre": "After sending in my device",
          "Contenu": "After sending in my device, then BuyBackBoss(BBB) sends me a message saying that they will only give me $1 down from $200. I was not pleased and had to request several times to return the device. They finally decided to give me the original price. I did get the funds but will not use them anymore."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nathaniel",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T23:27:16.000Z",
          "Titre": "Low ball",
          "Contenu": "Was very disappointed with the review and value of my phone. Phone was kept in case and in very good condition but only given “Fair” condition. Could’ve gotten more through Verizon but didn’t want to go through hassle of getting it shipped back. So took the low end of $68.00 for an iPhone 7. Used this through recommendation of a friend. First and last time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carleigh Allison",
          "Nb_Reviews": 1,
          "Date": "2018-04-16T20:41:08.000Z",
          "Titre": "Sub-par service",
          "Contenu": "Sub-par service. They give little detail in what they considered \"damaged\" or \"broken\" and after I was quoted $110 for two iPhone 6s, they reduced my quote down to $40 due to what they consider \"severe frame damage\" even though Apple offered $50 for the phone as is. I will not be using this service again and I don't recommend anyone to offer them business.**UPDATE**This company did give me the quoted price as a courtesy, which I greatly appreciate."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim P",
          "Nb_Reviews": 1,
          "Date": "2020-10-03T21:49:30.000Z",
          "Titre": "Actual offer was $20 less than quote",
          "Contenu": "Actual offer was $20 less than quote. Been in the cell phone business for over 10 years. I know the value & resale quality of cell phones. Seems you nickel & dime your way to profits. Cannot recommend to my business clients."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew McGann",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T15:02:10.000Z",
          "Titre": "Dishonest Review process?",
          "Contenu": "I went to Apple to sell my phones, and they offered me $215 each ($430 total) as both phones looked to be in \"like new\" condition. The only issue was the Battery life was 84%. Apple offered us \"Apple Gift Cards\" vs. cash. I then went to BuyBackBoss and others, and BuyBackBoss offered me $220 for each phone - cash - so we sent our phones to BuyBackBoss. Upon checking our phones, they said that our 1 phone had issues with the vibrate function as well as several deep scratches. The phone did not have deep scratches when we sent it, and the vibrate function was not an issue per Apple's inspection 3 days prior. I can't help but feel like this is a dishonest business practice of BuyBackBoss, but it is the risk we take when we send our phones to a service like this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "rob",
          "Nb_Reviews": 1,
          "Date": "2021-01-18T19:46:06.000Z",
          "Titre": "Classic bait and switch",
          "Contenu": "Quoted $220 for my ~3 week old, like new Pixel 4a.  When they got it, the offer mysteriously went down by $30 because there were \"micro scratches\" on the screen.  Nope.  But, now that they have your phone, you get to weigh the hassle of asking them to return it (is that free, I wonder) against the $190 they're now offering.  My suspicion is that this happens all the time and is 'baked in' to their business model to boost income.  They probably get plenty of people who misrepresent the condition of their devices either intentionally or not, but I confess their implication that I lied about my phone stung.  Yes, I took the $190, but won't be using them again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sayeedshowbob",
          "Nb_Reviews": 7,
          "Date": "2021-01-28T01:02:41.000Z",
          "Titre": "Payment reduced & funding kind of slow",
          "Contenu": "Disappointed to have the condition of my phone downgraded (from \"mint\" to \"good\"), along with a 40 dollar reduction in buyback amount.  Also, time to receive funds vs date phone was sent (14 days)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew Coate",
          "Nb_Reviews": 1,
          "Date": "2018-12-31T19:29:56.000Z",
          "Titre": "Got the money but it was a fight",
          "Contenu": "In the end I got the amount that was originally promised, but I had to argue with customer service to receive it.I was honest that my phone was damaged. The “damaged” category specified a non functional microphone or speakers and the microphone on the iPhone 7 was not working. Buyback Boss offered $100 for it.After I sent it in I received an email stating that because they microphone wasn’t working for a specific reason they would only offer $30. After some back and forth I sent a screen shot of the buyback boss website where it states that broken microphones count as “damaged” and not “broken” and they offered the $100 originally quoted price. I will not do business with buyback boss again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian M Holajter",
          "Nb_Reviews": 1,
          "Date": "2021-06-23T14:10:37.000Z",
          "Titre": "Quote and amount paid are vastly different...",
          "Contenu": "The amount paid was far, far less than the amount quoted. There were issues they found that I had not experienced, but regardless, it should not have been a $240 difference."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James K Benson",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T05:59:40.000Z",
          "Titre": "An offer is made and then reduced",
          "Contenu": "An offer is made and then reduced. Sounds suspicious and untrustworthy. Hard to feel good about being taken advantage of."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TH",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T18:55:11.000Z",
          "Titre": "iPhone",
          "Contenu": "Customer service was okay. Process was disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donovin Dunlap",
          "Nb_Reviews": 2,
          "Date": "2020-12-01T08:20:36.000Z",
          "Titre": "Pretty disappointed took almost 4 days…",
          "Contenu": "Pretty disappointed took almost 4 days to get my money normally I get it the same day it’s delivered or maybe the next"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T19:27:33.000Z",
          "Titre": "Bait and switch",
          "Contenu": "Bait and switch.  Gave me one price then came back and basically gave me nothing.  By then it was too late."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rachelle Marbury",
          "Nb_Reviews": 1,
          "Date": "2017-11-30T17:19:03.000Z",
          "Titre": "I could have gotten more for my phone …",
          "Contenu": "I could have gotten more for my phone with a different service, I wish I had used the other service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2021-02-11T12:35:42.000Z",
          "Titre": "Sell on eBay",
          "Contenu": "I wanted to sell my old iPhone quickly and without hassle. My screen needed to be replaced as it sometimes would not light up and I’m not someone who would be capable of replacing it on my own. I put in specification of the condition of the phone which was pretty good I always had it in an otter box case it was almost scratch free except for a tiny Knick or two on the side mot the screen. After putting in the condition and an explanation of the phone and the issue it had I was quoted somewhere around 115 if I recall. I sent out the phone fully charged and reset. After they received it they emailed me and said the phone doesn’t turn on even after charging it so they were now offering me 38$ after they already had it. The phone was fully charged and the phone did turn on and I had pictures of the phone on in full working condition the screen not lighting up was not something that happened all the time. I feel like this company basically quotes one way and then just tells everyone their phone doesn’t work because at that point is the person really going to send it back and then try to sell it again? Probably not. I feel like I got scammed and I would not recommend anyone use this company to sell back their phone I think they would be better off going on eBay or marketplace.*in response to the company response below. They say “just like I said the device sometimes does not turn on”. I explained already that it does turn on it just needs a screen replacement. That is a big difference from being damaged which the screen is to completely broken and not functioning. I do stand by this review and I will not recommend anyone uses this route to get rid of an unwanted phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joshua Garner",
          "Nb_Reviews": 1,
          "Date": "2021-03-29T04:47:36.000Z",
          "Titre": "Process is long and payments are low"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MJRCO",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T07:55:19.000Z",
          "Titre": "Free shipping both ways is the best thing about them!",
          "Contenu": "Free shipping both ways is the best part of the deal.  Service was somewhat slow as it took them 5 days to “evaluate” my EUC phone that always had a glass screen protector installed and lived inside of a leather wallet type case.  Anyway, they didn’t agree with my condition assessment, so I asked them to send it back (which they did after 3 higher revised offers, before I told them it wasn’t about the money, it was about their process and high promise low delivery business methods)I will not use them again as the entire process took too long and I felt they used bait and switch tactics to lower their price paid."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T04:47:15.000Z",
          "Titre": "On the plus side they were easy to work…",
          "Contenu": "On the plus side they were easy to work with.  My phone wasn't unlocked, and they were patient as I worked to get it that way.  One the down side they downgraded the quality of the phone and paid less for it.  I couldn't see any scratches at all on it, but they claimed there were some."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T17:53:02.000Z",
          "Titre": "After shipping my phone they claimed…something different.",
          "Contenu": "After shipping my phone they claimed damage and offer me substantially less than the quote.  When I protested, they basically said take it or leave it.  Pretty disappointing.  Next time I'll use one of the larger companies, because even though the initial quote may be lower, I know it will be real."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lauren L",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T02:55:32.000Z",
          "Titre": "Never accept their first offer",
          "Contenu": "The good: they were communicative and quickly responded to my inquiries. They also quoted me the highest price for my iPhone 12 Pro.The bad: after I sent in my phone and they received/inspected it, they claimed that my back camera was broken and offered me less than half of my original offer. I knew this was not true. I told them I knew this wasn’t true and asked them to send it back. All of a sudden they realized that my back camera was in fact functioning correctly and said they would pay the original quoted payout, and which they promptly did. This is the second company I’ve worked with that try to first low ball you to see if you’re too lazy to deal with sending it out to another company. Feels a bit shady."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cristina Uribe-Marin",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T05:10:44.000Z",
          "Titre": "They changed the offer with no proof",
          "Contenu": "My phone was in impecable condition and they said it had scratches, the phone has always had protectors and is in excellent new condition. I fel cheated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Muller",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T04:41:18.000Z",
          "Titre": "Good communication back and forth",
          "Contenu": "Good communication back and forth. Not happy that PayPal deducted fees for the payment. Took less then original quote do to phone was on a att account before I purchased as a financed phone? Took buybackboss negotiated fee to unlock phone. Worked it out with my loss of $40"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Netty Zaid",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T15:23:04.000Z",
          "Titre": "The price should be as estimated",
          "Contenu": "The price should be as estimated, Not less than 1/2. Wonder if Apple is so critical. It did help me to declutter a bit, with some change in pocket. Overall decent experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Regester",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T00:55:53.000Z",
          "Titre": "Annoying process.",
          "Contenu": "Edit: Way too many emails for this simple transaction. Please review the number of emails you send once you have received the phone. While I did get a decent price it took longer than it should have, IMO. The only real complaint was that even after my phone had been received they just kept sending shipping instructions the whole duration. It was an annoying process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sara S",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T03:49:59.000Z",
          "Titre": "The Process Takes Longer Than Advertised",
          "Contenu": "Service was solid, but timeline is exaggerated in any/all advertising.  I had to continually contact support to see what the status was and while they were super friendly, polite, and helpful... proactive communication would have been nice. Initially, I was told that payment would potentially be received \"in as little as 2 days\" but the process took a full two weeks.  The initial price estimate is also exaggerated; they don't mention that there is a 2-5 day examination period for each phone and that the final buyback price is likely to be 30% or less of what their online estimate states."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Sabella",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T14:54:46.000Z",
          "Titre": "Suspect Grading",
          "Contenu": "Process was reasonably seamless however the grading process appears designed to reduce payouts and I suspect this a customary business practice. I submitted a phone that was essentially brand new looking with far less wear and tear than would be expected, but was told it was not as I described. Be prepared for this if you select this buyer as you no longer will have the phone in your possession."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MIKE SHAW",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T12:38:13.000Z",
          "Titre": "I sold them 2 iPhones - great result",
          "Contenu": "UPDATE:After reading my review, I was contact by them & they explained the reason on the SE further.  Since I have done business with them in the past, they graciously offered to sent me a check for the $100 difference in order to keep my future business.  Very good customer service.  I recommend them highly.PREVIOU REVIEW:I sold them 2 iPhones.  First an iPhone 13 Pro Max. The payment for that phone which cost $1,199.99.  I was quoted $719.82 and I got $701.00 due to some small scratches at the bottom of the phone.  Second an iPhone se 2020 which cost $449.99.  I was quoted $111 but only got $11 due to a battery issue which seems odd since it was less than 2 years old.  A disappointment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T19:12:57.000Z",
          "Titre": "I sent 3 phones and they found reasons…",
          "Contenu": "I sent 3 phones and they found reasons to reduce values by over 50%. Likely wont use again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Coker",
          "Nb_Reviews": 1,
          "Date": "2022-01-26T20:05:47.000Z",
          "Titre": "Speed and service was 5 star, but not appraisal!",
          "Contenu": "Speed and service was 5 star.  Wasn't pleased with appraisal of my phones.  They stayed in protected cases and screen protectors the entire time we owned them and even shipped them in the cases.  Only got about half of the buy back $'s than what was originally stated with phones in \"good\" condition.  Their trade-in estimates just lure you in to use them.  Expect to only get half and make your decision from there."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rolando Drausal",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T16:56:56.000Z",
          "Titre": "I am giving them a 3 because the…",
          "Contenu": "I am giving them a 3 because the decision made on a tiny pixelation was questionable and it reduced significantly the original offered made. Otherwise the communication via email and check delivery were on point."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T18:47:35.000Z",
          "Titre": "They will lowball you",
          "Contenu": "I have an iPhone 7 that was in mint condition. They offered me $80 for it. When they got it they said that the battery was bad and only offered me 40. The battery was adequate, I had been using the phone and I know that the battery held for hours. I knew when I mailed it off to them that they were going to do this, it’s so easy for them to do. I would never use them ever again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 2,
          "Date": "2021-02-23T18:57:42.000Z",
          "Titre": "My phone was delivered the Friday…",
          "Contenu": "My phone was delivered the Friday before Presidents Holiday, so I waited to see if I got info., 2 weeks went by and until I inquired about my phone and sent photos of the delivery receipt nothing was happening, but then I received a check within 1 week.  But they cut me $10 without explanation as to why, so I feel like that is a standard ploy.  I will use a different service next time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alica Norvell",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T06:05:03.000Z",
          "Titre": "This was a good find",
          "Contenu": "This was a good find.  I was a bit taken back that the price of the buy back was lowered when they received the product.   The phone from the moment of purchase to being sent back had an Otter case and then a similar style.  The phone was sent back in the case.   But it was worth not having to toss in the garbage.   The next order will be several phones for a client/friend."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Galway",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T10:12:37.000Z",
          "Titre": "Quoting process",
          "Contenu": "I received a buy back quote of $35 but once the phone was shipped and received, the quote dropped to $3.  Feels a little disingenuous.  Maybe the quoting process should be a little more detailed. While my phone did not have the original glass screen, the quote should not have dropped $32."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glen Olson",
          "Nb_Reviews": 1,
          "Date": "2021-01-31T13:34:21.000Z",
          "Titre": "Appearances can be deceiving.",
          "Contenu": "Whatever you're offered after your initial description, be prepared to receive less.  They purposefully leave their descriptions vague so they can nitpick your actual device and offer you less money.  Hold your ground though and be patient as they counter offer.  You can get pretty close to what you're offered initially."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marsha Fisher",
          "Nb_Reviews": 1,
          "Date": "2020-09-06T02:00:23.000Z",
          "Titre": "Easy Process, but be careful.",
          "Contenu": "While Buyback Boss makes the process of selling your phone(s) easy, they do not explain a few things. Please note if you have an Apple phone and used Verizon insurance (Asurion) to fix it, the value of your phone is reduced drastically. My iPhone X was in perfect condition, but since I had a problem with a screen and Asurion sent me a new one, the value decreased by approximately $200.00."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Bank",
          "Nb_Reviews": 1,
          "Date": "2020-09-10T12:54:23.000Z",
          "Titre": "Not an Iphone",
          "Contenu": "Not an Iphone. Moto Z3 Play with extra mem card. They initially offered 40. Once they received it with all original packaging and accessories, they offered me 25 saying the case was damaged and screen ghosting. I knew this wasn't entirely right so I asked them to send it back to me. They did, minus the sim card and extra memory card that i purchased. They have now promptly reimbursed me for the missing mem card."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trish T.",
          "Nb_Reviews": 1,
          "Date": "2020-07-08T04:16:34.000Z",
          "Titre": "Coincidentally my face recognition…",
          "Contenu": "Coincidentally my face recognition software was not working once they received my phone and only offered $55 for it. I, of course, had no recourse and was given the option to accept the reduced price of $55 and not really even advised what the policy would be of them returning my phone.Update: after posting this review, i was contacted and offered the original amount for my phone. So, I increased the rating from 1 to 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Monica McGuire",
          "Nb_Reviews": 1,
          "Date": "2021-04-16T23:53:31.000Z",
          "Titre": "Disappointed to receive an offer back…",
          "Contenu": "Disappointed to receive an offer back of less than what was originally quoted after Buyback Boss received my phone.  Reason was: phone was chipped/cracked.  I don't recall there being any crack on the phone but after the company sent me a picture of the phone, I decided to accept the new offer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adrian G Stewart",
          "Nb_Reviews": 1,
          "Date": "2020-12-06T19:26:48.000Z",
          "Titre": "Don't be surprised if your quote is adjusted down.",
          "Contenu": "The initial price quote was the highest by far. However, when Buyback Boss ran tests it turned out there was an issue with the vibration function on my iPhone and the price was adjusted down. I don't recall an issue but maybe there was.  Please supply customers a list of functions to check before we ship our phones that way expectations are realistic... and publish stats to show the difference between quotes and actual prices paid and why the difference. Transparency builds trust."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerry Koff",
          "Nb_Reviews": 3,
          "Date": "2021-02-01T15:08:14.000Z",
          "Titre": "Sent back an iphone 8 plus in excellent…",
          "Contenu": "Sent back an iphone 8 plus in excellent condition. Was given an estimate of $210.00. BuyBack only paid $165.00, claiming that phone was not as expected. This phone was evaluated before it was sent in to BuyBack, and was given an excellent rating. No explanation from Buyback as to why they devalued the phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laura collier",
          "Nb_Reviews": 1,
          "Date": "2022-01-15T13:07:14.000Z",
          "Titre": "All Great, EXCEPT....",
          "Contenu": "My experience at first was top notch. BBB is very responsive and make it incredibly easy and fair to sell your phone. The only problem is it's been about 2 weeks now and I haven't seen my money. I asked that it be paid through PayPal and for some reason PP put a 21 day hold on me receiving the money. I don't know why but I find myself wondering now if this whole thing was a scam. If I get my money I will come back and update this reveiw. signed, WorriedUPDATE: Buyback Boss contacted me and offered to Fed Ex my check to me instead of going through PayPal. Got the check. Brittney was amazing. This company is LEGIT!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PA Customer",
          "Nb_Reviews": 8,
          "Date": "2019-08-29T22:51:16.000Z",
          "Titre": "Tried to RIP me off!!",
          "Contenu": "Using their criteria, I assessed my phone as being worth $80. BBBoss assessed the phone and said it was only worth $35. I told them I can get at least $70 on Decluttr and to just send the phone back to me. They then said... oh OK we'll give you $77 instead. Really? This is a rip off move if I ever saw one! I did take the $77 just to be done with it. But why do you need to play like that???!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aneisha Smith",
          "Nb_Reviews": 2,
          "Date": "2021-02-01T21:27:54.000Z",
          "Titre": "Just an \"ok\" experience",
          "Contenu": "I was happy with the offer which was great but not to pleased that it took so long to check in my phone, I had to reach out several times in order to see why my phone wasn't checked in after being received over a week. Brittney was great and finally had my phone processed and payment sent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2020-06-11T17:43:32.000Z",
          "Titre": "Not great, just OK",
          "Contenu": "Experience was a ok. It took some time to get the right box for shipping. When I described my phones to get my quote I went by their guide for an estimated price. After they received the items they sent me an email saying that the phones weren’t in the condition that I said. Basically I was offered less money or they could send the phones back. It would have been more work and hassle (time) to have them sent back and go through the process with another company so I settled for less money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy Hickman",
          "Nb_Reviews": 1,
          "Date": "2018-05-07T20:26:18.000Z",
          "Titre": "overall it was a decent experience",
          "Contenu": "overall it was a decent experience.  My husband and I used $10 credit codes but neither of us were given the extra $10 even though it appeared when we checked out.  Also, they received my device and said it was scratched in the corners.  I had inspected the phone myself and found nothing prior to sending it.  I've used them plenty of times in the past without issue.  Just a little disappointed this go round."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 2,
          "Date": "2017-12-01T04:59:20.000Z",
          "Titre": "Price change to quote",
          "Contenu": "The process to send in my phone was pretty easy and all seemed well initally. However I later found out when I received my check that I got less payment than was quoted because my phone was still logged into I cloud. I didn’t see that was a requirement when I signed up to send in my phone, I still couldn’t find the fine print when I searched the website about it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christian Erickson",
          "Nb_Reviews": 2,
          "Date": "2018-10-08T23:57:19.000Z",
          "Titre": "Room for improvement, but not bad…",
          "Contenu": "I felt I described the condition of my device accurately given the prompts provided by Buyback Boss. Naturally, they bumped the quote down because they found a defect that wasn't specifically addressed in their prompts. I felt like this was a bit of a bait and switch. However, they were willing to ship my device back at their expense. I did suggest that they be more comprehensive regarding what constitutes \"cosmetic\" damage. Hopefully, they'll implement those changes soon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TMB",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T12:14:34.000Z",
          "Titre": "First experience was better",
          "Contenu": "I sold my macbook to this company first and it was great! Everything went so fast and I got my money within a week. When I sold my iphone back it wasn't the same. My tracking information wasn't updated. It said it hadn't been delivered when my postal service said it had been delivered. I ended up having to email them to see what was going on because it had been longer than promised and then I didn't receive an email back for a few days after. When they finally responded I received my money for my device by 5:00pm that day. Not sure why my second experience was so different."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JAMES RAGNO",
          "Nb_Reviews": 2,
          "Date": "2022-04-18T10:26:42.000Z",
          "Titre": "The price quoted to buy my phone was changed",
          "Contenu": "The price quoted to buy my phone when I completed their form was downgraded after they received it from $60 to $14. Apple store was going to give me $50. Would not use this company again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VicVegas2013",
          "Nb_Reviews": 4,
          "Date": "2021-05-28T11:55:51.000Z",
          "Titre": "Its okay, I wouldn't use or recommend though.",
          "Contenu": "Was quoted a price, then told another price, then once I accepted they took a fee.  After all these deductions it was about 20-25% less than the original quoted cost. Turn around was a bit longer than another well known service like this.  So next time, I would use the other service I've used in the past.   I added 1 star to bump it up to 2 stars because they were responsive to my emails.*updated*Added 1 star for attentive customer service.  I was contacted and offered the difference dollar amount, minus the fee of course.   I still would not use this service again regardless.  I've never had such an issue before with Gazzelle."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T19:03:16.000Z",
          "Titre": "No payment/bad communication from Buyback",
          "Contenu": "Been nearly a month and still have not received a check for my two phones.I've tried several times to contact Buyback and received no response.Follow up:  Brittany from BB reached out to me with an email and FedEx'd a check to me for the phones.  While I wished it hadn't travelled down this road, this review got their attention and the situation was rectified within 2 days.I will say BB made it very easy to send in the phones, gave me a good price.  The problem was on the back end.  In the end, when I'm done with my current iphones, I will give BB another chance,  As such, I changed my rating from 1 star to 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Monique Kuni",
          "Nb_Reviews": 1,
          "Date": "2019-11-18T17:03:31.000Z",
          "Titre": "payment",
          "Contenu": "Process was easy & quick. I did receive email that my payment was being donated per my request. However I never intended to donate. I called the same day as email received & was told change was updated & I received check within 4 days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen Roush",
          "Nb_Reviews": 1,
          "Date": "2021-11-07T01:23:45.000Z",
          "Titre": "Felt like a bait and switch...",
          "Contenu": "On line they gave me an estimate of $70 for my iPhone 6s Plus; definitely higher than two other offers.  When they received it and examined it, the offer dropped to $45.  Felt like a bait and switch."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paula",
          "Nb_Reviews": 1,
          "Date": "2019-03-12T20:22:40.000Z",
          "Titre": "I was quoted a higher buy back amount…",
          "Contenu": "I was quoted a higher buy back amount on line, then after they received my phone was told they would pay me less due to a slight dent that I was unaware of.  I did decide to accept the offer rather than have it shipped back to me and to have to start over again.  Beware!I was recently contacted by Buy Back and they had read my review and decided to meet the price they had quoted me originally.  I think that was really nice of the company to try to make things right.  I am now a very pleased customer and have received a check for the difference of what they paid and what they quoted.Thank you Buy Back👍"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 2,
          "Date": "2017-06-30T18:25:05.000Z",
          "Titre": "It would have been helpful to know …",
          "Contenu": "It would have been helpful to know prior to mailing the device that certain things needed to be done to the account in order to receive the maximum amount for the phone. I settled for 50% of what I was promised because I could no longer access the account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Ruff",
          "Nb_Reviews": 2,
          "Date": "2019-11-01T23:13:57.000Z",
          "Titre": "mixed emotions",
          "Contenu": "The process was easy, the pay was less than expected and you might get low balled when they receive it. One phone we sent in was claimed to have ghosting on the screen and the offer went down to $10. They did send a photo of the burnt in image which the circle shapes didn't match any wallpaper or screensaver we used. Hard to say if it was honest or not but it's better than sitting in a drawer not being useful for anyone.Update: Brittany contacted me by email to follow on my review and to ask for anys ideas I may have to improve customer experience. Seems like a company is trying to improve customer experience and be the best they can be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robin King",
          "Nb_Reviews": 1,
          "Date": "2021-10-27T01:47:58.000Z",
          "Titre": "Process went very smooth",
          "Contenu": "Process went very smooth, they even sent a prepaid label and box for no charge.  Only downside is battery was low so price went down $100 from initial quote..  seemed a lot for a battery."
        },
        {
          "Note": 3,
          "Lieu": "PR",
          "Pseudo": "Jesus Librada",
          "Nb_Reviews": 1,
          "Date": "2021-02-28T22:40:58.000Z",
          "Titre": "Pay way less than expected",
          "Contenu": "Pay way less than expected after reviewing the almost gift  out the phones, they still get money bu the parts and recycle, in other hand the service are great, verry communicative and following up"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Ennis",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T13:36:29.000Z",
          "Titre": "Process too slow"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Todd Niedzwiecki",
          "Nb_Reviews": 1,
          "Date": "2020-05-04T21:20:12.000Z",
          "Titre": "Think they should have more options on…",
          "Contenu": "Think they should have more options on the return process. Like you know what is wrong with your phone and they could give you an estimate on what they would give you. Not just pick one of four options."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mitch McClure",
          "Nb_Reviews": 3,
          "Date": "2021-01-27T20:33:22.000Z",
          "Titre": "Had a wait but was made right",
          "Contenu": "Had a long wait and had to track my phone order to them and email them several times to see what was going on.   They did make it right in the end which I appreciated very much."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barb Fischer",
          "Nb_Reviews": 2,
          "Date": "2021-07-17T12:05:15.000Z",
          "Titre": "Average, because it was comparable to another disappointing buy-back service",
          "Contenu": "After a disappointing experience with one buy-back service that promised big and delivered nothing and because of rave reviews, I sent an old item here.  It had been very well cared for over the years, it was old but totally functional.  I actually didn't rate it as high as I could determine from their guidelines that it was; this rating implied a promise of a certain amount.  They found a defect that was not noticeable to the average human eye and they said the device was valueless.  I suspect those giving high ratings were selling much newer less used items than what I had.  You really can't expect a well used but lovingly care for device to be absolutely perfect and I tried to allow for that in my opinion.  The question keeps running through my mind, how much will these buy-back businesses make from reselling these \"valueless\" items?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 3,
          "Date": "2020-01-20T23:10:46.000Z",
          "Titre": "Good But Not Great!",
          "Contenu": "Buyback Boss lived up to their financial commitment to purchase my distressed iPhone but the transaction took one month longer to complete than originally estimated by them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lindsay Shearon",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T22:59:50.000Z",
          "Titre": "Definitely didn't care for being quoted…",
          "Contenu": "Definitely didn't care for being quoted one price and ended up only getting half. But other than that they were good with communication"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T13:12:34.000Z",
          "Titre": "Phones seem to be in perfect condition",
          "Contenu": "Phones seem to be in perfect condition, but yet every android I sent back seems to have the ghost image on them. Didn’t see that, so I question it"
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Sarleya",
          "Nb_Reviews": 4,
          "Date": "2021-03-18T17:34:14.000Z",
          "Titre": "Didn't accept my phone",
          "Contenu": "I tried to sell my xiaomi phone but they could not accept it even though it is a relatively new phone. However, customer service was good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sheena",
          "Nb_Reviews": 1,
          "Date": "2017-11-30T18:05:34.000Z",
          "Titre": "Eh wouldn't recommend to friends …",
          "Contenu": "Your system works well but the adjustment to original quotes price was annoying.  Quote lower and don't adjust your offers"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2016-12-05T13:22:31.000Z",
          "Titre": "Check took a few weeks, not great turn around time",
          "Contenu": "I was happy to find out that I could sell my iPhone 5s for a $57 profit, but waiting 3 weeks for my check was too long."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen & Ian McClellan",
          "Nb_Reviews": 1,
          "Date": "2021-02-06T02:26:23.000Z",
          "Titre": "Unclear method of determining payout amount",
          "Contenu": "Not a very fast payout, and the whole process of determining the value for my devices was not transparent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Simpson",
          "Nb_Reviews": 1,
          "Date": "2020-09-30T11:05:40.000Z",
          "Titre": "Average Service, Positive Experience",
          "Contenu": "Average service.  CEO was responsive to issues.  He resolved the issue quickly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Heer",
          "Nb_Reviews": 1,
          "Date": "2019-12-17T00:12:05.000Z",
          "Titre": "Never received my money for my iPhone 7.",
          "Contenu": "Received my money for my iPhone 7."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shiv Patel",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:31:10.000Z",
          "Titre": "Great Simple Experience",
          "Contenu": "Michael at BuyBackBoss was great. He responds quickly and gets my questions addressed immediately. I only am taking away one star because I think they need to send a box for shipping out the phones rather than a padded envelope."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Dews",
          "Nb_Reviews": 7,
          "Date": "2023-11-11T00:33:51.000Z",
          "Titre": "Bait and switch on price. But fast return.",
          "Contenu": "Bait and switch on price. But they will increase their offer considerably if you request returning the item. Overall fast process and return to me even If I didn't sell my phone to them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Gomez",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T21:42:12.000Z",
          "Titre": "Bait and switch on buyback price…",
          "Contenu": "They said my cell had screen scratches and I had taken photos of the cell before shipping. It had no scratches anywhere. It had a screen protector glass on it from date purchased at Verizon and I sent it to them in original box.  They lied to chew my buyback price down 20 dollars. Bait and switch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Schneider",
          "Nb_Reviews": 4,
          "Date": "2023-09-17T02:58:23.000Z",
          "Titre": "Great company and great people.",
          "Contenu": "A website that's easy to navigate. Customer service department that is top notch. Along with reasonable cash offers for used electronics.I might not always agree with their grading of items I've sold to them, they are a legit business that you can use without hesitation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karthik Peddi",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T03:12:11.000Z",
          "Titre": "Great experience but not the best payout..",
          "Contenu": "Not the best payout compared to other competitors on the market, but they do a great job at a lot of things! Instant customer service response, packaging and sending the phone was a breeze, payout was also easy! I gave them 4/5 because I don’t think any phone will ever be under the flawless bracket unless you bought it like a month ago. Mine had very very light and tiny scratches near the charging port from using the phone, you couldn’t see them on the stainless steel of the iPhone unless put under the right light. I got offered an amount between the good and flawless bracket (closer to the latter). I am 100% sure my phone would be sold under Renewed Premium category on Amazon for 250$ more, so I could have gotten atleast 50$ more out of it from them. I had to accept because I deemed it was not worth the hassle to sell it myself and also because as soon as the new iPhone released all websites decreased their trade-in prices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Latham",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T16:24:11.000Z",
          "Titre": "Iphone 14 Pro Max",
          "Contenu": "My experience with buybackboss was very good. Communication was very good. Once things got started  the process went very good. There was a couple of things I would change but then that's just me. If your phone would get lost or stolen there is no coverage which would not bother most people but me It did. The customer service phone no's would not work. No sense in having them if they don't work.  But everything overall went very well. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LJ Obenauer",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T22:25:07.000Z",
          "Titre": "smooth overall but price was less",
          "Contenu": "It was a smooth process and the service reps are helpful. My only issue is that I sent in 2 iPhones that were in flawless condition. One was mine, the other my wife’s. My wife NEVER took her phone out of the case and yet somehow when they got it it had a bunch of scratches on the sides that now made it lower quality. I had no way to fight this as I did not have pics of the phone before I sent it, and didn’t think about it until afterwards I should had them confirm it was the right phone! It probably wasn’t! Lesson learned to take pictures of my phone before sending it in. It just felt a bit scammy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Dunn",
          "Nb_Reviews": 6,
          "Date": "2023-07-25T21:03:23.000Z",
          "Titre": "Seamless process!!!!",
          "Contenu": "Buyback Boss bought my used iPhone!!!   They made me an offer, I accepted, they sent me a mailing label.   Constant communication, took them 5 days to test my phone, then offered me $40 less than offered.   My phone was like new, the representative at our new phone company suggested I sell rather than trade because it was in great shape…..flawless!!!   But it was 4 years old and they detected faint scratches.     At this point you are committed or I was….accepted their offer, money was deposited directly to my bank account.    It couldn’t have been easier but I suggest you get in-person offers as well as on-line just to cover your bases.    I gave it a solid 4."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hank Morgan",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T03:16:26.000Z",
          "Titre": "Frustration free website",
          "Contenu": "The process was frustration free. The only thing I didn't like was you deducted $10 from the original offer because you said the phone had scratches and signs of wear. It was always in a case from day one and I inspected it closely, so I disagreed with your assessment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T04:22:16.000Z",
          "Titre": "Friendly service",
          "Contenu": "Great communications team; professional, friendly and timely.  I think they are too conservative on how they evaluate used phone quality, so I don't think I quite get what they're worth, but they aren't unreasonable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd Mehrer",
          "Nb_Reviews": 2,
          "Date": "2023-01-31T14:27:23.000Z",
          "Titre": "Customer service good, offer not so much.",
          "Contenu": "Customer service was very good.The buyback rates were lower than expected considering the phones were all in very good condition.  They were very not picky on even the smallest blemishes which had nothing to do with the functions.The website quote and actual offer were miles apart, not just a little bit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicholas Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T15:53:53.000Z",
          "Titre": "Quick and easy to deal with",
          "Contenu": "Quick and easy to deal withI'm happy with the phone and the deal I got from the company. I wanted a good smartphone that did the basics, and the site recommended one that ticked all the boxes. Speaking with the service team helped me get exactly what I was looking for.The only reason not to give 5 stars is the fact that I had to separately claim for the offered cash back deal, rather than it being automatic, and this info wasn't stated anywhere.Thank you for an awesome service ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherod C.",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T18:32:46.000Z",
          "Titre": "Lifesaver!",
          "Contenu": "My experience with Buyback Boss...Has been life-saving and swift....Customer service was informative and consistence with updates regarding my phone.Payment expedited once my phone was completed for its worth.Will use again with on my electronics."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel Dizon",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T20:31:23.000Z",
          "Titre": "I thought the assessment of my iPad was…",
          "Contenu": "I initially thought the assessment of my iPad was inaccurate and seemed to be prepared by the company to make you feel like your device is not worth very much. After a a fair reassessment of my device, which included a video, a higher offer for my device was made and they went out of their way to make me feel better about my experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T05:34:01.000Z",
          "Titre": "Original quote wasn’t initially honored",
          "Contenu": "I sent in my iPad based on a specific quote but when they reviewed it they quoted me a lower amount because they said that there were scratches on it. There were no scratches on the device and I disputed it and asked them to send it back if they couldn’t give the original quoted price. They then agreed that there were no scratches and give me the original quoted amount"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Bogna",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T15:23:52.000Z",
          "Titre": "The process took longer than expected",
          "Contenu": "The process took longer than expected, but I got $50 more for the phone I sold. Payment was made electronically into my given bank account. Pretty good experience overall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Walter Hackett",
          "Nb_Reviews": 3,
          "Date": "2023-01-02T20:03:09.000Z",
          "Titre": "The staff was extremely helpful and…",
          "Contenu": "The staff was extremely helpful and supportive.  The pricing was extremely competitive and the process was pretty simple.  The only reason they didn't get 5 stars was the tracking feature on the website wasn't working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Erickson",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T03:33:14.000Z",
          "Titre": "Honest evaluation",
          "Contenu": "Honest evaluation, payment took longer than I was accustomed to but went through at the end of their time frame. Helpful service and fast response time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jenny Powell",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T20:53:37.000Z",
          "Titre": "I was a little disappointed in how much…",
          "Contenu": "I was a little disappointed in how much I received, but appreciated the honesty and sincerity of those evaluating my phone. I believe I got a fair price considering the phones issue. I would definitely use this service again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leo",
          "Nb_Reviews": 3,
          "Date": "2022-07-21T23:05:37.000Z",
          "Titre": "Phone Sale",
          "Contenu": "Equipment took a bit to get to the location because of some error on address but once it got resolved Skye provided excellent service and answered all my questions promptly."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "abid jawad",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T18:49:48.000Z",
          "Titre": "Clear communication and pricing",
          "Contenu": "It was my 2nd experience of selling device to them and team of Kiara and others did excellent job"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevinb",
          "Nb_Reviews": 6,
          "Date": "2022-09-14T05:45:29.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, but it took quite awhile from sending the phone until I received the check. But it did indeed come, and for the expected amount."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew L.",
          "Nb_Reviews": 3,
          "Date": "2022-11-01T20:01:45.000Z",
          "Titre": "Get (almost) what you are quote",
          "Contenu": "Phone was immaculate but was dinged on scratches which I apparently am unable to see. It was on $20 less than quote which is still okay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken Haag",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T02:06:03.000Z",
          "Titre": "Relatively easy to work with and…",
          "Contenu": "Relatively easy to work with and ultimately got a fair price which is what I was looking for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T21:09:40.000Z",
          "Titre": "Decent Price - Too many emails/texts",
          "Contenu": "Got a decent price for an iPhone 8. Minus 1 star for the hounding emails and texts when I didn't ship for a couple of days. I'm busy, I got to it when I could."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Locker",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T01:57:05.000Z",
          "Titre": "Was quick and easy",
          "Contenu": "Was quick and easy. Would have been 5 stars, but I didn’t receive the amount that I thought they were worth."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leonor Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T17:45:34.000Z",
          "Titre": "i like that they are willing to work…",
          "Contenu": "i like that they are willing to work with you with pricing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Lee",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T17:42:08.000Z",
          "Titre": "The transaction is good and the credit…",
          "Contenu": "The transaction is good and the credit is recognized."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Smith",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T23:03:34.000Z",
          "Titre": "Best price a bit over offered and…",
          "Contenu": "Best price a bit over offered and reduced a bit after they received two phones in great shape with very minor scratches and small dents. Both have full covered hard cases since new, Final price fair. Excellent communication during entire process. I will do business with them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2022-08-31T02:33:35.000Z",
          "Titre": "Quick response and the check was sent…",
          "Contenu": "Quick response and the check was sent right after they checked the phone out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Bonura",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T20:43:46.000Z",
          "Titre": "My iPhone 13 Pro Max - little lie…not the best",
          "Contenu": "My iPhone 13 Pro Max was in awesome condition. When they received they stated it had scratches on wire port. However, I took pictures prior to sending it to them. No scratches on wire port. I would alway charge my phone wirelessly too. Would of used Gazelle for the price they gave me after but was already shipped out. Won’t use them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jared Roussel",
          "Nb_Reviews": 3,
          "Date": "2022-02-16T01:02:47.000Z",
          "Titre": "Good but they need more payment options",
          "Contenu": "Gave me $4 underneath what I was quoted which was totally reasonable. Very communicative, sent check within about 4 days of getting the iPhone, and I received the check about 9 days from the date I sent it in. Check cleared. Everything went smooth. Can get funds faster if you choose electronic instead, but I don’t fock with PayPal’s sorry a**. They should do Venmo and direct deposit. That’s why I’m giving them 4 stars only. It took a little too long."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Grady",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T04:21:51.000Z",
          "Titre": "The process was extremely…simple",
          "Contenu": "The process was extremely straightforward. I would have liked to see a little more transparency in the company’s classifications of quality. However, when I questioned this I was met with courtesy and clarity. 4/5, would have been a 5/5 had I gotten a little more money 😁"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DD",
          "Nb_Reviews": 9,
          "Date": "2021-08-17T13:45:15.000Z",
          "Titre": "Buyback Boss is easy to work with",
          "Contenu": "Buyback Boss is easy to work with, great communications and is quick to answer your questions. I gave them a four only because we received less money than expected.  They rated our phone quality lower than I did and although I didn’t agree, I accepted the payment because it was less hassle then having to start the process all over again with another company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Mummert",
          "Nb_Reviews": 5,
          "Date": "2021-04-18T12:15:11.000Z",
          "Titre": "Ok in the end, but not great",
          "Contenu": "I got a reasonable price for my iPhone 11 Pro, although I had to contact them because their max promise of 6 days had gone by after they received the phone and I had not received any notice of my payment.  Also, they marked the value of my phone as \"fair\" and gave me $100 less than the original quote even though there was not a single scratch on the phone or glass (I always used a protective cover)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "david stern",
          "Nb_Reviews": 2,
          "Date": "2021-03-02T03:21:08.000Z",
          "Titre": "Had a good experience with this…",
          "Contenu": "Had a good experience with this company. got slightly less than i had hoped for . i understand that i am not able to know all the answers to there questions like battery life , maybe a step by step tutorial of the questions you want answered. year, model, battery life etc. i am very glad it worked well as other companies didn't have good reviews. BB have constant contact with me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eva",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T18:59:58.000Z",
          "Titre": "Mostly happy",
          "Contenu": "They were a pleasure to deal with.  They sent a box & kept me informed along the way. The check was prompt.I was disappointed that they found scratches on both phones I sold & lowered the amount they paid me. We kept them covered in protective cases & used screen protectors.  I would sell phones to them in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank Molinaro",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T20:05:17.000Z",
          "Titre": "My phone was down graded from excellent…",
          "Contenu": "My phone was down graded from excellent to good and offered an amount lower than what was on the website. When I brought it to customer service they said there was a mistake and I was given the correct amount. I didn’t like the fact that your quoted price can change from the date of quote to when the phone is actually examined. I didn’t see that when I got my quote and feel that is deceptive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin Oliver",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T16:44:21.000Z",
          "Titre": "The process was simple and quick, but...",
          "Contenu": "The process was simple and quick.  They contacted me saying they were knocking $20 off their original offer.  I asked them why and they responded by saying there was a scratch on the rear camera, which simply couldn't have been true because I know there was still OEM plastic screen protector on it.  However, after going through the entire process it was still worth it in the end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2021-02-16T18:56:03.000Z",
          "Titre": "Great except for the need to question the initial condition assessment",
          "Contenu": "I was very pleased to get $90 for my Samsung S8 in excellent condition. I took off one star, because initially i was told the phone had a crack and I would only get $20. I questioned that and asked for a photo, and they quickly replied offering the full amount. It made me skeptical that they may have mixed my phone up with another, but the full dollar amount is what mattered the most, and the rest of the process was seamless. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jamie Lotts",
          "Nb_Reviews": 1,
          "Date": "2020-12-25T18:55:57.000Z",
          "Titre": "Mostly good experience",
          "Contenu": "Mostly good experience! I was disappointed that they said the phone was damaged because of the battery life. We checked that before sending it and their assessment did not match what we thought. Either way we feel like we got a good deal selling our phone this way. Would send other used electronics to them in the future. Customer service was great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2020-08-31T22:56:11.000Z",
          "Titre": "Matter of Opinion",
          "Contenu": "I sent in a phone that was in working condition and had cracks on each side of my iPhone 8+. I was estimated $130 and sent in my phone. They ended up considering it “broken” and advised the LED screen was broken and were only willing to issue $92. I am not a phone expert by any means, but there were only cracks on this phone. Not 100% sure I agree with the estimate. Otherwise, the payment was issued very fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan Emery",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T13:47:07.000Z",
          "Titre": "Some Negotiation Required",
          "Contenu": "Didn’t get what I was originally quoted, due to the frame of the phone and screen being bent that I hadn’t noticed during use or when sending in for payment. Took some negotiation to get what I felt was a fair value for the phone once the condition was updated, but overall their customer service provided helpful proof of the damage and still paid more for the phone than other sites I was looking at would have provided, even after lowering their offer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenny Powers",
          "Nb_Reviews": 1,
          "Date": "2020-09-02T17:04:34.000Z",
          "Titre": "Legitimate Company",
          "Contenu": "Legitimate company. The initial Buyback Boss offer was less than what was quoted online. Thus, I cannot give 5 stars. Also, the initial offer was an extreme low ball, but then I countered and we met in the middle. That's okay and I received my check promptly, but I would have preferred no negotiation and the highest possible offer the first time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jermaine Reid",
          "Nb_Reviews": 1,
          "Date": "2021-01-30T16:45:23.000Z",
          "Titre": "Good experience",
          "Contenu": "I sent my phone to BuyBack Boss because Gazelle would not accept it because it was too old. It was an iPhone 5s. (I have sold every other phone back to Gazelle.) When they received it, apparently the phone was still locked. The tech reached out to me directly and gave me options on how I could get it unlocked. We were quickly able to get it done. While it was unfortunate they dropped the quoted price, which hasn't happened with Gazelle, I was impressed with the company, and I would work with them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WILLIAM OWENS SR",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T08:32:29.000Z",
          "Titre": "Easy and Fast",
          "Contenu": "Easy and Fast.  A little bit of a delay in receiving payment, but that was due to the holidays.  Also, a little disappointment in my items being downgraded from Mint condition to Used, which decreased my quote.  Not sure why? Kinda feel like that was a bait and switch tactic.  Nevertheless, I will use BuybackBoss again in the future, they were very responsive and the process was easy to do and I was still pleased with the results."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dylan G",
          "Nb_Reviews": 1,
          "Date": "2020-01-20T19:29:58.000Z",
          "Titre": "Thanks for being so rock solid",
          "Contenu": "Thanks for being so rock solid. Leanne C. Was my contact, and she did an excellent job, particularly in the communication of the condition of the devices, as well as how to properly troubleshoot when she couldn't unlock a few cell phones. I would recommend giving her a raise or promotion, y'all would be smart to keep her around. Keep on keeping on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris L.",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T17:59:10.000Z",
          "Titre": "They did not set the right pricing…",
          "Contenu": "They did not set the right pricing expectations when submitting the phone for recycle.  Originally $55 but when they got it they said $10.  Bait and switch.Came back and offered to make it right and verified that they would update the \"broken\" section to have more details for accurate quote."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sonya Arce",
          "Nb_Reviews": 2,
          "Date": "2020-02-17T17:40:55.000Z",
          "Titre": "Sold a couple phones just sitting…",
          "Contenu": "Sold a couple phones just sitting around in my house. I got what was quoted for one and was told the second one was accessed at a lower value upon inspection. After requesting that they look again we both came to an agreement on value of the phone and I agreed to the new price. The money was sent via Pay Pal and it took a total of about 7 days. I was very happy with the service and the time it took from start to finish. I will use this service again for sure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ernest Gladue",
          "Nb_Reviews": 1,
          "Date": "2019-06-10T17:47:39.000Z",
          "Titre": "No update emails, but check came",
          "Contenu": "My personal experience was this, i sent my phone in and chose to receive a check. About 2 weeks went by and i didnt get an email or anything saying  that they have recieved my phone or anything. And then i had a check in the mail for the agreed price. So i didnt get any confirmation or updates about my phone while waiting, but it all worked out how it was supposed to in the end so i really have no complaints."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emily Owens",
          "Nb_Reviews": 1,
          "Date": "2019-11-04T19:51:04.000Z",
          "Titre": "Great customer service, best offers",
          "Contenu": "Buyback Boss was easy to work with, direct and uncomplicated.  They gave me a significantly better offer for my broken phone than 4 other companies I checked into-but more impressively, when I didn’t receive my check as expected, they immediately corrected it and issued a new check within about 12 hours of my complaint.  Customer service reps were prompt and polite.  Payment has now been received and I’ve already recommended Buyback Boss to others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 3,
          "Date": "2020-01-29T09:50:23.000Z",
          "Titre": "Professional.",
          "Contenu": "They were communicative and quoted me the price that was displayed on their site. If for any reason you need to get ahold of them, they were quick to respond assess the issue; they also make sure that you are willing to go through with the offer just in case you are being quoted differently due to the standing condition of your phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TS",
          "Nb_Reviews": 1,
          "Date": "2021-04-10T00:35:37.000Z",
          "Titre": "some communication issues",
          "Contenu": "Bad communicationThis is clearly not the experience that others have had, but I have had to wait 3 days between most email communications when trying to sell my laptop. This was emailing with Jay L. I'm going to submit another request to see if I can get linked with a different customer experience rep.Update: I got an email from a different rep, who explained to me what was going on behind the scenes. She assured me that future communication would not take longer than 24 hours during normal business days. Altogether, they seem like a reputable group."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julia",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T16:34:59.000Z",
          "Titre": "Buyback Boss Review",
          "Contenu": "The team had excellent customer service and answered all of my questions and concerns. Unfortunately, my phone was quoted much higher than the actual end price (due to an apparent screen issue?), so that was pretty disappointing. Otherwise a positive experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 2,
          "Date": "2019-10-05T14:37:19.000Z",
          "Titre": "Would use again!",
          "Contenu": "The estimate was accurate, the send back process was simple.  Lost a star because they somehow processed my return but forgot to send the check to me. They immediately rectified the issue when it was brought to their attention.  But, I'd recommend following up with them about a week after putting the device in the mail."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Hines",
          "Nb_Reviews": 2,
          "Date": "2021-11-01T21:14:30.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience! I just wish they would send a picture when they reduce your money. They said the screen was separating but it was just fine when I sent it. It was only a few dollars so not a big deal. Service was overall excellent!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 3,
          "Date": "2019-02-07T19:24:38.000Z",
          "Titre": "Good communications from end to end",
          "Contenu": "Good communications from end to end.  My refund was decreased due to their measurement of wear.  At my request pictures were shared with me display the wear.  While I have NO REASON to believe the pictures weren't accurate; lessons learned- take your own pictures before you send off a device to ANY company (for service, for refund, etc.).  The reduction of refund wasn't enough to decide not to go forward.  Payment credit to my Paypal account was quick.  Shipping process was uneventful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leslie Casselman",
          "Nb_Reviews": 1,
          "Date": "2018-10-11T19:35:51.000Z",
          "Titre": "Very fair pricing",
          "Contenu": "I was extremely leery at first about this process. They quoted me a price based on my review of the condition of the phone. When they received it, they sent me an email saying that the battery life wasn't sufficient enough and offered me a low-ball price. They did accept my counter offer since the phone was in pristine condition. I appreciated their back & forth communication on everything. I would recommend Buyback Boss to others and will consider selling to them in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alison Burke",
          "Nb_Reviews": 1,
          "Date": "2020-09-03T01:07:36.000Z",
          "Titre": "Buyback Boss was super helpful in…",
          "Contenu": "Buyback Boss was super helpful in making sure I understood the process and offering proactive customer support. They gave updates along the way while my phone was on transit, and actually gave me more money than the original quote after receiving my phone. Great to work with!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2019-04-10T15:42:03.000Z",
          "Titre": "Good communication but slow",
          "Contenu": "Communication was very good throughout the process. They lose a star as the inspection took a long time, considerably longer than other similar companies which have managed to have a phone inspected within 2 days of receipt. Because of that, the money took a while but did eventually arrive as advertised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Goerss",
          "Nb_Reviews": 1,
          "Date": "2020-05-16T23:38:19.000Z",
          "Titre": "had doubts now i have cash, i was sussed out at first too.",
          "Contenu": "my phone was straight up destroyed. Yet i was still skeptical, can i maybe turn it into one of those machines or maybe gamestop?do i really want to send my phone off to some random a ss address in Arizona?I decided, f uck it, worst case scenario my busted a ss phone gets stolen. Turns out they're completely legit. they gave me a lot of scripted lines to some of my questions but i got paid. this is not a scam. they will pay you for your stuff within about 1.5 weeks. i went with Paypal and when she said \"you will be paid today\" i got paid."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 3,
          "Date": "2020-11-01T00:50:25.000Z",
          "Titre": "I've used them now a couple of times",
          "Contenu": "I've used them now a couple of times. This time I asked for a price match. They agreed (yeah!) then I got the check and it wasn't match. No worries, some glitch happened, and they fixed it right away and sent it right now. Very happy with the quick turnaround"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 4,
          "Date": "2021-05-25T17:12:20.000Z",
          "Titre": "They pay quickly but undervalue your…",
          "Contenu": "They pay quickly but undervalue your merchandise compared to other resellers. Their website is pretty good allowing you to sell multiple devices in one transaction. In this case, this place is good for fast cash. You're paying for convenience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miracle Malone",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T00:57:33.000Z",
          "Titre": "Thumbs Up!",
          "Contenu": "The process to trade in my iPhone X was quick and easy, and I received my compensation in less than 5 business days. The only thing that I wish I knew was that there would be fees deducted from the trade-in quote once processed via PayPal, but other than that, no complaints!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George Spratt",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T16:32:34.000Z",
          "Titre": "Fair but honest",
          "Contenu": "This was my first experience with this company.  After a brief pause, the email with my adjusted offer was corrected.  I chose to accept the revised yet somewhat lower offer out of convivence due to my health."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "texas dabber",
          "Nb_Reviews": 1,
          "Date": "2016-11-01T16:58:36.000Z",
          "Titre": "Had a rough start but Kevin fixed everything",
          "Contenu": "Had a rough start with the company and the quote I was given but after extensive talking with Kevin from customer service he has changed my whole outlook on this company offered me more money for the inconvenience shows me that the company does care about its customers overall I give it 4 stars out of 5 for its fast response good customer service and a willing to please the customer want to give an extra thank you to Kevin who has changed my whole outlook on the company good job Kevin"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AnJella",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T03:47:25.000Z",
          "Titre": "Highest quotes around...",
          "Contenu": "I recently sold an iPhone 6s Plus. Came across Buyback Boss after months of research. Unlocked, Factory Refurbished & in very good condition, considering it was encased since delivery day. I understand depreciation but I was hoping to get at least half of what I originally paid. I would have but due to a tiny screen crack I was unaware of, my quote was lowered significantly. Disappointing but at least the staff I spoke with is nice, they sent me a labeled box and provided a promo code. I'll recommend and sell to them in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 1,
          "Date": "2017-12-03T18:25:09.000Z",
          "Titre": "After sending in my phone I received an …",
          "Contenu": "After sending in my phone I received an email saying they were decreasing my offer greatly because they thought my phone as still under contract and payments were still owed. After I  responded that this was not correct, they emailed me that I was right and then paid me full offer amount. Also, I did not realize that PayPal takes a fee from my payment. It was not explained on the buyback boss website. Other than that, they offered me the most for my phone and had great customer service throughout the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judy Sykes",
          "Nb_Reviews": 1,
          "Date": "2018-04-20T22:19:23.000Z",
          "Titre": "It was oh so easy",
          "Contenu": "It was oh so easy- they told me how much they would pay for my phone in the condition it was in, and they sent me a prepaid mailing label. I wrapped it up and sent it off, and in a few days the $$ appeared in my PayPal account. I was surprised that they deducted a fee of some kind. So instead of $12 for my iPhone 5s with a cracked screen, I got $11 and some change. Always “fees”. Coming or going. But I was just glad to get rid of it, and not have it lying around in my drawer for years. And hopefully have it recycled."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc Williams",
          "Nb_Reviews": 1,
          "Date": "2018-07-08T10:32:29.000Z",
          "Titre": "Great company even better customer service.",
          "Contenu": "Experience was a little rough at first. I would definitely recommend using this company. I have no words for how amazing Brittany has been throughout this process. I am one of those people that can be won over by excellent customer service. This company definitely deserves a shot at your business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol Ham",
          "Nb_Reviews": 2,
          "Date": "2022-01-31T13:20:19.000Z",
          "Titre": "The online service people were Great!",
          "Contenu": "The online service people were there for me from the very beginning.  I appreciate the personal touch that they made me feel as I navigated untold territories with this new age things.  Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob Hackney",
          "Nb_Reviews": 2,
          "Date": "2021-05-24T15:22:51.000Z",
          "Titre": "This is an updated review to my original review",
          "Contenu": "This is a update to my original review.  After having a issue with the quoted amount i was given i was contacted by Michael and after speaking to him he gave me an acceptable amount. Great customer serice. Thank you Michael."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "StacyG",
          "Nb_Reviews": 3,
          "Date": "2020-11-23T20:58:25.000Z",
          "Titre": "Almost a perfect experience, but.......",
          "Contenu": "Would like to give 5 stars, but unfortunately that is not possible. While they did finally honor their original quote it took effort & time on my end to get the full price I had been promised. First it was condition. My phone had a screen protector and full cover. The \"damage\" was residue that wiped off. Second, I had inquired about being on Xfinity before sending them my phone. Their customer service assured me it would be treated as a Verizon phone. But upon receipt they said it was considered \"other\". I had to show them the proof to get that resolved. Took a few days and emails, but they did pay promised price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harley",
          "Nb_Reviews": 1,
          "Date": "2019-10-11T18:03:04.000Z",
          "Titre": "works as described",
          "Contenu": "works as describedEverything was smooth and worked as described.  The only thing that caught me off guard was that if you asked to be paid via PayPal there is a $12 fee.  So if you are not in a hurry go with the check option to get the full amount quoted"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "H A",
          "Nb_Reviews": 1,
          "Date": "2020-10-07T22:21:13.000Z",
          "Titre": "My only issue is that all my…",
          "Contenu": "My only issue is that all my communications with them via text or direct email we’re fine. It is when they sent an email with my offer that it went to my junk email folder. They were very responsive and I got a good price for my phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christina Brock",
          "Nb_Reviews": 2,
          "Date": "2019-10-25T17:57:31.000Z",
          "Titre": "Great communication!",
          "Contenu": "The team was very communicative.  The price match was very easy to do as well.  While I was a bit disappointed that one of my devices ended up getting a lower price due to a small mark on the LCD, the team was still great about the entire process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carrie W",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T18:51:32.000Z",
          "Titre": "Easy to work with",
          "Contenu": "Buyback Boss was very easy to work with and very responsive to questions. I gave them a four because I received less money than expected because they rated my phone quality lower than I did and I didn’t agree."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Sayer",
          "Nb_Reviews": 2,
          "Date": "2022-03-07T18:11:35.000Z",
          "Titre": "While I feel the device is worth more…",
          "Contenu": "While I feel the device is worth more than offered, BBB did pay me as they promised, after downgrading the condition, then deducting an additional $2.00, which I do not understand."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Ahmad",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T20:34:37.000Z",
          "Titre": "buyback boss is a king of all"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2019-07-25T17:56:14.000Z",
          "Titre": "Everything went fine until some guy got…",
          "Contenu": "Everything went fine until some guy got involved who was clueless about my transaction which was probably halfway completed by that time. I do believe he delayed it by a day or two. I would however use you again and recommend you to friends"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Toni Lazcano",
          "Nb_Reviews": 3,
          "Date": "2019-12-23T18:33:19.000Z",
          "Titre": "What you see is almost what you get",
          "Contenu": "Got my initial quote, was higher than others and took it. They responded about 5-7 days later letting me know one phone had scratches from the phone case so they lowered the quote on the second phone. Decent experience would use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2021-07-26T15:09:03.000Z",
          "Titre": "Initially some condition description issues, but the customer service superseded this",
          "Contenu": "Communication was great w/ timely responses. The descriptions of phone/device conditions was initially a bit deceiving/lacking, but I was pointed to a more thorough explanation after the fact which helped"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bret",
          "Nb_Reviews": 1,
          "Date": "2017-03-01T03:10:48.000Z",
          "Titre": "Great service",
          "Contenu": "Great service they got in touch with me when my Apple ID was still connected to the phone and after servers tries talked me through how to remove it. They sent the check soon after. I was happy to get sixty bucks for two phones that didn't work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tairi Detwiler",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T11:44:32.000Z",
          "Titre": "I got more than originally quoted",
          "Contenu": "I got more than originally quoted! I only gave 4 stars because they said the check was in the mail and it did not get sent out. After I realized it had been too long I emailed customer service and they took care of it right away!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rada Nada",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T00:36:02.000Z",
          "Titre": "I didn’t like the part that they said…",
          "Contenu": "I didn’t like the part that they said my battery was defect or it was working at 80 percent so the lowered the price from 115 to 85 dollars what do the expect for a iPhone seven plus in the 2020 really!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 5,
          "Date": "2019-12-21T15:51:10.000Z",
          "Titre": "Overall Very impressed !",
          "Contenu": "I was very impressed with communication and ongoing updates. I was disappointed in the final amount I got for my cell phone. (They considered a battery with a poor charge “damaged”. ) Otherwise, very professional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C.Mason",
          "Nb_Reviews": 1,
          "Date": "2022-01-31T01:57:00.000Z",
          "Titre": "Highly skeptical at first",
          "Contenu": "Highly skeptical at first, I didn't like the interaction with the tech. However, once connected with the customer satisfaction team it became a great experiance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Schifferle",
          "Nb_Reviews": 2,
          "Date": "2018-09-24T17:59:06.000Z",
          "Titre": "I was very pleased that they were…",
          "Contenu": "I was very pleased that they were willing to buy our 2 cell phones... one of which was totally non-functioning.  And the played for the mailing of them as well.  Good also they are recycled versus going in a dump."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 1,
          "Date": "2021-01-26T16:50:37.000Z",
          "Titre": "Quick, Easy, Communicative!",
          "Contenu": "Easy process to setup and send the old phones in. They were in constant communication giving me status updates. Once everything was squared away the payment was sent out and received quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paula",
          "Nb_Reviews": 1,
          "Date": "2020-12-12T01:37:25.000Z",
          "Titre": "Great company",
          "Contenu": "The process was pretty smooth. It took a little to get to me. But I wasn’t sure if it was because the thanksgiving holiday or just overflow. Other than that, it was a pretty smooth transition"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Devin",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T16:14:40.000Z",
          "Titre": "Mixed reviews, at first.",
          "Contenu": "Communication was great, and friendly to boot.  I would highly recommend taking detailed pictures of the items you are sending in BEFORE you send them in.  Once Buyback Boss has your items, they can grade them however they want and it is your word against theirs, and having possession gives them the upper hand.  I sent in 2 items, 1 which was nearly flawless and they cut the amount I expected to get in half.  The second item I sent arrived with a damaged screen, it was not damaged when it left, that item went from $15 to $1.  I would use them again, but I would cover myself better knowing what I know now.*UPDATE*Buyback Boss contacted me to resolve my above issue and share that they are making updates to their quoting process.  Nice to see that Buyback Boss is listening to customers and making changes where needed.  Updated my rating from 2 to 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lauri",
          "Nb_Reviews": 1,
          "Date": "2016-12-05T22:49:27.000Z",
          "Titre": "Generally satisfied",
          "Contenu": "I thought my iPhone 5 was in pristine condition. Buyback Boss reported they found some scratches I didn't see. I had the option of taking the phone back or accepting a lower price. I accepted their judgement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim R.",
          "Nb_Reviews": 1,
          "Date": "2020-03-24T04:17:07.000Z",
          "Titre": "Buyback is Fair in their Dealings",
          "Contenu": "Use caution!   I sent a iPhone in mint condition and they downgraded it to fair.  A typical bait and switch.  My advice is to sell local and face to face.Update:  After trading emails, Buyback Boss made my transaction right and sent me the agreed upon price.  I believe my phone was in mint condition and scratch free.  I was sent a picture of my phone with a scratch on the screen which I certainly do not recall. Unfortunately, I did not take a picture prior to mailing my old phone.  Nevertheless, Buyback Boss did agree to pay me mint condition price. I commend them for paying me a fair price.  Overall the communication and entire process was good. I truly believe they received a phone in mint condition and that I received a fair price!  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julie Hensley",
          "Nb_Reviews": 2,
          "Date": "2019-08-08T19:47:42.000Z",
          "Titre": "Honest, responsive and fair",
          "Contenu": "Very responsive and honest.  Didn’t get what I hoped to get from one of my iPhones, but they were fair and willing to negotiate and meet in the middle. I will definitely do business with them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Levi Springs IV",
          "Nb_Reviews": 1,
          "Date": "2018-09-03T21:23:06.000Z",
          "Titre": "I sent my phone to this company they…",
          "Contenu": "Buybackboos resolved my issues and did the right thing.  I would recomend them at this time.  I have removed my initial rating of one star and I've removed my initial comments and updated with this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brooke Murphy",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T01:04:39.000Z",
          "Titre": "Offered a good price for my old phone",
          "Contenu": "Offered a good price for my old phone.  They kept in contact with me, letting me know as the process moved along.  Would recommend to anyone looking to get a lil money from old phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2021-02-13T16:55:27.000Z",
          "Titre": "This service was great but more emails would be better.",
          "Contenu": "This service was great but more attention to customer for tracking device when shipped and when received.Maybe it’s slower because of COVID-19 but took longer than advertised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 3,
          "Date": "2022-12-31T02:59:45.000Z",
          "Titre": "Professional",
          "Contenu": "Employees were very thorough and helpful. Communication was perfect and understandable. Very professional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Crowther",
          "Nb_Reviews": 1,
          "Date": "2020-07-24T22:28:50.000Z",
          "Titre": "You’ll love these guys!",
          "Contenu": "So, I’ve never done anything like this before, I had limited expectations but these guys come highly recommend. It was absolutely painless and pretty quick. Very good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janis",
          "Nb_Reviews": 1,
          "Date": "2017-03-05T14:23:33.000Z",
          "Titre": "Fast process and turn around on Payback.",
          "Contenu": "Fast process and turn around on Payback.  Just wish there was a review of label before accepted or option to change after because I had a typo. Otherwise, good help and relatively easy process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:27:22.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Excellent experience! This was my first time using Buyback Boss to sell my used iPad Pro. They were quick to respond to my concerns, and the communication and service was excellent. Would not hesitate to do business with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mahtwog",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:05:56.000Z",
          "Titre": "Paid what they quoted me for",
          "Contenu": "Paid what they quoted me for. Also received shipping material which is a plus. Payments and shipments were all on time. Will highly recommend the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sage Nathan",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T02:52:51.000Z",
          "Titre": "So easy and fair!",
          "Contenu": "So easy! Seemed too good to be true, but it wasn't. I submitted my phone as in \"good\" condition because I was worried flawless was too far fetched but they emailed me and said after review it was flawless and offered me MORE money than for good. They totally could have kept it as good, but they didn't and they absolutely earned my trust. Would recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rick",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:51:13.000Z",
          "Titre": "It really is a pleasure to do business with BuyBack Boss",
          "Contenu": "This is the second time I have sold electronic gear to Buyback Boss. It was effortless and easy to work with them. I sent the item to them and in less that a week I received an email with the link to claim my gift card. I my opinion they are generous with the amount offered for the items I sold them. I recommend them very highly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Rosenberg",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T18:44:26.000Z",
          "Titre": "Great experience selling my old iPhone",
          "Contenu": "I recently replaced my iPhone SE (2nd generation). Apple offered $80, Gazelle offered around $72. A web search found several places that offered more, with Buyback Boss, which I had never heard of before, leading the field at $112 for what I described as Good condition. I sent it in postage-paid using their mailing label. Imagine my surprise when, several days after they received it, they said it's actually in Flawless condition and they were sending my $146! I just received payment today, and I absolutely recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "zash",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T08:16:45.000Z",
          "Titre": "Great price offer and smooth process in selling my iPhone",
          "Contenu": "I sold my iPhone 13 to BuybackBoss. The offer was good so I went ahead with it. As soon as I submitted my order, they sent me the packing label and assigned a liaison contact. I had a couple of questions that were answered promptly and to my satisfaction. Settlement was as promised, no issues faced at all! It did take them 3-4 days to process after receiving the phone, but that I think is understandable, given higher trade-in volumes during this time of the year. Overall, a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Cunningham",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T15:47:03.000Z",
          "Titre": "Very satisfied",
          "Contenu": "I’m very happy with my experience with Buyback Boss. I received the mailer promptly and was notified every step of the way. They paid quickly and I received more than the estimate. I have another item to sell and I will definitely be using Buyback Boss."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:16:59.000Z",
          "Titre": "Outstanding customer service",
          "Contenu": "Outstanding customer service, very fair price and speedy service on my buyback! I highly recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leo",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T05:12:46.000Z",
          "Titre": "Great and competitive offer and quick payout",
          "Contenu": "Great and competitive offer. They send you all the material and postage to send your device over to them. Their customer support via text is awesome. They pay very quickly. Second time I have done business with them. They are great each time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Loggins",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T19:02:35.000Z",
          "Titre": "Easier and better than expected",
          "Contenu": "Family got a set of new phones and were looking to unload of our iPhone 12’s. Shopped around and found these guys to offer a fair price. The difference maker for me was the simple and seamless process. 100% recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Smokler",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T21:45:10.000Z",
          "Titre": "The title of their company is true",
          "Contenu": "I've used them once.. A competitive company that pays very well for used electronics. Was sent a prepaid shipping label. Packaged my phone and sent it to them. They were very prompt with sending the updates, and asking If I had any questions. Upon receiving my phone, they paid me through PayPal within a week. I definitely recommend this legit company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mer",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T20:04:23.000Z",
          "Titre": "Great Company",
          "Contenu": "Great Company. I've sold 2 Iphones to them in the past couple years. They are fast and paid the amount quoted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T08:25:06.000Z",
          "Titre": "Quick response to solve the problem",
          "Contenu": "Quick response to solve the problem and made the payment very fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carissa Palmer",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T16:00:25.000Z",
          "Titre": "Kiara made this experience great by her…",
          "Contenu": "Kiara made this experience great by her timely responses, and when I felt that the condition of my phone was higher than the intial offer, they granted my request fairly and objectively, which makes me feel like their not trying to rip people off. Thank you Kiara for your help! Payment was fairly quick too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Heuser",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T23:50:09.000Z",
          "Titre": "First timer",
          "Contenu": "First time that I have ever sold a used iPhone (or any other electronic device). I was pleasantly surprised by how easy Buyback Boss made the entire process. And after receiving/inspecting the iPhone, they paid me the full amount quoted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hiep Thong Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T19:17:17.000Z",
          "Titre": "I was given higher amount than quote…",
          "Contenu": "I was given higher amount than quote because they found my xs max is in better condition than described"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "t park",
          "Nb_Reviews": 3,
          "Date": "2023-10-06T20:06:07.000Z",
          "Titre": "Easiest transaction!",
          "Contenu": "Start to finish it took 7 days to complete- send your phone with free shipping label then less than 5 days later, money is available. The money was less than the original estimate buy back price but that was to be expected. Great communication throughout the process, highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Tammaro",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T00:21:38.000Z",
          "Titre": "Easy to do busines with",
          "Contenu": "It was a very easy process and the people at buyback were very easy to deal with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ken N",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T02:20:59.000Z",
          "Titre": "Quick processing time",
          "Contenu": "Quick processing time, from sending in device to payment. I would recommend using the bank transfer option, got my money within a day after! Paypal in my opinion is a not a good option, because of the fees it charges. Buyback boss has very good customer service, was skeptical about selling my phone this way! I would recommend their service and use it myself again in the future:)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Wiggins",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T21:06:29.000Z",
          "Titre": "Recycling Used iPhones",
          "Contenu": "Very straightforward process that is based on the sellor providing an honest appraisal of their electronic device being proffered.  I will be using them again in the future when we have devices to sell. Everybody was very helpful and consumer oriented that we dealt with during the sales process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yadira Roque",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T01:31:17.000Z",
          "Titre": "Buyback Boss has been my go to when I…",
          "Contenu": "Buyback Boss has been my go to when I need to sell my phones I have sold two of my phones and is always fast and easy I love how fast they answer to you’re emails when you have any questions. Michael has been amazing trough out my process of selling them my phones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kate Hebert",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T04:08:05.000Z",
          "Titre": "Great experience",
          "Contenu": "It’s such an easy and seamless process! It’s my third time using this company and I’ve never had an issue. I’m impressed that even when I though my phone may be in a worse condition, the company is honest and gave it a better rating/more money!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EP",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T16:35:31.000Z",
          "Titre": "They are the best",
          "Contenu": "I have used many other buyback platforms over the years and none compare to buyback boss. They are the best by far! Highly recommend. Thank you Buyback Boss for the exceptional experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "OHawkins",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T15:33:46.000Z",
          "Titre": "My daughter found this site when we…",
          "Contenu": "My daughter found this site when we decided to sell our old cell phones after getting new ones through a promotion.  It was so easy and straight forward that I decided to give it a try.  The quote they gave me was only a few dollars less than they quoted before seeing the phone so I excepted it and within a day or two had my money in the bank.  Keep up the good work and thanks, Ohawk52, Albany"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DS",
          "Nb_Reviews": 13,
          "Date": "2023-08-29T03:19:21.000Z",
          "Titre": "BuyBack Boss is awesome",
          "Contenu": "This is the second time using BuyBackBoss and I definitely recommend them over trading in using Gazelle.  They are very professional and communicate with you every step of the way.  I’ve tried smaller (lesser known firms than the big trade in firms) as they often give better deals but it also feels like a mom-n-pop experience where you mail it in and hope everything goes well. With BuyBackBoss, I got a great trade in, no hassle and I would use again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kerri Ottmer",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T12:46:56.000Z",
          "Titre": "I had the best experience with Buyback Boss.",
          "Contenu": "This was my first experience using an online buyback service. The customer service was excellent and everything processed exactly as indicated on the site. I am recommending this option to my friends and co-wokers and will use them for all of my future needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Nicholson",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T18:37:25.000Z",
          "Titre": "Customer Service A +++",
          "Contenu": "Buyback Boss was simply wonderful! What made them wonderful? Besides being very secure and quick in payment, I had a question when an an issue arose. They not not only responded right away all they cared about was making me (their customer) happy! That just just doesn’t happen anymore. They were a pleasure to work with. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Holly Smith",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T05:49:02.000Z",
          "Titre": "They delivered as promised…unusual these days.",
          "Contenu": "The person I corresponded with via email was polite, nice, and explained exactly what would happen and when.  My actual payment matched the estimate I was given initially.  This company delivered as promised and advertised.  It was a true pleasure having a company do what they said."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristin Banghart-Mockler II",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T20:14:22.000Z",
          "Titre": "Buyback Boss paid me top dollar for my…",
          "Contenu": "Buyback Boss paid me top dollar for my old phone and WELL ABOVE what the local kiosks pay. As soon as they received my phone, they inspected it and issued my payment. Fast, convenient and top dollar paid for old electronics that were gathering dust. I absolutely recommend Buyback Boss!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Park",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T00:08:46.000Z",
          "Titre": "I've been using Buyback Boss for over a…",
          "Contenu": "I've been using Buyback Boss for over a year now and they're the best I've used so far! The entire process is seamless and they are very good with status updates on your order. They're very honest with their evaluation and even adjust their value if the item you're selling is in better condition. 10/10 would recommended to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lacey",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T02:57:50.000Z",
          "Titre": "Easy and quick service!",
          "Contenu": "Sent in my iPhone - which had a cracked screen so I wasn’t going to get any money from Apple - and ended up getting the exact amount they promised me when I sent it in, which I felt was generous. Very impressed with the speed and ease at which it happened. I would use again & have already recommended to family and friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Insmnia xXx",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T17:06:34.000Z",
          "Titre": "Great experience!",
          "Contenu": "Great experience! The process to get a quote on my phone, Samsung s21 ultra, and send it in was easy. I received an email from Skye within 24 hrs. I received emails when it shipped and when it arrived at Buyback Boss. Skye emailed me again to give my a final price and it was higher than my quote. I chose to get my money via bank transfer. They use an outside processor, Tremendous.com, for this. I researched this company before providing my banking info and found it to be safe. My money was deposited quickly. I will definitely recommend Buyback Boss and will use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Small Service Business Owner",
          "Nb_Reviews": 4,
          "Date": "2023-09-13T15:16:33.000Z",
          "Titre": "Prepare to negotiate the price",
          "Contenu": "I sold an iPhone to Buyback Boss. We disagreed on its condition. It was a gift, and had never been used, yet they insisted it was scratched in numerous places. We had to negotiate the price. Otherwise the transaction went smoothly and I was paid in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "B. Spiegel",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T03:04:02.000Z",
          "Titre": "I can highly recommend Buyback Boss",
          "Contenu": "I can highly recommend Buyback Boss. They communicated clearly, kept all of their deadlines as promised, and paid me promptly for my phone. I got more than expected as well. Really, could not have been a better or easier experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T04:05:06.000Z",
          "Titre": "The whole process was flawless",
          "Contenu": "The whole process was flawless. Got a competitive quote right away online. Printed the label and sent in the phone. Got a reply within a week saying the phone was in bettor condition than expected and they gave me a higher payout amount. The payment came within a couple days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ludonna Stephen Martin",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T01:57:34.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Buyback boss was absolutely amazing to work with. From day one communication was great. I was paid within 4 days from confirmation they received my old phone.  I highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Konen",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T18:52:56.000Z",
          "Titre": "Buyback Boss Experience",
          "Contenu": "The Buyback Boss process was easy to navigate and the communication with them during the process was even better. They never left you hanging wondering when or how much your going to receive for your old phone. My experience was great. They were honest enough to even award me more money than I thought I was going to get for my phone. I challenge any other buy back company to do that. They could’ve just paid me what I expected but they didn’t that says one hell of a lot about a company these days. As long as I have old phones to sell back they have my business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina Weiner",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T01:52:32.000Z",
          "Titre": "So easy!",
          "Contenu": "Makes selling your old device super simple! Mailed me a label and padded envelope to return my device in - great communication and got my funds quickly - ty!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Hilliard",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T16:57:20.000Z",
          "Titre": "Buyback Boss makes it easy",
          "Contenu": "Buyback Boss walks you through the entire process of selling your used electronics and makes it super easy. They even give you a specific person to answer any questions. Mine was Skye and she was super proactive and efficient. Would recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martha Ojeda",
          "Nb_Reviews": 2,
          "Date": "2023-07-29T05:23:34.000Z",
          "Titre": "Best Decision ever",
          "Contenu": "I compare a few on line companies and BuybackBoss was the one I decided to send my phone to based on the offer I got. I packed my iPhone, sent it the next day and in less than a week a got the money right into my bank account!Didn’t have to deal with nonsense from prospective customers! Thanks BuybackBoss for making my life a little brighter"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Dubov",
          "Nb_Reviews": 3,
          "Date": "2023-09-09T13:22:32.000Z",
          "Titre": "I had a great experience!!!",
          "Contenu": "I had a great experience with this company. At first I was skeptical. However, the entire phone sale process was very easy. I received an offer for my phone. I then followed the instructions to send in my iPhone. I received emails along the way keeping me appraised of what was happening next. Once my phone was evaluated, I was told that it was in better condition then what I said and then I received a higher offer for it. Payment via bank transfer was also easy and secure. I would recommend this company to all. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Smith",
          "Nb_Reviews": 7,
          "Date": "2023-07-17T00:49:24.000Z",
          "Titre": "BuyBackBoss - an honest buyer",
          "Contenu": "I've sold many phones to BuyBackBoss.  They have always paid me the offered price.  They tend to be one of the slower online buyers I've deal with but I don't mind because they also tend to pay the most.  It usually seems to take around 11 days from the day my phone is delivered until the day the funds are deposited into my bank account.  They are one of my favorite online buyers and I continue to use them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T21:36:02.000Z",
          "Titre": "SUPER EASY!",
          "Contenu": "Buy Back Boss cannot make this process any easier!  From start to finish it is an absolutely painless exercise.  The best part is I got more $ for my phone than what they had initially quoted me.  That says a lot about the integrity of the company.  This is the 2nd time I have used them and will continue to do so moving forward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nilsa Delgado",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T02:08:51.000Z",
          "Titre": "nothing but good experiences…",
          "Contenu": "I've had nothing but good experiences with this business. They are very honest and their customer service team is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike R",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T00:10:50.000Z",
          "Titre": "Use these guys not Necluttr...",
          "Contenu": "I had tried another company to sell my phone (Decluttr) it was a nightmare.  After more than a week the cut my offer by 50% and would not bdge.  Once i got it back and i sent to Buyback Boss and they processed everything quickly and paid 👍  wnat the promissed. A++++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mark striefsky",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T23:27:29.000Z",
          "Titre": "Our experience was exceptional",
          "Contenu": "Our experience was exceptional, we were quoted $402 for a iPhone and received $390 which we were happy with. The payment was received quickly through PayPal. I would highly recommend buybackboss."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "almost customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T23:29:05.000Z",
          "Titre": "Such an easy process to recycle my old…",
          "Contenu": "Such an easy process to recycle my old device that would have otherwise ended up in the garbage. I wasn't expecting the return I got, but I will say this is my go to for any device upcycling. I went through this whole process and got paid within a week!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Hooper",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T02:33:47.000Z",
          "Titre": "More than I bargained for!",
          "Contenu": "Its hard to believe, but after receiving my iphone Buyback Boss actually gave me more money  than they originally quoted.   Great service and honest process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce Haight",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T16:55:15.000Z",
          "Titre": "Top Notch Experience",
          "Contenu": "Prompt, courteous service! Best part was great communication, my customer rep, Skye, kept me up to date on every step of the process. Do not hesitate to sell your phone to Buyback Boss."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Folger",
          "Nb_Reviews": 3,
          "Date": "2023-10-14T21:06:44.000Z",
          "Titre": "Buyback Boss is an excellent company to…",
          "Contenu": "Buyback Boss is an excellent company to do business with. This company communicates and is very upfront and honest. I would highly recommend them for the resale of any old technology."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 3,
          "Date": "2023-07-22T22:58:45.000Z",
          "Titre": "Do this. You'll be glad you did.",
          "Contenu": "Apple Genius Store offered me $250 for my old iPhone.  I said not right now, went home, Goog'd for iPhone reimbursement.  Minutes later, my old iPhone was off for a reimbursement of an additional $100 over the Apple offer!!  Great and simple service that comes with its own reward!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marg",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T18:17:58.000Z",
          "Titre": "Would recommend them to everyone (worked with Michael S.)",
          "Contenu": "Sold my iPhones to buyback twice at this point and had a pleasant experience with them both times. Their customer service representative are very responsive too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Alibro",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T07:30:39.000Z",
          "Titre": "Buyback Boss gave me the Best Price",
          "Contenu": "Buyback Boss gave me the absolute best price for my IPhone and always answered any questions that I had within 1 business day. Great Customer Service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrice Young",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T01:48:43.000Z",
          "Titre": "Highly satisfied 3-week process",
          "Contenu": "It took 3 weeks from the time I mailed Buyback Boss my iPhone to the time the payment landed in my bank account.  During that time BB notified me throughout the process including receiving the iPhone, review of the IPhone which took 1 week, and notification of how much BB valued my iPhone.  BB ended up valuing my iPhone $11 more than the estimate given prior to mailing due to the immaculate condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil Osolinski",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T05:46:43.000Z",
          "Titre": "Fast and Easy",
          "Contenu": "Great email support, quickly sent an envelope and shipping label, and paid what was estimated fast via PayPal after the phone was received and reviewed. I'll definitely use them in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T00:39:50.000Z",
          "Titre": "Quick and honest transaction",
          "Contenu": "Quick and honest transaction. Gazelle tried to tell me my phone was damaged and kept it for 6 months. Buyback Boss gave me exactly what they offered. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Schneider",
          "Nb_Reviews": 4,
          "Date": "2023-07-29T07:06:16.000Z",
          "Titre": "Buyback Boss' customer service…",
          "Contenu": "Buyback Boss' customer service department is beyond reproach.Had decided to sell some old phones late one evening. Was surprised to receive a confirmation email that same evening (after 11PM)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Kaiser",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T21:15:35.000Z",
          "Titre": "Can’t complain about my experience …",
          "Contenu": "I did my research on this company after I sent them my phone which wasn’t a wise decision. I became concerned with reviews mostly from sitejabber. My initial quote was 140 and it took about a week after buynackboss received it to give me an adjusted quote which came in at 85. I wasn’t very enthused with this especially after the week it took to send it, the week it took to get an adjusted quote, and the week it would take to get it back.  My phone had no scratches on glass front or back and almost 90% battery capacity. It was otter boxed it’s entire time with me.  It do have some wear on the plastic construction of the phone.  However, I simply made a counter about halfway between the two figures and it was accepted without contest. I got my money very fast through rewards@tremendous which is the digital check option.  I will definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deena Poulsen",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T20:55:37.000Z",
          "Titre": "Buyback Boss is reliable",
          "Contenu": "I enjoyed working with Buyback Boss, they were quick with returning to me with my questions.  I would recommend them because they really are fair with the amount I got which was more than two other places I looked at.  Plus I received the money in 2 days in my account.  Would highly recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D Bartos",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T01:53:24.000Z",
          "Titre": "I have never sold my phone before",
          "Contenu": "I have never sold my phone before.  I thought buyback boss did a good job of keeping me informed every step along the way.  I assessed the condition of my phone and based on that, they agreed with my assessment and I received the amount I thought that I would get."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Fuller",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T17:01:00.000Z",
          "Titre": "Working with Buyback Boss was a great…",
          "Contenu": "Working with Buyback Boss was a great experience. There was great communication throughout the entire transaction. They even gave us more for the phones than their original offer. I wouldn’t he’s the to use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Clark",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T03:31:38.000Z",
          "Titre": "Great communication and support",
          "Contenu": "Great communication and support. Everything went smoothly. I have used BuyBackBoss several times and they always impress. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill Rhoden",
          "Nb_Reviews": 6,
          "Date": "2023-09-06T03:21:25.000Z",
          "Titre": "Definitely recommend!",
          "Contenu": "Great company! Communicated with me through the whole process, and gave me a great price for my phones. Payment turnaround was very quick through PayPal. Definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "angel",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T07:46:11.000Z",
          "Titre": "Customer service is excellent",
          "Contenu": "Customer service is quick to respond . Excellent customer service over all and they keep you informed through out the process . I have used them several times and will continue to do so. This is an extremely honest business and trustworthy . Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emma Burns",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T16:21:11.000Z",
          "Titre": "Would use them again",
          "Contenu": "I was impressed that I was given my own customer care to deal directly with me. Michael was great. I also found them to be very efficient in getting me a post bag and label, receiving the phone and paying me via bank transfer. They offered the best rates for sale of my phone and they came through for me. Would def use them again & recommend them to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaime Lyn Acker",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T05:35:43.000Z",
          "Titre": "The customer service was on point",
          "Contenu": "The customer service was on point!  I had questions and I was given a very accurate response in a very timely fashion.  It took a little time for my device to arrive and be processed, but I was notified immediately when it was received and also kept informed as to what the next step would be.  My quote was not too far off the actual offer and when I made an error on how I wanted my funds back, they quickly resolved it and changed it to the way I preferred it to be.  Communication was always there every step of they way and even a follow up email to let me know that they are there for anything else.  I truly truly am impressed with this company, and would recommend to anyone looking to sell a device..in fact, I told my best friend about Buyback Boss, and he also sold back his device and was so impressed!!  I will definitely be a returning customer for any other devices I am ready to sell.. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb M",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T18:43:54.000Z",
          "Titre": "Great experience",
          "Contenu": "Really nice to have a positive experience with this company. They honored the same price that their website offered. Transaction was seamlessly smooth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill Willette",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T14:27:32.000Z",
          "Titre": "Great company to work with",
          "Contenu": "In all my experiences, the reps i have dealt with are very helpful. ease of entering the information and you always know where your order is in the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T14:57:05.000Z",
          "Titre": "⭐️⭐️⭐️⭐️⭐️HIGHEST PAYING BUYER ONLINE!",
          "Contenu": "I quoted out selling my phone to 6 different buyers that I found through Google. Buyback Boss came in way higher across the board! Also the customer service experience was exemplary and everyone within their organization was very helpful with a friendly disposition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Graham",
          "Nb_Reviews": 4,
          "Date": "2023-09-22T12:12:15.000Z",
          "Titre": "Quick and easy transaction",
          "Contenu": "Quick and easy transaction.  Great prices and BBB is very fair in their evaluation of mobile phones.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy H",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T16:10:40.000Z",
          "Titre": "Very satisfied customer",
          "Contenu": "Very satisfied customer. The whole process took about 10 days from start to finish. I went the gift card route and  it worked smoothly. Thank you BuyBackBoss for your great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiff",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T21:43:20.000Z",
          "Titre": "From start to finish",
          "Contenu": "From start to finish, the process was simple and I got a fair price for my iphone.  Michael was super easy to work with and even made sure I had everything I needed while he was out of the office.  I appreciated all the updates on where everything was at in the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derrick Taylor",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T03:07:15.000Z",
          "Titre": "I like dealing with the folks at…",
          "Contenu": "I like dealing with the folks at Buyback, because they reply to your emails very fast,give you good service, and don't play any games with your sales...."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Fuller",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T05:50:04.000Z",
          "Titre": "Kiara / Customer Experience Specialist…",
          "Contenu": "Kiara / Customer Experience Specialist was very helpful and patience with me while I was trying to get my phone unlocked. I will definitely go through this company with recycling my old phones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T05:26:28.000Z",
          "Titre": "Best way to sell a used iPhone",
          "Contenu": "This was the easiest sale of an iPhone I’ve ever experienced, with the best communication, outcome and payment options I’ve ever seen. Would definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Sattree",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T19:33:51.000Z",
          "Titre": "I'm a senior and have issues trusting…",
          "Contenu": "I'm a senior and have issues trusting companies that I don't know.  These guys did what they said they would do and came in at bid price.  Thanks buyback boss. they kept me in the loop during the process as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Mcelveen",
          "Nb_Reviews": 6,
          "Date": "2023-07-18T01:44:11.000Z",
          "Titre": "Excellent Service",
          "Contenu": "I have used them several times and each time received great service. I highly recommend them and you won’t find anyone that will give you more money for your device."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerald L. Smith",
          "Nb_Reviews": 6,
          "Date": "2023-06-12T17:25:57.000Z",
          "Titre": "iPhones",
          "Contenu": "Everything about the experience with Buyback Boss was easy and efficient. Communication was clear and precise. I will recommend to friends and do it again when the time comes. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T06:16:04.000Z",
          "Titre": "Only place worth selling devices.",
          "Contenu": "It was very quick and easy to pre-price the items, obtain a shipping label to sent the items in and the turn around on testing the devices and getting a final price was amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl Harkrider",
          "Nb_Reviews": 3,
          "Date": "2023-07-02T16:02:14.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. I sent my iPhone 11 in and they determined it was in better condition than I described, they paid me more $ than I expected. That is integrity and honesty."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MattS",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T01:35:29.000Z",
          "Titre": "Good option for selling used iPhone (and mentioned in MacWorld)",
          "Contenu": "They were very fast to confirm the state of the resold iPhone, actually bumped it up in quality a bit and gave me a bit more for it, and the payment via virtual debit card was seamless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ASPELUND",
          "Nb_Reviews": 3,
          "Date": "2023-06-02T21:30:36.000Z",
          "Titre": "FAST, EASY, HONEST and THE BEST PAYBACK",
          "Contenu": "Before I sold our 2 iPhones I checked all of the other options. I got a wonderful deal, the process was easy, they paid the postage even though Iʻm in Hawaiʻi, kept in touch with me on every step, and I was paid right away. I highly recommend them. Thank You Buyback Boss"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T23:29:15.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience with them providing updates via email and even giving me more money than I was originally quoted. Would use them again in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T21:06:25.000Z",
          "Titre": "Very good experience",
          "Contenu": "Very good experience. Overall process lasted about two weeks (from the original estimate to shipping and receiving the funds).I was updated every step of the way on the progress."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jena",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T15:42:23.000Z",
          "Titre": "They made the process easy and answered…",
          "Contenu": "They made the process easy and answered any questions I had and were very nice didn’t take to long to get my money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T15:38:02.000Z",
          "Titre": "Fast and super easy",
          "Contenu": "Fast and super easy! Prompt, friendly customer service, and I got back more money than expected. Would definitely use again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T02:25:48.000Z",
          "Titre": "The process was easy and fast. Highly recommended",
          "Contenu": "The process was easy and fast. I received a payment within a week and a half of sending my device. They even gave me more for my device because it was in better shape. Very honest and highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gustavo Morales",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T21:13:26.000Z",
          "Titre": "Easy company to use",
          "Contenu": "Easy company to use. Great communication. Fair deal!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Lawrence",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T02:15:27.000Z",
          "Titre": "BuyBack is the way to Go",
          "Contenu": "Communication: 10/10Payout: 10/10Process: 10/10I would recommend BuyBack to ANYONE!! They made the process so easy and the follow up communication was superb. The payout was fast once the device was received and processed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 3,
          "Date": "2023-07-19T18:25:48.000Z",
          "Titre": "I have used this company many times…",
          "Contenu": "I have used this company many times thru the years and I have yet had an issue with anything. Communcation and price is an asset with this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mason",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T00:05:39.000Z",
          "Titre": "Very transparent and simple process",
          "Contenu": "Very transparent and simple process. The timelines they provided were accurate and I received the payment with no issues.Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Collman",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T02:09:20.000Z",
          "Titre": "Very easy to use",
          "Contenu": "This is my third phone to sell to them.  They provide free shipping and a quote withing a few days.  I've always felt the price was fair for what I sent them, maybe even a little better than expected.  They pay through Paypal, so it's even easier.  I'll use them again when the time comes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Beckler",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T18:19:00.000Z",
          "Titre": "They were the Bedtchecked our phone",
          "Contenu": "They checked our phone, in record time. I then received an email wanting my check info and the next day the money was in our account. Very, very happy with my experience . I can’t say enough good things about my dealing with this company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Lane",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T07:26:50.000Z",
          "Titre": "Very Easy",
          "Contenu": "Very easy process. They sent my payment a few days after receiving my phone. Very good customer service. They kept me updated on every step of the process. I will use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Jones",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T04:45:04.000Z",
          "Titre": "Excellent experience with Buyback Boss",
          "Contenu": "From my first communication with Buyback Boss, through the final receipt of the payment for my old iPhone, the service was smooth and seamless, the communication was at the right cadence, and ultimately, the money is in my account. I would do business again with Buyback Boss."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tasha March",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T02:07:09.000Z",
          "Titre": "THE EXPERIENCE WAS GREAT",
          "Contenu": "THE EXPERIENCE WAS GREAT. KEPT ME INFORMED EVERY STEP OF THE WAY. FAST FRIENDLY AND FAST OF PAYMENT OR PRODUCT SOLD. WOULD HIGHLY RECOMMEND AS WELL AS USE AGAIN IN THE FUTURE."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abe Markowitz",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T03:23:36.000Z",
          "Titre": "What a smooth and great transaction",
          "Contenu": "What a smooth and great transaction! Got a prepaid label, sent it to them, before you know it I had the money in my account!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda K",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T21:10:57.000Z",
          "Titre": "Used Apple Products",
          "Contenu": "Great place to send used apple products.  Have used this place several times, always great communication and quick service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T02:18:17.000Z",
          "Titre": "Great company",
          "Contenu": "This was the easiest and fairest transaction Every aspect was great especially when I got paid so quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colin Ying",
          "Nb_Reviews": 2,
          "Date": "2023-06-10T22:47:26.000Z",
          "Titre": "Fast and reliable",
          "Contenu": "Fast and reliable. very nice customer service and got email for each step they are processing. very satisfied"
        }
      ]
    }
  ]
}