{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "buybackengineer.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T16:16:18.000Z",
          "Titre": "Sent my phone in on 4/4/22",
          "Contenu": "Sent my phone in on 4/4/22. It has now been more than the 15-30 days they said it would take to get me my phone back due to ceasing their operations (e-mail received 4/15).  I am probably not going to see my phone again, but I will be sure to file what i can with police dept in TEWKSBURY, MA as well as the MA Attorney's general office."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mohammed Hossain",
          "Nb_Reviews": 2,
          "Date": "2022-05-11T04:23:26.000Z",
          "Titre": "Found Sebastian Brooks the owner of…",
          "Contenu": "Found Sebastian Brooks the owner of this company. He blocked me after I MESSAGED HIM AND I CONFIRMED BY FINDING HIM USING ANOTHER ACCOUNT. I will be looking to file a police report with the Tewksbury Police Department(where the company is stationed) and if others want to do the same that would be helpful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jean",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T14:25:18.000Z",
          "Titre": "SCAM",
          "Contenu": "This is a scam. I sold them my phone to them back in September and I have yet to receive my money, whenever I call them it goes straight to voicemail. I was able to email with someone but all they do is offer empty promises saying that they’re going to mail a check that never arrives or that they are going to send the money through PayPal but then of course there’s a computer problem that wont allow the money to be sent. If you’re still skeptical just call them and I guarantee you it will go straight to voicemail and you can even just look up their address and see that its just a mail post office not a store or regular office. Save yourselves!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Junior Rosario",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T14:32:09.580Z",
          "Titre": "Stole thousands of dollars in devices",
          "Contenu": "This has to be the dirtiest thing I have ever seen a company do to its customers. As of April 20, the website doesn’t even exist. The least you can do is send the devices back to the owners and communicate to your customers with transparency with whatever bs you guys are doing. There’s no way I’m going to do nothing about a company that just stole an expensive phone from me and dozens of other individuals. I will get the law involved about this scam you guys just did."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristine",
          "Nb_Reviews": 2,
          "Date": "2022-04-18T15:44:51.000Z",
          "Titre": "I'm afraid these guys are scamming…",
          "Contenu": "I'm afraid these guys are scamming folks.  I have also received a note when they received in three weeks ago that payment to my Paypal was being processed.  Since then after two emails and two phone calls, I have received zero response.  Sad that businesses feel they can conduct things this way.  I have some friends that live in Boston and I think I'm going to ask them to go see if this place actually exists.  I'm not sure why some folks are having great response - if those ones are actually real - kind of makes you wonder.....Its a bummer when you think a business is trustworthy....."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T12:05:08.000Z",
          "Titre": "Thief",
          "Contenu": "he stole my 2 iphones and will not give them back or pay me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ryan hollinger",
          "Nb_Reviews": 2,
          "Date": "2022-04-18T14:56:47.000Z",
          "Titre": "Horrible People",
          "Contenu": "well, i guess i should have read up on reviews before trusting, wont happen again. this company has no communication skills. i have emailed and called so many times. now today the email is no longer in existence. there goes my daughters prom dress money and a perfect iphone 11 that i could still have. Who do we report these people to because im already writing the bbb, but i want my phone or money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lorinda De La Fuente",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T02:20:00.000Z",
          "Titre": "I have been waiting on the payment for…",
          "Contenu": "I have been waiting on the payment for my IPhone 11 Pro Max since March 29, 2022.  Since that day I received an email stating that my pay out will be end of day on 03/29, which never came.  Then when I sent an email to “support”, I got an email from Sebastian saying he will look into it.  Then after two more emails to him for an update, he finally responded with “I approved your payout, you chose ACH so this pay method can take up to three days.  Please let me know if you don’t receive it.” Well, I have emailed him at least five times starting on April 7th and Sebastian has went silent.  I have given him many opportunities to make it right BUT the ignored emails tell me that he has no intentions to pay what he owes me BUT yet he has my phone.  How can a company like this keep conducting their business this way?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erica Brown Erica Elise",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T14:39:35.000Z",
          "Titre": "Do they even exist?",
          "Contenu": "I received a confirmation that my phone was received over a week ago & was told that my payment should be sent within a business day. I got that message on a Friday so, understandably, I should see it that following Monday. I sent emails & left a voicemail on their provided number that only goes straight to voicemail to no avail. I see that they respond to customers on here but will not respond to customers that sent their items that they’re still waiting on updates for. I saw another comment from the company stating that their prices doesn’t reflect current market which is absolutely fine & understandable BUT COMMUNICATE THAT. If I was scammed, just say that & I’ll just have to take that loss. I don’t even know which order number to leave because I was given one when I agreed to the amount and another one when I got confirmation that they received my phone but it doesn’t look like it’ll matter anyway. Lesson learned: do not release your phone from the “Find My” app until there’s absolute confirmation that you’ll be getting paid for your items.UPDATE: I just tried to email both accounts and both of them are showing as they do not exist. DO NOT USE THIS COMPANY TO SELL YOUR PHONE. I am now S.O.L trying to get rid of electronics that I wasn’t using."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mel S - PA",
          "Nb_Reviews": 4,
          "Date": "2022-04-22T12:32:16.813Z",
          "Titre": "THIS COMPANY IS A SCAM!",
          "Contenu": "THIS COMPANY IS A SCAM!! DO NOT SEND ANY DEVICE TO THIS COMPANY FOR COMPENSATION! YOU WILL LOSE YOUR DEVICE AND YOUR MONEY! THEY HAVE NO INTENTIONS ON PAYING YOU!!! SCAM! SCAM!! SCAM!!!I received this email from them on April 19, 2022, after I had called and emailed to see where my payment was since they did receive my phone on March 14, 2022:Hello,We regret to report that as of 4/15/22 BuyBack Engineer LLC has ceased all operations and is no longer issuing payouts or accepting new orders.If you have yet to receive payment for a device you have sent in we will attempt to have it returned to you within 15-30 business days.Thank you for your understanding.Regards,Buyback EngineerThen that same day I received another email:Thank you for trusting BuyBack Engineer. By now you should have received your PayPal payment. Now that you have experience the entire process start to finish we would love to hear your feedback. If you still have not received your payment simply reply to this email and someone will get back to you within 24 hours.Regards,Buyback EngineerThe nerve of this company! So I replied to this email and this is the immediate response I received:Address not foundYour message wasn't delivered to xxxxxxx@buybackengineer because the address couldn't be found, or is unable to receive mail.Lesson learned! DEAL WITH A REPUTABLE COMPANY AND IF THE OFFER IS TOO GOOD TO BE TRUE…ITS A SCAM!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mohammed Hossain",
          "Nb_Reviews": 2,
          "Date": "2022-04-13T13:23:02.000Z",
          "Titre": "I sent in an IPhone 11 and no updates…",
          "Contenu": "I sent in an IPhone 11 and no updates or payout after 9 days of it being delivered. I’m getting concerned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Salty",
          "Nb_Reviews": 2,
          "Date": "2021-12-08T12:01:38.000Z",
          "Titre": "Sent 2 iPhone XS Max on 11/16",
          "Contenu": "Sent 2 iPhone XS Max on 11/16. On 11/23 they finally contacted me stating there was a balance due. I told them there was not, Verizon paid AT&T when we switched and asked for them to return the phones. Nothing no communication at all. Finally emailed them back 11/30 and again 12/6 finally get a response saying oh our email must not have reached you we confirmed the phones are paid off and have issued payment today-hmmm its 12/8 and still nothing same day payment is total false advertisement even with an issue that has been resolved apparently around Dec 1 this waiting is ridiculous, I sent yet another email asking for my payment be made today or my phones returned. I'm sure I will not get any reply. Guess if no payment or proof of return by Friday it's BBB time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ankit Ostwal",
          "Nb_Reviews": 3,
          "Date": "2021-10-22T00:43:01.000Z",
          "Titre": "Delayed response,worst,no reason for return.do not go for this",
          "Contenu": "I have shipped my 11 pro max 256 gig and they were not able to respond on my product neither they were transferring my money.After 3 weeks and lot of mails they responded saying we are returning product and they did not say me any reason neither included it in package that was returned .However they said the reason for return will be included in package.i got my 1 month wasted in just this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristine",
          "Nb_Reviews": 2,
          "Date": "2022-04-20T00:54:21.584Z",
          "Titre": "Ceased Operations",
          "Contenu": "Folks - just got an email from them today - they have ceased operations as of 4/15 :-("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danielle Turner-Otero",
          "Nb_Reviews": 1,
          "Date": "2021-11-23T22:24:57.000Z",
          "Titre": "Not a great experience!!",
          "Contenu": "I sent in my iPhone 12 Pro Max almost a week ago. I received an email that there is still a balance and it will be marked as pending. I responded to have the device sent back because there’s another company that will pay for phones that still carry a balance. I have not heard a word back in three days. I’ve tried calling and sending an email but I’m not being answered!! It is making me think buyback engineer is a scam…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ryan hollinger",
          "Nb_Reviews": 2,
          "Date": "2022-04-20T18:58:49.477Z",
          "Titre": "So what can we do now",
          "Contenu": "So what can we do now? Are we screwed out of our phones/money? Can we press charges? If anyone has any advice plz leave a review! This is crazy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LMT",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T14:16:24.000Z",
          "Titre": "Unresponsive and won't pay out",
          "Contenu": "Update... It is now April 2022 and I'm waiting for my payment on my 2 iphones. The phone number is rolling to vm all day. I don't get a return call on my voicemails nor a reply back to my emails. Don't bother with this company if you want someone responsive or timely to process your order.We are now in March 2022 and I still have not received payments on my 2 iphones. They do not reply to my emails nor return my phone calls. However, they have time to reply back to the good reviews but leave me in the dark. I've sent in 2 iphones in January and I know it was delivered to their PO Box on January 15th. I did not hear anything from them till I reached out on February 3rd. I've been getting sporadic email replies and still no payment on the two phones. They do not answer their phone lines or return voice mails either. Either they process the payment or send me my phones back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amira Ford",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T19:56:25.000Z",
          "Titre": "Summing up my over all experience with…",
          "Contenu": "Summing up my over all experience with this business. Very displeased and a definite waste of time ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel winn",
          "Nb_Reviews": 2,
          "Date": "2022-04-21T17:22:13.979Z",
          "Titre": "They stole my phone"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NA",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T15:07:55.000Z",
          "Titre": "What a rip off",
          "Contenu": "What a rip off. They promise $500+ for your like new phone (the exterior is immaculate on all my phones) and then turn around and tell you the battery is at 80% so they knock $100 off. Nowhere did it say the battery needs to be at “x” amount to be considered mint. Could have sold it elsewhere for more money. Engineering rip offs are all they’re good for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Seville",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T00:05:06.000Z",
          "Titre": "Bumpy ride but resolved fairly",
          "Contenu": "Had issues with receiving my payment - apparently they had issues with their systems.  After chasing a bit, they resolved appropriately and I appreciate that.  Should not have been that difficult but I may give them another chance later."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt Kirkpatrick",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T17:09:50.000Z",
          "Titre": "Poor Process Control...",
          "Contenu": "Update:  Was contacted and compensated from the frustrations outlined below.  I would likely give this company another chance with my business.Phone arrived...was told things would be reviewed and completed in 24-48 hours.  I had to request an update 8 days later.  Was told my phone had been reviewed and a check would arrive in 4-10 days.  15 days go by and another email shows up saying \"sorry, we're shipping your phone back because it has LCD burn-in\".  I questioned what was going on and was told they were sorry for the mix-up and they would send me $50 for my trouble and delay in being able to sell the phone.  I did receive a phone back, but no $50 and I've got no way to ensure it was the phone I sent as they didn't return the box, charger brick, ear phones."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JEREMY OLSEN",
          "Nb_Reviews": 2,
          "Date": "2021-10-19T23:08:23.000Z",
          "Titre": "My phone was appraised at a lower…",
          "Contenu": "Make sure you take detailed pictures of your phone before sending in your phone. My phone was appraised a lower than appropriate value due to \"Signs of wear typical of heavy use including frame wear/scratching and deeper/higher volume of screen scratching\" which was overtly not accurate. I submitted an appeal with photo evidence of no frame or screen scratching and was paid the higher value, although it took several emails to actually receive the appropriate payment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T15:33:14.000Z",
          "Titre": "I little slow but overall great job",
          "Contenu": "I little slow but overall great job. Will use them again for any devices I want to sell."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T00:36:54.000Z",
          "Titre": "Frequent user of buyback engineer",
          "Contenu": "Frequent user of buyback engineer, quick & efficient process. Always gives you the best price for your old or used products, I’d high recommend using them if you don’t want to be low balled by other companies."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T13:00:55.000Z",
          "Titre": "Overall great experience - long delay in payout",
          "Contenu": "The overall experience was great. However, I deduct 1 star because the whole process took almost 2 weeks. BuyBack Engineer advertises with \"payout the same day we receive the phone\". In my case, it took approximately a week between my phone being delivered to BuyBack Engineer and the money being sent to me. I understand that with the release of the new iPhone, this company might be overwhelmed. But then don't promise something you cannot fulfill."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 3,
          "Date": "2021-10-13T23:19:34.000Z",
          "Titre": "Smooth Process, Payment as Promised",
          "Contenu": "A smooth, painless process from start to finish. I generated a quote quickly, got my mailing label, used an old iPhone shipping box to send my phone, and waited for the inspection and payment process to complete. Because I did this during peak iPhone upgrade season the process did take a while (2 full weeks from generating the mailing label to receiving payment) but the label had a tracking number and BuyBack Engineer sent periodic email updates, so the process was clear if not very fast. I received the full quoted price for my iPhone sent via Venmo."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T14:25:27.000Z",
          "Titre": "Was very easy to use and they paid…",
          "Contenu": "Was very easy to use and they paid right to my Venmo. My only issue was i had to email them a few times to check to see if they received my phone and then a week later asking about payment. They were very responsive though! Will definitely use them again next year!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Hummel",
          "Nb_Reviews": 1,
          "Date": "2021-12-10T01:48:30.000Z",
          "Titre": "Responded to all my questions in a…",
          "Contenu": "Responded to all my questions in a timely manner no issues would use again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 2,
          "Date": "2021-11-30T18:52:00.000Z",
          "Titre": "Good experience",
          "Contenu": "Good experience. Best price. Hard to reach though."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T18:57:28.000Z",
          "Titre": "Got the job done right",
          "Contenu": "I used to trade my devices into Best Buy, or a carrier, but it makes way more sense to sell them online. BuyBack Engineer was a good service. They offered me a fair amount for my iPhone SE 2020, and the process was pretty simple.Only thing that could be a little better is their communications system, but after a call to their office they fixed everything and sent the money, and threw in $5 extra for the inconvenience. Will be using their service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T17:46:34.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service and communication, no issues at all.  I would definitely use them again ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Chapman",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T14:38:33.000Z",
          "Titre": "Pleasant experience",
          "Contenu": "I used BuyBack to sell my old phone for some quick extra money, it shipped to the company within a few days and I was notified once it was received. I had opted to receive my money through apple pay but there was a snag and I had to reach out via email to figure out what to do. I was very pleased with the customer service and their ability to resolve the issue quickly and was even given an extra $10 for the inconvenience. I would absolutely use BuyBack again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T16:52:09.000Z",
          "Titre": "Only issue was the payment took a few…",
          "Contenu": "Only issue was the payment took a few more days than expected, but the customer service was excellent!  Totally recommend…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sunshine",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T20:37:20.000Z",
          "Titre": "Delay was rectified",
          "Contenu": "Update - BuyBack Engineer responded and quickly fufilled the agreed amount. They explained the intial delay was due to a change of system. Original post - No response after I sent in my Samsung S21 Ultra phone a few weeks ago..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T21:00:15.000Z",
          "Titre": "Great and Timely in buying my IPhone 11!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Haley",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T12:58:02.000Z",
          "Titre": "Made selling my old iPhone WAY EASIER",
          "Contenu": "Quick survey to determine sell/buy price. Labeled given for shipment. Email order confirmations to track the process. Money sent straight to Venmo account like guidelines stated it would. Made selling my old iPhone WAY EASIER than I excepted!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jess",
          "Nb_Reviews": 3,
          "Date": "2022-03-02T15:23:24.000Z",
          "Titre": "Outstanding!!",
          "Contenu": "This service is great! They did everything as promised and even took my old cracked beyond belief old phone! Amazing! I will definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 2,
          "Date": "2021-10-25T15:16:42.000Z",
          "Titre": "Second Time Using",
          "Contenu": "I don’t know why I didn’t do this sooner. I had several old phones just sitting in a box. The whole process was flawless. I just printed the mailing label and dropped my phone at the post office. I was notified throughout the process. A few days later I received notification of payment. Highly recommend this outstanding company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emma",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T23:05:43.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing, smooth and easy experience with BuyBack Engineer! It could not have been quicker or easier to sell my old phone that was in poor condition. The customer service was great and they were very friendly and prompt. I received my payment right on time. I would definitely use them going forward!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GA",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T15:26:27.000Z",
          "Titre": "Smooth After Initial Hiccup",
          "Contenu": "Though I did not receive a message that my phone had been received and was being processed, I received a prompt reply to my email inquiry and everything flowed smoothly thereafter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Shafa",
          "Nb_Reviews": 3,
          "Date": "2021-10-22T05:22:08.000Z",
          "Titre": "Very happy. Would recommend/sell to BBE again",
          "Contenu": "BuyBack Engineer offered me $50 more than the next best offer for my 4 iPhones. I was suspicious at first but I read these reviews and emailed with the owner and decided to send him my phones. Very happy with that choice and the process. He did revise the offer due to phone/battery condition, but I asked him if he would match that 2nd offer I had and he did. So, overall, very happy with the process and would sell my phones to him again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MT",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T23:54:46.000Z",
          "Titre": "Easy and fair",
          "Contenu": "This process was clear and fair. Despite the possibility of delays due to the release of the new IPhone 13, the turnaround time was reasonable and faster than anticipated. I will be sending them my current phone the next time I upgrade.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna",
          "Nb_Reviews": 1,
          "Date": "2021-10-02T17:06:36.000Z",
          "Titre": "Outstanding buyback experience",
          "Contenu": "The process of selling my iPhone to BuyBack Engineer was exactly as promised:  swift, efficient and fair.  I was provided a label for shipping, given regular updates on the progress of my submission, and paid all in under ten days.  Will recommend highly to one and all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Daniel Puerto Lopez",
          "Nb_Reviews": 2,
          "Date": "2022-03-18T16:06:24.000Z",
          "Titre": "Received full payment",
          "Contenu": "I received complete payment for all the devices I sent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KEITH",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T15:01:36.000Z",
          "Titre": "I assumed this was a bait and switch…",
          "Contenu": "I assumed this was a bait and switch for a broken iPhone . They paid as promised when I delivered what was promised. Other iPhone buyback websites lowballed my phone. Buy back engineer is a legit player."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aldo J.",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T14:34:18.000Z",
          "Titre": "The process so easy and quick",
          "Contenu": "The process so easy and quick. Printed the label, shipped the iphone and kept me informed throughout the whole process until I received the payment from venmo. Couldnt have asked for a better experience"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T05:12:29.000Z",
          "Titre": "Excellent service",
          "Contenu": "Very good service.  This was first time using and I was very cautious about sending in my phones to an online service.  Sebastian answered all my questions and put me at ease.  Their service is exactly as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clare",
          "Nb_Reviews": 1,
          "Date": "2021-08-26T22:13:51.000Z",
          "Titre": "Seamless and efficient process!",
          "Contenu": "BuyBack Engineer was seamless and super fast! Got a great deal for my old iPhone and the process to exchange was so easy. I received payment within an hour of my device being delivered. Would 100% recommend this service/use them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joemamma",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T20:47:59.000Z",
          "Titre": "Good to Go",
          "Contenu": "I was disappointed in the reduction in price offered, but understand and all is good. Took longer than expected, but with the launch of the iPhone 13, i again understand. I will recommend this business to anyone who asks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sabrina",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T19:32:24.000Z",
          "Titre": "Very happy with the outcome",
          "Contenu": "Very happy with the outcome. They provided me a shipping label, updates and an estimated processing time. I definitely recommend them and if I have anything else to send their way, I definitely will be"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 2,
          "Date": "2021-09-26T15:12:09.000Z",
          "Titre": "Very pleased …",
          "Contenu": "Very pleased with this service! The process was simple and efficient. Received detailed communication via email and text. Phone shipped and deposit received within 10 days. I highly recommend! (Thank you, Sebastian, for keeping me updated)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2021-12-10T20:57:51.000Z",
          "Titre": "SO EASY",
          "Contenu": "This was incredibly easy and the quote was exactly what I ended up getting! I sent in my phone with a cracked screen and got update emails until it was processed. The deposit went directly to my venmo!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David S.",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T18:32:41.000Z",
          "Titre": "Great process from beginning to end",
          "Contenu": "Great process from beginning to end, they did what they said they would do. No worries waiting for weeks to recieve payment, happened within a day via Venmo. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexi",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T22:32:43.000Z",
          "Titre": "11/10",
          "Contenu": "Honestly, I was thinking this was a scam but I went based off of the reviews and trusted. I put my phone in the mail on a wednesday and got my payment by the following Friday. I even got MORE money than they initially quoted me for my broken phone! They were so fast and prompt & communicated through each step. I will sell all my old phones to them in the future. THANKYOU!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 2,
          "Date": "2021-10-14T15:01:33.000Z",
          "Titre": "They preformed as advertised.",
          "Contenu": "I went on-line and filled out the form concerning my phone. BuyBack Engineer did exactly what they said they would do. They paid me the amount the site estimated my phone would be worth. I am satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gio",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T17:12:55.000Z",
          "Titre": "Overall great!",
          "Contenu": "It did take a bit longer then I expected for the order to be processed, like a day or two, but otherwise easy and great experience! Will definitely keep this website in mind"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elijah",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T00:40:53.000Z",
          "Titre": "Doing business with Buyback Engineer…",
          "Contenu": "Doing business with Buyback Engineer was great! I made a slight mistake of sending them the wrong phone Model and they still worked with me and we were able to come to an agreement on a fair price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly Sparks",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T20:18:04.000Z",
          "Titre": "Excellent…",
          "Contenu": "There was a slight delay in receiving payment for my device. Sebastian, the Director of Operations, is super responsive, helpful and friendly. The company is a stand up operation in a sea of many mediocre companies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donte Grant",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T03:42:47.000Z",
          "Titre": "Easy and direct",
          "Contenu": "Easy and direct . Simple and all you have to do is ship your device out  . they email you every major step of receiving inspecting and the finalizing and sending your check. Legit and would do it again if I had other phones"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VIVIAN",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T16:13:45.000Z",
          "Titre": "They were so fast and they actually…",
          "Contenu": "They were so fast and they actually communicated during extreme work conditions.....iphone 13 release had EVERYONE selling their phones at one time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny Montiel",
          "Nb_Reviews": 2,
          "Date": "2021-11-13T02:42:21.000Z",
          "Titre": "Super-quick and trustworthy",
          "Contenu": "Very, very easy process, and when the BBE team had questions for me, they were easy to understand and answer. Lightning fast payout, too. Recommend highly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff L",
          "Nb_Reviews": 4,
          "Date": "2022-02-10T23:13:14.000Z",
          "Titre": "Great experience from a great company",
          "Contenu": "Updated review: I certainly wasn't expecting this but Sebastian, the Director of Operations, reached out to me with an apology and went up and beyond to rectify the situation for me. He provided details of what happened and the steps they have taken to prevent such reoccurrences in the future. I was caught off guard by the company's response/resolution and will be more than happy to use their service in the future. In hindsight, I wish I just reached out to the company as I'm not usually one to leave a poor review, but I mistakenly thought that they really just didn't care and left me with a \"go pound sand\" response. For those who have had a poor experience with Buyback Engineer, like I did initially, know that issues arise and if you followed the guidelines for a good faith transaction, don't be afraid to let them know as they really do mean well and care about a customer's experience. I am updating my review to 5-stars as they deserve it 100%. Thank you all for taking the time to read my review.Original:Buyback Engineer is a buyback company that wouldn't honor the quote they made for my phone. It's sad and disappointing as they are well aware that the issue is on their end and didn't make any efforts to honor what was quoted (they stated that their site showed the wrong price). They returned the phone, which should earn them a star. I didn't get back the original iPhone box that I included with the phone, which was also disappointing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2021-10-11T15:37:59.000Z",
          "Titre": "Easy and quick payment!",
          "Contenu": "Easy, straightforward, quick turnaround on payment. As it should be. It’s fantastic they offer Venmo as a payment option. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trudi",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T05:46:53.000Z",
          "Titre": "Highly recommend",
          "Contenu": "Selling your old phones to BuyBack Engineer is a quick and easy process.  They’re always fast and efficient.  I’ve been very pleased with their service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CAROL MUKUYE",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T01:27:09.000Z",
          "Titre": "They were fast in responding with great…",
          "Contenu": "They were fast in responding with great customer care and they paid the agreed amount as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 2,
          "Date": "2021-10-04T23:26:24.000Z",
          "Titre": "The whole process was simple and they…",
          "Contenu": "The whole process was simple and they communicated with me throughout the whole process of receiving my phone, inspecting it, and then sending payment. Five stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny Story",
          "Nb_Reviews": 2,
          "Date": "2021-11-10T21:34:18.000Z",
          "Titre": "Very impressed",
          "Contenu": "Very impressed. BuyBack Engineer gave me the highest quote for my Iphone X with a cracked screen. Shipping it in was easy. Had to give them a reminder about a week in, and received my payment via squarecash today. Killer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy M DS",
          "Nb_Reviews": 3,
          "Date": "2021-10-01T23:31:49.000Z",
          "Titre": "Excellent response time for all my…",
          "Contenu": "Excellent response time for all my questions, communication ever step of the way during the selling process. Great experience, looking forward to selling in the future. Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miriam Herrmann",
          "Nb_Reviews": 2,
          "Date": "2021-10-15T17:47:20.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service!  They sent my payment through Venmo very quickly and helped me work through an issue in a very helpful and polite manner. I will use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc",
          "Nb_Reviews": 5,
          "Date": "2021-10-29T19:17:00.000Z",
          "Titre": "BuyBack Engineer is a great way to sell…",
          "Contenu": "BuyBack Engineer is a great way to sell your phone, very easy to work with and they are very prompt with sending you the money. Would highly recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sydney V",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T23:01:23.000Z",
          "Titre": "They went above and beyond to get my…",
          "Contenu": "They went above and beyond to get my payment to me! Will always use Buy baxj engineer when purchasing or selling a phone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Gillespie",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T01:33:25.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Selling my damaged iPhone was super easy and quick. I would recommend this service to anyone looking to get top dollar with quick service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 1,
          "Date": "2021-10-30T04:07:04.000Z",
          "Titre": "Better offer than I received anywhere…",
          "Contenu": "Better offer than I received anywhere else. Fast, free shipping to send phone in and quick payment! So impressed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 3,
          "Date": "2021-10-29T14:53:12.000Z",
          "Titre": "Very simple transaction",
          "Contenu": "Very simple transaction. I checked several places for buy-back prices, and BuyBack Engineer paid the most for my phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brent",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T00:18:54.000Z",
          "Titre": "BuyBack Engineer was great",
          "Contenu": "BuyBack Engineer was great.  Highest quote, paid for the postage, honored the price, paid through Venmo as I wanted.  Even paid a 5% bonus when they couldn’t turn it around in 24 hrs due to high volume of phones received. What more can one ask for?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MSM",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T16:16:54.000Z",
          "Titre": "Simple process",
          "Contenu": "It was a simple process, and happened pretty fast even though they said there might be delays in processing with the new iPhone out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alicia Meere",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T21:49:02.000Z",
          "Titre": "They were so helpful through the whole…",
          "Contenu": "They were so helpful through the whole process and kept me updated. The day they received the phones I got my money from them just as quoted. I would definitely use them again! They were super nice and genuine! Thank you again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gator PhD",
          "Nb_Reviews": 5,
          "Date": "2021-11-14T20:25:16.000Z",
          "Titre": "I was suspect at first but am very…",
          "Contenu": "I was suspect at first but am very impressed.  Everything went smoothly and the amount I expected hit my Venmo as soon as they received it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kam Browning",
          "Nb_Reviews": 2,
          "Date": "2021-10-25T14:38:01.000Z",
          "Titre": "Extremely simple, fair offer",
          "Contenu": "Extremely simple, received a higher off than I was getting for trade in value at Verizon, Xfinity, and AT&T"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T00:41:41.000Z",
          "Titre": "Great Customer Service, they offered me the most dor my damaged iPhone",
          "Contenu": "They offered me the most for my damaged iPhone, glad I found them.They were easy to work with, customer service helped me through the process. No issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Goldie",
          "Nb_Reviews": 1,
          "Date": "2021-11-12T20:49:44.000Z",
          "Titre": "Fast and easy service !!",
          "Contenu": "Fast and easy service !!! Sent my phone out on a Wednesday and received payment on Friday."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerrelle",
          "Nb_Reviews": 1,
          "Date": "2021-09-17T21:31:17.000Z",
          "Titre": "Hi there if your ready to sell you…",
          "Contenu": "Hi there if your ready to sell you device pls I recommend this company very professional process is easy and they get the job done for any phone and keep up with updates and makes you feel very appreciated during the process 5stars ‼️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ns",
          "Nb_Reviews": 1,
          "Date": "2021-11-16T22:37:36.000Z",
          "Titre": "Super fast",
          "Contenu": "I sent my phones on Thursday and today (Tuesday) the money was in Venmo. Five days, including the weekend. What else can I say? I’ll recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T22:36:37.000Z",
          "Titre": "Very pleased with how easy it was to…",
          "Contenu": "Very pleased with how easy it was to sell my devices. The highest offer on the internet, highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Falonne Cesar",
          "Nb_Reviews": 1,
          "Date": "2021-10-11T12:18:26.000Z",
          "Titre": "Easy, simple",
          "Contenu": "Process was easy they received the phone and I received my check. It was a pleasure doing business with this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T01:55:32.000Z",
          "Titre": "They communicated fast!",
          "Contenu": "They communicated fast and made everything easy! Would do business with them again. Top payout for my device."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ELIZABETH",
          "Nb_Reviews": 3,
          "Date": "2021-12-06T22:04:56.000Z",
          "Titre": "They are better than 5 stars",
          "Contenu": "Great to work with they say what they mean and mean what they say. No issues fast payment. Sebastian answered all my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittany",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T21:05:53.000Z",
          "Titre": "Recommend",
          "Contenu": "In about a week I received payment to my Venmo for the full amount in the offer. Support was great with updates"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benny",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T17:46:58.000Z",
          "Titre": "Simple",
          "Contenu": "Simple, straight forward, honest assessment of my iphone, paid quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacqueline",
          "Nb_Reviews": 1,
          "Date": "2021-11-12T21:13:02.000Z",
          "Titre": "This was an excellent and very easy…",
          "Contenu": "This was an excellent and very easy experience. Thank you so much!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Tow",
          "Nb_Reviews": 2,
          "Date": "2022-03-14T19:03:36.000Z",
          "Titre": "Great!",
          "Contenu": "Great people to work with. Super simple and made good money!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seth",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T14:19:00.000Z",
          "Titre": "An effortless experience from start to finish!",
          "Contenu": "An effortless experience from start to finish (and particularly in comparison with some other similar services).  Clear communication and efficient processing meant no need to follow-up or wonder when payment might be made.  A perfect experience and once I recommend to anyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-10-02T15:28:08.000Z",
          "Titre": "Payment exactly as offered",
          "Contenu": "Payment exactly as offered.  Relatively quick processing.  Would use again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 2,
          "Date": "2021-10-08T00:29:44.000Z",
          "Titre": "Go-to place to sell",
          "Contenu": "Great company quick response time as well as payment. I’m going to send my wife’s phone in as well now"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia Perez",
          "Nb_Reviews": 4,
          "Date": "2021-10-13T17:34:02.000Z",
          "Titre": "GREAT COMPANY",
          "Contenu": "Great company, quick and easy process!Will definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rio Jacober",
          "Nb_Reviews": 1,
          "Date": "2021-09-03T14:10:56.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. Fast and reliable and good communication. Thanks! I’ll definitely  use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott T",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T14:00:57.000Z",
          "Titre": "Great Company",
          "Contenu": "Great partnership with them.  Look forward to doing more business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 2,
          "Date": "2021-10-04T15:57:19.000Z",
          "Titre": "A+ Experience",
          "Contenu": "Easy, communicative, great place to trade in your phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T22:44:47.000Z",
          "Titre": "Excellent service",
          "Contenu": "It was incredibly easy to sell my old phone and get a fair price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2021-09-24T19:13:57.000Z",
          "Titre": "They went above and beyond..they did…",
          "Contenu": "They went above and beyond..they did everything they told me they would do from the start. It was simple and easy. Thanks BuyBack Engineer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T20:42:00.000Z",
          "Titre": "Great experience",
          "Contenu": "Fast payment and fair price for my phone. I would definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harold",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T23:04:46.000Z",
          "Titre": "Very prompt responses and kept me up to…",
          "Contenu": "Very prompt responses and kept me up to date through the process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Kennedy White",
          "Nb_Reviews": 2,
          "Date": "2021-11-11T07:37:13.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service; easy process and payment. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 2,
          "Date": "2021-11-10T14:34:09.000Z",
          "Titre": "Very fast and easy process",
          "Contenu": "Very fast and easy process. I would definitely"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ALEX",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T23:03:42.000Z",
          "Titre": "These guys were fast and accurate with…",
          "Contenu": "These guys were fast and accurate with their value. Will use them again for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2021-10-22T03:36:52.000Z",
          "Titre": "Not a scam",
          "Contenu": "Fast! Super simple got my money in my cash app 3 days after mailing my phone!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 2,
          "Date": "2021-11-05T22:27:51.000Z",
          "Titre": "Fast payment, top offer.",
          "Contenu": "Great place to sell your older electronics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T23:35:54.000Z",
          "Titre": "Great service and good turnaround",
          "Contenu": "Great service and good turnaround, would use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2021-12-11T22:39:57.000Z",
          "Titre": "Fast easy and got the amount I was…",
          "Contenu": "Fast easy and got the amount I was expecting"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 1,
          "Date": "2021-10-03T23:07:03.000Z",
          "Titre": "Extremely easy and quick process",
          "Contenu": "Extremely easy and quick process, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T22:32:43.000Z",
          "Titre": "Very fast and friendly",
          "Contenu": "Very fast and friendly. Would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 3,
          "Date": "2021-10-14T16:20:25.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, convenient, and quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T20:16:09.000Z",
          "Titre": "No problems",
          "Contenu": "No problems, fast payment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Guzman",
          "Nb_Reviews": 2,
          "Date": "2021-10-14T00:40:49.000Z",
          "Titre": "Easy transaction",
          "Contenu": "Easy transaction, and appreciated the confirmation when they received my phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T00:13:40.000Z",
          "Titre": "Worked flawlessly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommy",
          "Nb_Reviews": 2,
          "Date": "2021-11-22T22:40:14.000Z",
          "Titre": "They where awesome"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G Scott",
          "Nb_Reviews": 2,
          "Date": "2021-10-01T19:30:53.000Z",
          "Titre": "Quick turnaround",
          "Contenu": "Quick turnaround, thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catera",
          "Nb_Reviews": 1,
          "Date": "2021-10-30T00:15:05.000Z",
          "Titre": "Great fast service!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Obi Noel",
          "Nb_Reviews": 1,
          "Date": "2021-07-16T16:25:04.000Z",
          "Titre": "great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 1,
          "Date": "2021-11-29T15:10:53.000Z",
          "Titre": "Very good service and easy to do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick M.",
          "Nb_Reviews": 2,
          "Date": "2021-10-15T20:47:00.000Z",
          "Titre": "Trusted Service!",
          "Contenu": "Great service! Exactly as advertised!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felicity",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T15:52:02.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, good price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Maynard",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T17:51:20.000Z",
          "Titre": "Great to work with",
          "Contenu": "Great to work with, easy process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T00:45:50.000Z",
          "Titre": "Excellent communication and would…",
          "Contenu": "Excellent communication and would definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Won",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T18:32:22.000Z",
          "Titre": "Good communication and fast",
          "Contenu": "Good communication and fast. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "cheryl",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T02:00:29.000Z",
          "Titre": "Wonderful service",
          "Contenu": "Wonderful service: I definitely recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MP",
          "Nb_Reviews": 3,
          "Date": "2021-10-18T18:50:36.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, quick turnaround."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adonis Smith",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T06:21:12.000Z",
          "Titre": "Very good with  Communication"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 2,
          "Date": "2021-12-10T23:19:31.000Z",
          "Titre": "The real deal."
        }
      ]
    }
  ]
}