{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "buzzsprout.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "cedric",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T02:53:33.000Z",
          "Titre": "A complete scam let me tell you before…",
          "Contenu": "A complete scam let me tell you before you register:After 1 month on the free plan they simply deleted my acccount without any notice.I never put anything sensitive or any music or anything like that.I cannot log in anymore, all my episodes have been deleted as well as directories everything.The support tells me my accoutn has been marked as SPAM! AHAH yes I work everyday is this a problem?BUT here is the best: they ask me to restart from 0 while I was getting uploads from listeners AND to pay money for their paid plan or I will \"probably\" be deleted again.GOOD :)A complete scam.Go away from this platform."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Dr.R.K.Dua",
          "Nb_Reviews": 5,
          "Date": "2022-11-01T13:22:31.000Z",
          "Titre": "Not user friendly.",
          "Contenu": "While using free account they  were sending messages to upgrade to avoid deletion of podcasts. On upgrading still keep on deleting as these were stored before paid account. Sheer waste of money. No body to check what customer wants and saying. Just copy paste answer."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T11:48:23.000Z",
          "Titre": "No substance to their talk",
          "Contenu": "All your advice and resources or blogs etc are just fluff. I’ve spent hours trying to use said advice and it is contradictory and useless. If I’m paying a monthly service to host my podcast, perhaps just stick to hosting. Reduce the price and cut back the crap. Or if you insist on staying at the price point, perhaps promote our feeds or provide something."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T19:25:05.000Z",
          "Titre": "I can't get into my account and there…",
          "Contenu": "I can't get into my account and there is no one to call to help meeeeeeeeeeeeeeeeeeeeeee I'm so fricking frustrated and no one is answering my email support ticket either. I'm under a deadline and it's driving me crazy you can't call anyone to help."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Ayyub Bhoraniya",
          "Nb_Reviews": 4,
          "Date": "2023-05-13T11:21:55.000Z",
          "Titre": "False Claims - Worst Customer Support",
          "Contenu": "I emailed them 24 hours ago and received no response. They have mentioned an average 20-minute wait time, which is a false claim.I created an account on Buzzsprout, and after 24 hours, I can't log in to it.- It shows \"account not created.\"- When I tried the \"forgot password\" option, it showed \"no emails found.\"- When I tried to sign up again, it showed \"invalid email.\"I have worked hard to create the podcast, etc.And now, they have removed my account without any notice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bobbi Simpson",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T15:00:49.000Z",
          "Titre": "No real help real customer service help!",
          "Contenu": "I have reached out several times. Apple and I heart have not listed my podcast all I keep getting is the same question and no offer for resolution on why it has not been listed on apple or Iheart casting…customer service is a loop. Even when upgrading my account still showing as submitted…I’m very disappointed with the false advertisement of the ease of use!"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T09:53:08.000Z",
          "Titre": "Lacking on features",
          "Contenu": "Lacking on features, poor statsThe only reason we use Buzzsprout was because it's serving as a hosting provider. Nothing really more. You cans set-up your web page using BUzzsprout, but yo can't access any visit information to learn about if you're really discovered or are the transcriptions/descriptions of the episode getting any traffic. Stats for the episodes are also poor. It's convenient for the team to say that they collect stats based on some bare-minimum standard. In fact, we have to conduct additional analysis ourselves using spreadsheets to measure the podcast performance.An more than that, if you're going multi-channel, Buzzsprout stats are even more useless. 25% of our listens come from Buzzsprout, the rest is done on other platforms such as YouTube or Facebook Watch. If you really are into monitoring performance of the podcast and going wide with it, Buzzsprout isn't the best tool for that.The only reason why we are staying is that we don't think we want to put effort in moving elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "Godleen anya",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T17:52:24.000Z",
          "Titre": "I moved to buzzsprout and I got ill and…",
          "Contenu": "I moved to buzzsprout and I got ill and was hospitalised for months, I haven't used buzzsprout since I moved so I can't help to think that months of that money has been wasted .I'll love to have a month free or a discount for the next month or months to come."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T10:14:23.000Z",
          "Titre": "I haven't uploaded a podcast episode…",
          "Contenu": "I haven't uploaded a podcast episode for months, yet am forced to pay US$18 a month to keep existing episodes online. I am seriously considering changing host providers, as the rising cost of living is starting to make this unaffordable."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Mickey Joe Alpha",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T06:33:56.000Z",
          "Titre": "Buzzsprout will take and take but doesn't actually give",
          "Contenu": "When you don't use up your minutes THAT YOU PAY FOR EVERY MONTH, they don't even transfer to the next month. Even though I literally paid for them. With real money. But guess what, if you're ever OVER your amount of minutes you can upload, Buzzsprout will gladly charge you extra. No problem. Looking to switch provider. My work is worth more than this mediocre treatment and casual use of my time/resources. Big 👎"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mj",
          "Nb_Reviews": 78,
          "Date": "2023-03-09T21:24:21.000Z",
          "Titre": "What seemed easy turned into too much stress",
          "Contenu": "Signing up was easy enough and it seemed to all be going smoothly.  Until I upgraded my account from free to paid.  They were Unable to take payment from my bank account for unknown reason. I had the funds available for them.  They immediately suspended my account despite me paying the £10 less than 24 hours later.  (Once I got their email saying we can’t take payment, I logged in immediately and paid.) Days later, my account is still suspended and they’re telling me I made no payment.  I’ve had to get bank app screenshots to prove I did in fact pay.  It took half a dozen back and forth emails because they kept denying receipt of my account payments. They are still denying my latest payment despite having proof from my bank it was paid.   I’m going to have to report them to my bank for services not received.   They seem to have a lot of staff as it’s always a different name on the emails sent to me but, not one has the ability to view my transactions for the last two months.   I’m not good with stress and needing to exert excess energy because a company is unprofessional or inept. Il have to find a more accurate and suitable podcast host for my needs.  I should have read these reviews first.  I never trust a company with loads of reviews left by people who have only ever left one review.   It looks suspicious, usually with good reason.  I’m guessing these reviewers and the company employees have similar names."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T23:33:25.000Z",
          "Titre": "I feel that buzzsprout represses my…",
          "Contenu": "I feel that buzzsprout represses my listens and does not present accurate listener data cross-platform."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tha Caterpillar Killer Kyle Ru",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T22:12:08.000Z",
          "Titre": "Don't Use This Site",
          "Contenu": "This Website Locked Me Out For Using Rap Not Christian Banter"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T11:21:37.000Z",
          "Titre": "Rude and abrupt customer service",
          "Contenu": "I find the customer service very abrupt and rude."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T10:58:37.000Z",
          "Titre": "Mono only audio is what ruined it for…",
          "Contenu": "Mono only audio is what ruined it for me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Coon",
          "Nb_Reviews": 1,
          "Date": "2020-11-06T22:50:36.000Z",
          "Titre": "Easy to use but I have multiple…",
          "Contenu": "Easy to use but I have multiple podcasts, wouldPrefer 1 bill and compiled stats. Also hard to get sponsors and or growth in audience."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Sharon",
          "Nb_Reviews": 2,
          "Date": "2020-12-08T13:52:59.000Z",
          "Titre": "They can do better",
          "Contenu": "I had some issues with their product and service. Not highly recommended"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T18:04:22.000Z",
          "Titre": "Sick of the spam emails"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T02:34:47.000Z",
          "Titre": "I don’t see any improvement on my…",
          "Contenu": "I don’t see any improvement on my podcast"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Frank Wright",
          "Nb_Reviews": 1,
          "Date": "2021-01-28T19:11:37.000Z",
          "Titre": "cant reset my password",
          "Contenu": "did not help me at all...."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Sharon",
          "Nb_Reviews": 2,
          "Date": "2020-12-08T15:42:44.000Z",
          "Titre": "Worst support ever",
          "Contenu": "The worst support ever"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "David Evans DancexMediums",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T22:46:19.000Z",
          "Titre": "Good exposure, but vitriolic company.",
          "Contenu": "They will get your podcast to a wide variety of podcast platforms, more than many hosts. But they are a very vitriolic and antagonistic company. I missed a payment because I had the dd on a card I wasn't using any more and they immediately emailed threatening to delete my podcast. No, can you change your details, let's get this resolved, immediately hostile. If you want to leave as I eventually decided to do the leaving process is difficult or you delete your podcast. I would recommend beginners maybe start elsewhere to decide if podcasting is for you. I had 33 episodes under my belt. In the end I found that the content of my podcast didn't suit a podcast format and that the 14 hours it takes to produce each episode and the monthly cost wasn't worth it."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "C Nash",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T14:37:43.000Z",
          "Titre": "Regret choosing it. Pay forever or loose hosting old content!",
          "Contenu": "I set up the podcast to record my progress with cancer treatment, which has run for a couple of series. Now I am no longer making more content I don't want to pay anymore but find if I turn it back to a free service I will loose the hosting of all the episodes we made. So now I really regret chooseing buzzsprout as the host because I am forced to pay forever for something i'm not using or listeners loose access to all the work I've done and paid to put up. Very disappointing and unfair"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T04:46:18.000Z",
          "Titre": "I feel it is very expensive and not as…",
          "Contenu": "I feel it is very expensive and not as good as Anchor. Anchor does a spotlight competition and rewards podcasts that do well. On top of that it is not a paid platform and has started giving very good insights as well."
        },
        {
          "Note": 2,
          "Lieu": "ID",
          "Pseudo": "HARLAND",
          "Nb_Reviews": 3,
          "Date": "2023-03-18T16:07:19.000Z",
          "Titre": "Not worth it  Paid for more time",
          "Contenu": "Paid for more time, have to wait till the following month or something Kane that it didn't take effect so canceled my subscription I'll just stick to using Ferrite/Anchor as it uploads to Spotify right away which i like."
        },
        {
          "Note": 2,
          "Lieu": "UA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T07:27:34.000Z",
          "Titre": "Too expensive for what it’s worth",
          "Contenu": "1. Too expensive for small podcasts: both traffic and storage I use would usually cost around $0.05/mo at any cloud provider2. Very limited website customization3. No localization in 2022? Seriously?4. No language selection for the websiteBuzzsprout feels like a site that somehow survived the dot-com era and didn’t change much.I wouldn’t recommend it to anyone, except maybe the very beginners to start their podcasting journey and later hop to something else"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Yash",
          "Nb_Reviews": 2,
          "Date": "2020-11-15T09:32:11.000Z",
          "Titre": "Only one thing that Buzzsprout lacks is… Pricing is expensive",
          "Contenu": "Only one thing that Buzzsprout lacks is the expensive pricing. Even the basic plan is expensive. I am done. As a student I want to make sure that my Voice is being reaching out to everyone. But with that aggressive pricing and as a student. It is enough more than enough. Service is Great. Everything is great but the pricing isn’t. Please if you are reading this focus on pricing. Right now I won’t suggest Buzzsprout to anyone. Only pricing is bad otherwise it is great."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "General Podcasts",
          "Nb_Reviews": 1,
          "Date": "2020-11-21T17:09:08.000Z",
          "Titre": "Never an issue- but once when there…",
          "Contenu": "Never an issue- but once when there was, they were right on it. And they always answer emails in a timely manner ! Excellent service and look forward to the education  and extra services now available!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T17:44:59.000Z",
          "Titre": "It's more expensive than comparable…",
          "Contenu": "It's more expensive than comparable options with no real differentiator."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-15T01:01:05.000Z",
          "Titre": "not seeing any growth potential",
          "Contenu": "not seeing any growth potential. The ability to post on DSPs is cool.. but what about getting more downloads."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ken Mitchell",
          "Nb_Reviews": 1,
          "Date": "2020-11-09T14:41:46.000Z",
          "Titre": "Unused time..",
          "Contenu": "Unused time... The limitation of not being able to roll over unused time is bad."
        },
        {
          "Note": 2,
          "Lieu": "VN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T09:59:19.000Z",
          "Titre": "I don't know why my podcast was deleted"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T09:17:09.000Z",
          "Titre": "Way to expensive",
          "Contenu": "Way to expensive but what am I going to do?"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Mary",
          "Nb_Reviews": 4,
          "Date": "2023-11-04T06:09:59.000Z",
          "Titre": "No such thing as a free lunch",
          "Contenu": "I have had to move one of my podcasts to a free account and I think the way Buzzsprout kills the episodes off and doesn't allow recovery is a bit draconian.  I think you could come up with a better model for this if you gave it some thought. I have two podcasts and one is episodic. I publish 5 or 6 episodes once a year. Your plans are expensive for that sort of podcast. Generally your pricing seems suited to a weekly podcast, but not all podcasts are like that. It is of course up to you how you price your plans, but I think that you are missing a large part of the market."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Sharon",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T10:36:32.000Z",
          "Titre": "I wish",
          "Contenu": "I love buzzprouts features they are easy to use. however, the fact that short 10minutes podcasts can’t be monetized is a huge disappointment not every podcast is chatting and interviewing Not sure how long I will keep up with this, it’s hard enough to be a creator and without any fruits for your labour"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian W",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T17:13:21.000Z",
          "Titre": "Great but Room for Improvement",
          "Contenu": "Buzzsprout is easy to navigate and provides all services needed to host a podcast. That said, there is room for improvement:*More flexible pricing for upload amount. I do not upload the same amount of content every month. Therefore, I find myself either wasting or overpaying, based on the amount of audio I upload each month. It is frustrating.*More exact timing for preview clips. Not every preview clip or conversation fits into half-second intervals."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T02:03:25.000Z",
          "Titre": "A convenient way to get started",
          "Contenu": "The overall experience with buzzsprout has been great. Although there should be a better suited language solution for non US users. Also the sponsorship deals, that are on display, only display US clients, which is not very relevant for me.When creating chapters, one is not able to link Artwork for individual chapters. The option is there, but it does not work!"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "VITO FERRO",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T16:16:16.000Z",
          "Titre": "It could be better",
          "Contenu": "I started my \"career\" as a podcaster on buzzsprout, and I'm glad I did. Now, after a year, published more than 90 episodes, switched to a \"potentially\" better paid plan, I'm starting to see the limits of this platform.I'd like to have more control over the stats, I'd like a free set of audio management tools, I'd love to be able to go live.I also notice that, unlike other competitors, it seems that Buzzsprout broadcasts the podcast less and worse. Maybe it's just my impression, but more widespread dissemination tools would be welcome."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T20:48:41.000Z",
          "Titre": "Just a suggestion...",
          "Contenu": "For the most part everything has been good. I came over to Buzzsprout from Libsyn because you had features they were not offering at the time. Since then, they have upgraded tremendously. The thing I wish Buzzsprout offered are social media integrations with third-party apps like Headliner, etc, and the automatic ability to post episodes to our YouTube channels."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron Meyer",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T13:49:57.000Z",
          "Titre": "Would like a way to post to YouTube or…",
          "Contenu": "Would like a way to post to YouTube or potentially record remotely from the platform. Considering switching to a platform with more capabilities. Also weird login quirks when I’m switching accounts I sometimes get a this page doesn’t exist the first time this really freaked me out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JULIA S BUTLER",
          "Nb_Reviews": 2,
          "Date": "2023-03-25T01:14:38.000Z",
          "Titre": "Say What?",
          "Contenu": "Fri. 03/24/2023 #6:12 pm Central -- Good evening. I gave it 3 b/c I haven't been in touch w/Buzzsprout, so my question is - WHY am I even getting an EM asking for a rating? Is this just for GP [general purposes]? Or, if I did talk to or contact someone back on 3.10.23, so much has happened since then, like - reinstalling Windows after a wipeout - I don't remember."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T21:51:58.000Z",
          "Titre": "Consistent, but costly",
          "Contenu": "Has been consistent, but priced pretty high for this service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Talon Media",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T01:22:23.000Z",
          "Titre": "Just getting started.",
          "Contenu": "I am just getting started with Podcasting and Vlogging, right now this is just a hobby and a skill set that I would like to grow, so I have no frame of reference on what is good or bad. If I had to choose an adjective to describe the experience so far, I would probably say it has been easy. Uploading content has been straightforward, and that's helpful to someone like me that is learning and is not super tech savvy. I only gave it 3 stars because I don't have anything else to compare it to. I would give it 4 stars, given the ease of use, but it is also costing me money so I took a start away for that. Balance. =-)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Harris",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T14:39:48.000Z",
          "Titre": "I asked to see a complete tutorial on how to operate buzzaprout n how to load music n content to start my first show. Didnt seem to get exactly that.",
          "Contenu": "I'm still not seeing a complete breakdown on how to use buzzsprout from A to Z. I need to get going. Please send me something not complicated that zi can understand easily, please Thank youJeff Harris"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alld",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T17:27:12.000Z",
          "Titre": "No subscription for a client that is no…",
          "Contenu": "No subscription for a client that is no longer producing content but doesn’t want to lose the RSS feed. The metrics are not as good as others. The overall experience is mediocre"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andy gunnin",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T16:55:10.000Z",
          "Titre": "Need help growth",
          "Contenu": "My experience has been fine. Easy upload and I like the platform. I’d like more assticance in monetization and growth. I fell like it’s set up well until you have this crazy amount of downloads a month with no guidance to get there. For the most part I do like y’all."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "SSP",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T14:16:39.000Z",
          "Titre": "No Real Innovation From Buzzsprout Since 2019",
          "Contenu": "I've been hosting a podcast since 2019 and haven't really seen much innovation from Buzzsprout in all that time.I use the built-in Buzzsprout website as the landing page for my podcast, and it doesn't have any community engagement functionality. This is critical because that's what makes YouTube so successful with podcasts. It also doesn't offer the ability to sell digital products. If I were to start a podcast today, I would just go straight to either Substack or YouTube because that's where discovery is happening now in 2023. If your podcast is about a topic that YouTube censors, then Substack's new podcast functionality (with video) would still be better than Buzzsprout or YouTube. In 2024, I plan to move all of my podcasts off Buzzsprout and host them on Substack or YouTube. If you want a simple audio-only podcast, even then I would say that other, more modern platforms are potentially better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T11:43:32.000Z",
          "Titre": "As a podcast producer I would like to…more download statistics",
          "Contenu": "As a podcast producer I would like to see more information regarding downloads. With over 50 episodes now in circulation it would be helpful to see for instance - a latest download stat for each episode."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "The Scotchy bourbon Boycustome",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T12:55:53.000Z",
          "Titre": "I need more help getting my listenership up",
          "Contenu": "You do everything well but I feel like after 3.5 years my traffic is generated by me and I have no help from buzzsprout attracting more listeners"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom Kranz",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T19:15:34.000Z",
          "Titre": "Easy to set up but wish it went deeper",
          "Contenu": "Buzzsprout makes it easy enough to start a podcast with its easy-to-use interface. But I miss the ability to create a subscription or membership function within the Buzzsprout platform and I wish it had more robust monetization features. You are pretty much on your own to find sponsors, sell your episodes and so on, unlike other platforms that distribute your podcast to potential advertisers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "A five year customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T22:39:39.000Z",
          "Titre": "There is no application",
          "Contenu": "There is no application. They don't develop too much only extra services that you need to pay for it. And I think you can find a cheaper option."
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "manolis",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T12:06:33.000Z",
          "Titre": "Time to improve",
          "Contenu": "I like the simplicity of the experience and the reliability of the platform. On the other hand, I wouldn't say I like the lack of sophisticated analytics, which is one of the most important things for a podcaster, and the need for a mobile app is more than evident."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Casey Stubbs",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T14:14:49.000Z",
          "Titre": "Some good some bad.",
          "Contenu": "I have been with buzz sprout for over 5 years.They get 3 stars.For ease of use they get 5 stars.For putting customers first they get 1 star.I have asked for a simple feature to be added but because they love profits over people they didn't even consider it.Because of this I will move when I get a chance."
        },
        {
          "Note": 3,
          "Lieu": "CZ",
          "Pseudo": "Graham Needham",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T15:25:36.000Z",
          "Titre": "Great platform but some things not very clear",
          "Contenu": "Upon uploading our first podcast a few things were not clear, free, or the same as it was made out to be. Firstly, we could not upload a transcript - this is a PAID FOR feature which is not obvious according to the help documentation. When we did upload the transcript it shows as just one long mass of text - Buzzsprout uses a non-standard format for transcript files which we will have to spend time deciphering. Next, we wanted to push our podcasts to the various directories but the help documentation and videos did not match the actual experience - yes, things change, but the help documentation had not kept up. Then we couldn't push to Google Podcasts because this was now a PAID FOR feature - again, not how it is shown on the sales/help sections of the website. That's OK, we were going to pay for a subscription anyway, but to be forced to do it straight away because 2 important features were not available (as advertised) was a bit naughty. Finally, pushing the podcast to a couple of directories/or claiming them on the relevant Podcast site requires your email address to be in your RSS feed - this is not how it is shown in the sales/help sections of Buzzsprout - in fact, it requires finding a special page where you can add the email address for 24 hours to get this sorted. Not obvious, and time consuming. All in all though. I can recommend Buzzsprout as a Podcast management platform. If it wasn't for these niggles/problems outlined here (which I did ultimately solve) I would have given them 5 out of 5."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Jorge Wasko",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T14:32:13.000Z",
          "Titre": "WE CAN´T UPLOAD VIDEOS.",
          "Contenu": "WE CAN´T UPLOAD VIDEOS.PLEASE UPGRADE FASTER OR WE LEAVE TO ANCHOR SPOTIFY FOR PODCASTERS.HURRY UP!"
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T18:00:58.000Z",
          "Titre": "I would have given 5 stars but when I…",
          "Contenu": "I would have given 5 stars but when I couldn’t change my billing date .. that is what took me down to a 3 star.. so much can be done in the world of computers and when u can’t move a date .. to me that seemed very strange .. other then that I think Buzzsprout is great .."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T07:21:37.000Z",
          "Titre": "Statistics sadly do not get deep…",
          "Contenu": "Statistics sadly do not get deep enough. Overviews also not very helpful and in-depth."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Hear My True Story",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T14:04:55.000Z",
          "Titre": "While it's great that it's…",
          "Contenu": "While it's great that it's user-friendly, the introduction of monetization, only applying to podcasts with at least 1000 downloads, does not support independent podcasters with fewer than 1000 downloads. Additionally, the lack of an annual payment option limits the payment choices available."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T10:12:30.000Z",
          "Titre": "I kind of wish that we could have…",
          "Contenu": "I kind of wish that we could have options like having questions are polls. You know to engage with the fans more."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T10:15:17.000Z",
          "Titre": "Dislike opportunities for sponsorships…",
          "Contenu": "Dislike opportunities for sponsorships for country you are in. I only have ever been offered American podcasts and on Podbean American companies."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T10:18:30.000Z",
          "Titre": "Just too expensive",
          "Contenu": "The service is alright. But not value for the price point. The tiers don’t work for beginners"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T17:52:39.000Z",
          "Titre": "Add comments sections to buzzsprout…",
          "Contenu": "Add comments sections to buzzsprout website. So creators get instant feedback from the listeners."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Kellariloukko",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T17:37:39.000Z",
          "Titre": "Expensive",
          "Contenu": "Everything is done well, but it is quite expensive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dr. Richard Zeile",
          "Nb_Reviews": 2,
          "Date": "2023-03-11T18:43:01.000Z",
          "Titre": "Satisfactory experience",
          "Contenu": "I appreciate the Buzzsprout program which enables me to share my broadcast world-wide."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Jacob Sørensen",
          "Nb_Reviews": 4,
          "Date": "2023-03-21T22:44:50.000Z",
          "Titre": "too much waste time",
          "Contenu": "too much waste time, and too expensive"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Blair Hebert Rad Rhumba",
          "Nb_Reviews": 4,
          "Date": "2023-03-07T15:56:50.000Z",
          "Titre": "Weak front end tools to design a splash page",
          "Contenu": "Too few tools for building a front end splash page"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MantraBum",
          "Nb_Reviews": 1,
          "Date": "2021-03-31T18:07:13.000Z",
          "Titre": "Lack of phone support is a bit problem…",
          "Contenu": "Lack of phone support is a bit problem for me. Cant seem to get connected to the podcast sites and Buzzsprout seemingly no has no method of interacting other than email. Apple iTunes connect is much worse. At least Buzzsprout has made an effort, although they seem unable to get anything done.   The short of it is. I'm not getting on the sites. When I see all the podcast across the net I just wonder what is the problem...and I get no answers."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "AspiringPodcastNetwork",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T08:41:11.000Z",
          "Titre": "Good for solo podcasting, not good for having many podcasts",
          "Contenu": "While this is great for a solo podcast, however, the inability to share purchased hours with other podcasts you want to start makes this a particularly disappointing site. If you are looking to do multiple podcasts with a cost friendly solution, don't pick this site. If you are only doing one, this is a wonderful site and comes with many perks. Just decide what your goals are before diving in."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alan King",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T13:40:21.000Z",
          "Titre": "It's nice with a few gripes",
          "Contenu": "While I like that this platform gets podcast episodes on a number of syndicated sites, I wish there was a clear way of know how many subscribers we have. That number would be good to share with funders and potential guest. I also don't like that stats aren't in real time. I have to wait a few hours to see how the episodes are really doing. That's not helpful."
        },
        {
          "Note": 3,
          "Lieu": "UA",
          "Pseudo": "BillgreenFiftyFour",
          "Nb_Reviews": 2,
          "Date": "2020-11-27T10:38:02.000Z",
          "Titre": "For 2021 Monetizing Podcast Content is My Number One Goal.",
          "Contenu": "For 2021, every site I utilize for all types of monetary gain must perform at or beyond my expectations. Buzzsprout seems to be a good way to post podcasts for some users. It just did not work for me. I understand that monetizing a podcast is challenging at best. I have enough hobbies. The podcast industry is more mature than ever. I am sure there is still plenty of room for growth. Spending countless hours creating just for the fun of it, is no longer my goal."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Phillip Grapevine Ministries",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T20:27:03.000Z",
          "Titre": "More input required",
          "Contenu": "I love the support and all the small podcast helpful hints, with one small drawback. Everyone assumes that we are all up to speed with podcasting, and the information is just fine tuning. That’s not true, everyone talks so fast and only gives basic information on how to do things, no links to step by step instructions or telling people what to do. People like me in the more mature category are not as technically savvy as most, more information is more helpful"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brett",
          "Nb_Reviews": 1,
          "Date": "2020-11-06T22:46:55.000Z",
          "Titre": "I enjoy BuzzSprout a lot",
          "Contenu": "I enjoy BuzzSprout a lot. It is a great service. The only reason I give it three stars is that I do not like the pricing structure. I should be able to have as many podcasts RSS feeds as I want and pay for them in bulk. Without that I cannot give it a 5 star review and it is still an only three star service to me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T21:26:43.000Z",
          "Titre": "Easy to use but upload terms aren't good...",
          "Contenu": "Easy to use service for my podcast but don't like how they have a use it or lose it kind of thing for unused upload hours. Analytics could be more detailed like retention, how many followers within each platform, what your reviews are for those platforms and more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shari",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T00:43:16.000Z",
          "Titre": "The platform needs to have a way to…",
          "Contenu": "The platform needs to have a way to highlight new cities and new countries that download each podcast Episode. For example, If my fourth podcast is played again in a 24 hour period. It should be highlighted or shown in bold indicating the new city and/or country"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adam Brewer & Nathan del Rio",
          "Nb_Reviews": 1,
          "Date": "2020-11-07T01:24:51.000Z",
          "Titre": "Needs more pricing levels",
          "Contenu": "My cohost and I are currently not producing new content due to our day jobs. While we love the quality of the hosting environment, we don’t like that there’s not a pricing option to just maintain the current library without adding content."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-08T16:49:47.000Z",
          "Titre": "Reporting is ok",
          "Contenu": "Reporting is ok. Wish there we're more ways to look at historical performance of a given episode. Also, would be nice if there was a way to unhide the older episodes that are no longer visible on some of the charts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T16:41:12.000Z",
          "Titre": "Everything about Buzzsprout is really good....except....",
          "Contenu": "Everything about Buzzsprout is good, reliable intuitive interface, straightforward to use, and good customer support. The one area where it does not shine, and this is a huge deal, is cost. Because their billing system is based on upload time, depending on how much you want to spend, just six hours-which really isn't that much-with magic mastering cost almost $30 a month! That's a lot more than my pay grade can afford. If you need to expand to a more reasonable 10 hours, that will cost you even more. That's crazy.If you're going to do any kind of serious podcasting, you'll need at least six hours a month. I switched to a host which actually has many more features, a webpage (except it doesn't have magic mastering) and unlimited upload time, all that for 15 bucks a month, you do the math, it's a no-brainer."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-04-02T07:28:37.000Z",
          "Titre": "It’s too expensive",
          "Contenu": "It’s too expensive - especially for a side-project. I just wanted to port my YouTube videos to an all-audio form. The service itself is good and reliable though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T22:11:02.000Z",
          "Titre": "sound quality issues"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-27T19:14:23.000Z",
          "Titre": "Wish you had more services like…",
          "Contenu": "Wish you had more services like allowing subscriptions and or donations to the podcast. Buzzsprout has too many steps to linking up with other podcast services."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Dr. Mayur Davda",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T08:00:21.000Z",
          "Titre": "Its good but with a few issues.",
          "Contenu": "Pros One of the best after sales support teams ever, one I received a response in less than a minute !Great lay out & intuitive platform very neat Cons Expensive as compared to others I felt the uploaded file has a different sound as compared to my original file Cannot schedule in between hours like 830. there is either 8 or 9. Podcast Distribution is not that easy initially Visual soundbite is NOT that customizable to be honest. not even close to headliner quality. Thats a huge tire off Although they say that they will promote the visual sound bite on twitter when you  tag Buzzsprout thats never happened for me yet. Not a single retweetUnclear about affiliate marketing -  I ve not got any confirmation although they did get a paid subscription through me CANNOT DO LIVE podcasting !! I had a few issues integrating the embed on my personal website ."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Andrea Merli",
          "Nb_Reviews": 15,
          "Date": "2021-01-06T15:24:03.000Z",
          "Titre": "Best modern & user-friendly interface for beginners, but high price.",
          "Contenu": "I evaluated many podcast platforms before starting my podcast. I tried for a month Buzzsprout and I like the site and their interface: simple to use and very well-designed. However I think their price point for entry-level paid subscription ($12/month) is high compared to the services and 3 hrs/month. Also, I like to finalize my audio mix the way I want and I know how to do it, so I'm not impressed by things like magic-mastering (which by the way is not included in the price)... but I was surprised to understand that their system re-convert your mp3 files by lowering the quality/bitrate and that's a huge minus for me. I currently host on a competitor with cheaper price for much more hours (no monthly limit), no unwanted editing on my original file and unlimited podcasts on the same account. That's why I suggest they reconsider their price point for the entry level subscription, because their site is so good as well as their customer service."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "David James",
          "Nb_Reviews": 3,
          "Date": "2022-07-10T05:30:17.000Z",
          "Titre": "Too expensive and poor search…",
          "Contenu": "Too expensive and poor search optimization. Limited podcast sponsorship opportunities."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T10:37:07.000Z",
          "Titre": "It was nice in the beginning but…",
          "Contenu": "It was nice in the beginning but suddenly dowloads are considerably low. When asked reason wasn't explained."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gill",
          "Nb_Reviews": 1,
          "Date": "2020-12-04T23:42:10.000Z",
          "Titre": "Rollover? Nah...",
          "Contenu": "It kind sucks if I don’t use up my hours or minutes the period of usage they do not roll over to next cycle. I payed for them, right?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-20T12:35:04.000Z",
          "Titre": "Love this platform",
          "Contenu": "Love this platform. The organization of everything could use some work though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T14:19:53.000Z",
          "Titre": "Great platform easy to use",
          "Contenu": "Great platform easy to use. Maybe it’s on me but exposure is tough to reach"
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T10:26:06.000Z",
          "Titre": "Good but over budget",
          "Contenu": "A nice host but not in all platform and the price is a little bit high"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ethic Radio",
          "Nb_Reviews": 1,
          "Date": "2020-11-07T13:35:41.000Z",
          "Titre": "We need help with bringing more traffic…",
          "Contenu": "We need help with bringing more traffic to our podcast"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donny",
          "Nb_Reviews": 2,
          "Date": "2020-11-30T12:24:20.000Z",
          "Titre": "Generic",
          "Contenu": "It was fairly helpful, nothing special"
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T11:03:45.000Z",
          "Titre": "Too expensive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2020-11-06T22:58:45.000Z",
          "Titre": "Costs too much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Blonde Intelligence",
          "Nb_Reviews": 2,
          "Date": "2023-07-02T04:11:54.000Z",
          "Titre": "I tag Buzzsprout but they never help to…",
          "Contenu": "I tag Buzzsprout but they never help to promote."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Ritsko",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T15:31:06.000Z",
          "Titre": "Easy handling",
          "Contenu": "As a man of seventy I started the podcast “De Zinnen Verzetten”. Thanks to the easy handling of this technical process I succeed!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Unclepucker",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T20:50:00.000Z",
          "Titre": "We began our podcast about 6 months ago…",
          "Contenu": "We began our podcast about 6 months ago and have been using Buzzspprout since the beginning.  Your website has worked perfectly.  We have no trouble uploading and publishing our show to many different sites. We would not be enjoying the early success of our show without the services that Buzzsprout provides. Keep up the great work"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Trevor",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T10:31:18.000Z",
          "Titre": "The best option for podcast distribution",
          "Contenu": "This company does work constantly on making their service even better. The new paid subscribers plan is good, though more features are needed. I would have given 5 stars if is have experienced better promotions for lesser popular or niche podcasters, such as mine."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rehannah",
          "Nb_Reviews": 4,
          "Date": "2023-03-25T20:19:36.000Z",
          "Titre": "A great, easy podcast platform but...",
          "Contenu": "I love the ease of using Buzzsprout, but I'm frustrated that it won't allow me to monetise my podcast, which has 2.5 million subscribers because my episodes are shorter than 20mins. It's a kids bedtime story podcast so they are generally all short stories. It would get a 5 star rating if this was resolved."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Seamus",
          "Nb_Reviews": 5,
          "Date": "2023-03-31T10:53:31.000Z",
          "Titre": "User friendly for someone who has never…",
          "Contenu": "User friendly for someone who has never created or hosted a podcast before. There is also some very good links and articles to things like marketing your podcast and editing your podcast in audacity. Also, great that you upload an episode once and it's linked to other platforms. The data is also great to see and have access to."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "business customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T10:01:07.000Z",
          "Titre": "Could improve on analytics",
          "Contenu": "Would be great to get more precise analytics for in-house reporting. E.g ability to enter specific dates or date ranges for individual episodes in order to pull data such as listens, locations devices etc"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Megan",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T23:17:31.000Z",
          "Titre": "Love this platform",
          "Contenu": "Love this platform, it makes hosting a podcast as a one-woman show SO MUCH EASIER. The only thing I wish it had, that would give it that final star, is more detailed analytics. I also can't access my Google Podcast Analytics because of how it's set up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T15:39:27.000Z",
          "Titre": "I enjoy the easy way to upload and edit…",
          "Contenu": "I enjoy the easy way to upload and edit episodes from both phone and computer. I really like the stats and graphs and charts. I wish it could be more granular, as in see where someone downloaded an episode on a particular day. Compared to the current function of seeing the gross downloads and locations"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2023-03-28T15:11:47.000Z",
          "Titre": "Ease of use and ability to cross…",
          "Contenu": "Ease of use and ability to cross promote across a wide range of platforms. I wish the download diagnostics graphic visualizer had a little more detailed information available. Overall, very pleased with using buzz sprout as our base platform for our podcast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CCA",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T15:14:57.000Z",
          "Titre": "One small suggestion",
          "Contenu": "I love Buzzsprout. I am very happy with the data it provides. I am grateful that there is a “custom” option when seeing the amount of downloads for a certain time. It really helps when I am gathering data for a certain time period. However, I wish there was a way to get other information in a custom time period. For example, devices, locations, etc. I would love to be able to look at this information without having to do the math myself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T00:29:32.000Z",
          "Titre": "I love Buzzsprout but subscription issues",
          "Contenu": "I love Buzzsprout, however there is a MAJOR issue…I just started a subscription and many people who have subscribed are having trouble listening.  I want to advertise with you, but I’m worried more people will have issues.  I don’t understand the whole RSS feed issue, but it concerns me…"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T13:41:52.000Z",
          "Titre": "I love buzzsprout!",
          "Contenu": "Buzzsprout doesn’t just have a user friendly platform, it provides so much insight for their customers. Not to mention videos on how to improve as a podcaster. With that said I do wish they made it easier to monetize! The guidelines for monetizing are hard to reach for new podcasters."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T15:38:57.000Z",
          "Titre": "Great Performance. Could improve UI/UX.",
          "Contenu": "Great Performance. Could improve UI/UX and Descript integration.I am biased as a Descript user and I have a hard time using Descript and Buzzsprout quite as seamlessly as I used to in the fourth quarter of 2022. I feel that the navigation could be more obvious. I still spend some time clicking around to find what I'm looking for in order to put in metadata and transcripts."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Harry Branch",
          "Nb_Reviews": 5,
          "Date": "2023-03-15T10:59:12.000Z",
          "Titre": "Quick replies from customer services",
          "Contenu": "Quick replies from customer services, easy sign up. Maybe a free trial would of been good for one month or money back, prices are a little more expensive than you would like but no issues and straight forward systems to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T14:35:58.000Z",
          "Titre": "Good started site.",
          "Contenu": "Buzzsprout is a great platform to start your own podcast. It is easy to use, the only problem I have is the 1000 downlands before monetization. I understand why they do it but that is quite a high number, especially if you haven't been doing it for years. Otherwise, great site, 10/10 do recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Feels Like Home",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T20:46:56.000Z",
          "Titre": "Buzzsprout is a great platform for…",
          "Contenu": "Buzzsprout is a great platform for beginning podcasters! The analytics are solid, the interface is easy to manage, and their pricing is affordable for those who are just starting. They also give you great advice and know-how through their blog!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "V. Winn",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T16:36:13.000Z",
          "Titre": "Buzzsprout is great with a few exceptions",
          "Contenu": "Buzzsprout is a great podcast hosting platform. However, there is no option to pay yearly for the services and podcast episodes should be recoverable up to 180 days. That’s the only reason they didn’t receive 5 stars from me."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "M. A. Bilbrough",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T22:40:31.000Z",
          "Titre": "Very well set out platform.",
          "Contenu": "Very well set out platform with cutting edge tools. Lots of supportive podcasts but always US based. We Europeans are little catered for. Shame I can't get on their monetising programme because my podcasts are too short."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "KM",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T12:50:00.000Z",
          "Titre": "Happy, a bit more analytics would be better",
          "Contenu": "In general I’m really happy with the platform. Easy to upload on different platforms. You get a download estimation for the next episode. It would handy to know for instance, how much %of the episode is listened and if there is a dropout moment for episodes."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Brett Fish",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T11:01:09.000Z",
          "Titre": "Podcast Hosting Pleasure",
          "Contenu": "Has been an amazing space to host my podcast, Out of the Fishbowl, and really offer some great tools. Is very simple and straightforward to use and helps you do the work of sharing it with other spaces where podcasts live."
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Lady Anna",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T19:50:02.000Z",
          "Titre": "I which they had a comment section",
          "Contenu": "I do like the company it's going ok so far I just wish they had a comment section on each podcast. On the website that would be great. I just there was a better way to get traffic to your podcast especially for persons who are not monitorize"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Liza",
          "Nb_Reviews": 4,
          "Date": "2023-03-21T20:43:20.000Z",
          "Titre": "I love Buzzsprout for it's incredible…",
          "Contenu": "I love Buzzsprout for it's incredible UI and the ease with which I can upload new episodes. Since I am doing this as a side gig, I wish there was a more affordable monthly fee for people who post one episode a month only. That would be truly amazing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T17:15:28.000Z",
          "Titre": "Need to help new podcasters grow an audience",
          "Contenu": "I’ve been using BuzzSprout for a year. Overall I like it. One of the things I don’t like though is that they don’t have internal opportunities to grow an audience. The bench is too high for their ad program so it doesn’t help podcasters that need the help growing an audience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pagan Coffee Talk",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T23:29:16.000Z",
          "Titre": "Great service and user interface",
          "Contenu": "We love that they have made it easy to publish a podcast to all the major and not-so-major platforms. We also love the detailed information for each day. The service is very reasonably priced and easy to use. We do wish there was a way to see more detailed episode information for each day, i.e. locations, platforms, etc. for each day and episode. We are beginning to use local advertising, so it would be nice to see if that is working. We would also like to see the ability to track reviews, likes, dislikes, etc. for all the platforms. Otherwise, we are very happy with the service and have recommended (and will continue to recommend) Buzzsprout."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Deborah Ljung",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T17:17:01.000Z",
          "Titre": "Excellent Product and Service",
          "Contenu": "I find it very easy to use, stable, cost effective and of good quality.  I have been a customer for almost a year and a half and I have never had any complaints about their product or their service. I consider it a huge blessing to have my podcast hosted by Buzzsprout!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "No Junk Mail. Grampa Jim",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T19:42:09.000Z",
          "Titre": "You have done well",
          "Contenu": "You have done well.   I’m more than likely a “ringer” among your customers.  First of all I’m narrating short stories that I write, secondly, they are stories about people in a small rural Iowa town, thirdly I don’t know anything about “Podcasting business or software” -I use the Hindenburg - and it’s worked for me so far; finally I’m deaf and can’t hardly hear what I’m doing. You got me started !!!It’s workingOh did I say- I’m 86 years old"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gail",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T13:47:11.000Z",
          "Titre": "I enjoy Buzzsprout",
          "Contenu": "I enjoy Buzzsprout. The reason I did not give it a five star is because you do not allow for YouTube as one of your platforms. I have a lot of subscribers on YouTube and they want my podcast. Please consider adding YouTube as soon as possible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RFenner",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T14:30:53.000Z",
          "Titre": "We enjoy using Buzzsprout",
          "Contenu": "We enjoy using Buzzsprout. However I’d like to see a change the policy regarding Buzzsprout ads for new creators. The bar to monetize seems high when you’re trying to build an audience."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Dean",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T19:45:24.000Z",
          "Titre": "Buzzsprout make it easy to get started…",
          "Contenu": "Buzzsprout make it easy to get started on a podcast. Helpful videos, a newsletter and if you up your subscription a free website and other small but useful tools such as soundbites for social media."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T18:02:37.000Z",
          "Titre": "Buzzsprout is a reliable and easy way…",
          "Contenu": "Buzzsprout is a reliable and easy way to publish podcasts and I enjoy the service. My podcast has close to 15,000 downloads as Buzzsprout made it easy to publish on all major podcast platforms including some I’ve never heard of. I’d give it five stars if they made it easier to monetize my work!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deborah Bohn",
          "Nb_Reviews": 5,
          "Date": "2023-04-17T21:01:11.000Z",
          "Titre": "I’m sorry I can’t give 5 stars because…",
          "Contenu": "I’m sorry I can’t give 5 stars because I have nothing to compare to it.  My beginning research lead me here. I wish we knew what subscribers were returning and which were unique."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T19:54:31.000Z",
          "Titre": "Anything about the services great the…",
          "Contenu": "Anything about the services great the only thing that keeps it from getting fire stars is the built-in ad because we have to meet us serve requirement, which is pretty hard to reach. At least for us."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "J Chandler",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T23:29:54.000Z",
          "Titre": "BUZZSPROUT is so easy to use",
          "Contenu": "BUZZSPROUT is so easy to use. Pop it up and off it goes out into the world. Your tutorials are very useful and simple to understand.An improvement:  I'd like to pay for the full year at once.  Currently you don't have that as an option."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T17:28:30.000Z",
          "Titre": "Your user interface was brilliant but bit of a longevity issue",
          "Contenu": "Your user interface was brilliant, very straightforward.  The only thing was that I had understood podcasts would stay online indefinitely once i'd cancelled the direct debit but now it appears thats changed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-31T13:23:13.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good! Easily listed to all platforms. Links to use for listener support automatically added when set up. Affiliate/sponsor opportunities as well as monetization section I am all too well pleased. Only thing I wish they had was an app."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ellington Brown",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T20:19:27.000Z",
          "Titre": "I love everything about Buzzsprout",
          "Contenu": "I love everything about Buzzsprout, except that your platform does not support video, only audio.I request that you expand your excellent services to include video support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "The Hangar Z Podcast",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T18:11:28.000Z",
          "Titre": "From Day One",
          "Contenu": "We have had a great experience with Buzzsprout from day one. Having no idea what I was doing initially Buzzsprout simplified the process to make it seamless. As we have grown as a podcast Buzzsprout's advanced features have continued to be our service of choice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laurena White",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T18:52:36.000Z",
          "Titre": "The overall experience is AMAZING",
          "Contenu": "The overall experience is AMAZING! I LOVE the podcasting experience itself. The interface is fantastic. However, when it comes to archiving, the retrieval method is cumbersome and a bit tedious. It's a bit more time-consuming that I imagined it to be. I would like those process to be a bit more straightforward without having to call customer service each time for assistance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-03-14T04:08:04.000Z",
          "Titre": "I have used this podcast platform for 2…",
          "Contenu": "I have used this podcast platform for 2 years and I have been very pleased with the service. Any questions or issues you have they address them in a timely fashion overall buzzsprout is a great platform"
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Kim Wilde",
          "Nb_Reviews": 18,
          "Date": "2023-03-22T10:35:17.000Z",
          "Titre": "Great service, expensive between releases",
          "Contenu": "Easy and intuitive to navigate, and has the most important podcast players on the list. However, newsletters are often irrelevant as they are very much aimed at their American users.Their support is fast, friendly and accurate!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Pal Podcast",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T15:11:26.000Z",
          "Titre": "It's easy to use the site",
          "Contenu": "It's easy to use the site.  I do wish the various directories were updated faster.  I have to make sure to upload my episode days in advance so that everything launches at the same time."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T15:17:57.000Z",
          "Titre": "Really user friendly and great customer…",
          "Contenu": "Really user friendly and great customer support. More detailed analytics for the future would be great for those of us dealing with stats :) Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tamara Graham",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T00:19:22.000Z",
          "Titre": "For the most part I like the platform",
          "Contenu": "For the most part I like the platform. I do have a few issues here and there with publishing and uploading. I do wish we could make sound bites a little bit easier and more of them. I also wish there was an annual subscription. It's kind of a pain having to deal with the billing every month."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Djbeck_official",
          "Nb_Reviews": 6,
          "Date": "2023-03-06T10:10:44.000Z",
          "Titre": "There needs to be a free mode where…",
          "Contenu": "There needs to be a free mode where episodes don’t get deleted, also a place to upload video footage other then that I love it."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Morgan",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T16:28:46.000Z",
          "Titre": "Good platform but very expensive",
          "Contenu": "The platform is pretty good but the cost is fairly expensive. If you are looking to do a casual podcast then a free platform would be much better"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rochelle Hamilton",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T15:55:46.000Z",
          "Titre": "Buzzsprout needs one thing to be perfect…",
          "Contenu": "I’m loving Buzzsprout and the ease to use it, but I really wish it came with a plan that includes a company email address. That is honestly my only critique. I would love to have a professional email for my podcast and I would love it to be through Buzzsprout. Otherwise, amazing platform, SUPER user-friendly and makes publishing my podcast a breeze!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T16:16:27.000Z",
          "Titre": "No complaints!",
          "Contenu": "I was so nervous to start a podcast, but Buzzsprout made it easy! I can post to different platforms automatically, which saves so much time!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathryn McClatchy",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T17:38:18.000Z",
          "Titre": "Two things to improve",
          "Contenu": "The ease of use, support, helpful blog, and price are spot on. I wish there was a spot to put Mt producers info on the page, not just a co-host. Also wish the stats were more useful. I keep looking for when listeners drop off --the way YouTube shows when viewers leave. That would be so helpful."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T12:57:04.000Z",
          "Titre": "I like how simple it is to use",
          "Contenu": "I like how simple it is to use! The only thing I find limiting is the reporting. I get emailed different stats than what it shows on the site. I also can't see how many downloads I get each week at the episode level, that would be great info to have."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Surf Shorts Podcast",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T14:44:46.000Z",
          "Titre": "The ease of use is wonderful and makes…",
          "Contenu": "The ease of use is wonderful and makes the entire experience uncomplicated. The videos and advice are every useful. My only complaint was the advertising I purchased was not productive. This is a quality website."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T19:52:03.000Z",
          "Titre": "The onboarding experience is pretty…",
          "Contenu": "The onboarding experience is pretty wellNavigation the Website is Not always Easy to understandI Miss German supportI Miss a more specifierd support for the Health theme"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Johannes Castner",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T10:52:04.000Z",
          "Titre": "processing time",
          "Contenu": "Sometimes it doesn’t process the file in time so it makes it hard to consistently publish at the same time each week.  Otherwise it’s been pretty good !"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jean",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T12:30:41.000Z",
          "Titre": "Help Needed and Received",
          "Contenu": "I really appreciate the many webinars that are offered by Buzzsprout. Pat Flynn is good, but he talks too fast. I am new to creating podcasts, so need to replay things many times. As we say in Toastmasters, a pause here and there really helps the listen get the message."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charlie Earl",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T14:46:19.000Z",
          "Titre": "Ease and growth",
          "Contenu": "When I first started using Buzzsprout, I admit I was somewhat intimidated. As I became comfortable with the features available, I found that the entire process was easy, and as I discovered more advantages, my ease grew weekly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "eatforlifecollective",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T15:15:03.000Z",
          "Titre": "The platform is extremely easy to use",
          "Contenu": "The platform is extremely easy to use. As someone who just started her podcast a year ago, this platform was easy to set up and I love all the features it has to offer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 3,
          "Date": "2022-04-05T20:25:56.000Z",
          "Titre": "Buzzsprout is great",
          "Contenu": "Buzzsprout is great.  It's very easy to use. Some of the apps are very slow in okaying my podcasts (Apple).  I didn't understand how to put in the, or instance, iHeart link into Buzzsprout.  I want to add music to my podcast beginning and end. Watched a Buzzsprout video and the instructions were not detailed enough. I do like Buzzsprout because it got me out to people in my podcast quickly. I like the drag and drop they offer for other sites. The other thing I wonder is can you export to multiple venues (FB & YouTube) at the same time? I have a channel on youtube and would like it to go there, also. I think Buzzsprout is reasonably priced, also."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "LAF Life Podcast",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T12:37:40.000Z",
          "Titre": "Buzz sprout is a great Podcast hosting platform",
          "Contenu": "Buzz sprout is great! Makes releasing our podcast episodes easy and they provide lots of valuable information."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T15:15:52.000Z",
          "Titre": "Easy to use.",
          "Contenu": "Easy to use. Good training and easy to follow. Friendly support system. Love the fact it has links to all the platforms so when you publish on Buzzsprout it also publishes to them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alien Talk Podcast",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T06:54:03.000Z",
          "Titre": "Buzzsprout gives your podcast global reach!",
          "Contenu": "Great statistical tools to measure and modify the performance of your podcast. Also, quick and thorough interfacing with the most popular download directories from around the world. You'll reach people everywhere!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-06-01T18:50:58.000Z",
          "Titre": "Great, simple to use platform. A few extra features would be great when seeing what the hosting competition now offer.",
          "Contenu": "Overall the service is excellent and it is extremely user friendly. Analytics could be better when seeing features on other platforms. It would be fantastic if video uploads from zoom were possible so podcasts could be uploaded, edited and added to YouTube and a \"videobite\" could also be created."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "The Five W’s",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T10:26:24.000Z",
          "Titre": "Solid",
          "Contenu": "The ease of use is excellent and the pricing provides value for money. I would like an ability to dive deeper into the stats (E.g., ability to see day to day stats, not just overall figures)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corey D.",
          "Nb_Reviews": 2,
          "Date": "2023-03-19T19:46:37.000Z",
          "Titre": "Really enjoy my experience",
          "Contenu": "Really enjoy my experience. I just wish I could add multiple shows without having to pay for another plan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hamish Todd",
          "Nb_Reviews": 3,
          "Date": "2022-04-06T19:51:28.000Z",
          "Titre": "Buzzstream is just fine so long as your…",
          "Contenu": "Buzzstream is just fine so long as your paying.  Supposedly, my podcast was to go to Apple and Spotify and so forth, but I got fewer and fewer hits.  So, I had to quit.  That is all. I paid to have Buzzsprout protect my archives, but this is unsustainable at best."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T10:56:23.000Z",
          "Titre": "Love the service guys only thing that’s…",
          "Contenu": "Love the service guys only thing that’s a bit harsh is if our subscription is late the cut off is instant"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "eln.co.uk",
          "Nb_Reviews": 2,
          "Date": "2023-03-22T10:18:41.000Z",
          "Titre": "Excellent platform for podcast beginners",
          "Contenu": "Excellent platform for complete beginners, facilitates the entire podcast process and easy to use yourself. Really practical and useful features. Only reason haven't given 5 stars is because it doesn't allow the option of creating video podcasts. Otherwise couldn't be happier with the price and features."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AC",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T05:29:11.000Z",
          "Titre": "Wish the podcast was on more podcast…",
          "Contenu": "Wish the podcast was on more podcast platforms. Wish buzzsprout had more features and functions like that of Podbean."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Omaha REIA",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T20:32:05.000Z",
          "Titre": "Good but not great yet",
          "Contenu": "Everything overall is good, I just wish you provided more in depth stats.  I really would like to know how long the average person listens to my podcast."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T10:25:25.000Z",
          "Titre": "Features",
          "Contenu": "I really like buzzsprout with all the awesome features in it but I would like if the programmer ads are always on"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T23:59:17.000Z",
          "Titre": "Buzzsprout has been great for our…",
          "Contenu": "Buzzsprout has been great for our podcast, so easy to use and provides all the information we need."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Liel",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T12:48:22.000Z",
          "Titre": "the platform is easy to work with",
          "Contenu": "the platform is easy to work withvery intuitive, short and sweet. i enjoyed working with it and happy i chose iti only wish that the upload process will run a little more smooth and fast."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mark B.",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T22:10:28.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Good support. Would like to see a more sophisticated soundbite creator offering more options in control."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T16:47:52.000Z",
          "Titre": "Very user friendly systems",
          "Contenu": "Very user friendly systems, I think the only thing keeping it from being 5 stars would be the amount of statistic information you can get from buzzsprout itself - but I also don't know how much control a hosting company has over that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 2,
          "Date": "2023-03-18T17:05:11.000Z",
          "Titre": "I like buzz, but the price?",
          "Contenu": "I like buzz.  The service and the newsletter are solid. It’s easy and intuitive. My one thing is the price. Why is anchor.fm free and buzz $12? Also, for $12, you’d hope to be able to host more than 1 podcast on it."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Antonella Zorzi",
          "Nb_Reviews": 4,
          "Date": "2023-03-08T10:21:36.000Z",
          "Titre": "Everything is fine working",
          "Contenu": "Everything is fine working , maybe a bit expensive in long term if you have more podcasts.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T10:20:50.000Z",
          "Titre": "Bring in video!",
          "Contenu": "I literally just wish they would host video. Love Buzzsprout and being a part of this community!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T01:13:27.000Z",
          "Titre": "I love",
          "Contenu": "I love it, I just wish there was more creative tools that I can use, such as background music"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Worship Facility",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T15:20:45.000Z",
          "Titre": "Easy set up and maintenance",
          "Contenu": "Our account was easy to set up and change. We get regular reports and tips that are helpful. There have been few challenges, but there have been a few."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T15:35:29.000Z",
          "Titre": "I like buzzsprout.com",
          "Contenu": "I like buzzsprout.com My biggest issue is not being able to see WHAT episodes go up. It's hard to track and would be great if you could make that easier to track"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer CRAZYDRE PODCAST SHOW",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T15:51:09.000Z",
          "Titre": "Easiest to distribute",
          "Contenu": "It’s easier platform to distribute my podcast. One thing I would change is the 24 hour time it may take to distribute the podcast"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "peter richards",
          "Nb_Reviews": 5,
          "Date": "2023-03-07T12:01:55.000Z",
          "Titre": "Responsive, helpful, improving",
          "Contenu": "Always responsive, helpful. Just a fantastic, personable all-round service. Is there room for improvement? Sure. But I feel confident Buzzsprout is moving in the right direction."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T12:34:59.000Z",
          "Titre": "Quite good",
          "Contenu": "Quite good, i miss a few options but generally i am happy with buzzsprout"
        },
        {
          "Note": 4,
          "Lieu": "RS",
          "Pseudo": "Nikola",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T10:47:53.000Z",
          "Titre": "Overall good experience",
          "Contenu": "Overall good experience. It would be great if you redesigned your look. I think it might need a fresh, new style."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Maria",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T15:04:26.000Z",
          "Titre": "Good but with poor statistics",
          "Contenu": "Overall, I'm happy with it, but the statistics could be greatly improved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edy",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T14:25:42.000Z",
          "Titre": "Easy to post, share, and check our reach!",
          "Contenu": "It is easy to post, share, and check our traffic. I would suggest include an \"all-time\" traffic report though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Lawrence",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T14:35:15.000Z",
          "Titre": "Very good.",
          "Contenu": "So far so good.  I am still having a problem getting my podcast on Google.  Other than that I am very pleased."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Anne UT",
          "Nb_Reviews": 10,
          "Date": "2023-03-02T19:56:13.000Z",
          "Titre": "Cheap Motorcycle Transport",
          "Contenu": "Cheap Motorcycle Transport Need cheap motorcycle transport? It’s fast and reliable. Check it here: Ultimate Transport123."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Ellis",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T04:00:37.000Z",
          "Titre": "Simplicity of use",
          "Contenu": "Simplicity of use. Great price for service and it is accepted by both Apple and windows users."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-02T14:12:37.000Z",
          "Titre": "Buzzsprout is simply an excellent…",
          "Contenu": "Buzzsprout is simply an excellent platform.  I wish the podcaster’s website had more features and customization, but that’s a small grip on an otherwise amazing platform!"
        },
        {
          "Note": 4,
          "Lieu": "DO",
          "Pseudo": "Ellaes",
          "Nb_Reviews": 2,
          "Date": "2023-04-11T01:23:32.000Z",
          "Titre": "Really easy to use!!!",
          "Contenu": "Really easy to use!!!I'd like to see more support on promoting the podcast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T13:51:39.000Z",
          "Titre": "Great customer service and response",
          "Contenu": "Great customer service and response. Easy to use platform. I wish I could pause and not pay but that’s about it."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Nooit Meer Kater Cast",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T18:53:10.000Z",
          "Titre": "Understandable instructions",
          "Contenu": "Understandable instructions, great possibilities for platforms and up to date stats. Keep up the good work."
        },
        {
          "Note": 4,
          "Lieu": "LU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T15:06:36.000Z",
          "Titre": "Great but could be fantastic",
          "Contenu": "Great host but I was expecting more stats. For example, time hear on first click, rankings in category, etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jodi Silverman",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T17:06:58.000Z",
          "Titre": "New and Just starting",
          "Contenu": "I'm not really sure how to rate as I just started using Buzzsprout and I have a company who is doing my uploading, however, so far the communication has been exemplary."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Vincent",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T10:47:25.000Z",
          "Titre": "Only thing missing is...",
          "Contenu": "Only thing missing is fade in and out with dynamic content"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T13:33:34.000Z",
          "Titre": "I think buzzsprout is great and easy to…",
          "Contenu": "I think buzzsprout is great and easy to use! I do think that it glitches sometimes and crashes when I talk to guests which I do not like."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T08:15:58.000Z",
          "Titre": "It is so easy to use and get your…",
          "Contenu": "It is so easy to use and get your podcast out into thee world. The pricing is also amazing."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Teddy Moen",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T10:02:40.000Z",
          "Titre": "Good tool",
          "Contenu": "The tool has Veen Very helpful for us in making our podcast."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T08:03:37.000Z",
          "Titre": "This newbie is happy",
          "Contenu": "Thanks for a great service to host my podcast, all your resources helped get my podcast up and put"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Arnav Kapur",
          "Nb_Reviews": 10,
          "Date": "2023-03-07T09:48:25.000Z",
          "Titre": "nice and easy to use",
          "Contenu": "nice and easy to use, good interface, a bit expensive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T HOPKINS",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T02:39:45.000Z",
          "Titre": "Buzzsprout Highly Recommended",
          "Contenu": "Buzzsprout has an easy UI to navigate & upload podcasts to. It is also linked to several other podcast platforms. The customer service is cordial & helpful. I would recommend Buzzsprout to all podcasters."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaime Snell",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T14:25:04.000Z",
          "Titre": "Reliable and trustworthy",
          "Contenu": "Reliable and trustworthy. Easy to use and affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tavern Stories",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T14:11:43.000Z",
          "Titre": "I love how easy this is",
          "Contenu": "The process is so easy to upload, process, edit show details and post. Also love the analytics offered. There are still features I haven't begun to explore but Buzzsprout has covered the bases and then some for this fledgling podcast."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T05:57:13.000Z",
          "Titre": "Buzzsprout is super easy to use.",
          "Contenu": "Buzzsprout made the whole process of setting up and hosting a podcast super easy. Everything is there and even someone who isn't super techy, like myself, can do it without trouble."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Making of Me Podcast",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T16:52:20.000Z",
          "Titre": "Buzzsprout makes podcasting easy",
          "Contenu": "Buzzsprout is user-friendly and has everything in one place for finding our statistics and seeing how well our podcast is doing. It’s easy to upload and to change an episode. The platform is easy to navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "curtis jackson",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T06:38:29.000Z",
          "Titre": "If you are blind I reccomend Buzz Sprout as a podcast host",
          "Contenu": "The accessibility of the product for screen readers and great customer service"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Richard Perry",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:43:12.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, friendly service. With a sense of humour."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel, Becoming MindStrong",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:52:51.000Z",
          "Titre": "Absolutely love Buzzsprout",
          "Contenu": "Absolutely love Buzzsprout! We’ve used them for our podcast for years now and can’t imagine ever leaving. 10/10 recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T23:08:43.000Z",
          "Titre": "Very user friendly!",
          "Contenu": "As a new podcaster, Buzzsprout has made the process so easy. I have reached out with questions that have been answered right away. The youtube videos have been such a huge help. Also, the facebook community has been a wealth of information. All my concerns with feeling overwhelmed with podcast have been put to ease."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T21:21:02.000Z",
          "Titre": "Easy system to use",
          "Contenu": "Easy system to use, fair price to host the podcast.  Overall, couldn't be happier with Buzzsprout."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Warriors Sword",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T15:06:09.000Z",
          "Titre": "no complaints",
          "Contenu": "Setting up our new podcast was made easy and that was important to me.  In a short period of time, we were connected to 14 outlets, 13 of them free through Buzzsprout.  I have no complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Winking Kat",
          "Nb_Reviews": 4,
          "Date": "2023-09-01T19:32:31.000Z",
          "Titre": "Posting a new episode is simple & user…",
          "Contenu": "Posting a new episode is simple & user friendly. I like to  block out chapters & that is also very easy to do.  Also appreciate the way Buzzsprout facilitates connecting my podcast to so many platforms & networks."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Guillermo",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T18:04:36.000Z",
          "Titre": "Great service",
          "Contenu": "We've been using Buzzsprout for three years and we're very happy with the service. Perhaps the only disadvantage I see is that if you don't use all your allotted time one month you lose it, even if you need it the following month, which means that you actually have to pay extra for the same service. That being said, prices do seem reasonable, so it's not a big inconvenience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CenLAw",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T16:03:33.000Z",
          "Titre": "Everything about this website is…",
          "Contenu": "Everything about this website is amazingly easy! We had no problems getting our podcast up and running in no time and getting add-ons was literally a click away! Setting up monetization was the easiest part and we’re really excited to keep this going!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Libby",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T05:19:48.000Z",
          "Titre": "So simple to use! Perfect for beginners who look to advance their learning and skills",
          "Contenu": "I’ve been using Buzzsprout for a couple of months for my podcast and it has been amazing! It helped me learn more about how to improve my podcast and my podcasting skills. It’s so easy to use, which I appreciate so much because I work a lot of hours on my podcast and Buzzsprout has made releasing my episodes, simple and fast! Love it and will use it for as long as possible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Family History Drama Podcast",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T00:12:02.000Z",
          "Titre": "There is no comparison to Buzzsprout ❤️",
          "Contenu": "I have always been treated like an only customer at Buzzsprout. I refer everyone in need of a podcast host that way without hesitation. I have never had anyone respond so quickly to my silly questions, nor have I ever imagined as much creator support through the website, emails, the BuzzCast podcast, or the amazing twitter interaction. I have nothing but glowing praise for all things Buzzsprout."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott from Copology",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T16:34:54.000Z",
          "Titre": "I just started a podcast with a fellow…",
          "Contenu": "I just started a podcast with a fellow instructor/retired police officer. The ease of uploading our content coupled with the stats that Buzzsprout has provided keeps us up on how we are doing. I also like the helpful information on expanding our podcast to more people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billy Mellick",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T20:14:52.000Z",
          "Titre": "Very contented!",
          "Contenu": "I truly did not know where to go to what to do to start a Podcast; only the desire to make one. I had the necessary equipment but knowhow to use it, so I started researching podcast companies. After looking into many avenues, I chose Buzzsprout. Buzzsprout made it simple to navigate their system and upload episodes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristen Alanah",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T15:24:17.000Z",
          "Titre": "Buzzsprout is such a user-friendly…",
          "Contenu": "Buzzsprout is such a user-friendly platform to use that I've enjoyed for over three years now. It simplifies the hosting element of starting a podcast. The weekly reports of how many listens and the celebrations when you hit milestones are super fun to receive."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dylan Knight",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T08:03:09.000Z",
          "Titre": "Very Impressed!",
          "Contenu": "The set up was really easy and customer support responded quickly, promptly and professionally when I did have an issue.  Which wasn’t even an issue, just me being an idiot! As I only launched my podcast this year, I found the “How To….” Guides really useful! I’m really impressed with Buzzsprout and I’m glad I picked them to be my host platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kala Lundgren",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T18:43:27.000Z",
          "Titre": "Great hosting platform",
          "Contenu": "Buzzsprout has been a great tool for managing my podcast. It is easy to set up, simple to use, and you can get great analytics information. I love the weekly performance of my new episodes that they send to me in my email. They also have a great informational newsletter full of helpful tips. Finally, I love being able to tag them on social media to share our successes, and they will reshare or comment a little congratulations; it feels very personal and special.Buzzsprout is a great way to host your podcasts, give it a shot!"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Luis Sandoval",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T15:26:45.000Z",
          "Titre": "Your proactivity keeps me stimulated",
          "Contenu": "My relationship with you keeps me stimulated with the reminders, with the topics, the articles. To be honest I usually do not read or hear the podcast that you suggest but just the topic you propose is stimulating to me.I like the platforms in general, it gives me much more of what I even imagine. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neill",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T15:52:25.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, feedback great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Calio",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T21:39:23.000Z",
          "Titre": "Buzzsprout was so helpful in starting a podcast",
          "Contenu": "Buzzsprout was extremely helpful for someone like me who is just learning on how to do a podcast. I appreciate their videos, and their encouragement to help me polish my craft. I also love their weekly reviews and their celebrations when I reach a milestone with either episodes or viewers."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Find Your feet - Ajay Bakshi",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T06:45:30.000Z",
          "Titre": "Excellent platform",
          "Contenu": "Excellent platform, very user friendly and makes my job lot more easier to just focus on content, distribution headaches are smoothly taken care by Buzzsprout. Thanks a ton Buzz team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Shelton",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T21:40:09.000Z",
          "Titre": "Overall my experience has been very perpetually awesome.",
          "Contenu": "Overall my experience has been very productive with Buzzsprout. When I have needed assistance it was usually due to program ignorance on my part, but in those conversations I was assisted without hesitation. The platform is easy to use and makes some good recommendations in terms of logo design software (Canva). I have made more than 300 in less that 8-months so that software is definitely a great recommendation. I can't say enough about how quick the service is when requested. And as one might suspect the long I use Buzzsprout the less mistakes I make which leaves me more time to add to my Podcast audio library. You guys have been great. Thanks and I look forward to many more messages and followers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T14:36:53.000Z",
          "Titre": "Wonderful experience",
          "Contenu": "Buzzsprout has been amazing so far with hosting my podcast. Their platform makes everything easier like submitting my podcast to different directories and creating my website. The stats are clear to understand and I enjoy checking them as I watch my podcast grow. I really appreciate all the resources they have to learn anything about podcasting. From videos to articles, it's all there for their customers and was a tremendous help when I first started. The price is definitely worth all the resources they provide. Overall, I've had a wonderful experience."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Adriana",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T16:07:27.000Z",
          "Titre": "The support team at Buzzsprout is very…",
          "Contenu": "The support team at Buzzsprout is very efficient and quick to respond to any issue or question we've had.  The platfor is very easy to use for someone that may not have experience with podcast platforms."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alain D",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T13:01:49.000Z",
          "Titre": "I came back to Buzzsprout because Of…",
          "Contenu": "I came back to Buzzsprout because Of it’s ease of use, AI tools and analytics."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Christen N. James",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T20:14:55.000Z",
          "Titre": "Podcasting made easy",
          "Contenu": "I have been using Buzzsprout since I launched my podcast in 2021, and I quite enjoy it. It took a lot of the guesswork out of managing a podcast. They made it easy to connect to all the directories, it's affordable, user-friendly (uploading, scheduling, editing, adding tags etc) and has great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Onilda",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T22:19:38.000Z",
          "Titre": "Had no clue what I was doing until I found Buzzsprout",
          "Contenu": "As a podcaster (that at the beginning had no clue as to how to do everything podcast related), I’m very happy with my experience with Buzzsprout. I learned a lot.  The website is very user friendly and the price is reasonable. Thanks for doing such a great job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A Quick",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:29:33.000Z",
          "Titre": "Buzzsprout is easy to use",
          "Contenu": "Buzzsprout is easy to use - from creating podcasts, to uploading them, to getting them added to podcasts directories. They provide excellent articles and tutorials. I highly recommend using Buzzsprout when launching a podcast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dani Giddens",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T20:34:54.000Z",
          "Titre": "BuzzSprout thinks of it all!",
          "Contenu": "BuzzSprout thinks of it all! Starting a podcast was so easy because all the logistics were clearly outlined. Love the extra articles, YouTube videos and support for anyone starting up or wanting to up their podcast game!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TheUglyQuackingDuck",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T16:52:11.000Z",
          "Titre": "Good Overall",
          "Contenu": "I have had very good overall experiences with Buzzsprout. I am happy with the ability to upload my podcasts and make a visual soundbite quickly. Now that they have put a support button on each episode, I really feel it is helping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Coach Karlita",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T15:25:25.000Z",
          "Titre": "It was such a good experience from the…",
          "Contenu": "It was such a good experience from the beginning with porting my podcast over. Also how the flow was with uploading and putting in details of the podcast. And also all the information buzzsprout would send us to keep improving as podcasters. Great Resources!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T01:33:48.000Z",
          "Titre": "Buzz sprout makes it super easy to…",
          "Contenu": "Buzz sprout makes it super easy to create a podcast. It provides the tools and platforms to send the audio out into the world. The AI is fabulous in creating titles and summaries. A plus buzz sprout!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Roland BC",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T11:25:08.000Z",
          "Titre": "My first time using a Podcast hosting…",
          "Contenu": "My first time using a Podcast hosting service and Buzzsprout have provided a seamless service. Got the files up and out very quickly, and its a very easy to use and understand interface. I have only good things to say about Buzzsprout"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toni",
          "Nb_Reviews": 3,
          "Date": "2023-04-01T15:12:24.000Z",
          "Titre": "Simply amazing!!!",
          "Contenu": "When my daughter and I looked for a platform for our podcast that possessed positivity and integrity, Buzzsprout was all that and more! The app is easy to navigate and is user friendly! The material is relevant and extremely helpful! Thank you Buzzsprout; you are second to none!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T17:33:50.000Z",
          "Titre": "It is an amazing platform that helps…",
          "Contenu": "It is an amazing platform that helps you reach multiple audiences simultaneously which is extremely helpful when trying to mange time.  Thanks to Buzzsprout I have many new viewers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T13:21:15.000Z",
          "Titre": "My experience is rewarding",
          "Contenu": "As a long time consumer on buzzsprout my experience has been very good with customer care and the service. Prompt response, and fixing issues that arise after I call in. I will forever be a customer of this platform."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T07:20:09.000Z",
          "Titre": "I appreciate the experience of having…",
          "Contenu": "I appreciate the experience of having my podcast at buzzsprout. Not only is it is great service to get my podcast out to all the platforms and make it sound good. They also had a great intro on how to start and create a successful podcast. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ScooterAZ",
          "Nb_Reviews": 3,
          "Date": "2023-04-05T15:46:26.000Z",
          "Titre": "The ease of utilizing the site and…",
          "Contenu": "The ease of utilizing the site and uploading my content. It is annoying and challenging trying to navigate Apple podcast. I’ve filled out l paperwork since late January and no answers from them. Trying to connect with an actual person to resolve it has been ineffective."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "podcast host",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T14:36:21.000Z",
          "Titre": "Having done podcast many moons ago…",
          "Contenu": "Having done podcast many moons ago doing everything manually makes podcasting a fun and enjoyable experience. The best part it is 100% user friendly that makes you a professional podcaster in the media arena."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T00:04:09.000Z",
          "Titre": "Buzzsprout makes starting a podcast easy.",
          "Contenu": "Buzzsprout helped me take my idea of a podcast a reality by giving me the tools I needed to get it done. It also distributes my podcast to all the major sites, saving me time and lots of trouble. I love Buzzsprout!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MrsJackie Cox",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T16:55:14.000Z",
          "Titre": "I love the co host AI",
          "Contenu": "I love the co host AI! Although you have to tweak the transcript and the description a tad bit it’s a big help! And the distribution to major podcast apps is amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Get Sober with Me_Podcas",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T13:12:20.000Z",
          "Titre": "Buzzsprout is easy to use for anyone…",
          "Contenu": "Buzzsprout is easy to use for anyone new to the podcasting experience. Tons of features to help you sound your best. Getting your podcast on all platforms is so easy to do"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trisha Walker",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T20:23:22.000Z",
          "Titre": "Very user friendly, easy to get launched & our website looks amazing!",
          "Contenu": "Their process from researching best practices of doing a podcast, how to properly set it up, and even their step by step process from beginning to end was very user friendly and easy to understand.  I would highly recommend Buzzsprout to anyone wanting to start a podcast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T00:21:01.000Z",
          "Titre": "Amazing after a year of use",
          "Contenu": "It has been a full year using Buzzsprout and I have absolute zero complaints. I did have to email support a couple times, but they were very quick to find a solution. A+ experience and well worth it."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Gaynor Turner",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T08:18:56.000Z",
          "Titre": "I have had a great experience with Buzzsprout",
          "Contenu": "I have had a great experience with Buzzsprout, as it is so straightforward and clear to use - super user friendly, and there is so much information to help you with anything you need. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T15:44:00.000Z",
          "Titre": "I'm grateful for so many things…",
          "Contenu": "I'm grateful for so many things Buzzsprout has to offer. Great sound quality, fast upload speeds, great Stat helps! Keep on doing what you're doing!"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Natasha Ward",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T12:58:08.000Z",
          "Titre": "The design of Buzzsprout is very easy…",
          "Contenu": "The design of Buzzsprout is very easy to maneuver, it is simple to understand.  All the technical work is already done by administration, which makes it easy for the user."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Tackett",
          "Nb_Reviews": 3,
          "Date": "2023-10-01T16:35:10.000Z",
          "Titre": "The simplest and best option for…",
          "Contenu": "The simplest and best option for podcast hosting! Great video training. Easy instructions. Excellent support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T18:41:02.000Z",
          "Titre": "Smooth",
          "Contenu": "Smooth, straightforward, with so many great features! We love using Buzzsprout for our podcast. It's made our life much easier in many big and little ways!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Queen Zoaya Counts",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T18:05:09.000Z",
          "Titre": "I love using Buzzsprout!",
          "Contenu": "I have been using Buzzsprout for 3 years, and I have no complaints. I love the many different avenues they have to help your podcast get heard. Their newsletters are often very informative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T23:42:52.000Z",
          "Titre": "All Positive From My Experience",
          "Contenu": "Overall, I think the company is great! They respond in a timely manner to every email I sent. The price seems reasonable, considering what's involved in podcasting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lennie Lawson, the car guru",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T15:02:08.000Z",
          "Titre": "Buzzsprout makes it easy",
          "Contenu": "Buzzsprout makes editing and posting a podcast a breeze. With over 100 episodes posted, I should know. Plus, the Buzzsprout community is very supportive with regard to ideas and feedback."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T21:29:22.000Z",
          "Titre": "Getting my podcast on all the platforms…",
          "Contenu": "Getting my podcast on all the platforms like apple and spotify is so huge for me! The analytics are also very useful and everything is really easy to figure out!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "G.Prins",
          "Nb_Reviews": 5,
          "Date": "2023-04-01T11:57:03.000Z",
          "Titre": "I've been using Buzzsprout for my…Podcast",
          "Contenu": "I've been using Buzzsprout for my podcast for nearly 2 years and I can really recommend them! Easy to use, good statistics, never had any problems!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T21:50:19.000Z",
          "Titre": "Buzzsprout is so incredibly easy to use",
          "Contenu": "Buzzsprout is so incredibly easy to navigate for your podcast management! The fact that it takes less than 15 minutes to get everything distributed across 12+ streaming platforms is unbelievable. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Andy Nathan",
          "Nb_Reviews": 4,
          "Date": "2023-04-03T10:40:44.000Z",
          "Titre": "Buzzsprout works really well and…",
          "Contenu": "Buzzsprout works really well and quickly.  Love the ability to create soundbites, to replace audio even when a podcast is published.  It's great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Triple B Experience",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T14:03:38.000Z",
          "Titre": "Buzzspout is great and quick for…",
          "Contenu": "Buzzspout is great and quick for getting my podcasts show out so quickly ..never had any issues with setup or displaying my podcasts ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T04:29:40.000Z",
          "Titre": "Extremely easy to get my podcast up and…",
          "Contenu": "Extremely easy to get my podcast up and running.  I thought it was going to be so much harder but with you all it’s been a breeze.  Also love how I can see the stats of how my podcast is doing so far.  Im excited for our continued use through the journey of this podcast"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Carlo",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T13:11:43.000Z",
          "Titre": "Buzzsprout is great",
          "Contenu": "Buzzsprout is great. Easy to use interface, solid stats, great customer service! Strongly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T00:39:06.000Z",
          "Titre": "Super easy to use!",
          "Contenu": "The website was easy to use - especially for someone brand new to podcasting! It was easy to get it set up and listed on all the leading apps!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "CMTrading",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T11:53:26.000Z",
          "Titre": "Amazing tool i use it daily and see results",
          "Contenu": "Buzzsprout giving me the tools and distributes my podcast to all the major sites, saving me time and lots of trouble. You the best  #CMTrading Buzzsprout!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheapwinefinder",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T19:47:35.000Z",
          "Titre": "Buzzsprout delivers exactly what they…",
          "Contenu": "Buzzsprout delivers exactly what they promised. Integration with WordPress is simple. Our downloads increased 10x in the first month over are previous podcast host."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer O.",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T13:45:24.000Z",
          "Titre": "Great Tools and Support",
          "Contenu": "I love Buzzsprout for how easy their site is to navigate and use and how supportive the team is. I have no idea why anyone would host with anyone else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AE Reyes",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T21:58:40.000Z",
          "Titre": "Excellent for beginner and expert podcasters",
          "Contenu": "Excellent. Would recommend Buzzsprout for all podcasters. Very user friendly with features that’ll enhance the quality of your podcast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARIANNE",
          "Nb_Reviews": 4,
          "Date": "2023-04-12T23:10:12.000Z",
          "Titre": "I love the amount of resources…",
          "Contenu": "I love the amount of resources available for podcasters. That was the main reason I chose buzzsprout has our hosting service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "The Lonely Triathlete",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T23:21:33.000Z",
          "Titre": "So easy",
          "Contenu": "So easy! Everything you need in one place. I was up and running very quickly and have so enjoyed the ease and affordability of podcasting to a global audience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacey Puryear",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T11:55:46.000Z",
          "Titre": "The quick and helpful response",
          "Contenu": "The quick and helpful response. Buzzsprout takes the time to genuinely address my situation and offer a solution. That’s why I chose Buzzsprout."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CCandNJguy",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T16:00:28.000Z",
          "Titre": "Buzzsprout makes it easy",
          "Contenu": "Buzzsprout makes it easy. walks you through the steps. Helps you get your podcast going. We are on our eleventh episode going on twelve. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T10:51:45.000Z",
          "Titre": "Really good platform to use for…",
          "Contenu": "Really good platform to use for Pidcasting, wouldn't look elsewhere. The traffic we have within 2 years is immense"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "REVIVAL in / Podcast",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T00:38:44.000Z",
          "Titre": "Great for new podcasts!",
          "Contenu": "Buzzsprout has worked well for us with starting a new podcast over the last couple of years. It is easy to use and affordable. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Samuel Joseph Hill",
          "Nb_Reviews": 2,
          "Date": "2023-07-08T18:57:59.000Z",
          "Titre": "Works perfectly and everything is easy…",
          "Contenu": "Works perfectly and everything is easy to navigate. I’d highly recommend it to anyone wanting to start podcasting 💯"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KJ",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T00:38:42.000Z",
          "Titre": "Buzzsprout makes podcasting so easy and…",
          "Contenu": "Buzzsprout makes podcasting so easy and affordable! For content creators just starting out or looking to branch into new industry Buzzsprout has all tools you need."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Sabina Pinzan",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T12:15:03.000Z",
          "Titre": "Super friendly and easy to use",
          "Contenu": "Super easy to use and really like the stats and achievements which allow to see how well the podcast is doing."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ruchir Thakkar",
          "Nb_Reviews": 7,
          "Date": "2023-04-14T08:17:50.000Z",
          "Titre": "I recently started using Buzzsprout for…",
          "Contenu": "I recently started using Buzzsprout for hosting my podcast, and I'm loving it! The platform is user-friendly, and I was able to get my podcast up and running in no time. Buzzsprout has made podcasting a breeze! Their analytics are detailed, and the ability to schedule episodes in advance has saved me time and effort. Highly recommended! Buzzsprout has been a game-changer for my podcast. The hosting is reliable, and the integration with popular directories like Apple Podcasts and Spotify has helped me reach a wider audience. I've tried a few podcast hosting platforms, and Buzzsprout stands out with its easy-to-use interface and excellent customer support. Their pricing is also competitive, making it a great value for podcasters. As a beginner in podcasting, I'm thrilled with Buzzsprout. The step-by-step guides and tutorials are incredibly helpful, and the platform's features, such as automatic episode optimization, have streamlined my podcasting process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dorian",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T02:21:53.000Z",
          "Titre": "No Flaws",
          "Contenu": "Their customer service is great. Also, there are so many resources to help you become a better podcaster."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Goodling",
          "Nb_Reviews": 3,
          "Date": "2023-04-10T20:43:09.000Z",
          "Titre": "Highly Recommend",
          "Contenu": "Buzzsprout is easy t o use and when I have an issue, I get prompt support! I would highly recommend Buzzsprout!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Who's a Goodboy",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T15:14:14.000Z",
          "Titre": "I just started my first podcast \"Who's…",
          "Contenu": "I just started my first podcast \"Who's a GoodBoy\" and it's been so easy to use Buzzsprout and to have my podcast on multiple platforms."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T13:25:58.000Z",
          "Titre": "Buzzsprout is intuitive",
          "Contenu": "Buzzsprout is intuitive, user friendly, and just works! I’ve never had to call support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oddity Shop Podcast",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T00:25:49.000Z",
          "Titre": "Easy to use, Great Customer Service.",
          "Contenu": "Easy to use, Great Customer Service.Never had a problem uploading, checking stats, etc. The website is intuitive and easy to use. Great Customer service. Would recommend for anyone looking to get into podcasting"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T02:16:45.000Z",
          "Titre": "I love how beginner friendly Buzzsprout…",
          "Contenu": "I love how beginner friendly Buzzsprout is. The site is very easy to navigate and provides lots of podcasting tips."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Joy Truscott",
          "Nb_Reviews": 5,
          "Date": "2023-10-02T20:54:53.000Z",
          "Titre": "A new experience for me and just…",
          "Contenu": "A new experience for me and just delighted with the platform.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Glass Half Full podcast",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T10:49:20.000Z",
          "Titre": "Great company and easy to follow",
          "Contenu": "Great company and easy to follow and understand. The communication is simple and not to much. I find it simple to edit and upload my content."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Life After The Badge",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T14:57:00.000Z",
          "Titre": "As a beginner",
          "Contenu": "As a beginner, Buzzsprout has given me a nice, complete \"kit\" to get my podcast up and running. Also the tutorials are fantastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sailing Anarchy Admin",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T18:24:46.000Z",
          "Titre": "Our new podcast downloads went THROUGH…",
          "Contenu": "Our new podcast downloads went THROUGH THE ROOF so something great happened with Buzzsprout!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Family Pet Podcast",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T20:27:34.000Z",
          "Titre": "The Buzzsprout platform is very easy to…",
          "Contenu": "The Buzzsprout platform is very easy to use. I appreciate the metrics provided. The visual soundbites are great for marketing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald Borden",
          "Nb_Reviews": 3,
          "Date": "2023-04-01T15:44:11.000Z",
          "Titre": "The simplicity and speed of the audio…",
          "Contenu": "The simplicity and speed of the audio upload and the many options to choose from for sharing, are the main reasons we use Buzzsprout."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russel D",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T19:44:09.000Z",
          "Titre": "Easy, Easy, Easy",
          "Contenu": "Easy to use and super friendly features to keep track of a podcast. Great content to help further podcast growth."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Liliane Favarger Conod",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T10:47:00.000Z",
          "Titre": "I love this company",
          "Contenu": "I love this company ! They are so  reactive, helpful, easy and fun ! I 5 star recommend them !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grantley",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T04:39:32.000Z",
          "Titre": "Good value.",
          "Contenu": "Easy to use. Magic Mastering makes each episode sound professional. Many training resources. Good pricing."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "The FourWD Tribe Podcast",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T10:44:22.000Z",
          "Titre": "Makes podcasting easy",
          "Contenu": "Makes podcasting easy, good support when you need it. 4WDTribe podcast"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Carinne",
          "Nb_Reviews": 3,
          "Date": "2023-04-06T17:38:13.000Z",
          "Titre": "Excellent podcasting app",
          "Contenu": "It’s very easy to use and gives me lots of ways of keeping track of how our podcast is doing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina at Kinship Handwork",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T04:05:41.000Z",
          "Titre": "You've made it easy to get started and…",
          "Contenu": "You've made it easy to get started and getting milestone emails is always fun!"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Wissam H. Akkawi",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T19:09:01.000Z",
          "Titre": "I’m using buzzaprout for the past 2 yrs…",
          "Contenu": "I’m using buzzaprout for the past 2 yrs now, and it’s going smoothly and to my convenience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TMD Enterprises",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T23:37:45.000Z",
          "Titre": "Buzzsprout is a Great Platform",
          "Contenu": "Buzzsprout offers a great platform for me to get the word out for by Podcast."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T15:54:49.000Z",
          "Titre": "Great experience and makes podcasters…",
          "Contenu": "Great experience and makes podcasters life easier to produce."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T14:18:30.000Z",
          "Titre": "A lot of great content shared…",
          "Contenu": "A lot of great content shared regularly, easy to follow, and good support"
        }
      ]
    }
  ]
}