{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "cashforyourmac.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T04:52:40.000Z",
          "Titre": "Never got paid!!",
          "Contenu": "I never received my payment and the USPS tracking number was invalid when I tried to track it. I sent a follow up email to fix... hopefully they get back to me. If not I am out $250...!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T02:41:26.000Z",
          "Titre": "I have not receive my trade in payment…",
          "Contenu": "I have not receive my trade in payment due to PayPal hold almost 2 weeks. Really upset about process"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T16:06:40.000Z",
          "Titre": "Completed buy of MaxBook Pro at the…",
          "Contenu": "Completed buy of MaxBook Pro at the price offered. But, unusually for this business, emails went unanswered. Still, a good price for my Mac."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T00:24:51.338Z",
          "Titre": "Quick apprasial and payment, but felt low-balled.",
          "Contenu": "The service was quick, but I felt really low-balled for a flawless iMac Pro unit that I paid $6,300 for just two years ago. At least they matched what Apple was offering as a \"trade-in\" in real US dollars rather than Apple store credit. Lesson learned, don't buy fancy Apple units because they depreciate crazy fast.CashForYourMac was easier to work with than their other competitor in Florida, and I'll recommend my customers check them out instead because they are running a good operation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "O.A. Medina",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T22:34:21.000Z",
          "Titre": "Great experience but low offer",
          "Contenu": "The experience was great but I felt my offer was a bit low. Nonetheless, the process was smooth and I got my payment quick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Crown",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T01:18:28.000Z",
          "Titre": "This was not the first time I have used…",
          "Contenu": "This was not the first time I have used CashForYourMac. I am impressed by the quick turnaround time and the prices you offer. My criticism is that I spoke with a woman a couple of times to get some information. She wasn't rude but both times she rushed me off the phone and just kept on saying read what we sent you. I almost asked to speak with owner or manager. She in no way was representative of a premium experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-08T22:51:36.000Z",
          "Titre": "The experience was good",
          "Contenu": "The experience was good. You are trustworthy and do as you say. No nonsense or trickery. I don't think you offer enough but we know that when we accept your terms. At least you are honest and work very quickly, which was very appreciated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C$M",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T21:00:01.000Z",
          "Titre": "shipping label(s)",
          "Contenu": "Easy to process. They paying what they quoted from the start. So I did my job and they did theirs. The only negative because it was the Apple Pro XDR Display, was shipping labels for two major boxes had to be provided. In the beginning only one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T00:48:13.000Z",
          "Titre": "Unlike past experiences",
          "Contenu": "Unlike past experiences, This one went well. I was a bit taken back that there was a charge for getting paid by PayPal, though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-11-27T03:03:22.000Z",
          "Titre": "Didn't get the approval email..",
          "Contenu": "Didn't get the approval email... so Didn't know when it was mailed or delivered. Had to call twice"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jassy Garcia",
          "Nb_Reviews": 15,
          "Date": "2021-10-29T11:15:09.000Z",
          "Titre": "Quick response and checks were received…",
          "Contenu": "Quick response and checks were received extremely fast. Thanks a lot."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-20T08:42:29.000Z",
          "Titre": "Good deals",
          "Contenu": "Better offers and clear payment on time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Real person",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T01:24:21.000Z",
          "Titre": "Everything went smoothly and no issues…",
          "Contenu": "Everything went smoothly and no issues at all. I would def recommend to anyone. I don’t do reviews. I thought this deserved a review. I only gave 4 stars because I believe I could/should have received 100-200 dollars more for my product (spec’d up mac book pro). With that minor complaint all in all it was a streamlined process with easy to follow instructions. I will use them again if needed. Happy customer. Good customer service as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T14:15:40.000Z",
          "Titre": "The mail service was far to slow",
          "Contenu": "The mail service was far to slow, considering I was sending my most loved, working apple devices to your company that I did not know well. Once they arrived your service was quick, having analyzed my devices quickly, and cutting me a check and putting it in the mail quickly. I think that over all, you did a great job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rooster",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T22:35:57.000Z",
          "Titre": "The trade in was great in the exception…",
          "Contenu": "The trade in was great in the exception of the delays in getting the payment after the device was approved for payment. Everything else went by very quickly. However, 100 times better than Apples trade in system (aka Phobio)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Howard H.",
          "Nb_Reviews": 2,
          "Date": "2020-05-22T22:19:52.000Z",
          "Titre": "Easy trade-in process",
          "Contenu": "Easy trade-in process. However Trade-in prices sometimes lower than Apple.com trade-in prices. But Apple trade-in, you get an Apple gift card, you want to check, you have to go with CashForYourMac.com. Overall good first experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert RCM Construction",
          "Nb_Reviews": 2,
          "Date": "2020-06-11T23:34:14.000Z",
          "Titre": "The Transaction was smooth and they…",
          "Contenu": "The Transaction was smooth and they completed everything in the time frame that was noted. I just thought the laptop would be worth a little more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T01:09:58.000Z",
          "Titre": "Higher Payout Please",
          "Contenu": "I would have appreciated receiving more money for the Mac I sold to CashForYour Mac. Otherwise, it was a fantastic exchange."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "X ray",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T22:45:13.000Z",
          "Titre": "Service works well",
          "Contenu": "Well I appreciate the service. Persona, I  sure admire the business model $$ returned with a brand new trade in device, ouch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2021-04-17T09:07:44.000Z",
          "Titre": "Close enough to a fair trade",
          "Contenu": "Close enough to a fair trade. I feel it was worth more, but I realize you need to make money too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D-FromSeattle",
          "Nb_Reviews": 1,
          "Date": "2020-12-22T20:41:16.000Z",
          "Titre": "5-star for payment, 3-stars for paid delivery",
          "Contenu": "5-star for receiving payment, smooth transaction.3-star for paid delivery method using USPS.I really want to give 5-stars across the board here but I can't.  I paid $9.95 for postal service only to have the check come more than a week later (when it's suppose to be 2-day delivery) - then USPS didn't even drop off to me but instead I had to chase down the postal truck so I can get the mail!  This is not within the control of cashforyourmac but for the extra paid delivery service, I'd really expect cashforyourmac to seek another courier.  I've never used this company before.  But after having securely packaged my laptop and sent down to SanDiego, I waited.  I sent out the laptop 5pm on Nov 27 and I received my check in hand (after chasing down the mail man) on Dec 14.  This was during the holiday so most likely couriers were very busy.Overall I will HIGHLY recommend cashforyourmac because they are honest and very professional.  I did not have to contact them at all and everything was done according to their guide.  I am very pleased and the price was reasonable.  Much more so than local sale.  If you are seeking to sell your apple products, this would be the place to go!  The only issue I had was spending the extra $9.95 (2-day delivery method) only to have USPS muck everything up.  If not for this hiccup, I would rate this company 5 stars for everything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:45:59.000Z",
          "Titre": "My item was inspected promptly and the…",
          "Contenu": "My item was inspected promptly and the check arrived in a very reasonable amount of time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D. Martin",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:32:20.000Z",
          "Titre": "Payment was fast and easy",
          "Contenu": "Payment was fast and easy. Recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T01:53:07.000Z",
          "Titre": "Best prices on internet on a consistent…",
          "Contenu": "Best prices on internet on a consistent basisGreat job of communicating during processHold true to their quotePrompt payment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosie C",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T19:04:49.000Z",
          "Titre": "Seamless experience!!",
          "Contenu": "Seamless experience!!! the quoted price was the amount I received AND the highest quote. keep in mind my computer was kept in pristine condition (screen protector, external case, keyboard cover, etc.) and they didn't try to swindle me from my quoted price. I was paid out via PayPal aware of the processing fee but still content to proceed with the offer. I will use them again because of the 5-star experience (great communication, reminder emails, and amount of time given to ship out the item)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SG",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T00:20:08.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Fast and easy! Local shops would give extreme low ball offers, and lie to your face that your item is not valuable. CashForYourMac skips the nonsense and is straightforward with reasonable offers. I will be using their service again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonius",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T18:47:54.000Z",
          "Titre": "Quick and easy transaction",
          "Contenu": "Quick and easy transaction. Submitted my info, shipped my computer in and it was verified within a day or so. Check arrived a couple of days later. Glad to see an honest company operating today."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Peter Smyth",
          "Nb_Reviews": 5,
          "Date": "2023-11-21T19:24:15.000Z",
          "Titre": "Quick, reliable, and  excellent value",
          "Contenu": "The offer and what I got were the same and higher than Apple or SYM.  Quick turnaround.  I will use them again and recommend them to others"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julian G.",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T20:45:37.000Z",
          "Titre": "Great Service, Fast Payout",
          "Contenu": "Great service, easy to use and the payout was very quick, would definitely use them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T12:15:22.000Z",
          "Titre": "True Meaning of Hassle Free",
          "Contenu": "True Meaning of Hassle Free1- Sent Laptop2- Received Delivery Email3- Check confirmation4- Check in the mailSimple as thatMy bank gave me issues, General Manager at cashforyourmac contacted me personally and we solved it in 15 minutes!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 4,
          "Date": "2023-06-10T21:13:31.000Z",
          "Titre": "Easy. Most $$$ for my MBP.",
          "Contenu": "When I originally sent in my MBP, it had a RAM issue. CashForYourMac returned it to me at no cost. After I had Apple repair it, I sent it back to CashForYourMac. I quickly received payment, which far exceeded what other resellers, including Apple, offered for my MBP. Very easy. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T00:59:11.000Z",
          "Titre": "Definitely recommend, all around good experience",
          "Contenu": "Appreciated the very clear process and instructions for shipping, etc. I felt the price was very fair compared to current retail pricing and it being significantly higher than a similar company I checked first. Also, the whole process was fast, including receiving the check!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Moore",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T20:35:44.000Z",
          "Titre": "FAIR OFFERS...",
          "Contenu": "It is great to know there is a company that rewards customers with FAIR OFFERS for their used electronics. The BIG NAMES take advantage of LOYAL customers with offers less than half of CFYM. CashForYourMac does the right thing and I appreciate it...I WILL BE BACK!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Chibuike Ibedu",
          "Nb_Reviews": 4,
          "Date": "2023-10-28T19:34:44.000Z",
          "Titre": "Quick and easy transaction",
          "Contenu": "Quick and easy transaction. Submitted my info, shipped my computer in and it was verified within a day or so."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T20:36:12.000Z",
          "Titre": "This place is great",
          "Contenu": "This place is great. This is my 4th or 5th transaction with them. Prompt inspection and payment when they receive it. And most importantly, no funny business regarding value after you've sent your item in like I've had with another company. I will continue to use CashForYourMac."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T22:22:04.000Z",
          "Titre": "Easy & Good Value",
          "Contenu": "Easy, good value. Sold a two year old MacBook Pro for a decent value, slightly more than everywhere else I checked.Allows for selecting options like memory and storage size that affect value. Will use again if needed.Suggestion: They should update instructions for packing to include the option for FedEx’s laptop box. It cost me extra $ but it was its a well designed box for sending laptops and accessories without worry of damage and I believe it supersedes the packaging requirements they (CashForYourMac) state. Better yet if they worked out a deal with FedEx to include that box when someone sells to turn it could be part of the whole deal and cost less $ for the box from higher volume usage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DBowen",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T23:18:38.000Z",
          "Titre": "Honest estimate",
          "Contenu": "Wanted to sell a Mac Mini that was less than a year old. Went through a few easy steps and received an offer from CashForYourMac. When I sent the Mac in, the final price was exactly what they offered. This is far superior to the last time I used the Apple-recommended purchaser, who decided that my computer was worth $1,000 less than their estimate. I appreciate honest business practices and CashForYourMac does that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Delvin",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T21:26:15.000Z",
          "Titre": "Smooth Transaction",
          "Contenu": "Honestly, no complaints. Submitted my machine (condition, type, etc), got a quote and shipped it. Payment happened fast. Package to them deliver Friday and payment made Monday. You could get a bigger rate selling your stuff privately but the convenience is really nice here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 2,
          "Date": "2022-07-02T16:49:09.000Z",
          "Titre": "Excellent experience with…",
          "Contenu": "Excellent experience with CashForYourMac.They quoted a fair price for my Apple Watch 5, and sent me a FedEx mailing label.  I dropped my package off at a FedEx drop box and a few days later my watch had been inspected and payment approved.  I got a check in the mail within 4 days.I would definitely do business with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Z",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T20:54:11.000Z",
          "Titre": "Glad I found this place!",
          "Contenu": "Found this site doing a google search of my monitor, LG Ultrafine, and found they would buy it back at a pretty fair price. Emailed Customer service and asked them questions about shipping the unit back and they were very helpful and prompt with a response. Very smooth and easy process from start to finish. Was just like returning a package. Would recommend CashForYourMac to anyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittny Thompson",
          "Nb_Reviews": 2,
          "Date": "2022-01-18T23:39:00.000Z",
          "Titre": "Great & Reliable Company",
          "Contenu": "This process was super easy from the beginning. After shopping around for places to sell my used MAC to, I came across Cash For Your Mac. They gave me a pretty good and comparable quote, they provided me with a shipping label immediately, inspected my laptop in a timely manner and immediately issued the cash payment to my PayPal. They communicated with me every step of the way and in my case, a few extra steps were needed. I highly recommend this company and would definitely do business with them again in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary McGhee",
          "Nb_Reviews": 2,
          "Date": "2022-11-10T21:38:49.000Z",
          "Titre": "My experience with CashForYourMac was great!",
          "Contenu": "My experience with CashForYourMac was great--quick, straightforward, and smooth.  Their instructions were clear and easy to follow.  The process for getting an estimate on the current value of my MacBook was simple.  Shipping it to them was easy.  When they got it, they checked it out promptly and paid me the full amount of their estimate.  I would definitely use them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Rogers",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T23:57:55.000Z",
          "Titre": "Quick and legit …!!! Highly recommend",
          "Contenu": "I have sent over 7 items to cash for mac at first like everyone else kinda nervous so I tried to send just one and boom smooth transaction!! So sent my last 6 items and they gave me exactly what was quoted!! Mind you this has all been within the last two weeks checks came the very next day as requested!! They are #Dopedopedope! Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T19:29:56.000Z",
          "Titre": "Positive, seamless experience",
          "Contenu": "I sold my Mac Desktop to CashForYourMac and had a very positive, seamless transaction. They provided an online quote and shipping label. Within 2 weeks I received a response that the quote was honored in full and then I received a check in the mail the following week. Overall, a great selling experience!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Allen Lsy",
          "Nb_Reviews": 1,
          "Date": "2021-12-03T21:42:07.000Z",
          "Titre": "I sold my mac machine to…",
          "Contenu": "I sold my mac machine to CashForYourMac. The whole transaction was smooth. Worth to mention that when I sell my machine, I have all original box and accessories, just cleared all my data without re-installing the system. I left a note of my username and password. That's it. I received the confirmation in around 4 days that I'm going to get paid for the quote price. I received the check by mail in another 3-4 days. In the process I also emailed them for some questions, and they responded in hours. Super cool"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Avi",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T18:56:32.000Z",
          "Titre": "Amazing Experience",
          "Contenu": "Great price for trade-in, even better experience with customer service, and overall amazing experience. I decided to sell my MacBook Pro to CashForYourMac I believe 3 weeks ago mainly because they gave me the best price, and the whole process was extremely streamlined - they provided me with the shipping label and I went to the Fedex store and got it packed in a box then shipped it over.I mailed out my MacBook on June 16th from NJ, and they received it in only four days, then sent my payment only two days after on June 22nd. The customer service was extremely friendly and addressed my concerns immediately. Overall, the process was very easy and much easier than selling the laptop on my own. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R A H",
          "Nb_Reviews": 5,
          "Date": "2022-02-10T02:14:57.000Z",
          "Titre": "My Second Time",
          "Contenu": "This is my second time using CashForYourMac and will not be my last. They offer the highest prices for previously owned Apple equipment bar none! Inspections are fast and accurate, communication with their customers is on point and payments are sent quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corporate lady over",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T20:17:25.000Z",
          "Titre": "MacBook Pro Not for meI could…",
          "Contenu": "I bought a MacBook Pro thinking I could learn. Unfortunately Microsoft for laptop was really what I needed.  My Mac was 2019 but in exceptional condition. Cash for Mac paid me $$$. This was more than enough to buy my new Lenovo. So pleased.  Seem less processing that was as expected. So easy!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MikeP",
          "Nb_Reviews": 5,
          "Date": "2021-12-18T03:03:37.000Z",
          "Titre": "Awesome trade-in experience",
          "Contenu": "Awesome trade-in experience! Be sure to check your junk/spam folder if you don’t receive any email updates. I emailed their customer service and they were super nice and let me know that my trade in was accepted for the full value! Received my check within a week of the deice being delivered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T23:45:33.000Z",
          "Titre": "Very positive transaction",
          "Contenu": "Very positive transaction. Got a little more money then expected and everything was quick and easy. My only complaint is that PayPal held the money for 21 days before releasing. This is 100% on PayPal, but it might be worthwhile to mention as a possibility when selecting PayPal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rich345",
          "Nb_Reviews": 3,
          "Date": "2023-02-09T03:15:52.000Z",
          "Titre": "I highly recommend CashForYourMac.",
          "Contenu": "I have sold several used Macs to CashForYourMac. They have always paid me 100% of quoted offer within a few days of receiving my shipment. I highly recommend CashForYourMac to anyone looking to buy or sell a used Mac."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-04-18T22:34:56.000Z",
          "Titre": "Very smooth transaction",
          "Contenu": "Very smooth transaction.  After filling out the questionnaire, I received a shipping label and shipped it to them.  Only a few days after they received it, I received an email stating that my iMac qualified for \"flawless\" and about a week later I received a check.I would definitely recommend and will do business with CashForYourMac again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evan Y.",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T03:45:35.000Z",
          "Titre": "Exactly as Described",
          "Contenu": "I sold my Macbook Pro to CashForYourMac and it was quick and easy and received the payment right after it was processed.  Everything worked exactly like it was stated on their website.  I got the quote, sent in my computer and it was processed a few days later for the quoted amount.  I would not hesitate to use this site again and I would recommend it to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald Epstein",
          "Nb_Reviews": 24,
          "Date": "2022-10-12T21:15:55.000Z",
          "Titre": "Believe The Hype!  This Place Is The Real Deal",
          "Contenu": "Since I routinely sell my Apple products on a yearly basis I have used many online sellers with mostly all positive results.This year, I found myself scratching my head when looking to sell my Series 7 Apple Watch SS.  Apple was only offering $125 and CFYM was offering over double that price.  Even comparing other online vendors I had used previously, they couldn't come close to matching the offer.So, I was a bit apprehensive about trusting CFYM.  However, thanks to the wealth of very positive reviews here, I went ahead and sent my watch to them using a prepaid FedEx label that they provided.During the selling process, CFYM kept in touch with me by email about receiving and inspecting my returned item.  Within a few short days, a check was in the mail for the promised amount.Just blown away by how smoothly the process went and you can be assured they will be the first place I look to selling my next piece of Apple equipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jonny m",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T20:30:44.000Z",
          "Titre": "First Time Using This Service, but Will Not Be the Last!",
          "Contenu": "This was my first time using this service, and definitely will not be the last.I had to take about two weeks to send in my MBP, just to make sure I had my data backed-up and the unit released from my apple ID, etc.  I was anxious that they would somehow downgrade the original quote, but they stayed with it!  Overall, the service & handling of the transaction was fast, easy, and painless!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T00:31:05.000Z",
          "Titre": "They make things so easy",
          "Contenu": "Sent them information on my 2017 iMac 27” defining the condition, they a very good offer I accepted and packed up iMac in the original box I purchased it in from Apple, and used the shipping label they gave me and sent it to them. Easy peasy, the received it agreed on the condition and sent me a check very quickly. Than You, will continue to work with them in the future!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nico B",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T04:19:52.000Z",
          "Titre": "Trustworthy, fast, nice!",
          "Contenu": "Traded in my MacBook Air M1 because I wanted a gaming laptop. Soon after sending it out I got a check for $600+! Amazing customer service, going to use them again to trade in this new iPad Mini 6 when they start accepting them! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elijha Rivera",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T01:44:13.000Z",
          "Titre": "Quick and easy process Could not be…",
          "Contenu": "Quick and easy process Could not be happier With does service provided"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Myron Marvin",
          "Nb_Reviews": 4,
          "Date": "2023-04-14T19:34:02.000Z",
          "Titre": "Pays in full!!",
          "Contenu": "My 2019 Mac Pro carefully was cared for and the aluminum case was like new. It was from a smoke- and per- free home and I filled out the form stating that it was spotless. I also took photos. Well, Cash for your Mac accepted my rating and allowed the full cash amount. Better than some others who downgrade the bid price as a “bait and switch.” I am a happy camper!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-12-02T13:21:18.000Z",
          "Titre": "Great Experience",
          "Contenu": "I usually don't write reviews but in this case the experience was exceptional. They did everything right, communications, payment processing ( a week earlier than promised) et. al. Very well done, thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rich345",
          "Nb_Reviews": 3,
          "Date": "2021-11-02T00:36:38.000Z",
          "Titre": "Excellent Service!",
          "Contenu": "I sold my MacBook Pro 16 2019 to CashForYourMac. They sent me a prepaid shipping label which I used to send the computer. CashForYourMac sent me the full quoted amount to my PayPal account within a few days of receiving the computer. Excellent Service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RonL",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T20:45:43.000Z",
          "Titre": "Very fair pricing, doesn't try to ding 'ya",
          "Contenu": "I sent in a 2019 Mac Pro with a like-new case - not a scratch on it. As a different vendor did, I was expecting CashForYourMac to tell me that the case was NOT like new, so I took plenty of photos to refute them.Surprise! They did NOT try to ding me and gave me the price that was promised. What a refreshing way of doing business. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 2,
          "Date": "2021-11-29T22:49:21.000Z",
          "Titre": "Great business",
          "Contenu": "I have used them a couple of times now to sell my Macs and iPads. EVERY time it has been a great experience. No shinnanagins that I experienced with another similar company. As I write this I am sending in another Mac. Good value on quotes and super easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eli",
          "Nb_Reviews": 8,
          "Date": "2021-11-22T20:38:30.000Z",
          "Titre": "Easy and transparent... and a pleasure.",
          "Contenu": "The whole transaction with \"CashForYourMac\" was smooth and effortless, and from the time I first contacted them to the time it took to get paid was minimal.Moreover, the proposed price and the condition of my Mac corresponded to each other with no complication. I would highly recommend \"CashForYourMac\".... it was a pleasure to do business with them. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Farrow",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T22:21:20.000Z",
          "Titre": "great experience.",
          "Contenu": "I sold three different Mac items to cash for your Mac. I was nervous because I’ve never used this company before. They are across the country from me. I saw that they are BBB accredited so I figured I’d give them a try. Their quotes of course are way better than Apple. They beat places like Gazelle too. The process was quick. They recieved my packages and let me know via email. And within two to three days I was notified that my devices were approved for the amount quoted. Unlike some places that want to low ball you once they get your device in their possession. I would definitely use this company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T07:30:04.000Z",
          "Titre": "Well Done",
          "Contenu": "Very easy and quick process from initial online appraisal to shipping and check delivery! If you’re going to sell your computer or device this is the go to company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T18:04:15.266Z",
          "Titre": "The best place to sell Apple hardware",
          "Contenu": "The best place to sell Apple hardware! I have used them for many transactions in the last several years.Net proceeds similar to or higher than auction site, without the hassles."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AM",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T20:15:52.000Z",
          "Titre": "11/10 Experience",
          "Contenu": "Seamless process; clear instructions, and prompt pay out of exactly what was quoted. 11/10 experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pete",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T01:14:12.000Z",
          "Titre": "Always a Positive Experience",
          "Contenu": "I've bought and sold from these guys. The experience has always been positive. I will give them repeat business in the future when the need arises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Warlock",
          "Nb_Reviews": 2,
          "Date": "2021-11-16T06:26:10.000Z",
          "Titre": "Brilliant.",
          "Contenu": "The whole process was smooth as a whistle. No nonsense, clear instructions, timely responses, fantastic prices. I'd recommend CashForYourMac to anyone looking to sell their Apple products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave B.",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T13:53:08.000Z",
          "Titre": "No complaints",
          "Contenu": "Sent in an iMac in flawless condition and they accepted it as such and paid me the full amount.  They evaluated it quickly and the money arrived quickly.  Would definitely use this service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 3,
          "Date": "2023-04-21T18:34:21.000Z",
          "Titre": "CashForYourMac offered me more",
          "Contenu": "CashForYourMac offered me more for my machine then anywhere else.  Easy, fast and efficient.  I was paid almost immediately after they received my computer.  Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anton Shelepov",
          "Nb_Reviews": 2,
          "Date": "2021-11-25T13:46:49.000Z",
          "Titre": "It was a perfect transaction",
          "Contenu": "It was a perfect transaction. Communication was very responsive. Got a good quote and in combination with free, insured shipping this was a no brainer. I will recommend you to all my friends and family and will be back in the future. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RJH",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:25:17.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, simple, and accurate. Very pleased with the whole experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angry, Bob",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T22:24:36.000Z",
          "Titre": "I sold two computers with this service",
          "Contenu": "I sold two computers with this service. Both computers resulted in a full payout of the estimate. The process took about two weeks start to finish.I would use again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Meyer",
          "Nb_Reviews": 5,
          "Date": "2023-05-02T02:12:37.000Z",
          "Titre": "Effortless way to gain value from used iMac",
          "Contenu": "I was very impressed with the ease of getting a purchase offer, shipping the computer, and getting a check for the estimated value. I will use CashForYourMac the next time I upgrade my computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "scotchimo",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T21:46:13.000Z",
          "Titre": "Estimate and condition were honored",
          "Contenu": "Estimate and condition were honored. Payment was prompt and easy. If you’re honest with your condition then don’t hesitate to use this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DIpakD",
          "Nb_Reviews": 1,
          "Date": "2022-07-22T18:36:30.000Z",
          "Titre": "Trustworthy and reliable for all your Apple devices",
          "Contenu": "Trustable company to provide you with a reliable service and promise on delivery Got a great quote on my MacBook ProI ensured it was provided in the condition asked and prompt payment was made on the item"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mac User",
          "Nb_Reviews": 2,
          "Date": "2022-04-29T17:20:58.000Z",
          "Titre": "Process was quick and easy",
          "Contenu": "The online estimator was easy to fill out. Communication throughout the process was excellent. Payment was quick. I have sold many items to them and will do so again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T00:42:25.000Z",
          "Titre": "Simply the BEST",
          "Contenu": "I use Cashforyourmac.com every time I need to sell my Apple products. I don’t even bother using eBay or in person markets anymore. Thanks for an awesome job every time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathryn Mann",
          "Nb_Reviews": 2,
          "Date": "2022-04-05T22:22:20.000Z",
          "Titre": "Positive experiences so far with 3 trade-ins!",
          "Contenu": "Cash for your mac were transparent about the trade in process and honored the quote they had offered, for 3 separate Apple trade-ins.  I was very happy with their service and would work with them again!They even resolved an issue with my first trade-in where the bonus coupon didn’t get applied as it should have.  They were very easy to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas T",
          "Nb_Reviews": 5,
          "Date": "2023-02-10T14:28:11.000Z",
          "Titre": "Very Professional Team",
          "Contenu": "Very clear website. You handled thereview of the computer very quickly.Payment was issued quickly. Communication on your end was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Strasen",
          "Nb_Reviews": 2,
          "Date": "2022-07-12T21:00:43.000Z",
          "Titre": "Always reliable",
          "Contenu": "I have used these folks for several years to sell my used Apple hardware. They have been consistently fair and extremely reliable. I will continue to use them in the future. They have earned my trust."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GJ MacKellar",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T15:47:06.000Z",
          "Titre": "Excellent All Around",
          "Contenu": "Better than average offer.  Did not try to lower offer after they received it and paid quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Walker",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T14:50:22.000Z",
          "Titre": "Great experience with CashForYourMac",
          "Contenu": "Great experience with CashForYourMac! I sold them three iMacs at once and it could not have gone more smoothly. Quick, easy, and they paid the most of all the companies I was shopping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark and Jean",
          "Nb_Reviews": 2,
          "Date": "2023-02-11T00:15:39.000Z",
          "Titre": "My experience was top-notch",
          "Contenu": "My experience was top-notch.  CashForYourMac offered a good price, processed my laptop quickly, and carried out payment exactly, and promptly, according to their offer.  Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T20:32:26.000Z",
          "Titre": "It was great and simple",
          "Contenu": "It was great and simple. Price received was reasonable and delivered quickly. The entire process was simple and told basically step by step."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T22:39:37.000Z",
          "Titre": "Easy and quick!",
          "Contenu": "The process was really easy, transparent, and fast. I had the box that my laptop was delivered in so all I had to do was print a label and take it to FedEx. And then about a week or so later, I received a check in the mail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 4,
          "Date": "2022-05-04T01:11:46.000Z",
          "Titre": "The Absolute BEST in Apple Resale",
          "Contenu": "These guys are the BEST in the Apple Resale business.  All paying the best price and selling competitively.  Super and timely communicators."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jake P.",
          "Nb_Reviews": 1,
          "Date": "2022-03-15T18:19:04.000Z",
          "Titre": "Easy and Fast",
          "Contenu": "Searched at least 8 different sites and CashForYourMac gave me the best price. Got paid quickly. Easy and good experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T21:45:47.000Z",
          "Titre": "Swift and easy process!",
          "Contenu": "The selling process was very well explained, hassle-free with one of the fairest offer prices for my computer. Inspection was quick and money was sent promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Eagar",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T00:17:59.000Z",
          "Titre": "This service offered me $700 more in…",
          "Contenu": "This service offered me $700 more in cash than an Apple Trade-In. That won’t always be the case, but I always check with them first. I’ve had several transactions with them, and they’ve all been two thumbs up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T20:27:36.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "Honestly I was skeptical at first but this transaction was smooth, efficient and fast. This is my new go to to sell my electronics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T04:33:18.000Z",
          "Titre": "I'll admit I had my doubts that it…",
          "Contenu": "I'll admit I had my doubts that it seemed too good to be true but it exceeded my expectations. Great service and a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark P.",
          "Nb_Reviews": 3,
          "Date": "2023-01-20T01:52:07.000Z",
          "Titre": "The best site for selling your Apple products!",
          "Contenu": "I have been using Cash for your Mac for a long time now, always paid top dollar and received my check very fast. I highly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-06-23T01:52:07.000Z",
          "Titre": "Excellent easy process I would do it…",
          "Contenu": "Excellent easy process I would do it again happy customer. Most importantly great price value for the merchandise offered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 4,
          "Date": "2023-03-24T03:19:29.000Z",
          "Titre": "No B.S.",
          "Contenu": "If you are honest about the condition, they don't change the offer after you send your item. Straightforward and simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "repeat customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T23:51:29.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Excellent experience selling two items, a 27\" iMac and an M1 MacBook Pro. Payment check was received promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marilyn",
          "Nb_Reviews": 3,
          "Date": "2023-03-28T23:27:07.000Z",
          "Titre": "I got a good price for my MacBook",
          "Contenu": "I got a good price for my MacBook.  I didn't have to wait long for payment.  Overall positive experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Andersen",
          "Nb_Reviews": 2,
          "Date": "2022-02-23T17:49:50.000Z",
          "Titre": "Really Great Customer Service",
          "Contenu": "Really Great customer service.  They were so helpful with a package snafu and even kept me up to date.  Everything in the end turned out good, but I know if there was a problem they would have dealt with it.  What an amazing experience.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Garcia",
          "Nb_Reviews": 1,
          "Date": "2022-11-05T01:37:17.000Z",
          "Titre": "At first was hesitant to send my…",
          "Contenu": "At first was hesitant to send my device, but I got reassurance by the customer service. So I sent my device and got paid immediately after inspection"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T18:45:19.000Z",
          "Titre": "Great communication",
          "Contenu": "Great communication, received notice when computer was received and next day notified of full payment, as agreed. Great process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T14:07:35.000Z",
          "Titre": "I've used CashForYourMac twice now",
          "Contenu": "I've used CashForYourMac twice now, and both times received a good price for my mac and the process was flawless from shipping to receiving my check!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T17:36:01.000Z",
          "Titre": "Fantastic Service & Easy",
          "Contenu": "The whole process was super easy and they paid me exactly what they said they would. No hassle, no fuss. I would highly recommend CashForYourMac."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T14:56:03.000Z",
          "Titre": "CashForYourMac made it so easy",
          "Contenu": "CashForYourMac made it so easy! I got a great deal on a trade-in promptly and with friendly customer service. Also, I love my new device! It is like new and better suits my current needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arthur Carter",
          "Nb_Reviews": 9,
          "Date": "2022-08-18T02:14:21.000Z",
          "Titre": "The BEST for buying AND selling used Apple Gear",
          "Contenu": "I've bought and sold Apple gear with these guys for many years and they are THE BEST. Their BUY price for used gear is usually the most anywhere. Their price for buying gear is very reasonable. And, if there are any snags in the transaction, they are there to work it out fairly. If I could give them 6 STARS, I would."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Youk",
          "Nb_Reviews": 2,
          "Date": "2022-06-18T00:45:17.000Z",
          "Titre": "Straight up simple... No Brainer",
          "Contenu": "CashForYourMac consistently offers more for the Macs I have sold and the process is straight up simple. It is a No-Brainer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T01:43:08.000Z",
          "Titre": "Easy & efficient",
          "Contenu": "They made the process easy and efficient. Transparent about how it would all. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T01:28:43.000Z",
          "Titre": "Smooth process in selling my Mac",
          "Contenu": "The process of selling my Macbook Pro went very smoothly. The price was exactly as anticipated. It only took about a week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sunny Singh",
          "Nb_Reviews": 4,
          "Date": "2022-10-15T01:31:16.000Z",
          "Titre": "This is the best company around for…",
          "Contenu": "This is the best company around for Used Apple Products.If you want to sell your current and buy a more updated one, this IS the place to go. Staff are absolutely amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DaveF",
          "Nb_Reviews": 3,
          "Date": "2022-07-27T02:49:52.000Z",
          "Titre": "Always a great experience with…",
          "Contenu": "Always a great experience with cashforyourmac. They have the best trade/sale offers.  The assessment & payment turn around is super-fast. Will continue to highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clyde",
          "Nb_Reviews": 3,
          "Date": "2022-07-16T01:24:45.000Z",
          "Titre": "Prompt processing of sale and good…",
          "Contenu": "Prompt processing of sale and good price. My second favorable experience and there will be more"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T20:19:32.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Gave me the most cash for my Mac. Would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T23:16:48.000Z",
          "Titre": "Pretty fast service",
          "Contenu": "Pretty fast service just don’t like paypal option takes to long to give access to money ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T22:51:26.000Z",
          "Titre": "They did exactly what they said",
          "Contenu": "They did exactly what they said. They paid me 100% of what they quoted, and the whole process was painless from start to finish. I hate selling my own gear to random people on the web. This was SO MUCH EASIER. Will do again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T20:00:14.000Z",
          "Titre": "It was quick",
          "Contenu": "It was quick, smooth, price was Great. I would recommend. My take in price is even better than Ebay. A+++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Calhoun",
          "Nb_Reviews": 2,
          "Date": "2022-03-08T19:36:40.000Z",
          "Titre": "Excellent experience",
          "Contenu": "This was a seamless process with selling my iMac and I’m so pleased with the stress-free nature of each step. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Cato",
          "Nb_Reviews": 4,
          "Date": "2023-09-28T15:59:42.000Z",
          "Titre": "Great experience from start to finish…",
          "Contenu": "Great experience from start to finish top notch employees and top notch pricing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron S",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T20:48:41.000Z",
          "Titre": "First I would like to say I was very…",
          "Contenu": "First I would like to say I was very concerned about this company. I have read some posts where it seemed like a scam and made me very nervous. This was the first time doing business with them. But I would like to report Cash for Your Mac was very good to work with. I was honest with them (That's a Key) and in turn they were honest with me. Everything they promised they fulfilled. I would do business with them again in a heartbeat. A++++++!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald C Basham",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T20:39:25.000Z",
          "Titre": "Perfection",
          "Contenu": "Very smooth and effortless process. Money came as quick as they said it would, and in the promised amount. It doesn’t get any better than that!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Shulock",
          "Nb_Reviews": 5,
          "Date": "2022-08-17T01:51:22.000Z",
          "Titre": "Mac sale",
          "Contenu": "Great experience. Received the quoted price on 2 IMacs. Couldn’t have expected more"
        }
      ]
    }
  ]
}