{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "cellulardata.ubigi.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "MU",
          "Pseudo": "Liene",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T05:51:08.000Z",
          "Titre": "Bad experience with Ubigi",
          "Contenu": "Its cost for us 30 euros to have access to Internet in Mauritius and simply does not work.If we will put money in trash, the result was exactly the same.Very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jenny",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:13:53.000Z",
          "Titre": "Poor Service in UK",
          "Contenu": "Unfortunately, the service availability was poor and pretty much non-existant any time we were indoors or really needed the connection to data. We used this in both central London as well as in the countryside and same issues in all locations. One star for the app being easy to use and the esim videos being helpful for first time esim user."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "An",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:05:31.000Z",
          "Titre": "Slow and unreliable",
          "Contenu": "I used Ubigi at multiple US east coast regions, but the connection was always routed to UK, which caused very bad lag (300ms+ ping). Google's search results were based on location, so all top search results became UK-based. It also caused some other apps to behave abnormally because of the UK location. When I had signal, it was usually weak and speed was slow. I ended up rely mostly on hotel Wifi. I don't recommend Ubigi (at least in the eastern US)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:05:21.000Z",
          "Titre": "Borderline adware",
          "Contenu": "Haven’t even used the service yet and already getting peppered with spam emails asking for reviews, push notifications that are nothing beyond ads, and general service ads. Desperately wish I’d gone with a competitor and day one of use is still three days away."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:21:28.000Z",
          "Titre": "I can't login Ubigi, and I passed away from Ubigi.",
          "Contenu": "I can't login Ubigi. And, when I requested to send email to remake a new password, \"this user has already been registered\" popped up. There is nothing I can do to use Ubigi! Finally, I deleted Ubigi app! Bye-bye, forever."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Vince",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T23:18:24.000Z",
          "Titre": "Bad second experience after a positive first one",
          "Contenu": "I just used Ubigi for the US after I previously had a good experience in Japan (I previously gave five stars, but i deleted that review). Unfortunately, I have to give a one star review as they are trying to convince me I used 3GB of US data in less than four hours, despite the app previously indicating I used only 60MB. My US plan overlapped with my Japan plan by one day, so I believe really what happened was both plans expired on the same day. Customer Support told me it was probably due to \"5G network overtures\" despite my network mode for the Ubigi eSim bring restricted to 4G. And I was doing usual activity that rarely uses up more than 2GB of data in a week on my 5G network in the UK, let alone a few hours! Anyway, thankfully this frustrating experience made me confirm that my UK carrier had a far superior plan for the US than Ubigi anyway, so this ended up being a complete waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T18:11:22.000Z",
          "Titre": "I had a SIM replacement done by YOU - everything goes wrong",
          "Contenu": "I had a SIM replacement done by YOU when I bought a new phone.  I bought topups twice for the SIM through the app, they never showed up. Please refund the two $20 topups and tell me how to kill this problem."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:21:25.000Z",
          "Titre": "This eSIM doesn’t work",
          "Contenu": "This eSIM doesn’t work. No signal what so ever, and son works for Apple technical support, he can’t even figure it out"
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Fei Gao",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:44:42.000Z",
          "Titre": "05.12.2023",
          "Contenu": "I paid the money. Qin's trip is about to end. China hasn't gone yet, and it hasn't tried its best to use Ubig i.I had to pay again to buy another one, which is very good and can be used immediately! I hope you can teach me how to use Ubigj normally as soon as possible. I will arrive in China for a visit on the 16th?"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:32:25.000Z",
          "Titre": "Disappointing, slow speeds, unstable",
          "Contenu": "I was immensely disappointed at how I had very poor speeds. Even though Reddit forums and my friends said their experience with Ubigi was smooth and had 5G coverage in Japan, I had LTE coverage. Sometimes, just using google maps takes forever to load and it caused me a lot of stress and uncertainty when I needed stable data the most. Also at the beginning when I touched down in Japan, it said incompatible even though I was using iPhone 12. After 2hours, somehow it worked again and I was able to have an account."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Roxy",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:47:33.000Z",
          "Titre": "The Caribbean eSIM did not work",
          "Contenu": "The Caribbean eSIM did not work. I lost 14 dollars. Tried many different ways but wasted time and money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Maria",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T07:56:24.000Z",
          "Titre": "Misleading",
          "Contenu": "Misleading. Says can be installed on Samsung S21 but it appears s21 models do not support e-sim so why listing it as compatible? If you have samsung s21 (or possibly any other samsung) check BEFORE you buy an esim card."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "A  Kabiri",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T16:19:17.000Z",
          "Titre": "Useless.",
          "Contenu": "Useless.It work on first day then stop working waste of money and time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 7,
          "Date": "2023-12-09T10:28:48.000Z",
          "Titre": "No customer service, despite writing to Ubigi numerous times on their website.  The eSIM card I paid for does not work at all!",
          "Contenu": "The company never responded to my numerous requests for help.  I am now in Morocco.  I paid Ubigi $60 for service here, and I have no service!."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T01:36:54.000Z",
          "Titre": "Terrible service with terrible speeds",
          "Contenu": "Paid for 50GB thinking I could do some work and video conferences. But no, the service was TERRIBLE. I never once got over 4Mbs down or 1Mbs up. I constantly contacted support for help but they never resolved the issue or offered a refund. Absolutely DO NOT recommend ever buying an esim for Japan unless you only plan to use it for Google maps."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Recent customer /",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:04:30.000Z",
          "Titre": "Date usage is way out of the norm",
          "Contenu": "Date usage is way out of the norm. I had to re-up 3x in a 10 day period. I checked my typical data usage with my primary provider and I typically only use a total of 3GB per month. Ubigi stated that I used 10 GB in 10 days. I was careful to connect to Wifi at hotels and restaurants but it still seemed to count any data as used data from Ubigi. I'd like to be refunded but it's not clear how to connect with their team.Response to reply: I was very careful not to watch any videos or conduct activity that would potentially use too much data. Even then, according to Ubigi, I used 3x as much data as I normally do with much more limited activity. Also, each time I was warned that I had exhausted the data, I would purchase a \"re-up\". Ubigi would not utilize the remaining data from the prior purchase and simply moved onto the next re-up amount leaving unused data on the table."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Carol",
          "Nb_Reviews": 14,
          "Date": "2023-11-17T09:52:34.000Z",
          "Titre": "Rubbish instructions",
          "Contenu": "Rubbish instructions, so unable to renew my subscription. Poor English speaking advisor didn't help.17th Nov updateThank you for your response, to clarify I managed eventually to set up an account but I still don't know how to link with my car ?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T00:25:40.000Z",
          "Titre": "1-day plan stopped working two times. Support completely unhelpful.",
          "Contenu": "Couldn't connect while the plan was still active on a 1-day plan. Purchased another plan while abroad that again was initially working and then stopped. No refund issued despite contacting the support before the first plan end."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:50:58.000Z",
          "Titre": "I paid ubigi to work in Mexico",
          "Contenu": "I paid ubigi to work in Mexico. It works rarely. It is not at all reliable . It would be nice if you can improve it.I am editing it because you wanted me to mention which streets it worked. The first day I could book Uber and then in the car it stopped working. Then next day I could not even book Uber. So my husband bought local eSIM from At&T. Last year I used ubigi in London and it worked perfect. I wish yo could make it work the same way in Mexico also."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "velobob",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T03:11:08.000Z",
          "Titre": "Dismal experience",
          "Contenu": "Dismal experience....could not tell from the app how much data I had used, and then the app stopped working at all for me....it would not let me login at all.Additionally, I was overcharged for service and could not reach any customer service for reversal of the overcharge.I would go out of my way to avoid using Ubigi and encourage others to avoid using Ubigi as well."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T01:40:34.000Z",
          "Titre": "The price was not cheap however network…",
          "Contenu": "The price was not cheap however network was bad in Tokyo Shinjuku area where we stayed and almost non existence in Disneyland. Will be trying Airalo and others in future. Probably those good reviews from others are paid to do so."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "B.V.",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T21:41:18.000Z",
          "Titre": "Stay away!",
          "Contenu": "The prices may be very attractive, but installing this esim and the app is just plain awfull. The tutorials make you think it is easy but instead you need to modify so many settings in your phone and there is no clear explanation to be found. After more than 4 hours, I finally managed to install the app, create an account but the data package I bought is nowhere to be found so my money is lost. Stay away from Ubigi!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "A Harrison",
          "Nb_Reviews": 15,
          "Date": "2023-11-10T21:55:17.000Z",
          "Titre": "Seems the app was updated but not the instructions?",
          "Contenu": "It looks like the app has been updated but the instruction videos have not, so what I was seeing on my screen (iPhone 12) did not match the video. I tried to contact support but it just said it couldn’t make contact at that time. I had already bought a month’s data package but I just had to abandon that and go with another provider, because I needed to get connected. So I just lost that money. Sorry Ubigi I know lots of people have a great experience with you but I just couldn’t connect."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Johnny",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T15:03:38.000Z",
          "Titre": "Glitch?",
          "Contenu": "My account was given a referral code and after signing up it was linked to the referrers account. I was receiving emails for the completion of their data amounts and their credit card info when they purchased more data; I was also sent their 50% off code from the referral. I can never get on to the app to check how much data I have left and it always asks for an email confirmation that doesn’t work because my email has already been used to make an account. Although all of this happened the data itself is a decent speed and connection is good even on a subway."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Alessandro CANTELLI-FORTI",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T06:54:32.000Z",
          "Titre": "unstable connection with full coverage. No answer from support.",
          "Contenu": "Connection seems unstable during the firsts days in USA. Even with full coverage it seems the roaming hangs. I had to enter and exit airplane mode several times or enter Ubigi app and wait 2minutes every 10! Using maps was a pain and had to re enable my provider roaming and spend twice. I had same issue in the past. My conference colleague with competitors installing new eSIM for every country did non have same problem. Tested with roaming on (suggested) and off (the default). Contacted twice web support but no answer in a week even in spam or other inbox (double checked). Transaction id is: SUBI9orR7jYISpq3Dsc9hshu5g"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "KHENG HOE",
          "Nb_Reviews": 4,
          "Date": "2023-11-14T23:08:12.000Z",
          "Titre": "We had problem with UBIGI in Sydney.",
          "Contenu": "We had problem with UBIGI in Sydney.Apparently the main service provider ;Optus / SingTel was down and without knowing this, we tried with my wife’ s phone and ended up with 2 contracts a that we couldn’t use!"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Wildmender",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T17:01:22.000Z",
          "Titre": "Bad Connection",
          "Contenu": "Unable to connect the the network initially, took about 25minutes before being connected, network speed is constantly at LTE and unstable, network connection drops at various points of the dayLocation: Tokyo, Japan"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Robertson",
          "Nb_Reviews": 3,
          "Date": "2023-10-09T11:12:23.000Z",
          "Titre": "Licence came to an end on 16September…",
          "Contenu": "Licence came to an end on 16September 2023 Invited me to renew which I did for one month for £9. Wont let me access my account nor has it transferred the features to my car but I have a message saying it’s extended the licence to 16 th October 2023Emailed contact address given by Cellular Data on this site to solve this problemI haven’t had a response.  !!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "qwerty",
          "Nb_Reviews": 3,
          "Date": "2023-09-14T00:26:38.000Z",
          "Titre": "I never paid for a recurring plan",
          "Contenu": "I never paid for a recurring plan, and if I did then it's because they hide it somewhere in the fine print where I couldn't see. So I've ended up paying for another month even tho I'm not in the country or going back yet. Every company prentending it's ok sign up a subscription and charge a card just because you gave the details once. Unhappy about their service options for smaller countries around the world. Nothing affordable for any Central American country."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andy Tijou",
          "Nb_Reviews": 3,
          "Date": "2023-10-12T01:09:45.000Z",
          "Titre": "Only works after a restart, be prepared to restart every five minutes",
          "Contenu": "Purchased a US sSim for my S23 Ultra for a business trip.Seems that I need to restart my phone after every period of inactivity to make mobile data work again.I had issues checking into the apartment I had booked, had to download an app to get into the room, whilst on the phone to the apartments support, did not work at this point, had to hand up and restart to to download the app.Day later still kept failing so went to a mobile store and bought a proper sim.Tried transferring the eSim to my laptop, does not seem possible, so I gave up, absolute waste of money.Tried contacting support through that app, unable to find their details, just unhelpful help pages.Would not use again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michele",
          "Nb_Reviews": 3,
          "Date": "2023-10-16T15:12:38.000Z",
          "Titre": "Zero customer support",
          "Contenu": "I had trouble installing Ubigi and tried to reach out to customer support via email and even telephone, but no one ever responded to me.  I therefore ended up wasting a 30 day plan. I would like a refund, but of course, can't get in contact with anyone at Ubigi to discuss. Re Ubigi response - I used the phone multiple times with the correct email address."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:50:50.000Z",
          "Titre": "I bought 1GB data for a month in…",
          "Contenu": "I bought 1GB data for a month in mexico. But I can't use data in mexico, Ensenada. I tried several times but doesn't work. You should fix this bug."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T08:26:07.000Z",
          "Titre": "Never connected in Taiwan. eSIM for Japan worked fine but eSIM for Taiwan never did",
          "Contenu": "Never connected in spite of hours of effort. Worked fine in Japan but never in Taiwan."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Anthony",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T23:56:15.000Z",
          "Titre": "Unable to pay through the App.",
          "Contenu": "For the last two weeks I’ve been trying to pay for a renewal to a plan I had when I first purchased my Landrover. In short, for some reason my charge cards are not accepted when they obviously should be. Unfortunately I’m unable to use Ubigi although I want to. I’m probably not the only person in this position. I’m very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T09:59:56.000Z",
          "Titre": "Zero customer support when misbilled…",
          "Contenu": "Zero customer support when misbilled for another 10gb package. Wrote to support, never heard back from them. eSIM worked but don't expect any contact from Ubigi if something goes wrong.Edit: to clarify after receiving a reply from Ubigi (funny how quickly they reply to bad reviews as opposed to queries from customers…): I originally purchased a 10gb eSIM from Ubigi. Installed it on my gf’s phone. Downloaded the app on her phone as well. A day later I needed a new eSIM myself. I mistakenly purchased a 10gb top-up from the app, thinking that it would provide a new eSIM QR code that I could scan (this is poorly clarified in the app, but I’ll accept it as my error). I immediately wrote to Ubigi customer support to ask if it was possible to refund the (unused) eSIM, or to transfer it to my phone. No response after THREE WEEKS. However, they’ll quickly respond here. The eSIM works but I recommend Airalo as their customer support is far better. Also, just a tip, avoid using snarky winky faces when replying to customer feedback ;)."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "George Moss",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T07:47:50.000Z",
          "Titre": "Careful during set up",
          "Contenu": "My fault, I have got 4 or 5 e sims in the past and 2 haven’t worked. Not sure why, I’m sure its user error during set up but I’m out of pocket and it’s not worth the effort to get the money back. It would be nice if this was easy and obvious to do."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "john mcgowan",
          "Nb_Reviews": 11,
          "Date": "2023-11-06T12:51:05.000Z",
          "Titre": "Forced Selling",
          "Contenu": "So so difficult to get this sorted. Then Range Rover dealership refused to help.It was not explained that I had to subscribe to use the features the car was sold with !!!I'll never bu Range Rover again. Nor will I buy any system that I have to \"forceably\" subscribe too.My Volvo worked by disk and I could choose whether to update or not.....NOT GET CUT OFF !!"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T23:49:14.000Z",
          "Titre": "Complicated set up",
          "Contenu": "Complicated set up. Instructions on the website are unclear. Conflicting info on how long the QR code is valid for before you install it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T16:55:41.000Z",
          "Titre": "Up a Creek",
          "Contenu": "I have used Ubigi eSim solutions in the past so I bought a Ubigi plan to use while on an 8-day river cruise in several counties in Europe, however I received no coverage whatsoever while on the cruise. I tried to contact customer support but could only send an email which was not responded to until after my cruise was completed and the response basically said to verify my phone settings. Completely dissatisfied with this product and I will not be using it again."
        },
        {
          "Note": 1,
          "Lieu": "BG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T21:36:30.000Z",
          "Titre": "There was a problem with my e-sim and…",
          "Contenu": "There was a problem with my e-sim and the support was useless. Finally I was sharing my phone internet and didn’t used the service at all. At last day the support actually send me the needed QR code and I was able to use the service. The service itself drop all the time and finally I ended up using my phone internet. I would love to get a refund as I was unable to use this serviceb"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ishmail",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T15:08:02.000Z",
          "Titre": "Connected but No/Painfully Slow Internet. Waste of Money.",
          "Contenu": "I purchased the 10GB plan. Despite being connected and showing 5G, I was receiving little to no internet. For my first visit to Japan using an apparently trusted service, I was unable to connect to the internet to navigate or look up restaurants and do other general browsing. I was locked in at a loading screen for a majority of my attempts. I had to find a location with WiFi and do my best to prepare for having no data despite paying for it. This was a pitiful experience. I have a Samsung Galaxy S23 Ultra purchased directly from Samsung, I searched through forums to reconfigure my credentials that were initially inaccurate and that still did not improve my internet. All this while at the same time, my brother having purchased the exact same package was having no issues. How Ubigi can be so painfully unreliable with the eSIMs they distribute and configure. Waste of money. Waste of time. Only stress. Will not be using Ubigi again."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:52:19.000Z",
          "Titre": "The Internet was not working",
          "Contenu": "The Internet was not working; the connectivity to your network was there, but no Internet.and your customer service is very bad and slow"
        },
        {
          "Note": 1,
          "Lieu": "MK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T15:51:53.000Z",
          "Titre": "I purchased an internet plan before I…",
          "Contenu": "I purchased an internet plan before I left my country and when I tried to activate it, it said that the code I had wasn't valid. It was quite inconvenient for me because I really needed the internet when I arrived to the country for professional reasons. I had to purchase another plan which was okay and I sent an email to request a refund for the first purchase. However, I have never recieved any kind of response from your team."
        },
        {
          "Note": 1,
          "Lieu": "JE",
          "Pseudo": "Shane",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T15:06:45.000Z",
          "Titre": "The eSim doesn't work",
          "Contenu": "The eSim doesn't work, the phone was a Samsung S20, spoke to a friend that got his to work but but nothing he could do. Looked up the FAQs, no help, logged a ticket with their help desk, no response. Tried to re-install the eSim through their app, didn't work. They took my money and didn't help. I had used another eSim provided which work seemlessly but was a little bit more expensive, going back.Update: I had checked my spam and the ONLY email I have received is that someone will look into it. Did you not check your ticketing system before responding? This is rubbish customer service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bruce Milnecustomer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T16:49:58.000Z",
          "Titre": "I am still unable to use my sat nav…",
          "Contenu": "I am still unable to use my sat nav after renewing contract when I understood this would be automatically switched back on"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "MARTHA",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T07:35:26.000Z",
          "Titre": "Solo funcionó la señal unos días",
          "Contenu": "Solo funcionó la señal unos días, el equipo de soporte nunca contestó.I have not received the service support, nor data since I have changed country from France to Italy. To bad service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glen B.",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T22:56:16.000Z",
          "Titre": "There is no support, there is no contact info.",
          "Contenu": "I signed up for Ubigi service through the Windows Mobile Plans app with a built-in ESIM.  Upon paying for the plan, I was told that I was activated; however, service was horrible.  I could only connect to certain sites, throughput was slow, and connectivity unreliable.  Other providers were working fine.Here's the problem:  There is no support.  There is no support.  There is no support.  There is no email address, no phone number.  There is a form, but you cannot submit the form because it gives you an error message.  You'd think they would notice that they weren't getting support requests, but apparently they do not care.I finally tried to reply to an email from which the payment receipt was sent to ask for a refund.  I received no response.  If you sign up for this service, you are just dumping money in the garbage.  Stay away at all costs.EDIT: You may notice that Ubigi replied to this review and said they would contact me.   They never did.  No contact from them whatsoever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T23:30:31.000Z",
          "Titre": "I didn’t get all my texts and…",
          "Contenu": "I didn’t get all my texts and ultimately switched to Verizon travel plan because Ubigi wasn’t consistently working"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Sigal Saban",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T19:29:44.000Z",
          "Titre": "I bought 1 GB in USA",
          "Contenu": "I bought 1 GB in USA. And while I didn't used it since I was at home with wifi - still in some magic way all data was gone in a couple of days. I complained to the customer service, and didnt get an appropriate response. Will not use again and will not recommend to any one to use this service!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer - Morgan Nuth",
          "Nb_Reviews": 4,
          "Date": "2023-11-17T05:07:25.000Z",
          "Titre": "All round bad service.",
          "Contenu": "Rang to renew and they were so unhelpful. Was sent email which was not easy to understand. And then managed to pay online but still have have access. A total waste of time."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T01:47:15.000Z",
          "Titre": "Only LTE in Japan (central Osaka)",
          "Contenu": "Could only receive LTE data while in Japan. I've been in central Osaka and regardless of where I go, I only receive LTE. Sometimes this even changes to H. Data has been painfully slow. I've messaged customer support with no resolution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leonardo",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T01:22:49.000Z",
          "Titre": "Does not work in US or Japan.",
          "Contenu": "I arrived in japan and my phone will not connect to network.  I rebooted numerous times.  I ended up renting a pocket wi-fi and no problem at all."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T02:25:22.000Z",
          "Titre": "My issue is not fixed",
          "Contenu": "My issue is not fixed. I did what the tech said to do and I still am not getting my SMS messages sent to phone.They made a suggestion and nothing happened."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T07:59:35.000Z",
          "Titre": "Paid and it didn't even register",
          "Contenu": "Paid and it didn't even register. No data available or anything. Ended up just turning global roaming on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T08:35:16.000Z",
          "Titre": "I have been in contact with Ubigi for…",
          "Contenu": "I have been in contact with Ubigi for four days without resolution. Ubigi without authorization deducted funds from my account and Ubigi claims I agreed to the payments. When I asked them for proof that I authorized the deductions, they kept showing me someone's receipt for a data plan in a country unrelated to where I was visiting. I would not trust this company with my credit card details again."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T12:37:12.000Z",
          "Titre": "renewal all paid for..but would not…",
          "Contenu": "renewal all paid for..but would not reconnect so had to go back to Marshalls to fix and first convenient appointment was 4 weeks forard"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T02:09:03.000Z",
          "Titre": "The Google pixel 7 never connected to…",
          "Contenu": "The Google pixel 7 never connected to 5G and only used LTE and H.  Please update how to verify one's account and profile.  I want a refund for the 50gb of data that I was not able to use on the iPhone. I ended up having to buy a physical sim card for the iPhone 13."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Tucker",
          "Nb_Reviews": 8,
          "Date": "2023-10-04T18:21:58.000Z",
          "Titre": "Poor communication re contract renewal",
          "Contenu": "The correspondence I had with your advisor was unhelpful and failed to address my issues.  I found the company’s stance rigid and inflexible.  I am unlikely to use Ubigi again if this is the standard of service provided"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T17:07:33.000Z",
          "Titre": "I still don't know what went wrong.",
          "Contenu": "This was the first time I used an esim and it will be the last for a while.  Luckily I had a bill notification from ATT & noticed it was $150 more than usual!  I checked all the settings on my phone which was not easy and confusing. Obviously something was not right and I still don't know what.  As a result, I think the instructions are definitely not clear enough.  I won't be using them again."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "OLEKSII",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T22:47:56.000Z",
          "Titre": "After one day of usage my esim got no…",
          "Contenu": "After one day of usage my esim got no working.I did all the troubleshooting steps.But nothing helped.I wrote to support with full description of what happened and video. I also asked for refund. Because I had to buy a physical local sim card and spared additional money. But support answered with providing additional details. WHAT? I SENT A FULL VIDEO WITH EVERY SETTING WHAT DO YOU NEED MORE.That is not the way how to do business.Just believe me, I'll not get poor after sparing 20$, but that is your reputation and how you do business."
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T09:45:25.000Z",
          "Titre": "Had to follow instructions was very…",
          "Contenu": "Had to follow instructions was very unclear and many of us gave up and just ended up using Wi-Fi. Would be better if there was a direct point of contact for assistance"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T15:01:23.000Z",
          "Titre": "Way overpriced plans.",
          "Contenu": "Way overpriced plans.This was a data sim for a Landrover Discovery after end of warranty. Ubigi wanted £7 per month for 3GB. I got the same 3GB from Lebara for 99p/month through Moneysupermarket.com.The reply from Ubigi is irrelevant as you only need the data."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kennethmooney",
          "Nb_Reviews": 9,
          "Date": "2023-10-17T13:02:23.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Sorry, you asked for feedback,When I purchased my car I was not told I would need a licence which was a first in 65 years. I cannot get Bluetooth,or any of the other goodies you offer. I cannot even re register to get going again. I have think my best option is to sell the car."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Fawziya Dasu",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T22:51:04.000Z",
          "Titre": "Worst data company ever!",
          "Contenu": "We barely used our data and it was gone within 8 days! We weren’t warned about our usage and when it was running low! I would never recommend this company to anyone and will never use it again"
        },
        {
          "Note": 1,
          "Lieu": "HR",
          "Pseudo": "Louis",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T19:09:13.000Z",
          "Titre": "The installation wasn’t clear and i…",
          "Contenu": "The installation wasn’t clear and i ended up losing the esim in my settings. Unfortunately i gave up on the installation even though i had paid for a plan already and didn’t even get to use the sim. The option to call Ubigi was there to rectify the issue however as i was already travelling that wasn’t an option as i had no way to call without paying excessively"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Luke C.",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T01:06:20.000Z",
          "Titre": "Absolutely useless",
          "Contenu": "Absolutely useless. Got to Japan after loading and paying for your service in Australia and it will not work. Followed instructions, nothing. Had to ask a Japanese friend for help and spent another $25 on Amazon to buy a sim and get it delivered to his place next day. Not happy!"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T03:26:38.000Z",
          "Titre": "Doesn’t work",
          "Contenu": "Difficulty get it to work in Japan. Could not use normal phone number when turning primary line off. Once initial set up was done could not change settings. Deleted and reinstalled and didn’t work. Waste of money as we purchased two esims and had problems with both."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nick De Michele",
          "Nb_Reviews": 3,
          "Date": "2023-09-10T05:53:18.000Z",
          "Titre": "It wouldn't load properly on my phone.",
          "Contenu": "It wouldn't load properly on my phone.Money wasted for nothing.Couldn't talk to an agent about the problem and their instructional videos didn't apply to me despite having a fairly recent intelligent phone."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "gemma edwards",
          "Nb_Reviews": 3,
          "Date": "2023-07-02T18:11:58.000Z",
          "Titre": "AWFUL NETWORK",
          "Contenu": "I paid for 3GB data in africa but was unable to use as i could not pick up any network. I would randomly get notifications through as i got network but was then unable to respond. When i complained they sent me the link to a map showing network strength which was not helpful as i still paid for something i did not receive"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "slimshady",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T17:08:52.000Z",
          "Titre": "USA plan did not work in Alaska",
          "Contenu": "The USA plan did not work in Alaska. The customer service just suggested to repeat the steps I already tried based on the FAQs. The settings seemed correct anyway since I used a few MB during my transit stopover at the airport in San Francisco, which is why I can't get a refund.As the plan was worthless for me and did not work in a state that should be covered by the bought data plan, I expected at least a discount."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T23:32:27.000Z",
          "Titre": "Speed is really low",
          "Contenu": "Speed is really low; I think this is the most important thing to work on.I have obtain a sim locally for my wife and when compared it to Ubigi esims, I noticeable see a big different."
        },
        {
          "Note": 1,
          "Lieu": "MK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T23:19:28.000Z",
          "Titre": "The service is not great",
          "Contenu": "The service is not great. I spent 2 days without service and had to rely on roaming on my original sim card. Also, there is no way to cancel an order if you purchased the wrong area. The whole Europe extended vs Eastern Europe things is just ridiculous."
        },
        {
          "Note": 1,
          "Lieu": "CN",
          "Pseudo": "Paul C.",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T15:34:03.000Z",
          "Titre": "Mainland 🇨🇳 plan didn’t work",
          "Contenu": "Purchased a €10 data plan to work in China only to never work.Contacted customer support but couldn’t get a reply. Disappointed 😔"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "andrew",
          "Nb_Reviews": 5,
          "Date": "2023-10-16T20:34:09.000Z",
          "Titre": "My car is 3 years old and I’ve renewed…",
          "Contenu": "My car is 3 years old and I’ve renewed with you. My Sat nav now dosnt work now and I have to put my Jaguar back into the dealership for 2 days to get this sorted which will cost me. The car tells me my licence has expired !!What is going on ?."
        },
        {
          "Note": 1,
          "Lieu": "BW",
          "Pseudo": "Debbie",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T14:47:34.000Z",
          "Titre": "The worst of Africa",
          "Contenu": "I bought a best of Africa data plan for my Ubigi esim to use in South Africa, Botswana and Zimbabwe. The majority of the time was to be spent in Zimbabwe. I was pretty upset to find I have no coverage in Zimbabwe as it appears the mobile provider Ubigi use which was the worst in Zimbabwe has gone into receivership. I have used less than 2gb of my 10Gb plan and now it is useless. Ubigi have not been very quick to respond which has caused me transfer issues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AC Glover",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T16:19:15.000Z",
          "Titre": "This simply failed to work properly",
          "Contenu": "This simply failed to work properly.  It appeared to connect but would not allow me to pull up anything. I let it sit for several minutes and with a good connection reported, it never pulled up a page.  Thank goodness I only put this on 3 of the 5 phones in my family.  The ones with another service, worked, but Ubigi did not."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T08:35:34.000Z",
          "Titre": "i can't recommend",
          "Contenu": "First of all - tragic signal strength - i was neat San Vincenzo in Italy - signal strength was 1/6 - it was impossible to use the internet. In other cities nearby (Pisa, Piombino) was better, but i've bought esim to use it on my main place, not in nearby cities."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T07:08:03.000Z",
          "Titre": "I reviewed some sites that recommended…",
          "Contenu": "I reviewed some sites that recommended them for good Esim services in UK and Europe. However I ordered data plan and I still haven’t received any confirmation email how to install the services or receipt for my payment. I’m finding the reviews here suspicious as well as the legitimacy of the website."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "DAVID THOMAS",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T11:46:40.000Z",
          "Titre": "The worst experience of WiFi ever",
          "Contenu": "The worst experience of WiFi ever. Overly complex, and hugely expensive, and it doesn’t work well. In this day and age, absolutely dreadful."
        },
        {
          "Note": 1,
          "Lieu": "LB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T08:42:02.000Z",
          "Titre": "Never worked",
          "Contenu": "I bought a package, never worked throughout my trip, I’ve used this before and worked normally… tried everything in FAQs and still didn’t work. I want a refund.Edit: I did already activate the eSIM profile in the settings when the issue occurred, didn’t work."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Adrian Duffin",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T13:04:34.000Z",
          "Titre": "I have purchased online a years package…",
          "Contenu": "I have purchased online a years package and it has not been allocated to my car.PLEASE HELP!Registration N12AGE Jaguar F-PaceStatus : Payment acceptedAuthorization code: 013717"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Stu",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T00:28:14.000Z",
          "Titre": "Poor service, nonexistent customer support",
          "Contenu": "I used Ubigi for a recent trip to Japan based on good reviews here and elsewhere, specifically for travelers in Japan. I had issues from the start. My phone would always show full bars for Ubigi LTE, but only actually worked intermittently. Sometimes it would drop to 3G, which was more stable, but obviously very slow. Forcing it to 3G was the only way I could make it reliable. This was in the city too where coverage was always good. I reached out to Ubigi through their contact form (the only way I could figure out how to get in touch) and as of a week later, still no reply. Instead of re-upping with Ubigi I used Airalo and so far so good with a connection through Docomo.Edit: I suppose I might have entered my email incorrectly, but I doubt it. It is possible though that the help request never went through since my data connection was so unstable at the time. I don’t know why I had to search their website for the contact form at all when I was already logged into the app. Seems like a help button there with all my details preloaded would’ve avoided all the trouble."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Huyen Nguyen",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T10:02:37.000Z",
          "Titre": "Expensive and data was consumed so fast"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:33:14.000Z",
          "Titre": "Not helpful"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T19:53:46.000Z",
          "Titre": "NOT easy set up",
          "Contenu": "The advertising for Ubigi touted how easy it was to load.  It took days even with customer help to get it done. I was ready to go to another provider when my husband finally stepped in.  Between the two of us we finally got it to work.  I have a 22 Samsung phone so it should not be so hard. I needed to speak to a live person to walk me through the steps. Customer service sent me directions and kept referring me to FAQs. Do they realize how many FAQs there are.  I couldn't even figure out which ones were pertinent.In Ubigis response,  they said someone would contact me within 48 hours.  Never received a call, text, carrier pigeon message.  Nothing further from them.  Am now in Japan. The esim is working."
        },
        {
          "Note": 1,
          "Lieu": "JE",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-15T22:56:05.000Z",
          "Titre": "Sim didn’t work when I renewed it…",
          "Contenu": "Sim didn’t work when I renewed it despite following all guidance and setting up exactly the same as the previous month when it had worked"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T08:02:37.000Z",
          "Titre": "probably my fault",
          "Contenu": "I am poor at technical things and although I was able to install the application after several tries, I never could get it to work. I am sure it was my lack of understanding but it was a frustrating waste of $"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Michael Boucher",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T02:43:04.000Z",
          "Titre": "Can not set up in different country",
          "Contenu": "Can not set up in different country. Took numerous times to connect, needed to sign up twice and pay twice. Not a good user experience"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Manley J.",
          "Nb_Reviews": 5,
          "Date": "2023-06-13T21:34:26.000Z",
          "Titre": "Takes too long for a response",
          "Contenu": "Takes too long for a response. I am back from vacation and the Issue still unresolved after 12 days.  Bought a new eSIM from a competitor and it worked without issues. I have asked for a refund but has not been addressed. I do not recommend this company. I’m"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Lynette",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T17:38:42.000Z",
          "Titre": "Didn’t work for me",
          "Contenu": "Fellow traveler recommended Ubigi — downloaded but couldn’t get to work.  Visited several phone stores  on our travels but no one able to help (Language differences didn’t help). Contacted Ubigi but the screen shots sent didn’t correspond with my phone. Im a senior and not technically savy. Finally found a store who set up for me and said all ok…. Then got email from our home supplier advising I had used 50% of my data.  Therefore it’s still not working. Relying on bus Wi-Fi for messages. Nothing else works.  Can’t send anything out to Ubigi to get further assistance as nothing works. Ubigi advised wrong sim chosen but can’t find where to change. Finally after nearly a week I will put home SIM card back in phone just so I can use my phone again.  I would really like a refund."
        },
        {
          "Note": 1,
          "Lieu": "HU",
          "Pseudo": "Botond Horvath",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T10:17:21.000Z",
          "Titre": "Dear Customer Care",
          "Contenu": "Dear Customer Care,  I changed my phone and I was not able to active Ubigi service on my new phone.  I contacted Customer Cate but I did not get any response up to now. There is very unprofessional approch."
        },
        {
          "Note": 1,
          "Lieu": "GW",
          "Pseudo": "Regular esim user.",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T00:00:20.000Z",
          "Titre": "Don’t use this. It’s a rip off.",
          "Contenu": "It’s very expensive for very little product. More data should come with the price I paid. It also doesn’t work in countries listed when I bought it. Overall I feel ripped off. The best signal I have got was weak 3G at best. I’ve had to email customer support so any times I asked for a refund!"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Guillaume Berclaz",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T08:59:10.000Z",
          "Titre": "Didn't recieve the card that I paid for and no answers from the client service.",
          "Contenu": "A lot of my friends told me good about Ubigi so I purchased a E-Sim card for my travel to Japan. I paid my order but never got the e-mail with the QR-code for the E-Sim card. Seeing this, I tried to contact the client service three times to get this card, an solution or in the worst case, a refund ; I haven't even recieved an answer saying that the case was on resolution or that they got my e-mails.I'm doing right now my trip to Japan, paid but never got the card that I strongly need now.Four of my friends are joining me in 9 days here in Japan and this frustrating experience is not morivating them to purchase from the Ubigi compagny.I write here cause I still have zero answer and I would like to know what can I do ?Thank you for reading."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T05:19:19.000Z",
          "Titre": "Could not get it to work",
          "Contenu": "Could not get it to work.  I would log into my account and it would show I paid, there was a Ubigi eSIM on my notebook but would never activate.Gave up, signed up with Gigsky and worked wonderfully."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "margaret hardingham",
          "Nb_Reviews": 12,
          "Date": "2023-09-26T15:24:30.000Z",
          "Titre": "FAR TOO COMPLEX TO RENEW",
          "Contenu": "FAR TOO COMPLEX TO RENEW - IT TOOK AGES!A TECHIE MUST HAVE DESIGNED THE PROCESS, AND HE/SHE SHOULD GET INTO THE REAL WORLD SOMETIME!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T09:52:05.000Z",
          "Titre": "Too Expensive!",
          "Contenu": "Too Expensive!Thanks for the response. I think it’s a create idea but my data doesn’t really work! I’ve been using it and it works sometimes but not always. I’m only using temporarily due to loosing my other sim."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T17:47:11.000Z",
          "Titre": "Didn’t get my free wifi from the free…the fake wifi thing.",
          "Contenu": "Didn’t get my free wifi from the free esim with out paying I thought I would get the wifi but no I didn’t… I have to pay for an actual esim qr code.."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T01:56:29.000Z",
          "Titre": "Bought this so I could make calls and…",
          "Contenu": "Bought this so I could make calls and have proper wifi when overseas. Not great when travelling in foreign countries with no wifi and no way to call anyone. False sense of security. Not impressed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T16:41:20.000Z",
          "Titre": "Unable to access my account",
          "Contenu": "Unable to access my account. I keep getting confirmation codes to my email but they all are rejected for unclear reasons."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "CPWD",
          "Nb_Reviews": 3,
          "Date": "2023-09-22T10:57:36.000Z",
          "Titre": "Renewed my Land Rover subscription",
          "Contenu": "Renewed my Land Rover subscription. Annual usage started from that date rather than from the end of my current subscription."
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Mariya",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T08:44:47.000Z",
          "Titre": "No LinkedIn or Netflix on Ubigi",
          "Contenu": "I had 10gb package however was not able to open LinkedIn or Netflix, really bad experience with Ubigi. For the whole trip I was unable to get into these 2 apps, they were just blocked by Ubigi. My package was for Vietnam where these apps are not forbidden so they have to work.I have not been using VPN, I am talking about the 4G network on my phone, no proxies, no VPNs."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T04:23:06.000Z",
          "Titre": "Unfortunately, it was not useful.",
          "Contenu": "I was unable to connect Ubigi line in most places during my trip, which was very annoying in places where there was no wi-fi. Also initial setup was not easy at all."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T13:05:40.000Z",
          "Titre": "Easy to install but not good performance",
          "Contenu": "Easy to install, but many times I had no coverage or it was very bad and slow even though I only used the internet in big cities in Japan"
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T07:13:12.000Z",
          "Titre": "Inconvenient usage",
          "Contenu": "It is not available to access to news sites in Asia through your SIM, and the charge is not attractive at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BW",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:18:34.000Z",
          "Titre": "Not the best experience…",
          "Contenu": "The data service was not consistently high quality. I often had connectivity problems. I also believe the amount of data I was charged did not match my actual usage. Lastly, I believe the app drained my phone’s battery much quicker than should be the case."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T01:18:35.000Z",
          "Titre": "Wong configuration",
          "Contenu": "Could not start using due to a wrong configuration. The iPad application may not have worked properly. Moreover, when the configuration changes due to the change in place (from one place to another within EU), old configuration remained and caused the trouble in connection.  Not easy to find it. Wasted a lot of time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:12:48.000Z",
          "Titre": "Data only worked in very limited parts…",
          "Contenu": "Data only worked in very limited parts of the Island of St. Martin"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "HJB",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:38:17.000Z",
          "Titre": "If you want data quickly and haven’t…",
          "Contenu": "If you want data quickly and haven’t used an eSIM before would not recommend. Was in London and data ran out with two days to go so decided to try this. I purchased at about 6 in the evening. Could not get it to work. Emailed customer service who provided generic response receipt but no advice. At about 10 the next morning received screenshots identical to those in FAQ. I sent my screenshots so could be told what I was doing wrong and received the generic faq advice again. I sent several emails with screenshots of things I was trying and kept getting same responses til I pointed this out and asked if my screenshots had actually been looked at. Next email had pertinent info and finally got data almost 24hrs later. Wasted hours on it ….and if you are in London it also drops out on the tube….where you kind of want it the most to guide you…."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer N",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T22:37:39.000Z",
          "Titre": "Weak reception",
          "Contenu": "It's easy to purchase a plan and it immediately activates without any complicated processes. However, the reception is weak most of the time - I stayed in Boston (MA), Arizona, and Las Vegas. Sending text and photo, calling thru messaging apps, loading a website and google map takes time."
        },
        {
          "Note": 2,
          "Lieu": "ID",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T02:38:29.000Z",
          "Titre": "NO INTERNET",
          "Contenu": "I am in Indonesia- Pekanbaru and Kerinci.  I can connect but the speed is such that I  have not been able to use internet.  My colleagues chose Airalo-working well.  I will test in Malinau this next week. But very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "gertie owen",
          "Nb_Reviews": 18,
          "Date": "2023-11-25T12:02:45.000Z",
          "Titre": "Paid for my subscription before it…",
          "Contenu": "Paid for my subscription before it expired . They never renewed it and I kept getting emails saying it was not renewed . Contacted the company but didn’t hear back From them . Phoned them and  they asked for proof of payment so hoping they will sort it now ."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:41:50.000Z",
          "Titre": "The data usage in UK is quite bad",
          "Contenu": "The data usage in UK is quite bad. There is no reception in restaurants usually and on the tube, both under and overground. Not sure why this is so."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Danielle",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T09:23:18.000Z",
          "Titre": "It was great until it wasn’t…",
          "Contenu": "It was great until it wasn’t…I went to Japan for three weeks and bought 10GBs…I ran out of data during the last two days of my trip and so I bought an extra 5GBs (first an additional 1GB and then 4more GBs.) Within 5 minutes of purchasing, the data was used up. (No exaggeration.) There is absolutely no way I used 5Gb in 5 minutes. In fact, after losing the 1GB in roughly a minute, I put my phone in low data mode and turned it off completely because I really needed internet access to navigate around Japan. I ended up buying an AirAlo esim which worked as intended. Deeply disappointed with Ubigi. It’s great if you don’t have to buy extra data."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T05:50:23.000Z",
          "Titre": "Disappointed that data was spotty at…",
          "Contenu": "Disappointed that data was spotty at various times in Japan. Not a reliable service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T04:28:40.000Z",
          "Titre": "Spotty connection",
          "Contenu": "Worked well for the first couple of days in Japan but connection started to get very spotty for the rest of my trip (about a week). The connection was so unreliable that it made it difficult to get around and messages would not always get sent/received. Noticed that there were no issues with connection in Shinjuku but had spotty connection in Ginza, Shibuya, Tsukiji, Nihonbashi, Osaka and Kyoto. Phone is Google Pixel 6"
        },
        {
          "Note": 2,
          "Lieu": "EE",
          "Pseudo": "Mr. T",
          "Nb_Reviews": 5,
          "Date": "2023-10-23T13:15:06.000Z",
          "Titre": "Not reliable esim...",
          "Contenu": "Mobile data just keeping dissapearing and have to reinstall esim (S23U). Have used many different esims during my travels, 1st time this issue. Very very annoying!! And not only me, my son has the same issue with his iphone 11.Never ever will use Ubigi :( This is the warning sign already that you can reinstall your esim max 5 times, usually it is only 1 time. Others allow one time as their service is working and with Ubigi you have to reinstall and reinstall. Hopefully esim will last till my end of vacation 😁 Seriously thinking to buy some other esim.Don't choose Ubigi, many more reliable options are available!"
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T05:40:00.000Z",
          "Titre": "For the asia plan",
          "Contenu": "For the asia plan, it was really slow and slow to get service when landing and in airport. It seemed faster after a day or few hours but otherwise had trouble getting fast service"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Eric R",
          "Nb_Reviews": 5,
          "Date": "2023-11-07T08:42:57.000Z",
          "Titre": "Worked well when I was in Italy earlier…",
          "Contenu": "Worked well when I was in Italy earlier this year but didn't work at all when I was in Mauritius. The Support is horrible and takes ages, even if you have not been able to use it since day 1 you can't get a refund even if the support can't get it to work for you."
        },
        {
          "Note": 2,
          "Lieu": "HU",
          "Pseudo": "john_tourant",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T23:26:43.000Z",
          "Titre": "Good mobile connection, bad everything else",
          "Contenu": "Mobile service good but too much email spam after purchaseThe app launched on my smartphone in forced landscape tablet mode for some reason and was really hard to use with no option to changeLogin process to app very cumbersome, website design hard to navigate"
        },
        {
          "Note": 2,
          "Lieu": "ID",
          "Pseudo": "customer hi",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T18:31:00.000Z",
          "Titre": "Worked perfect in Japan",
          "Contenu": "Worked perfect in Japan, but not at all in Bali Indonesia. wasted our money not being able to get out of our 3 month contract. Ridiculous."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "ADS",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T08:16:44.000Z",
          "Titre": "Network isn't consistent",
          "Contenu": "Network isn't consistent. Keeps dropping, even within Tokyo city. No network coverage in Metro at all."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Gabi",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T17:16:07.000Z",
          "Titre": "Ubigi Esim made my phone crash/freeze",
          "Contenu": "The Esim connected and gave me 5G data connectivity, but after around 4-5 days of using Ubigi, my phone kept freezing, crashing, and restarting by itself. Basic apps like Maps and Waze no longer worked. As soon as I removed the esim, my phone worked 100% normally again."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T23:50:26.000Z",
          "Titre": "Something went wrong while I was buying…",
          "Contenu": "Something went wrong while I was buying the esim. I paid for it twice and somehow it went onto my husband's phone. He was hotspotting for me so that could be why. It never worked on my phone but it worked fine on my husband's He had no issues apart from occasional slow connection"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T09:17:59.000Z",
          "Titre": "My first esim purchased there was no…",
          "Contenu": "My first esim purchased there was no indication as to when the data was over. I also find it hard to believe that I purchased 10gb if data and it was over within a week when I didn’t use my data for anything except google maps and occasional social media."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Francois Raynal",
          "Nb_Reviews": 3,
          "Date": "2023-10-29T06:58:23.000Z",
          "Titre": "Esim worked just fine as promised when…",
          "Contenu": "Esim worked just fine as promised when I landed in Amsterdam, but once in France, even in a major city, stopped working???  Buggy at best."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T01:09:24.000Z",
          "Titre": "Good days plans but the customer…",
          "Contenu": "Good days plans but the customer service is almost zero. You have to contact them via a form online and when you contact them they are not helpful at all and just confirms that your data plan is active rather than helping with your problem."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T20:12:33.000Z",
          "Titre": "Very expensive and really bad coverage in France",
          "Contenu": "Cons: very expensive compared to other data plans, really bad coverage in France with no network outside of big metro cities.Pros: eSim is easy and quick to set up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T09:46:28.000Z",
          "Titre": "LTE connection keep dropping",
          "Contenu": "LTE connection keep dropping and have to keep switching on/off for airplane mode to get back on to LTE"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Christopher McGrath",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T02:05:44.000Z",
          "Titre": "Strangely high data usage",
          "Contenu": "The cell/data service is very good, but my data usage was somehow 5x as much as normal. I typically use 2gb over the course of a month, but somehow used an enormous amount in just the first week with Ubigi - despite having the phone in airplane mode for 50% of the time and far less activity during travel.My travelling partner had a different data provider and used their phone 3-400% as much, but consumed less data.It made me disappointed with the value."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Tensoku",
          "Nb_Reviews": 3,
          "Date": "2023-02-15T08:59:20.000Z",
          "Titre": "Poor speed and connection",
          "Contenu": "Maximum signal with maximum ping. Bought a plan for Japan, but got an IP in Singapore. Download speed ~200kb/s with 5G shown. Frequent disconnection, average 400ms+ ping for mobile games, even in JP server. Well, I chose this cheap price, so I got what was worth this price. Will never reload again. Really bad experience."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T11:06:09.000Z",
          "Titre": "The signal is so terrible",
          "Contenu": "The signal is so terrible especially when I use it for google map navigation. The route is keep on recalculating, and we cannot reach to our destination most time."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T23:26:44.000Z",
          "Titre": "Data not working in Miyazaki or…",
          "Contenu": "Data not working in Miyazaki or Kumamoto prefecture in Japan. Tried to email Ubigi but never got a response. I got 10 gb plan and have not been able to figure out why data isn’t working after doing all their troubleshooting."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T18:57:01.000Z",
          "Titre": "I had problems getting connected",
          "Contenu": "I had problems getting connected, then, once connected, my connection only worked for a short while. I was relying on the data connection for my navigation app, but the connection was so flakey I ended up going with my Canadian cell provider’s overpriced roaming instead. Additionally, the instructions for setup didn’t match what my iPhone 12 Pro Max showed in its menus (it turns out my phone cannot support having two eSIMs active simultaneously)."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T17:26:09.000Z",
          "Titre": "Compared to the bytesim esim for japan…",
          "Contenu": "Compared to the bytesim esim for japan country, ubigi is too slow even with 5g network. Latency is more than 100+ ms compared to bytesim thats just 25 to 30ms with 4g+ connection with both esims having a bandwidth of 70 t0 150mbps.Also, ubigi is kinda too slow to aquire the signal compared to bytesim."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T00:03:17.000Z",
          "Titre": "I loved it in 2021 but frustrating now & no live help.",
          "Contenu": "I loved it in 2021 & found it simple to use, but now I can not reconnect. I keep getting an error when I try to login. The Customer support email said eSim has been deactivated/terminated since it was inactive (not quite 18 months). Advised to delete the eSim and start over, but the app won't let me create a new account. The FAQs and tutorials just send me around and around."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T22:42:05.000Z",
          "Titre": "I accidentally bought a plan for the…",
          "Contenu": "I accidentally bought a plan for the wrong country, and there was no warning and they wouldn't let me change it. It took me a long time to figure out what was wrong and then I had to pay for a second plan."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T06:25:34.000Z",
          "Titre": "Inconsitent quality of data",
          "Contenu": "My partner got Ubigi on his phone as well when we were both travelling in Japan. He constantly got 5G and I was on 3G so many times. I have a newer phone too and purchased a higher plan. What the heck?!"
        },
        {
          "Note": 2,
          "Lieu": "RW",
          "Pseudo": "Yann",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T10:33:20.000Z",
          "Titre": "Burundi plan didn't really work",
          "Contenu": "Purchased a plan for Burundi, which worked very occasionally and very briefly, even though I only stayed in the capital... Of course we can't expect too much in Burundi, but my friend had a local SIM that worked perfectly well..."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T22:48:45.000Z",
          "Titre": "It looks like metering is off",
          "Contenu": "It looks like metering is off. I refuse to believe that I went through a gigabyte in a day, as normally I'm good with 5 gigabytes for a whole month, and I didn't do anything differently. The meter in my phone also didn't show such an amount of traffic."
        },
        {
          "Note": 2,
          "Lieu": "VN",
          "Pseudo": "Jimmy",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T16:53:50.000Z",
          "Titre": "Don’t buy Vietnam Data",
          "Contenu": "We bought the Japan data plan and it was amazing. Fast connectivity and had very little problems. We then bought the Best Asia plan since we were heading to Korea and Vietnam next. Korea went smooth without a hiccup. Vietnam however, data didn’t work at all. Very, very disappointing and total waste of money."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T19:04:17.000Z",
          "Titre": "Cheap but bad reception",
          "Contenu": "The cost is quite cheap; however, for us, the coverage was absolutely atrocious when covering distance from Montreal --> Vermont. Was staying in Vermont for a week and I could not get a stable connection for more than 5 minutes. In addition, when connection was established, I never received more than 1 bar.I would NOT recommend Ubigi for anyone travelling this area. I can not comment to other geographic areas."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T21:53:29.000Z",
          "Titre": "Data has been very inconsistent",
          "Contenu": "Data has been very inconsistent. Frequently says I don’t have access to cellular data. Cannot make calls and texts are completely inconsistent. Sometimes I can send messages and sometimes says I don’t have cellular. Cannot use the App Store at all. Waste of money and wish I used another company."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T06:32:35.000Z",
          "Titre": "We were having issues after setup",
          "Contenu": "We were having issues after setup. I sent an email requesting clarification but never received a response. Poor customer support. If you just put a video showing setup, instead of writing directions (which I think is missing a step), would be more helpful."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Luis",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T13:32:54.000Z",
          "Titre": "Americas good SE Asia not so good",
          "Contenu": "So I have used Ubigi in the US and South America and it worked well.  Recently did a trip to Indonesia, Sumatra, Vietnam, and Singapore and the coverage was horrible."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T03:57:24.000Z",
          "Titre": "stopped working almost immediately",
          "Contenu": "ubigi worked fine for 4 days and ever since has been nearly unusable. Even when I have full bars LTE service i can do nothing more than receive text messages. I can’t send texts or use Maps. I’ll change this rating if the company fixes the issue but I’m all fed up, this is worse than having nothing because I expect it to work and then nothing happens."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "New customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T23:35:42.000Z",
          "Titre": "Not a great first impression",
          "Contenu": "Was told I could change the dates of my roaming plan. I couldn’t. After I signed up and my first plan expired there was no weekly plan option. The app doesn’t let me use face recognition or even store my user name."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T16:00:08.000Z",
          "Titre": "App is 90% of the time not woeking",
          "Contenu": "Setting up the E-Sim is easy but 90% of the time the app is not working and if you are lucky it works after 10-15 times refreshing.Has nothing to do with the network as all other apps and websites work well"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Traveler",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T16:51:07.000Z",
          "Titre": "Not good for Text Messages; No Voice Calls",
          "Contenu": "Internet usage was, generally, OK but text messages received and sent over Ubigi's data were delivered so far after they should have been. No voice calls would work. Definitely needs an improvement."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T10:46:05.000Z",
          "Titre": "My first data package was consumed in…",
          "Contenu": "My first data package was consumed in few hours - probably because my phone stayed on. Then I bought a Asian package in which Taiwan was not in while I was staying in taiwan, then I bought an expensive package.All in all because the explanation were less than clear. I ended up paying like 80 USD while I could have paid easily half of it."
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T17:10:43.000Z",
          "Titre": "Most of the time the internet is not…",
          "Contenu": "Most of the time the internet is not working, it suddenly change from Ubigi to Simba."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T19:14:36.000Z",
          "Titre": "Poor Ubigi speed in Israel",
          "Contenu": "While traveling to Israel I've had coverage with Ubigi, but the speed was horrible, despite being on the \"LTE\" network. Browsing the net was barely possible, sending WhatsApp messages took _minutes_ even if the message was text-only."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ubigi Customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T10:24:35.000Z",
          "Titre": "Network Strength Not Great",
          "Contenu": "Often had 1 bar or no connectivity in the UK where UK natives had full strength signal on networks such as O2. This was frustrating and we often had to resort to paid wifi for connectivity. When we had Ubigi connectivity though, it was fine."
        },
        {
          "Note": 2,
          "Lieu": "RS",
          "Pseudo": "Dragan Obrenovic",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T20:16:42.000Z",
          "Titre": "Google Pixel 6a",
          "Contenu": "Google Pixel 6a, with Ubigi eSIM.Most of the time the internet connectivity was not working AT ALL, even in the urban area (Sarajevo, the capital of Bosnia and Herzegovina). Outside of urban area, the internet connection was even worse and I needed it for Google Maps navigation. It started working all of the sudden, where I didn't even expect it to work at all (in the part of the country far from any urban settlement). This is the first time I had so bad experience with Ubigi eSIM, usually it works perfectly well."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Greg Clarke",
          "Nb_Reviews": 2,
          "Date": "2023-01-26T05:16:36.000Z",
          "Titre": "Customer Service did not respond correctly",
          "Contenu": "Customer Service did not respond to the question asked. They did provide information related to, but not about, the questions asked.I used short sentences assuming non-English respondent.Not important enough to pursue."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Colin Young",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T08:32:00.000Z",
          "Titre": "LTE Service",
          "Contenu": "Unable to get LTE service in St. Lucia or St. Vincent using iPhone XS MaxI was in St. Lucia from 29 March to 16 April 2023. Traveled between Vieux Fort, Soufriere, Gros Islet and Rodney Bay.Stayed in St. Vincent from 6 to 11 August 2023 and traveled between Young Island and Kingstown.It is hoped that the above is helpful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T10:47:18.000Z",
          "Titre": "Many many things went wrong",
          "Contenu": "The instruction video did not play on the website, so it was unclear how the process works. It took time for the service to turn on even after following the instructions. After the service kicked in, my favorites and my guides that previously existed on the iPhone completely disappeared, and Ubigi customer service said they don’t know how to help. Messages (SMS) did not work over Ubigi, and when consulted, the customer service said I needed to use my primary mobile/cellular service for it, which defeats the purpose of purchasing eSim."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Gonzalo",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T22:14:41.000Z",
          "Titre": "There are no tips on how to setup the…",
          "Contenu": "There are no tips on how to setup the phone to not waste data and after the data is almost gone we found much cheaper options, your pricing is far off the market"
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T05:23:36.000Z",
          "Titre": "There is no 5G connection at all when i…",
          "Contenu": "There is no 5G connection at all when i was in japan for previous 3 weeks..i used docomo network and within tokyo but still no 5G connection as claimed.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T18:27:12.000Z",
          "Titre": "Data package in Europe and Brazil…",
          "Contenu": "Data package in Europe and Brazil worked perfectly, but in Caribbean, it was so slow. I asked for refund but was refused. Wasted $."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "TechnoTrack",
          "Nb_Reviews": 3,
          "Date": "2023-09-15T14:17:52.000Z",
          "Titre": "All worked well in Harare but no…",
          "Contenu": "All worked well in Harare but no connection in Kwekwe. Contacted support desk but they could not help in this case."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Jayfiled",
          "Nb_Reviews": 3,
          "Date": "2023-07-04T05:50:23.000Z",
          "Titre": "Paid for 5g and didn't get it. Suspicious connection speeds",
          "Contenu": "I paid for 5g in japan and haven't got it the whole time I've been here. I've been travelling and staying in CBD Tokyo and Sapporo and have been constantly looking for a 5g connection while moving around. The 5g zones on DoCoMo website cover all of these two cities so it's totally suspicious that I can't get it. Other reviews claim good 4g but didn't see any 5g. I've got 5g preferred set on my mobile connection settings, I've attempted to manually set the service provider but DoCoMo isn't an option to choose and KDDI can't be selected. Ubigi is the only option. It's supposed to automatically connect to the DoCoMo network when selected but sometimes it's a horrible connection. I looked at where my IP was and somehow it's often coming from France. Don't get me wrong, if I paid for 4g then I'd be totally happy with the service. While the 4g lte is fine most of the time sometimes it's absolutely trash and I need it to work because I'm working remotely.I bought 5g and expected to do some cloud gaming but the connection is no where good enough.I've got a Galaxy Fold 3.-- edit: I've contacted them with the info they've requested, waiting to hear back --"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T05:53:10.000Z",
          "Titre": "Service was acceptable and customer…",
          "Contenu": "Service was acceptable and customer service care was not very good when I needed support. Setup was a pain. Only benefit to the service was the low cost, but otherwise I would recommend others to go elsewhere for a better overall experience."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "hellibaxter",
          "Nb_Reviews": 4,
          "Date": "2023-05-29T01:28:26.000Z",
          "Titre": "Very difficult to get working",
          "Contenu": "Very difficult to get working no notes on what to make sure is active on your phone so it can start working. When it asks you to scan a QR code on your phone how are you meant to do that. No codes to type in instead. Felt very stressed with it. My mums had constant problems trying to get it running."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T12:31:11.000Z",
          "Titre": "Signal drops frequently",
          "Contenu": "Signal drops frequently. Sometimes I was stuck with 3g.I experienced this in Nagoya and Tokyo in the last week"
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T12:45:50.000Z",
          "Titre": "On several occasions I had no reception…",
          "Contenu": "On several occasions I had no reception at all and wasn’t available.Edit: cellular reception was awful (my phone was unavailable several times a day) in Disneyland Paris 23-26.5. Hope this helps."
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Emre Hisoka",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T04:25:52.000Z",
          "Titre": "Took a subscription for the UK…",
          "Contenu": "Took a subscription for the UK 30days,my 4G was not working well and i struggled alot with it, price was okay but the rest was meh."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T02:59:04.000Z",
          "Titre": "Worse than others",
          "Contenu": "Original data plan was significantly slower than competitors my friends chose and after buying the data top up the esim didn't recognize the purchase and stopped working"
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T12:33:25.000Z",
          "Titre": "The connection quality is horrific at…",
          "Contenu": "The connection quality is horrific at the most random times. I was downtown Tokyo with full bars and the thing just refused to access the internet."
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "klant",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T23:28:01.000Z",
          "Titre": "Did not know vpn should be turned off…",
          "Contenu": "Did not know vpn should be turned off halfway through the trip to use the app. Found out by accident. Besides that the app works fine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "fc",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T00:42:11.000Z",
          "Titre": "Almost unusable in Disney Japan",
          "Contenu": "Almost unusable in Disney Japan.  It has strong signal but data rate is less than 1MB/s.   Possible due to low prioritization compare to other providers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T17:32:57.000Z",
          "Titre": "I cannot check the usage from the app",
          "Contenu": "I cannot check the usage from the app. When I try to login I get an error with the text ERROR…please try again. The same login works fine on the internet portal."
        },
        {
          "Note": 2,
          "Lieu": "TH",
          "Pseudo": "Jonty Hood",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T02:32:28.000Z",
          "Titre": "I was logged out of the app numerous…",
          "Contenu": "I was logged out of the app numerous and left stranded without data (and since it logged me out, i had to find a wifi source to log back in)"
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Lodewijk IJlst",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T09:56:50.000Z",
          "Titre": "Bought a USD10 1 month 3GB code and…",
          "Contenu": "Bought a USD10 1 month 3GB code and could not apply it. Just to test I then bought a 2Eur 1 day and that worked fine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "T. Bui",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T16:50:32.000Z",
          "Titre": "Ubigi does not work in Slovakia as advertised",
          "Contenu": "I paid for a 3gig plan to use in East Europe that includes Poland, Austria and Slovakia, but I could not use Ubigi in Brastisalava, Slovakia as advertised."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T02:42:30.000Z",
          "Titre": "slow internet",
          "Contenu": "Was using Ubigi in Morocco. I had the internet connection at all times but very very slow. It showed 4G, but was more like 3G"
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T16:56:21.000Z",
          "Titre": "Network connection is weak in some…",
          "Contenu": "Network connection is weak in some areas. Quite disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack_jack",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T01:07:58.000Z",
          "Titre": "Unreliable network speeds",
          "Contenu": "Even though the phone connected to a LTE network, the speeds were very bad and most of the times it just didn’t work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T21:09:28.000Z",
          "Titre": "I could not get support to get back to…",
          "Contenu": "I could not get support to get back to me on business question and activating more than one laptop."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Gil B",
          "Nb_Reviews": 3,
          "Date": "2023-09-18T13:52:59.000Z",
          "Titre": "beware NOT 5G",
          "Contenu": "was supposed to be a 5G connection but finally I got only LTE :-("
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T18:17:30.000Z",
          "Titre": "Doesn’t work in SA",
          "Contenu": "Worked in UK, but I bought a package specifically for South Africa that didn’t work at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T00:20:55.000Z",
          "Titre": "Data is very very slow in congested areas",
          "Contenu": "Data is very very slow in congested areas. The only issue with that is Japan is all congested areas"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T17:19:02.000Z",
          "Titre": "I do not want my personal details…",
          "Contenu": "I do not want my personal details shared with 3rd parties like TrustPilot"
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "BH",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T18:50:28.000Z",
          "Titre": "Poor network",
          "Contenu": "In Karuizawa, the cellular network doesn't work, even though the signal appears to be very strong."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T22:18:01.000Z",
          "Titre": "Difficulty in texting",
          "Contenu": "Difficulty in texting. Couldn’t text in iMessage or otherwise reliably. Even after making the appropriate changes to the cellular setting"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Martin",
          "Nb_Reviews": 3,
          "Date": "2023-04-13T01:36:01.000Z",
          "Titre": "Messages from LINE were very slow to…",
          "Contenu": "Messages from LINE were very slow to come through and calls on LINE simply didn't connect."
        },
        {
          "Note": 2,
          "Lieu": "FI",
          "Pseudo": "Samu Bloxx",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T20:48:24.000Z",
          "Titre": "Bad Quality 5G More like 4G-",
          "Contenu": "The service is 5G but its 90mbps and sometimes 20mbps! But its cheap 8€ 3GB so I bought it for 5G (500mbps) bc My plan is 4G 17€/Month unlimited and it was 70-120mbps! Sometimes the 5G got to 300mbps but rarely!"
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T03:13:17.000Z",
          "Titre": "Intermittent connection in Osaka and…",
          "Contenu": "Intermittent connection in Osaka and Tokyo. Connection switches between 5G and LTE frequently"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:29:43.000Z",
          "Titre": "Worked find then not at all",
          "Contenu": "It worked for 3 days in France and then stopped working for 4 days straight. Not very happy."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Regina West",
          "Nb_Reviews": 3,
          "Date": "2023-07-11T23:28:19.000Z",
          "Titre": "Didn’t work",
          "Contenu": "I purchased mine , it said it was activated.But I couldn’t get it to work in Bali .Wont be buying again .🥲"
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T21:21:37.000Z",
          "Titre": "No 5G",
          "Contenu": "No 5G, poor signal, low bandwidth consistently in mexico city."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T09:25:18.000Z",
          "Titre": "Japan Ubigi Plan",
          "Contenu": "Purchased Japan Ubigi Plan. Very poor and totally no reception indoor. Unable to make call via social media such as whatapps easily."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Pallab",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T06:10:19.000Z",
          "Titre": "Poor connectivity",
          "Contenu": "Despite being at locations with good connectivity, I kept losing network/data connectivity on Ubigi every now and then. There was this one time when I was walking around in Shibuya and everything was working fine and then I lost connectivity. It took 20-25 for me to be able to connect back to the internet on Ubigi. You might as well consider getting a data-only SIM in Japan."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T16:52:46.000Z",
          "Titre": "Unreliable connection in Japan",
          "Contenu": "Unreliable connection in Japan, Connect drops occur daily and needed when navigating using google maps"
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T11:03:55.000Z",
          "Titre": "Data drops in Tokyo",
          "Contenu": "In Tokyo, full bars, but no data connections for periods of time. Haven’t used 3 GB of a 10 GB plan. What gives?"
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Mameshibachan",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T19:21:20.000Z",
          "Titre": "When I talk to people with LINE without…",
          "Contenu": "When I talk to people with LINE without LINE, it is not easy to hear their voice."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T03:26:21.000Z",
          "Titre": "Internet was very inconsistent",
          "Contenu": "Internet was very inconsistent. Will not be using the service again"
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Brian L.",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T09:31:17.000Z",
          "Titre": "Good value, spotty service",
          "Contenu": "Good value, spotty and slow connection though"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T05:23:22.000Z",
          "Titre": "I was not getting very good speed at…",
          "Contenu": "I was not getting very good speed at all while I was connected at Fort Dent in Tukwila, WA. Set up and billing were fairly straightforward."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "customerAnne",
          "Nb_Reviews": 2,
          "Date": "2022-10-13T18:40:25.000Z",
          "Titre": "I spent quite a bit of time setting up…",
          "Contenu": "I spent quite a bit of time setting up Ubigi in advance of a trip to Europe. After a few hours spent setting it up and thinking I was good to go, I arrived in Portugal and could not activate the internet. I went to a Vodaphone store to ask for help. They were also not successful. I therefore had to purchase a SIM card, an added expense. I wish it had worked for me but based on my experience I cannot recommend Ubigi."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T22:23:28.000Z",
          "Titre": "Rather cheap but connection was quite…",
          "Contenu": "Rather cheap but connection was quite slow around Tokyo area."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "Kyle B",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T03:53:33.000Z",
          "Titre": "New eSIM on a new phone but old account issues",
          "Contenu": "Had to setup a new eSIM on a new phone.After I did that, when I went to create an account and logged in with my old information, the new eSIM didn’t report under the account.Took a while to get it reported that somehow some application consumed all the data. When I purchased a new eSIM, it had issues initializing and I spent 2 days trying to troubleshoot with little support.The whole process could be handled better by Ubigi."
        },
        {
          "Note": 3,
          "Lieu": "NP",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:38:18.000Z",
          "Titre": "Did not work due to overlapping plans",
          "Contenu": "Bought Asia plan prior to going to Nepal. It has not worked. Updating this as now working. Seems it is important not to buy overlapping plans as you get stuck on the first one."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer Japan",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T08:55:30.000Z",
          "Titre": "Not perfect",
          "Contenu": "Like: easy to activate. Works immediately on arrival.Dislike: connection can be unreliable and slow at times. There were times when I can’t load anything despite having full bars 5G."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Rick",
          "Nb_Reviews": 13,
          "Date": "2023-12-11T11:29:28.000Z",
          "Titre": "No low data/cost plans",
          "Contenu": "Have had no issues with data service but no lower cost small data plans e.g. 0.5Gb pm.Insufficient e-support service provides limited if not unhelpful advice.Is it AI rather than human?"
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:36:42.000Z",
          "Titre": "Eats up your data",
          "Contenu": "Data usage is more than what my phone is saying. The app says I have 1.09GB left out of 3GB but my phone is only showing 1.65GB of usage. That's more than 350MB missing and this gap continues to widen as I keep monitoring it. It is pretty reliable though"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pam",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:08:45.000Z",
          "Titre": "Disappointing Third Time with Ubigi!",
          "Contenu": "Used Ubigi for my 2 previous Japan trips earlier this year and had no issues with it. Decided on it again this time round and pleasantly surprised with the 50% discount code applied upon checked out. However service this time round was undesirable - there were frequent drops in coverage even in the city. If the discount equates to such service, I would rather not have the discount."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Victor",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T13:21:47.000Z",
          "Titre": "In Thailand I consistently only got 3G…",
          "Contenu": "In Thailand I consistently only got 3G service. A bit overpriced but convenient. Note: essentially 3G service ONLY throughout all of Bangkok (major city!)  regardless of geographic location or being indoors vs outdoors. I Rarely had anything better than 3G service, compared to my co travelers using a different e-sim service who consistently had 4G/5G while in the same location as me."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Martin",
          "Nb_Reviews": 8,
          "Date": "2023-12-10T00:57:31.000Z",
          "Titre": "After two years I still struggle with…",
          "Contenu": "After two years I still struggle with how Ubigi relates to Jaguar and my iPhone and what exactly Jaguar in-control is."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T12:38:01.000Z",
          "Titre": "Issues using e-SIM for Grab in SGP",
          "Contenu": "In SGP - Grab (SE Asia Uber) often didn’t work with the e-SIM. WhatsApp and internet were fine but I usually needed to connect to wifi to order a car and could not check progress during the journey. Not a showstopper but irritating. When I was leaving I was in a bar and needed to get a hotspot from a friend to order the car and then my friend needed to come with me to the pick-up spot so that I could stay connected (as traffic jams delayed the driver’s arrival)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Helen",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T04:05:12.000Z",
          "Titre": "Not so stable",
          "Contenu": "The network gets cut off when reaches certain part of Japan when I was in the Shinkansen. Even when travelling on the bus, the network wasn’t very stable too."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GypsySoul",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T03:12:27.000Z",
          "Titre": "•Liked that could load BEFORE leaving…",
          "Contenu": "•Liked that could load BEFORE leaving home•Did NOT like that Ubigi didn’t automatically load the TopUp•was locked out because couldn’t remember Password •didn’t automatically update from e-mail•lost $8.00 because of this"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Tim W.",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T18:03:52.000Z",
          "Titre": "It can do the job for internet connectivity",
          "Contenu": "It provides good Internet connectivity service. It has no issue with emailing, mapping, browsing on internet but I don’t know why my Instagram and Facebook weren’t working properly. I could not get any text message neither. The WhatsApp was working fine though."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:09:43.000Z",
          "Titre": "Was in Thailand and it took hours to…",
          "Contenu": "Was in Thailand and it took hours to get up and running"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T02:43:24.000Z",
          "Titre": "Spotty connection throughout Tokyo",
          "Contenu": "Spotty connection throughout Tokyo. Hakone and Yokohama is decent. Often need to toggle airplane mode for it to work again. Customer service is slow to respond to my complaint. Connection speed is nothing to shout about."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Christian",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T23:10:53.000Z",
          "Titre": "Impossible for the phone to scan the QR code inside the Ubigi email received on the same phone !",
          "Contenu": "I have a perfectly eSIM compatible iPhone 13 Pro Max and after purchasing the Ubigi eSIM I received an activation QR code by email on the phone which I could not scan with my phone. I had to forward the email to another phone to be able to scan it with my phone. I lost 4 days of usage out of my 7 days holiday trying to figure out why I had no mobile data access on my existing Ubigi eSIM. Not pleasant."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T10:16:58.000Z",
          "Titre": "The 5G is not stable at Tokyo",
          "Contenu": "The 5G is not stable at Tokyo. Often not able to load and need to wait for a while. Switch off the auto 5G and use LTE does not help. Perhaps ubigi can work with their telco partner to improve this."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Michaela",
          "Nb_Reviews": 38,
          "Date": "2023-12-01T08:19:35.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, fast delivery of everything. But the amount doesn't last the duration. This needs to be made clear. I thought the GB/MB would renew everyday. But they don't."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "New Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T00:17:24.000Z",
          "Titre": "Referral program comes with expiry date…",
          "Contenu": "Referral program comes with expiry date which does not make sense. No point giving out twenty 50% discount code but all have to be consume within 6 months. For comparision, Airalo's referral program does not have an expiry date."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T03:59:20.000Z",
          "Titre": "Could have been perfect",
          "Contenu": "Deserved 5* but unfortunately there are dead zones when using Ubigi. Lost connection when roaming in Kyoto, Tokyo Disneyland. Had to restart the phone multiple times to reinstate connection Otherwise, connection was very smooth the rest of the time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T17:30:19.000Z",
          "Titre": "Bad cell service",
          "Contenu": "Pretty much every country I've used Ubigi at has had signal problems in absurd places like in the middle of the city somewhere. I'm looking to try a different service..."
        },
        {
          "Note": 3,
          "Lieu": "VN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T01:30:14.000Z",
          "Titre": "Bought the esim for japan",
          "Contenu": "Bought the esim for japan, it was working smoothly most of the time. Stopped getting data service one morning and I emailed customer support. There was no response or any help provided. Esim started working again on its own after a while but had to buy a new esim from another provider in the interim."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T16:39:20.000Z",
          "Titre": "I need to always make my iphone in…",
          "Contenu": "I need to always make my iphone in airplane and online again to make the internet works.. and the whatsapp, cannot call immediately, the recipient does not notice that she is being called"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Reinhard Weber",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T14:50:25.000Z",
          "Titre": "There is still room for improvementMore payment options would be…",
          "Contenu": "More payment options would be beneficial. Why not PayPal possible? Not everyone has a credit card or similar. The price/performance ratio could be better."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T15:17:18.000Z",
          "Titre": "Average service coverage and speed…",
          "Contenu": "Average service coverage and speed eventhough i'm on 5G. This was in the span of 13 days in my trip to Japan in major cities - Tokyo, Osaka, Kyoto. I was on a 10GB/30 days plan and even topped up another 10GB on my 10th day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 5,
          "Date": "2023-10-10T05:44:11.000Z",
          "Titre": "Pros and Cons",
          "Contenu": "Like:1. Easy to signup, then get up and running.2. Good (not excellent) coverage using their chosen provider, but I wish we could have an alternative option where coverage is weak.Dislike:1. I would like to top-off in 1GB increments, rather than in 3GB increments.2. Their app is unnecessary."
        },
        {
          "Note": 3,
          "Lieu": "GU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T05:09:02.000Z",
          "Titre": "The Ubigi portal and customer support",
          "Contenu": "The Ubigi portal - website and on the app was very buggy and made it difficult to purchase a plan.  I had to try more than 7 times to finally get connected.The instructions are not the same as the actual process to finally get access.  I tried to purchase online but it never went through.  I had to use the app to purchase my plan.  I was not able to setup my ESIM until I got to the location.Lastly, trying to contact someone for assistance was very difficult.  I tried to use the online form, but it never allowed my submit my issue.  The form kept saying that there is something missing or incorrect.  Also, there is NO phone number that I could use to get help.  There needs to customer support that is easy to contact."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "daniel sasseville",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T14:04:42.000Z",
          "Titre": "went great for 7 days then refused to…",
          "Contenu": "went great for 7 days then refused to work. was stock in germany and needed internet so i bought a sim card like i used to do and everything went find for me after.i informed ubiji of the situation they responded a few hours later and asked to verify some items   but i could not wait since did not know how fast they would respond and needed internet to pursuit my trip in Europe"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T15:44:50.000Z",
          "Titre": "Basic LTE service-level in Japan",
          "Contenu": "Basic LTE service-level in Japan, but has a relatively slow and unstable connection quality overall.It has the merit of being affordable at least!"
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T19:03:50.000Z",
          "Titre": "Meh.",
          "Contenu": "Easy installation, price is good, but coverage (in metropolitan Tokyo) is strongly average. Lost all signal multiple times while in the middle of large open spaces"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T22:50:21.000Z",
          "Titre": "Setup instruction was outdated. Hard to set up but internet experience good!",
          "Contenu": "the setup was not as easy as shown in the instruction. Didnt work at all on s23 ultra and galaxy fold 4 on the first day of activating the service. have to do extensive researc on reddit. It turned out Roaming must be enabled to begin the service. Setup instruction was outdated.After everything was set up, the internet experience was very smooth."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Monica",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T02:30:01.000Z",
          "Titre": "connection was bad or non existent…",
          "Contenu": "connection was bad or non existent sometimes. not reliable"
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T11:10:42.000Z",
          "Titre": "Convenient but a battery power hog",
          "Contenu": "Love the convenience of initiating service before arriving in country. Setup was straightforward. The value is excellent. BUT it chews up my iPhone battery power. This is unfortunate for a fundamental travel app. When travelling one relies on the smart phone for mapping, reference, photos, etc. But when I have the Ubigi eSim enabled, my battery power is severely depleted. I hope you can make the app more efficient,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 3,
          "Date": "2023-09-16T11:08:41.000Z",
          "Titre": "Convenient but a battery power hog",
          "Contenu": "Love the convenience of initiating service before arriving in country. Setup was straightforward. The value is excellent. BUT it chews up my iPhone battery power. This is unfortunate for a fundamental travel app. When travelling one relies on the smart phone for mapping, reference, photos, etc. But when I have the Ubigi eSim enabled, my battery power is severely depleted. I hope you can make the app more efficient,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T00:15:36.000Z",
          "Titre": "Strong and stable network, but not easy to set up",
          "Contenu": "I bought for my trip to Japan. The network was very good, most time it was 5G while I was in Japan. However, the setup was very difficult. I setup my phone a day before my travel. I got errors constantly after I scanned the QR code that was given in the email.  Then I tried the second day which was a few hours before I got on the airplane. I got a different error that said my QR code was invalid. I had to call the customs service. I did not know what they did, they told me I joined the network. Indeed, I could see Ubigi in my phone's cell carriers. I almost gave up Ugigi to buy another service that my friend told me."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T22:18:32.000Z",
          "Titre": "At Osaka KIX airport I did not pick up…",
          "Contenu": "No signal acquired when I landed at Osaka KIX airport, it made needed travel coordination difficult.  I had to turn on my cellular data from my carrier to get myself out of the airport.  However, once in the city of Osaka, the Ubigi signal worked fine."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T15:43:44.000Z",
          "Titre": "Service is good",
          "Contenu": "Service is good. Is a little bit hard to setup, but overall easy to use. I got some issue with the auto selection of the provider, leading to « not connected to Internet », which is annoying. By default LTE seems to be the preferred network, rather that 5G, is this intentional? I’ve bought too much data for my stay, which is a waste of money. I would like to be able to trade-in for later usage or another formula to not trash euro like I did."
        },
        {
          "Note": 3,
          "Lieu": "NP",
          "Pseudo": "CRABTREE/ROBERT STEVEN",
          "Nb_Reviews": 4,
          "Date": "2023-10-15T05:48:23.000Z",
          "Titre": "After crossing into Italy from France…",
          "Contenu": "After crossing into Italy from France my connection died.  When I returned to France, I couldn’t get the connection back.  Although I had 9 GB and 25 days left on my plan, I had to buy a top up (3 GB) in order to regain connection.  Also, mostly could not get service in eastern Côte d’Azur."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T02:54:31.000Z",
          "Titre": "When assistance was required submitting…",
          "Contenu": "When assistance was required submitting the problem I had was not very easy Then i didn’t get help for the problem until many hours later close to 24hrsMaybe inform about the time frame you will come back with the assistance so it’s more clearThanks"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Tan",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T04:46:14.000Z",
          "Titre": "3/5 score even if the stars don't save",
          "Contenu": "Hmm weird, I am trying to give 3 stars but it changes back to 5 whenever I click on the box.My review is in two parts: Vietnam coverage and Japan coverage.For Vietnam, it's a 1/5. Service would cut in and out for no noticeable reason, even when I was sitting in one place. It would be there, full bars, for about a minute and then be gone, no service at all, for about two. It was, unfortunately, completely unusable.For Japan, it's a 5/5. No connectivity issues, it's been strong everywhere, works great.Averaged out, that's a 3/5. Do not use in southeast Asia, use without concern in Japan."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T05:34:06.000Z",
          "Titre": "Mostly good, but",
          "Contenu": "For the most part, very good. Easy to set up and use. There was a day in the middle of my usage where it just refused to connect; the website gave an error when I tried to contact them for help. However, in the evening it started working again and worked fine for the rest of the time I needed it, so I don't know what went wrong."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T17:43:10.000Z",
          "Titre": "Nobody to guide you",
          "Contenu": "No real person to talk to in order to guide you when the setup is not working. It took days to get the esim activated. Very frustrating. The coverage wasn't awesome but it was decent."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T12:25:10.000Z",
          "Titre": "The overall network speed was terrible",
          "Contenu": "The overall network speed was terrible, even though I had 5G"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T00:39:08.000Z",
          "Titre": "Issues with connectivity",
          "Contenu": "In London was easy for me to connect, while going to Brasil it is not connecting at all"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T19:04:39.000Z",
          "Titre": "Problematic activation, app useless, no overview",
          "Contenu": "One you activate the service, it’s fine, but the activation was painful. The app is pretty much useless, comparing to other ones, here is no overview of how much data you already used."
        },
        {
          "Note": 3,
          "Lieu": "SK",
          "Pseudo": "Juraj",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T12:53:16.000Z",
          "Titre": "Useful travel companion.",
          "Contenu": "Very good prices for unusual or far away locations. Easy to understand data packages and plans with quick payment activation. Few downsides: The app would not always sign in automatically even if on Ubigi network with active data plan. The data consumption in the app is not accurate - my connection stopped during the videocall even if the app still showed 114MB left."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "cliente",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T16:30:34.000Z",
          "Titre": "Muy fácil de activar y de llevar…",
          "Contenu": "Muy fácil de activar y de llevar control del consumo. La cobertura podría mejorar. En algunas zonas no tenia cobertura cuando con otra tarjeta del país sí.I've tried to send you a message but I've got the message: \"There was an error trying to send your message. Please try again later.\""
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Clive Odom",
          "Nb_Reviews": 28,
          "Date": "2023-09-18T12:03:41.000Z",
          "Titre": "Network coverage is disappointing",
          "Contenu": "Coverage is disappointing, when there is a signal, data works well, but unfortunately on the Isle of Wight, coverage seems to be little better than my other provider. Installing the e sim was straight forward. So good in that respect and price is reasonable. I was hoping that being a different network my data coverage would be improved, but does not appear to have much better coverage than O2 on the IOW at least."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T21:46:26.000Z",
          "Titre": "Connection issues 5G to LTE",
          "Contenu": "When it switches from 5G to LTE in Tokyo you loose connection and either need to put the phone (iphone) in airplane mode or disable 5G and only use LTE, this happens to all of us in our group that is using Ubigi"
        },
        {
          "Note": 3,
          "Lieu": "MK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T17:04:13.000Z",
          "Titre": "Coverage and signal strength good but…",
          "Contenu": "Coverage and signal strength good but overpriced and not enough data per package. Service/platform is asking for too much money and giving too little in a time of extreme connectivity and high volume video calling. Packages should offer more."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "Abcd",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T08:12:36.000Z",
          "Titre": "Poor or slow connection in some areas",
          "Contenu": "1. Unstable or very slow reception in some areas of Paris - metro stair entrances and indoors. 2. YouTube instructions are outdated - please update to current format to avoid confusion.3. Explain why there is 1+ GB data consumption even before landing in Paris ?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "EL",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T20:35:15.000Z",
          "Titre": "No reception in Page & Grand Canyon",
          "Contenu": "In general, i like Ubigi because of the affordable price and good quality. I used it in Hong Kong, Japan and Taiwan, the reception was good. This time I used it in Phoenix, Page and Flagstaff aera, the reception was minimal. Grand Canyon area has no reception at all!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "michael williams",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T09:53:04.000Z",
          "Titre": "better than T-Mobile but not great",
          "Contenu": "This was better than T-Mobile,  but it still was spotty in terms of connection and speed (in Japan); despite saying I had perfect reception all the time.  The app was helpful to install. I will try someone else next time.I was all over Tokyo Osaka and Kyoto. The slow speeds were in all 3 cities so it is not “oh you were in a bad area”  type thing."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "GARTH",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T00:45:04.000Z",
          "Titre": "eSim (Tokyo)- slow & unreliable connection",
          "Contenu": "eSim (Tokyo) was easy to install etc. however signal kept dropping out.or not connecting at all. Had to switch phone to flight mode regularly to restart mobile connection. Unsure which telco Ubigi use but 5G was slow (when it worked). I’ve had faster 4G when home in Australia. Would’ve thought 5G in Tokyo would be super fast and reliable- not the case. Disappointing and frustrating for the amount of money paid."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T14:14:06.000Z",
          "Titre": "Data was fine ok in Tokyo, however……",
          "Contenu": "Data was fine in the general Tokyo area, however I completely lost connectivity once I traveled to Osaka. Ubigi was visible on my screen as well as LTE and 5G alternatively the entire time I was there, however I completely lost connection. I followed the instructions offered on the app (when my phone would connect) and nothing worked. I am now in need of data and connectivity for my last three days here in Tokyo. I’m not sure how to proceed. I’ve used a competitor’s app in Thailand without any issues. Unfortunately, reviews of that app in Japan left questions. Anyway, this was my experience with Ubigi."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T00:59:10.000Z",
          "Titre": "It was OK, but ---",
          "Contenu": "I have used a rental wi-fi router several times before. esim from Ubigi was very easy to set up and connect.  It was very comfortable to go everywhere without extra battery and a router.   However, the connection speed was not high enough (probably because of roaming). Compared with a Wi-fi router using DOCOMO signal, it was very slow.  I expected more. Yahoo Japan did not allow to access, although it is not a your problem.  If 5G can be used, it would be better."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "Abi",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T16:20:15.000Z",
          "Titre": "Cheap and stable.",
          "Contenu": "When it comes to price and flexibility, Ubigi is definitely your choice! The only problem I have is the internet speed when traveling in japan. I'm getting almost 3G or slow 4G speed most of the times even though the signal shows 5G. If the speed is your priority then better to find another service. Otherwise go for it."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T22:23:35.000Z",
          "Titre": "I bought Asia 1G three times.",
          "Contenu": "I bought Asia 1G three times.Travelled Japan-Singapore(transit)-Mumbai-Singapore(July 14)-Japan.On July14 I could not use internet at all.Only when wi-fi is available,I could use internet. I was really in trouble.The carrier was M1.I sent request to ubigi, and got useless reply. With no improvement,I can not travel only with ubigi,I need backup wi-fi router.Please solve the problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T03:18:40.000Z",
          "Titre": "Ubigi worked quite well in Japan",
          "Contenu": "Ubigi worked quite well in Japan using Google maps to get around.The initial set up was pretty straight forward although I could have used a bit more clear instructions on turning off my primary number in a wifi area in order to make Ubigi the only cellular connection.  Once I figured this out it all worked well."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ann",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T16:28:15.000Z",
          "Titre": "Used this in the centre of Tokyo, inconsistent and slow",
          "Contenu": "Used this in the centre of Tokyo and the data was very slow, and extremely inconsistent. Websites and google maps would just stop refreshing out of nowhere. Comparatively to Korean esims, Ubigi was nowhere near consistent or as fast.Although one plus is the connection was easy."
        },
        {
          "Note": 3,
          "Lieu": "VN",
          "Pseudo": "Kenny",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T12:44:03.000Z",
          "Titre": "Not smooth UX",
          "Contenu": "1. Could not connect initially because the APN information was incorrect. According to FAQ the value should be \"mbb\". Needed to find a public wifi and dig into FAQ to know about the above \"trick\" WITHOUT internet connection from Ubigi. 2. Connection in Barcelona is painfully slow (only 3G). Because of this, only 4GB was used out of 10GB purchased in 1 week. The rest was wasted."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Samantha Christian",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T16:39:24.000Z",
          "Titre": "Was a fairly easy set up but it took 3…",
          "Contenu": "Was a fairly easy set up but it took 3 days to properly work, even though it showed I had signal 5g or lte nothing was actually downloading. The 1g I had went thru in 4 days & I wasn’t even streaming anything. Wondering if it was continually trying to connect & hence using up all the data. I even put on airplane mode when I knew I was out of range."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jimmy Huang",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T14:48:39.000Z",
          "Titre": "Good eSim for traveling in Japan, South Korea.",
          "Contenu": "Easy to use, good speed most of the time. good rate in Japan, South Korea but very expensive in Thailand."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "SG customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T00:15:31.000Z",
          "Titre": "Coverage is very bad in London.",
          "Contenu": "Coverage is very bad in London.I was at tourist location most time and having choppy connection. No service once enter tube station, and totally disconnected underground. Even at shopping district like Bond street and Oxford street, no service once I enter the building."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T22:37:31.000Z",
          "Titre": "I used Ubigi on my trip to Japan and it…",
          "Contenu": "I used Ubigi on my trip to Japan and it occasionally dropped service on my phone, about 2 times every day. I had to reconnect my esim every time this happens. My friend also had Ubigi on her phone and after midway into her trip it started disconnecting too. When it did connect it was very fast, but it was unreliable."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Dan N",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T11:12:03.000Z",
          "Titre": "Decent enough!",
          "Contenu": "It was easy enough to set up but hard to see how much data you are using as you go. Mine also seemed to run out almost suspiciously quickly."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "walton",
          "Nb_Reviews": 3,
          "Date": "2023-05-17T00:49:16.000Z",
          "Titre": "Convenient",
          "Contenu": "The convenience of landing at the airport and turning on high speed data is fantastic. Not having to deal with buying, mailing, and returning SIM cards is much appreciated. However, the signal could be stronger. At the back of convenience stores, I often had weak signal, and this is within Yamanote Line areas."
        },
        {
          "Note": 3,
          "Lieu": "PA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T18:32:54.000Z",
          "Titre": "very easy to use and the best way to…",
          "Contenu": "very easy to use and the best way to obtain roaming at a reasonable price all over the world.  Unfortunately, there is very possibilities to interact with Ubigi if a problem or doubt arise.  No chat or whatsapp, only possible com is sending an email that is rarely responded"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andy Wallace",
          "Nb_Reviews": 12,
          "Date": "2023-11-10T16:13:59.000Z",
          "Titre": "It's very difficult to manage the Ubigi…",
          "Contenu": "It's very difficult to manage the Ubigi account. I have just sold my car and cannot see how to cancel the plan :("
        },
        {
          "Note": 3,
          "Lieu": "RS",
          "Pseudo": "Lazar",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T09:07:00.000Z",
          "Titre": "Two eSIM active in the same time.",
          "Contenu": "Using Ubigi it is not possible to have two eSIM cards active at the same time. Mobile application is not moderns and in some cases you need to refresh few times main screen to check current state. Rest of is good, works fine."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "David Lee",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T02:09:58.000Z",
          "Titre": "Service and coverage feel average",
          "Contenu": "Service and coverage feel overall average.  The ux was decent except I couldn’t log out of my mother in laws account for some reason.That said, being able to have data outside of roaming is a MUST, and the fact that this made it possible is accomplishment on its own~"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trip to Italy",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T13:38:52.000Z",
          "Titre": "Coverage spotty - Italy",
          "Contenu": "Coverage was inconsistent, sometimes good sometimes poor even in the big cities. At times the my phone showed 5G service but web browsing was super slow and froze. Other times browsing was fast and worked fine. I used the data mainly for navigation and occasionally directions did not update until I moved to another area. Perhaps service would be more consistent if they had agreements with more than one carrier and could switch dynamically to the best available signal?"
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T09:24:55.000Z",
          "Titre": "There was a day in Frankfurt where I…",
          "Contenu": "There was a day in Frankfurt where I couldn't connect to Ubigi all day."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Alex",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T15:42:59.000Z",
          "Titre": "Not knowing the price before activation…",
          "Contenu": "Not knowing the price before activation was a real downer.  If you're competitive, then just publish ahead of time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T05:11:54.000Z",
          "Titre": "Good cellular service, bad customer service",
          "Contenu": "The cellular service usually works ok, but the customer service is unresponsive. And yes, I checked my junk folder."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T23:37:58.000Z",
          "Titre": "Your signal is weak in England",
          "Contenu": "Your signal is weak in England. In particular, we couldn't have a lot of times that receiving signal in buildings."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T01:54:57.000Z",
          "Titre": "Your server denied payments and show…",
          "Contenu": "Your server denied payments and show error message for almost two days. I originally thought it was credit card company’s problem and even called them. But it turns out it’s your problem. It made me nervous wondering if I would be out of network in a foreign country."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bree",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T23:09:17.000Z",
          "Titre": "Good but not perfect",
          "Contenu": "It would get 5 stars if service had not gone out for several hours one day. There was no way to contact support, receive assistance, troubleshoot, or know how long the service would be out."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T05:54:16.000Z",
          "Titre": "Good for data but no calls",
          "Contenu": "worked well to an extent (data) but could not find a way to have connection to physical sim and e-sim at the same time so could not get calls if I needed data. Using I-phone 12 Pro but could not find solution in FAQs although problem was discussed. Still not sure if it was phone or user error."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T02:21:25.000Z",
          "Titre": "The connection was unstable in Japan",
          "Contenu": "The connection was unstable in Japan. Sometimes I had Internet, sometimes I didn't. Especially in crowded places like airports, it wasn't reliable."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Thomas White",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T14:51:22.000Z",
          "Titre": "Not good in Nevada",
          "Contenu": "I thought that I would be able to make calls as well, but that option was not available.  The signal was intermittent in Nevada USA and in the end, I stopped using it. I will not buy a new plan."
        },
        {
          "Note": 3,
          "Lieu": "BN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T03:59:57.000Z",
          "Titre": "Unsure if drop in signal was due to…",
          "Contenu": "Unsure if drop in signal was due to place or the telco?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T03:56:22.000Z",
          "Titre": "Cons:The instructions for setting and…",
          "Contenu": "Cons:The instructions for setting and activating the esim are confusing. The video instructions on the website are also very outdated.Pros: once esim is up and working , speed is fast and pricing of plans is very competitive"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Khanh Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T00:07:12.000Z",
          "Titre": "The network went off often during our…",
          "Contenu": "The network went off often during our trip of 18 days. It annoyed the most when we were driving and using google map."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T22:51:38.000Z",
          "Titre": "Would try again.",
          "Contenu": "Everything worked well on arrival, but on my last day I lost total connection to the service. I was not out of data yet, but could not reconnect back to the network. Thankfully I was in a metropolitan area and was able to connect to the wifi then I activated my physical sim and paid the daily international fee."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Vesku",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T05:49:48.000Z",
          "Titre": "Connection in japan was not that good…",
          "Contenu": "Connection in japan was not that good always. Sometimes I had to even restart my phone to get mobile data working. The previous time in japan I was using My Truphone service, which was working perfectly. I will go for Truphone next time also."
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T18:32:54.000Z",
          "Titre": "Service worked in most places…",
          "Contenu": "Service worked in most places adequately, but in Vietnam it was very very expensive for just so so data (wasn't that fast). Worked well in Japan. Wish it worked better for the price we paid in Vietnam."
        },
        {
          "Note": 3,
          "Lieu": "NO",
          "Pseudo": "Jahn Martinsen",
          "Nb_Reviews": 4,
          "Date": "2023-10-30T14:56:01.000Z",
          "Titre": "In the first 2 days it was not in…",
          "Contenu": "In the first 2 days it was not in function . Bad covering som places! Overall ok when funcioning."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T04:44:56.000Z",
          "Titre": "The internet connection is good but sometimes gets lost.",
          "Contenu": "There were some instances when there is no internet connection when I need it the most during my stay abroad. But overall, it's still a good experience. I'd still use ubigi again in my next travel~.  Hopefully the it will improve more in the future."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "JQB",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T01:21:11.000Z",
          "Titre": "Difficult installation",
          "Contenu": "It was incredibly difficult to set up ubigi via my phone - the installation process for the eSim hung over and over again - even restarting the phone (android) did not help. In the end, I was able to install with the additional help of a laptop. Not a positive use experience (in contrast the airalo eSim is much easier to install)"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "jeremyw",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T03:20:47.000Z",
          "Titre": "Generally Good",
          "Contenu": "I went to Japaqn using Ubigi. I was quite nervous about relying on an Esim, but Once it was set up it was fine around Tokyo, Mount Fuji area, Kyoto and Hiroshima. However once I got to the Osaka area I had very patchy and then no connection and it became very frustrating.I paid £13 for 10Gb for 30 days. I used about 7Gb in total My wife took another option and bought 2 Japanese SIM cards which cost £15 each for 1 week each, (to make sure one of us had a signal. She didnt have a connectivity issue)  so clearly a big cost difference.I would use them again"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Glenn Evans",
          "Nb_Reviews": 7,
          "Date": "2023-11-28T09:56:24.000Z",
          "Titre": "The how to use instructions could be…",
          "Contenu": "The how to use instructions could be clearer"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Neal Sosdian",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T11:36:37.000Z",
          "Titre": "One 30-day 10GB passes wasted, one recovered with Ubigi assistance",
          "Contenu": "I bought two 30-day 10GB passes for $24 each (total $48) but had trouble installing the pass for my wife.  Because I could not get any customer service, I ended up deleting both eSIMs and gave up.  Complete waste of $48 because of zero customer service.  Regardless of directions and videos, some customers will have a problem.  You need to provide a service for them too.Addendum:  Ubigi sent email soon after my review first posted, and they corresponded repeatedly until both eSIMs were recovered and connected to the data plans I had purchased.  Hence my rating is changed from 1 to 3 stars.It is 3, not 4 or higher, because my wife’s data plan is still not 100%.  While it works and she is clearly using some Ubigi data as intended, somehow our primary cell plan is still getting data requests and therefore charging us $10/day for international data.  Perhaps this is our mistake in how the phone is set up, nonetheless it totally defeats the purpose of buying an additional data plan as offered by Ubigi (and competitors)."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Ali Mechichi",
          "Nb_Reviews": 3,
          "Date": "2023-05-02T13:38:19.000Z",
          "Titre": "The idea and the concept are really…",
          "Contenu": "The idea and the concept are really useful and innovative but the pricing is still on the higher end, I'm waiting for a day when the price of esim will be around the same (if not lower!) of the classic sim cards."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T01:13:00.000Z",
          "Titre": "Get a local SIM card",
          "Contenu": "Not enough GB at a reasonable rate.  I would have been better off buying a local SIM card"
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Tracy",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T15:45:24.000Z",
          "Titre": "App needs to Improve",
          "Contenu": "The app didn’t work … didn’t show how much was left.Ubigi has just contacted me to tell me I can do what I was doing everyday - which was checking the info on 'my data plans'. This shows that I have 8.92 Gb left on one and 3 Gb  left on the top up. Oh yes, forgot to mention, I topped up because I no longer had any data remaining. For one-off data plans the app does not work. Simple."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T00:21:54.000Z",
          "Titre": "Hit and Miss",
          "Contenu": "Went to Las Vegas and honestly it was really spotty where as my friend was on the AT&T and the reception was good. Used it in the UK and it was pretty good so I think it is a hit and miss depending which carrier Ubigi uses in that area."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Fernando Terrádez Picó",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T22:34:36.000Z",
          "Titre": "Sometimes it doesn’t work as expected",
          "Contenu": "There are areas where this network does not work properly so I had to use another SIM card from ATT or Verizon."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Shai Miller",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T01:19:24.000Z",
          "Titre": "Hard to setup, losing connection",
          "Contenu": "Hard to setup, not a simple way like airalo.Also connection is sometimes lost for no reason."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T04:18:01.000Z",
          "Titre": "Did not always work in some remote…",
          "Contenu": "In New Zealand it did not always work in some remote areas. Speeds were not as fast as my home mobile data. Reasonably reliable and faster than free wifi when I could get it."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T20:53:32.000Z",
          "Titre": "I had to buy it a second time before it…",
          "Contenu": "I had to buy it a second time before it worked. The initial interface is not intrusive please stay with one way to create an account not three."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tokyo traveler",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:15:16.000Z",
          "Titre": "Wonderful for Japan travels",
          "Contenu": "Pros : It worked wonderfully while I traveled  to Japan. Plans were affordable Cons : 4 Stars because the set up process was not exactly the same as shown on website instructional video. I was really unsure about whether it would work or notFortunately it did work when I arrived in my hotel and had solid Wi-Fi to finish up and activate the data plans. Overall it was a good experience using Ubigi"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Kunde",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T17:40:44.000Z",
          "Titre": "Mostly perfect",
          "Contenu": "Worked perfectly fine and was easy to activate. Only 4* though, because Ubigi lacks the option to buy an eSIM in advance and activate it at a later date. I’m more of the cautious kind so I prefer to buy an eSIM at 1 or 2 days before my travels, just in case something goes wrong and I need to contact customer service or even switch to a different eSIM provider. But because the eSIM activates immediately I lose those 1-2 days of the usage period.Hope they’ll add in such a feature in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T14:32:03.000Z",
          "Titre": "Highly recommended!",
          "Contenu": "Never had an issue with reception and the speed was generally great (compared to others that were using different services). The app tended to be a bit slow in updating available/used data."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:42:32.000Z",
          "Titre": "It jumps around the location of the…",
          "Contenu": "It jumps around the location of the service (London, Eng., then Delaware) which causes me to be blocked from my office system at times."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Longfei",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T08:44:11.000Z",
          "Titre": "Generally great experience in Japan",
          "Contenu": "Generally great experience using ubigi in Japan. However, there are two times in my seven-day trip when I need to restart esim to receive signal. One of them is in a subway station, the other time is walking on the street in Shinjuku using hotspot."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Benedict",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:06:07.000Z",
          "Titre": "Ease of data services on iPhone",
          "Contenu": "Satisfaction with the ease of using data services on my iPhone and appreciate respond quickly with my refund request."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T11:38:42.000Z",
          "Titre": "Got connected in Japan.",
          "Contenu": "Made me connected during my travel in Japan. No need to search local esim providers for each travel. There was no IPv6 connectivity, so I have to use VPN to reach IPv6 only internet. There was a bug, then notebook say \"Connected, no internet\" that confused me, later discovered internet working. Overall functional service, but there are some to improve."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Jens Humke",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T07:06:56.000Z",
          "Titre": "getting a phone number to make domestic calls",
          "Contenu": "The service is great and signal strength is good as well. I had some minor connectivity problems after updating to my second plan since I stayed for over a month. Also an option to get a domestic phone number would be great since making calls locally is a great plus. Also some apps would not let you register unless you enter a domestic phone number.Overall I am quite pleased with the service and the simplicity of the service."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T07:14:41.000Z",
          "Titre": "Very good speeds and coverage…",
          "Contenu": "Very good speeds and coverage especially compared to other times I have traveled to Japan and have used a tourist SIM. There were however several times where I didn’t know if I had data remaining or not. I tried to reset my phone in order for the data to work and had limited success with that.I would like to see a plan where you get X GB of high speed data and then unlimited throttled data in Japan or plans that last 7,14,21,28 days and are competitive with what tourist other SIM offerings are available. It sucks running out of data and are now unable to navigate without data and topping up at this point makes no sense."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Priyank",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T14:41:19.000Z",
          "Titre": "Easy set-up. Good coverage. Low speed",
          "Contenu": "E sim option makes it easy to set it up at the upon landing itself. Good coverage in Fuji five lakes area, Kyoto, and Tokyo. Speed is quite slow and it's nearly impossible to browse the internet in congested areas, which is many temples, shrines, and popular railway stations."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "A.C",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:30:34.000Z",
          "Titre": "Pretty good for the price",
          "Contenu": "Data would cut out occasionally. It would also be nice if it came with a temporary number."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Dr Bob",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T20:53:12.000Z",
          "Titre": "Very useful but could be better",
          "Contenu": "Bought 1 month \"Americas\" service for a trip to Guatemala. 4G data worked well in popular tourist areas, but outside those it was 2G at best. However, locals were clearly able to stream music over 4G nearly everywhere on their phones, so it seems that Ubigi do not have good enough roaming agreements in that country."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "R & R",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T18:54:16.000Z",
          "Titre": "Everything worked directly upon…",
          "Contenu": "Everything worked directly upon arrival..Coverage was great, but at some points it could’ve been better. For example, my friend using a different provider had coverage while I didn’t.. but did happen only once or twice.. would use it again!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Shyami",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:29:27.000Z",
          "Titre": "Ubiji was easy to use but App install was slow..",
          "Contenu": "Ubiji was easy to use once App was installed. Good prices and package options.However Installing the App was a slow process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sorf",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T07:03:06.000Z",
          "Titre": "Pretty good",
          "Contenu": "Pretty good though sometimes the WiFi cut out at inopportune moments (when lost and trying to use Google maps!).  However, not easy to install - took a lot of guessing (have a Google pixel 7a)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RG",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T10:05:43.000Z",
          "Titre": "Service was good almost everywhere",
          "Contenu": "Service was good almost everywhere. The only time the signal was weak was when I was at Tokyo Disneyland."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julie PN",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T04:02:38.000Z",
          "Titre": "It works for the most part but sometime…",
          "Contenu": "It works for the most part but sometime it is very very slow for LTE and I am in the city in a busy district."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Edward",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T04:20:37.000Z",
          "Titre": "Great !",
          "Contenu": "Provided me with enough stability of speed and connectivity throughout Japan and most indoor locations. Thank you. Would have been better if the data remains available for small and slow speed usage such as messaging even after going over the quota, for emergencies."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "SS",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T00:29:42.000Z",
          "Titre": "Service was fantastic",
          "Contenu": "Service was fantastic! Easy to use and very affordable. Would definitely recommend to friends.One note would be that it seems the email marketing kicks in immediately on sign-up and proceeds to hit customer inboxes what feels like 2-3 times per week. Recommend chilling out on the email campaigns for new customers - it's spammy, takes away from the streamlined experience of the app and customer UX, and straight up just feels a bit archaic."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teresa",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T22:52:00.000Z",
          "Titre": "Easy to set up",
          "Contenu": "Easy to set up. But there were a number of times where I had to hand off navigation to another person in our group because the signal was poor."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 3,
          "Date": "2023-11-26T06:19:17.000Z",
          "Titre": "Good but not perfect",
          "Contenu": "Good but not perfect, as I had no service in Hakone, Japan. Maybe I should have known better because it’s a mountainous town, and not a big city. If you’re going to a more popular area, like Tokyo and Kyoto, then Ubigi will work just fine. If you’re going to the countryside or mountains, service may not work. Other than Hakone, Ubigi was great!"
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T00:24:24.000Z",
          "Titre": "Good data connection during trip",
          "Contenu": "I had good speed during my whole trip! The only problem I had was learning how to turn on Ubigi when I got to my trip country and not sure what to turn off for my iPhone data to still allow imessages. I recommend Ubigi give specific step my steps with pictures when people first sign up on Ubigi. The current instructions you have were ok but too generic and was unclear how to specifically keep iMessage working. Other then that, I recommend Ubigi!"
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Joe John",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T13:32:38.000Z",
          "Titre": "Great for most of my Japan trip",
          "Contenu": "Was really great for most of my trip spanning all of Japan.  However, when I got to Kanazawa, the service became slow and unreliable.  Would have been 5 stars if not for Kanazawa."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "cliente",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T08:17:01.000Z",
          "Titre": "Everything perfect besides when…",
          "Contenu": "Everything perfect besides when connection stopped and I could not confirm from the app that the data were finished. Bought some more credit and connection restarted."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:55:26.000Z",
          "Titre": "Very affordable pricing Plans with fast…",
          "Contenu": "Very affordable pricing Plans with fast internet speed. The only signal down times I had while traveling in Japan was when the speedy train passing through tunnels and some odd locations in the suburban areas."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "CL",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T11:45:04.000Z",
          "Titre": "Straightforward usage, fast connection speed",
          "Contenu": "Straightforward with clear instructions on how to use. Sometimes connection is a little choppy, but not sure if it was due to Ubigi or the local telco connection being choppy across the board. When it worked (which was most of the time, connection was fast. Would recommend for usage in Japan (was used in Osaka, Tokyo and Kyoto)."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Stephen",
          "Nb_Reviews": 13,
          "Date": "2023-11-15T22:59:12.000Z",
          "Titre": "Mostly a positive experience.",
          "Contenu": "Not sure why you suggest 4* is 'not good'. But I refuse to give 5* if the experience is not perfect.Actually we were very happy to discover Ubigi when visiting Japan and China. In general the experience was helpful and positive. Just one criticism. It is frustrating to run out of data just before you leave the country and have to pay for further data, much of which will be wasted."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "DVcustomer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:50:44.000Z",
          "Titre": "I had trouble getting started",
          "Contenu": "I had trouble getting started. Once I had paid for the app I thought that’s it. I followed instructions but could not get going.  The instructions were confusing"
        },
        {
          "Note": 4,
          "Lieu": "BN",
          "Pseudo": "Verd",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T00:46:08.000Z",
          "Titre": "Excellent service overall",
          "Contenu": "I would rate this a 4.5 stars. Connection was great. Connected most of the time while in Tokyo and Chiba. Although at high density area (eg. Disneyland), the connection sometimes get slow and loading the pages takes more than 10~15 secs, I'm guessing this might relate more to the network provider itself. Overall it is still a great experiece getting connected once the plan landed and I would definitely use your service again."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Craig",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T14:12:43.000Z",
          "Titre": "Great reception all over Japan",
          "Contenu": "Great reception all over Japan. The eSim works great. However there was no warning that we had used our 10GB of data 2weeks into our 3 week holiday. You can however see your Sim data usage. Easy to top up with the app"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T18:43:06.000Z",
          "Titre": "It worked great",
          "Contenu": "It worked great, but my directions in Google Maps came out in Japanese. We couldn’t figure out how to change it. So couldn’t use my phone to navigate anything too complicated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T18:51:47.000Z",
          "Titre": "Great for traveling",
          "Contenu": "Data plan was cheap but effective for Japan. The speed wasn't incredible, but I didn't need it to be. The plan was easy to activate and top up, with coverage everywhere I went. The only thing I wish I knew was that this esim would not give me a phone number and I would not be able to text and call. This would have been really useful to know."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T03:25:21.000Z",
          "Titre": "Connectivity in Japan excellent, minor bugs in app",
          "Contenu": "Connectivity in Japan excellent. Only issue is with the app.. on Pixel 7 at least it always rotates 90° on start-up and cannot be rotated after that. So if you start it in portrait it changes to landscape which is just annoying but more importantly, you can't buy plans as payment pop-up doesn't scroll. Work-around is to start it in landscape."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T12:23:10.000Z",
          "Titre": "everything is pretty good on the japan…",
          "Contenu": "everything is pretty good on the japan roaming side of things, but your app needs to improve, especially for login and payment methods.  u need to give us google login or the option of using password manager selection, also google pay is needed for making payments (don't want to save my credit card on your app)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:01:35.000Z",
          "Titre": "good connectivity",
          "Contenu": "good connectivity. 5g in most areas, but rough in crowded areas. only complaint - as my plan was winding down, it felt like speed was throttled. i would prefer it not do that so i can start my next plan sooner."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "ChNg",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T17:50:04.000Z",
          "Titre": "Straight forward & easy to use.",
          "Contenu": "I wish the app allow me to purchase the eSim plan ahead of time before my trip & just simple activated it when you are at the destination. I don’t like the fact that the the plan active right the way upon purchase."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Emilie Dion",
          "Nb_Reviews": 4,
          "Date": "2023-10-31T05:44:35.000Z",
          "Titre": "Worked okay. Communication with ubigi should be improved.",
          "Contenu": "In Korea, Busan & Ulsan. Experience was okay. Suddenly lost all connections for an entire day. Inactivating and reactivating the sim made it work for 30 sec, then connection got lost again. Tried to contact Ubigi to no avail. Poor communication.Connection came back the next day and worked well."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T20:50:04.000Z",
          "Titre": "Easy",
          "Contenu": "Quick, immediate, easy! :)I didn’t see a button / field where you could choose when the data plan should be activated. That would be nice. In France, my phone often showed „LTE“ but the download rate was extremely low nevertheless. Probably not your fault, though."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "bblong",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T14:17:45.000Z",
          "Titre": "Internet was available in a lot of…",
          "Contenu": "Internet was available in a lot of areas, however, if it was not a major city (I.e. Nara) there would be a bit of struggle to obtain good internet. Within city centre was decent. However, still not strong enough to play co-op games without disconnecting at times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T23:10:52.000Z",
          "Titre": "Super easy to use",
          "Contenu": "Ubigi was super easy to use, my only nitpick is that when my data runs out, it would be nice to get a notification or see it in the home page of the app"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:42:13.000Z",
          "Titre": "Overall great use",
          "Contenu": "Overall great use. Took a little bit of time to actually set up but it worked decent. There were some periods of time where it is extremely slow or doesn't connect but otherwise can be trusted."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Timothy Lambing",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T03:49:20.000Z",
          "Titre": "Better than data packages from home.",
          "Contenu": "Very easy to buy data packages and (when you have a phone with eSIM), very easy installation of the eSIM. Price for 3GB data package in Japan was reasonable ($8), especially when comparing to data packages my service provider offers. Only slight downside was the speed not being higher than LTE speeds (which very well might not be Ubigi's fault)."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T06:23:01.000Z",
          "Titre": "Ubigi Japan Review",
          "Contenu": "Ubigi was the highest recommended esim from my online research. Esim worked great but not perfect, as there were a few areas in Japan where I had no internet randomly.Only other negative was that I found setup to be very troublesome as the website was barely working on the day I tried purchasing the esim - instead I had to purchase through the app.Overall - would definitely recommend but try to purchase the esim before you travel and then you can activate it overseas."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SL",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T07:11:26.000Z",
          "Titre": "Seamless to use",
          "Contenu": "Relatively easy to use with YouTube videos (would prefer a printable PDF).  Seamless functionality.  The only thing that would make it better is instructions on how to be sure that your provider will not consider you to be roaming"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T02:01:40.000Z",
          "Titre": "Pretty straightforward, a few bugs",
          "Contenu": "Pretty straightforward and fast process for getting started. (Except for needing to scan a QR code - hard to do if you only have one device). Occasional data dropouts during the trip, and it would have been good to have more warning when getting close to using up data. Otherwise a painless and affordable option when traveling."
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Tomi P",
          "Nb_Reviews": 4,
          "Date": "2023-10-18T04:01:00.000Z",
          "Titre": "Works very well in Japan",
          "Contenu": "Works very well in Japan, forget the antique ”pocket wifi” devices! Minus one star because one evening we got a notification and email that all of the plan data was used, and data traffic did not work. Purchased another plan in the morning, and then the original plan reappeared! Will seek refund for the extra plan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Russ Young",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T00:14:09.000Z",
          "Titre": "Good alternative",
          "Contenu": "Generally, having Ubigi was nice to have although there were some dead spots (this was in Japan).  However, as a backup we also used the roaming service from our normal carrier which was, in some situations, more reliable."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Duncan Rawlings",
          "Nb_Reviews": 20,
          "Date": "2023-11-12T10:51:10.000Z",
          "Titre": "Renewal process was reasonably simple…",
          "Contenu": "Renewal process was reasonably simple although being told the username was already in use was confusing.  I know it was because I set up at the outset. Otherwise the system works well for allowing vehicle updates & for using the maps for navigation but otherwise having WiFi in a car is for us, of little benefit"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T20:55:12.000Z",
          "Titre": "We found the price was reasonable, but set up was challenging",
          "Contenu": "We found the price was reasonable. Once we got it working we were happy with its functionality.  We scored it high because of that The set up was not well designed and the video did not explain it well.  My husband and I installed it on the same evening and we got different screens requesting different demographic info.  If we had not had the help of our computer savy son we probably would not have persevered. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T11:48:19.000Z",
          "Titre": "Cost to performance is great",
          "Contenu": "Cost to performance is great. In japan though you do run into a few hiccups in service when going in and out of buildings or using the trains/subway compared normal cell service. Just takes a few moments to reconnect or locate you.Overall it's a great service though with very little lasting connection issues.The installation process could be a bit smoother on Android. I'm sure in time they will make this much better."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T20:56:59.000Z",
          "Titre": "Had some issues getting this installed…",
          "Contenu": "Had some issues getting this installed and working at the Narita airport. On Android. I know it is not easy to keep track of all variants of Android UI's, but you really need to have a rock solid set of instructions that I don't have to guess in order to make it work. If I try 3 times, I know that is already too many times for any of my relatives and friends, and they will give up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MMS",
          "Nb_Reviews": 6,
          "Date": "2023-11-15T06:29:04.000Z",
          "Titre": "Overall pretty good",
          "Contenu": "Overall pretty good. Very easy setup with a USA iPhone 11. Signal was probably good 90% of the time with decent speeds. Google maps loaded relatively fast, photos of map places loaded kind of slowly. GPS with this was terrible though. Overall, still ok for the price."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T00:42:17.000Z",
          "Titre": "Korea and Japan",
          "Contenu": "When we first landed it almost seemed like the sim card wasn't working.  I didn't know how to troubleshoot as there wasn't much info on that when I looked it up before I traveled. But it quickly resolved on its own as I was leaving the airport."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Jack Q",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T02:11:42.000Z",
          "Titre": "e-sim card not working",
          "Contenu": "e-sim not working after arriving in Japan. Try to resolve problem locally.  After 2 days of trying, called Ubigi Customer Service for assistance. Customer Service will look into it.  Service Representative Vincent sent email with instructions with possible solution.  Advised Customer Service that problem still existed after trying their instructions to it.  2 days later, Ubigi solved problem remotely with new account.  e-sim service available after 5 1/2 days without service."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "JC",
          "Nb_Reviews": 4,
          "Date": "2023-10-26T06:20:57.000Z",
          "Titre": "Great experienxe",
          "Contenu": "This was a seamless experience and made my trip much easier and smoother with access to internet. Connection was patchy in some spots (eg underground) but it was super useful. Was also glad I didn't have to lug around a portable wifi! Would recommend to friends and reuse in the future!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Annerieke Aarsen",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T19:05:53.000Z",
          "Titre": "Fast respons.",
          "Contenu": "Fast respons.Not 5 stars because I was logged out autumaticly and could not logon again. I could also not change my password as the link either came not through, or so much later that I had already logged off"
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T01:29:27.000Z",
          "Titre": "Easy to use & reliable",
          "Contenu": "Easy to add esimEasy to monitor data usageReliable data streamReasonable pricing"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "David Robertson",
          "Nb_Reviews": 6,
          "Date": "2023-10-13T10:34:24.000Z",
          "Titre": "First time with e-sim",
          "Contenu": "First time with e-sim.  It was easy to download and set up with the instructions provided. Coverage was good most everywhere but could be a bit spotty in buildings. Helpful to have Google maps for getting around, used Messenger for communicating so much cheaper than using around Canadian providers roaming service."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T03:50:57.000Z",
          "Titre": "Some spots in Osaka/Kyoto",
          "Contenu": "Some spots in Osaka/Kyoto, the data takes awhile to load. Coverage in crowded stations in Osaka is not as good"
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T04:13:15.000Z",
          "Titre": "Fine trade off between speed and convenience",
          "Contenu": "The internet connection in Japan was fine, not as fast as a pocket wifi but it's a trade off for convenience. A bigger issue is the inaccuracy/slow update of GPS location, which could be a minor pain if you are a tourist and use map apps often"
        },
        {
          "Note": 4,
          "Lieu": "CY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T12:55:59.000Z",
          "Titre": "Good experience however",
          "Contenu": "I have had good experience with using Ubigi in my car. However there are sections of countries where I do not get full coverage particularly France"
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "US customer in Japan",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T00:45:02.000Z",
          "Titre": "The good and not so good",
          "Contenu": "The good: Great value, and connectivity is, for the most part, excellent.The \"easy to improve\": Creating an account, buying a plan, and activating a plan: Documentation and online help/tutorials is poor. It would be great if you could buy the plan a few days ahead of time, and activate on a specific date/time.The \"not sure if Ubigi can fix this\": After travel through regions of spotty coverage, it takes a long time (as in hours, or a couple of phone restarts) for the phone to \"see\" cellular data. I had the phone claim \"no signal\" in Yokohama and in Tokyo, and after going into airplane mode and back to regular mode, have 4 or 5 bars of 5G coverage. After a bit over 24 hrs, the coverage was consistent again with no dropouts, even in the subways."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T07:13:42.000Z",
          "Titre": "Do using Expenses was pretty okay 👍",
          "Contenu": "Do using Expenses was pretty okay 👍 It’s pretty convenient and comfortable the only bad point is the price for how many gigabytes you can have . Pretty expensive service.In Japan you offer 50 GIGA for 60€ We can have a pocket wifi unlimited for 40€ The comfort offer by the e-sim cannot outperform the price difference.I use it because of the referral who’s offer me 50% off but if I cannot have it again, it’s gone be probably the last time."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Japan Traveler",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T13:55:56.000Z",
          "Titre": "Very good coverage and speed even in rural areas",
          "Contenu": "Good coverage, anytime. Very good speed also in rural areas. Five stars if Ubigi provides a Widget with near realtime display of remaining quota."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Ryan",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T23:18:14.000Z",
          "Titre": "Easy Setup! Prices are in USD",
          "Contenu": "Setup was easy and have had very few problems while being overseas. Only complaint I can think of is the lack of information regarding the plans being in USD. Doesn't say anywhere that the costs are all in USD until you’re about to pay."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T17:54:04.000Z",
          "Titre": "I'm satisfied with Ubigi.",
          "Contenu": "I'm satisfied with Ubigi.It wasn't always super intuitive to use, but it's no fault of their own. I was not familiar with the concept of eSim and having primary and secondary providers on my phone.I had a bit of trouble getting a good connection here and there. Often when I wasn't above ground, or when I just landed after a flight, I couldn't connect."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Lars",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T10:43:13.000Z",
          "Titre": "Used Ubigi in Japan",
          "Contenu": "Used Ubigi in Japan, buying data was simple. The only real issued I had was that connection was as times slow and you could lose reception in the strangest places. I should be able to walk into a restaurant and till have reception.It's a good and convinient service, but they might want to have a word with their owners Docomo about the coverage."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Wesley",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T11:38:13.000Z",
          "Titre": "Good value for the money but some limits",
          "Contenu": "Good value for the money, but with an EU and UK package I struggled to get a connection in some places (particularly Scotland). This happened most happen inside, but my brother has full connection using another esim company. Found it worked well in Paris and London though."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:00:44.000Z",
          "Titre": "Not the easiest web site to follow to…",
          "Contenu": "Not the easiest web site to follow to re-new Other than that very happy with your product"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "jun",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T14:02:01.000Z",
          "Titre": "Fair",
          "Contenu": "I used this eSIM in Japan, overall the data worked well, the speed was satisfactory, the data was used mostly for googlemaps and some browsing.I recommend to my friends, some of them have some issues."
        },
        {
          "Note": 4,
          "Lieu": "GG",
          "Pseudo": "Jane Le Tocq",
          "Nb_Reviews": 8,
          "Date": "2023-09-30T13:41:52.000Z",
          "Titre": "Goid service, shame about rating manipulation",
          "Contenu": "I would have given you 5 stars but am extremely annoyed at you “guidance for rating” (you state 1 or 2 stars =bad 3-4 stars = not goof and 5 stars = god or perfect) What rubbish - that is just trying to get lots if 5 star ratings if folk are at all happy with your service. Normal ratings are :- 1 = awful 2=bad 3= average 4= good abd 5= excellent. So although the service was actually very good I will not give a 5 star as you are attempting to influence the ratings in an incorrect manner . So sad"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T15:49:12.000Z",
          "Titre": "eSim option was great",
          "Contenu": "eSim option was great, it worked as soon as I arrived in Japan. The only downfall is some places the reception is not that good but overall it was great."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-07T01:56:17.000Z",
          "Titre": "Worked when I needed it with decent speeds. Can purchase more data offline",
          "Contenu": "Used Ubigi for esim around japan. Worked great with the 3gb option. After finishing 3gb which I used over a week and a bit, I got 1gb more. This is where it was problematic. Either my own use or a glitch, but that 1 go was used up within 2/3rds of a day. Same use behaviour throughout the trip"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Customer - Australia",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T02:38:05.000Z",
          "Titre": "Overall good",
          "Contenu": "Overall good, however clearer instructions, inc visuals or video, on how to set up and choose mobile data would be great as there is a fear if being charged international roaming charges by home-country provider."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T18:23:31.000Z",
          "Titre": "Straightforward and works well",
          "Contenu": "Sign up process was very straightforward, it took a while to connect initially but after that the service was pretty good. There were a couple times I had to toggle airplane mode to reconnect to the network, but not sure if that was Ubigi's fault or that the network was locally overloaded."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Yuval",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T08:42:21.000Z",
          "Titre": "The cheapest cell phone package you will find in Europe! magnificent!",
          "Contenu": "Excellent service, I discovered it quite by surprise through someone I met on the street in Paris who recommended you to me! I used it for a whole week and it was really fine, sometimes there were disconnections for a few minutes and the internet was a bit slow and that's why I dropped a star in the rating, but it was really for a few moments and in certain areas only, most of the time the reception quality was fine, apart from that everything was good and the cheapest price I found in France ! The 10 GB package was definitely enough for me for a week. Your customer service also helped me very quickly when I needed it"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T06:13:52.000Z",
          "Titre": "Initial experience good, however difficulty with the second e-SIM",
          "Contenu": "Some difficulty on initial activation with Italian e-SIM but fuss-free once I reached Italy.  Unfortunately the Singapore e-SIM was a different experience for the four days I was there.  Some days it would be available and other days not."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Coolkats",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T14:56:31.000Z",
          "Titre": "Quick set up for overseas use",
          "Contenu": "Pretty glad to have found this app, set up was easy as considering I was able to set up and internet connection while in the immigration line at the airport to get my passport stamped. Super easy to get going with the esim method. Only thing that could be improved is if there was a little more choice of data/countries/timing packages but otherwise this will be my go-to for overseas connections for data 😀"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Chris Ng",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T05:11:14.000Z",
          "Titre": "I have connection most of the time in…",
          "Contenu": "I have connection most of the time in japan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PeterP",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T23:56:40.000Z",
          "Titre": "Setup was somewhat challenging directly…",
          "Contenu": "Setup was somewhat challenging directly from the web, but after a few tries I was able to get the android app working. Once setup, it worked great. 👍👍"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Fady",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T04:31:54.000Z",
          "Titre": "A great option for tourists!",
          "Contenu": "The simple process of activating it! It worked great for the most part, only issue is sometimes the package doesn't work for a few minutes."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Adou",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T06:29:55.000Z",
          "Titre": "Works great!",
          "Contenu": "First time using esim for our first trip in Japan. Easy installs, works on the new OnePlus 11 5G. I had some issues in some areas in Tokyo and in Kyoto where there was no signal but for a few minutes. The app is straightforward, tells you how many Data is left. Definitely recommend it for your trip in Japan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T00:10:21.000Z",
          "Titre": "Once set-up was completed properly...",
          "Contenu": "Once set-up was completed properly, really easy to add esims for international destinations and top-up, when needed.Will definitely use again!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Alyssa Jhong",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T04:17:10.000Z",
          "Titre": "The data is good",
          "Contenu": "The data is good, does well and is fast. Only thing I wish for in the future are more flexible data plan options. I’m currently traveling in Japan and the data range was 10GB to 50GB. I ended up getting the 50GB because 10GB was too little but the next size up was the 50. Wish there was a middle ground."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T01:59:50.000Z",
          "Titre": "one load good one load missing",
          "Contenu": "I loaded for me and my husband. I was able to use my load. but my husband's load did not reflect in his cellphone.He kept getting in his app \" no load\".the load we paid disappeared even after getting the Qr code.sim used in japan.i suggest there are CLEAR ABD SIMPLE INSTRUCTIONS WHAT TO DO IF LOAD IS NOT RECEIVED this is our 2nd time using in japan. 1st time both phones received our load. this time only one phone received the load"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr  Miller",
          "Nb_Reviews": 6,
          "Date": "2023-10-07T12:24:24.000Z",
          "Titre": "Easy to access and update my…",
          "Contenu": "Easy to access and update my subscription.Renewal costs are reasonable so a 12 monthly plan will give me a new option next year as data prices are falling."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "World's Best Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T05:35:20.000Z",
          "Titre": "Worked as expected",
          "Contenu": "Service provided was exactly as expected. Activation and setup was relatively easy. While it would have been good to have all relevant information, such as FAQs and config setup info provided together or all in one place, I had no issues with the service while on holidays after I had completed the setup."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T07:01:01.000Z",
          "Titre": "Connectivity was quite good!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "T. W.",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T09:49:56.000Z",
          "Titre": "5 stars for speeds and feeds",
          "Contenu": "Would have given 5 stars if it wasn't for the misleading web site instructions on how to buy and install an eSIM (ignore them and install the app first, then buy from within the app). eSIM works perfectly in Japan with excellent coverage and speeds. Customer service was on the ball and fixed my SIM issue in less than 20 minutes, so that was a good experience."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T08:42:14.000Z",
          "Titre": "It's been really really good",
          "Contenu": "It's been really really good. Good reception almost everywhere in Japan -- better than I have back home. I do have two suggestions for improvement. First, there should be a message when you're close to the end of your data (not after). It just stopped for me and I wasn't sure if it was the end of my purchase or an issue. And for setup I'd have liked a full best practices step-by-step on the website. I hit a few steps that were a bit unclear between the app setup and my phone settings. But I have already been recommending the service to others and I'd DEFINITELY use them again now that I have it set up."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T23:26:40.000Z",
          "Titre": "Service itself is great",
          "Contenu": "Service itself is great, no issues with reception. However, I sent an email to customer service 2 weeks ago and did not hear back"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customerCdn",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T09:30:33.000Z",
          "Titre": "I got the 10Gb/30 day japan esim",
          "Contenu": "I got the 10Gb/30 day japan esim, worked great with 5G speeds in tokyo, speed test had 682D/43U Mbps, i used as tethered hotspot, but kinda spotty in Narita airport.  , great for google translate and google maps"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T17:39:59.000Z",
          "Titre": "Great speed and connectivity",
          "Contenu": "Mostly worked without any problems (in Japan). Couple of instances happened when the connection was lost and I was left without the Internet for few minutes. Set up process took a while but you only have to do it once so not a massive downside."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T14:42:58.000Z",
          "Titre": "Plan activated immediately",
          "Contenu": "I was confused with how to buy a plan. Website said you need to scan a QR code to activate the plan. I bought the plan via the app and didn’t get a QR code.Moreover, the plan was activated immediately. I was planing to buy it in advance.I emailed CS and they extended the deadline."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "preeti BISHT",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T05:08:18.000Z",
          "Titre": "Very useful in Japan",
          "Contenu": "Very useful in Japan, worked every where with no issues…had a problem with top up though.Hard to get any support."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "TD",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T02:40:22.000Z",
          "Titre": "Ease of use and cover most locations.",
          "Contenu": "Ease of use and cover most locations.Edit response after received reply.Would get the fifth star if not lost reception at a few crucial moment."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tokyo, Osaka, Kyoto traveller",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T22:35:40.000Z",
          "Titre": "Data was reliable but only LTE",
          "Contenu": "Data was reliable and available everywhere I went to in Japan. My only issue was that I was limited to only LTE on my Pixel 7 Pro. My friend who was on iPhone was able to retrieve 5G using Ubigi throughout our trip.If this is fixed I will definitely be using Ubigi again in the future for my travels!Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T10:15:33.000Z",
          "Titre": "Was really amazing to have this new way…easy way to travel",
          "Contenu": "Was really amazing to have this new way of travelling, especially as South Africans. We would in the pst have to buy a SIM card for the country we would be visiting. Just a pity it wasn’t part of the package in Norway."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T04:26:57.000Z",
          "Titre": "Useful while hiking and camping in the Japanese Alps!",
          "Contenu": "Ubigi served me well while I was hiking and camping in Kamikochi, the Japanese Alps. Mostly reliable and satisfied with the service. Will use it again for future travels!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T17:23:35.000Z",
          "Titre": "pretty easy to use",
          "Contenu": "pretty easy to use, and the connectivity was also okay.  A few places, the connection was weak.  Make sure and load the app on your phone before you leave home because there are a few steps to that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tomoya Kanno",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T16:00:34.000Z",
          "Titre": "Highly recommended",
          "Contenu": "Incredibly smooth and frustration free compared to international SIM plans from years past. Highly recommended for travel in Japan. Worked well for me in Tokyo, Hakodate, Morioka, and Sendai. Sendai was the most difficult but that region is very crowded with buildings that any network will struggle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T10:32:19.000Z",
          "Titre": "Super easy setup - will use for all future trips!",
          "Contenu": "Super easy to setup and get an eSIM for use in Japan. Was able to add the eSIM before leaving for trip and phone connected right away upon leaving airplane. App was easy to use and monitor data usage as well as buy more data when needed. Very affordable with great speeds across all Japan."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:53:24.000Z",
          "Titre": "Ubigi for travel on Okinawa island",
          "Contenu": "I used Ubigi for data connection in Okinawa from 14-21 Dec 2023. The quality of the connection was excellent and I had no issue with it at all. The experience was much better than with another eSIM provider previously. I would definitely recommend it to anyone who plans to travel to Okinawa."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelley",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:31:14.000Z",
          "Titre": "Choosing Ubigi was the best decision…",
          "Contenu": "Choosing Ubigi was the best decision for my trip! It is super easy to use and it is one fee and no hidden fees. So much better than my US carrier. I would recommend highly. Something to note, you need to have an unlocked phone, so if you are on payment plan with your local carrier, you will not be able to use the eSIM."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T09:26:57.000Z",
          "Titre": "Would use again",
          "Contenu": "Very reliable but I unfortunately ran out of data near the end of my trip to Japan. I only blame myself for that and it was very easy to top my plan off for the duration of my trip once I found some wi-fi."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:40:39.000Z",
          "Titre": "Affordable, reliable, and easy to use",
          "Contenu": "I had never used an eSIM before and it was very simple and worked great during my trip to Japan. I so enjoyed not having to carry a pocket WiFi around this time around! The data speeds were consistent and reasonably fast. Not quite as quick as back home but I was able to use map navigation and browse Google without any connectivity issues, even outside of Tokyo. The pricing is also very reasonable. Will definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T00:11:42.000Z",
          "Titre": "Reliable service",
          "Contenu": "Esim activation was easy.  Just set Ubigi as the primary sim at your destination.   Service has been reliable everywhere in Tokyo so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Rudolf",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T21:06:01.000Z",
          "Titre": "The internet worked really well…",
          "Contenu": "The internet worked really well throughout Japan, did not have any issues setting it up or getting it activated. Would recommend it to anyone traveling through Japan"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:49:45.000Z",
          "Titre": "10/10 would use again!",
          "Contenu": "This service was not only user friendly but had wonderful service abroad! I went all over Japan from Tokyo to Osaka and never had to worry about cell reception. Not only was coverage great but way cheaper compared to competitors."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Wayne Morris",
          "Nb_Reviews": 35,
          "Date": "2023-12-19T21:18:12.000Z",
          "Titre": "Customer Support..",
          "Contenu": "I had a problem affecting the SIM card in my Range Rover, and in fairness to Ubigi support they were superb in sorting it out.. Excellent communication and back up service.."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Simon",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T03:22:27.000Z",
          "Titre": "Really great experience.",
          "Contenu": "Really great experience.It is super fast, easy to use and the price a really decent if you are travelling. I highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colinas.Closet",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T03:44:33.000Z",
          "Titre": "It was so easy to set up and internet and…",
          "Contenu": "Was so easy to set up and internet and messaging is flawless. They resolve any issues quickly. Would definitely use them again for international travel!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:16:23.000Z",
          "Titre": "Connectivity was good and installation…",
          "Contenu": "Connectivity was good and installation was fuss free. Has a very good rate for Japan plan. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T04:57:41.000Z",
          "Titre": "As a first time user",
          "Contenu": "As a first time user, I had a lot of concerns with overseas data plans. I’m not tech savvy so Ubigi’s simple to follow instructions helped me greatly. My 15 days in Japan was just fabulous without any problems."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "MARIA NACHELLY AGUIRRE PALAFOX",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T02:51:41.000Z",
          "Titre": "Works perfectly",
          "Contenu": "Works perfectly, great price and amazing discounts for future purchases , love it! 😍"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "JT",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:53:06.000Z",
          "Titre": "Extremely easy setup",
          "Contenu": "Extremely easy setup. Connection is almost flawless. And prices are really reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T04:29:20.000Z",
          "Titre": "Ubigi saved my vacation in Japan",
          "Contenu": "The physical SIM I bought for my Japan vacation (I have an unlocked, bought in USA, Google Pixel 8 Pro smartphone) worked poorly. It connected to 4G and then dropped after 10 min, requiring me to manually reconnect each time I wanted to use the internet. That basically make the physical SIM unusable.The Ubigi eSIM saved the day; it worked smoothly and fast in Japan on my phone. Ubigi gave me a reliable 4G data plan. Ubigi was also priced fairly. I will use it going forward and recommended it on Reddit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dermdrteekz",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:00:43.000Z",
          "Titre": "Excellent Reception, great customer service",
          "Contenu": "excellent service, very amazing LTE in Japan. I'm coming from the US and used to very fast internet on my phone all the time. I had no problem with Ubigi. I also got a 50gb package and used internet (social media, posting videos, sending photos and videos in messengers to friends) every single day for 10 days and only used up about 10 gb surprisingly lol. So didn't need the entire 50 gb. But if you're using it for hot spot and other video intensive work you may need that much data! Food for thought."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Calitexican",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T22:55:15.000Z",
          "Titre": "I recommend Ubigi wholeheartedly!",
          "Contenu": "I heard of Ubigi from a YouTube video, and I compared it to another eSIM company. I ended up choosing Ubigi and set it up while I was still in the US. I activated my 30-day plan the day before I left. I was staying less than 30 days, so it didn't matter that I was not in Japan at the time. Ubigi was running perfectly when I got to Narita airport, and I was ready to go while my traveling companions were still figuring out their physical SIM cards and portable wifi devices. I ended up running out of my initially chosen plan, 3 GB, and I ended up buying 10GB. It was money well spent. Thank you for the complete service, and I am pretty sure I had service nearly everywhere I went in Japan, including some more rural areas. I never ran into any issues where I would need customer service, so I cannot comment on that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danika",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T08:16:29.000Z",
          "Titre": "Lifesaver!",
          "Contenu": "Lifesaver! I purchased the 10 GB data for Japan for about a week and a half and it was more than enough. I think I had about 2GB left after the trip. It worked in most areas of Osaka, Kyoto, and Tokyo. Saved me from purchasing a pocket WIFI, which I found to cost significantly more than I'd like. I plan to use this in future travel tips definitely. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Burak",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T12:02:12.000Z",
          "Titre": "Recommend it",
          "Contenu": "Never had any trouble with speed or connection. Totally recommend it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "B C London",
          "Nb_Reviews": 13,
          "Date": "2023-12-06T09:38:20.000Z",
          "Titre": "Easy to use - will use again",
          "Contenu": "Found this a very easy service easy to use. Quite a straight forward procedure to install the e-sim. Good price for the service and never found myself without service - always had a connection when I needed it. Will use again. I had over 50% of my data left and my partner stayed in Japan for another week - I would have liked to be able to give the remaining usage to her to use - but don't think there's an option for this."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:08:04.000Z",
          "Titre": "Stable WiFi 95% of the time",
          "Contenu": "Stable WiFi 95% of the timeUser friendly instructions Very competitive pricing"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Kaden Napper",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T05:08:42.000Z",
          "Titre": "Worked great",
          "Contenu": "Sim setup was a little confusing, but that was done before I left. Once I was on holiday the recharge was super simple and service was perfect."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T13:00:51.000Z",
          "Titre": "Worked Well in South Korea",
          "Contenu": "I rated 5 star because of the connection quality and value for money, I had 5G in South Korea it worked great.I like that the App is simple to use but on Android I wish it could support a password manager when logging in via WIFI to make logging in easier. It's the only app that asks me to enter my username and password manually."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T01:08:37.000Z",
          "Titre": "Very convenient so you don’t need to…",
          "Contenu": "Very convenient so you don’t need to switch out physical sims all the time and you can use it in multiple counties"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "happycustomerfromJapan",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T20:11:07.000Z",
          "Titre": "Outstanding",
          "Contenu": "Coming from the States, the infrastructure in Japan is amazing. Except for obvious things like going through a tunnel and certain parts of the subway system, the connection and speed is outstanding. I stayed 2 weeks and bought the 10gigs. I ended up doubling it. Device: Pixel 7."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:17:10.000Z",
          "Titre": "Great tech solution for traveling",
          "Contenu": "Amazing service, costumer experience is great. App is a bit rough around the edges, but works fine."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "kyoubee",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:16:34.000Z",
          "Titre": "Great coverage",
          "Contenu": "Great coverage throughout 5countries i've been in europe. Fast speed as well. Cheaper than buying a simcard if only requirind mobile data"
        },
        {
          "Note": 5,
          "Lieu": "AD",
          "Pseudo": "New Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T07:14:03.000Z",
          "Titre": "Good data access",
          "Contenu": "I was in hospital for 6 days and used Ubigi service to access news, YouTube, email and texts family and friends. Never had a problem. Always had data. Will use again in future."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:00:41.000Z",
          "Titre": "Highly recommend Ubigi",
          "Contenu": "Highly recommend Ubigi! I've used it while traveling in both Japan and South Korea and I've had great coverage throughout and haven't experienced any issues."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T13:24:54.000Z",
          "Titre": "The installation was a bit confusing at…",
          "Contenu": "The installation was a bit confusing at first but once it’s completed I like the fact that I can add more minutes to it as needed using the app. The network was fine the majority of the time in Japan, some dead zone but I think it’s just the nature of cell network. Overall I’m happy with Ubigi and plan to use it whenever I’m abroad."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Paul A",
          "Nb_Reviews": 4,
          "Date": "2023-12-02T23:32:01.000Z",
          "Titre": "Really enjoy using Ubigi for seamless…",
          "Contenu": "Really enjoy using Ubigi for seamless coverage back and forth between Canada and US. Also plan on using this in very near future for UK and EU coverage. Can’t say enough good things about this company."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:46:37.000Z",
          "Titre": "Easy to use and track my data usage",
          "Contenu": "Easy to use and track my data usage! Cheaper than local telco roaming charges"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:33:24.000Z",
          "Titre": "Ubigi is a great esim to use in Japan",
          "Contenu": "Ubigi is a great esim to use in Japan. Easy to install with app that tells you your usage and remaining data. From the moment I arrived at Narita and throughout my trip had constant connection. Used data for Google maps, Google searches and texting family/friends back home.  Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T06:56:41.000Z",
          "Titre": "Ubigi in China is a no brainer",
          "Contenu": "Ubigi in China is a no brainer. Fast and reliable almost everywhere, and using Alipay with Western Credit cards needs that good and reliable network. Only in special places, like metro tunnels, it did not work."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ummagummibear",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:29:45.000Z",
          "Titre": "Worked perfectly in Japan",
          "Contenu": "Worked perfectly in Japan. Apple makes the place to enter access codes for eSIMs manually strangely difficult to find. But that isn’t Ubigi’s fault, and if you use the QR code, it is easy. Protip: to enter the access code manually on the latest iOS, you need to click ”scan QR code”. Only then can you enter it manually."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Marco Cetina",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T04:28:19.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, service and price while I was travelling in Japan"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray W",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T05:01:00.000Z",
          "Titre": "User Friendly Service",
          "Contenu": "Very easy to use and I had no issues with cellphone and data coverage while I was in Japan. Prices were very competitive and for a first time e-sim user it was very user friendly. I would definitely recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:34:23.000Z",
          "Titre": "No problem connecting when I landed in…",
          "Contenu": "No problem connecting when I landed in Japan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ren E.",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T01:08:09.000Z",
          "Titre": "Just what I need",
          "Contenu": "It was cheaper compared to other eSims."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Deepti Unnikrishnan",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T04:21:07.000Z",
          "Titre": "The best!",
          "Contenu": "I used Ubigi data plan in Japan for 10 days and not only was it top performance but never did I experience any disconnection or other issues. Would highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:31:02.000Z",
          "Titre": "Love the fact I could load and test the…",
          "Contenu": "Love the fact I could load and test the esim from my country of origin and confirm that is works"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "GS",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:52:25.000Z",
          "Titre": "Solid and reliable data connections",
          "Contenu": "Solid and reliable data connections! Keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "BN",
          "Pseudo": "HS",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:40:01.000Z",
          "Titre": "Easy and the data internet speed was…",
          "Contenu": "Easy and the data internet speed was good!"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T03:46:41.000Z",
          "Titre": "Had to get an eSIM for Japan",
          "Contenu": "Had to get an eSIM for Japan, ordered it via PayPal and got eSIM acces immediately. Internet speed is good and reliable through most Tokyo regions."
        },
        {
          "Note": 5,
          "Lieu": "CW",
          "Pseudo": "Louise Taylor",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T14:05:30.000Z",
          "Titre": "Easy to access for me",
          "Contenu": "Easy to access for me. Not confident using apps so very happy to find a user friendly app"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Teri Arejola",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:14:01.000Z",
          "Titre": "Good👍👌",
          "Contenu": "Reliable, fast and money's worth."
        },
        {
          "Note": 5,
          "Lieu": "MT",
          "Pseudo": "Sownie",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T09:21:59.000Z",
          "Titre": "Really good experience",
          "Contenu": "Really good experience. Traveled in Japan for 2 weeks and the service and internet connection was amazing!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "BK",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T08:27:40.000Z",
          "Titre": "Great Experience",
          "Contenu": "Setup is very easy. I didn't encounter any problems with connectivity during my 12 days Japan Kansai holiday. Will definitely use Ubigi on my next trip."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ryuka",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T02:27:16.000Z",
          "Titre": "It worked great in Japan",
          "Contenu": "We were in Tokyo for 10days and it worked great through our whole trip from the day 1, arrived at the airport until we left. Highly recommended if you are planing to go to Japan."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "PetrS.",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:52:34.000Z",
          "Titre": "My first use of eSIM on iPhone",
          "Contenu": "My first use of eSIM on iPhone. Worked great, no issue, easy to use. Good price."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T07:09:40.000Z",
          "Titre": "It was my first time using Ubigi",
          "Contenu": "It was my first time using Ubigi. I never had any issues with the internet."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Joanne Layfield",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T10:22:39.000Z",
          "Titre": "Excellent",
          "Contenu": "Easy to set up and create an account. Easy to top up. Excellent service would highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Giovanny Martinez",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T17:16:20.000Z",
          "Titre": "Ubigi was great to use",
          "Contenu": "Ubigi was great to use once you complete the set up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mochi",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:36:10.000Z",
          "Titre": "I loved it",
          "Contenu": "I loved it! It was super easy to install and navigate. Great price!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "KW",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T13:18:07.000Z",
          "Titre": "Responses to queries were prompt",
          "Contenu": "Responses to queries were prompt. Appreciate it!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Anoniem",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T11:09:50.000Z",
          "Titre": "No downtime and fast reliable internet.",
          "Contenu": "I had no downtime and it felt like I was part of the society there with access to internet. The package bought for the period was very sufficient in the country I was in."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T10:58:35.000Z",
          "Titre": "Very good esim service.",
          "Contenu": "Easy to use, good connection, esim works well, no problems. Would use again for travelling."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Vlad",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:39:15.000Z",
          "Titre": "Love it.",
          "Contenu": "Love it.Reliable and fast internet service almost anywhere, compared to other companies. Quick and easy set up, highly recommendable."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T02:27:03.000Z",
          "Titre": "The experience is simply perfect",
          "Contenu": "The experience is simply perfect! - No need to collect physical sim- experience on app was seamless- reliable telco network"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T17:56:32.000Z",
          "Titre": "Great service with flexibility.",
          "Contenu": "Great service! I was able to use a significant amount of data while in the UK and Western Europe. Easy to set up and use - I did not have to contact support. I was up and running in minutes. Finally, they have many plans to choose from - great flexibility."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:15:31.000Z",
          "Titre": "Japan travel with Ubigi",
          "Contenu": "I got Ubigi when I travelled to Japan, it worked great. I had reception everywhere and it was not expensive. I will purchase this again if I travel to Japan."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gino Mastantuono",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:35:32.000Z",
          "Titre": "I travelled to south Caribbean and it…",
          "Contenu": "I travelled to south Caribbean and it was perfect, can’t ask for a better service and data connection."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:11:40.000Z",
          "Titre": "Easy to use and straightforward",
          "Contenu": "Easy to use and straightforward. Service worked well in Japan."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Mohari",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T02:25:49.000Z",
          "Titre": "14 Days",
          "Contenu": "I used Ubigi on my 14 days trip to Japan. And I experienced no problem with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Mcclain",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T07:29:49.000Z",
          "Titre": "Had great coverage the whole time!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "customer_w",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T06:46:45.000Z",
          "Titre": "Reception was strong in most areas on…",
          "Contenu": "Reception was strong in most areas on Japan. Had a good experience using Ubigi."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T18:49:10.000Z",
          "Titre": "Easiest to install",
          "Contenu": "Easiest to install.  First provider that did not require using a qr code with two devices to install a sim card.  Genius!  Great speeds in Japan.  Will use again on my travels."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Philipp Schneider",
          "Nb_Reviews": 3,
          "Date": "2023-11-26T20:14:45.000Z",
          "Titre": "We had a really good experience with…",
          "Contenu": "We had a really good experience with ubigi. Everything worked out of the box and we had good coverage in most spaces we travelled to on our Japan trip."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:55:14.000Z",
          "Titre": "Very easy to use and super reliable…",
          "Contenu": "Very easy to use and super reliable around Japan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T22:08:06.000Z",
          "Titre": "Awesome!",
          "Contenu": "Awesome!Very easy to use and reasonably priced. Would be nice to get a phone/text package as we found we needed to use our phone a few times to confirm purchases and install apps."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Bogdan Gusiev",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:26:52.000Z",
          "Titre": "Flawless service",
          "Contenu": "Flawless service, clear service plans, easy to setup."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JP traveler",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T12:23:46.000Z",
          "Titre": "Worked great for Japan",
          "Contenu": "Worked great for Japan! No connectivity issues, and it was easy to top up when we needed to."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Amelia",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T22:22:35.000Z",
          "Titre": "Ease of booking",
          "Contenu": "Ease of booking. Friendly staff. Value for money. Would recommend."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "VG",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:39:33.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Fast and easy. Reliable signal. However, I hope there will be more data plans for a shorter stay."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T16:13:26.000Z",
          "Titre": "Nice customer service when I had a…",
          "Contenu": "Nice customer service when I had a question. Good coverage while using."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tris",
          "Nb_Reviews": 4,
          "Date": "2023-12-09T04:11:24.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service! Works very well in Japan no matter where you are. Nice and cheap as well"
        },
        {
          "Note": 5,
          "Lieu": "GU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:08:18.000Z",
          "Titre": "Great reliable service throughout our…",
          "Contenu": "Great reliable service throughout our Japan trip!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Flora Ruggiero",
          "Nb_Reviews": 5,
          "Date": "2023-12-02T02:14:08.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, the process is really simple. We used Ubigi in Japan and it was perfect. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T06:18:33.000Z",
          "Titre": "Worked pretty much perfectly though…",
          "Contenu": "Worked pretty much perfectly though around the end of my data usage, connection seemed to be slow"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T22:37:43.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Very fast reply by customer service. However would love it if your company had a 5GB plan. 3GB seems to be too little and 10GB seems to be a bit too much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "td",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T03:13:13.000Z",
          "Titre": "Ubigi esim in Japan",
          "Contenu": "I used Ubigi esim in Japan. It is easy to install and top-up. The connectivity is excellent"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:33:24.000Z",
          "Titre": "Good reception and speed is good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:38:09.000Z",
          "Titre": "Cost was economical",
          "Contenu": "Cost was economical, top up was easy to do."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "fahmi farah",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T01:11:26.000Z",
          "Titre": "Very reliable network",
          "Contenu": "Reasonable prices, very good coverage"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T05:07:26.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, excellent speed, flawless connection and reception almost everywhere we went in Japan. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Rory",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T10:14:03.000Z",
          "Titre": "Great",
          "Contenu": "Great, fast internet which worked without any issues even in rural areas"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LORI",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T05:46:18.000Z",
          "Titre": "Worked perfectly!",
          "Contenu": "This was a quick, easy way to have cellular in another country.  Worked perfectly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T23:51:11.000Z",
          "Titre": "Great service!",
          "Contenu": "Great service! The app can be a little polished but delivers the essential value. Will use UBIGI again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T08:59:31.000Z",
          "Titre": "Quite easy to use and no much…",
          "Contenu": "Quite easy to use and no much configuration is needed"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Firas",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T23:38:53.000Z",
          "Titre": "Fast internet",
          "Contenu": "I had no issue with the internet, everything was fast and smooth with the mobile data"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T11:22:23.000Z",
          "Titre": "Impressive coverage",
          "Contenu": "The coverage in Japan is very impressive."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Oliver",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T05:35:54.000Z",
          "Titre": "Super easy",
          "Contenu": "Super easy, cost effective and helpful. A must get when visiting Japan!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GD",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T17:24:53.000Z",
          "Titre": "Fast response",
          "Contenu": "Fast response, exactly what I needed (refund)"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:35:59.000Z",
          "Titre": "Really simple to use and the customer…",
          "Contenu": "Really simple to use and the customer service was very quick to respond!"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Fred",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T13:55:20.000Z",
          "Titre": "Works perfectly in Japan",
          "Contenu": "Works perfectly in Japan. Got 5G signal and the speed was fast enough."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T07:24:39.000Z",
          "Titre": "Easy to purchase data",
          "Contenu": "Easy to purchase data, easy to set up phone e-sim and app was reasonably easy to use"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Bill Kelly",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T09:41:44.000Z",
          "Titre": "Better than hotel WIFI",
          "Contenu": "Worked everywhere we visited in Japan..better than the hotel WIFI"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bohdan Lev",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T20:58:52.000Z",
          "Titre": "Great and easy service",
          "Contenu": "Great and easy service. The best travel companion in your palm. Esim, no need to get a sim car, works just great!"
        }
      ]
    }
  ]
}