{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "centricity.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dee Crutchfield",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T22:33:30.000Z",
          "Titre": "This is a useless extended warranty…",
          "Contenu": "This is a useless extended warranty company.Been since Dec. 3rd that I have a functioning oven, that we only purchased 5 years ago for over $7500!!! And the 5 year extended warranty WHICH IS A WASTE. No one cares, they just keep ignoring me saying they are working on getting parts, oh they have to work an approval, OH this or that, but I have no oven for the holidays, and that is the worst of all of this, THEY JUST DO NOT CARE ONCE THEY HAVE THE CONSUMERS MONEY IN POCKET. DO NOT TAKE ANY EXTENDED WARRANTY AND DO NOT BUY ANY WHIRLPOOL PRODUCTS PERIOD."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nahum Goldberg",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T18:18:52.000Z",
          "Titre": "Centricity/Epic Warranty has us waiting…",
          "Contenu": "Centricity/Epic Warranty has us waiting 4 months  (since Sept 2023) without parts to repair a residential oven under their warranty. I have confirmed GE has the parts but apparently they are not ordering from GE. Cannot get this escalated despite almost weekly calls to them.Worthless warranty sold by Airport Appliance - no recourse.UPDATE 12/17/2023 After posting this and one on TrustPilot I finally got a calland Epic(Centricity) has offered a credit without tax covered and under the current price of the unit so we will need add about $722.48 to get a new oven. Note on message said: Customer Responsible for Delivery/Part/Haulaway.... E. at Airport Appliance is referenced with a phone number but no responses despite leaving messages. Went into the Emeryville Store today and now waiting 2 -3 weeks \"of course the holidays might mean longer\" to get clarification on taxes and conditions of a refund... as we will not pay more for the replacement under warranty."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barb Rassano          -",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:47:21.000Z",
          "Titre": "I waited long time for my repair",
          "Contenu": "I waited long time for my repair. My first call to you was November 18th. A repair man never came until November 24th. He had to order a part that was in stock and should take 3-5 business days to get. Called AAA Appliance, the company you sent, on November 29th and they said you never gave the ok to order the part until November 28th!  I didn’t get the repair done until December 6th!!  Unacceptable I think!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ocie Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:12:42.000Z",
          "Titre": "Claims dept totally unresponsive.",
          "Contenu": "Absolute terrible company, do not waste your money on their extended warranty for appliances. My dishwasher started making horrible noises and stopped cleaning back about 3 months ago. Repair center came out and replaced same part several times and then later found the tub is twisted which cannot be fixed. Since then the dealer and I have been in constant communication with Centricity and they are doing absolutely nothing on their end to make a claims decision so I can get a new dishwasher. I’ve been without a dishwasher for 2 months now. The call center reps are nice but they can’t do anything. They also always say they will call me back and never do. I think Centricity does this in hopes you will just give up and buy a new appliance; I don’t think they ever plan to complete my claim."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna Demirjan",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T19:12:38.000Z",
          "Titre": "Cancelled my service contract!",
          "Contenu": "Centricity contacted the appliance store where I bought my Asko dishwasher and told them that were discontinuing my service contract and giving me store credit. My contract is due to expire 12/17/2025. This is just not right. The reason they are giving is that it is not possible to service the dishwasher so that it functions normally. Asko put out a service bulletin just 2 weeks after my second to last service call with multiple parts that should be replaced. My understanding is that the appliance store, Bekins of Grand Haven MI, would order those parts and install them. However Bekins called me to say that a store credit was being issued and that the warranty was cancelled. The contract identifies three reasons for cancelling a contract. None of these reasons applies to my situation. Centricity has made a unilateral decision basically cancelling my contract."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Chrismer",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T20:03:05.000Z",
          "Titre": "Centricity & Upsie - Horrible customer service",
          "Contenu": "Horrible customer support. Trying to get coverage for a claim on a broken cell phone. Called in to make the claim, pushed me to submit online, which is fine. They ask you to submit the estimate via email, which I did, you get no response if reciepet of email. You call in and they say they haven't received it. Had the agent text me his direct email and I sent to him, and asked him to confirm reciept, which he did. 3 days later, still no response so I called in again and they say it it takes 3-5 days to review the one page estimate from the Apple Store and their is no superviser to escalate to. It's now been 11 days and they say a supervisor will call me back with in 24-48 business hours. Cell phone is broke and if I repair without the authorization, that may void the coverage. Horrible, horrible customer service. Don't work with these guys. Also looks like they acquired Upsie, so don't buy from them either. Bait and switch and don't stand behind their services."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrea Mcintosh",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T06:22:41.000Z",
          "Titre": "I have not yet received my protection…",
          "Contenu": "I have not yet received my protection documentation. I can’t rate something I haven’t received."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Davis",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T20:32:05.000Z",
          "Titre": "We have an extended warrantee on our…",
          "Contenu": "We have an extended warrantee on our refrigerator with Centricity Epic Protect.  At the end of 2022 we contacted them with a problem.  Since then they have sent two companies on nine (yes 9) repair visits to our home with no success.  That's six months with no fridge!  The last repair company said the fridge is NOT repairable, which at this point means the warrantee company must replace it per the contract.  So far zero!  This is the worst company we have ever worked with by far.  They continue to delay doing what the contract calls for to avoid paying for a new fridge.  Avoid this company like the plague! From our experience it's hard to imagine all of these 5 star reviews could be real."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dossi",
          "Nb_Reviews": 2,
          "Date": "2023-06-24T18:23:28.000Z",
          "Titre": "Scheduler was nice but after a month…",
          "Contenu": "Scheduler was nice but after a month the refrigerator is not repaired. We are now up almost 5 weeks and the refrigerator is still not repaired. Luckily the neighbors are storing my wife’s medicine that costs $1400 a month has to be refrigerated. Don’t know when this nightmare will end."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tina",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T18:17:42.000Z",
          "Titre": "DO NOT PURCHASE A SERVICE WARRANTY FROM THIS COMPANY!!!",
          "Contenu": "I have been at their mercy since October 2022 to get my LG Dryer repaired! They have insisted on having the same repair to be done now for the 3rd time, which does not solve the issue, and are refusing to replace the appliance!! Think twice before you spend the money on their bogus warranty that they do not stand by!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathy Kurke",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T18:53:36.000Z",
          "Titre": "6 months and waiting",
          "Contenu": "Our fridge stopping cooling in December 2022 it is now June 9th and we have not gotten satisfaction.   Have had two different service companies come out and with a total of 9 visits we are still without a working refrigerator.   (Actually the water filter still works and it slightly cools but not enough to safely store food).  We have had repair after repair to no avail.  The first repair company could not repair it so Epic sent a second repair company..After numerous attempts and replacements of many many parts the second repair company told Epic that the refrigerator is not repairable.  That is all the company requires to replace or send money for a replacement refrigerator.  We still do not have a decision to replace the fridge.  What gives?  It feels like they are just waiting for us to give up and buy a new one and let them off the hook.  We aren't going to do that but we are going to write these reports about the company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle R Erickson",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T16:23:38.000Z",
          "Titre": "Don't trust this company to schedule an…",
          "Contenu": "Don't trust this company to schedule an appointment!!  I scheduled an appointment with this company and the company they called never showed up.  When I called them to find out why, the company they called didn't even repair my product. I called all day to tell them this and they told me I had to wait until the end of the day to schedule someone else.  When they would schedule the next company, they scheduled a month out. I thought that was fine since service is limited in our area.  Come to find out they  don't schedule more than TWO weeks out and NEVER SCHEULED MY APPOINTMENT.  I was lied to by MULTIPLE employees about scheduling and left to find my own repair under their approved service repair place.  I am waiting to find out if they will honor the reimbursement promised for using their approved repair pro, who was very nice and scheduled us within the week."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth MacNeil",
          "Nb_Reviews": 4,
          "Date": "2023-02-15T17:48:59.000Z",
          "Titre": "Poor customer service",
          "Contenu": "My appliance had a burning smell and stopped operating. Centricity was called and said to unplug unit and will call a service. Service did not show up after 6 days and they rescheduled for another week. Centricity would not schedule a different service company to help. I am at the mercy of this one service company with no use of my appliance that I paid for an extended warranty on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Gorsuch",
          "Nb_Reviews": 2,
          "Date": "2023-01-26T19:41:05.000Z",
          "Titre": "Bought Warranty On My Washer Dryer…",
          "Contenu": "Bought Warranty On My Washer Dryer Combo Unit. Not Even one year old When I First contacted Them. Now Its 2 Months Later 2 Different Techs Came Out. Now They Say No Coverage. What A Waste Of Time And Money. Also Never Buy A Frigidaire Appliance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sbaieljrbellsouth.net",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T19:42:26.000Z",
          "Titre": "I have a whirlpool microwave wall oven…",
          "Contenu": "I have a whirlpool microwave wall oven combo unit went out end of December -2022.I’ve had two service contractors come out and and look at unit . One says not repairable and other wants to totally rebuild unit and parts are not available! Here it is middle of April and still no help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 12,
          "Date": "2023-01-09T17:52:23.000Z",
          "Titre": "You just replied but you still did NOTHING!!",
          "Contenu": "You just replied with a simplistic \"We are sorry to hear that you had this experience. We appreciate you sharing your feedback. \" but you still did NOTHING to resolve the situation!!!SO DISGUSTEDBBB, here I come..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kumar S.",
          "Nb_Reviews": 4,
          "Date": "2023-07-23T04:09:51.000Z",
          "Titre": "Get ready to be frustrated and waste your time/money",
          "Contenu": "They never responded to my request to change service providers (changing the walk in location that would ultimately repair my phone), and when I called them, the agent could not understand or speak English properly enough to easily assist me. He kept asking the same question, and when I asked why they hadn't responded to my emails, he said that it was sent to the wrong department. I told him that was the department they told me to reach out to and that I had been communicating with the whole time, and he said a different email address is needed. I asked why they didn't just forward it to the right department and he said that their departments don't communicate with each other. Their departments don't communicate with each other! He then sent me a third and different email address to send the receipt to once I pay for the repair. The conversation lasted a very long time and I was on hold for at least 15 minutes. I would have gladly paid for the repair myself, just to avoid dealing with this trainwreck of a company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carole Yokell",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T05:28:12.000Z",
          "Titre": "Buyer beware",
          "Contenu": "Buyer beware! Do not purchase an extended warranty from Centricity.  If I could rate less than one star, I would. There have been multiple attempts to fix my dishwasher and no resolution.  Whenever a service appointment is scheduled, I must take a day off from work.  The appointment window time is between 8 AM and 5 PM. Two of the 4 times service techs have shown up, it was past 5 PM.  On one of the occasions, the tech showed up at 7:45 PM and my dishwasher was disassembled in my kitchen until 9:30 PM. In addition, of the 5 service appointments I have had, one of them was a \"no show\" and I even received a text that \"the tech was on their way.\" After waiting all day for the tech and finally calling Centricity at the end of the day to find out why the tech had not shown up after receiving a message that they were on their way, I was told the appointment had been canceled and no reason was given.  The last time a tech showed up, I was told that the dishwasher could not be fixed as it was not cost-effective at this point as there had already been multiple parts ordered and installed already.  I was told by the tech that Centricity should be reaching out to follow up after the appointment. I received no follow-up call. I called Centricity several days later and was told the case was at the claims department level and they would call me after making a decision: still no call.  I called again after this and was told that parts had been ordered again.  I found out this was not true after I called their subcontractor (A & E Factory Appliance) and was told that no parts had been ordered and that the case had been closed. I called AGAIN and told them what A & E told me and they told me that A & E was wrong.  I even emailed the documentation to Centricity to support this information. I have spoken to Hector on more than two occasions and he is condescending and does not appear to be forthcoming. Centricity has serious leadership issues and unethical business practices."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T21:19:30.000Z",
          "Titre": "Yet another failed service call",
          "Contenu": "Yet another failed service call. Going on four months now with broken dishwasher. Worst customer service I have ever experienced"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Wrobleski",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T17:10:47.000Z",
          "Titre": "Centricity appliance warranty is worthless",
          "Contenu": "Update to below… Centricity called and said they are “escalating this for a replacement” and I would have a decision in 2 or 3 business days. It’s been 5 business days and no follow up. I called back and a customer service rep said they are “escalating the escalation” … oh boy!! The customer service person said they have no direct access to speak to their claims people. So they literally have to email a general claims mailbox to ask for updates for a customer. What a joke. I feel bad for their CSRs. They have no tools or access to actually provide customer service. Can I update this to 0 stars? Purchased an extended warranty on appliances. One of my appliances malfunctioned in July 2022. Several attempts were made by an authorized service provider (ASP) to replace various parts, but it still is not operable. A second ASP was asked to come in and give a second opinion. They made a diagnosis and parts were put on order. 3 months later (now March, 2023 - 8 months after the initial claim was filed), there is no ETA for the parts associated with this diagnosis. A Centricity rep informed me that if a diagnosis is confirmed and no ETA can be provided for the associated parts within 10 business days, they would offer an alternate solution (i.e. a credit/ replacement). It has been 3 months and there is no update. I have called at least 5 times and been told that this will be escalated and I will hear back in a few business days and nobody ever calls back. Weeks go by, I call back again, there are no updates, etc... The customer service is some of the worst I've ever seen. They tell you they will escalate something and never follow up. You call back and the rep checks the notes and there's no record of somebody escalating anything, which makes it seem like their reps are just saying something to get the customer off the phone. There is no actual intention to try and take care of the customer. When I've asked to be transferred to a supervisor/ management to speak to, they say, \"I can't do that...\" ... I would never buy a warranty through Centricity again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Natalija York",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T03:15:59.000Z",
          "Titre": "Since Dec 29th when I called for…",
          "Contenu": "Since Dec 29th when I called for service on my washer, I have had a terrible experience with A and E. Service came out on Jan 10th, and I had to order parts. They had scheduled my service again for Jan 16th. On the 14th, I get a message that the part is not in. On the 15th, I get a message that the part is in. No one showed up on the 16th. The Voice message states to go to the website to schedule service. Well, I have no work order number to schedule. I could not get anyone to talk when I called A and E. I reached out to the location of Grand Appliance They gave me the same number I had called. Then I was given another number for Centricity the warranty company. After 5 calls (Now Feb 1) I am told the parts were not ordered. They will expedite the order. At this time The voicemail I got was because 1 part was in. On Feb 2 the representative got irate with me because I asked him\"how am I going to wash clothes for a family of 5 if your company is not doing what they are responsible for?\" He told me he does want to hear my semantics. This rude representative told me when I call A and E I have to act like I am a repairman. On Feb 4 a part arrived at my home. I called A and E on Feb 6 and was told that I have the only part. The other part is on Back Order. On Feb 2 I spoke to Grand Appliance customer service and they state they have no control. They could call on my behavior if I liked. A complete disappointment for all companies involved. Today is Feb 11 and still no washer to wash our clothes. On top of this, NO ONE is following up with me. There is no compensation except for the $50 that I spend on washing. In order for that to happen, the part needs to be repaired, and I have to submit receipts for a laundry mate. I have never had receipts from a laundry mate before."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 12,
          "Date": "2022-12-09T19:50:08.000Z",
          "Titre": "Always GREAT until August",
          "Contenu": "My most recent experience is only one star because they will not even respond to a mailed letter!I am at my wit’s end; totally beside myself.Over THREE months is over long enough to wait for an answer.All was good for four years, until 8/22/22.THE GOOD! I have always received a brand-new product when a product failed. Sometimes the process was arduous but it always got done with a new product shipped to me.Agreement number: Z454616 Connect Protect_Centricity has always charged me each and every month for 4 years, without fail, starting monthly on 7/13/18My credit card sends me this message each month, that always reads similar to this: “As requested, we’re notifying you that on June 23, 2022, at CENTRICITY, a pending authorization or purchase in the amount of $21.39 was placed or charged on your Quicksilver Credit Card.”At 3:21 on 8/21/22, 2 days B4 my monthly renewal - I wanted to make a claim for something else and the customer service Rep, Dave, said that my contract was canceled last month. I told him that they had been taking the money from my account for four years, since Dec 23, 1998 and there is no problem with my card - having a zero balance.WHAT? No call? No email?This was before my next renewal date and I simply wanted to make that payment.Apparently, there is no portal to change the expiration date; probably because they are not set up for monthly, normally.I am one of the few that has a monthly program. The reps never know anything about it and I have to explain it every time. That alone takes about 20 minutes on each and every call.CENTRICITY is charging me, not a third party, therefore they have to have some control over this!When I was given a URL, but it did not work or have an active site on it.It seems to me like they want iConnect monthly customers (formerly a Sears program) to go away!Dave Humphry told me to call the company that I bought the warranty from but since it was from Sears (Emily confirmed) on 8/13 that it was Sears and also saw Ian’s correspondence from 1998), through Iconnect, but that was not possible. They` sold all accounts to Centricity/Bankers Warranty Group, Inc.I now have to wait for a supervisor to call me back AGAIN to get this straightened out. Fourth attempt. That was many weeks ago. Now it has been two MORE weeks since my last contact.I repeatedly called Dave Humphry’s extension and there no answer and no voicemail.I spoke with Dave on 9/9/22Spoke with Trinity on 10/5/22 at 4 PM. She Trying to reach Dave - sent a message that I want to speak with him. NO CALL.Dave Humphry promised me that he would stay on top of this until he got an answer! He was going on vacation for 2 weeks but would definitely take care of this for me… Yet another promise was broken.I KNOW that you are better than this and only need the right person to know what to do. I have not found them yet!This SHOULD be simple as with every other company out there!I just want to pay my bill, as usualBen"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Gundlock",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T23:28:26.000Z",
          "Titre": "Total Scam",
          "Contenu": "Total Scam, do not purchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marilyn Rose",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T07:56:04.000Z",
          "Titre": "Am still waiting for my repair",
          "Contenu": "Am still waiting for my repair. Had not heard anything after the 3rd time of having a repairman for the same problem.  He said I should hear by the end of the week, but after 9 days, I called and found out one part was there but another was ordered with no arrival date known."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ECC",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T00:57:31.000Z",
          "Titre": "Not a Good Review",
          "Contenu": "Well, I have been waiting for 2 months now for the problem to be corrected. After two visits from the technician, I am now awaiting parts to correct the problem. Shouldn’t that have been done with the first visit?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve A",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T05:15:38.000Z",
          "Titre": "Complete and utter waste of time",
          "Contenu": "The plan appears to be just fix what's easiest and cheapest, as opposed to taking time to diagnose the issue and get it right the first time.The tech who came out initially looked at the appliance for ~10 seconds, said it was definitely the fan, and here we are 2 weeks later with the EAXCT same problem.This same tech came back, was incredibly rude when my wife asked questions, didn't want to explain what the plan was (him being ESL may have had something to do with it), then stormed out before we were done asking about timing, and left our front gate wide open (I discovered it 5 hours later).  Very childlikeIf there's another tech available, please make the change.  But regardless we would like to know what the plan is.  We have a housemate below us, and the roaring is inconvenient for her as wellThe 2 rating is for wasting our time, making me empty the fridge and freezer, pile stuff into coolers, keep getting ice, defrost the fridge, yet you didn't even know what was wrong"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 4,
          "Date": "2023-06-15T06:14:23.000Z",
          "Titre": "The repair company that Centricity uses is awful",
          "Contenu": "The repair company that Centricity uses is non-responsive. You can not reach them by phone, email or any other way.We were without a washer for over 2 months waiting on parts.It was difficult to schedule or get information from the repair company.We are still waiting on a $25 reimbursement for laundry service that was in our contract.As of this date we have still not received this reimbursement."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Ross",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T03:39:25.000Z",
          "Titre": "Misdiagnosed the problem",
          "Contenu": "Misdiagnosed the problem. One week leadt time for the part that didn’t fix it, two weeks lead time for the second guess. Don’t know if this one fixes it or not. Sent Sears repair techs, had Frigidaire techs trying to help but Sears/A&E were already here. Had four confirmed dates, so we didn’t know who or when techs were coming."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T23:13:53.000Z",
          "Titre": "We are still waiting on the freezer…",
          "Contenu": "We are still waiting on the freezer replacement tray for our Kitchenaid refrigerator.  Haywood Appliance has no idea when it will arrive.  They have ordered that part a number of times and each time the tray arrives it is warped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "O Green",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T17:54:19.000Z",
          "Titre": "Centricity representive  listened…but...",
          "Contenu": "Centricity representive listened and tried to help with a solution to the problem with the repair company. Unfortunately they have sent 4 request but the problem is still not resolved. There needs more done to get repair done. The customer service try to help but the repair part is failing because they are not doing their jobs to repair."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alan Miller",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T17:27:36.000Z",
          "Titre": "Long wait time for parts",
          "Contenu": "It took months, literally, to get parts for our walli oven.  Once they arrived, the service techs were great, but it took too long to get the parts.Our warranty should be extended by the same time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T23:10:08.000Z",
          "Titre": "Make your approval process quicker",
          "Contenu": "The reps and technician were great!The reason for the three stars is the approval process to purchase a part took too long. I had to call frequently to get it moving along. That should not occur. I was on vacation for a month so I was able to make the phone calls. However, if I was working, it would have been more difficult."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PATRICIA",
          "Nb_Reviews": 2,
          "Date": "2023-06-11T17:43:38.000Z",
          "Titre": "The replacement parts weren't even…",
          "Contenu": "The replacement parts weren't even ordered for three weeks after the problem had been diagnosed.  Then it was another three weeks before they were installed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mel Feldman",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T20:10:20.000Z",
          "Titre": "experience with Epic",
          "Contenu": "Epic need to get back to the client's more sooner, instead the client's are chasing Epic for a response Mel Feldman"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "for your order",
          "Nb_Reviews": 7,
          "Date": "2023-06-28T21:37:25.000Z",
          "Titre": "exactialy what did you do for me",
          "Contenu": "exactialy what did you do for me?  was it on an appliance?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T03:37:30.000Z",
          "Titre": "I have been trying to get my app",
          "Contenu": "I have been trying to get my app. Fixed it went oit now. Some of my food i had went bad. Had to throw it away.  It was 60.00 dallors wroth of meet. I am not happy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T19:00:06.000Z",
          "Titre": "Refer magic!",
          "Contenu": "Job well done. A little confusion at first."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janie Steinbach",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T17:36:34.000Z",
          "Titre": "I was thankful that the product was…",
          "Contenu": "I was thankful that the product was repaired with no extra charge to me but unfortunately, it took two months to get the part in for the repair."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffry Leblanc",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T23:02:28.000Z",
          "Titre": "Pleasantly suprised",
          "Contenu": "The customer service rep was polite and respectful. The process was a little cumbersome in finding my case and in the end I had to bring the unit back to the store, which while not too bad is still over 30 miles. However, the store personnel did find my record and replaced my defective unit with a new one. I was very pleases with the outcome."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Martin",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T18:42:25.000Z",
          "Titre": "I like you because your company uses…Appliance Hospital",
          "Contenu": "I like you because your company uses Appliance Hospital.  That is why you are good.  Like I said in the survey I filled out...if I would have insisted someone come out last year, I would not have had to throw away food and drinks that froze in the back of the refrigerator because the compressor fan was not working.  I would not have floor discolaration from water because the compressor was not working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marikay Scott",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T17:23:09.000Z",
          "Titre": "The service tech did a great job…",
          "Contenu": "The service tech did a great job and the repairs were covered.  There was an initial issue getting the contract in the system properly which we didn't realize until having to use it so make sure you understand how to get service and that your info is correct when signing up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martha  Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T06:01:33.000Z",
          "Titre": "Second Set of Eyes...",
          "Contenu": "I would like another Technician to stop by and service the washer.   The first Technician identified the problem,  however did not wait for me to wash a light load, a quick wash to confirm that everything was okay.   The washer is still not 100% up and running."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan  Harris",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T14:48:15.000Z",
          "Titre": "Confusing!",
          "Contenu": "It was a little tricky making an appointment for my washer and dryer. I called Good Deals, they told me to call the insurance company. Last time, I called Good Deals and they called the insurance company. Then, 2 appointments were made on 2 different day with 2 different companies. Very confusing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel Sandberg",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T18:59:35.000Z",
          "Titre": "It was hard to learn the status of our…",
          "Contenu": "It was hard to learn the status of our claim.  I had to call several times.  Processing took what I considered an overly long time.  I had to live with no oven for 2 weeks while the claim was being processes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "W Sirmans",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T18:13:02.000Z",
          "Titre": "Good customer care",
          "Contenu": "We had several issues with our whirlpool refrigerator and in March we finally came across Tori who stayed with us until the end. We got our ice maker working again and she kept us updated the entire time always pushing to get us what we needed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valerie Holt",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T23:10:08.000Z",
          "Titre": "Should be a 4.5",
          "Contenu": "Should be a 4.5. Service delivery was great but a small delay occurred by confusion about the model number. I gave the number on the dishwasher and was advised that itnot the correct number. After discussion with vendor who sold the  disherwasher, I learned that it was the correct number."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah Spivey",
          "Nb_Reviews": 4,
          "Date": "2023-01-28T00:45:21.000Z",
          "Titre": "Easy peasy",
          "Contenu": "Purchased the extended warranty.  Carpet Cleaning after the first year and then into the second year. Worth the price because it pays for itself times two. But previous to that in early January of 2022 I had requested that Empire come out and fix two doorway transition issues. That was denied and never happened. Disappointing..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danielle Lawrence",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T14:31:20.000Z",
          "Titre": "No money yet- lost in the void",
          "Contenu": "While the process of creating the claim and attempting to get my reimbursement, went very smoothly I have not yet actually received the payment, and I am experiencing some difficulties. I spoke with someone from centricity yesterday who said that the money was paid out but I have no Reimbursement into my bank account or onto my debit card for the claim. I did speak with my bank yesterday and they think that there was a problem with my email address not being properly linked so I am trying to work with my bank from my end, but centricity is telling me that I have already been paid out even though I haven’t received any money so I’m kind of stuck.UPDATE!! They were true to their word and were great to work with. They made it right and issued/mailed a paper check promptly. Despite the hiccups, they were terrific to work with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DG",
          "Nb_Reviews": 3,
          "Date": "2023-06-28T19:49:45.000Z",
          "Titre": "This is the dispatch company, not the repair people",
          "Contenu": "Remember, Centricity is only the dispatch company, not the repair guy. I have 3 appliances with 5 yr Centricity contracts on them. 2 of them started having mechanical/electronic issues. For 3 years I was really mad at Centricity because they were not getting repaired time after time. Then I realized you can request a different repair company if you are unhappy with the one they sent. And, if the same repair is serviced multiple times, you can file a refund claim. You will get a credit for the full amount you paid for the item at the store you bought it from. Or, if you request it, they may agree to send a check directly to you. ( Takes longer ) Only the item price. No tax, delivery fees or the cost of the policy )"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Norris",
          "Nb_Reviews": 2,
          "Date": "2023-03-06T22:21:49.000Z",
          "Titre": "I worked with Centricity to solve a…refrigerator issue",
          "Contenu": "I worked with Centricity to solve a problem with a refrigerator door.  It was initially fixed and the fix lasted for several months.  The a different problem arose with the door.  Decision was made to replace the door, however, a new door was not available.  They then said I would get a new refrigerator.  At this point, a fridge similar to mine was not available, as are many things in this country since Covid.  The only ones available were not to my liking.  As of now I decided to keep my fridge (many reasons for this choice).  They kept me informed and worked with my appliance dealer.  I have no problems, they were easy enough to work with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susumu",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T04:33:27.000Z",
          "Titre": "Price for additional two-year warranty…",
          "Contenu": "Price for additional two-year warranty extension is set reasonably."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sue Schreiner",
          "Nb_Reviews": 8,
          "Date": "2023-06-26T19:52:31.000Z",
          "Titre": "Been waiting for our reimbursement for…",
          "Contenu": "Been waiting for our reimbursement for our claim. So when I called today they said it was sent to wrong email address (which that representative gave me). The lady today got it straightened out but I had to resend my receipts. So now I have to wait again! This lady was helpful, but not too happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sgarfinkle83",
          "Nb_Reviews": 5,
          "Date": "2023-04-17T23:14:27.000Z",
          "Titre": "No problem getting my phone repaired!",
          "Contenu": "The policies and the speed of payment was terrific were terrific. It was a little bit difficult making the transition from the team that opens the problem to the team that approves and pays; but, that may have been a glitch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T15:01:58.000Z",
          "Titre": "The repair was made",
          "Contenu": "The repair was made, however from the initial call to fixing the issue was over two months.  Faster response to fix issues would be recommended when possible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pam Cox",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T19:39:47.000Z",
          "Titre": "I need to find out if I get a refund…",
          "Contenu": "I need to find out if I get a refund for the time left on extended warranty"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth Fernandez",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T15:59:28.000Z",
          "Titre": "The people who answered the phone were…",
          "Contenu": "The people who answered the phone were pleasant, helpful, and patient. The process took longer than expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Louise Flaugh",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T19:48:05.000Z",
          "Titre": "Technician was very nice and professional.",
          "Contenu": "Part needed took over a month to receive. I deducted one star for the long wait. Technician was very nice and professional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2023-04-25T23:50:11.000Z",
          "Titre": "Why two appointments?  After talking with several individuals…",
          "Contenu": "After talking with several individuals regarding our problem, a home appointment was scheduled.  I thought this appointment was to fix the problem,  but came to find out that the technician merely reviewed what had been discussed before and then scheduled another appointment for another technician to fix the problem.  We really didn’t need two appointments."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lew",
          "Nb_Reviews": 3,
          "Date": "2023-06-26T19:07:46.000Z",
          "Titre": "Technicians visit was covered",
          "Contenu": "Technicians visit was covered. We were unaware that we now have to call Centricity for the service appointment and receive an authorization number. Previously, we contacted our dealer directly for service which was much more convenient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Rawson",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T18:23:20.000Z",
          "Titre": "Once I understood how the program…",
          "Contenu": "Once I understood how the program worked, I found it to be a fine way to get excellent service as needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Tullock",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T03:00:43.000Z",
          "Titre": "Could do better",
          "Contenu": "No supervisor called me back when requested. Always told a supervisor was not available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T20:06:33.000Z",
          "Titre": "All Klein techs are professional and friendly.",
          "Contenu": "Efficintly check the system and diagnosed ther issue and directed us on how to avoid it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Hall",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T18:58:42.000Z",
          "Titre": "Fast and Efficient Claim Resolution",
          "Contenu": "Claim process was fast, efficient, and satisfactory in terms of value."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T20:07:58.000Z",
          "Titre": "Response was with in reason",
          "Contenu": "Response was with in reason. Very friendly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Msfre1",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T19:53:31.000Z",
          "Titre": "My claim was resolved",
          "Contenu": "My claim was resolved, It just took multiple calls and 2 weeks. They sent me a zelle for the cost of my product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Francisco C",
          "Nb_Reviews": 3,
          "Date": "2023-08-03T18:44:24.000Z",
          "Titre": "Erik",
          "Contenu": "In a word, Erik.  He is on the ball, responds quickly and takes care of business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa Butler",
          "Nb_Reviews": 3,
          "Date": "2023-07-07T05:33:09.000Z",
          "Titre": "Well you did return some emails but not…",
          "Contenu": "Well you did return some emails but not phone calls so much !!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T19:41:11.000Z",
          "Titre": "On Time",
          "Contenu": "...good response"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T00:48:01.000Z",
          "Titre": "back up warranties with little hassle  …",
          "Contenu": "back up warranties with little hassle   honest warranty-impressive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John S",
          "Nb_Reviews": 3,
          "Date": "2023-05-09T22:44:51.000Z",
          "Titre": "Refrigerator noise",
          "Contenu": "The buzz in the refrigerator is not as frequent but occasionally re-occurs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Crystal Caraway",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T21:27:06.000Z",
          "Titre": "Consistent",
          "Contenu": "Thanks for a job well done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben  Lymas",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T21:15:05.000Z",
          "Titre": "They did great !!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris V",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T20:07:25.000Z",
          "Titre": "They’ll fix it. it’ll take time",
          "Contenu": "They fixed the laptop"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 3,
          "Date": "2023-08-03T02:43:50.000Z",
          "Titre": "!!!!!!!!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc Tennenbaum",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T19:26:24.000Z",
          "Titre": "Excellent service call by the tech",
          "Contenu": "Excellent service call by the technician. He actually picked up the part prior to my service call and was able to replace the defective part all in one visit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank C. Yesh",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T16:25:09.000Z",
          "Titre": "They were very diligent in trying to…",
          "Contenu": "They were very diligent in trying to contact the store where we purchased our tv. The store originally was not helpful as the business divided and told me they didn’t sell tvs. However centricity continued to find out what happened as the tv division was in an another part of the store and got us up and running. Very much appreciate their persistence"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BILL C",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T23:28:35.000Z",
          "Titre": "Centricity and Sears Appliance Repair is Very Good.",
          "Contenu": "The two repair teams were knowledgeable, informed, helpful and friendly. Parts were ordered, but not installed because my machine was not broken, even though it had gone off balance and ran rough for one load. The guys said the parts were being returned, but if there were any repairs needed, to give a call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TRG",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:54:13.000Z",
          "Titre": "Superb Service",
          "Contenu": "First, the appointment process went very well.  The staff was friendly, professional and made the appointment within a couple days of my call, as soon as possible as a part was ordered.  I was very surprised and pleased by this soon of an appointment.  Next, the repair person called and let me know they were coming the day of the appointment.  The repair person,Chris, was professional, personable, extremely experienced and repaired my appliances very quickly.  Overall, the whole experience was great, the service was superb."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Bjork",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:17:22.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. On time.  Completed service done quickly and with great skill"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL and the Rubber Stamp",
          "Nb_Reviews": 5,
          "Date": "2023-11-21T00:59:30.000Z",
          "Titre": "BEST REPAIR SERVICE WE HAVE EXPERIENCED…",
          "Contenu": "BEST REPAIR SERVICE WE HAVE EXPERIENCED IN YEARS, Our dryer knob broke and unable to use. Called the warranty service and like they were out the next day. Service man was so nice and thoroughly explained the whole process.  Showed us how to use dryer temporarily until new knob arrived!!And who we dealt with had a 100% positive attitude! Refreshing in today's world to see that it still exists at Centricity!!  Thanks 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T08:29:55.000Z",
          "Titre": "Washer/Dryer Review",
          "Contenu": "Doug the salesman was very knowledgeable about all the products we looked at. Not only that, he provided price sheets and specs on several machines so we could make a educated decision on which product to buy. He was very outgoing and pleasant to talk with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl Riverside",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T04:46:03.000Z",
          "Titre": "Broken fridge but no stress!",
          "Contenu": "My fridge stopped working but I didn’t freak out because I had purchased a Centricity service contract when I bought my fridge. I called Centricity and they handled everything else. They sent a repairman and my cost was zero. They reimbursed me for the food that had spoiled while my fridge wasn’t working."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Ramsey",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T19:50:59.000Z",
          "Titre": "Appliance warranty",
          "Contenu": "I bought the appliance warranty to protect my expensive dishwasher and oven. When the dishwasher had a loud noise every time we opened the door, I decided to use our extended coverage. The experience with Centricity was easy. I would recommend them to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy P.",
          "Nb_Reviews": 7,
          "Date": "2023-11-03T06:20:09.000Z",
          "Titre": "It was a slow start only due to having…",
          "Contenu": "It was a slow start only due to having to send in photos of a cracked stovetop so it could be seen. After several attempts I ended up spreading flour on the top so you could see the cracks. Again it took a while to be told the store where I bought it would need to contact me. I then had to order the top wait 3 weeks for it to come in and then another 3 weeks to get installed. I had to purchase an electric burner so I could make dinner. However they did an awesome job of fixing it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Wheeling",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T00:10:28.000Z",
          "Titre": "The Velocare experience has been great",
          "Contenu": "The Velocare experience has been great. TREK bought out David’s world cycle in florida & my store in Wildwood fl has become very difficult to deal with involving this warranty."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T17:55:12.000Z",
          "Titre": "Freezer Repair",
          "Contenu": "Company easy to contact once I found my service contract. My previous extended service repair was quickly found and I told him we were certain it was the same problem.  They sent the repair request to a manufacturer's repair service rather than an independent as previously done and the date was set for the next week.  Parts came with the repairman this time so no more wait to get the freezer repaired."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Dejoy",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T13:28:40.000Z",
          "Titre": "Dependable and Trustworthy Repairs by knowledgeable technicans.",
          "Contenu": "First the technician came @ specified time of appt. & was very knowledgeable about my particular appliance (Maytag Top Loading Washer). He assessed the issues had to order the right parts in order to repair said appliance. He returned a few weeks later and addressed the problem and made the proper repairs. Now it's working properly ad it did formerly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Sue Lottes",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T07:03:39.000Z",
          "Titre": "The only thing that was a bit…",
          "Contenu": "The only thing that was a bit disappointing was we had to wait for a few weeks before the detergent dispenser because the part had to be ordered.  We were still able to wash our dishes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon Adams",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T17:56:44.000Z",
          "Titre": "Common sense honest company",
          "Contenu": "Covered what the policy said it covered, easy communication good qualified repair vendors. This is how the service world is supposed to work. Unfortunately rare in today's world."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Manuel Medina Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T07:43:02.000Z",
          "Titre": "Great experience",
          "Contenu": "The attention that they give to the customers always responded to my many questions   Very happy how I was treated"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MJ Blase",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T23:38:21.000Z",
          "Titre": "Thank you Tiffany!",
          "Contenu": "4-4-23 AAA Home Services checked out our dishwasher, top rack broken.4-24-23 called AAA, waiting for part from Warranty Co , 5-5-23 called Epic, said they were providing the part and said claims department would call and let us know what is going on, didn't hear from anyone.5-8-23 called Epic, asked to speak to Tiffany and she took care of everything Tiffany straightened everything out with our refrigerator and that was a nightmare!! Tiffany is the reason we're giving 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Amodea",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T22:53:01.000Z",
          "Titre": "The company that came out from Mcnabb…",
          "Contenu": "The company that came out from Mcnabb Illinois was great.  The hardest part was finding a company. You would call and it is a computer and leave your number and they never called back   That’s the worst part of it   We contacted S Bcompany and they were so helpful to finally reach a company that would even come out. The number in manual is of no value for service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Baltimore Client",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:19:50.000Z",
          "Titre": "Problem Fixed…",
          "Contenu": "Service man came quickly and diagnosed the prob.   Ordered it and installed it .   Works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T22:07:24.000Z",
          "Titre": "EPIC Protect Replaced our Refrigerator After Multiple Problems",
          "Contenu": "After multiple visits for repair work on our refrigerator (water dispenser stuck on, ice maker stopped working and flooded our hardwood floors, etc. ) EPIC Protect replaced the refrigerator with a new one.  Tom F. at Kelly's Home Center/Appliances in Salem, OR was super helpful too.  We are a return customer to Tom/Kelly's, and via them, will continue to purchase EPIC Protect coverage on all our new appliances."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KATHLEEN AVERITT",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T18:39:14.000Z",
          "Titre": "On time friendly informed technician…",
          "Contenu": "On time friendly informed technician had me up and running within the hour.  Very happy with the quality of service for my range which had quit working."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna McKinzie",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T14:13:08.000Z",
          "Titre": "It was easy",
          "Contenu": "It was easy, I called, c/s gave me an appointment date, service tech fixed the problem while he was here, luckily he had the part on his van!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Greenlief",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:33:23.000Z",
          "Titre": "Good quick repair was made."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Horwitz",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T19:53:24.000Z",
          "Titre": "Cash settlement for camera lens mechanical problem",
          "Contenu": "My covered camera lens developed a mechanical problem. I described the problem over the phone. It was quickly determined the lens could not be repaired, and that I would receive a refund for the full price. There was a slight delay in receding the refund since I was not asked on the first call whether I would like to receive a check or other form of payment. This was resolved and I was very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Newman",
          "Nb_Reviews": 9,
          "Date": "2023-06-07T01:56:59.000Z",
          "Titre": "Repair complete on 1 day.",
          "Contenu": "Was glad that Peter, my technician, came, as he had been here, for a previous call.  He's polite & thorough.  He's careful not to damage my floor or cabinets.  He had the necessary repair parts, on his truck."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trey A.",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T21:29:39.000Z",
          "Titre": "Worth the price for high cost appliances.",
          "Contenu": "It took a couple trips for the tech to track down the exact issue.  The first visual one was not the cause.  Upon further investigation, the issue was found.  Tech was patient and thorough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron & Cher Wood",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:37:15.000Z",
          "Titre": "was jus a good experience…,good…",
          "Contenu": "It was jus a good experience…,good service man correct part and successful repair."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T02:50:08.000Z",
          "Titre": "My experience was great",
          "Contenu": "My experience was great. The young lady that helped was efficient respectful and helpful. At the end she called dispatch and I was told I’d get a call within 24 hours. I no sooner hung up and Main Appliance got in touch with me and I had an appointment set up within a few days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Scoggins",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T21:11:44.000Z",
          "Titre": "The people were great at Centricity and…",
          "Contenu": "The people were great at Centricity and worked with me  so that together we fixed the icemaker over the phone!  Thank you. Thank you.  So much better than waiting for the repair place who really did nothing!  Thanks for hiring such knowledgeable and friendly people.  Sharon and John"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine Durgin",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T23:00:02.000Z",
          "Titre": "THEY ANSWERED MY CALL IMMEDIATELY SET…",
          "Contenu": "THEY ANSWERED MY CALL IMMEDIATELY SET UP AN APPT IMMEDIATELY... THE REPAIRMAN CALLED CONFIRMING THE PIECE I NEED FOR MY APPLIANCE., AND THEN WE AGREED FOR HIM TO COME A DAY EARLIER... IT WAS WONDERFUL...HE WAS PROMPT, THOROUGH, AND SO POLITE.. THANKS.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T19:25:43.000Z",
          "Titre": "Washing Machine Repair",
          "Contenu": "We had three appointments to have the machine repaired.  The first fellow that the machine wasn't balanced and he adjusted the footings. Was here 15 minutes and left. Machine was still not working as it should. Called for repair again and Service Tech Mike showed up on time. He evaluated the machine and ordered parts. The parts arrived and he returned and installed the new parts and the washing machine works perfect again. Thank You Mike for a great job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernest Gilmer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T03:16:38.000Z",
          "Titre": "Claims handled promptly and fully",
          "Contenu": "I've had two claims over the past 3 years for the same appliance. They were both handled promptly and fully for the covered expenses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby Dodson",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T20:11:16.000Z",
          "Titre": "Washer machine service warranty",
          "Contenu": "We needed service on our washer machine. The serviceman that they sent was very good and we are happy with our warranty service. the service provided was excellent and in a good timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek Jaramillo",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T21:10:17.000Z",
          "Titre": "Great job",
          "Contenu": "Centricity and watts upheld my extended warranty and Brock from watts appliance fixed it after getting the part he needed. They are always very nice at watts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHRISTINA HARVEY",
          "Nb_Reviews": 3,
          "Date": "2023-10-25T02:46:34.000Z",
          "Titre": "Good work and respect",
          "Contenu": "Polite and confident. We had to put off repair date for awhile till we got floors done and they kept checking with us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gonsoulin, Sydney",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T23:44:37.000Z",
          "Titre": "The end of February my Sony TV went…",
          "Contenu": "The end of February my Sony TV went out.  Thank goodness we brought the maintenance agreement with Centricity.  Three weeks laterwe were told our TV could notbe fixed and Centricity gave me enough money to buy another TV.  I made sure  l brought another agreement with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Robbins",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T12:20:24.000Z",
          "Titre": "The new part have made the washer/dryer…",
          "Contenu": "The new part have made the washer/dryer work like new again. Thank you so much. Not one problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen Betts",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T21:36:13.000Z",
          "Titre": "Excellent service",
          "Contenu": "It was easy to make an appointment, and the tech came two days later and on time. He explained why I had experienced a problem with my range, which by the time I called for service, had sorted itself out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T13:58:17.000Z",
          "Titre": "Very satisfied",
          "Contenu": "It was very easy to get an appointment.’the customer service representative was very attentive. The technician was very knowledgeable and very helpful. He fixed the dishwasher and also ran a cycle to make sure it was working."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Shellenberger",
          "Nb_Reviews": 2,
          "Date": "2023-02-23T22:04:40.000Z",
          "Titre": "We were pleased",
          "Contenu": "We were pleased with first contact and how our representative helped us get the call scheduled.  We understood what we needed to do and that a video was needed.  Fortunately, we understood, but I think for someone not tech savvy, it could have been a problem to make a video."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M Hassett",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T19:39:26.000Z",
          "Titre": "Excellent competent service team…",
          "Contenu": "Excellent competent service handled quickly and with precision! Repair team was clear headed and had the tools to diagnose the problem. The only delay was in shipping the repair board."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr Johanna Kowitz",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T20:33:12.000Z",
          "Titre": "The repairman was helpful",
          "Contenu": "The repairman was helpful and seemed very knowledgeable.  He explained the why as well as the what of his actions.  And he found the problem and fixed it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angelina Sepulveda",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T05:57:31.000Z",
          "Titre": "Quick and Efficient",
          "Contenu": "Centricity sent me to a repair service and that was quick and efficient! I appreciate the great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Joseph",
          "Nb_Reviews": 7,
          "Date": "2023-06-26T20:06:40.000Z",
          "Titre": "Response to every message was swift",
          "Contenu": "Response to every message was swift.  Even though there were simultaneous claim and registration issues, one person  was able to sort them out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonio Saldaña",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T18:40:05.000Z",
          "Titre": "Great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom& Linda",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T01:44:24.000Z",
          "Titre": "Great experience.…",
          "Contenu": "The whole repair experience went very smoothly from them coming out to determine what parts were needed to the actual repair which was done in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherry Polzin",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T14:51:42.000Z",
          "Titre": "Was an easy fix and the tech was very…",
          "Contenu": "Was an easy fix and the tech was very nice and knew what to do right away!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T22:01:29.000Z",
          "Titre": "Professional quality service.",
          "Contenu": "On time.  Did job, polite, knowledgeable, cleaned up, showed what was done, asked if we had any questions, explained and left.  Very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clarisse Alves",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T17:31:52.000Z",
          "Titre": "Thank you!! The refrigerator repair technician that…",
          "Contenu": "The refrigerator repair technician that repaired our refrigerator was knowledgeable and worked quickly when at our home! Very pleasant to talk to, he explained details to us!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela Fuqua",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:42:35.000Z",
          "Titre": "Very helpful and courteous to me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon",
          "Nb_Reviews": 3,
          "Date": "2023-06-06T20:59:58.000Z",
          "Titre": "The process was a little different than…",
          "Contenu": "The process was a little different than what I was expecting. I didn’t realize I needed approval prior to having the seller of the product work on a defective issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne Felt",
          "Nb_Reviews": 3,
          "Date": "2023-08-21T17:32:25.000Z",
          "Titre": "Glad we purchased extended warranty",
          "Contenu": "Technician came, ordered part, came back and installed.  We were not charged because we purchased extended warranty."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karma Hengst",
          "Nb_Reviews": 4,
          "Date": "2023-06-19T12:22:11.000Z",
          "Titre": "Polite and helpful",
          "Contenu": "The company was easy to contact and approved my claim within a few days. I was able to use a local repair shop and, once the repair was completed, sent them the invoice. I had my check in about a week. They were very polite and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T04:49:33.000Z",
          "Titre": "Quick and Personable Repair",
          "Contenu": "Your service agent came to our house, examined and explained the problem (within 10 minutes), then fixed the dishwasher quickly (within 20 minutes).  He was personable, knowledgeable and capable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T00:36:55.000Z",
          "Titre": "We were pleased that the service techs…",
          "Contenu": "We were pleased that the service techs from Bill & Rods were sent out to work on a problem with our gas dryer.  We have used Bill & Rods in the past and that we know that they provide excellent service regardless of what appliance that work on.  The 2 techs were friendly and efficient. Thank You."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S & J ALLEN",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T17:47:45.000Z",
          "Titre": "Customer Service quality",
          "Contenu": "Everyone we talked with was very helpful and was able to satisfy our claim."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen & Susan Spalding",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T21:43:48.000Z",
          "Titre": "People I dealt with were pleasant",
          "Contenu": "People I dealt with were pleasant. Provided return calls and feed back. Diagnosed my problem over the phone and repaired the fridge in one visit in a timely manner. On time for appointment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rupert Chen",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T16:24:23.000Z",
          "Titre": "Good communication; helpful tech",
          "Contenu": "It was relatively easy to make an appointment. The tech that arrived seemed very knowledgeable. The company was very communicative (heads up on tech's arrival, updates on order for parts, scheduling follow up for installation)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Smith",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T02:11:07.000Z",
          "Titre": "Great Experience",
          "Contenu": "Kleins Brand Source is great to do business with. They encouraged us to get the extended warranty and we are glad that we did."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T00:56:25.000Z",
          "Titre": "Finally came through. After several weeks of waiting",
          "Contenu": "After several weeks of waiting, centricity realized that Northern Tool no longer carried the item and refunded me my money under the warranty.  Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 4,
          "Date": "2023-02-13T22:20:12.000Z",
          "Titre": "Professional",
          "Contenu": "Professional , courteous and knowledgeable. Very timely while there and work was done on schedule as promised . Very impressed with this location and the manager"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 5,
          "Date": "2023-04-04T20:25:24.000Z",
          "Titre": "Easy to set up an appointment",
          "Contenu": "Easy to set up an appointment. No hassels in providing the necessary parts and service. Worth the money. Gulf Coast Appliance was good to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D Mastous",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T16:53:17.000Z",
          "Titre": "Excellent Service",
          "Contenu": "So happy to be utilizing Centricity Warranty plan.  Have gotten our money back two times over."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Delgado",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T02:50:29.000Z",
          "Titre": "Best experience ever",
          "Contenu": "The experience I ever had with a extended warranty. Paid out the $300 for food spoilage very quick turnaround"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Musgrove",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T17:09:30.000Z",
          "Titre": "Refrigerator servicing",
          "Contenu": "Have been responsive to my questions and concerns about my appliance. Service calls have been timely"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adan",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T02:02:09.000Z",
          "Titre": "The process was easy",
          "Contenu": "The process was easy, customer service was top notch. They couldn’t repair my device so they refunded me the full value of my device."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will Wheeler",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T22:44:44.000Z",
          "Titre": "I don't know much about how businesses…",
          "Contenu": "I don't know much about how businesses choose a vendor of extended services but this one worked oout well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Meilkle",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T15:23:53.000Z",
          "Titre": "Nice response",
          "Contenu": "Limited wait time to speak to representative.   Schedule appointment just a few days after the call date.  Representative was polite and frienfly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T17:41:35.000Z",
          "Titre": "When the problem could not be resolved",
          "Contenu": "When the problem could not be resolved, they were able to provide credit so that we could purchase a replacement.  Prompt and courteous"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T02:05:41.000Z",
          "Titre": "I was Essy as Pirgiven directions on how to…",
          "Contenu": "I was given directions on how to present my problem. The process was easy and quick. My problem was evaluated and in a relatively short period of time was resolved to my satisfaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T15:54:04.000Z",
          "Titre": "Service",
          "Contenu": "The service Technician was very knowledgeable and efficient. He was on time, and communicated effectively."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Cheng",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T22:45:21.000Z",
          "Titre": "Both issues were fixed",
          "Contenu": "Both issues were fixed, fridge is functioning properly and we're happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arthur",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T21:19:00.000Z",
          "Titre": "Good response and fix but please check…",
          "Contenu": "Good response and fix but please check the parts not cracked before you come next"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara Calandriello",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T17:18:32.000Z",
          "Titre": "Excellent microwave repair",
          "Contenu": "Pete from AAA did an excellent job with our microwave repair. He was thorough and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hi",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T17:54:18.000Z",
          "Titre": "Direct communication with our repairman…",
          "Contenu": "Direct communication with our repairman over text was very helpful. He was very responsive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Behn",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T22:50:36.000Z",
          "Titre": "It was the tech, and I thank him !",
          "Contenu": "It was the tech, Victor who made the difference. He is a great asset to your company and a strong customer service advocate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Bell",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T19:39:08.000Z",
          "Titre": "Repair was quick and efficient",
          "Contenu": "Repair was quick and efficient. The repair person was very knowledgeable. Very nice. No hassle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Shoemaker",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T03:38:59.000Z",
          "Titre": "Easy To use :)",
          "Contenu": "East to use and covered the concern it did take 2 visitsbut is is repaired. Great repair shop. Mike & Jim very helpfull."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Chapman",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T15:48:26.000Z",
          "Titre": "Service Jewelry Repair warranty",
          "Contenu": "Darcy and the Service Jewelry Repair staff are always so nice to me. My ring came back looking like-new."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Baldocchi",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T00:59:21.000Z",
          "Titre": "After pursuing dispute over claim being…",
          "Contenu": "After pursuing dispute over claim being denied, a second technician was sent who was professional and knowledgeable. Corporate customer service is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T02:56:21.000Z",
          "Titre": "The quick response",
          "Contenu": "The quick response, service tech was outstanding, great program very pleased to this point in my 5 year contract."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kpm",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T02:30:12.000Z",
          "Titre": "Always there & responded to my…",
          "Contenu": "Always there & responded to my situation quickly. Took time to get all the information as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T14:22:05.000Z",
          "Titre": "Problem solved quickly",
          "Contenu": "Problem solved quickly.  Technician personable and knowledgeable.  Gave us some good tips."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOSETTE E KAZAAL",
          "Nb_Reviews": 2,
          "Date": "2023-06-18T00:10:42.000Z",
          "Titre": "VERY helpful",
          "Contenu": "The people who answer the questions when you call are patient, kind, friendly, knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betty I",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T00:32:55.000Z",
          "Titre": "It's good that the Company who sold the equipment is the same company providing warranty service.",
          "Contenu": "I'm happy that the local store that sold me the refrigerator is the same company that provides the warranty service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Quick",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T22:48:29.000Z",
          "Titre": "Very professional experience",
          "Contenu": "Very professional experience. All of the people with whom I dealt were very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T01:20:39.000Z",
          "Titre": "No complaints at all. Great for extended warranty issues.",
          "Contenu": "No complaints at all. Very fair on any damage or replacement of components. I highly recommend Centricity"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Cohen",
          "Nb_Reviews": 6,
          "Date": "2023-04-26T20:10:12.000Z",
          "Titre": "Kind people taking in all the…",
          "Contenu": "Kind people taking in all the information and then quickly dispatching a tech to our home to fix the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Smith",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T23:30:33.000Z",
          "Titre": "Not a problem getting a our new television replacement.",
          "Contenu": "Not a problem getting a our new replacement.  Just be patient with them and all is good. By patient, I mean one week. Good company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Abrahamson",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T23:49:39.000Z",
          "Titre": "Be Prepared when you buy!",
          "Contenu": "You never know what can happen when you buy your Appliances!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glen Bandes",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T17:10:10.000Z",
          "Titre": "Excellent response time",
          "Contenu": "They were quick, approved the claim and proceeded it reaching out to retailer for replacement. Excellent service in my opinion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T01:13:35.000Z",
          "Titre": "Rely on Centricity When Buying Used Technology",
          "Contenu": "They say you shouldn't really buy a used computer... well it may be prefaced that you may do so if you have Centricity. Being frazzled with my computer not booting and needing a new Logic Board, I didn't realize it was Friday past 3pm EST when I sent my initial request into Centricity from an iPhone that was rapidly losing charge :( Thankfully the attachment made it! My request was replied to on Wednesday (so within 3 business days) via a very cordial email. Looking back at my files and exchanged correspondence: 1) Centricity was extremely responsive in terms of providing a choice of whether to mail-in my computer for repair (they sent a box and everything) or to recommend a shop within the vicinity (I chose this option as it was deemed to be more expedient).2) They were communicative in terms of when they were in receipt of my request.3) Kept me updated with timing in terms of reimbursement.4) They offered option of payment for reimbursement via either a check or Zelle. At the time, Zelle was a new partner for them; the process was extremely fast without any delays.5) As an aside, I am grateful for the referral to Centricity/Upsie's recommended SVC, Allstates. I have nothing but wonderful superlatives for proprietor Mr. John Hunter. His perspicacious testing (and re-testing) to confirm the issue put me at ease.I wholeheartedly recommend Centricity for their professionalism, responsiveness, and timeliness. In all I was without my computer for maybe a week (considering the wait for parts) and reimbursement took around 45 days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Brzozowski",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T16:44:15.000Z",
          "Titre": "Electrolux dryer service",
          "Contenu": "From start to finish of a service call they made it smooth and easy technician was off the charts knowledgeable, pleasant, respectful to our home and explained everything to us from start to finish."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-06-20T01:52:48.000Z",
          "Titre": "Rarely do I ever give a review of…",
          "Contenu": "Rarely do I ever give a review of excellent to any one because the reviews give an about average rating.  My recent experience with Centricity was outstanding, not average by any measure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Ray Street",
          "Nb_Reviews": 2,
          "Date": "2023-01-28T00:38:41.000Z",
          "Titre": "The service technician explained…",
          "Contenu": "The service technician explained everything he was doing and how I could solve the problem if it happens again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Pyle",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T12:59:25.000Z",
          "Titre": "Be patient and follow up periodically.",
          "Contenu": "Completely covered cost of 2 year old tv which could not be repaired."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T00:09:33.000Z",
          "Titre": "Centricity communicated well throughout…",
          "Contenu": "Centricity communicated well throughout the process. I communicated electronically in my phone to make arrangements to pick up my television for repair. When it was on repairable, they replaced it at no cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anita",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T22:42:44.000Z",
          "Titre": "Washer repair",
          "Contenu": "Technician very knowledgeable, prepared and took care of issue timely.Very happy with my service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Chapin",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T02:30:44.000Z",
          "Titre": "arrived on time and repair was very efficient.",
          "Contenu": "arrived on time and repair was done quickly and professionally."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Virginia",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T19:22:17.000Z",
          "Titre": "The gentleman came",
          "Contenu": "The gentleman came, replaced my modem, no problems.  Friendly, just did what he needed to do and left."
        }
      ]
    }
  ]
}