{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "clarkaudio.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Montea",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T05:53:18.000Z",
          "Titre": "Trying to use this plugin for multiple…",
          "Contenu": "Trying to use this plugin for multiple tracks in a beat and it isn't working.  Not very intuitive to use.  If I use the acoustic guitar then I can't use the drum kits. Or any other instruments."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Samuel Sandoval",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T21:34:54.000Z",
          "Titre": "Bought lofi panda 3 a couple of days…",
          "Contenu": "Bought lofi panda 3 a couple of days ago and when i download the file and try to exract them i message pops up witfile corrupt on it"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Benoit",
          "Nb_Reviews": 3,
          "Date": "2023-07-29T07:59:35.000Z",
          "Titre": "Avoid if you want to save money",
          "Contenu": "I bought LoFi Panda which seemed very cool.When installed, I had the bad surprise to see that none of the parameters can be binded So you cannot really use it to make music, it is not even designed to facilitate the workflow with the mouse...I have asked the support but it has been a week so I don't recommend. In my opinion it is a scam"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "JP",
          "Nb_Reviews": 3,
          "Date": "2023-08-15T23:22:43.000Z",
          "Titre": "Not worth the money",
          "Contenu": "Oof. Some of the samples are really great but the plug-in itself is bad. The FX are awful, filters/eq meh. Very few options to manipulate the sound further and it’s glitchy too. Not worth the price!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erik Martin",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T13:06:31.000Z",
          "Titre": "They sound quality is good but the…",
          "Contenu": "They sound quality is good but the plugin needs some work. Sometimes the audio doesn't trigger in the midi sequence or the piano roll for notes and if the track loops then sometimes the audio gets stuck and just continuously plays the same note until manually stop with the stop button I'm on FL 21 64 bit"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Adrien Guy",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T01:12:07.000Z",
          "Titre": "It’s Ok!",
          "Contenu": "Ok! Plenty of great midi loop and samples"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thom",
          "Nb_Reviews": 3,
          "Date": "2023-10-05T17:51:34.000Z",
          "Titre": "Lo- Fi Panda 3",
          "Contenu": "The pianos alone are worth the price of admission. If you make any kind of Lo-Fi, you're using eq's, saturation, filters and other such things to \"dirty\" up your sound... this plug-in does all that for you with some great presets right out of the box. My only gripe is that I wish there was a mono legato mode for the synth basses and synth leads. One plugin can't do EVERYTHING, I guess. This is something you want in your toolbox though. Great idea from Clark Audio executed very well."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Aldo",
          "Nb_Reviews": 3,
          "Date": "2023-08-31T19:20:55.000Z",
          "Titre": "For the hip hop genre lofi is perfect…",
          "Contenu": "For the hip hop genre lofi is perfect and I use it with enthusiasm, but some sounds have an unbalanced volume and distort, furthermore the drums are really poor in sound even if there is potential. in summary you should equalize the volumes of the presets and add more samples to the drums. However I love it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robi-Wan",
          "Nb_Reviews": 6,
          "Date": "2023-06-27T01:34:38.000Z",
          "Titre": "Really good company and product",
          "Contenu": "Really good company and product. Installation went smoothly as well. My only problem was the download link on the landing page after my purchase downloaded the Mac version and not PC. I tried twice just to make  sure I didn’t click the wrong one. The good news is the link in the email they sent worked fine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T20:17:55.000Z",
          "Titre": "Lofi Panda 3",
          "Contenu": "Great plugin for r&b and hip hop. Smooth buying experience 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T23:01:17.000Z",
          "Titre": "Really enjoying these sounds",
          "Contenu": "Really enjoying these sounds . Another great lo-fi plugin to add to my tool box , Great for creating new sounds extremely easy to use !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Shaw",
          "Nb_Reviews": 7,
          "Date": "2023-08-17T21:44:48.000Z",
          "Titre": "Surprised and impressed with Lofi Panda 3",
          "Contenu": "Really impressed with Lofi Panda v3.2, it's a significant update from v2 - everything from sound quality to variety of instruments is greatly improved.  This is major upgrade in my opinion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Rex Wilgus",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T12:13:46.000Z",
          "Titre": "Love the sounds …",
          "Contenu": "I originally gave this product a 1-star review because I was unable to download it and my emails to customer support were not answered, but the company reached out to me and went out of their way to make things right. They immediately refunded my money and also sent an alternative download link that allowed me to get the product downloaded and installed. I love the sounds in Panda 3 and appreciate the customer support. I didn't want a refund -- I wanted to be able to use this product, and I'm grateful the company was so helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T01:54:50.000Z",
          "Titre": "I’m very happy with the sound quality…",
          "Contenu": "I’m very happy with the sound quality of the instruments provided. I got a really great deal on the purchase and the Customer Support is stellar. I would highly recommend Lofi Panda 3 on the sound uniqueness alone."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dwayne Marcial",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T16:06:18.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product! Very happy with my purchase! Got a great deal and an additional discount so it was an amazing price and the best is high quality. Exactly what I was looking for in my production! Thank you"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Angel Isnardo",
          "Nb_Reviews": 4,
          "Date": "2023-09-19T14:55:52.000Z",
          "Titre": "Perfect Plugin for Lo-Fi Productions",
          "Contenu": "They finally fixed the bug with the recent update (at least for me). Already using the sounds!Overall, the purchasing process was easy."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Trent A",
          "Nb_Reviews": 2,
          "Date": "2023-07-30T04:11:07.000Z",
          "Titre": "A lofi tinkerers dream",
          "Contenu": "Really easy purchase, download and install process. The sounds are lush, warm and ooze that lofi glow I've been searching for! If you are a lofi beat maker or just like tinkering with cosy sounds - this is a must have."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Aile Aiho",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T20:40:51.000Z",
          "Titre": "I'm happy with this purchase",
          "Contenu": "I'm happy with this purchase. It's not a dream come true plugin but the number of sounds is extensive and a lot of them are good for the genre. I also like how they're organized. It's about the workflow."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Daniel Ferguson",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T10:58:51.000Z",
          "Titre": "Inspired sounds and great team",
          "Contenu": "Fantastic sounds, amazing value. There was an issue with one of the sounds and when I reached out to the support team they replied promptly and with a warm greeting. Great team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Beatscribe",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T15:48:08.000Z",
          "Titre": "An excellent tool for lofi hip hop",
          "Contenu": "An excellent tool for lofi hip hop. This is the tool I've been looking for. I have a huge messy collection of samples and instruments to make the lofi sound and I was a little wary of a AU that was supposed to do so much. But it does. The beat samples are decent quality and the melodic instruments REALLY shine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raja Iliya",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T19:18:14.000Z",
          "Titre": "Refreshing sounds to loop with",
          "Contenu": "So nice to have a fresh pack of sounds to loop with, sometimes having too many options is overwhelming and I like how simple and clean this is."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stephen Pelley",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T17:09:34.000Z",
          "Titre": "Awesome!!",
          "Contenu": "Very easy purchase process, quick email for download link, and most important of all, the plug-in is awesome.. such a great value for the price!! Thanks guys, great work!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Nour",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T17:03:57.000Z",
          "Titre": "Nice Sound For Lo-fi",
          "Contenu": "I really appreciated the sound of piano and Key and also the Bass and the clarinet, anyway, there are sounds to discover, it's interesting, I don't regret my purchase"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Patrice",
          "Nb_Reviews": 3,
          "Date": "2023-06-27T09:38:00.000Z",
          "Titre": "Good product with always good update…",
          "Contenu": "Good product with always good update for better sound and functionality"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "THOMAS WARNER",
          "Nb_Reviews": 2,
          "Date": "2022-11-26T19:38:54.000Z",
          "Titre": "I've written so much music using the…",
          "Contenu": "I've written so much music using the LoFi Panda, it's absolutely awesome."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Graham",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T01:36:01.000Z",
          "Titre": "Lo-fi panda 3",
          "Contenu": "A great product and great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SandwichxEater",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T22:40:30.000Z",
          "Titre": "Hell yeah",
          "Contenu": "I snagged a VST recently and it reallllly helped me with my creativity. Sounds are boss, UI is boss.. all around just a great company 🍻"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Andrzej Dybiec",
          "Nb_Reviews": 2,
          "Date": "2023-05-05T16:50:06.000Z",
          "Titre": "I think there is no better sampler for…",
          "Contenu": "I think there is no better sampler for Lo-Fi music than Lofi Panda. I'm so excited to use it in my tracks. Thanks !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny Smith",
          "Nb_Reviews": 3,
          "Date": "2023-07-28T17:42:14.000Z",
          "Titre": "I LOVE THIS PLUGIN!",
          "Contenu": "I LOVE THIS PLUGIN!My only problem is that I want to use it on EVERYTHING now."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "FurMoon",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T21:54:00.000Z",
          "Titre": "Great Software",
          "Contenu": "Highly useful software. Great company."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Electric Blanket",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T15:00:31.000Z",
          "Titre": "Lofi panda works great",
          "Contenu": "No weird gimmicks, just a nice sample based vst. The order on Clark went quick and smooth."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Jacob",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T18:17:43.000Z",
          "Titre": "Solid sound",
          "Contenu": "Solid sound, nice interface, neat plugin"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Federico Spingi",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T19:27:25.000Z",
          "Titre": "Lofi panda 2 is perfect",
          "Contenu": "Lofi panda 2 is perfect for lofi producers"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Sharon Magalnik",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T08:24:21.000Z",
          "Titre": "I really love this plug in",
          "Contenu": "I really love this plug in.   After one day I already wrote a new lofi song!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "dallas",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T20:27:47.000Z",
          "Titre": "amazing samples",
          "Contenu": "all the amazing samples. sounds blissful. u da best. more sounds pls <3"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Luke Wrench",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T17:52:05.000Z",
          "Titre": "Good company",
          "Contenu": "Good company, good prices at fair pricesFree products are good too!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Andrea Richetta",
          "Nb_Reviews": 6,
          "Date": "2023-08-19T16:18:17.000Z",
          "Titre": "Really good product !"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Angel Vrettos",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T18:36:04.000Z",
          "Titre": "Just Lo-fire 🖤"
        }
      ]
    }
  ]
}