{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "clearvpn.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Sallam",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T20:52:12.000Z",
          "Titre": "Not a single location is working",
          "Contenu": "Not a single location is working. All of them return \"Failed to connect to shortcut\" \"Please check your network connection.\" message, even though my internet is fine.Also, i get the support for Ukraine, i support them myself, but i don't want unremovable shortcuts and banners within the app, it feels forcing. At least put an option to hide them.And to top it all, I never received the confirmation email.Will be cancelling the my free trial on the first day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T17:20:26.000Z",
          "Titre": "Not Safe nor Intuitive",
          "Contenu": "This is a disaster or maybe I am missing a huge “How-To?” These \"shortcuts\" are horrible in that it's one or the other? I want full and complete protection all the time and know that when the ClearVPN is on (which is hard to know because my IP address was showing to the world, yet I \"was protected!\") I am fully protected AT ALL TIMES. To wit: my IP is ALWAYS masked; my DNS queries are encrypted and using one server not 11; my connection is blocking all trackers, ads, and malware; I want to change my location on the whim and not anything else all these other safety measures are always in effect. I am flabbergasted by this non-intuitive, poorly implemented VPN coming from MacPaw (yes, it's in beta so heed this critique, it is practical). What of the protocols: Stealth, WireGuard (UDP, TCP), OpenVPN (UDP, TCP), Smart, IKEv2? What about access/blocking LAN connections? How can I connect to the Fastest Connection while maintaining full security? Any outside reviewers on data storage? What happens when you receive a do not notify warrant? How about a walk-through video on how to use? a 7-day trial is not enough for a full review of ClearVPN and how it works/doesn't work. Make some changes, quickly. PS: There are numerous grammar and syntax errors on your site that need to be addressed post haste."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Irisha",
          "Nb_Reviews": 7,
          "Date": "2022-09-18T15:15:39.000Z",
          "Titre": "Time loss and frustration",
          "Contenu": "I've been trying to use ClearVPN for over a year now but with every attempt to activate a shortcut or just log in, there is a problem that takes time to resolve. In the worst case, like today, we give up making it work on the devices we want to and accept the fact that we just spend 30 min of our lives trying to make a product we paid for work.In the best case, I start communicating with the support and after 3 days or so of emails back and forth, the app works. Till 2 days later, when I have to re-install it again. I like the company and their idea with nifty shortcuts, but am getting so frustrated with the product that feels so unstable across all my devices, that consirder asking for money back. Too bad!   Yet another day I decide to dedicate anothe 3 min to write the review."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Carlos",
          "Nb_Reviews": 2,
          "Date": "2022-10-01T02:29:17.000Z",
          "Titre": "worse customer experience ever",
          "Contenu": "worse customer experience ever. Paid for 3 months, never been able to use it and never got back to me.After 3 months, they contact me offering a 45 days voucher (half of what I paid for)"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "mark",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T13:20:19.000Z",
          "Titre": "Awful!!! It does not work!",
          "Contenu": "Awful!!! It does not work! You have to try every channel and if you are very lucky today, you can get connected, otherwise you will waste 10 mins on hopeless trying and none of them works"
        },
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T21:52:10.000Z",
          "Titre": "You need more servers in many cities"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "moo",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T23:14:34.000Z",
          "Titre": "plez make it free"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Viktor Pakhuchyi",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T21:28:32.000Z",
          "Titre": "VPN connection isn't stable",
          "Contenu": "VPN connection isn't stable. I tried to use content switch a few times to watch a football match but failed. A few days in a row."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "whermes",
          "Nb_Reviews": 2,
          "Date": "2022-12-02T03:47:46.000Z",
          "Titre": "Speed is atrocious",
          "Contenu": "Speed is atrocious; without ClearVPN I run 288mps download and 10mps upload. Start ClearVPN and speed drops to 6.8mps download and .56mps upload. That sucks!"
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Tore",
          "Nb_Reviews": 9,
          "Date": "2022-10-23T11:04:46.000Z",
          "Titre": "To slow",
          "Contenu": "To slow. Wanted to switch to ClearVPN from Surfshark because I'm using Setapp. Surfshark is 3 times faster, can't switch because of this."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Alex Falko",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T19:08:18.000Z",
          "Titre": "it barely works ruining your internet…",
          "Contenu": "it barely works ruining your internet experience, then you can't delete it from your Mac"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Palmere",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T22:50:07.000Z",
          "Titre": "always has to be turned on",
          "Contenu": "always has to be turned on, keeps turning off"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Fred",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T19:42:16.000Z",
          "Titre": "I can not watch a Youtube video with…",
          "Contenu": "I can not watch a Youtube video with this VPN turned on. All videos play for 30 seconds and than stops"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack Marchi",
          "Nb_Reviews": 2,
          "Date": "2022-07-08T23:53:46.000Z",
          "Titre": "Once ClearVPN was installed I started…",
          "Contenu": "Once ClearVPN was installed I started having problems signing into some site. Several questioned my location."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Trax",
          "Nb_Reviews": 12,
          "Date": "2023-02-21T06:57:36.000Z",
          "Titre": "Does not work in Vietnam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Krishna",
          "Nb_Reviews": 5,
          "Date": "2022-07-21T12:35:51.000Z",
          "Titre": "Season Out (Logout)",
          "Contenu": "Season Out (Logout)  after 2h hr is one of the bad parts of this VPN"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kirill Liakhov",
          "Nb_Reviews": 3,
          "Date": "2022-05-25T01:34:53.000Z",
          "Titre": "Be wary of ClearVPN",
          "Contenu": "I signed up for their free version, but I was charged for 3 months of service anyways. Poor customer service! I have shown them the invoice of the transaction from my bank dating last week. They have do not know and cannot reimburse me even though I provided the date, bank transaction, and the amount deducted from my account."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Maria Hud",
          "Nb_Reviews": 3,
          "Date": "2022-04-15T14:57:26.000Z",
          "Titre": "The program did not meet my expectations",
          "Contenu": "The program did not meet my expectations.1) promo code didn't work2) I could not connect and watch the content I was interested in - according to my browser with ClearVPN I had AdBlock on so the website won't let me access the content. I didn't switch on this option though, so I am not sure why it was activated. Anyways, this was a loss of my time."
        },
        {
          "Note": 1,
          "Lieu": "MS",
          "Pseudo": "Moi",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T23:50:28.000Z",
          "Titre": "Waaaaayyy too slow",
          "Contenu": "Waaaaayyy too slow, even with 1gb/s fiber nothing loads. Regardless of which country the VPN is in, even if it's in my own country.."
        },
        {
          "Note": 1,
          "Lieu": "TW",
          "Pseudo": "Kurapika",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T17:14:40.000Z",
          "Titre": "It's a scam",
          "Contenu": "It's a scam. I used the SAVEUKRAINE code that ClearVPN promised to offer 1 year free access. But now the app asked me to pay for an upgrade despite it still showing I'm valid till next year. I respect you Ukraine country and people, but please don't lie to users."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T18:50:33.000Z",
          "Titre": "Paid for the service, Not Recieve Anything!",
          "Contenu": "Paid for the service, not recieved anything.Spoke to customer services over the past week, passed form department to deprtment. Provided proof of purchase and still no invoice or login details, told diffrent things each time and still £60 out of pocket and not getting anywhere.I recommend to avoid this company and save your money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2021-08-20T19:05:40.000Z",
          "Titre": "Don't even download.",
          "Contenu": "This is not a product I would recommend, I can't get the VPN or any other services to work, if I hit activate it keeps spinning and I have a very good 5G system in my house. Please do not think for one second to buy this, it is way better to pay more money for a better VPN."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Adrian G / gvadrian",
          "Nb_Reviews": 8,
          "Date": "2022-06-28T14:21:07.000Z",
          "Titre": "doesn't work",
          "Contenu": "doesn't work. when trying to test the free premium account a webpage opens but won't load and would say there's an unexpected error that occurred. needs fixing..."
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Pablo Mariña",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T09:38:49.000Z",
          "Titre": "Terrible support",
          "Contenu": "I bought one year of clear VPN. I got charged and never received any activation key or further instructions. Customer support hasn´t been helpful at all; after writing several times and opening new tickets (asking questions to an already open ticket seems to be useless as I never got an answer), got me to the point where they told me the tech team would look into it to find a solution. There is no time window for this. It has been almost a week now. As far as I understood, I could not get a refund until this happens, assuming this is true."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan Koziolek",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T17:47:37.000Z",
          "Titre": "ClearVPN is useless to me",
          "Contenu": "My main reason for buying a VPN is to watch out of network sports. Without being able to run ClearVPN on my Apple TV and Fire TV, it's pretty much useless to me. Please stop advertising your product as if it were useful to potential customers."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Mohamed AbdelraZek",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T15:11:42.000Z",
          "Titre": "Never work..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Sapien",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T13:31:55.000Z",
          "Titre": "Has to be a better one out there",
          "Contenu": "After first downloading ClearVPN, I was able to change my location, although it would always default to the same one.  Then, it changed from an international location to one within the US, requiring an upgrade to Premium for full features.  Now, I am unable to change at all.  The settings tell me that my \"connection is off\" but there is no way to turn it on.  I have purchased the Premium package but that did nothing to turn the connection on.  Contacting support I received one return message indicating that I should reinstall, which I have several times without any difference.  I get no further response from support.  I would definitely say to stay away from this one."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nick Sweeting",
          "Nb_Reviews": 1,
          "Date": "2021-06-26T03:37:20.000Z",
          "Titre": "What are all these \"shortcuts\" for, and why is there no clear on/off switch",
          "Contenu": "What are all these \"shortcuts\" for, I just want a dropdown for country and an On/Off switch. Like what the heck is \"Sweet Relief\" and why would I ever want a VPN provider doing something like that."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Jérémy bavit",
          "Nb_Reviews": 9,
          "Date": "2022-04-05T07:47:35.000Z",
          "Titre": "Bad vpn",
          "Contenu": "Bad vpn, got free premium pla offer with Ukraine code, which working for 1 days, after they stop it.Even when working, was very slow. I don't recommend then."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Mads Jensen",
          "Nb_Reviews": 2,
          "Date": "2022-01-13T20:39:57.000Z",
          "Titre": "The app literally does not work",
          "Contenu": "The app literally does not work. Whenever I connect to the VPN, nothing that requires internet will load. Cant even open Google. Never had this problem with other VPNs........"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Willem",
          "Nb_Reviews": 2,
          "Date": "2021-03-11T13:23:41.000Z",
          "Titre": "Looks great, but...",
          "Contenu": "Thus far, ClearVPN is useless to me. Looks great, that 's for sure. Only: affter activation all DNS-settings ar gone.Worse, support is fully absent (since Jan 27).Even one star is too many"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alain Burdet",
          "Nb_Reviews": 1,
          "Date": "2022-01-29T00:22:41.000Z",
          "Titre": "I don't get it.",
          "Contenu": "I don't get it.I looked into this ClearVPN, even paid a monthly subscription. But impossible to understand how this works. Waste of time and money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T22:10:00.000Z",
          "Titre": "Trash von",
          "Contenu": "Makes your ping really high download speeds slower not worth it other vpns way better"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dru Brown",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T22:30:44.000Z",
          "Titre": "waste of an app in my opinion",
          "Contenu": "jumping from one country to an other slowing down browsing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela Mancuso",
          "Nb_Reviews": 1,
          "Date": "2021-09-14T00:30:27.000Z",
          "Titre": "I wish I could give this site 0 stars",
          "Contenu": "I wish I could give this site 0 stars. Don't bother downloading"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "testing",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T23:04:07.000Z",
          "Titre": "Very slow connection on my first…",
          "Contenu": "Very slow connection on my first Speedtest."
        },
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "ahmed",
          "Nb_Reviews": 4,
          "Date": "2022-02-28T10:21:44.000Z",
          "Titre": "I paid and nothing works",
          "Contenu": "I paid and nothing works, this is not a real VPN"
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "kolia bokov",
          "Nb_Reviews": 1,
          "Date": "2022-02-27T15:14:24.000Z",
          "Titre": "It doesnt work proterly",
          "Contenu": "2ip shows my location even if Russia was chosen"
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Tron",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T18:52:29.000Z",
          "Titre": "Useless!!!!"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T17:01:55.000Z",
          "Titre": "Slows down the internet connection…",
          "Contenu": "Slows down the internet connection dramatically."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Adam A.",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T12:41:18.000Z",
          "Titre": "ClearVPN is not really a VPN",
          "Contenu": "ClearVPN is not really a VPN. A VPN encrypts your traffic and sends it through an intermediary server. Thus it hides your location, allows you to access content regardless of geographical location, and hides and protects your data - ALL AT ONCE. ClearVPN does NOT do all of this. It purposefully allows you to only choose one of these features at a time while connected. It does this by purposefully exposing your data depending on which option you have selected at the time. ALSO, when you select \"hide your location\" it doesn't actually hide your location. Just run any IPv6 IP Location test online and you will see that it does NOT hide your location. I set ClearVPN to rout my traffic through the US, but it doesn't work. Every IP address location test online shows my REAL location. Not only that, but ClearVPN automatically changes the server location so that you can't select a static location. It switches from USA to Africa to EU all by itself, thus changing your location while you're online. That completely defeats the purpose of the service. This \"VPN\" is not a true VPN, and should not be trusted under any circumstances.[update} In response to ClearPVN (below) all I have to say is that they know damn well that when you rout your traffic through someone else's servers (which is what a VPN does) it covers your IP address automatically. Thus there is no reason to force customers to choose either \"hide my location\" or \"brows securely and privately,\" or \"unlock streaming services.\" If you're routing your traffic through the USA, for example, you can already access USA Netflix. You don't have to have separate features. You're purposefully giving up people's personal data and you know it. Not only is your product totally worthless, but I've lost respect for MacPaw entirely. How could you please such a transparently dishonest, and worthless product?"
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "mark",
          "Nb_Reviews": 1,
          "Date": "2022-03-26T08:50:12.000Z",
          "Titre": "it N-E-V-E-R works",
          "Contenu": "it N-E-V-E-R workstotally a trash"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PETER RUTHERFORD",
          "Nb_Reviews": 2,
          "Date": "2022-03-03T00:42:53.000Z",
          "Titre": "Coupon Code does not work"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "鑫雨至",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T01:35:34.000Z",
          "Titre": "There is no unsubscribe process"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "ce zhu",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T15:49:59.000Z",
          "Titre": "too slow in China"
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Millen",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T16:53:07.000Z",
          "Titre": "With your VPN always problems with…",
          "Contenu": "With your VPN always problems with Netflix"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "George Michel",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T00:09:02.000Z",
          "Titre": "It never connects to any other country."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T07:07:26.000Z",
          "Titre": "seems to be stopping all my dowmloads"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-01-01T04:45:58.000Z",
          "Titre": "It's a VPN but it's slow as hell",
          "Contenu": "It's a VPN but it's slow as hell. Too slow to be practical."
        },
        {
          "Note": 2,
          "Lieu": "UA",
          "Pseudo": "Sergii",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T16:57:04.000Z",
          "Titre": "Does not work for Windows 11",
          "Contenu": "What is nice - it works fro IOS. But it totaly dosen't work for Windows 11"
        },
        {
          "Note": 2,
          "Lieu": "VN",
          "Pseudo": "Reasonable Outcome",
          "Nb_Reviews": 3,
          "Date": "2021-05-07T04:30:13.000Z",
          "Titre": "The interface is terrible and hard to navigate…",
          "Contenu": "The interface is terrible and hard to understand. I think you guys overdesigned it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "robert chin",
          "Nb_Reviews": 23,
          "Date": "2022-03-14T00:02:46.000Z",
          "Titre": "dropped connections six times in half…",
          "Contenu": "dropped connections six times in half an hour"
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T17:47:26.000Z",
          "Titre": "There is no app for android TV"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Phil Bradley",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T18:00:38.000Z",
          "Titre": "ClearVPN via SetApp NOT ABLE TO KEEP UPTO DATE!",
          "Contenu": "I wanted to upgrade Clear VPN, however because it is provided to me via a third party the update is NOT available. I do pay a subscription, so I can NOT see why I can't get the latest version, which is available to direct subscription clients!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kyle Nakamura",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T18:16:52.000Z",
          "Titre": "The \"shortcuts\" concept is frustrating",
          "Contenu": "The \"shortcuts\" concept is frustrating to use. I want to be able to open the app and choose \"Enable VPN\" or choose a country/server to connect to. Instead, I have to look at the shortcuts and decipher which one would reroute my internet traffic without slowing down my connection too much.This could be reconciled by adding an \"expert\" mode for users who need more fine-tuned control over which server they are connecting to."
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T03:51:12.000Z",
          "Titre": "The UI is excellent but the speed is…",
          "Contenu": "The UI is excellent but the speed is pretty low.I try with Singapore server and got very low speed compare to other provide I have used."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "René Hupfer",
          "Nb_Reviews": 9,
          "Date": "2022-07-25T19:34:09.000Z",
          "Titre": "Often very slow servers or packet loss",
          "Contenu": "Often very slow servers or packet loss. And you get IP banned from a lot of sites, which I had never happen with any other VPN. They seem to put too many users on the same IPs."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Lee",
          "Nb_Reviews": 2,
          "Date": "2022-09-03T07:12:43.000Z",
          "Titre": "Nifty UI but speed impact",
          "Contenu": "Its got a nifty UI but my internet speed is severelyimpacted when its turned on. 100Mbps to about 30Mbps."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "Avi Aryan",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T23:14:11.000Z",
          "Titre": "Doesn't work for India",
          "Contenu": "Doesn't work for India, and is slow otherwise"
        },
        {
          "Note": 3,
          "Lieu": "UA",
          "Pseudo": "Andrew Lukianenko",
          "Nb_Reviews": 2,
          "Date": "2022-03-31T20:28:47.000Z",
          "Titre": "Works, but othen very slow",
          "Contenu": "1. It's very slow on my mac. A lot of times I'm waiting for 2-3 to be connected. Sometimes it just freeze and does nothing.2. On my Android phone it also works very slow. Sumtime application fail with connecting to VPN server and my phone can without internet for a few hours.Also on android applications feels very slow and I have to reload it for a few times."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Marco JM",
          "Nb_Reviews": 1,
          "Date": "2022-02-06T15:17:03.000Z",
          "Titre": "MacPaw, great service! The program ClearVPN is awesome",
          "Contenu": "first, the service of the MacPaw company is great.I had an issue with my license, they solved it. Again thanks for that.ClearVPN: it's a great program so far. Only I have some issues to access several websites.. Maybe I need to spend more time to find out how it works well on my MacBook Pro (mid 2014)"
        },
        {
          "Note": 3,
          "Lieu": "UA",
          "Pseudo": "Maks",
          "Nb_Reviews": 1,
          "Date": "2022-02-27T19:54:04.000Z",
          "Titre": "Connection wasn't working",
          "Contenu": "Connection wasn't working, reinstalled app and it worked again, but after hour or two, upon attempt to connect to Russia internet connection falls"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "dharma deva",
          "Nb_Reviews": 1,
          "Date": "2021-10-30T21:25:48.000Z",
          "Titre": "I am on MacBook Air I try to clear…",
          "Contenu": "I am on MacBook Air I try to clear malware viruses and only thing shows is block malware sites please help me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Regino Hinojosa",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T05:26:13.000Z",
          "Titre": "iOS phone application does NOT WORK",
          "Contenu": "On Mac Pro is perfect and works smoothly but the iOS application crash and does not work."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "George",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T16:39:27.000Z",
          "Titre": "Everything is slower when turned on"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Bhavesh",
          "Nb_Reviews": 1,
          "Date": "2022-02-27T06:59:45.000Z",
          "Titre": "vpn is very slow for india please look…",
          "Contenu": "vpn is very slow for india please look upon it"
        },
        {
          "Note": 3,
          "Lieu": "CM",
          "Pseudo": "Alex Tchonla",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T08:48:15.000Z",
          "Titre": "very good apps to use in Darkweb"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RT",
          "Nb_Reviews": 2,
          "Date": "2022-10-01T00:42:16.000Z",
          "Titre": "Clear VPN is great on all devices, but...",
          "Contenu": "Very happy with Clean My Mac and Clear VPN. Great software. Clear VPN is running on four of my devices, but I think on one of my two mac-mini's (both are running Monterey 12.6) Clear VPN isn't configured properly.  On one, my connection speed is 400-600 MB/s with or without VPN active. On the other, my speed is 20-30 MB/s when VPN is active and 400-600 when VPN is off. On the first, configuration for VPN was automatic upon installing the app. So, how to configure the other installation for optimum speed? Not certain how to do this so I will seek tech support."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Joseph Roberto",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T06:21:54.000Z",
          "Titre": "easy and fast",
          "Contenu": "easy to use, easy to set up, and an intuitive interface. My only complaint is a logistical/visual one, I'd like to be able to have the app running without taking up space in my dock."
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Mykola Skira",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T11:59:32.000Z",
          "Titre": "Whenever I move the ClearVPN windows on…",
          "Contenu": "Whenever I move the ClearVPN windows on Windows 11 it lags extreamly. It renders in about 5 frames per second. It's really annoying. But overall the app does what it says."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Przemo",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T11:24:31.000Z",
          "Titre": "Good vpn !!!"
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Andrii Horda",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T21:19:41.000Z",
          "Titre": "Update bug",
          "Contenu": "When the update window showed up, I was able to press \"update\" 3 times in a row and got a window that stuck on 100% percent and two errors. Please fix."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Christopher",
          "Nb_Reviews": 26,
          "Date": "2022-12-04T03:51:52.000Z",
          "Titre": "A generally useful app",
          "Contenu": "A generally useful app let down by it occasionally 'strangling' ones internet feed"
        },
        {
          "Note": 4,
          "Lieu": "ET",
          "Pseudo": "Mulunesh Zebene",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T08:47:18.000Z",
          "Titre": "serving with out interuption"
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Oleksii Skliarov",
          "Nb_Reviews": 4,
          "Date": "2023-02-15T12:49:10.000Z",
          "Titre": "jelly effect",
          "Contenu": "jelly effect on windows app"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "P Kuhn",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T16:00:31.000Z",
          "Titre": "Good but...",
          "Contenu": "I had no problem with actually using ClearVPN and my internet speeds remained usable. However, I depend upon several different websites that needed complete re-signins because of my different apparent location. I realize that is a feature of CVPN. I still have to consider how often I want to use it when the extra steps end up mandatory. I lead a vanilla enough life that I don't know how often I will invoke my CVPN."
        },
        {
          "Note": 4,
          "Lieu": "MM",
          "Pseudo": "Khun Maung Kyout",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T18:11:25.000Z",
          "Titre": "I have never done that before and after…",
          "Contenu": "I have never done that before and after the game"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Marcus Vait",
          "Nb_Reviews": 5,
          "Date": "2022-03-12T16:03:04.000Z",
          "Titre": "Good and reliable but…",
          "Contenu": "Good and reliable but…I really love working with this software since im a big fan of secured access. Unfortunately im seeing a huge issue for me. everytime i connect my ipad via sidecar and start a service from clearvpn my ipad looses its connectivity to my mac and im not able to connect it again. Only if I disable clearvpn its working out. Still big 👍🏼 for this software"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Josiah",
          "Nb_Reviews": 2,
          "Date": "2022-03-10T00:25:18.000Z",
          "Titre": "You have a very good VPN that could be…",
          "Contenu": "You have a very good VPN that could be great, it's just missing a few components and basic information. It would be nice to know exactly what server I'm connected to and have the ability to manually choose servers. Also, when it comes to VPN protocols, I would like the option to choose either OpenVPN or IKEv2. You guys have a great team, so I know you can do this if you really want to :-)"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Sssnake Pliskin",
          "Nb_Reviews": 2,
          "Date": "2022-03-08T17:20:54.000Z",
          "Titre": "Occasionally the app freezes (Windows…",
          "Contenu": "Occasionally the app freezes (Windows 10), it also seems to ask you for your log in details almost every time you launch it (there is no remember me button). But that aside the service is very good maybe the app needs another update to fully stabilize it. I would recommend it tho compared to many other free and paid for VPN's I have used."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DopplerDon",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T19:44:06.000Z",
          "Titre": "nice app",
          "Contenu": "Very easy to use and effective as well"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Doug",
          "Nb_Reviews": 4,
          "Date": "2022-06-06T17:04:27.000Z",
          "Titre": "Good start but a ways to go",
          "Contenu": "Easy installation and I like the other MacPaw products.  Will need to evolve a bit to be able to run more features simultaneously and could be sped up to match the major competitors.  Keep developing.  :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jorge m",
          "Nb_Reviews": 5,
          "Date": "2021-10-31T02:23:18.000Z",
          "Titre": "Thank you ...",
          "Contenu": "Thank you ...So far I've been quite satisfied with the user experience and functionality that I've been able to have with ClearrVPN. Happy to have found ClearrVPN was  included with my Setapp subscription ...but this is where I find that I was only able to give the rating that I have. .. Unfortunately, it seems that the Setapp subscription version is ONLY able to be used on the Desktop/laptop  that it is installed on and that the user isn't allowed to extend the benefits of this most useful and user-friendly of apps to Android mobile devices..m"
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Exquisite",
          "Nb_Reviews": 1,
          "Date": "2021-07-24T04:38:22.000Z",
          "Titre": "Outstanding yet Free VPN",
          "Contenu": "The speed of the VPN is fairly awesome. The lowest speed I've seen is only 9 mbps while sometimes it is about 85% of the original speed, depending on the location. However, it loses connection from time to time and can be even more reliable. Another thing that needs to be improved on the MacOS version is to match the menu bar icon's colour with the other menu bar icons. Sometimes, when other icons are white to math the darker background, ClearVPN's menu bar icon is black and doesn't match. Overall, it's a blazing fast VPN."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Leon",
          "Nb_Reviews": 2,
          "Date": "2021-05-31T22:45:55.000Z",
          "Titre": "The app has a few bugs, but everything else is pretty good.",
          "Contenu": "The app has a few bugs, like being a bit iffy if I resume from sleep, but aside from that, even on the free version, I still get 200 MBit down and 150 up, which is pretty quick. Also, ClearVPN allows for P2P, which many other services don't. I will continue to use ClearVPN."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jean",
          "Nb_Reviews": 2,
          "Date": "2021-12-30T01:46:45.000Z",
          "Titre": "Easy setup and clean interface",
          "Contenu": "Easy setup. Clean interface. Fast browsing. Love the shortcuts to change settings on the fly depending on usage. A bit cumbersome to change location (no shortcut on the dashboard). Would be nice to be able to personalize the dashboard."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Willard",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T14:35:34.000Z",
          "Titre": "Trusting The Name Behind The Software",
          "Contenu": "I like the idea of what a vpn does, and based on MacPaw's hard drive maintenance software that I run, this should be a very good program. But, in my mind, I wonder - how do I know if it's doing what it says?  Trusting the name."
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "Сергей Кришталь",
          "Nb_Reviews": 1,
          "Date": "2022-04-02T07:23:48.000Z",
          "Titre": "Very small speed",
          "Contenu": "Very small speed, can't even browse internet pages normally , while I'm using booking.com, each page downloading around 20-30sec. But when vpn is off, it's downloading around 1-2 sec."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rock Johnson",
          "Nb_Reviews": 5,
          "Date": "2021-10-29T20:35:35.000Z",
          "Titre": "This VPN is very simple to use and has…",
          "Contenu": "This VPN is very simple to use and has a very simple UI. It allows the user the freedom to surf the web privately and allows the user to also change their location. However, I did accidentally uninstall it and when I reinstalled it, the VPN didn't allow me the option to change my location. Instead, it offered two same options to surf the web privately.  I like being able to change the location of my IP address, that way if there is a local cyber criminal physically close to me they won't be able to access my approximate location. That's the only issue I have had with this VPN and it's minor really. I'm sure I'll be able to contact the developer and find a solution. It's so easy to use!"
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Александр Sun",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T08:52:17.297Z",
          "Titre": "In general",
          "Contenu": "In general, everything is perfect. Thanks for supporting Ukraine. The score 4 out of 5 is because there's no chance to choose a russian location ;)"
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Jorge",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T04:50:01.000Z",
          "Titre": "Good",
          "Contenu": "It seems to me that the program needs to add languages such as Spanish, and increase the connection speed more, that would be all,"
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Bohdan",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T07:59:59.000Z",
          "Titre": "All good but I could not use promocode…",
          "Contenu": "All good but I could not use promocode for Ukraine users. Would be grate to get it or receive manual to understand how to use it.Thanks"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Marc Zaffran",
          "Nb_Reviews": 2,
          "Date": "2021-12-19T14:04:24.000Z",
          "Titre": "Efficient but not very user-friendly",
          "Contenu": "Efficient but not very user-friendly. I wish there was a clearer user's manual to indicate what can be used and how."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Marc Dugué",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T16:55:43.000Z",
          "Titre": "Great VPN included in Setapp",
          "Contenu": "Great VPN included in the Setapp package. Worth using it if you are a subscriber of this package."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Ronaldo Matheus Philippsen",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T20:50:41.000Z",
          "Titre": "Maybe you can turn your interface a…",
          "Contenu": "Maybe you can turn your interface a little more responsive with less consume of RAM on Apple Silicon"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Sally Sutton",
          "Nb_Reviews": 5,
          "Date": "2021-12-11T02:17:07.000Z",
          "Titre": "One of the better VPNs around",
          "Contenu": "Easy to set up and use; quite pricey and decimates your download speeds when activated"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vladimir Spiridonoff",
          "Nb_Reviews": 3,
          "Date": "2022-06-29T14:20:34.000Z",
          "Titre": "At timed does not connect to safe VPN…",
          "Contenu": "At times does not connect to safe VPN and keep trying to reconnect."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Shahul Hameed",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T07:48:58.000Z",
          "Titre": "Affordable VPN",
          "Contenu": "Affordable VPN for browsing privately but sometimes doesn't connect"
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Леонид Р",
          "Nb_Reviews": 1,
          "Date": "2022-02-27T10:46:25.000Z",
          "Titre": "thanks for supporting Ukraine but I was…",
          "Contenu": "thanks for supporting Ukraine but I was not able to connect to any country :O"
        },
        {
          "Note": 4,
          "Lieu": "RS",
          "Pseudo": "Aleksov",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T21:01:18.000Z",
          "Titre": "Unlock all servers better and put…",
          "Contenu": "Unlock all servers better and put premium free without credit card"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Petee",
          "Nb_Reviews": 1,
          "Date": "2021-10-24T18:16:31.000Z",
          "Titre": "It was somewhat painful for me because…",
          "Contenu": "It was somewhat painful for me because I'm older and not tech savvy"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Oscar",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T22:41:21.000Z",
          "Titre": "good",
          "Contenu": "simple, fast, good, easyi like it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "william connett jr.",
          "Nb_Reviews": 1,
          "Date": "2021-07-26T11:43:37.000Z",
          "Titre": "Still learning ClearVPN",
          "Contenu": "Still learning ClearVPN, it's work well on my system. Time will tell"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bloodwraith Mantel",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T09:43:46.000Z",
          "Titre": "Its a bit all jammed together",
          "Contenu": "Its a bit all jammed together. Im new to this kind of program and Im lost"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Racayo Ohio",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T04:42:48.000Z",
          "Titre": "App sometime not responding but the…",
          "Contenu": "App sometime not responding but the speed is very fast"
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Olexandr",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T14:01:34.000Z",
          "Titre": "I want to start work with this vpn for…",
          "Contenu": "I want to start work with this vpn for save Ukraine"
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Turbofox",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T16:05:41.000Z",
          "Titre": "High ping in some cases but overall…",
          "Contenu": "High ping in some cases but overall pretty good!"
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Marinus Tornvig",
          "Nb_Reviews": 7,
          "Date": "2022-02-21T01:52:23.000Z",
          "Titre": "Great",
          "Contenu": "Great. But the Change Country disapread."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Majed Bannani",
          "Nb_Reviews": 4,
          "Date": "2022-02-06T13:10:02.000Z",
          "Titre": "very good service",
          "Contenu": "very good service, but still slow sometime"
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Ира Новикова",
          "Nb_Reviews": 1,
          "Date": "2022-02-27T14:03:31.000Z",
          "Titre": "Didn't run after first installation"
        },
        {
          "Note": 4,
          "Lieu": "GH",
          "Pseudo": "Emmanuel Boahene Ansah",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T15:38:49.000Z",
          "Titre": "One of the best VPNs out there"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Michael King",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T01:12:29.000Z",
          "Titre": "Really good like it"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "bruce",
          "Nb_Reviews": 1,
          "Date": "2022-03-05T05:02:07.000Z",
          "Titre": "fast & accurate"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Luis Fernando Arias Oyosa",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T01:37:58.000Z",
          "Titre": "sometimes is slow"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Salman Mannur",
          "Nb_Reviews": 1,
          "Date": "2022-02-27T11:02:13.000Z",
          "Titre": "122345678910"
        },
        {
          "Note": 4,
          "Lieu": "GT",
          "Pseudo": "Jose Roberto Jimenez Herrera",
          "Nb_Reviews": 2,
          "Date": "2021-10-25T15:32:35.000Z",
          "Titre": "Good experience"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Oktay",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:59:27.000Z",
          "Titre": "Trust these guys",
          "Contenu": "I have tried many VPN service before and I know that very well if you do not pay your VPN service provider, you better keep your ass in close perimeter. When it comes to ClearVPN, I am very satisfied with their service and also ease of use of their app both on computer and mobile."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Illia HorbunoV",
          "Nb_Reviews": 8,
          "Date": "2023-02-16T12:23:37.000Z",
          "Titre": "Best VPN I ever used",
          "Contenu": "I like this VPN. It's much better than Windscribe I used earlier. It provides unlimited speed and amount for Ukrainians through Diia verification.I tested several servers in different countries (UK, preferably for me). Everything worked fine with good speed (tested with speedtest.net); it showed an average of approximately 40 Mbps upload and download, which is cool for a VPN, as many other VPNs provide a speed below 5/10 Mbps."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Ярослав Майкович",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T16:54:17.000Z",
          "Titre": "In the area",
          "Contenu": "In the area, when there so many options regarding VPNs, this one I can mark as a best (was using other too before). Can underline simple, straightforward UI/UX, that is equally simple to use for \"power-users\" or beginners. Functionality is perfectly fine."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Enzo Miguel Ambrosio Tupas",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T03:30:05.000Z",
          "Titre": "its really helpful and a must for the on the go",
          "Contenu": "its really helpful and a must for the road warriorswhen your going to a coffee shop, internet cafe, free city wifi, and you're going to connect your mac to a free wifi YOU MUST TURN THIS VPN ON for your safetyof hackersand also useful if your just watching Apple TV, Netflix, Hulu, Prime Video, for reigon locked movies, tv shows,"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Всеволод",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T02:03:09.000Z",
          "Titre": "ClearVPN",
          "Contenu": "Just a good, stable, trustworthy VPN service. Easy to use, secure and fast. It is possible to connect up to 6 different devices via one account, which is great. I would recommend ClearVPN to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Виталий Савченко",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T19:49:42.000Z",
          "Titre": "I'm from Ukraine and clearvpn is free…",
          "Contenu": "I'm from Ukraine and clearvpn is free for me. This should convince the entire civilized world to preserve democracy in their countries, to preserve democracy throughout the world. Countries aggressors, barbarians - must go down in history.Ukraine is a European, democratic and civilized country. And we fight for these values with the barbarians. I am grateful to the creators of this service for supporting our common Motherland."
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Iman Shukri",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T20:14:52.000Z",
          "Titre": "ClearVPN has been a great VPN for me…",
          "Contenu": "ClearVPN has been a great VPN for me for quite some time now. and with its fast and stable connection, and its server on the geo-location shortcut (which most of the websites can't suspect I am using VPN), overall, and at least, it's enough for me to rate 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelvin Kwan",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T16:54:05.000Z",
          "Titre": "Really great, really clear",
          "Contenu": "ClearVPN has been a great VPN for me for quite some time now. and with its fast and stable connection, and its server on the geo-location shortcut and the Hulu shortcut(which most of the websites can't suspect I am using VPN), overall, and at least, it's enough for me to rate 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Денис Федоренко",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T21:15:01.000Z",
          "Titre": "I love the in-app interface and design…",
          "Contenu": "I love the in-app interface and design overall! VPN service itself works quite fine."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "imadraude",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T04:10:57.000Z",
          "Titre": "The best VPN service at the moment",
          "Contenu": "The VPN service is a veritable panacea for online privacy and security. Its intuitive interface makes it a breeze to use, while its robust encryption protocols ensure that all of your data is kept safe from prying eyes. The service is also exceedingly fast, allowing for seamless streaming and browsing. In short, it is a consummate choice for anyone looking to safeguard their online identity."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "FB",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T22:10:29.000Z",
          "Titre": "The only one that really works",
          "Contenu": "Of the VPNs I've used, the only one that really puts your IP in the country of choice was ClearVPN, maintaining your privacy and allowing access to foreign streams!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Anwar Rahim",
          "Nb_Reviews": 2,
          "Date": "2022-08-09T12:51:56.000Z",
          "Titre": "I highly recommend you to use this ClearVPN",
          "Contenu": "I highly recommend you to use this VPN. It has incredibly good speed. I used many vpn like Nord, Bitdefender but clearVPN has good speed and has good connection between sever and client"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Europe Pope",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T04:04:06.000Z",
          "Titre": "I have internet access, thx",
          "Contenu": "I have internet access for free now, so its not for me to judge but if u want... Why you have my 5 stars rate: Help Ukraine, good product, but not friendly PC user interface .Conclusion:When war end and I have money i buy full version, even if I dont need it. Bsc good always comes back good. Thank all of your team CleanVPN."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Dmytro",
          "Nb_Reviews": 3,
          "Date": "2022-09-13T20:13:40.000Z",
          "Titre": "Glory to Ukraine!",
          "Contenu": "Really nice-looking app with awesome UX, as well as VPN service itself. The only missing thing is a Chrome extension, but not a big deal for me."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-16T17:17:53.000Z",
          "Titre": "Hi quality product",
          "Contenu": "Nice design, speed connection, good UI.Don't like only ElectronWeb engine. I hate Electron."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Ahhiko Ahhiko",
          "Nb_Reviews": 1,
          "Date": "2022-08-07T10:15:31.000Z",
          "Titre": "THANK YOU VERY MUCH FOR FREE ACCESS FOR",
          "Contenu": "THANK YOU VERY MUCH FOR FREE ACCESS FOR UKRAINIANCurrently i`m in occupied part,and your VPN saves me from russian censorship"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Anton Hrytsaienko",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T05:47:16.000Z",
          "Titre": "The best VPN you can ever try!",
          "Contenu": "Fast and smooth work on both laptop and smartphone. A lot of useful features. I also really like the design. Nothing to add, just perfect. And I have tried various VPNs to tell this for sure. Additional plus, they support Ukraine!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steven Thompson",
          "Nb_Reviews": 2,
          "Date": "2022-08-04T15:12:04.000Z",
          "Titre": "100% effective IP address hiding",
          "Contenu": "100% effective IP address hiding. I would recommend the deal with Setapp included. Cheapest VPN deal on the web"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Anna",
          "Nb_Reviews": 5,
          "Date": "2022-12-19T14:46:59.000Z",
          "Titre": "best vpn service",
          "Contenu": "best vpn service: easy to navigate, to change location from toolbar settings, all pages works fast."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Dmitry Sakharov",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T12:12:31.000Z",
          "Titre": "A company I trust",
          "Contenu": "A company I trust. Always fast connection and reliable connection. Excellent interface, that is UI and UX design is remarkable. Good job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn Southmayd",
          "Nb_Reviews": 3,
          "Date": "2023-08-19T19:49:26.000Z",
          "Titre": "This product increased my internet…",
          "Contenu": "This product increased my internet throughput by a factor of ten."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MJT CPA",
          "Nb_Reviews": 1,
          "Date": "2022-07-23T20:59:35.000Z",
          "Titre": "Clear VPN is great.",
          "Contenu": "Clear VPN works in the background and I really don't notice it very much. It works very well and provides me the protection that I was seeking in a VPN. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Arvind Kozhiyalam",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T15:36:28.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Came across this service as part of my Setapp subscription for Mac."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The SUS Asus",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T17:04:03.000Z",
          "Titre": "it was great I did not have random ads…",
          "Contenu": "it was great I did not have random ads and it doesn't keep asking you to upgrade you should upgrade"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Wood Border",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T01:05:23.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent, perfectly working VPN serviceAlso, it helps Ukraine which is great"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Nick Dudnyk",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T11:32:51.000Z",
          "Titre": "great",
          "Contenu": "great. I like has a large selection of countries, pretty design, have kill switch. Support my homeland"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Idiot",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T11:03:37.000Z",
          "Titre": "Very awesome its better than nord vpn +…",
          "Contenu": "Very awesome its better than nord vpn + instant connection no problem 100+ stars"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Nikita",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T12:10:40.000Z",
          "Titre": "The developers team quickly fixed my bug",
          "Contenu": "The developers team fixed my bug in a week, which I wrote to support about. Honestly, I couldn't imagine that for me it would be done so quickly. I just love you all <3"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Alina",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T19:39:23.000Z",
          "Titre": "Very nice service ,A+++",
          "Contenu": "Very nice service ,better than expected ... i have 3 VPNs except this one .. and ClearVPN so far is the best i seen.  Thank You"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Kateryna Potaieva",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T20:15:57.000Z",
          "Titre": "I like this app",
          "Contenu": "I like this app. Good for use and cute interface. All functions what i need is. No problem. I will recommend))"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T19:45:57.000Z",
          "Titre": "Very Happy with the Service",
          "Contenu": "Great decried service. Feel very optimistic about my work being secure."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Sergey Plotnikov",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T18:51:42.000Z",
          "Titre": "Fast and Easy to use",
          "Contenu": "Fast and Easy to useGreat app, also better than any browser plugins as some sites can see you're under VPN."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oxana SH",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T14:25:20.000Z",
          "Titre": "helping me a lot with cleaning from…",
          "Contenu": "helping me a lot with cleaning from cash files, coz working online a lot"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Віталій Овсієнко",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T19:29:12.000Z",
          "Titre": "review ClearVPN",
          "Contenu": "Thank you! Simply awesome VPN! What I was looking for! Everything works perfectly, the speed is excellent."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Віталій Ротарь",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T21:40:36.000Z",
          "Titre": "Very good!",
          "Contenu": "Rather fast. There is a feeling that the program slows down a bit. But it's not scary. I am satisfied. Well, the servers are great)"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Anatolii Morhunov",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T20:36:34.000Z",
          "Titre": "Reliable, easy to use VPN service.",
          "Contenu": "The service is reliable, and easy to use. Also it is supporting Ukraine and this is just great. Really great guys"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Sviatoslav Doroshenko",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T13:56:42.000Z",
          "Titre": "Best VPN service",
          "Contenu": "Best VPN service. Especially you want to support Ukraine!!!"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Bogdan Kozlovskyi",
          "Nb_Reviews": 2,
          "Date": "2022-10-08T09:49:48.000Z",
          "Titre": "Awesome VPN!",
          "Contenu": "One of the easiest and most reliable VPN experiences I've ever had!"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Kirill Kilchynsky",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T22:06:30.000Z",
          "Titre": "A+ vpn for Ukraine citizens",
          "Contenu": "A+ vpn for Ukraine citizens. Free Premium after confirmating your citizenship."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Oleksii Kuznietsov",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T14:11:35.000Z",
          "Titre": "Great VPN app",
          "Contenu": "Great VPN app: Functionality, UI/UX.Great developer."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Андрей Турик",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T12:24:24.000Z",
          "Titre": "Great and very simple to use app",
          "Contenu": "Great and very simple to use app, recommend to use. App is very stable and works as expected. My os is Win-11."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Najmul Hasan Prince",
          "Nb_Reviews": 2,
          "Date": "2022-09-10T16:24:07.000Z",
          "Titre": "I Always Use This Vpn",
          "Contenu": "I Always Use This Vpn. It Always Give Me fast internet,"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Олександр Абрамкін",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T11:13:20.000Z",
          "Titre": "thank you!",
          "Contenu": "Works perfectly, great UX, great network and amount of features"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Oleksii Skordin",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T17:42:49.000Z",
          "Titre": "Simple",
          "Contenu": "Simple, reliable VPN client for PC & MAC."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Антон Хусаїнов",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T20:27:49.000Z",
          "Titre": "Extremely great Vpn service",
          "Contenu": "Extremely great Vpn service, the best I've ever used!Thanks to the developers ;)"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "DI Bo",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T13:07:20.000Z",
          "Titre": "After 4 installs and delete work in the…",
          "Contenu": "After 4 installs and delete work in the correct way."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Robbie Gee",
          "Nb_Reviews": 3,
          "Date": "2023-04-20T03:25:05.000Z",
          "Titre": "Very good",
          "Contenu": "Very good, quick and quality.Easy interface and UI."
        },
        {
          "Note": 5,
          "Lieu": "NI",
          "Pseudo": "Rudy Ezequiel Rodríguez Pérez",
          "Nb_Reviews": 1,
          "Date": "2022-07-10T05:53:13.000Z",
          "Titre": "Excellent VPN system",
          "Contenu": "Excellent VPN system, very easy and simple,very nice"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Alex Bakun",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T01:09:35.000Z",
          "Titre": "Cool app",
          "Contenu": "Cool app. Easy to use. Have servers in manu countries. Fast.Nologs"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "awais shahid",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T09:14:29.000Z",
          "Titre": "very nice",
          "Contenu": "I use it 4 years it is very interesting vpn."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Asa Tsui",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T05:27:04.000Z",
          "Titre": "Great Activity",
          "Contenu": "There is many activation for free."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dannie",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:21:38.000Z",
          "Titre": "Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Sergey Vinderskikh",
          "Nb_Reviews": 5,
          "Date": "2023-08-14T00:58:17.000Z",
          "Titre": "Fast and reliable VPN service."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Zabik",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T11:02:15.000Z",
          "Titre": "Useful app with pretty design",
          "Contenu": "Pretty design. Useful application. Stable work."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Старый Профиль",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T11:10:41.000Z",
          "Titre": "Convenient UI and many settings and…",
          "Contenu": "Convenient UI and many settings and features. I recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Adrian Cox",
          "Nb_Reviews": 6,
          "Date": "2022-06-23T14:08:15.000Z",
          "Titre": "Seems a solid VPN",
          "Contenu": "Seems a solid VPN. Very simple to use without any of the mind-blowing PHD stuff normally required by such things. I'm a musician and want to spend my time being music not techy. So ClearVPN comes as a breath of fresh air and its From those lovely people who won Eurovision and then managed to get the UK to host the next one! How the hell did they pull that one off? :) So yes it is everyone favourite people and I suspect that ClearVPN will become likewise everyones favourite. Great job!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Tim Sierra",
          "Nb_Reviews": 3,
          "Date": "2022-06-05T06:32:49.000Z",
          "Titre": "I have been pleased with CleanMyMac…",
          "Contenu": "I have been pleased with CleanMyMac software, from these same folks, and received excellent service when there was a problem after moving to a new computer.  ClearVPN was easy to install and get working, unlike ExpressVPN which I tried just before trying this option.I canceled my plan, for now, as I have no need for it at the present time.  That will not be the case in a few months and I plan to subscribe, and keep the plan, from that point forward."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Олег Рябов",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T18:48:12.000Z",
          "Titre": "Hassle-free VPN",
          "Contenu": "Hassle-free VPN, thanks to developers"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Viar",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T21:44:35.000Z",
          "Titre": "Good app",
          "Contenu": "Good app, no extra functions"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Ivan Furlet",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T15:13:04.000Z",
          "Titre": "Very helpful tool to use VPN services."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Kateryna Spytska",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T12:02:19.000Z",
          "Titre": "simple and great",
          "Contenu": "this app is great. feel proud about ukrainian apps"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Андрей Белополый",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T13:48:46.000Z",
          "Titre": "Great service",
          "Contenu": "Cool service, works perfect"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Liubomyr Reshetniak",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T17:00:17.000Z",
          "Titre": "Fast speed",
          "Contenu": "Fast speed. Many locations."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Viacheslav Metlytskyi",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T17:00:59.000Z",
          "Titre": "BEST EVER",
          "Contenu": "best ever, very beautiful UI/UX"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Laurence Tindle",
          "Nb_Reviews": 6,
          "Date": "2022-08-12T00:10:31.000Z",
          "Titre": "Fitswimmer6",
          "Contenu": "Great a quick and easy connection through the VPN."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "MT",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T22:38:07.000Z",
          "Titre": "nice stable connection for hours",
          "Contenu": "Connection was stable for hours and for free.))"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Max",
          "Nb_Reviews": 2,
          "Date": "2023-01-24T18:22:15.000Z",
          "Titre": "Quick and easy to connect and works…",
          "Contenu": "Quick and easy to connect and works seamless!"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Anton Kononchuk",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T15:33:50.000Z",
          "Titre": "Good app",
          "Contenu": "Good app, easy to use and reliable"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Max Kalem",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T00:35:52.000Z",
          "Titre": "Support the Ukrainians",
          "Contenu": "Support the Ukrainians. They donate part of their earnings to the Ukrainian army. They protect traffic from Russian hackers. And most importantly, they allow temporarily displaced Ukrainians to use Ukrainian services from anywhere in the world."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Evgen Kulik",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T11:55:15.000Z",
          "Titre": "great connection speed",
          "Contenu": "wow, great connection speed"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Serhii Ovcharenko",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T16:21:29.000Z",
          "Titre": "Best vpn",
          "Contenu": "I have freze may because my notebook is old... I dont know"
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Ng Len Hong",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T06:58:43.000Z",
          "Titre": "Easy to use",
          "Contenu": "Good interface and easy to use"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "X__Xenon",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T21:03:39.000Z",
          "Titre": "It works witout problem",
          "Contenu": "It works witout problem. Glory to Ukraine!"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Yury Yudkin",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T21:24:44.000Z",
          "Titre": "Great VPN",
          "Contenu": "Great VPN! Free for free Ukrainians!TY!Слава Україні!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Cozzak",
          "Nb_Reviews": 2,
          "Date": "2022-08-22T10:01:41.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good - works well without slowing everything down."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Роман Чепрасов",
          "Nb_Reviews": 3,
          "Date": "2022-07-16T05:01:58.000Z",
          "Titre": "Light and reliable service",
          "Contenu": "Light and reliable service. I recomend!"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Artem Tymoshenko",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T00:26:45.000Z",
          "Titre": "very fast",
          "Contenu": "very fast, very convenient"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Andrii Cherytsya CHORTik",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T07:31:55.000Z",
          "Titre": "Realy great app",
          "Contenu": "Realy great app. Simple, many options and not have hight price."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T20:25:25.000Z",
          "Titre": "The best VPN ever",
          "Contenu": "The best VPN ever! I'm very happy to use MacPaw products!"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "OK MAN",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T16:31:32.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Max Novytskyi",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T12:59:06.000Z",
          "Titre": "Cool",
          "Contenu": "Cool. Awesome."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Felix Soza",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T14:48:41.000Z",
          "Titre": "Great service!"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Oleg",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T17:07:37.000Z",
          "Titre": "speed",
          "Contenu": "speed, service"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Павел Лобода",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T19:41:38.000Z",
          "Titre": "good program"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Charlie Scene",
          "Nb_Reviews": 1,
          "Date": "2022-07-02T20:20:11.000Z",
          "Titre": "Perfect for all my needs",
          "Contenu": "Perfect for all my needs, lots of countries to choose, seamless 10 minute install, transparent and non-distracting service"
        },
        {
          "Note": 5,
          "Lieu": "LV",
          "Pseudo": "David Gor",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T03:28:08.000Z",
          "Titre": "The best VPN service 🇺🇦"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Олександр Фронч",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T19:50:05.000Z",
          "Titre": "Good service"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Prosto Taras",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T04:37:38.000Z",
          "Titre": "GREATEST VPN YEAAAH IM LOVING IT!"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Elit Tile",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T12:09:10.000Z",
          "Titre": "handy app",
          "Contenu": "handy app, I was able to solve the case thanks to it"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Андрій Стець",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T11:26:26.000Z",
          "Titre": "Everything work just perfect."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Muhammad Farooq",
          "Nb_Reviews": 4,
          "Date": "2023-02-28T10:58:29.000Z",
          "Titre": "good apps for change ip adress"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Shahidul islam",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T11:50:05.000Z",
          "Titre": "good",
          "Contenu": "very good service"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Дмитро Мазур",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T23:10:24.000Z",
          "Titre": "It is perfect!"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "James Stones",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T21:24:44.000Z",
          "Titre": "Amazing app from Ukraine"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Vlad",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T18:45:23.000Z",
          "Titre": "AMAZING",
          "Contenu": "best vpn servise"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Dmitry Vasiluk",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T23:00:00.000Z",
          "Titre": "Just brilliance",
          "Contenu": "Not too much to say. Thanks for your service"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Sergey Topal",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T13:05:05.000Z",
          "Titre": "Very helpful app"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Serhiy Andrieiev",
          "Nb_Reviews": 2,
          "Date": "2023-02-07T17:51:05.000Z",
          "Titre": "good VPN",
          "Contenu": "I'm delighted with this VPN! Thanx!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Volodymyr Paliy",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T13:02:15.000Z",
          "Titre": "I like the way it work",
          "Contenu": "I like the way it work. It just simple and working !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clarity Artists",
          "Nb_Reviews": 5,
          "Date": "2022-07-16T03:08:23.000Z",
          "Titre": "Awesome",
          "Contenu": "Awesome, thank you Setapp."
        }
      ]
    }
  ]
}