{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "computerdiscounts.co.uk",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Eugene Gallanagh",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T10:11:01.000Z",
          "Titre": "Don't buy from this company!",
          "Contenu": "Recommend you stay clear of buying anything from this company. If you have issues they only send you \"How-to-Geek\" suggested solutions. They are reluctant to take the product back to address the issues identified and even when they do, the same issues exist when you receive it back. Issues arose 5 months into the 12 month warranty period for a MacBook Pro13 and they basically ran down the remaining 7 months without providing a fix and then advised us to take it up with Apple directly, as their warranty had expired. Not an ethical company to deal with - stay clear!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Brett",
          "Nb_Reviews": 9,
          "Date": "2022-12-20T16:54:42.000Z",
          "Titre": "Economic product description",
          "Contenu": "The description of the product did not include reference to the fact that the installed OS system was not able to be updated to carry contemporary Microsoft suites of products like MS 365. When I called, I was told that 'most people buying these computers use them for basic stuff'....that may be the case, but it would avoid disappointment to be clear up front about the computer's limitations"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Tooth",
          "Nb_Reviews": 3,
          "Date": "2022-03-18T09:46:14.000Z",
          "Titre": "Already given a review but as the…",
          "Contenu": "Already given a review but as the vendor has solicited another I can only say there is no change - no accountability and no customer service, refusal to give complaints procedure, head office or management details and unwilling to work towards resolution, having cost me £396 over and above the price of the laptop. Beware!P.s. I note that you have replied saying you’ve given a full refund as though that resolves the matter. It doesn’t. With the cost of returning the faulty laptop, it has now cost me £411 for this awful experience and you still haven’t replied to the pre court notice. I still haven’t received the refund so I’m still an extra £170 out of pocket, that’s £581 - which is more than the cost of the laptop."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael Edwards",
          "Nb_Reviews": 4,
          "Date": "2022-11-17T14:11:25.000Z",
          "Titre": "Computer discounts claim 4 day dispatch…",
          "Contenu": "Computer discounts claim 4 day dispatch on laptops  but this claim is misleading. Could not get a straight answer, phoned but was unable to speak to anyone.Very bad experience"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Shana Begum",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T20:37:22.000Z",
          "Titre": "I was really disappointed that the…",
          "Contenu": "I was really disappointed that the charger didn’t work. Then the replacement charger was wrong. Then no one got the address right to send the correct charger 3rd time round. They tried. The lack of attention to detail and double checking when errors are made isn’t the greatest. Can’t charge my MacBook so can’t really tell if it works properly or not."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Craig  Darling",
          "Nb_Reviews": 3,
          "Date": "2022-02-10T15:59:13.000Z",
          "Titre": "Disappointed",
          "Contenu": "Disappointed in the description of the product and disappointed in the after-care service.I was miss sold an American style keyboard, Which is not compatible with the UK keyboard format.In the after-care communications I was spoken to as if I was an idiot. I regret buying from this company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Miss S",
          "Nb_Reviews": 2,
          "Date": "2022-07-21T10:55:18.000Z",
          "Titre": "AVOID, UNSATISFACTORY AND NO REFUND GIVEN",
          "Contenu": "I bought a macbook pro (£864.99) from this company in late 2020 and received a really faulty product. Despite their promise that it would function as new, the macbook had a damaged screen and only a 45 minute battery life. I had to really fight for a replacement and 18 months later, that too is completely unusable. The battery life has drastically declined and it gets SO HOT that I can't use it, to be honest it's DANGEROUS. I've repeatedly asked them for a replacement or refund and implicated my legal rights as a consumer. Every email I send is answered with the same obstructive line about how my \"12 month warranty has expired\" and they are refusing to address anything I say about my consumer rights. It's deeply frustrating and unfortunately it seems that my only option is pursue legal action. Just bite the bullet and buy new, you'll be thankful that you did!Edit: Update in response to the reply they've given me below. You can clearly see a great example here of how they are refusing to acknowledge my consumer rights and are instead stonewalling me by constantly referring back to the expired warranty (which does not affect my rights as a consumer). Replacing a faulty product with another faulty product is not a viable solution. I have rejected the product for a refund, which I am entitled to do under the consumer rights act. REGARDLESS OF THE EXPIRED WARRANTY. Refusing to process that return is an obstruction of my rights. Please do not buy from this company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John Hurley",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T22:56:40.000Z",
          "Titre": "Discount Computers = Discount Scammers",
          "Contenu": "Devious, deceitful organisation that lures buyers in by advertising heavily discounted current model computers before substituting expensive out of date models at check out.Customer Service line is never answered, and emails never receive a reply.Awful outfit that should be avoided at all costs."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jonathan Walker",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T06:57:35.000Z",
          "Titre": "The laptop works fine but I put a…",
          "Contenu": "The laptop works fine but I put a program disc in and it will not eject and keep trying for minutes very annoying"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Tooth",
          "Nb_Reviews": 3,
          "Date": "2022-02-14T17:52:35.000Z",
          "Titre": "Do not buy from this company!",
          "Contenu": "Do not buy from this company!I ordered a laptop from computer discounts and because they failed to label it correctly it didn’t get delivered. The second delivery failed because the delivery driver didn’t read the delivery instructions and so it had to be delivered a third time. I had to take 2.5 days off work to deal with it at a loss of £300 to myself and have also been charged £36 for phoning DHL express to try and track the delivery. Computer Discounts have refused to do anything to resolve this, refused to disclose their complaints procedure, refused to give other legally requested information, refused to answer or give a phone call, reply only by e-mail and do not address the issue raised but just fob off the customer. There is no customer care, no after sales support and no way to make a complaint or to have any issues addressed properly. I’m not sure if they have a head office or not or just a warehouse with a couple of staff but if they do have a head office they refuse to give details for it. Even after involving Trading Standards they are refusing to give the legally requested information or to attempt any resolution. I just want to warn others so they don’t have to go through the same miserable experience I did. 2.5 days spent waiting for and tracking delivery, hours of phone calls, a whole load of stress, £336 out of pocket plus the cost of the laptop at £500+I also noticed they had the exact same laptop/exact same specification advertised for a lower price elsewhere on their website and when I’ve looked on other sites subsequently the exact same spec laptops are available at lower prices and some with next day delivery. So this firm is not the best value, not the most efficient and give no or appalling customer service. Please look elsewhere before using them."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark",
          "Nb_Reviews": 4,
          "Date": "2021-12-17T07:20:45.000Z",
          "Titre": "My computer laptop arrived  faulty the…",
          "Contenu": "My computer laptop arrived  faulty the @ key did not work the laptop would not except updates the laptop would not download files on the website it said fully reconditioned laptops this laptop was not checked and I'm surprised they sent this out without being checked when I complained the computer company sent me a message on how to repair the laptop 😀 not a good company"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Pook",
          "Nb_Reviews": 7,
          "Date": "2021-10-28T12:23:08.000Z",
          "Titre": "Update on laptop after a nine months…",
          "Contenu": "Update on laptop after a nine months owernership.So they SPRAYPAINTED a laptop to make it look shinier. They actually painted over the LEDs and now its all flaking off. It looks terrible and now I understand why the trackpad was so insensitive!There was a crucial screw missing that caused the power connector to fail. I now have a laptop that the power cable falls out of all the time.Paid way too much for a piece of junk :/"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2021-03-09T20:05:00.000Z",
          "Titre": "Quick to dispute Warranty cover.",
          "Contenu": "I was initially impressed, good service and great Comms. However when the middle of my keyboard stopped working ( Known Apple fault) they said it was water damage so I have invalidated the warranty. Strange how only the middle line of the keyboard stopped, no other part. They then went on to charge me, £87 to get it back. A huge shame as would have used them again. I guess all good unless it breaks down."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ramzana Khurram",
          "Nb_Reviews": 2,
          "Date": "2021-08-07T13:22:05.000Z",
          "Titre": "BATTERY ISSUES",
          "Contenu": "Big SCAMMERSSSSSSS. Before you buy do remember the battery life is only 1/2 hours. Absolutely poor. If you are happy with that battery life and it getting hot in 5/10mins then buy but other then that i  totally dont recomend buying from here. This is for all there laptops just incase you were wondering."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dimitri Wren",
          "Nb_Reviews": 1,
          "Date": "2021-07-29T15:51:14.000Z",
          "Titre": "The keypad doesn’t work properly",
          "Contenu": "The keypad get stuck on so many letters/ buttons so it takes twice the amount of time to write stuff and is incredibly frustrating that one is the space bar. I know it’s a refurbished laptop but I don’t think you should sell laptops where the keypad is this bad because it’s such an important part to a laptop. I’ll have to buy another keypad now and connect it up every time I want to type something on the laptop going forward. I understand it won’t be perfect but I thought this would have been tested before selling."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Transparent",
          "Nb_Reviews": 1,
          "Date": "2021-01-26T16:08:16.000Z",
          "Titre": "Poor service",
          "Contenu": "Poor service. Found these really hard to deal with, no phone number so all email as live chat is a waste of time. They say if you order today you can have in two days time then when you place an order it takes a week or more to get the order. Poor service and will never use again. Cheap systems, cheap service, if I could give a zero star to be fair that's all they would get"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nick Essex",
          "Nb_Reviews": 2,
          "Date": "2020-12-18T14:06:48.000Z",
          "Titre": "Utter disaster",
          "Contenu": "Utter disaster ! Monitor stand broken, cheap cables that dont fit & software error so i cant even set it up ! Im an experienced user & regular buyer of PCs & laptops. This is a christmas present for my Mum ( 4 hour drive away )  but they are slow to put thing right so Xmas now cancelled.  Customer service is email  only & no urgency to help fix this shambles. Honestly dont bother . Zero stars"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Londres e Eu !",
          "Nb_Reviews": 7,
          "Date": "2021-02-08T11:51:53.000Z",
          "Titre": "Very bad experience II",
          "Contenu": "As if it was not enough, now the company tried to discredit my review, saying that we  had ever negotiated. Shame on you computer discount. But, sorry I recorded all ours emails and communications and the Trust pilot verified everything and gonna keep my review. You should just return my money. That is it. Don’t play dummy with your customers."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "mohammed bakhshi",
          "Nb_Reviews": 2,
          "Date": "2021-05-03T14:56:11.000Z",
          "Titre": "I am not happy with my purchase",
          "Contenu": "I am not happy with my purchase. The Mack book is so low and it gets while to open an app. So annoying. On the add it says it is been checked by Ingineer and I full and perfect working condition however it wasn’t and I had to spent hours to reset some setting. Anyway this hasn’t worked and still facing same problem."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "graham hall",
          "Nb_Reviews": 3,
          "Date": "2021-04-04T18:30:17.000Z",
          "Titre": "this  computer  is  not  working  right…",
          "Contenu": "this  computer  is  not  working  right  as  some  of  the  workings  am  not  in  the  right  place  on  the  keyboard  so  you  have  to  keep  working  on  the  keyboard  to  find  out  where  they  am  so  you  can  use  them  when  you  need  them  so  first  you  have  to  find  where  they  am  on  the  keyboard"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Hywell Griffiths",
          "Nb_Reviews": 16,
          "Date": "2020-12-01T18:00:44.000Z",
          "Titre": "This was the most frustrating…",
          "Contenu": "This was the most frustrating experience ever! We have sent the MacBook Air back 3 times - and the so called repairs- for which we were not notified what was done - were useless! As was the customer service! How are we as a small company expected to operate with the faulty equipment sent out! I would NOT recommend Computer Discounts!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Keith McManus",
          "Nb_Reviews": 11,
          "Date": "2021-08-27T09:37:34.000Z",
          "Titre": "All American keyboard",
          "Contenu": "All American keyboard, symbols no euro key or £ key have to use shift and dollar sign, which I had to update which took forever, communication poor, poor packaging, when delivered arrived unannounced and soaking wet. Would not purchase again from this company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sara Hawkins",
          "Nb_Reviews": 6,
          "Date": "2021-12-22T12:26:47.000Z",
          "Titre": "The laptop I purchased has a battery…",
          "Contenu": "The laptop I purchased has a battery life of only 45-60 minutes. When I queried this, I was told this is expected of a refurbished laptop. This information is not included anywhere on the website. When I queried this, the sales team advised me that I should have known a refurbished laptop would have reduced battery life and would only really work when plugged into a PowerPoint. The laptop was c.£400, so I'd have expected the battery to last longer than this. Based on the companies lack of information at the point of sale and lack of support following reporting the technical issue, I would not purchase a laptop again from this company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jada jai Love",
          "Nb_Reviews": 8,
          "Date": "2020-05-22T10:34:06.000Z",
          "Titre": "DO NOT TRUST this company they have…",
          "Contenu": "DO NOT TRUST this company they have sold me a computer that never worked from the day I got it and then sent me the same one back that did the same do not waste your money on a computer that will take at least 30 minutes to reboot, this can not be taken down as it is just and I have the email correspondence confirmation of these problems, This is actually my first review stating these extra issues that arose using your company"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jay Fisher",
          "Nb_Reviews": 4,
          "Date": "2020-04-23T09:09:28.000Z",
          "Titre": "To good to be true",
          "Contenu": "So far so good, providing everything turns up on time.Upon receiving the laptop it’s been nothing but issues! No one answers the phones the laptop doesn’t run properly the keyboard stopped working. Microsoft store disappeared nothing but trouble! I advise you go else where!!! Reading the bad reviews on here i should have known it was to good to be true. I’d look at doing the right thing and buying newNow I’ve had e-mails begging to remove this review. I’m extremely disheartened at all this."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "T. M.",
          "Nb_Reviews": 1,
          "Date": "2021-02-22T01:10:11.000Z",
          "Titre": "False Promises on Website",
          "Contenu": "Bought a laptop in good faith, it said on the website items were despatched next working day. This was one of my reasons for choosing the company. I needed a replacement urgently. 3 working days - nope. emailed, was told 5 working days - nope. After 8 days emailed again saying cancel my order and provide a refund. I'm finally told laptop is coming from UAE!! So it was never going to be next day delivery. After cancelling order laptop still arrived, I had to pay £11 to send it back, having told them not to send. I was told a pack of lies all way through."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Daniel Croly",
          "Nb_Reviews": 6,
          "Date": "2020-06-25T08:06:51.000Z",
          "Titre": "Bad Experience",
          "Contenu": "Item was delivered faulty and made to wait nearly 3 weeks for my refund can't talk on phone which tells me they must get a lot of unhappy customers CD sent a courier to collect ans somehow item got lost between courier and themselves but I was required to do all the chasing..... Wouldn't use"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "dawn",
          "Nb_Reviews": 6,
          "Date": "2019-03-14T16:59:07.000Z",
          "Titre": "NOT FIT FOR PURPOSE",
          "Contenu": "My partner bought a gaming computer for his son for christmas. About 2 weeks ago it decided to not work. We got in contact with them and was told the 60 day warranty had expired. Even though you get one years guarantee. So we took it to a computer repair shop. They told us that it wasn't a gaming computer and the hard drive had failed. Leaving us with a £75 Bill to pay. I know these are reconditioned computers but surely it should last more than 3 months."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ramesh Vithal",
          "Nb_Reviews": 8,
          "Date": "2017-02-21T23:24:55.000Z",
          "Titre": "a crap company who promise you a lot but  do no t deliver.!!",
          "Contenu": "Bought a comp from them and the soft ware crashed had to fix iitt myself as they refused to help, response we can not help as soft wear problems has nothing to do with them!!! i did not pick and add it they did, luckely i know a little about computers and cuold fix it myself with a new program. but never again will i recommend or buy from maximcompters again!! would normally support smaller companies butb not this one :("
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jay Fisher",
          "Nb_Reviews": 4,
          "Date": "2020-04-30T16:58:54.000Z",
          "Titre": "I bought a laptop on the 8th of April",
          "Contenu": "I bought a laptop on the 8th of April, nothing but trouble! Laptop was in use able they literally NEVER answer the phone. 1 email per day! Sent back the item and was told 3 working days for a replacement, 3 days later and... nothing. I get an e-mail saying they can’t send one because of “stock” that asked if I wanted a refund and I said I wanted a working laptop, that’s what I paid for. I said I was contacting my lawyer to now have a refund when I didn’t want one. Absolutely disgusted in the “customer service” fuming. I wouldn’t bother using this place at all!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Josephine",
          "Nb_Reviews": 2,
          "Date": "2017-03-08T22:23:24.000Z",
          "Titre": "Defective product. Poor after sales support.",
          "Contenu": "We bought a iMac which was faulty. The replacement arrived but could not be upgraded to the latest operating system, which was not made clear at the time of purchase. This has meant peripherals don't work, and their after sales support is a joke.Oh, apparently because I bought it via eBay, they don't think I should be able to review them. #desperate! I suggest whether you are an ebayer or not you steer well clear to avoid what I have experienced. #bettercompaniesoutthere"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "imogen barber",
          "Nb_Reviews": 1,
          "Date": "2017-02-23T10:47:01.000Z",
          "Titre": "Spent more a repairing it , then what I paid",
          "Contenu": "Didn't last a day. The so called one year warranty is a gimmickThe warranty states 12 months, the initial first few weeks is irrelevant .If you state 12 month guarantee then honour this.At the time of purchase , I did state it was a Xmas gift This was still in the guarantee timescale .In short your guarantee for 12 month simply isn't  viable.This is my honest experience of shopping with this companyDo not believe the gimmick advertising .Maximum - please do not harass me any further"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tomasz Wroblewski",
          "Nb_Reviews": 1,
          "Date": "2021-04-18T17:48:21.000Z",
          "Titre": "The company made me pay to return the…",
          "Contenu": "The company made me pay to return the package, despite the fact that it is the company’s fault because you can’t update the software. Who needs a laptop that cannot be updated, I would never recommend this company to anyone"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Na Zheng",
          "Nb_Reviews": 3,
          "Date": "2019-09-05T16:43:29.000Z",
          "Titre": "I just want told customers who want buy…",
          "Contenu": "I just want told customers who want buy something from this place,you must be very careful before you buy! I just bought a laptop from this company the button doesn’t works very well,it is very slowly ! And I just can receive message and can’t send message to my friends!it’s really strange!so I just complain to customer service and want refund it ,because it’s promised 30day Money back!but they just replied me rubbish!no any help for me and no refund for me!so please be very very careful before you buy!their services really really rubbish! I don’t go back again because I am very very disappointed!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jada Rose",
          "Nb_Reviews": 1,
          "Date": "2019-08-08T09:50:55.000Z",
          "Titre": "BEWARE OF THIS COMPANY",
          "Contenu": "BEWARE of this company, they sold me a computer that had issues from the very start, I returned it and got back the same computer with the same issues, I.e taking a ridiculous amount of time to reboot, and other errors, I then contacted the company to say that I had had enough and wanted to return the computer for a full refund they sent out two delivery companies the first company was obviously bogus and they no have no confirmation of the pick up, so I will now be taking this to the police, DPD were aware of them so this is obviously not the first time, any one wanting to contact me direct regarding this and the police case number please leave a review"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ravinder Dosanjh",
          "Nb_Reviews": 3,
          "Date": "2020-04-10T22:09:10.000Z",
          "Titre": "Bought for my son",
          "Contenu": "Bought for my son, he said it is really old 2014,small and slow, really dissatisfied and disappointed, I spoke on live chat with sellers, sounded reassuring and reasonable, Want to return and refund unfortunately"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Lacey",
          "Nb_Reviews": 1,
          "Date": "2021-03-20T16:31:48.000Z",
          "Titre": "Awful service",
          "Contenu": "Very poor service and quality of product. Would never consider refurbished product again!! Could not contact anyone by phone and the service was very disappointing via email correspondence."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ashford Yeboah Boateng",
          "Nb_Reviews": 2,
          "Date": "2017-02-21T15:37:52.000Z",
          "Titre": "Bad product",
          "Contenu": "My computer does not work properly, I hardly connect to my wifi @ home, I'm planning of selling it at cash exchange, so that I can get myself a new one, I bought this MacBook about four months ago . Not happy at all."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "JAMES McLOUGHLIN",
          "Nb_Reviews": 1,
          "Date": "2021-01-16T15:09:55.000Z",
          "Titre": "Laptop returned to CD with key fault…",
          "Contenu": "Laptop returned to CD with key fault for repair. Sent back with exactly same fault which suggests no repair. Money more important than service. Keep well clear of Computer Discounts."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Emma",
          "Nb_Reviews": 14,
          "Date": "2020-04-29T10:08:21.000Z",
          "Titre": "Terrible service",
          "Contenu": "Instantly lose 1 start for repeatedly asking me to leave a 5 star review before the product even arrived...From the moment we opened the box it had issues.  Feet hanging off or missing, screen constantly turning around, internal errors, etc.  They told me it was me pressing buttons but it did it even when we weren't touching the thing!  They also said I should take it apart and start fiddling with wires.  I asked for a refund, but they sent a replacement, even though I had asked them not to.  They apparently couldn't find my correspondence to show that's what I had asked for, nor had a record of sending a 2nd one.  Terrible communication and would not recommend using this company.  For the same price I have bought a brand new one with warranty etc"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Irene",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T13:58:32.000Z",
          "Titre": "I order a MacBook Air from the website",
          "Contenu": "I order a MacBook Air from the website, when I started tracking the shipment I was surprised it was coming from Dubai since they said it was coming from the UK. After a week, it arrived a computer that I can’t even describe. It was a joke. I think it was a MacBook inside but with a fake chase. It didn’t have the serial number at the bottom, the mouse pad was not working as a normal macbook and the screen was so fragile. I was so disappointed as that was not a real MacBook nor a refurbished one. Although I had to pay the shipments I sent it back the same day and asked a refund which arrived within one week, which was really good. Also they were really responsive to my emails. Nonetheless the worst place to buy, as I got very scared since I paid such a big amount of money for being messed up with."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Londres e Eu !",
          "Nb_Reviews": 7,
          "Date": "2020-11-28T15:01:36.000Z",
          "Titre": "What a really BAD experience",
          "Contenu": "What a really BAD experience! I bought a Macbook Pro 13.3 and it came with several problems like: The screen glass fallen, the computer battery doesn’t hold charge more than 2 hours, overheating and it keeps turning off randomly! They keep email you with kind words but no action at all. They keep saying the courier couldn't pick up the computer for replacement because of my postcode(the same one they used to send me the computer) and now the glass frame broke because it dropped down on the ground and cracked. Don’t buy it! If you have a problem you will be by your own! Trust me! Really bad company to deal with. BAD BAD BAD BAD BAD experience!27.11.2020 - Just to update my situation, I had to replace the charger and the CHD because both of them are broken). What a bad experience."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andrew Legg",
          "Nb_Reviews": 2,
          "Date": "2017-02-21T16:00:19.000Z",
          "Titre": "Not very helpful when I had problems",
          "Contenu": "When I had a problem with my laptop i emailed them explained what the problem was and was told to take my laptop to my local computer shop i felt i was ignored it cost me 90 pounds to put it right"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dennis and Linda Webb",
          "Nb_Reviews": 16,
          "Date": "2020-04-16T13:57:47.000Z",
          "Titre": "Received computer with excitement…",
          "Contenu": "Received computer with excitement yesterday. No instructions. When trying to connect Wi-Fi could not proceed as Y is showing as Z so can not use computer ."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Willow",
          "Nb_Reviews": 2,
          "Date": "2021-10-01T14:17:04.000Z",
          "Titre": "Bad quality",
          "Contenu": "Computer came and worked well however I soon got a notification saying that the battery was poor quality and the charge holds awfully."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jay Fisher",
          "Nb_Reviews": 4,
          "Date": "2020-11-14T10:54:39.000Z",
          "Titre": "Continues with emails asking to remove…",
          "Contenu": "Continues with emails asking to remove bad review, I had a bad experience and will leave the review, that’s my right as a consumer."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nick Essex",
          "Nb_Reviews": 2,
          "Date": "2021-01-13T23:23:24.000Z",
          "Titre": "Shambles of a company !!",
          "Contenu": "Shambles of a company !!!   Bought PC + Monitor bundle as a Christmas present for my Mum. Within 30 minutes of PC arrival i was on the phone as monitor broken & emailed many photos . They promised to send replacement immediately & to expect arrival in 3 days. Two days later i sat down to do full set up but cables were wrong spec, mouse didnt work, & i was unable to ever set up PC. They admitted they never checked if cables would work with that machine spec. Despite their promise 3 weeks later no replacement parts ever arrived. They never lifted a finger to help or even phoned me despite repeated requests. They were not interested in fixing the problems whatsoever. However i did get emails pleading for me not to leave a poor review ! Waste of time. Now Requested a full refund. Mum never got her Christmas present. Will keep you informed of refund. Please go elsewhere these people are useless. Once you have paid money they are not interested in helping whatsoever. Copy of this review also sent to my learned friends."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Don",
          "Nb_Reviews": 13,
          "Date": "2021-03-21T13:23:28.000Z",
          "Titre": "Avoid buying from this company",
          "Contenu": "Avoid buying from this company at all costs!  Waited over a week for delivery on a Macbook Pro, only to find screen damaged when opened.  While they appear somewhat 'accommodating' in emails and overly effusive with their platitudes, (don't bother calling as their phones are not manned!) their emails are repetitive, templated and filled with hollow promises. I have received the same response verbatim on several occasions.  After waiting over a week for a replacement or acknowledgment that they had received the damaged computer, they simply stopped responding to emails altogether.  Only when threatened with legal action did they acknowledge my correspondence and supposedly issued a refund.  This can all be backed up with emails.  Since writing this, I have been inundated with correspondence from them begging me to edit my review of my experience, promising me a 'gift' if I complied.Having just read some of the other reviews on this company I was surprised to learn that they had tried to discredit their reviews with Trustpilot as well.  Very very shady!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kazard",
          "Nb_Reviews": 1,
          "Date": "2020-04-22T13:09:11.000Z",
          "Titre": "You sold me a Chromebook laptop that…",
          "Contenu": "You sold me a Chromebook laptop that needs wifi to work but the laptop does not allow me to connect to any networks!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Laura Stokes",
          "Nb_Reviews": 2,
          "Date": "2021-01-19T19:13:01.000Z",
          "Titre": "AVOID AVOID AVOID!",
          "Contenu": "AVOID AVOID AVOID!bad experience that is still ongoing. ordered a laptop on the 4th Jan because they had a lot of good reviews and a promise of fast delivery - 2 days. After emailing a few times to see where my item was it was finally dispatched on the 12th Jan. Noticed it was coming from Dubai instead of Milton Keynes and received on the 14th Jan. Open the box and the laptop is scratched to all hell and will not work if it is not plugged in as it doesn't hold its charge. Requested to refund and we agreed a courier would come on the 18th to collect so took the day off work. Found out on the 18th that the courier wasnt coming till the today so I asked them why and they tell me that DPD advised they could not collect till the 19th.. so why did no one tell me? I could have gone to work and I am a frontline a&e worker so getting the day off wasnt easy! Collection should have been today so because I couldnt have another day off work my mum did and I got notification to say it had been collected by DPD local.. it hasnt its still here in my house! So disappointed. I wont hold my breath for getting my refund. Customer services are kind but thats the only good thing to say about this company. They tell me they are a genuine company but I know longer believe them. Go buy from somewhere else instead of wasting your hard earned money coz I will never see mine again!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paula Santos",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T21:25:47.000Z",
          "Titre": "Disappointed",
          "Contenu": "Monitor looks nothing like the image and the computer itself doesn’t work properly"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dissatisfied",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T15:44:46.000Z",
          "Titre": "It doesn’t work at the moment",
          "Contenu": "It doesn’t work at the moment, still waiting for it to be resolved."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "neal mcnulty",
          "Nb_Reviews": 3,
          "Date": "2017-10-10T12:24:34.000Z",
          "Titre": "Shocking performance",
          "Contenu": "Shocking performance.    Still waiting after a week.   No response.     A disgrace"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "X Weng",
          "Nb_Reviews": 3,
          "Date": "2020-10-06T12:55:08.000Z",
          "Titre": "Broken machine arrived",
          "Contenu": "Broken machine arrived. Return and refund were easy."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mohammad Sabir",
          "Nb_Reviews": 3,
          "Date": "2022-11-22T22:13:32.000Z",
          "Titre": "No saying",
          "Contenu": "I don't know ..????????????"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "siobhan kennedy",
          "Nb_Reviews": 7,
          "Date": "2017-02-22T10:37:46.000Z",
          "Titre": "PC not fit for purpose",
          "Contenu": "The computer sold is not fit for purpose"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nida Khan",
          "Nb_Reviews": 2,
          "Date": "2020-10-26T12:54:06.000Z",
          "Titre": "I haven’t received the product yet"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "O Ajede",
          "Nb_Reviews": 1,
          "Date": "2017-03-06T04:02:54.000Z",
          "Titre": "Not the best",
          "Contenu": "The system do give problems."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Laurent C",
          "Nb_Reviews": 1,
          "Date": "2021-01-21T10:45:42.000Z",
          "Titre": "Dodgy. Very unprofessional. Low quality. Do not buy.",
          "Contenu": "We bought a refurbished PC for my son as a Christmas present. He's a child and it was his first computer, so we thought a refurbished computer was the best option, as it's cheaper. This company had good reviews, so we decided to go with them. Mistake.We received the computer quickly and it was well packaged. The first thing we realised was that everything was a different make: the tower, screen and screen stand. Not a big problem, but it did look quite cheap.The mouse and keyboard were light, cheap plastic. By looking at them we knew we would have to replace them soon.When we plugged it, we realised that the PC's language was set to French. Luckily, we are French speakers, so it was not a problem (other than the fact it was not what we had ordered), but we thought this could have been problematic for a different family. The computer was fairly slow to boot, but my son was so happy with his gift that he did not find it frustrating.We bought the PC for my son to play Minecraft. While he was playing in the evening of Christmas day, the computer's screen went black and a message appeared. It read : A disk read error occurred Press Ctrl + Alt + Del to restart. When we restarted, the same message appeared.I emailed Computer Discounts, to ask them what to do. They had no clue. They told me I should go and fiddle with System preferecences and reboot windows. I had no access to Windows. Some friends of mine are computer engineers. I asked them what to do and they said the disk was faulty (and that the people who refurbished the computer probably knew it) and there was nothing to be done, it needed binned and changed.The kerfuffle began. I think we must have exchanged about 70 emails. They would not answer my questions, they would write in such poor English that understanding what they meant was at times impossible. I wanted to talk on the phone, but they refused to give me a phone number.I live in Scotland. They told me that in order to return the computer, I would have to arrange my own courier, because their courier only deals with mainland UK. I had to write an email explaining to an adult that Scotland is indeed in mainland UK. Who are these people? A joke.The emails they sent me are so unbeliveable that I've kept them. If you want to have a look at them, contact me, a few weeks after the event, they're funny. Not at the time, though. At one point, they even told me how much margin they make on each computer, and explained that by organising the courier themselves, they would be making no money out of this sale. Why should I worry about this? How unprofessional!They also told me they 'expected my kind understanding' several times. Cheek! They are so aware of how ridiculous they look that at least three times they felt the need to add to their email 'we are a legitimate company'. Who does that but unprofessional dodgy businesses? It's like dealing with kids who'd be selling fake raffle tickets.It took days to arrange for their faulty computer to be sent away. I commend my wife who managed to understand their emails in spite of their lack of basic English writing skills. Weeks later, we were fully refunded, and went to a proper computer dealer and bought a proper computer. It works, looks good and sturdy. Because of this joke of a 'company' my son was so disappointed on Christmas day, but he is happy now.Do not buy from them, they are a farce.Edit: I was wondering how they get such good reviews. Yesterday, they sent me an email, offering me £10 to remove my negative review. Why not a Mars bar, or some marbles? This must be a bad BTEC project, surely. Legitimate companies don't pay to keep their customers misinformed. You don't need to have attended business school to know that that's a really dodgy marketing technique.People who do this don't hesitate to write their own positive reviews. Stay away."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Lara Gavanski",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T14:20:06.000Z",
          "Titre": "bought a MacOS Catalina a few years…",
          "Contenu": "bought a MacOS Catalina a few years ago. Within a couple days it was having some issues. I had already set it up and had to send it back which was in itself very annoying. However, they helped and were quick and sent me another laptop in replacement. After that experience and having set up another one, this strange vertical line appeared on my laptop about less than a year later. It was annoying but see-through and having done so much with this laptop already, I notified them but put it off because I didnt want to re-start the whole process AGAIN. And now that line has turned into a solid 2inch band and they cant help me because it's beyond their contract, even though the problem started early on and I notified them."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Danny-Lee Shay Sharkey",
          "Nb_Reviews": 6,
          "Date": "2022-05-28T00:40:21.000Z",
          "Titre": "Really not impressed at all!!",
          "Contenu": "Really not impressed at all after receiving my MacBook Air. After 10 mins of it being set up the software updated, to a now out of date of version. 40% off the apps on store I can't have because it isn't running on iOS 12 or more. Its basically spares and repairs now! Almost £400 for a load of rubbish. Staff are only interested in the initial sale, beyond the point of getting your money they're not very helpful at all. I would never use this company again, I would advise any one else to go elsewhere to spend your money!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr. Alan Cole",
          "Nb_Reviews": 3,
          "Date": "2022-04-19T17:50:58.195Z",
          "Titre": "Ordered a Mac book which was faulty",
          "Contenu": "Ordered a Mac book which was faulty, returned and credited. Ordered second which has a different fault and we are awaiting collection. Maybe we have been unlucky but it’s very frustrating as we want one that works"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Damien McCormack",
          "Nb_Reviews": 9,
          "Date": "2022-02-17T10:04:50.000Z",
          "Titre": "Computers were very slow to boot up ..",
          "Contenu": "Computers were very slow to boot up ..Called number and sales rep said couldn’t help and said you can only speak about sales not possible to actually talk to a CS rep can only email! I personally like to speak to an actual person..Then to return them was £48 so not really worth the hassle..Can see why Amazon do so well .."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "andrea ogden",
          "Nb_Reviews": 9,
          "Date": "2022-08-16T18:43:20.000Z",
          "Titre": "This is the slowest computer device I…",
          "Contenu": "This is the slowest computer device I have ever had,  and I've had a few.It's worse than watching paint dry,  but then you get what you pay for."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mrs Marquiss",
          "Nb_Reviews": 28,
          "Date": "2022-06-27T14:22:03.000Z",
          "Titre": "Let down by Customer service",
          "Contenu": "Purchased a refurb MacBook 2 years ago, been having a few problems so emailed for advice, still had a few problems and wondered whether it was worth spending any more or just buying new machine. All was going well till customer services got involved, told me machine was out of warranty and sent a link to read proving it. I wasn’t asking for it to be repaired under warranty or replaced, just needed advice was it worth it. Now decided myself it’s not worth it neither are they. What a shame. Company is as strong as weakest link. That in customer service."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T16:05:20.000Z",
          "Titre": "Ordered a laptop which said arrived in…",
          "Contenu": "Ordered a laptop which said arrived in two days then they said it wouldn’t but would arrive the following week. I took two days off work and it still never arrived. They would not give me a tracking number and didn’t call or reply when promised. They did however give my a full refund upon request."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ms Alefounder",
          "Nb_Reviews": 1,
          "Date": "2020-12-08T13:28:08.000Z",
          "Titre": "Concern, but refund given!",
          "Contenu": "I brought using PayPal, when you ring enquiring about delivery they pretend the line is faulty and the line goes quiet, I’ve rung loads of times -the same thing happens and other people have tried on my behalf with the same outcome.Update, a very polite man contacted me, quite quickly after this review was put on TrustPilot and gave me a full refund. He told me there was a fault on the line??? (a fault on the line as soon as I mentioned the word delivery)!!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "robert woods",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T09:08:11.000Z",
          "Titre": "I have emails saying my order is…",
          "Contenu": "I have emails saying my order is complete but have absolutely no idea when I will receive the item which I've paid for. Whether/when it is coming is a mystery.  Basic common sense - manage customer expectations by explaining when the goods will arrive?"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Gabriele",
          "Nb_Reviews": 2,
          "Date": "2021-11-06T08:23:21.000Z",
          "Titre": "I had to send the computer back as it's…",
          "Contenu": "I had to send the computer back as it's a was not what I was expecting .I am still waiting for my refund, which should be sorted by now .Expecting this to get sorted asap.Kind regards Gabriele Tottenham"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mark Batters",
          "Nb_Reviews": 10,
          "Date": "2017-02-26T21:00:20.000Z",
          "Titre": "Led me down the Garden path",
          "Contenu": "Sorry to say that i was sold an item that they claimed to be future proof but when it came to an upgrade of the operating system. they claimed was compatible, i found that the machine was not able to accommodate. very, very dissapointing"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "paul",
          "Nb_Reviews": 29,
          "Date": "2017-02-21T18:00:23.000Z",
          "Titre": "Apple Mac",
          "Contenu": "Purchased computer from this company. Very poor quality and condition It no longer works. People have told me this is ridiculous macs just work forever. Not if they have been refurbed by this company they dont. Buyer beware they come up with the most incredible reasons for selling you poor quality goods. In the middle of hnc course and difficult without a mac its what the college uses. Most of my work has to be done at home on windows 10. Then I have to export to disc and spend time trying to upload it to college mac. Some files work others dont. And will probably loose marks and fail this higher national certificate. Woul struggle to recomend them. Again beware"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Si Owen",
          "Nb_Reviews": 25,
          "Date": "2018-05-11T12:45:46.000Z",
          "Titre": "An expensive mistake.",
          "Contenu": "I purchased the following from this company and after just 6 months the hard drive died. After contacting Maximum Computers i was told as it was over six months old, the warranty had expired. I had a new hard drive fitted by a local company @ £200 including retrieving data. Now after 16 months of light use, the screen is pixelating and my local specialist said it's not worth repairing!They mentioned that a lot of these Apple products on Ebay have had a hard life and don't last long.So i spent a total of £565.00 and now need to throw it away. Wouldn't buy from this company again.APPLE IMAC  4.0GHZ 1TB 4GB CORE 2 DUO 20\" MAC OS X EL CAPITAN DVDRW"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Keith Norman",
          "Nb_Reviews": 7,
          "Date": "2021-05-20T22:46:53.000Z",
          "Titre": "The ordering process is so far a rather…",
          "Contenu": "The ordering process is so far a rather pleasant experience and gives the feeling of confidence. The delivery, setting up and ultimate use will be subject to more pertinent reviews"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mrs Alana Readman",
          "Nb_Reviews": 4,
          "Date": "2021-02-03T08:39:25.000Z",
          "Titre": "It arrived 3 days late",
          "Contenu": "I ordered the laptop which said delivery would be on 29 January, in time for my son's birthday on the 31st. I even said in the address confirmation email that it was a gift and hoped it would arrive in time. The reply was \"it's the least we can do\". I waited all day on Friday the 29th. No computer. I emailed to ask if it was still due to arrive that day. I was given some explanation about packing/delivery times etc. I told them it was stated on their site delivery for 29 January, which was why I ordered from them. The reply was due to circumstances they missed it by a day and we hope you can forgive us but good news it should be with you on Monday. Late. This ruined the day because the computer was his only gift. We were not impressed by the \"oops, my bad\" attitude."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr  J Harrs",
          "Nb_Reviews": 16,
          "Date": "2016-03-25T15:18:34.000Z",
          "Titre": "Old machines and Poor after sales support",
          "Contenu": "Recently I bought a refurb SFF Dell 780 as a Gamer. The 16Gb RAM was OK but the cheap, entry level HD5450 Card was not. The OS, Win 10 did not function correctly, the system drivers were well out of date and the graphics were terrible. I reported this but was told it is a 'software problem' and not covered by the warranty. So I had to research and try to repair it all for myself. I have since learned that the Core 2 CPU is old hat these days and the SFF itself has limited upgrade potential, unless I buy Dell products. The company ignored my requests for advice in upgrading and refused to swap the unit for a similarly cost, better performance model. I shall not be using this company again. Too iffy by far."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Nick Smith",
          "Nb_Reviews": 7,
          "Date": "2020-12-03T12:20:18.000Z",
          "Titre": "Had issues but was given refund",
          "Contenu": "I bought a refurbished computer but it had several issues and wouldn't work. I contacted the company by e-mail and they responded quickly with advice and fixes I could try. In the end I decided that I wanted a refund as there were several issues that I'd have to keep trying fixes for. Obtaining the refund was simple and easy.So, it was a shame that the computer didn't work but the company provided good customer service to resolve this quickly.Edit: after leaving my intial 3 star review (see comments above), I was contacted by Computer Discounts on several occaisons asking that I change my review to 4 or 5 stars. I explained that I didn't feel that I could honestly do that and that I felt 3 stars was fair. However, they continued to request this - for this reason I feel I have to alter the review to 2 stars."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Paul Owens",
          "Nb_Reviews": 1,
          "Date": "2021-01-23T11:00:04.000Z",
          "Titre": "Do you research to discover the standard of there current stock. The varied reviews suggest they get bad batches.",
          "Contenu": "Bought a laptop from this company and within a few weeks it was not working at all. I returned at my own cost to have to fixed. I was told they would replace the machine. The exact same machine came back and didn't work. I was working overseas at this point and I had my family send it out to me. Naively I didn't ask them to check it was working. When I discovered it was the same machine I panicked. I question if they even looked at it. I contacted them and they apologised for the mistake. I was asked again to send back but at considerable cost which they wouldn't pay for even though this was an error on their part. When I returned to the UK I was promised I would have a refund if I sent the machine back to them which I did. I have no just received my refund which I am grateful for. They do seem to want to please the customer and on this instance I did receive my money back. Nether the less it took in excess of 50 emails and a lot of frustration to end the saga. Approach with caution although reviews would suggest they are improving. Maybe I bought from a bad batch of machine."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Miss S",
          "Nb_Reviews": 2,
          "Date": "2020-11-09T08:36:39.000Z",
          "Titre": "Doesn't function as new",
          "Contenu": "I bought a MacBook Pro 2015 from these guys and I'm not impressed. When I was debating buying the item, I spoke to quite a few customer service members who assured me that the machine would function as if it was brand new. I was also asked to pay £15 delivery and given a two day delivery date... Firstly, my MacBook didn't arrive on time because none of their machines in the UK were at selling quality, so they had it delivered to me straight from their warehouse IN DUBAI, which would have been okay except for the fact that no one told me.When the machine arrived it seemed okay (apart from being a little dirty and banged up) but upon usage I discovered three faults:1, a patch of dead pixels in the middle of the screen2, the SD card port doesn't work3, the battery life only lasts about 45 minutes (and that's using very basic programs like Word!) When I contacted their customer services to complain of these issues, I was told that all of these faults are \"standard for refurbished machines\"! Quite a turn around from \"it will function as brand new! Save yourself the time and just get a brand new one."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Amy Allen",
          "Nb_Reviews": 1,
          "Date": "2021-08-19T16:49:41.000Z",
          "Titre": "Good communication",
          "Contenu": "Good communication delayed shipment but understandable in current situation"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Marlene Hepper",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T11:22:27.000Z",
          "Titre": "Not very happy",
          "Contenu": "I am not very happy with the after service after buying a laptop"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ajay Khajuria",
          "Nb_Reviews": 4,
          "Date": "2017-02-21T15:31:35.000Z",
          "Titre": "I can't recommend this company",
          "Contenu": "Defective Product and had to pay for the postage, to return."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mohammad Sabir",
          "Nb_Reviews": 3,
          "Date": "2022-03-19T22:54:55.000Z",
          "Titre": "I am not happy",
          "Contenu": "It is not ok.........????????"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Peter Grist",
          "Nb_Reviews": 3,
          "Date": "2021-01-05T10:27:22.000Z",
          "Titre": "Mac Book Air wasn't as spec'd on Website",
          "Contenu": "I do believe that this company is an honest seller. However there were a number of issues with my purchase. I purchased a refurbished Mac Book Air online on 14th December. When checking out the website advised that I would receive my order on 17th December. It was a Christmas present so this was fine. As I hadn't heard from them by the 17th I emailed customer service to be advised that it would be dispatched on the 18th December for delivery on 21st December. Again I heard nothing from them so emailed (There is no customer service telephone number so all communication is done by email) them on the 21st to be advised 'Good news, your order will be dispatched on 26th December for delivery on 29th December'. Obviously this would have been a disaster so some heated emailing then took place. Eventually the order was actually delivered on 23rd December so disaster averted! On delivery I opened the parcel to find a Mac Book Air in great condition. I did not start it up. So on Christmas day when the gift was opened it quickly became apparent that the advertised operating system had not been installed and instead an ancient OS was on there that would not load or run many apps or streaming services. It was also impossible to upgrade to a more up to date OS. After a few more email exchanges (response rates always very quick) they agreed to give me a refund. This came through today. This was my first (and probably last) foray into refurbed IT purchases and really wasn't great. The upshot was a lot of stress pre delivery and a disappointed child on Christmas day. They will not speak to you after you have placed your order but are always quick to respond to email enquiries. As stated I do believe they are a genuine seller and the customer service was good. However my overall experience has been poor as the product advertised was not what I received."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Eileen Smyth",
          "Nb_Reviews": 9,
          "Date": "2017-02-21T20:35:41.000Z",
          "Titre": "Lasted just over 3 months",
          "Contenu": "I would not recommend"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr John Whitlock",
          "Nb_Reviews": 3,
          "Date": "2022-03-30T07:56:59.000Z",
          "Titre": "there was a difficulty in delivery from…",
          "Contenu": "there was a difficulty in delivery from DHL the first time they tried to deliver they said there was no one at home to receive the package and there was my door bell is working and no one came I had to phone DHL got a new date and this time it was delivered"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2022-02-19T14:41:36.000Z",
          "Titre": "Costly mistake on my part",
          "Contenu": "Very friendly customer service advisers. Quick replies and very polite. My problem was I chose to buy from this firm because they were nearby if I had any problems. The item wasn’t suitable for my purposes when it arrived so I wanted to return it. Unfortunately they wouldn’t accept returns in person so I had to pay £30 tracked postage which has put me off buying anything in future."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Trevor Wilson",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T12:37:45.000Z",
          "Titre": "Expensive mistake",
          "Contenu": "Excellent customer service operatives, very quick responses and friendly. An hour after setting up the MacBook Pro for my blind friend I quickly realised it was not going to be suitable for his purposes. I then had to pay £30 to return it by post because the company wouldn’t let me deliver it by hand even though I was in the neighbourhood."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andrew Tennant",
          "Nb_Reviews": 16,
          "Date": "2022-04-06T13:59:57.000Z",
          "Titre": "Marked screen and system slow…not great"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2022-01-06T19:10:24.000Z",
          "Titre": "Advertised delivery for Christmas which…",
          "Contenu": "Advertised delivery for Christmas which was untrue. Came a few dats after Christmas. Arrived just in it’s box no other packaging. Laptop was in good order accept @ key and “ key was the wrong way round and fingerprint scanner didn’t work. Very swift reply initially but when their suggestions failed they never got back to me. No instructions included with computer. All in all not a bad purchase. Just frustrated they can’t fix my key issue. Would buy from them again"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2021-10-04T19:29:45.000Z",
          "Titre": "Don’t make any assumptions!",
          "Contenu": "Very good service and price. The laptop matched the advertised specification BUT it didn’t occur to me to contact them to ask what keyboard layout it would have. As a result I received a laptop with a US keyboard - I’m in the UK. I have learned to live with @ and # being in the wrong place but there is no £ sign!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2021-10-24T22:51:38.000Z",
          "Titre": "Not quite as expected",
          "Contenu": "The lap top is quite chunky and heavy; the advert does not show white keyboard with pink not purple keys. It does not look as good as the picture on the advertising. The case looks pink not purple.  Was going to send back but thought I would see how it functions."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Cezary",
          "Nb_Reviews": 2,
          "Date": "2021-03-11T21:55:15.000Z",
          "Titre": "Disappointed with the product but happy with customer service.",
          "Contenu": "The refurbished Macbook kept crashing and restarting, so we decided to return it and ask for a full refund. Can't fault the customer service though. It was easy to contact the company and to return the item (the company arranged for the return). We received a full refund in the set amount of time. The problem might have been just with my item, but it's a shame."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David Pook",
          "Nb_Reviews": 7,
          "Date": "2021-01-08T18:15:19.000Z",
          "Titre": "When I buy a computer from a site that…",
          "Contenu": "When I buy a computer from a site that pretends it's a UK company and I get a laptop with a US keyboard layout that has not been specifically mentioned, I am not going to be happy. I am not happy.Edit: When contacting the company they told me I had a trivial issue and should not be complaining because of their profit margins and were more concerned with me removing this review. That is terrible customer service!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Martin Hanna",
          "Nb_Reviews": 1,
          "Date": "2021-09-29T16:39:53.000Z",
          "Titre": "Had looked around a while",
          "Contenu": "Had looked around a while, comparing different PCsfor what projects i do,and after 2 days, on UTUBE,it came about, ichecked it,and it is what i neededand great vaule,so i could not resist, this offer."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "John Twigge",
          "Nb_Reviews": 6,
          "Date": "2021-03-23T10:48:36.000Z",
          "Titre": "Good service but an old MacBook.",
          "Contenu": "Service and supply was first class. Macbook OK apart from some scratches and sharp edge on colour shell.However did not expect unit to be so old.Keeps asking us to update OS but too old to allow us to do so. Shows a date of late 2009, 11years old ! Expected new{-ish} refurb."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "shay",
          "Nb_Reviews": 2,
          "Date": "2020-11-29T10:42:22.000Z",
          "Titre": "I spoke to a guy on the online chat…",
          "Contenu": "I spoke to a guy on the online chat asked him for advice, I needed a laptop with a cam, he recommended a laptop to me, when the laptop arrived it had no cam. so I had to return it, other than wasting my time the transaction and getting my refund was quick, I would purchase again but next time take my own advice."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Picalo",
          "Nb_Reviews": 1,
          "Date": "2020-10-01T11:59:30.000Z",
          "Titre": "Good products, but website could be better designed",
          "Contenu": "The website could be better designed - why is the only filtering criterion colour? I want to select by brand, RAM... Why isn't address auto-filled from postcode? All of this adds friction, which makes using the website a much less smooth, pleasant experience.However, the products look good, and are competitively priced."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr Nicholas Crossley",
          "Nb_Reviews": 3,
          "Date": "2021-02-07T15:57:05.000Z",
          "Titre": "Unfortunately I had to return the goods…",
          "Contenu": "Unfortunately I had to return the goods as they weren't up to scratch, however I can't fault the customer service, they were great. Response to emails etc.. was spot on and they processed my refund straight away. Very helpful and polite which goes a long way in my book!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "The Truth",
          "Nb_Reviews": 22,
          "Date": "2020-04-21T08:51:51.000Z",
          "Titre": "I had some very important inquiries…",
          "Contenu": "I had some very important inquiries about a prospective purchase. No one could answer the phone. As maybe busy in warehouse. Made me question credibility of company. As they are from the web and I’d never heard of them. So questioned they could be a scam. I purchased muse to seeing good reviews. But shan’t relax now til it comes. I wanted to add on Logic Pro plus."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Realtalk",
          "Nb_Reviews": 13,
          "Date": "2022-02-17T14:33:09.000Z",
          "Titre": "MacBook came today!!!",
          "Contenu": "I Received my MacBook today by DHL two days earlier than expected! it is a 7-year-old model released in 2012/13 but it's in excellent condition! It literally looks brand new! I expected even a little wear and tear considering the age but nope not even a scratch! I am so impressed. FANTASTIC!Thank you computerdiscounts.co.uk."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Susan",
          "Nb_Reviews": 16,
          "Date": "2021-10-16T19:20:58.000Z",
          "Titre": "Not as satisfied as I thought I was!",
          "Contenu": "After quite a long time looking for a \"new\" computer I decided on a refurbished HP from Computer discounts . It was not the cheapest but seemed the best buy.delivery was quick and the computer well packaged. As described the computer was in top condition. It works well and is easy to use. However, there are several points which stop me from giving Computer discounts 5*. The first is the key board. It has obviously been replaced and has the entire work top - this is not mentioned. The new key board has characters in the wrong place e.g the@is accessed by the \" key and vice versa. The £ on shift 3  and I have just realized there is no \"hash\" key.On the plus side there is a DVD player which I wasn't expecting. I can cope with the changes in keys but will have to contact Computer Discount about the missing key.Not as satisfied as I thought I was!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Asg",
          "Nb_Reviews": 4,
          "Date": "2017-02-21T15:45:55.000Z",
          "Titre": "Hugely disappointed with product but very good customer service.",
          "Contenu": "I ordered a refurbished laptop. Based on the specifications provided, it should have been a decent one for daily use. However upon arrival, it was amazingly slow which means normal browsing such as facebook and playing games on facebook would take ages. However I should mention that communication was exceptional regarding delivery and then refund. No problem at all with the refund. Overall disappointed with the experience as I bought the laptop to take home (abroad) but I had to bring it back for a refund."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Patrick Doolan",
          "Nb_Reviews": 9,
          "Date": "2020-11-27T14:36:58.000Z",
          "Titre": "Communication from company is not good",
          "Contenu": "Communication from company is not very good no confirmation of purchase or delivery date online registration to track track purchase also flawed. Price and over all delivery reasonable"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-03-05T18:15:33.000Z",
          "Titre": "Got the wrong item sent item to me and…",
          "Contenu": "Got the wrong item sent item to me and it was a bit of a pain to get item collected and refunded. Shame because I thought their website was ok."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Marc",
          "Nb_Reviews": 4,
          "Date": "2020-09-24T10:17:05.000Z",
          "Titre": "A bit early to be asked for a review…",
          "Contenu": "A bit early for Trustpilot to be asking for a review when all I have done is paid for something that is yet to be delivered. But so far so good."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 3,
          "Date": "2017-05-08T23:28:26.000Z",
          "Titre": "Computer was faulty",
          "Contenu": "Computer was faulty, (very disappointing) customer service good. Keep getting emails now though seeking reviews for having a computer from them."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "ROY WHITE",
          "Nb_Reviews": 4,
          "Date": "2017-09-21T17:56:09.000Z",
          "Titre": "Nothing wrong with the item I bought",
          "Contenu": "Nothing wrong with the item I boughtBut I did ask a couple of questions after I had received the product and was completely ignored"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "paul cooke",
          "Nb_Reviews": 20,
          "Date": "2021-04-09T18:15:32.000Z",
          "Titre": "it works ok - to a point",
          "Contenu": "it works ok, but smelt heavily of organic cleaners, and the m on the keyboard keeps jumping out"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Julia",
          "Nb_Reviews": 7,
          "Date": "2020-11-23T08:42:25.000Z",
          "Titre": "The product was fine but the delivery…",
          "Contenu": "The product was fine but the delivery service hopeless and took over a week to arrive went missing?"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Junior",
          "Nb_Reviews": 2,
          "Date": "2020-11-15T10:53:37.000Z",
          "Titre": "Quality customer service",
          "Contenu": "The computer I ordered wasn’t what I wanted however your customer service was top notch."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Kelly Blunden",
          "Nb_Reviews": 9,
          "Date": "2020-09-30T16:11:13.000Z",
          "Titre": "Customer service was good",
          "Contenu": "Customer service was good, product is good enough for the intended purpose"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Yoooooo",
          "Nb_Reviews": 2,
          "Date": "2020-05-05T23:31:04.000Z",
          "Titre": "Clearer layout",
          "Contenu": "Clearer layout, more depth need for specs for those not as clued up"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mick",
          "Nb_Reviews": 4,
          "Date": "2020-04-16T14:52:56.000Z",
          "Titre": "Easy to order",
          "Contenu": "Easy to order, good communication just waiting for delivery"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Samuel James Beckingham",
          "Nb_Reviews": 4,
          "Date": "2022-12-05T20:52:17.000Z",
          "Titre": "Eventually got there",
          "Contenu": "The customer service doesn’t give up. After initially sending my the wrong charger with my purchase, they sent an identical replacement. After a week of the MacBook sitting there not being able to be used, I ordered the one I needed from Amazon. When customer service got in touch, they refunded my the cost of the charger. If you have a bad experience, a lot of patience will help. Customer experience will eventually get it right for you if they haven’t done so initially."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Stephen Kennard",
          "Nb_Reviews": 2,
          "Date": "2022-02-26T15:19:03.000Z",
          "Titre": "Only been a couple of weeks but thus…",
          "Contenu": "Only been a couple of weeks but thus far very good. Contacted them about when I should expect delivery and the answer was prompt, attentive & courteous. Actually delivered 2 days before the expected date. Keep up the good work!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James Mclay",
          "Nb_Reviews": 3,
          "Date": "2022-05-20T09:38:07.000Z",
          "Titre": "Only one star off for ibook…",
          "Contenu": "Only one star off for ibook installation opening up in German. /but this aside fairly swift  delivery and product work as described."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ty",
          "Nb_Reviews": 11,
          "Date": "2022-03-26T11:01:21.000Z",
          "Titre": "Quick and reliable service",
          "Contenu": "I decided to return the laptop as it was older model than I expected. The return process was quick eventually but there could have been more information from the beginning. Otherwise a good & reliable service if you are looking to buy a refurbished laptop."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Yeyeoge Tola",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T16:28:23.000Z",
          "Titre": "This is gregreatat product",
          "Contenu": "This is great product"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Eunice Reyburn",
          "Nb_Reviews": 7,
          "Date": "2022-02-26T11:21:31.000Z",
          "Titre": "Full refund given",
          "Contenu": "The device was faulty. Following several emails back and forth in an attempt to rectify the issue, it had to be returned. In fairness, a full refund was issued."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Robert Brown",
          "Nb_Reviews": 9,
          "Date": "2022-05-23T09:45:44.000Z",
          "Titre": "A bit heavier than expected.",
          "Contenu": "A bit heavier than expected. The fact that this was a 2012 machine wasn't mentioned in the advertisement. Price was ok though."
        },
        {
          "Note": 4,
          "Lieu": "CY",
          "Pseudo": "Demos Demosthenous",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T07:49:19.000Z",
          "Titre": "Condition of Mac was as described",
          "Contenu": "Condition of Mac was as described Working and looking greatLittle bit late of delivery!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Christine Macaulay",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T08:43:05.000Z",
          "Titre": "Good service",
          "Contenu": "I was struggling to set up this computer, they were very understanding"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Michael Robinson",
          "Nb_Reviews": 4,
          "Date": "2022-02-01T15:25:46.000Z",
          "Titre": "Good service",
          "Contenu": "The service was good and delivery was excellent, it was a shame I could not get into the system , but overall very good ..."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ems Allsop",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T15:49:35.000Z",
          "Titre": "good company",
          "Contenu": "The Company was really good with communication and was helpful with any questions asked, very quick and easy to understand replies, and I also like the fact you don't get redirected to a robot or other web pages! even though my purchase was later then it said on the website because it had to come from another warehouse out side of the uk, I would still recommend  these guys, specially if your a first time user of apple, or any other laptop, simply because they are friendly, and you don't get redirected to robots or other silly website."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Christopher Marren",
          "Nb_Reviews": 1,
          "Date": "2022-02-13T19:24:39.000Z",
          "Titre": "Great response and advice",
          "Contenu": "Delivery second day.Great response and advice"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Hennings",
          "Nb_Reviews": 1,
          "Date": "2022-01-02T17:07:49.000Z",
          "Titre": "So far, so good!",
          "Contenu": "i bought this laptop based on price and features and it seems good value. That said, the pre-refurbished price of £1200 seems exorbitant! I had a couple of very minor glitches when the machine was setting up, but an automatic download of Windows updates fixed it. The only outstanding problem is creating a recovery USB stick which I’m sure I’ll get round to looking at sometime. Not now... it’s Christmas!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "C Yates",
          "Nb_Reviews": 3,
          "Date": "2021-10-29T14:29:45.000Z",
          "Titre": "Had some issues with the first computer…",
          "Contenu": "Had some issues with the first computer that had to be returned unfortunately so hence why not 5*. The replacement has arrived and thankfully it worked perfectly out of the box none of the original issues. Overall happy with the purchase. Was a little surprised to see the computer was flown in from Sharjah, I’d assumed it was a UK based operation. Customer service was very good"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steve Hardy",
          "Nb_Reviews": 3,
          "Date": "2021-03-29T16:25:49.000Z",
          "Titre": "Delivery on a Saturday not next working…",
          "Contenu": "Delivery on a Saturday not next working day which could have been a problem. Not informed until close to delivery having been previously informed it would be Monday.Ubuntu install wasn't the latest stable version. Not a problem as I reinstalled from scratch a different distro as always intended to but seems a bit lazy.Laptop was however a very good price and is working just fine."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "DC",
          "Nb_Reviews": 1,
          "Date": "2021-03-30T07:13:48.000Z",
          "Titre": "Very competitively priced IT hardware",
          "Contenu": "Very competitively priced IT hardware. Rapid and quick response to orders and delivery arrived as stated within two working days.Monitor stand very odd looking but works well. Only critism I would have is to the quality of the keyboard and mouse supplied with the package as the are very basic and lightweight.That said very good value for money overall and would recommend the site, theirs service and products."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Malone",
          "Nb_Reviews": 4,
          "Date": "2021-03-21T15:20:14.000Z",
          "Titre": "My recent purchase of a Lenovo laptop…",
          "Contenu": "My recent purchase of a Lenovo laptop arrived within a couple of days.Sooner than expected.  Laptop looked like it was brand new. I would have given five stars but the charger included was faulty. The people at computer discount resolved the problem within a couple of days and a replacement charger was dispatched and all has been good since. I would happily recommend these guys and will purchase from them again if the need arises."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Les",
          "Nb_Reviews": 11,
          "Date": "2021-02-18T08:56:00.000Z",
          "Titre": "Delivery of the items I ordered was…",
          "Contenu": "Delivery of the items I ordered was carried out promptly and efficiently.Unfortunately, I was not happy with the condition of one of the Chromebooks I ordered, but staff at Computer Discounts handled the return and refund of the item professionally and courteously, providing me with regular email updates at every possible opportunity.  I would use them again because of their caring attitude and did not quibble about providing a refund for the item."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rita Barker",
          "Nb_Reviews": 2,
          "Date": "2021-02-11T17:24:32.000Z",
          "Titre": "I'm a bit disappointed with the Mac I bought last year",
          "Contenu": "I'm a bit disappointed with the Mac I bought last year. It seems very slow to start and the mouse is very slow to respond sometimes - not always- but enough to frustrate me. Every time I restart it, it comes up with a message to say that it was restarted because of an error.  It's a shame because other than that it's a nice laptop."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gus",
          "Nb_Reviews": 9,
          "Date": "2020-11-25T09:20:03.000Z",
          "Titre": "Arrived promptly and looked like new",
          "Contenu": "Arrived promptly and looked like new. Fun to watch its journey from the Middle East to Scotland on the tracking app. Generally, very happy with it.  The battery life, however, is poor and the connection from the USB ports is unstable.  But it is, after all, not a new computer and, for the price, I am happy with the purchase.  I would recommend and buy from Computer Discounts again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Daly",
          "Nb_Reviews": 4,
          "Date": "2021-11-16T19:52:07.000Z",
          "Titre": "Delivered on time",
          "Contenu": "Delivered on time , I had to contact them to get exact info re model number to source manual , very helpful response . All working fine with windows 10 new to me but no problems. Only down side was no power cable provided which seemed a bit of a miss. JD"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sarah Westbrooke",
          "Nb_Reviews": 18,
          "Date": "2021-01-21T08:11:32.000Z",
          "Titre": "Received a refurbished Apple Mac as…",
          "Contenu": "Received a refurbished Apple Mac as described. I was a little surprised that it took quite a while from order to delivery. This was because it was imported from UAE . There is no mention of origin on your site. However I am pleased so far with an immaculate computer . I also received good advice when needed using your phone lines."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr WARE",
          "Nb_Reviews": 10,
          "Date": "2020-10-06T20:35:18.000Z",
          "Titre": "The initial service was good but failed…",
          "Contenu": "The initial service was good but failed to inform that it would an American model. Working with keep getting messages saying chrome OS cant open this page and to get downloads is almost impossible I am a little disappointed If there is any way you can help me I would be gratefulThis is the first time I have been  to get you on lineKind Regards Gordon."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tessa",
          "Nb_Reviews": 21,
          "Date": "2021-04-02T14:54:19.000Z",
          "Titre": "We needed this computer on the day…",
          "Contenu": "We needed this computer on the day before it arrived. We bought it especially because it promised the quick delievery we needed. I was unable to use it for what we urgently needed it. The computer itself is good and I have no complaints about it. BUT IF YOU PROMISE TO DELIVER BY A CERTAIN DAY  -  DO IT!!!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rasheeda Hussain",
          "Nb_Reviews": 2,
          "Date": "2020-11-28T14:57:05.000Z",
          "Titre": "I am really satisfied with your…",
          "Contenu": "I am really satisfied with your customer service because I always found it positive and fast.Although the product I got from the company was a bit faulty but when I contacted back to them, response was quick. And they managed to take it back for exchange/refund according to  my convenience.That's why, I am 100% satisfied !"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Appleton",
          "Nb_Reviews": 13,
          "Date": "2020-10-22T17:50:31.000Z",
          "Titre": "Smooth transaction and quick delivery",
          "Contenu": "Smooth transaction and quick delivery, items as described and very happy - all seem to be working very well and easy to set up. Just had a problem with the lead from hard drive to monitor not being compatible but had spare so easy to rectify and no need to make an issue about. Overall think good value and very happy with items purchased"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Laurence Staff",
          "Nb_Reviews": 5,
          "Date": "2021-01-12T15:09:48.000Z",
          "Titre": "Excellent Service",
          "Contenu": "I ordered a chrome book after reading reviews etc and the purchase went smoothly and first class service.  I would have given 5 stars but unfortunately i had to return the product but that was no problem.  The company were helpful and quick with their response and the refund. 5 stsr cudtomer service."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jamie",
          "Nb_Reviews": 2,
          "Date": "2021-01-22T14:39:57.000Z",
          "Titre": "happy but delivery was a bit longer that expected",
          "Contenu": "Been using my laptop for just over a week, and i have to say i am very happy with my purchase. A few scratches on the base, but that i expected for a refurbished laptop. The only reason i gave 4 stars and not 5 is because the delivery was a week later than expected, apart from that very happy"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Deborah",
          "Nb_Reviews": 7,
          "Date": "2021-08-14T14:37:18.000Z",
          "Titre": "Unfortunately we had to send the I pad…",
          "Contenu": "Unfortunately we had to send the I pad back as it was an old version it did not support any apps or games which we wanted it for. I think this should be explained in detail in the description.However, it was easy to return and the staff were very pleasant."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Peter Knight",
          "Nb_Reviews": 2,
          "Date": "2020-11-05T18:35:21.000Z",
          "Titre": "The computer we received is amazing",
          "Contenu": "The computer we received is amazing. The only thing that we would have liked would have been an instruction leaflet indicating the parts that can be used to carry out the items for information.ie. Adding an email, to be used, direct access to the internet. How long it takes to charge, etc."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Stuart Winterbottom",
          "Nb_Reviews": 2,
          "Date": "2020-05-31T14:46:50.000Z",
          "Titre": "IPad Mini",
          "Contenu": "IPad MiniHappy with the quality condition of the Ipad Mini and generally just what I wanted as a backup device for some basisc apps.  What would have been useful is an information sheet as to how to get earlier versions of apps that the device is too olf for and so no longer available in the App store."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tom McCurley",
          "Nb_Reviews": 7,
          "Date": "2020-10-06T12:50:32.000Z",
          "Titre": "All good until the end",
          "Contenu": "Service was good, delivery efficient everything was as said in the tin except with my IMac rather than a \"proper\" keyboard i got a flimsy Chinese substitute which really was not up to the mark.So Five stars all the way round until the final disappointment thus the four stars."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "anthony bird",
          "Nb_Reviews": 7,
          "Date": "2021-04-29T01:23:36.000Z",
          "Titre": "Laptop is immaculate and cannot fault…",
          "Contenu": "Laptop is immaculate and cannot fault it for price. However if I had known the company was dubai based and this is where the laptop was going to come from, for a number of reasons I probably would have purchased elsewhere. But as I say cannot fault the macbook"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sarah Quraishi",
          "Nb_Reviews": 2,
          "Date": "2020-04-24T12:46:13.000Z",
          "Titre": "Unbeatable prices for high quality products!",
          "Contenu": "I checked several websites selling refurbished Apple laptops - including Amazon, and computer discounts provides by far the best prices online. My MacBook Air arrived today and was very easy to set up and is running the latest Apple software (Mojave), I only intend to use it for surfing the web and streaming however I downloaded Lightroom which was very fast. The customer service as well was very helpful throughout and kept in touch regarding delivery. Would recommend if you’re looking for an Apple laptop at a lower price."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sam Skelly",
          "Nb_Reviews": 18,
          "Date": "2017-02-21T19:34:09.000Z",
          "Titre": "Value For Money Purchase",
          "Contenu": "Good contact with the company.The computer was exactly as described and posting was prompt.One problem arose when the 'free' keyboard was badly packed under the computer, bending it in transit.The company was very quick to accept responsibility and replaced the keyboard without hassle and free of charge.I would have confidence in buying from this company again!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Julie Mills",
          "Nb_Reviews": 1,
          "Date": "2019-01-29T10:38:02.000Z",
          "Titre": "Overall happy but",
          "Contenu": "Overall happy with my purchase of Macbook but I do feel the fact that the expected battery life is only 45 minutes to 1 hour should be explained in the description.  Mine actually lasts 1hr 45 whilst streaming, which is better than expected.  Customer services did come back quickly and answer my questions however."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Pamela  Kellett",
          "Nb_Reviews": 2,
          "Date": "2018-02-05T13:30:17.000Z",
          "Titre": "The service was excellent",
          "Contenu": "The service was excellent.  Delivered on time!The desk top was immaculate not a single blemish on it.The accompanying keyboard was very cheap and basic hence the 4* instead of 5*.  Not easy to use as the buttons were stiff to press. Now bought a replacement which is much better!Overall a good buy and to be recommended."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Keith Cheetham",
          "Nb_Reviews": 4,
          "Date": "2021-01-03T15:03:58.000Z",
          "Titre": "It would have been 5star",
          "Contenu": "It would have been 5star. I had a problem connecting to the internet with the MacBook of which after numerous e-mails although promptly answered, could not solve the problem. On the plus side the problem is know rectified and everything is running sweet."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jennifer McKenzie",
          "Nb_Reviews": 43,
          "Date": "2021-03-16T14:46:09.000Z",
          "Titre": "There is no doubt I am happy with my…",
          "Contenu": "There is no doubt I am happy with my purchase. However, the parcel was sent to a wrong address (not even on my road).  It's just very fortunate the person who my item was delivered to had the decency to take time out and deliver it to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Graeme Kennedy",
          "Nb_Reviews": 2,
          "Date": "2017-05-09T11:29:43.000Z",
          "Titre": "Good quality Applemac laptop",
          "Contenu": "Good quality Applemac laptop; perfect working order and very good physical/visual condition. Arrived reasonably speedily and packaged well. I don't recall any clear contact details, i.e. phone number for if their was a problem, and their could have been a bit more clear instruction to get started. Having said that, I figured it out fairly quickly, and overall I am, up to this point, very happy with what I have bought. The battery could ideally last longer than 2 to 3 hours, but overall an excellent product."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Paul Jennings",
          "Nb_Reviews": 8,
          "Date": "2020-12-12T09:48:29.000Z",
          "Titre": "I would have given 5 but there was some…",
          "Contenu": "I would have given 5 but there was some confusion about delivery dates right from the outset.Having said that I ordered on a Friday and it was delivered on the following Friday.The customer service is great, could not have asked for better."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Richard Davies",
          "Nb_Reviews": 3,
          "Date": "2020-11-02T18:28:47.000Z",
          "Titre": "Quick service and delivery",
          "Contenu": "Quick service and delivery, good price for spec. Could offer a battery upgrade deal as they don't expect much battery life from a refurbished machine - answer queries and questions quickly and politely. Would deal with this company again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Andrew Baker",
          "Nb_Reviews": 11,
          "Date": "2020-11-17T11:44:08.000Z",
          "Titre": "When i order the computer on the web…",
          "Contenu": "When i order the computer on the web site it said i was going to get the computer on a given day. I received it 2 days later. Apart from that the computer is excellent and in very good working order. Would use this company again"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "jazzjab",
          "Nb_Reviews": 8,
          "Date": "2020-01-31T19:36:34.000Z",
          "Titre": "I found this company very easy to deal with.",
          "Contenu": "I found this company very easy to deal with. When I finally decided not to go ahead with the purchase of a MacBook there was no problem with arranging a full refund. I can recommend this company for their customer communication."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Shae",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T14:33:07.000Z",
          "Titre": "Well tbh I was more dissatisfied with…",
          "Contenu": "Well tbh I was more dissatisfied with product being faulty. Other than that the customer service was very prompt and handled the situation in the right way.i received my full refund without any hiccups."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Marie Phillips",
          "Nb_Reviews": 3,
          "Date": "2020-11-02T16:40:18.000Z",
          "Titre": "Good product",
          "Contenu": "Good product, Although I wish the year of manufacture had been on the description, I might have tried to get a later model. But saying that the computer is up and running and my son is pleased with it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "steve riley",
          "Nb_Reviews": 2,
          "Date": "2021-08-21T20:13:59.000Z",
          "Titre": "Found website relatively easy to use",
          "Contenu": "Found website relatively easy to use, lots of info to guide me and competative prices, too early to rate products but found website easy to manage and everything I needed to know."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Howard",
          "Nb_Reviews": 33,
          "Date": "2017-05-11T08:12:46.000Z",
          "Titre": "Very Good Computer",
          "Contenu": "It was good to get a completely overhauled computer and have the company's info listed on the computer in the computer info section.The computer works well but a command prompt appears when restarting. This soon goes."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Michelle David",
          "Nb_Reviews": 10,
          "Date": "2020-05-13T13:01:27.000Z",
          "Titre": "good quality",
          "Contenu": "good quality.  Speedy delivery.  Unfortunately the little keyboard provided is slightly missing things.  e.g the @ symbol is not under the @ key.  Other than that.  Fantastic.  Thank you so much"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Marie Harland",
          "Nb_Reviews": 1,
          "Date": "2021-09-24T20:33:20.000Z",
          "Titre": "Good Customer Service",
          "Contenu": "Good clear easy to use website prices reasonable however description of goods lack important detail which became apparent upon delivery the laptop was in excellent condition and was set up for immediate use however upon first use it became apparent that this particular laptops’ keyboard was  US language standard and it was not possible to change this myself I contacted the company who were very attentive to the problem but alas then admitted that they had bought the machine as part of a a large order and they were unable to rectify the problem. A request was made to return the laptop in accordance within  the guarantee this was accepted and the laptop was carefully packed and returned by Royal Mail at a cost to myself of £26 pounds. The refund of only the cost of the laptop was made within days. I recommend this company with reservations as above."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr WARE",
          "Nb_Reviews": 10,
          "Date": "2020-11-10T16:25:30.000Z",
          "Titre": "It was easy and this being my second…",
          "Contenu": "It was easy and this being my second visit One fault today. I didn't get an answer to my questionOtherwise, I am pleased I hope I will have better luck than I did with Chromebook"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sunita sukul",
          "Nb_Reviews": 5,
          "Date": "2021-11-18T22:40:07.000Z",
          "Titre": "Item was ok but delivery was…",
          "Contenu": "Item was ok but delivery was unsatisfactory. Item was dumped outside my door without notifying me especially when it stated sign for. Luckily no one took it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Martin",
          "Nb_Reviews": 26,
          "Date": "2021-01-23T17:20:45.000Z",
          "Titre": "It's a nice piece HOWEVER!",
          "Contenu": "It's a nice piece HOWEVER!! I am disappointed that appears to have a US Keyboard!! It has the US $ sign but NOT A UK £ key. I don't know if it's convertible?"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Pattinson",
          "Nb_Reviews": 3,
          "Date": "2021-03-09T19:48:08.000Z",
          "Titre": "MacBook Pro 2015",
          "Contenu": "1. Ordering was super easy with a great range of items that I was looking at.2. On the website when I ordered (on a Tuesday) it stated item would be with me in 24 hours, when I queried it I was told it would be with me on the following Monday due to checks and quality assurance which was fine I understood that.3. Item arrived on the Friday so I didn’t have to wait as long as expected so that was awesome I was so pleased.Overall a great product and a quick service with clear communication when asked.The MacBook Pro was in good condition some scratches which is expected but that’s what covers are for.Maybe moving forward look at way to update the customer saying the item has been picked, checking, then in quality assurance.Customers like to know where there items are and at what stage so just a minor development point."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "jane parke",
          "Nb_Reviews": 10,
          "Date": "2021-02-10T13:08:13.000Z",
          "Titre": "laptops for home schooling",
          "Contenu": "very good discount prices- i had some issues trying to pay for my products but spoke to customer services (they answered really quickly) and order has now gone through."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "William Arthur Swannell",
          "Nb_Reviews": 5,
          "Date": "2021-04-06T20:12:57.000Z",
          "Titre": "Found that the product was received in…",
          "Contenu": "Found that the product was received in very good condition.The experience was better than expected.Many thanksW.A.SwannellRETIRED Projects DirectorCAIRO Egypt"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gert Rautenbach",
          "Nb_Reviews": 1,
          "Date": "2021-04-19T10:04:22.000Z",
          "Titre": "No answer on the telephone number",
          "Contenu": "No answer on the telephone number - chat support was available but he couldn`t give the answers I was looking for and I was referred back to the telephone number"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mike Dobbie",
          "Nb_Reviews": 3,
          "Date": "2020-05-23T22:05:29.000Z",
          "Titre": "The delivery was very fast and exactly…",
          "Contenu": "The delivery was very fast and exactly on time as per the delivery email.  My only reservation was the operating system.  I already own an iPad mini 3 purchased in 2014 that is up-to-date and runs on IOS 12.4.6.  However, the battery is beginning to have problems and the machine itself has to be reconnected to my broadband after any short interval of inactivity.  This new, refurbished iPad runs on IOS 9.3.5 and is obviously an earlier version of my 2014 machine.  This means that it is not compatible with iCloud which is not a problem for me but I wonder about its security.  I am happy with its speed and it has no problems with maintaining its broadband connection but I wonder if it will no longer have software updates and therefore become more susceptible to malware.  Your reassurance would be helpful.  Cheers.Mike Dobbie"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Balint Bodroghy",
          "Nb_Reviews": 12,
          "Date": "2021-02-13T15:32:16.000Z",
          "Titre": "I have only just placed this order",
          "Contenu": "I have only just placed this order - it is much too early to provide a review of my experience. Let's wait till the item arrivew and I have a chance to try it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2020-04-25T16:54:30.000Z",
          "Titre": "Excellent site",
          "Contenu": "Excellent site, easy to understand what you are buying. The Mac arrived quickly and it locked and loaded easily having been well set up. The value for money is exceptional."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Samuel",
          "Nb_Reviews": 3,
          "Date": "2021-01-26T17:52:28.000Z",
          "Titre": "Laptop was damaged in transit ( no…",
          "Contenu": "Laptop was damaged in transit ( no fault of the supplier) but got a replacement sorted quickly, good price and good customer service when we had a problem"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "MRS M",
          "Nb_Reviews": 3,
          "Date": "2020-10-07T05:20:18.000Z",
          "Titre": "Excellent value laptop and great…",
          "Contenu": "Excellent value laptop and great customer service response time.Ordering was easy and my laptop arrived quickly.My laptop is lovely and almost spotlessly clean.I had a couple of issues with the keyboard, but their response rate to queries was brilliant.  The company strives to ensure they have satisfied customers.You might want to check before buying if your laptop comes with a UK or US keyboard, otherwise you could end up with keys in different positions than you're used to.  I have a US keyboard, but the key function is UK.  That's okay for me, as I know where the functions are (you could also change the function to US if you need the function to do what's printed on the key).  However, I have to use an alternative keyboard for a backslash (which I currently don't have to use often).My laptop was excellent value for money and I'm very happy with it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2021-02-10T16:16:05.000Z",
          "Titre": "My refurbished laptop came before it…",
          "Contenu": "My refurbished laptop came before it was expected in very good condition. Overall I really can't complain about it.I would recommend this website."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Martin Wilkinson",
          "Nb_Reviews": 4,
          "Date": "2021-02-18T09:50:36.000Z",
          "Titre": "Although upset with first laptop…",
          "Contenu": "Although upset with first laptop supplyed a replacement was goodHelp from staff was very helpful and kindly handled very provesionaly would recommend."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "CAROLINE",
          "Nb_Reviews": 23,
          "Date": "2020-11-15T13:07:23.000Z",
          "Titre": "prompt refund thank you",
          "Contenu": "bought an Ipad - discovered was not sophisticated enough for my needsyou refunded my money without quibbling thank youI recommend this company"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "G H Jackson",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T13:22:55.000Z",
          "Titre": "Arrived on time and in good order",
          "Contenu": "Arrived on time and in good order. All that stops 5 stars is that I would have appreciated a simple manual to get me going!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "tony holt",
          "Nb_Reviews": 11,
          "Date": "2021-11-25T11:13:21.000Z",
          "Titre": "the computor ordered arrived when they…",
          "Contenu": "the computor ordered arrived when they said, and was in good order when opened . good service as it should be.hirepoint ltd"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gerald Richards",
          "Nb_Reviews": 1,
          "Date": "2020-05-05T09:47:52.000Z",
          "Titre": "computer is good value,but as for the…",
          "Contenu": "computer is good value,but as for the keypad was not good,probably better with apple product,could not pair with computer.kind regardsG Richards"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Alderton",
          "Nb_Reviews": 13,
          "Date": "2020-10-26T16:44:36.000Z",
          "Titre": "the only complaint i have",
          "Contenu": "the only complaint i have is that the key pad has no separate number pad so it is different to my old one and is taking some getting used to."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Pook",
          "Nb_Reviews": 7,
          "Date": "2020-05-31T10:42:50.000Z",
          "Titre": "No confirmation email and no delivery details on site",
          "Contenu": "Only really one issue the came from a combination of two things; everything else was great but that one issue was key.Once ordered all I had was an order number on screen, there was no confirmation email, no email to say the order was processed or when I was going to receive it.I am glad I was in when it arrived, which was very quick but unexpected as I couldn't find a clear indication of how long you take to deliver from receiving an order. I would have expected to find this on the order page (a tooltip next to delivery of the checkout page would have done); it wasn't in the FAQs either.So A) I didn't know for sure that the order has been received/dispatched and B) I had no idea how long it would be before it was likely to be delivered, that could have been 2 day, a week or even two weeks!I am an eCommerce consultant so might being slightly critical but these two things together did impact my experience of using the site."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Yvonne",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T16:35:16.000Z",
          "Titre": "I’d purchase from again",
          "Contenu": "Recently purchased a MacBook from Computer Discounts. Happy with price and product. The customer service department were helpful too."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2020-05-12T14:46:22.000Z",
          "Titre": "Received the MacBook",
          "Contenu": "Received the MacBook, but haven’t opened it because yet, as it’s  my daughter’s birthday present. At first glance it looks in mint condition."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr WARE",
          "Nb_Reviews": 10,
          "Date": "2020-12-06T09:43:43.000Z",
          "Titre": "The service was satisfactory a few…",
          "Contenu": "The service was satisfactory a few hic-ups along the way but all ot sorted quickly and the machine is running well thank you  gordon"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mrs Nicola Carter",
          "Nb_Reviews": 12,
          "Date": "2022-01-25T11:46:42.000Z",
          "Titre": "Excellent communication",
          "Contenu": "Excellent communication, good value and the computer seems fine after a couple of weeks. I would use them again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "roma broom",
          "Nb_Reviews": 15,
          "Date": "2022-02-17T11:32:02.000Z",
          "Titre": "Very helpful and quick to reply."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2021-05-01T15:41:51.000Z",
          "Titre": "Thick you should get a new genuine…",
          "Contenu": "Thick you should get a new genuine power lead tho instead of used coz can surcharge the laptop but other then that great laptop"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Isaac Adar MacCarthy-Donkor",
          "Nb_Reviews": 2,
          "Date": "2021-02-18T11:09:11.000Z",
          "Titre": "I was expecting approximate delivery…",
          "Contenu": "I was expecting approximate delivery period but there was none. If you could also provide express delivery at a cost. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Winsley",
          "Nb_Reviews": 2,
          "Date": "2021-05-18T12:32:27.000Z",
          "Titre": "This is my rating the pc I got from…8 out of 10",
          "Contenu": "This is my rating the pc I got from your company I can confirm it arrived in good working order and I rate it about 8 out 10"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Carl Spencer",
          "Nb_Reviews": 6,
          "Date": "2020-10-07T16:36:21.000Z",
          "Titre": "Arrived in good condition",
          "Contenu": "Arrived in good condition. One slight problem with disk but overcome with Avast Clean Up. So far the machine is working perfectly."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "MR A LAWAN",
          "Nb_Reviews": 3,
          "Date": "2020-10-26T14:15:07.000Z",
          "Titre": "The interaction was smooth and fine no…",
          "Contenu": "The interaction was smooth and fine no problem, but the problem was with your warehouse where the items orders were to be shipped. When I contacted the warehouse and explained the problem of cables not marching with the computer monitor and that computer monitor which I ordered was widescreen and the included was not. They were not helpful, if only they suggested okay what about the other items. I would have told them, okay but can you resend the correct cables that connect the desktop with the correct widescreen monitor. That should have resolved the matter, but he insisted that what what they were asked to deliver. Can I then have my refund and return the computer. The ware house its not their business to arrange that. I should speak to the sale department. I tried several times to contact options 1, and 2 many times I cannot speak to anyone to till now that I am writing this feed. I have written many more emails without any positive feedback. I hope they would improve in their communication eith on chat, phone or email. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Anthony Fry",
          "Nb_Reviews": 1,
          "Date": "2021-08-15T15:41:23.000Z",
          "Titre": "The MacBook Pro was exactly as…",
          "Contenu": "The MacBook Pro was exactly as described and, after a slight delay, was received in excellent protective packaging."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Man Darji",
          "Nb_Reviews": 1,
          "Date": "2020-10-17T21:17:59.000Z",
          "Titre": "It’s my first experience buying laptop…",
          "Contenu": "It’s my first experience buying laptop online. I am hoping best working compatibility. Let’s see how it goes.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "M Gibson",
          "Nb_Reviews": 3,
          "Date": "2020-11-17T23:00:13.000Z",
          "Titre": "User friendly",
          "Contenu": "The website is easy to use had no problems.Only just ordered so not received items yet let's see how it goes...."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Motorbykcouirier",
          "Nb_Reviews": 2,
          "Date": "2020-10-06T15:25:46.000Z",
          "Titre": "All items had clearly been well cleaned…",
          "Contenu": "All items had clearly been well cleaned before sending - this was very much appreciated during these uncertain times."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "christopher angeloglou",
          "Nb_Reviews": 3,
          "Date": "2017-02-21T19:16:17.000Z",
          "Titre": "Service was 1st rate.",
          "Contenu": "I will recommend your services to friends. The return of the 1st item was very well handled and now seems to be running fine."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 10,
          "Date": "2021-01-22T18:07:06.000Z",
          "Titre": "Great service - some missing information in product description",
          "Contenu": "I bought a refurbished MacBook Air from this company. Most aspects of the purchase were very good - the website, order, speed of dispatch and hitting the target delivery date, which was just 3 days from when I ordered it I think. The packaging was good and the laptop itself was in good condition. An issue arose when I tried to install MS Office using my Office 365 Family Subscription - I couldn’t. It turned out the reason I couldn’t was because the laptop was running the MacOS called High Sierra. Office won’t install on anything older than Cortana and Cortana won’t install on any MacBook older than 2012. Unbeknown to me was that the refurbished laptop was 10 years old (2011). That’s not a problem in itself but if I’d known, I would not have purchased it, and the problem is that the age of the laptop was not stated anywhere in the product description. I returned the laptop at a cost of £22 postage. The returns process was perfect - their customer service is brilliant. I just think they should give all the facts about their refurbished equipment rather than wait for customers to discover important information after they’ve purchased."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gary",
          "Nb_Reviews": 10,
          "Date": "2017-02-22T00:02:46.000Z",
          "Titre": "Well done",
          "Contenu": "Arrived but was missing WiFi card emailed them and got instant reply problem solved dispatched card to me arrived in days"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Dianne Spencer",
          "Nb_Reviews": 5,
          "Date": "2020-09-16T16:05:10.000Z",
          "Titre": "Web site very easy to use and look…",
          "Contenu": "Web site very easy to use and look forward to using the new laptop which is to replace my old i3 Acer Aspire."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Pengelly",
          "Nb_Reviews": 1,
          "Date": "2021-01-02T11:13:57.000Z",
          "Titre": "will use again",
          "Contenu": "website could be a little easier to navigate, but the chat option really helps. some great deals on here!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sounds Of Brass",
          "Nb_Reviews": 7,
          "Date": "2021-01-19T07:29:42.000Z",
          "Titre": "first lap top arrived didn;t work",
          "Contenu": "first lap top arrived didn;t work, returned it and 4 days later a replacemant was recieved all good now"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jean Hollingdale",
          "Nb_Reviews": 4,
          "Date": "2021-08-26T09:19:30.000Z",
          "Titre": "Very pleased with Computer Discounts",
          "Contenu": "Very pleased with Computer Discounts.  Friendly service. Delivery very quick for the Highlands."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Thomas Bradford",
          "Nb_Reviews": 10,
          "Date": "2020-12-04T11:27:41.000Z",
          "Titre": "Buyer be aware",
          "Contenu": "It does exactly what’s on the advert. Beware if you want something that is expected but not advertised"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "LizziL K",
          "Nb_Reviews": 3,
          "Date": "2021-10-08T15:00:33.000Z",
          "Titre": "Leaves the gushy descriptions for another site - just short and sweet",
          "Contenu": "Easy to use site, clear concise info.Now I have to wait to see if Free delivery is slow ??"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tiran Aakel",
          "Nb_Reviews": 1,
          "Date": "2020-05-23T09:18:05.000Z",
          "Titre": "Very good, but not fantastic",
          "Contenu": "Good communication. Good delivery time. A very nice machine. However, the battery life drains too fast."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Daniel Silva",
          "Nb_Reviews": 2,
          "Date": "2020-10-12T16:59:49.000Z",
          "Titre": "Slight problem with address and details…",
          "Contenu": "Slight problem with address and details so had to create an account. Apart from that minor issue 5*"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Vlacos",
          "Nb_Reviews": 6,
          "Date": "2020-10-19T09:46:14.000Z",
          "Titre": "I was very happy with the way they…",
          "Contenu": "I was very happy with the way they dealt quickly with my issues over a lap top that did not work"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "susan whitmore",
          "Nb_Reviews": 6,
          "Date": "2017-03-09T06:56:28.000Z",
          "Titre": "Refurbished pc",
          "Contenu": "Lovely gaming pc.....my son loves it..it does everything it's supposed too...i would buy again ++++++"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gary Beach Lastname",
          "Nb_Reviews": 4,
          "Date": "2020-11-17T10:41:39.000Z",
          "Titre": "Needed a new update on my laptop…",
          "Contenu": "Needed a new update on my laptop searched and found this company very pleased with the service"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gary Powell",
          "Nb_Reviews": 5,
          "Date": "2020-10-06T11:58:14.000Z",
          "Titre": "Great piece of equipment at a…",
          "Contenu": "Great piece of equipment at a reasonable price,  now just got to get my son to use it!!!!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kevin Phillips",
          "Nb_Reviews": 2,
          "Date": "2020-06-12T17:36:13.000Z",
          "Titre": "Delivery time",
          "Contenu": "Good quality product Could explain the delivery time a bit better but overall very happy"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:11:08.000Z",
          "Titre": "Great laptop",
          "Contenu": "Great laptop, like new. Good customer service. Good price. Reliable seller."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Jones",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T20:52:34.000Z",
          "Titre": "Well recommend",
          "Contenu": "All good laptop works fine delivery was quick. Biggest thing getting reconditioned laptops you can afford something a lot better than if you had to buy it new. I’ve always bought refurbished and so far it’s never done me wrong 👍🏻"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Shirley Gedling",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T08:55:31.000Z",
          "Titre": "I needed a laptop but couldn’t afford a…",
          "Contenu": "I needed a laptop but couldn’t afford a new one and knew very little about buying one. When l emailed this company l was immediately contacted back by one of the friendly, helpful staff who answered my problems and put me at ease. I am delighted with my purchase and recommend them to everyone. They are a British company and are utterly trustworthy and genuinely helpful. 🌟🌟🌟🌟🌟"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Customer : Mrs S Swift",
          "Nb_Reviews": 18,
          "Date": "2022-04-19T16:09:56.328Z",
          "Titre": "Fantastic service",
          "Contenu": "Ordered MacBook last Thursday and with Bank Holiday Friday and Monday expected delivery around Thursday this week really surprised when received today.Ask some questions via the contact us page and Jordan replied in less than an hour.MacBook is absolutely pristine condition.Fantastic all round service 10/10"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Jones",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T16:50:52.000Z",
          "Titre": "Would certainly recommend to check out",
          "Contenu": "Had no problems even got a message to check my address. Laptop turn up very quick works fine also being reconditioned I could afford something better than I could buying brand new."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "simon evans",
          "Nb_Reviews": 36,
          "Date": "2022-12-16T15:39:15.000Z",
          "Titre": "Highly Recommended for great service and product",
          "Contenu": "I ordered a 2015 Apple Macbook Air Powerful 13.3\" Core i5 8GB RAM 256GB SSD  just as a back up laptop not expecting much. As I had only paid £360 I was not expecting the earth. I followed the tracking from day one and it was delivered after only four days. The Macbook is immaculate and works brilliantly. Best service I have ever had.Well done Computer Discounts. I cannot praise your friendlyness, professional approach and fabulous product. Highly Recommended."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robin",
          "Nb_Reviews": 7,
          "Date": "2023-02-21T19:11:30.000Z",
          "Titre": "I was looking to update my desk top…",
          "Contenu": "I was looking to update my desk top system and whilst online I came across Computer Discounts. After careful consideration I decided to go for a refurbished HP laptop. It was approx one third of new price. It arrived promptly and I am interested process of setting it up."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ms Santee",
          "Nb_Reviews": 4,
          "Date": "2022-04-09T12:26:21.000Z",
          "Titre": "First time buyer",
          "Contenu": "As a first time buyer I was quite nervous,  it was bought for my daughter who was delighted when it arrived earlier than expected and has been using daily. A minor issue with the mouse pad reported at 11pm recieved a response email before 8am the next day and was corrected straight away. I would definitely buy at computer discounts in the future."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rona Benzie",
          "Nb_Reviews": 7,
          "Date": "2023-04-17T14:44:32.000Z",
          "Titre": "Great product",
          "Contenu": "Great product - refurbished MacBook Air - and at a great value for money price. Delivery and set up straightforward. (I don't believe however that I received my free bundle of apps despite sharing on facebook.)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark",
          "Nb_Reviews": 3,
          "Date": "2022-09-24T11:51:37.000Z",
          "Titre": "Great little machine",
          "Contenu": "Great little machine , looks good as well , all works , free downloads didn’t work though but didn’t need these downloaded pages from App Store no problem, so she’s off writing her book now, light and perfect for her, thanks"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Mark Leach",
          "Nb_Reviews": 2,
          "Date": "2022-02-11T09:32:14.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Purchased a refurbished laptop.  Arrived very quickly as promised.  A few days later I decided I wanted to change my mind so contacted the company to return it.   Dealt with a very helpful person called Andrews who gave me all the information to return it.  Got the refund 2 days after they had received it back.  Excellent customer service.  Thoroughly recommend"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ann Lewis",
          "Nb_Reviews": 2,
          "Date": "2022-08-12T17:09:50.000Z",
          "Titre": "first class product and fantastic service.",
          "Contenu": "Bought a MacBook Air on Monday. It arrived on Wednesday. It's in beautiful condition, works very fast, and synchronises seamlessly with my iPad and iPhone shared files and apps. The Computer Discounts support team could not have been more helpful with the small setup queries I had, and they responded almost instantly. Very happy and cannot recommend the company highly enough. It's good to see responsible reconditioning of excellent technology. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark Thompson",
          "Nb_Reviews": 2,
          "Date": "2023-02-07T23:48:58.000Z",
          "Titre": "Great returns and money back policy",
          "Contenu": "I recently bought a MacBook Pro from Computer Discounts. When I got it I realised that it was much bigger and heavier than I expected and so wasn’t suitable for what I needed it for. The actual laptop worked like a dream and looked brand new but I still decided to return it. I emailed letting them know this and returned it the following day. It was sent on a Friday, it arrived with them on Monday and my full refund was in my bank account on Tuesday morning. Absolutely great service. So even though I was not buying the product, Computer Discounts gave me a first class service. Intend now to buy a smaller MacBook Air."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Carole Kirsopp",
          "Nb_Reviews": 2,
          "Date": "2022-08-22T12:45:08.000Z",
          "Titre": "It’s my first foray into MacBook…",
          "Contenu": "It’s my first foray into MacBook territory so I was very careful in researching products. I found Computer Discounts while trying to find myself a reasonable deal.I had not considered re-conditioned tech until this site.After some consideration I bought the MacBook Air, Monterey. Delivery was swift and when I had a problem setting up on my first day, I contacted them and they sent back the the information I needed without delay. I am impressed and would recommend Computer Discount unreservedly.  Mrs Carole Kirsopp."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gemma McKeown",
          "Nb_Reviews": 4,
          "Date": "2023-02-13T17:04:41.000Z",
          "Titre": "I highly recommend computer discounts",
          "Contenu": "I highly recommend computer discounts. Staff very attentive and helped a great deal when I couldn’t make a decision. Although I felt like an idiot they certainly didn’t treat me as such. They made me feel like I was their most important customer. The device I purchased is of a very high standard."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mrs V Carress",
          "Nb_Reviews": 6,
          "Date": "2022-04-21T18:23:19.273Z",
          "Titre": "Really pleased",
          "Contenu": "After owning apple products from new I was slightly reluctant to purchase but it’s for my 78 yr old Mother so seemed like a great option.. She desperately needed a new small light weight laptop so I brought her a macbook air.. Brilliant easy to set her up, small and exactly what she needed. Arrived quickly and would definitely buy again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MC",
          "Nb_Reviews": 6,
          "Date": "2022-02-02T15:43:22.000Z",
          "Titre": "LENOVO LAPTOP",
          "Contenu": "LENOVO LAPTOPSorry for the delay in reviewing this item, but I really haven't had time with covid and looking after my elderly mother. The laptop arrived in great time, well packed and in brilliant condition, there aren't any problems with the machine and a fantastic price. Only problem is the user, now things have settled down I can spend a lot more time finding my way round windows10.I would definitely buy from this company again and recommend them 100%. Customer service is next to none however silly your question, with a very quick response.Thank you very much Computer Discounts"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Rose",
          "Nb_Reviews": 11,
          "Date": "2022-01-29T11:23:53.000Z",
          "Titre": "Very good value product",
          "Contenu": "Very good value product - and the shipping time was spot on too. Very pleased with the Laptop - it's a known brand, quality product, representing a good saving over normal retail price. Give these people a go next time you need a replacement laptop - you won't be disappointed."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Stock",
          "Nb_Reviews": 4,
          "Date": "2023-06-15T12:59:16.000Z",
          "Titre": "The iMac I ordered delivered next…",
          "Contenu": "The iMac I ordered delivered next day,The packaging was good,great quality product,works great saved a tidy amount will recommend to my colleagues can’t  fault them keep it up"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Katie",
          "Nb_Reviews": 9,
          "Date": "2023-03-03T13:40:10.000Z",
          "Titre": "Highly recommended, great service",
          "Contenu": "Item arrived quickly and well packed. I returned it having decided to upgrade. The return process was smooth and refund fast. Communication was excellent throughout. I am so pleased with the service that I will use them to purchase my upgrade. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Howard Handley",
          "Nb_Reviews": 4,
          "Date": "2022-01-28T19:03:36.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, helpful web chat which narrowed my search and selected a 2017 Mac Book Air for my wife. Arrived double quick, excellent condition, no marks on the case or screen and easy to set up (I’m over 50!!). Really happy and would defo recommend. I’ll be looking for a laptop for myself in the near future. Cheers"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Leon King",
          "Nb_Reviews": 10,
          "Date": "2022-09-21T08:41:08.000Z",
          "Titre": "First computer turned out not to have…",
          "Contenu": "First computer turned out not to have the functionality I needed. Was able to easily return it and order a more suitable alternative. Both arrived quickly and refund for the first processed within days. Very good interactions with support team by phone and email. Both computers in very good condition and working well as expected. Highly recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew L",
          "Nb_Reviews": 4,
          "Date": "2023-05-24T21:13:16.000Z",
          "Titre": "This is a great company",
          "Contenu": "This is a great company. Friendly and efficient. I bought a refurbished laptop which had a battery failure and the issue was dealt with in a very understanding and professional way. Clear communication, great prices and excellent customer service. I’ll be going back to buy a device for my daughter."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Maurice Feely",
          "Nb_Reviews": 5,
          "Date": "2023-03-12T09:40:50.000Z",
          "Titre": "Bought a MacBook and realised it was…",
          "Contenu": "Bought a MacBook and realised it was not suitable. They took it back immediately and I then bought one from them that met my needs. The service is outstanding, the product quantity is excellent and after sales is wonderful. Buy without hesitation"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "harry woodcock",
          "Nb_Reviews": 32,
          "Date": "2022-01-29T15:04:02.000Z",
          "Titre": "I ordered a pc from this company,it…",
          "Contenu": "I ordered a pc from this company,it came in a short while unfortunately l wasn’t what l wanted so l l returned it for a refund. They were excellent in keeping their promise about returning and refunds both were prompt refund came in record time .l would definitely recommend this company"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kevin",
          "Nb_Reviews": 20,
          "Date": "2022-03-02T19:37:29.000Z",
          "Titre": "Completely genuine and upfront honest company",
          "Contenu": "I am extremely happy with the laptop I ordered and received, Computer Discounts had gone out of it's way to ensure I received my order in good time and in excellent working order and condition.They shipped my order from their Dubai warehouse just to make sure I received it in time.I will certainly be using them again when I need to upgrade to a newer system.Total value for money and completely genuine and upfront honesty which seems to be rare these days, keep you the great service you provide."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Andrew Green",
          "Nb_Reviews": 19,
          "Date": "2022-11-17T21:51:48.000Z",
          "Titre": "Great communication and help",
          "Contenu": "Although the item I bough didn't do what I needed it to do (my fault) the item was delivered quickly and looked like new. The communication and response time from the staff was excellent as was their help in recommending alternatives that would be suitable. Great company and will definitely use them again"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Thomas Hepburn",
          "Nb_Reviews": 9,
          "Date": "2022-07-21T12:03:25.000Z",
          "Titre": "Fantastic service",
          "Contenu": "Fantastic service. The guys are great to deal with at every stage of purchase. I returned a chromebook (my mistake) it was a simple and efficient process. I purchased the correct one and it arrived promptly and in great condition. Seriously, don't go anywhere else to buy a refurbished laptop"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Shari",
          "Nb_Reviews": 10,
          "Date": "2022-08-06T18:56:35.000Z",
          "Titre": "Top notch",
          "Contenu": "Sadly, my purchase did not quite work out for me. However, I had no problems with a refund which had been promptly given without fuss. The communication had been excellent. Top notch company, can’t recommend them enough."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Janine",
          "Nb_Reviews": 3,
          "Date": "2023-01-10T11:57:46.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Easy to order. Arrived within a few days. Excellent and timely follow-up support and advice for one issue, which was easily resolved. Mac Book up and running. Very happy customer."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ben K",
          "Nb_Reviews": 4,
          "Date": "2022-12-19T20:51:29.000Z",
          "Titre": "Exceptional Service …",
          "Contenu": "I purchased a laptop from Computer Discounts in 2022, 363 days later it went wrong. I contacted Computer Discount and they sorted the issue within 3 days, no problems at all. The communication was fantastic. I would recommend this company, as they are top class."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2022-02-24T20:04:44.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. I had a small query where I had purchased the goods twice by mistake so sent an email, my email was dealt with very fast and efficiently I received a refund within the day.  Shipping was fast, the goods excellent. Like a brand new machine, very well packaged.  Would not hesitate to use the company again or recommend to friendsThanks"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anne Clark",
          "Nb_Reviews": 13,
          "Date": "2022-07-26T00:05:54.000Z",
          "Titre": "Very pleased with my reconditioned Mac…",
          "Contenu": "Very pleased with my reconditioned Mac book pro. Very friendly, knowledgeable service. Very efficient and laptop arrived when they said it would and appears in very good condition. I only have been using for a couple of weeks but so far so good! I was also given contact details in case I ran in to problems. So it’s 5 stars from me for excellent service, does what it is supposed to do and arrived on time that I was given. Well and secure packaging too."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kevin Allonby",
          "Nb_Reviews": 8,
          "Date": "2022-02-24T15:43:20.000Z",
          "Titre": "Macbook Pro,",
          "Contenu": "Kevin/Northumberland,excellent service and productJordan in customer services kept me up to date with delivery information when requested.arrived on time, no damage and looks great 10/10 and will use again when/if required.Rgds"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 9,
          "Date": "2023-01-17T10:24:08.000Z",
          "Titre": "100% satisfaction",
          "Contenu": "100%saticefaction Delivery goodPrice fantastic my MacBook Air is in excellent condition in fact it looks like brand new. Yes would definitely use this company again and yes would recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Simone",
          "Nb_Reviews": 11,
          "Date": "2022-05-09T12:41:07.000Z",
          "Titre": "Good service and good communication",
          "Contenu": "I bought a macbook and it arrived in good time, but I couldn't log into my Apple account with it, as all the slots were taken. Conputer Discounts said that that was not their usual practice and asked me to send it back to them. They organised a courier to collect it and when they received it, they sent another to me. I've received all the courier information so far, so I should receive it soon and hopefully no more issues. I'm giving a 5 star rating, as they have been very helpful. Issues are dealt with promptly. They have been very understanding with the issues and their willingness to help has been appreciated.  I can't fault them, as the issue I had was out of their control."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "G Arnold",
          "Nb_Reviews": 12,
          "Date": "2023-04-29T10:19:28.000Z",
          "Titre": "MacBook Air Like new-excellent price",
          "Contenu": "MacBook Air arrived very well packaged and just like new at a great price! Only recently purchased but so far happy with my purchase.Recommended."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard Debrick",
          "Nb_Reviews": 7,
          "Date": "2023-01-30T17:40:54.000Z",
          "Titre": "Delivery was f which…",
          "Contenu": "Delivery was faster than expected which was great. When I first opened the box I thought I had been sent a new computer. Excellent condition, not a single mark on it. I highly recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "I Explorer",
          "Nb_Reviews": 4,
          "Date": "2023-01-17T12:18:38.000Z",
          "Titre": "Delivered well",
          "Contenu": "Great value. Quick delivery, packaged carefully. Fantastic refurb job. Great website. Communicative. Everything as written in spec plus a tree planted for me."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Vivian Please",
          "Nb_Reviews": 5,
          "Date": "2023-05-08T19:03:12.000Z",
          "Titre": "New laptop",
          "Contenu": "Laptop arrived ahead of delivery date. looks like new.  Had it up and running very quickly with no problems.  Very good value and will recommend 'Computer Discounts' to all my friends."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Helena Currie",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T08:39:38.000Z",
          "Titre": "Superb service",
          "Contenu": "Superb service. I emailed with my required specs and budget. I received a reply quickly with a perfect recommendation and 3 days later I've gor exactly what I needed for the job. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Clare Waddington",
          "Nb_Reviews": 8,
          "Date": "2022-04-14T22:29:02.000Z",
          "Titre": "Amazing place",
          "Contenu": "Amazing place - computer ordered for vg price then sent and received well within the time specified. Arrived programmed for data migration. Very easy to perform. Grateful to you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr BARRY HILLS",
          "Nb_Reviews": 8,
          "Date": "2023-01-02T22:04:08.000Z",
          "Titre": "Value and Quality Laptops .",
          "Contenu": "Hello there thanks for the HP laptop delivery, very well packaged, arrived as requested. Worked fine first time once i managed to work it all out.Only comment, outside casing was dirty! And stickey, must have been a lunch time packing.Good value allround 9 out of 10.Great stuff."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Shayne Bird",
          "Nb_Reviews": 4,
          "Date": "2023-03-17T13:41:13.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. Prompt reply to my emails when enquiring for further information.Really pleased with my  laptop.I would definitely recommend them to my friends and family"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "justin a smith",
          "Nb_Reviews": 20,
          "Date": "2023-01-31T20:59:24.000Z",
          "Titre": "Had an issue with the first laptop, quickly resolved!",
          "Contenu": "Had an issue with the first laptop. The guys @ computer discounts apologised, sent me the returns label.I posted it on Monday and the new laptop arrived on Thursday. Love my Dell laptop, it's so quick on Windows 11 and loved the price :-)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Karan",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T13:12:23.000Z",
          "Titre": "Ordered MacBook Air 2017 refurbished…",
          "Contenu": "Ordered MacBook Air 2017 refurbished and trust me received in really good and new condition.Really satisfied with the service and delivery.Thanks to team Computer Discounts."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mikey Murphy",
          "Nb_Reviews": 3,
          "Date": "2022-03-08T13:22:12.000Z",
          "Titre": "Great sales team",
          "Contenu": "Great sales team! I had to change my order due to a mistake I had made with some of the specs. after emailing them straightaway after realising my mistake, they quickly refunded me with no hassle, and I then ordered the correct model.The delivery time was super quick also (2 days!) and the mac does everything I need it to.Highly recommend these guys :)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "FRANK JEFFREY",
          "Nb_Reviews": 8,
          "Date": "2022-08-04T11:42:34.000Z",
          "Titre": "I absolutely first class service",
          "Contenu": "I absolutely first class service. Had problems with  my MacBook. Had to be returned. Was absolutely no problem. Very quick to reply to any emails. Absolute first class service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "mandy hurworth",
          "Nb_Reviews": 8,
          "Date": "2022-09-10T00:36:33.000Z",
          "Titre": "refurbed Apple Mac book",
          "Contenu": "I ordered a refurbed Apple Mac which arrived in good condition and good working order. I have had it for 2 weeks now and not experienced any glitches."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jonathan Vocking",
          "Nb_Reviews": 4,
          "Date": "2022-08-12T11:36:16.000Z",
          "Titre": "I ordered for my daughter but found out…",
          "Contenu": "I ordered for my daughter but found out it was the wrong one - the guys couldn’t have been more helpful and courteous and the refund was back in my account within 3 days"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jim Renshaw",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T20:52:55.000Z",
          "Titre": "Excellent service!",
          "Contenu": "MacBook Pro arrived very well packaged and like new. Friendly staff with excellent service at a great price! Recommended."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "George Anderson",
          "Nb_Reviews": 5,
          "Date": "2023-04-10T20:49:52.000Z",
          "Titre": "Great experience purchasing a laptop",
          "Contenu": "Great experience purchasing a laptop from Computerdiscounts.co.uk. Easy to use the website, great prices and clear information about the options, then fast delivery. Would highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "desmond diamond",
          "Nb_Reviews": 5,
          "Date": "2022-04-03T10:24:34.000Z",
          "Titre": "I purchased a laptop computer but found…",
          "Contenu": "I purchased a laptop computer but found that it had chrome and not windows which was unacceptable - I hadn't worked with chrome before but had windows for numerous years on my desktop and I found it much easier to navigate/use. I sent Computer Discounts an e-mail stating this and they agreed to take it back providing it was in the same condition as it was sent.  I returned the item and they had refunded the price I paid for it within a couple of days.  You just can't beat that sort of customer relationship and I heartily recommend COMPUTER DISCOUNTS to anyone considering purchasing a laptop from them."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "D Cozaciuc",
          "Nb_Reviews": 6,
          "Date": "2022-03-19T18:58:27.000Z",
          "Titre": "appreciate the promptness you showed…",
          "Contenu": "appreciate the promptness you showed even if the delivery was not completed. The mistake is from the DHL operator who misplaced the delivery address.I received my money back in good time."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Darren Rooney",
          "Nb_Reviews": 4,
          "Date": "2022-12-28T12:02:12.000Z",
          "Titre": "Service and product 10/10",
          "Contenu": "The advice I received online via the chat was superb, great to have a human to interact with rather than a bot. My MacBook arrived quicker than expected and was in superb condition, looks absolutely brand new!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gavin Weir",
          "Nb_Reviews": 12,
          "Date": "2022-10-01T08:39:18.000Z",
          "Titre": "DHL waybill to identify sales record.",
          "Contenu": "Following a ridiculous mistake by DHL the delivery was mixed up, the customer support team bent over backwards to resolve this and the Mac finally arrived all in order. Very happy with the refurbished equipment and would recommend this as away to get A1 kit at a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mike Williams",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T14:03:46.000Z",
          "Titre": "Really varied amount of laptops at good…",
          "Contenu": "Really varied amount of laptops at good affordable prices. The laptop arrived in good time and was well packaged, loaded up like a dream and has been great ever since! Many thanks for the speedy service!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "A V",
          "Nb_Reviews": 2,
          "Date": "2022-03-03T11:45:52.000Z",
          "Titre": "Excellent quality",
          "Contenu": "Excellent quality, great service. The macbook I bought is 2 years older than mine, and yet it performs better. Great refurb, guys - very impressed!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alec Walker",
          "Nb_Reviews": 8,
          "Date": "2022-04-18T20:45:57.000Z",
          "Titre": "Couldn't  believe how quick I received…",
          "Contenu": "Couldn't  believe how quick I received my order. Laptop perfect just what I wanted. Would not hesitate to re ommend to others."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Philly Allsopp",
          "Nb_Reviews": 17,
          "Date": "2023-05-22T12:06:33.000Z",
          "Titre": "A very positive experience",
          "Contenu": "Mine was a completely straightforward transaction. Computer Discounts provided a quick and efficient service.I was impressed by the  Iength of the guarantee."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "T.KINGSTON",
          "Nb_Reviews": 2,
          "Date": "2022-02-17T09:56:15.000Z",
          "Titre": "The Mac book works very well and it…",
          "Contenu": "The Mac book works very well and it looks like new.I was a bit surprised it came from the Arab Emirates /but all the postage was included in the price / . I can use it for Zoom,Netflix etc... I am very happy with the purchase.I highly recommend Computer Discounts."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Neil Canham",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T19:53:48.000Z",
          "Titre": "Happy so far!",
          "Contenu": "The transaction was straightforward and the laptop was delivered in one piece. My partner switched it on today and it works well. With the 1 year warranty in place, fingers crossed, it should all work out! So, to conclude.Happy so far..."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Marjun King",
          "Nb_Reviews": 3,
          "Date": "2022-02-14T15:15:01.000Z",
          "Titre": "I am very pleased with the MacBook Pro…",
          "Contenu": "I am very pleased with the MacBook Pro I ordered.  Almost like new and it is working perfectly. Delivery was quick. I can recommend Computer Discount."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gordon Knight",
          "Nb_Reviews": 27,
          "Date": "2022-10-20T12:26:56.000Z",
          "Titre": "good",
          "Contenu": "I have only used my Macbook Air for a short time but found it satisfactory and up to Mac standards, all that i was expecting. Good value for money so far"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kuba Skipala",
          "Nb_Reviews": 6,
          "Date": "2022-07-18T12:35:45.000Z",
          "Titre": "Good company",
          "Contenu": "Good company. Bought second MacBook from them, amazing, quick communication, always there to help. Cheers guys."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Milner",
          "Nb_Reviews": 25,
          "Date": "2022-03-19T08:32:36.000Z",
          "Titre": "Excellent value overall.",
          "Contenu": "The MacBook was in superb condition, delivered promptly, well packed and worked as expected out of the box.   Excellent value overall."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Miranda Clapcott",
          "Nb_Reviews": 22,
          "Date": "2022-08-12T08:34:14.000Z",
          "Titre": "Did the usual Google search then…",
          "Contenu": "Did the usual Google search then recommended and Computer Discounts Pops up! Thank you As we got a fabulous deal"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Laura B",
          "Nb_Reviews": 12,
          "Date": "2023-04-25T20:30:21.000Z",
          "Titre": "Good value refurbished laptop",
          "Contenu": "Good value refurbished laptop.  Had the edge over closest one on eBay as it came with a charger.  Arrived slightly later than informed, but would buy again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Del Behan",
          "Nb_Reviews": 3,
          "Date": "2022-12-14T15:23:20.000Z",
          "Titre": "Really good value and perfect machine",
          "Contenu": "Really good value and perfect machineVery fastMuch better than expectedGreat value and super fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jay O",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T11:49:26.000Z",
          "Titre": "Excellent service so far :-)",
          "Contenu": "Excellent service at point of sale and delivery, and great first impressions!I am cynical about online offers - if it looks too good to be true, then it usually is. However, on this occasion I was proved wrong. I put my faith in Computer Discounts and they didn't let me down. I've had my new (refurbished) MacBook Air 2017 for 2 weeks now and can honestly say it was a very positive experience buying from this company. The initial questions I had were answered by email promptly and clearly. I was kept informed about the process of preparation and delivery. The delivery was fast - 48 hours to an off-shore UK island. The laptop was in superb condition and easy to set up. So far, I am impressed. I say \"so far\" because I can't yet comment on any after-service processes or responses; I hope not to have to need to tbh.My only slight observation is that the packaging very clearly stated what was inside. I was a little surprised that it was so obvious as surely any \"loss\" in transit wouldn't be covered by their insurance if they are declaring to all who handle it (or trustingly leave it with a neighbour or in a \"safe place\" on delivery if you're out) that there is an expensive computer/device in the box; I'd expected it to be more discreet. Also sort of gives the game away if you're buying it as a gift for someone you live with.Yep - so far, would fully recommend this company :-)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Zoe",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T18:19:48.000Z",
          "Titre": "Absolutely brilliant",
          "Contenu": "Absolutely brilliant, macbook works the way it should and looks like new would definitely buy from them again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "m king",
          "Nb_Reviews": 4,
          "Date": "2022-02-04T13:00:28.000Z",
          "Titre": "Very pleased with my MacBook Pro",
          "Contenu": "Very pleased with my MacBook Pro. It arrived quickly and well packaged. As good as new, just slight wear and tear around the edges. A joy to work on. Good communication. I would recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Peter Bodington",
          "Nb_Reviews": 2,
          "Date": "2022-02-23T13:47:03.000Z",
          "Titre": "refund process went well",
          "Contenu": "when I wanted to return my purchase (because i had decided i needed a different model of laptop) - the whole process went extremely well and the refund came through very quickly."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dafydd Thomas",
          "Nb_Reviews": 4,
          "Date": "2023-05-11T09:39:18.000Z",
          "Titre": "Quick delivery and easy to order at a…",
          "Contenu": "Quick delivery and easy to order at a very competitive price . The item arrived in perfect condition like new!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ms Anna Trust Ltd",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T08:43:10.000Z",
          "Titre": "A new MacBookPro just used and approved",
          "Contenu": "I was looking for a new laptop for my business similar to my previous model with identical features such as sd card input, a few USB, CD/Video player basically all in one computer but still being portable. The new MacBook Pros 2020 on high street today are out of my pocket and Out of my need. I found a perfect solution after [chatting] with one of the staff at CD on possible options. I was hesitant at first why nobody would pick up the phone after several attempts trying to reach the company. I always prefer a human interaction especially when buying any gadgets, to ask a question as a reassurance for what tech terms means for example....because of that vital to me option was not available I will rate CD a good company. However I did get some limited correspondence and information  via emails regarding the stock, the models and delivery. It took 4 working days to receive my laptop. 2 days to get the order placed, hence absence of “human touch”.  I highly suggest to implement at least a what's up text and voice messages when possible.Gentleman from the delivery firm came all the way to the 4th floor to hand me in person my order, normally deliveries are left Inside the hall by the front door.Excellent service by the chosen delivery Firm, 5 star to the driver, 5 star for the price of my new MacBookPro that I paid only £380 for.The product functions very good, So far I am happy with the purchase but I'm still within my 1 year warranty, so time will show how long this type of technology will last. As this is my first time that I bought a used Technology from a third party."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jamie Oliva",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T16:13:20.000Z",
          "Titre": "Genuinely great company!!",
          "Contenu": "Genuinely great machine that turned up! You cannot beat the value. Great customer service and very good product! Very happy"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Vicky Riddick",
          "Nb_Reviews": 2,
          "Date": "2022-12-16T11:16:39.000Z",
          "Titre": "Think Pad",
          "Contenu": "Ordered Think Pad with no issues, was delivered with no issues, I’ve not used it yet but looks  good so far."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Crofekustomer",
          "Nb_Reviews": 4,
          "Date": "2022-08-04T19:00:16.000Z",
          "Titre": "Amazing",
          "Contenu": "The computer came fast and in really good condition. The costomer service was also good. I picked the wrong computer and they sorted the problem very fast."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Vincent Hughes",
          "Nb_Reviews": 7,
          "Date": "2022-01-31T15:16:10.000Z",
          "Titre": "Very pleased with the laptop I bought",
          "Contenu": "Very pleased with the laptop I bought, it was as good as new. I also contacted them with a question the week I purchased. The response was quick and the contact was very helpful.Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "kevin wood",
          "Nb_Reviews": 27,
          "Date": "2022-12-28T20:33:33.000Z",
          "Titre": "you did good but the screen has a…",
          "Contenu": "you did good but the screen has a couple of chips on it but nothing that impacts viewing anything"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "richard cox",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T23:17:04.000Z",
          "Titre": "kept informed of progress throughout…",
          "Contenu": "kept informed of progress throughout the order and delivery process. Thusfar product is in great order."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ann Holland",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T11:34:35.000Z",
          "Titre": "Amazing prices for amazing products",
          "Contenu": "Amazing prices for amazing products. Delivery was very prompt, and laptop was immaculate."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris Parker Building Services Ltd",
          "Nb_Reviews": 25,
          "Date": "2022-03-15T12:02:36.000Z",
          "Titre": "Fast and efficient service",
          "Contenu": "Fast and efficient service. No set up problems only 2 hours of Microsoft updates. Would recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kevin Ward",
          "Nb_Reviews": 3,
          "Date": "2022-09-23T18:42:29.000Z",
          "Titre": "Quick efficient service when the…",
          "Contenu": "Quick efficient service when the product arrived it was in great condition and easy to set up. Very happy all round"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lyn llewellyn",
          "Nb_Reviews": 16,
          "Date": "2022-08-09T22:32:08.000Z",
          "Titre": "My granddaughter thinks I’m the best now",
          "Contenu": "Purchased from you before - it was so easy and needed another MacBook for my granddaughter so went back to a trusted supplier- she’s ecstatic as she now has a smart purple MacBook- five stars from her so you get five stars as well"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Berty",
          "Nb_Reviews": 17,
          "Date": "2022-04-16T21:33:59.000Z",
          "Titre": "Excellent service",
          "Contenu": "I found the whole ordering experience was so easy, delivery was super quick and the laptop was perfect it worked flawlessly straight out of the box."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lindsey",
          "Nb_Reviews": 2,
          "Date": "2022-02-24T18:56:11.000Z",
          "Titre": "Super quick service",
          "Contenu": "Super quick service, fab laptop.Easy set up.Definitely recommend and would use again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Thomas Hepburn",
          "Nb_Reviews": 9,
          "Date": "2022-07-31T16:18:49.000Z",
          "Titre": "Excellent service and a really quality…",
          "Contenu": "Excellent service and a really quality product. Staff were so helpful at every stage of the process."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "S.Hill",
          "Nb_Reviews": 3,
          "Date": "2022-01-28T07:29:20.000Z",
          "Titre": "Really pleased with my order",
          "Contenu": "Really pleased with my order - I received my laptop in good time, a refurbished, it surpassed my expectation. Thank you ComputerDiscount!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MICHAEL CRITCHLEY",
          "Nb_Reviews": 5,
          "Date": "2022-12-30T23:47:50.000Z",
          "Titre": "Item exactly as described",
          "Contenu": "Item exactly as described. Fast delivery and product well wrapped. Good communication from the company"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Crofekustomer",
          "Nb_Reviews": 4,
          "Date": "2022-07-30T13:39:47.000Z",
          "Titre": "Amazing",
          "Contenu": "The computer came fast and in good condition. I chose the wrong one and they quickly sorted it for me.Will revisit when I need a new laptop"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Iain  Armstrong",
          "Nb_Reviews": 8,
          "Date": "2022-02-11T11:53:22.000Z",
          "Titre": "Excellent service and I  am delighted…",
          "Contenu": "Excellent service and I  am delighted with the quality of my laptop . I’d recommend this company to anyone !"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark Johnson",
          "Nb_Reviews": 25,
          "Date": "2022-03-23T14:59:24.000Z",
          "Titre": "Excellent service and great product",
          "Contenu": "Excellent service and great product. Nothing too much trouble. Fast and safe delivery"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mike",
          "Nb_Reviews": 23,
          "Date": "2022-12-05T14:42:12.000Z",
          "Titre": "I purchaced a Chromebook from the firm",
          "Contenu": "I purchaced a Chromebook from the firm, but it was not what I wanted. I returned the item, and they were very helpfull at every stage, and a quick refund. I could not fault them."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tony Jenkins",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T19:58:34.000Z",
          "Titre": "Great company",
          "Contenu": "Great company to deal with, good quality product, great communication arrived in good time."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Edward Wickham",
          "Nb_Reviews": 15,
          "Date": "2022-05-07T12:21:57.000Z",
          "Titre": "Although in the end I o\\got a new Mac…",
          "Contenu": "Although in the end I o\\got a new Mac the service re cancellation of my order the service from you was excellent"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alex B Cann",
          "Nb_Reviews": 28,
          "Date": "2022-05-07T23:52:17.000Z",
          "Titre": "Arrived promptly and well packaged",
          "Contenu": "Arrived promptly and well packaged. As described + laptop works extremely well. Great price and service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "graham robinson",
          "Nb_Reviews": 12,
          "Date": "2022-02-26T15:48:19.000Z",
          "Titre": "cancel order",
          "Contenu": "I had to cancel, almost instant refund t y would use this company again"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stephen Atkinson",
          "Nb_Reviews": 2,
          "Date": "2022-02-26T12:06:42.000Z",
          "Titre": "What  a great company to work  with",
          "Contenu": "What  a great company to work  with, keeps you informed and responds quick and professional."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Martyn Jones",
          "Nb_Reviews": 12,
          "Date": "2022-02-22T12:30:23.000Z",
          "Titre": "First class is all I can say",
          "Contenu": "First class is all I can say. If you want a great deal and quality you won’t go wrong with these guys,highly recommended"
        }
      ]
    }
  ]
}