{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "creditrepaircloud.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T03:45:28.000Z",
          "Titre": "Not Recommended",
          "Contenu": "Basic software. Very slow, and there are not a lot of features available. Customer service is bad; re-importing credit gives inaccurate results. Overall, this software is not good to use for credit repair businesses. I will not recommend this software. and the price per month is very high. It is not worth it. You will lose a lot of clients if you use this software. No notifications when stuff is due or past due; no good communication source with the software to communicate with your clients beside messaging. Not recommended."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Leibold",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T20:35:36.000Z",
          "Titre": "These reviews are fake",
          "Contenu": "These reviews are fake, Read who wrote them and you'll see they were paid fake reviews. Plus they are credit repair is actually being sued big time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allen Watkins",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T19:48:27.000Z",
          "Titre": "Dissappointment",
          "Contenu": "Thus far not good because I have been held up for over a month, while paying for a service that is not benefiting me. An no one seems to really care.When onboarding the system would not let me move forward until I signed up with Credit Score Hero. My first red flag because I was force into the subcription to move forward.As I discovered using Credit Score Hero/Advantage scoring model is inaccurate, as it gave me a 103 point score difference than the FICO scoring model, that most all lenders use. Which I only found out when applying for a refinance on my home, and I learned auto lenders also use FICO.So I cancelled my subscription and signed up with IdentityIQ FICO option.Why Credit Score Hero would have Advantage as their only option makes no sense. Not logical to provide clients scores so much different than what a lender is going to pull. Only serves to upset people as it has me. That is not being a Hero!Yet CRC/CSH (Credit Score Hero) seems determined to make us use Advantage scoring model by making errors pop up when trying to use affiliate links?I can't import my own credit report, much less a client. I have tried 2 different affiliates that use FICO with same error.  So why should I be paying for a service I can't use accurately?Bella in your very slow customer support system says my log in credentials are wrong causing the problem. 1. Your site does not ask for the affiliates login credentials. 2. I provided Bella my log in credentials and same problem and no further response.Seems your company is determined on making people use Credit Score Hero. To what end? It has to be upsetting a lot of customers once they apply for financing and find out their score is actually much lower. Which is bad for the industry's reputation. Credit Repair Cloud seems to have a great platform for processing yet I can't get there to actually find out. CRC seems uninterested in allowing affiliate links to work. The CRC/CSH site even highly discourages using affiliates.I just don't get how CRC/CSH benefits long term.Short of whom ever is reading this being able to resolve my issue very soon, I will be shopping for another platform to process my 20 plus waiting list of clients waiting for me to get started."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DH",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T19:50:11.000Z",
          "Titre": "Violation of Federal Law?",
          "Contenu": "**𝐔𝐏𝐃𝐀𝐓𝐄** 4/21/2023My questions are genuine and designed to ensure that I do not start down a path that isn't legally viable. Your sidestepping and clear desire to avoid the question is concerning!There is still no clear answer here regarding the business model being promoted in your ads and on social media which is clearly designed to promote collecting fees immediately from clients upon signing them up for services.Simple Question: Do you promote Credit Repair Businesses collecting fees for services on an ongoing monthly basis?Simple Question: You clearly recommend that your trainees (customers) use \"Billsby payment solution\" for taking credit card payments because as you state \"PayPal, Stripe, and other common gateways cannot be used to receive credit repair payments or ACH Transfers for credit repair\" - WHY do these payments services not allow collection of payments for \"credit repair\"?FINALLY: These are valid questions that you as a company promoting this business model should be readily able and prepared to answer.**𝐔𝐏𝐃𝐀𝐓𝐄 𝐀𝐅𝐓𝐄𝐑 𝐂𝐎𝐌𝐏𝐀𝐍𝐘 𝐑𝐄𝐒𝐏𝐎𝐍𝐒𝐄**The response below completely sidesteps the issues in my review𝗙𝗶𝗿𝘀𝘁 & 𝗙𝗼𝗿𝗲𝗺𝗼𝘀𝘁This company deleted my question on its Facebook page and blocked me from commenting - WHY? was it to hide the Federal Law Question?NOTE: In their answer below they clearly place the responsibility upon any using their system to comply with the law𝐒𝐞𝐜𝐨𝐧𝐝The company does not answer the question about the Violation of Federal law under the Credit Repair Organizations Act which prevents the collection of up front fees which Credit Repair Cloud PROMOTES𝐓𝐡𝐢𝐫𝐝They have no telephone contact number and did not provide one in response to my review because they can't!--------------------------------------------------------𝐎𝐫𝐢𝐠𝐢𝐧𝐚𝐥 𝐑𝐞𝐯𝐢𝐞𝐰Looking for answers. The company has no telephone number so everything is through electronic communication. When I attempted to get answers on their social media platform they blocked me from commenting which basically provided me with my answer. Here's the question that the company wouldn't answer.In researching this opportunity I came across the Credit Repair Organizations Act (Federal Law). The Act bars companies offering credit repair services from demanding advance payment.How does this affect this business model?How do you structure a credit repair business that creates revenue and complies with the law?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark ODonnell",
          "Nb_Reviews": 3,
          "Date": "2023-02-10T16:08:31.000Z",
          "Titre": "Unable to get answers",
          "Contenu": "Unable to get answers, wasted my time doing research."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "arvall Lewis",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T23:51:00.000Z",
          "Titre": "They never verbally help me to achieve…",
          "Contenu": "They never verbally help me to achieve my goals within the 30 day!  So I didn't get the help I need."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wilson Financial Services INC",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T20:26:56.000Z",
          "Titre": "Credit Report Issues",
          "Contenu": "The Credit repair cloud does not work properly for some clients that has to pull the credit reports from idenity IQ. I have experienced the same issues for months, I'm not able to pull the credit reports after a client register in the portal  thats send and customer service is an email, not actually talking to someone However they respond quickly. This issue is ongoing, I'm not sure if they understand how to fix themselves."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David S.",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T00:08:31.000Z",
          "Titre": "I have a 821 credit score.",
          "Contenu": "I have a 821 credit score. Can anyone match that?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M.C",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T15:22:46.000Z",
          "Titre": "Paid client…",
          "Contenu": "I used this place after purchasing everything they had to offer due to assisting people with advice on the CRC on the Facebook community they removed me!!! I'm so pissed and will be speaking with a lawyer along with disputing my charges on an account who doesn't even want to help!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ramon McDuffie",
          "Nb_Reviews": 2,
          "Date": "2021-09-13T00:27:03.000Z",
          "Titre": "Smooth Sailing",
          "Contenu": "The CRC Software is very simple to follow that even a 3yr old can master its CRM. Due to the nature of a credit repair business; its imperative that a friendly user navigable system be implemented to reduce your time, errors, and resources. Thank you Daniel Rosen for providing us with the Credit Repair Cloud which makes our journey into the credit repair business a lot simplier!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Tipton",
          "Nb_Reviews": 2,
          "Date": "2022-04-12T16:57:51.000Z",
          "Titre": "Horrible experience",
          "Contenu": "I purchased 3 courses on Feb 8th 22 and never started the courses as I came under a life threatening, debilitating, car accident where a semi truck hit me on my way to work. I lost my job, car, and physically was injured. Desperate I remember I paid a good amount of money for the 3 courses and contacted CRC to request a refund and they denied my request saying it was more than 30 days since I had paid. Instead they opt to tell me don't worry you will have the courses for life! Heartless inconsiderate training company that only cares for more money in their own pocket! Stay away don't buy the upsells and tell your friends!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Seth Smith",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T19:02:58.000Z",
          "Titre": "Blatant Lies in Their Digital Marketing Efforts",
          "Contenu": "I've been doing internet marketing since it was being invented. 20+ years full-time.So trust me, I get it.I love Daniel and his story but boy has CRC gone off the deep end in believing that PURE DECEPTION IS OK BECAUSE IT'S JUST A PERSUASION TECHNIQUE.So disappointed in Oregon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Osmel Villarreal",
          "Nb_Reviews": 5,
          "Date": "2021-06-16T17:08:21.000Z",
          "Titre": "THIS IS A SCAMMER COMPANY",
          "Contenu": "THIS IS A SCAMMER COMPANY, I USED A TRIAL AND THEY KEEP USING MY CARD WITHOUT MY PERMISSION EVEN THAT THEY CONFIRMED ON THE EMAIL THAT MY ACCOUNT WAS CANCELLED.This is a very frustrating situation. They charge every month 179 from my credit card. Police report was filed against this scammer people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andraya Kent",
          "Nb_Reviews": 1,
          "Date": "2021-01-10T23:00:44.000Z",
          "Titre": "The only reason I’m giving a bad review…",
          "Contenu": "The only reason I’m giving a bad review is because I didn’t like how they handled me I reached out to the team letting them know that I’d had a catastrophic personal event and if I could get additional time in the program they emailed me saying no if I didn’t finish in the time allotted I’d have to purchase the course again when it’s available I think people and businesses should have empathy anyway but especially during a pandemic when most people have felt it’s effects other than that very informative"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tamara Torro",
          "Nb_Reviews": 1,
          "Date": "2020-08-23T21:15:57.000Z",
          "Titre": "I love this program-Thank you!",
          "Contenu": "I love this program.  They really care about your success. It is easy to follow and gave me new confidence in pursuing this business. The company provides a lot of information and support. It is very encouraging to find a company that gives step-by-step instructions to be successful!  Thank you so much!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lanelle H.",
          "Nb_Reviews": 1,
          "Date": "2020-12-04T16:43:25.000Z",
          "Titre": "A horrible experience. Better support needed.",
          "Contenu": "My experience went horrible fast. After the 14-day Challenge, which is actually 20 days, I decided not to take 6-week course for $997. This is when things turned for the worse. They blocked my FB posts in the community and took over 3 weeks to gain access to my existing client data. Trying to persuade me to spend $997, they spent 2 weeks of emails avoiding the issue. Then they upgraded my account and charged my credit card without authorization/permission. Getting support to respond in a timely manner makes their customer service horrible. No phone support. Very wary of their business practices."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "At Home FITNESS",
          "Nb_Reviews": 2,
          "Date": "2021-09-10T21:54:25.000Z",
          "Titre": "Spent hundreds of dollars and months of…",
          "Contenu": "Spent hundreds of dollars and months of my clients and my own time on this software and their letters that don’t work. I went through the certifications and paid money for the upsell which anyone with any marketing know how could tell you more about marketing than their program. Stay away from this company. It’s impossible to review them on Facebook and google and any thing you post on their crc group page on Facebook will get removed. Anything and I mean anything about the templates or even questions will get removed if it’s not in their “happy positive manor” which is a joke. He’s fake and just a actor selling software. Use dispute fox and save hundreds. Btw the millionaire club doesn’t use crc letters and they have used their own system of letters. Don’t be scammed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Greene",
          "Nb_Reviews": 1,
          "Date": "2020-03-08T06:25:04.000Z",
          "Titre": "You can never get a representative on…",
          "Contenu": "You can never get a representative on the phone and will have to wait for any questions they have not covered on their blog. Not a personal experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Friends Allies",
          "Nb_Reviews": 2,
          "Date": "2020-06-11T22:02:41.000Z",
          "Titre": "Software was confusing and could never…",
          "Contenu": "Software was confusing and could never get anyone to call me back to figure out how to use it properly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hemat",
          "Nb_Reviews": 4,
          "Date": "2022-05-09T15:45:04.000Z",
          "Titre": "lost",
          "Contenu": "lost to much upsell doing the same thing over and over again very frustrating"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T16:29:10.000Z",
          "Titre": "You don’t learn caca"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danny Garcia",
          "Nb_Reviews": 1,
          "Date": "2021-04-11T13:55:43.000Z",
          "Titre": "Lots of Flash, Terrible Service, Questionable Reviews",
          "Contenu": "I was very excited to enroll and even paid for their 14 day challenge. I was moving over from another service that has not aged gracefully and didn't have the bells and whistles of CRC.All started out great and they do a wonderful job of providing some of the basic training from within the 14 day challenge which will take up 2-3 weeks of your 30 day trial.If you are starting out with no clients the onboarding and doing your first client doesn't seem that bad. However if you have been in the business for any time at all and are wanting to move clients over they don't really train on that.I had questions, lot of questions..How do I bring my existing 200+ clients over manually?What happens if a client doesn't want to use one of the preferred monitoring services? How are files entered manually without disrupting existing clients with \"thanks for signing up emails\"?What happens and how do you handle future rounds?Can you send out different letters based on the results, if so how?I had these and lots of other questions. The only way to get answers was to email them. No chat support, extremely limited phone support. For me to get all my questions answered would probably take a month and I'll explain why below.I asked if i could talk to someone live as I just had too many questions. They said sure but each call would be limited to 15 minutes. I couldn't imagine I would be limited to 15 minutes \"for real\" so i made the appt.Call was scheduled for the next day at 1:00pm, I was waiting and didn't receive a call. I got a call at 1:10 and answered it and it wasn't them (it was a prospect) While i was talking they called about 1:20 I called back moments later and was told to reschedule the appt.I was upset as it was the caller that was late. I tried to complain via email and all they could do is apologize and setup another meeting a couple days later.I then knew that the 15 minutes was a hard 15 minutes and wanted to complain further and plead my case for more time.I emailed and even posted in the facebook group. The email was responded to within 24 hours with a form letter apologizing and offering the 15 minutesMy facebook post was quickly deleted with the reason that support questions are to be sent to support and not to the facebook group. Before the post was removed I received messages from several people saying the software was good but the service was terrible, 2 of which recommended going elsewhere before I got too deep.Prior to enrolling I did read reviews and most were very good and I used them to help guide my decision. I later found out that most of the reviews were probably incentivized as when I finished the 14 day challenge I was offered the following.Give us a review and the best review will get 1 free month of service ($179 value) and even if you are not the best review you will get a $49 credit. At the time I gave them a good review because I liked the promise of the software but had to rescind and replace once i knew the truthI now know why they got so many good reviews. I did stop everything and moved on to a different service that had all the same bells and whistles and after 2 weeks have experienced overwhelming customer service from the new company. and they are actually cheaperI think this company puts on a show during the trial period with just enough to get new people started knowing that moving and learning a new tool is very difficult. They probably push their training that includes 6 months of software to get you embedded even longer.I would say to stay away from this company if you want to be in the credit repair business long term, especially if you are a new business.BTW - I've been in the business full time for over 13 years and will be in it many more."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dana",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T16:56:37.000Z",
          "Titre": "Only good if you don't want actual…",
          "Contenu": "Only good if you don't want actual guidance, you won't be able to speak to anyone on the phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T15:54:57.000Z",
          "Titre": "Software still isn't working they email…",
          "Contenu": "Software still isn't working they email me and say its fixed ill go to the same page that they sent me and its not fixed they won't call me I asked them to so we can get it fixed and they they only want to email and it's still not fixed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 2,
          "Date": "2023-01-22T18:02:43.000Z",
          "Titre": "Honestly i feel as if i was scammed",
          "Contenu": "Honestly i feel as if i was scammed. this could have been taught in about 4-5 hours. super simple material. i feel i wasted 2 weeeks. i feel as if it was a way to drain 2 weeks from your 1st month of the software cost. i understand you have to pay for the software and its well worth it. too much stuff to promote crc. i suggest you buy software and learn clickfunnels"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Courtney",
          "Nb_Reviews": 2,
          "Date": "2023-01-28T12:37:42.000Z",
          "Titre": "Based off Option, Not Fact",
          "Contenu": "The book states a lot of opinion to be fact. It's great for learning how to make money in the business of credit repair, but not so much in \"changing live\". Which is the author's battle cry."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tina",
          "Nb_Reviews": 5,
          "Date": "2023-08-20T04:29:56.000Z",
          "Titre": "Needs Attention",
          "Contenu": "I signed up with incredible excitement. This company is legit with outstanding reviews. Upon signing up, they talk heavily about such a seamless process and their tech-support is always available and unfortunately that is not a fact and as of this writing I have yet to be helped appropriately I had software issues in the beginning I graduated yesterday I went to move into the master class when I went to buy the material  message pops up saying email address did not exist. My new business email which supposedly was changed did not exist nor did the email that I originally signed up with within their system exist . I called again and left a detailed voice message and instead of getting a return phone call I get a text message telling me the complete opposite of what the tech that told me before who supposedly changed my business address as primary . One of the technicians did not even know how to get around this software for this particular program, let alone help me with my issues. And within that same phone call expressing that I can’t purchase materials the tech didn’t even address that. I feel like most of their tech-support flippantly respond back and just shoot off a email without reading or comprehending the true nature of the problem with half the time in my situation required a telephone call. It has been an absolute nightmare. My question has been. What do they expect me to do with continuous ongoing issues that I have no control over it is coming from their side and there’s no human to talk to  no supervisor to request but yet I’m trying to build a business with this very company. In the Facebook group that you are participating in when you enroll I was called out on some of the life coaching calls because I was posting my issues asking for help and the only way I got help was posting them in the Facebook group and was called out for that. Not one of the administrators in my Facebook group even attempted to help Not in any way shape or form. Nobody did nothing still putting out there that I’m having these issues and have been ignored, and the one technician who shot back with an email that didn’t even resolve my issue. I am not seeing or feeling the level of support that I’ve heard when I first enrolled and went through this training. Their level of support is talked about repeatedly yet they don’t disclose it’s only done by texting and that does not always work and the fact that I cannot reach a human is beyond frustrating. At this point I am not heard and my issues are not being resolved. More issues are coming through and it’s not due to me. It’s due to their technicians whatever they’re not doing right is completely causing a huge ripple and my inability to move forward and practice what I just paid for within this course"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marshala K",
          "Nb_Reviews": 2,
          "Date": "2022-02-25T14:13:57.000Z",
          "Titre": "CRC Overall",
          "Contenu": "CRC, has a great product, however they lead you to assume your a getting a \"credit business in a box\" I understand that they have people from many different states buying into their product, however they should list the requirements for each state upfront."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tyrone Player II",
          "Nb_Reviews": 3,
          "Date": "2020-07-27T01:02:35.000Z",
          "Titre": "The support is horrendous and that is…",
          "Contenu": "The support is horrendous and that is putting it lightly. I am supposed to run a business where I am unable to contact a person for help. I have to send an email and wait days for a response. That is not the level of customer that I give my customers nor should I accept it in return. Even after you make a dispute on the same issue no one will call you they keep sending you different links or videos to try to figure it out. You also do not get a mentor you have to depend on the Facebook group for guidance. The original video said you would be provided a mentor not that Facebook would be your mentor it also said that you would be able to \"speak with support for help."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "anthony",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T12:52:05.000Z",
          "Titre": "the video's does not answer the…",
          "Contenu": "the video's does not answer the essential questions that I have about this business to my satisfaction"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T20:07:02.000Z",
          "Titre": "I like Daniel's passion to help people",
          "Contenu": "I like Daniel's passion to help people, help people. I like the software. I got a little lost implementing the process.  Also see challenges multiple times was very confusing.  The repetition of signing up, for onboardind, watching videos was very confusing.  I would say didn't I thus already. 14 days is a lot going on to remember, so when I git a request to sign up ot do something, I didn't remember until I started playing the video and it sound familiar.  I'm reading the book now and I plan to add my family. I added myself and didn't have any negative, and unspecified inquiries,  so I could not send out disputes. I appreciate this opportunity you have provided. When I get some money I will buy your $997 business starter, but currently I'm maxed out. But again tjus is a great opportunity to change lives and I am on board."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T15:38:24.000Z",
          "Titre": "Follow up on the next Challenge date",
          "Contenu": "I was interested in the Challenge, however I realized the holidays were right around the corner. Knowing this, I can easily assume it could continue immediately after the holiday season. I wish that someone could of reached out to confirm it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T19:55:36.000Z",
          "Titre": "Very thorough",
          "Contenu": "Very thorough. I wish the live calls were at more convenient times for those who work. I think evening 8/9pm would be helpful for people with kids, or jobs. I wish there was a way to speak with someone one on one to ask specific questions that may not have been clear or answered watching the trainings. Other than that, I appreciate all the resources provided"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T22:51:23.000Z",
          "Titre": "it was ok",
          "Contenu": "it was ok. basic. intro to sign folks up for the $997 program.  always need to be finding new customers & old customers fall off once helped. Didn't like it was suppose to be 14 days & turned it into 21 days. that's misinformation. the 1st week was a waste of precious time. stick to actually making it 14 days for folks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trusted credit hero",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T13:34:37.000Z",
          "Titre": "The first week was a complete waste of…",
          "Contenu": "The first week was a complete waste of time. I get the the whole thing about “Belief Week” but it wasn’t worth a weeks worth of time. The only week that was actually informational was the second week. The third week was completely chuck full of redundancies and replays of the same materials. I appreciate the opportunity but the course should more organized and have all steps in sequential order and make sure that we aren’t learning the old doftware but the actual up to date software."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cindee Day",
          "Nb_Reviews": 3,
          "Date": "2023-08-22T19:15:53.000Z",
          "Titre": "They were quick to respond however",
          "Contenu": "They were quick to respond however, the program was mis advertised.  You should only have to pay what the advertising says and not a ton of addons that could end up costing hundreds more.  I would have loved to try the program at the $47 advertised price but once you pay for that you are offered a bunch of addons that cost a bunch more.  Not only that, choosing one of the options caused my card to be charged twice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Unapologetically Pissed",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T22:28:16.000Z",
          "Titre": "I really like the engagement and the…",
          "Contenu": "I really like the engagement and the spirit of everyone, however I relaxed the lack of detail on some days and very little review. I think there was time that could have been well spent of details of topics instead of a snippet of the topic. This will help credit hero’s be better prepared when dealing with clients. Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "King Willie",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T22:42:50.000Z",
          "Titre": "It’s not too bad if you don’t have to contact customer service.",
          "Contenu": "The software is pretty good. But the customer service isn’t that good. It’s hard to get in contact with people to help you solve problems in a timely manner."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kisha",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T02:04:22.000Z",
          "Titre": "I would give 5 stars, but…",
          "Contenu": "I would give 5 stars, but my initial start with CRC did not start off well. I signed up for the 30-day free trial and in less than an hour, my account was cancelled. About 2 days later, I learned that an error occurred during a recent system update and cancelled some member accounts. It took a week to get it resolved. I can say that the support rep handling my help desk ticket was amazing. Ramario stayed in contact and kept me updated. The “clock” for my 30-day free trial was reset once I was able to log in.  My concern is that it should not take an entire week to fix a scripting error.  I know things can happen, but it’s not a good feeling not being able to access the system in 7 days. A day or a few hours top, but not an entire week."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joanna",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T04:48:34.000Z",
          "Titre": "I actually wish we spent more time on…",
          "Contenu": "I actually wish we spent more time on the drop down menu when disputing each item for some reason I need more help there and can't get anyone to explain them to me"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Claudia",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T19:31:55.000Z",
          "Titre": "It was all over the place to me",
          "Contenu": "It was all over the place to me. Too many emails on how to start the program. Multiple! Caused confusion for me. No real contact person other than email. Help via email was helpful. I felt it was confusion on steps to enroll. Once enrolled start steps to began only no other emails in regards to what’s free or training. Just get me started step 1 to step whatever. Then once started just contact phone or emails. The follow up on how things are going and any problems suggest training. Too much too fast up front. But I do think it’s a good program. What little I was able to comprehend.Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denard",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T20:58:45.000Z",
          "Titre": "Good but could use improvements",
          "Contenu": "I don’t feel it’s a bad program at all, but honestly the information was very confusing at times, because it was all over the place. First I was in the 14 day challenge, then the basic disputing course, then the software certification, and some other things. With so much jumping from section to section it became very difficult to understand where I was at sometimes. I was so confused that I fell behind ( due to frustration ) but I caught back up after I figured things out. On the other hand, the staff did a VERY good job at keeping me motivated and confident throughout the whole process. They actually made me believe I can get this done and I am determined to get it done. The motivational aspect of the program is very important. The best part of the program is when they actually started teaching you about the software, by going through the steps on screen. They made THAT part very simple to understand, and I am confident I can use it without guidance. I gave it 3 stars  not because I think the program is bad, but because it can use some improvements in the way they teach it. Other than that, I’m ready to start my credit repair business 💪🏾"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Javil",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T21:41:13.000Z",
          "Titre": "I would of given 5 stars BUT at the end…",
          "Contenu": "I would of given 5 stars BUT at the end of the challenge the certificate has my last name wrong. Should be Davis NOT David. No way for me to correct on my own. This is just a mistake that should have not happen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vickie",
          "Nb_Reviews": 1,
          "Date": "2022-09-18T22:09:36.000Z",
          "Titre": "I gave 3 Stars because I got stuck on…",
          "Contenu": "I gave 3 Stars because I got stuck on importing my credit score and this issue still haven't been resolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patsie",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T04:24:34.000Z",
          "Titre": "My account got deactivated because I…",
          "Contenu": "My account got deactivated because I didn't make the $179 payment because I didn't have it at the time I know they kept trying to swipe my car but at least I thought maybe that I can still keep my account but not use the services so when I had the money I was able to go and pay"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Whitney",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T00:34:33.000Z",
          "Titre": "I had a lot of great videos to watch…",
          "Contenu": "I had a lot of great videos to watch but am more of a live person learner. Especially with computer systems and questions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "McKinley Jones",
          "Nb_Reviews": 6,
          "Date": "2023-09-02T21:39:28.000Z",
          "Titre": "One on One definitely helps!",
          "Contenu": "I really wish there was hands on training!  Trust me when I say, technology is not my things!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T12:51:19.000Z",
          "Titre": "Paid $47 to be shown how to do the…",
          "Contenu": "Paid $47 to be shown how to do the stuff I was taught on the onboarding process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rufus",
          "Nb_Reviews": 5,
          "Date": "2023-01-21T19:06:59.000Z",
          "Titre": "I need some help on setting my website…",
          "Contenu": "I need some help on setting my website up and running"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 2,
          "Date": "2022-07-09T02:47:20.000Z",
          "Titre": "The training lacked two things",
          "Contenu": "The training lacked one critical facet and that is the law concerning credit repair. They say you can charge a monthly fee but that goes against the TSR. You are going to get a lot of people sued. You also didn't mention rebucketing in the curriculum which everyone should know about if they are doing credit repair."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marisa",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T15:44:57.000Z",
          "Titre": "I wish that there were more examples…",
          "Contenu": "I wish that there were more examples given for the topics reviewed for a better understanding of the actual Credit Repair as opposed to understanding the program.  And I was extremely disappointed that the end of the 14 days we were baited into the hour and 45 minute \"Live Master class\".  It is a prerecording and It is a one hour and forty five minute infomercial of why you need to buy the master class.  It wasted over an hour of my workday that I could have dedicated to working or actually doing further education in Credit repair.  Not watching a commercial."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T13:47:40.000Z",
          "Titre": "Awesome program I just wish I could…",
          "Contenu": "Awesome program I just wish I could have gave it more of my undivided attention. The knowledge is in abundance for sure. You just have to be ready for it and don’t think your going to become an overnight success. Credit repair takes time and so does building any business so my advice is so this on the side until it grows out of control. Then full time along with other products and services. Great program over all though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 2,
          "Date": "2022-05-03T18:02:02.000Z",
          "Titre": "The concept is good",
          "Contenu": "The concept is good, the system is great, but the sales emails are extreme. CRC sends 5+ upsale emails daily. I was getting emails asking me to sign up for the 14 day challenge although I was already signed up. The 14 day challenge consist of 3 topic, I signed up thinking it would be beneficial to me as I am new to CRC, wrong! 2 of the three topic that is taught in the 14 day challenge I had already completed from the free education and already had my certificate. This was a complete waste of money and due to this I will not be buying any \"upsells\" CRC offers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Triniece T",
          "Nb_Reviews": 1,
          "Date": "2020-05-16T03:29:40.000Z",
          "Titre": "I love the system it’s a bit expensive…",
          "Contenu": "I love the system it’s a bit expensive but I mean I payed for it last month and this month I just feel for me not having as many clients it’s hard to pay almost $200 for the system. I love the fb group it’s very helpful. The credit repair challenge I feel was more for someone who has never done credit repair."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maude",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T04:14:50.000Z",
          "Titre": "It is good information",
          "Contenu": "It is good information, just not well presented. The presentation made it hard to follow along in a systematic way. I was left feeling as if I missed half of the material."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lynnette",
          "Nb_Reviews": 2,
          "Date": "2022-05-25T00:31:57.000Z",
          "Titre": "I love this program!",
          "Contenu": "I love this program. My only concern is that my learning ability takes more one on one and direct training as opposed to group virtual. But yes this opportunity is fabulous!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ashma Miah",
          "Nb_Reviews": 1,
          "Date": "2019-11-13T23:30:20.000Z",
          "Titre": "What I appreciate about Credit Repair…",
          "Contenu": "What I appreciate about Credit Repair Cloud is the sharing of knowledge,  experience and information needed to help novices to the industry learn and utilize resources.  I took off a star because the monthly cost of the cloud is expensive for me as a new business.A.Miah"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2020-07-17T20:18:44.000Z",
          "Titre": "Poor customer service",
          "Contenu": "I've owned my own credit repair company for 15 years.  Wanted to automate things since we continue to grow.  If you import credit reports through IdentityIQ or the other companies they recommend, be aware that the dispute letters that you generate will not list the name of the collection company furnishing the data.  Instead, they'll list the original creditor (hospital, doctor's office etc).  After waiting 5 days for an answer on this from customer support, I was told that the only way to work around that is to manually change the letters, which completely defeats the purpose of speeding up the dispute letter creation.Poor customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sam Palumbo",
          "Nb_Reviews": 9,
          "Date": "2022-06-14T20:23:58.000Z",
          "Titre": "The course was good for beginners",
          "Contenu": "The course was good for beginners. However, I had a few issues and I believe that they do not practice what they preach."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christina Blackburn-Wanko",
          "Nb_Reviews": 5,
          "Date": "2019-11-12T02:53:19.000Z",
          "Titre": "I like the cloud, I don't like being double charged with no refund",
          "Contenu": "I really enjoy using credit repiar cloud. I only gave it 3 stars instead of 5 because i wish they were a bit more user friendly and I also wish they would not have double charged me for 4 months by calling me and telling me my credit card on file needed updated. I told them it should be on auto-pay and they said my card didn't go through so maybe it is expired or something. In efforts to avoid my account being shut off and losing all my current clients, I hurriedly gave them a new card. Come to find out, this opened a new account for me and I was being charged on both accounts now. When I called and explained the situation, they said, sorry, you only have 30 days to dispute a charge and since its been so long (4 months before I noticed) we will not refund the entire 4 months. I explained that They could see that I was not processing clients through the secondary account and had been plenty busy on the original account and that should prove that it was not opened purposefully. They have stuck with the fact that I didn't let them know within 30 days so I was stuck paying it. They agreed to refund 2 months of the fees. I'm still waiting for a call back from a higher up. Higher than the supervisor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pamela Williams",
          "Nb_Reviews": 1,
          "Date": "2020-06-08T15:47:44.000Z",
          "Titre": "Credit repair cloud really help me…",
          "Contenu": "Credit repair cloud really help me understand about the in and out about credit repair business"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeremiah Garcia",
          "Nb_Reviews": 2,
          "Date": "2022-01-22T06:46:46.000Z",
          "Titre": "The information was great",
          "Contenu": "The information was great. I learned a lot and it help me set up about 75% of my business. More time is needed to go over the merchant accounts and billing.  After all, although we are in this to help others out in every way that we can, we cannot continue to support ourselves if our business is not making a living profit. I was also not happy with belief week. While I get it that some people need the help to believe in themselves, I do not think it needed a full week. I almost asked for a refund after the 2nd day because it felt like an MLM seminar and I am not looking to join one. I am very glad that I didn't ask for one now that I have finished the course. Although the Referal Program was mentioned for the Credit Hero Challenge, I feel that more time could have been put into the training side of this. It would have been a great way to create income as people went thru the 14 day challenge. If belief week started as a day or two and then transitioned into teaching how to market the course as a way to \"earn while you learn\" over the next 14 days, I believe it would have been a 5 Star course. Finally, I wish that more time would have been spent in setting up the payment side of the software. It seemed that in the Software certification course it showed Billsby and then breezed on past how to actually set up and what the process needed to be to get approved for a merchant account and then the a billing account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angela Hurns",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T03:39:19.000Z",
          "Titre": "This is was a nice class.",
          "Contenu": "This is was an okay class, I would recommend it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VILMA RIVERA",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T07:43:32.000Z",
          "Titre": "RATHER KEEP COMMENTS"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T03:32:13.000Z",
          "Titre": "Video learning is always great",
          "Contenu": "Video learning is always great, but I was a little confused because it felt like at times, I was being pitched for something I've already ordered.  How ever the content was helpful, but I wish it could have gone in depth about what you could do to a person's credit to have an adverse effect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wesley",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T09:50:07.000Z",
          "Titre": "The credit challenge was very inspiring…",
          "Contenu": "The credit challenge was very inspiring and definitely helps to keep your entrepreneurial spirit up. It gives realistic expectations and not just hype! It’s a must need, just wish this was a mandatory expectation to take in the beginning of getting started."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "victor",
          "Nb_Reviews": 2,
          "Date": "2023-01-21T05:41:19.000Z",
          "Titre": "The instruction was good",
          "Contenu": "The instruction was good. I bit confusing having the to go to the 14 day website and Facebook. I was confused for the first 2 weeks but I finally caught on.  Also not happy with your site I signed up had it running for 3 days and from that point it has been down. There isn't a photo number for support on the site. I finally got a reply back from credit repair site saying that the 3rd party partner is working on it due to some members having bad files but it's been way to long in my opinion since I bought something that isn't working. Plus that's the avenue to generate leads."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T19:55:41.000Z",
          "Titre": "How Can Anyone Fail!",
          "Contenu": "Great product! Danial, the content u put out is unmatched! U have motivated me in so many ways in such a short amount of time...all from me researching how to fix my own credit and I eventually came across u and ur product Credit Repair Cloud. I have mentioned before, with the content u put out...how can anyone fail!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ivan",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T22:55:29.000Z",
          "Titre": "I like the progressions of the course",
          "Contenu": "I like the progressions of the course.  The only problem I had was that I invested into the full course and resources offered in the seminar and you loose continuity of the training.  By that I mean I started the masterclass before the challenge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sabrina",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T21:45:47.000Z",
          "Titre": "Low customer service",
          "Contenu": "You all need to improve on direct customer service. Videos are not always the answer plus it takes longer to resolve a issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathaniel Wright",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T05:25:36.000Z",
          "Titre": "Lot to learn but excited about the…",
          "Contenu": "Lot to learn but excited about the knowledge I've attained. Instruction at times seemed a little rushed but overall it was good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Alan Junior",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T04:45:48.000Z",
          "Titre": "Really helpful but the audio is a…",
          "Contenu": "Really helpful but the audio is a little muffled it was hard to hear but other than that very helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valerie",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T06:49:49.000Z",
          "Titre": "Perfect platform",
          "Contenu": "Perfect platform to start ur own business"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T20:08:16.000Z",
          "Titre": "The 14 Day schedule is difficult but",
          "Contenu": "The 14 Day schedule is difficult but, worth it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracy Tippett",
          "Nb_Reviews": 3,
          "Date": "2023-07-15T11:22:06.000Z",
          "Titre": "Good Group but",
          "Contenu": "Good Group but, be prepared for endless marketing and questionaires."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shaniquea",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T18:11:48.000Z",
          "Titre": "This course gives an overview of what…",
          "Contenu": "This course gives an overview of what credit repair should be. It's a great price and is a great product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Z Shell-Thoms",
          "Nb_Reviews": 5,
          "Date": "2022-08-07T11:53:03.000Z",
          "Titre": "Insightful but more money is needed outside of $47.",
          "Contenu": "For the most part, love the program! had some issues navigating through some of the courses. I will say, I wish there was an ultimate package that includes all courses so I don't feel nickel and dime.  At the same time, piecing out courses are good for affordability, if someone can not pay all at once. Options are good is my point."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Candyce",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T18:08:03.000Z",
          "Titre": "Excited",
          "Contenu": "It was a very good program to finish I would have like a bit more detail with particular things that you will see on the audit. Like when I reviewed my own credit report, I didn't understand particular things. Like how the duplicate process goes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vicky Vic",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T03:05:12.000Z",
          "Titre": "great program for first timers",
          "Contenu": "great program for first timers ! I learned so much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daisha Hoppin",
          "Nb_Reviews": 3,
          "Date": "2022-05-31T16:14:58.000Z",
          "Titre": "The bottom line",
          "Contenu": "I was under the impression that there wouldn’t be a large start cost to be a credit repair hero. I am still very pleased with the program, I will just have to rethink my methods in paying for the monthly fees for the dispute letter generation software and the website, as well as the CRC monthly fee.I would still recommend this program to anyone interested in becoming a Credit Repair Hero."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Montgomery",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T18:45:33.000Z",
          "Titre": "I had a good experience with the credit repair cloud training.…",
          "Contenu": "I had a good experience with the credit repair cloud class.  Sometimes there was some delay in the videos or where to look for them.  However, the context was really good and understandable.  My wife and I will be moving forward to begin our business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T05:56:08.000Z",
          "Titre": "This is just a review of the free book, not the course itself",
          "Contenu": "It was informative and easy to read and understand. Had to give it 4 stars since there is a section on proofreading and there is literally an error in the title on the back cover and a few others sprinkled throughout. Just sort of makes the book lose credibility when the cover isn't proofread by anyone.But still, it's a great resource of information despite this. Just my honest opinion. I would still highly recommend it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "credithero",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T05:26:41.000Z",
          "Titre": "Master class was overall good and can…",
          "Contenu": "Master class was overall good and can use a lot of cutting out since there was a lot of repetitive info that can be found on podcast and free tutorials online and YouTube videos. I don't think the amount of money paid was worth while. The credit hero challenge was a waste of time since master class was started before and was well done and credit challenge was beginners level."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynnette",
          "Nb_Reviews": 2,
          "Date": "2022-04-18T07:15:30.000Z",
          "Titre": "May be Consider more flexible direct contact in training.",
          "Contenu": "I am ADHD, so learning takes me 3 times longer unless I am working with someone directly. It was very hard to actually get a person directly to answer questions. Overall, the program is OUTSTANDING!!! But personally, I am still struggling with getting everything in line."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 4,
          "Date": "2022-01-08T13:34:06.000Z",
          "Titre": "A lot of smoke , little fire",
          "Contenu": "I enjoyed the course. I believe it was too drawn out. To much hoopla and not enough bang. It’s borderline Pyramid scheme. Just enough but not the real stuff. I believe everything I seen in the challenge I already had done on my own in the program in a couple of days before the challenge. This program talks about transparency but has obscure glass. You are so very vague with your deliveries , everything is there but they’re silhouettes. Transparent but obscure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emmeal",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T18:13:38.000Z",
          "Titre": "I've enjoyed the classes",
          "Contenu": "I've enjoyed the classes, the certifications, it was all very informative, completely step by step understandable. The only downfall for me, but I stuck in there, was the misleading to purchase other things (funnel), offer up free to lead me to purchase, things you know I'll need to help me. Here's the thing, that all works, being upfront does also. Offer everything you have to offer that everyone will need, let them choose the package, but always have an upgraded package for those who want to go a little further."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JoeandRobin",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T18:36:26.000Z",
          "Titre": "Very thorough information",
          "Contenu": "Very thorough information. Presented very well. I got lost a little however, with so much info coming to me from so many different directions. But, I did find as long as I just stuck with it, things would work itself out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOHN",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T20:27:52.000Z",
          "Titre": "Quick and spread out",
          "Contenu": "Quick and spread out. Lots of up selling, but that's business. Great course."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paula Young",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T17:53:24.000Z",
          "Titre": "What I liked most about the credit hero challenge",
          "Contenu": "What I liked most about the credit hero challenge was belief week, so many times we are own worst enemy.  I wasn't expecting that and it was very needed. Isaac is very encouraging.  The challenge was informative and ability to ask detailed questions in the Facebook chat was amazing.  The challenge is a great way to get started and face your fears."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donae",
          "Nb_Reviews": 1,
          "Date": "2020-07-25T05:39:17.000Z",
          "Titre": "Credit hero challenge was great !",
          "Contenu": "The credit hero challenge was great, the trainers were very informative & really good at what they do. I learned a lot of valuable information to be able to help many people in my community. The trainers are great about making sure you succeed and giving your the right information. I was able to connectt with great people who also had the same interests. I would definitely recommend CRC !"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Lorena Gonzalez",
          "Nb_Reviews": 2,
          "Date": "2021-02-01T04:34:43.000Z",
          "Titre": "Thank you!",
          "Contenu": "Thank you!I did not know anything about credit reports, etc.  so I decided to start the course  thinking what a wise man said:   \"if you want to learn something new, it´s better to have your mind/bowl empty and clean \". Thank you for your patience, expertise and emphaty... you all are just amazing!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina Jackson",
          "Nb_Reviews": 1,
          "Date": "2020-03-24T22:39:53.000Z",
          "Titre": "For anyone looking to start and grow a…",
          "Contenu": "For anyone looking to start and grow a credit repair business, i truly recommend the Credit Hero Challenge to jump start you.  It’s full of everything you need. From motivation to business support. All the tools and training is available to you.  You will not be left wondering what’s next.  All aspects of the credit repair business will be covered.  So go for the challenge and become a “hero”"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cherri Harrell",
          "Nb_Reviews": 2,
          "Date": "2020-04-21T19:04:09.000Z",
          "Titre": "Great resource for getting your…",
          "Contenu": "Great resource for getting your business started. A lot of the information is very repetitive which is annoying but over all the quality and information provided is worth it. I was already very familiar with credit repair but still I learned a few new things I did not know and learned how to properly get started. I loved it and have decided to purchase the full software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nyon Allen",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T16:55:24.000Z",
          "Titre": "The Credit Hero Challenge is awesome!!",
          "Contenu": "The Credit Hero Challenge is awesome!!! It has absolutely changed my life and allowed me to go after my passion for helping people! It was very affordable, the lessons were organized and, the trainers answered almost every question that web had. This is the beginning. Step by step lessons, tools youll need to become successful, every step of the way!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noname",
          "Nb_Reviews": 2,
          "Date": "2021-01-11T05:43:50.000Z",
          "Titre": "Credit Hero Challenge Review",
          "Contenu": "Just completed the 14 day Credit Hero Challenge & Credit Repair Cloud is a great program for anyone wanting to learn about credit; whether it's to learn how to fix your own credit or how to begin your own credit repair business.  This program is user friendly and makes things so simple. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leslie Rowls",
          "Nb_Reviews": 2,
          "Date": "2020-01-29T07:48:02.000Z",
          "Titre": "Straightforward and Organized",
          "Contenu": "The training is very straightforward and organized.   It covers various topics that will definitely get you going as a Credit Repair Specialist.   The only reason I did not give a 5 is because I didn't pick up any specific strategies.   I received a great overview, but many clients have unique situations and I would have liked to learn more in the book!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2019-11-14T06:24:51.000Z",
          "Titre": "Great service!!!",
          "Contenu": "Great service!! You get so much information and it can be overwhelming. I wish the learning was bit more concise and focused. The Facebook group is great but I would prefer a forum with FAQ instead asking questions that were probably answered several times before.  Overall I love the service but needs a work on making the education a little easier to digest."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Floyd",
          "Nb_Reviews": 1,
          "Date": "2019-11-12T22:09:59.000Z",
          "Titre": "Quick Review of Credit Repair Cloud",
          "Contenu": "Quick Review of Credit Repair Cloud: I like the contents of the Credit Repair Cloud, I like the people as well, but as far as additional training and returning calls Back for questions or help has been somewhat of a struggle from Admins, which makes you start slacking in your business after you have spent a lot of money and time to invest in this business. That why I gave it 4 starsimage0.jpegM. Floyd🌹A Step Above Credit Repair"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amilca Leveille",
          "Nb_Reviews": 1,
          "Date": "2021-03-05T16:10:17.000Z",
          "Titre": "Hi everyone",
          "Contenu": "Hi everyone. This is Amilca Leveille form Florida. I enrolled at credit Hero Challenge a couple of weeks ago and I'm really excited about what I learned from this training. Now, I feel very confident that I can help a lot of people with bad credit and make a lot of money helping them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sallie Harbor",
          "Nb_Reviews": 2,
          "Date": "2022-03-10T16:21:41.000Z",
          "Titre": "Its a great software",
          "Contenu": "Its a great software. I wish there were templates that werent the same as other softwares. We need a quillbot built in to change the wording around to make the letters for unique for each client."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lionel Weathers",
          "Nb_Reviews": 2,
          "Date": "2020-10-21T16:27:34.000Z",
          "Titre": "If you want to fail SKIP pass this...",
          "Contenu": "I recently completed The Credit Hero Challenge. Honestly, they take the guesswork out of everything. They give you an easy to follow step-by-step process. From how to dispute items, to finding test clients, what to say and do when you get a test client, to closing and converting those test clients into paid clients and using those clients to generate more paying clients so you don't have to spend tons of money on advertising. Everything is here! I waited over 6 months to take the challenge. Boy! I wish I would've done it sooner.  My advice to you: Do it now! Let's be the next success story."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kayleigh Fairchild",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T16:18:28.000Z",
          "Titre": "I have learned so much from this…",
          "Contenu": "I have learned so much from this challenge. it has taught me things about credit my family never did. I am more confident opening up my credit repair business with all the support and mentorship I have received.   thank you CRC!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kta",
          "Nb_Reviews": 2,
          "Date": "2019-11-15T17:30:42.000Z",
          "Titre": "The software is great easy to use…",
          "Contenu": "The software is great easy to use pretty easy to understand is just kind of difficult when you have questions you have to wait for someone to email you back and it could be a lot of emails if someone doesn't listen or Andr stand your question farrelly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 4,
          "Date": "2020-05-08T20:55:12.000Z",
          "Titre": "Short experience but very good. I was impressed.",
          "Contenu": "I got a trial membership to look at all of the details and everything but decided I did not have proper time at the moment to dedicate to the business. Had a little bit of website trouble canceling the trial membership and was rather concerned. I’ve not had much luck in several years opting out of trial memberships and services online. I am very happy to report they resolved it the next afternoon, and I was very pleasantly surprised. That said, the software and methods for the business are solid. I just do not have the time right now to dedicate to it but hope to in about a year. Will definitely be revisiting them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rhonda Allen",
          "Nb_Reviews": 2,
          "Date": "2019-11-16T04:20:53.000Z",
          "Titre": "Great Company!",
          "Contenu": "Great Company!! Great Course!! Great Software!! I took the course Credit Repair Business Essentials Course and it gave me the knowledge and step by step instructions on starting my own Credit Repair Business. I am grateful for the CRC Team!! Thank you!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alicia Johnson",
          "Nb_Reviews": 1,
          "Date": "2020-12-12T04:04:32.000Z",
          "Titre": "Great course",
          "Contenu": "Hi my name is Alicia and I’m from Chicago and I took the credit hero challenge and learned amazing things and the content was broken down to the simplest forms and I loved the worksheet provided. I hope to start my buisness after this"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lado Jurkin",
          "Nb_Reviews": 3,
          "Date": "2020-07-03T01:47:47.000Z",
          "Titre": "My name is Lado Jurkin I came way from…",
          "Contenu": "My name is Lado Jurkin I came way from Sudan live In Austin for 21 years I believe to change people for improvement and transformation for better tomorrow that is why I want to see those faces in financial freedom make me HAPPY INDEED."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glen Harrison",
          "Nb_Reviews": 1,
          "Date": "2019-11-15T17:55:24.000Z",
          "Titre": "CRC is doing a great job building their…",
          "Contenu": "CRC is doing a great job building their product for our industry, there are just some more key features we would like to see on the sales side, which is the reason for the four stars, but other than that we've been very happy with them"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam Palumbo",
          "Nb_Reviews": 9,
          "Date": "2022-05-26T06:11:44.000Z",
          "Titre": "Grea5 book and program",
          "Contenu": "Great book and program, however,they have a Facebook group. Which is nice, yet they gave me permission to post something and then kicked me out for posting it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Toni P",
          "Nb_Reviews": 1,
          "Date": "2021-04-23T03:56:07.000Z",
          "Titre": "This is a minor financial investment…",
          "Contenu": "This is a minor financial investment with tremendous upside and plenty of resources to drive your success! It's a bargain compared to other turnkey business opportunities and the market demand is always there."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cornealius Brown",
          "Nb_Reviews": 2,
          "Date": "2021-11-14T23:28:25.000Z",
          "Titre": "Nice Platform, but could do more.",
          "Contenu": "Nice platform, but I wish there were more advanced strategies due to credit repair agencies always changing their strategies. Overall though, CRC is good for organization and basic disputing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James J Gordon",
          "Nb_Reviews": 1,
          "Date": "2020-06-13T11:50:24.000Z",
          "Titre": "This challenge gets you up and takes…",
          "Contenu": "This challenge gets you up and takes away the excuses.  If you are stuck and dont know where to start, right here.  You will learn the basics and get the confidence to go after your first client.  As Nike says just do it!!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Turner Nata",
          "Nb_Reviews": 1,
          "Date": "2019-11-15T02:34:41.000Z",
          "Titre": "The software is a good software",
          "Contenu": "The software is a good software. The things I suggest that they bring to make it great is live people for phone support instead of email or ticket support only. Also, the software needs a lot more automations already built into it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BriTina",
          "Nb_Reviews": 1,
          "Date": "2019-11-15T18:01:56.000Z",
          "Titre": "Easy Access Great Support",
          "Contenu": "Easy to access, thorough explanations of programs and detailed support. The only reason I have not given 5 stars is because I am still in the process of launching my business, and I haven’t used everything the program offers."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Kirsten W",
          "Nb_Reviews": 2,
          "Date": "2020-05-02T00:18:47.000Z",
          "Titre": "Credit repair cloud is one of the best…",
          "Contenu": "Credit repair cloud is one of the best just that I needed my credit repaired so I come across redhawkeye you can check his contact on my profile he gets my credit repaired within 48 hours and cleared my criminal records"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2019-11-13T17:31:03.000Z",
          "Titre": "I was a Credit Consultant in the 90's…",
          "Contenu": "I was a Credit Consultant in the 90's and we did not have the Internet or CRM software.  The advancements by Credit Repair Cloud have improved the landscape and contribute immensely to the legitimacy of this industry."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Velve McKinnie",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T00:39:23.000Z",
          "Titre": "just join",
          "Contenu": "I am just joining the team so I cant rate the team fairly at this moment. In the future I will be more imbedded in the company and my review will reflect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray",
          "Nb_Reviews": 1,
          "Date": "2020-02-24T16:21:51.000Z",
          "Titre": "The course is great for getting…",
          "Contenu": "The course is great for getting started.  I'd recommend anyone wanting to get started in a credit repair business to use it. Giving you a basic understanding of what credit is..and how you can repair it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TS",
          "Nb_Reviews": 1,
          "Date": "2021-05-02T15:15:17.000Z",
          "Titre": "#CreditHero",
          "Contenu": "This is definitely worth the time and effort you put in.  It makes things a little bit easier and helps you progress in your endeavors.  The support is also there when you need it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheri",
          "Nb_Reviews": 2,
          "Date": "2022-05-16T19:54:53.000Z",
          "Titre": "Great information",
          "Contenu": "Great information.  The workflow was problematic, suggesting that CRC does not have a rigorous testing process / lack of QA department."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Krista",
          "Nb_Reviews": 2,
          "Date": "2020-12-01T21:17:45.000Z",
          "Titre": "Thorough Team",
          "Contenu": "This course is informative and they are very helpful. The team is amazing. If you have any problems or issues the turnaround time to resolve the matter is expeditiously."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andres Barreto Franco",
          "Nb_Reviews": 4,
          "Date": "2021-10-19T18:28:38.000Z",
          "Titre": "Honest review",
          "Contenu": "The Master class is good but i feel like they are not 100% honest. They make it look like its easy and takes no money to setup this business.It takes a lot of work to just do the whole setup and you also need to have 3-5k available to invest.CostsCredit cloud software $179 a monthlyAdvertising tools $200 monthlyWebsite $20 monthlyMerchant acc $30 monthlyLlc $500-800 one timeBond $1000-$3000 or more. One timeMarketing budget $200-$300 monthlyMarketing materials $100 one timeBusiness insurance ? No idea but you cant skip this one.Return of investment will take time and hard work. Take it slow, constant work and patience and you may get positive results in a few months of starting this business. Dont expect to make thousands overnight.PS I saw in their facebook group people complaining about the $600 cancelation fee. They told me once you pass the 30 days you are in a contract for 2 years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erick",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T22:12:30.000Z",
          "Titre": "GREAT PROGRAM",
          "Contenu": "GREAT PROGRAM! teaches you all the basics needed to get started. The FB lives are great motivational videos to keep you going! keep up the good work CRC!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Theresa Saucedo",
          "Nb_Reviews": 1,
          "Date": "2019-11-14T19:28:25.000Z",
          "Titre": "Return Credit Repair User",
          "Contenu": "We using started Credit Repair when we were using a disc (some years ago) I still have it!  We are excited to start helping our clients reach their credit potential"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T18:57:52.000Z",
          "Titre": "It was good for beginners in business",
          "Contenu": "It was good for beginners in business. I really am excited about the software portion. It was a great investment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T23:22:21.000Z",
          "Titre": "This is the first course I have taken…",
          "Contenu": "This is the first course I have taken and feel like I can go and put right into practice without any more immediate instructions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharice Thomas",
          "Nb_Reviews": 1,
          "Date": "2019-11-15T16:43:02.000Z",
          "Titre": "I experience the Masterclass that…",
          "Contenu": "I experience the Masterclass that includes access to CRC. Learned how to start and manage business, there are a lot of helpful tools and information."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cherisse",
          "Nb_Reviews": 1,
          "Date": "2021-06-26T04:34:50.000Z",
          "Titre": "I'm grateful to have the opportunity to…",
          "Contenu": "I'm grateful to have the opportunity to learn and gain knowledge in this industry im so ready to start my business 🙌"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JENNY THOMPSON",
          "Nb_Reviews": 1,
          "Date": "2020-02-06T12:20:35.000Z",
          "Titre": "Credit Repair Cloud",
          "Contenu": "I like credit repair cloud. Lots of information, videos, step by step instructions. I have encountered a few awesome customer service reps,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marcia Staples",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T04:59:26.000Z",
          "Titre": "The training is great",
          "Contenu": "The training is great!  The information is delivered at a reasonable pace and was easy to understand and follow.I am now CRC certified!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Micah Gordon",
          "Nb_Reviews": 1,
          "Date": "2019-11-11T21:26:24.000Z",
          "Titre": "Credit Repair Cloud is amazing",
          "Contenu": "Credit Repair Cloud is amazing. It is user friendly and extremely effective. There is not a better credit repair software. I guarentee it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "K",
          "Nb_Reviews": 1,
          "Date": "2019-11-11T20:24:15.000Z",
          "Titre": "Credit Repair cloud will have you on 10!!!",
          "Contenu": "Credit Repair cloud will have you on your way to correcting your family’s reports once you ace obtained creditable letters to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cornell Kelly",
          "Nb_Reviews": 2,
          "Date": "2022-07-07T04:34:13.000Z",
          "Titre": "The training was very good and they…",
          "Contenu": "The training was very good and they broke it down to where you understand everything ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robbi Marlett",
          "Nb_Reviews": 1,
          "Date": "2020-05-30T04:25:15.000Z",
          "Titre": "I have came to the conclusion that…",
          "Contenu": "I have came to the conclusion that Credit Repair Cloud is your one stop credit repair management system with the added bonus of in-depth training to instill users are able to understand use 100% of the software. It is user friendly and easy to navigate through. The training videos are clear and concise. The 14 day challenge was comprehensive and very informative. It helped boost my confidence in being able to start a credit repair business. I enjoyed the FB group too because I was able to see all the issues people were having and see the answers to some of my own questions. I am excited to embark on my credit repair business journey and I pray this the journey God has led me too. I believe I have what it takes to be apart of the millionaire club. I am excited for the opportunity to hopefully join the master class. And really step up my knowledge of the credit repair world. Thank you for this training and opportunity to expand my knowledge in credit repair and making a software that works not just for me on the backend, but my potential clients."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie Currie",
          "Nb_Reviews": 1,
          "Date": "2019-11-17T01:03:06.000Z",
          "Titre": "Ease of Use",
          "Contenu": "Bought the Credit Repair Cloud program in October,  not only is it informative it is also very easy to perform the software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven L.",
          "Nb_Reviews": 2,
          "Date": "2020-05-20T13:14:52.000Z",
          "Titre": "Very informational...was skeptic at…",
          "Contenu": "Very informational...was skeptic at first but I am learning a ton about the credit industry and how to fix my score."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyesha Tilghman",
          "Nb_Reviews": 1,
          "Date": "2020-09-01T18:42:56.000Z",
          "Titre": "Credit Repair cloud is a very easy to…",
          "Contenu": "Credit Repair cloud is a very easy to follow its very informative. Take you step by step through the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Machell Wright",
          "Nb_Reviews": 2,
          "Date": "2020-10-02T20:15:29.000Z",
          "Titre": "The training is easy to understand",
          "Contenu": "The training is easy to understand. I hope to be able to help others as well as build a thriving business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luke Hood",
          "Nb_Reviews": 2,
          "Date": "2021-10-05T00:57:36.000Z",
          "Titre": "If they would have  same day on the…",
          "Contenu": "If they would have  same day on the phone customer service I would have gave them 5 ⭐"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "L B",
          "Nb_Reviews": 1,
          "Date": "2021-01-01T22:08:49.000Z",
          "Titre": "This is a great way to invest in…",
          "Contenu": "This is a great way to invest in yourself while receiving alot of information doing it...."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashina",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T14:53:22.000Z",
          "Titre": "Phenomenal Software",
          "Contenu": "This is a phenomenal software. It's extremely easy and user friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2023-01-07T01:42:01.000Z",
          "Titre": "Great experience overall",
          "Contenu": "Great experience overall. No complaints."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A.T.M.F",
          "Nb_Reviews": 1,
          "Date": "2019-11-11T19:01:33.000Z",
          "Titre": "Really good software",
          "Contenu": "Really good software. Always making updates to help business flow more efficiently."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mecheal",
          "Nb_Reviews": 2,
          "Date": "2022-07-27T12:26:12.000Z",
          "Titre": "Support is always willing to help with…",
          "Contenu": "Support is always willing to help with questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maddy",
          "Nb_Reviews": 2,
          "Date": "2020-12-21T06:09:16.000Z",
          "Titre": "Course is undeniably among the best…",
          "Contenu": "Course is undeniably among the best I've taken. I highly recommend it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Garland Sr.",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T21:23:55.000Z",
          "Titre": "Good",
          "Contenu": "Good, but a little challenging. Easy to use. Will recommend Trustpilot"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathaniel Knight",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T22:40:10.000Z",
          "Titre": "This was easy and simple to learn thank…",
          "Contenu": "This was easy and simple to learn thank you very much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daeson Sanchez-Kuster",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T23:26:37.000Z",
          "Titre": "Informative",
          "Contenu": "Informative, engaging, user friendly, and easy on the eyes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rieta Williams",
          "Nb_Reviews": 2,
          "Date": "2020-06-30T23:25:58.000Z",
          "Titre": "Enjoying the experience and I learned a…",
          "Contenu": "Enjoying the experience and I learned a lot regarding credit repair"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jade Tinner",
          "Nb_Reviews": 1,
          "Date": "2020-08-24T13:53:13.000Z",
          "Titre": "Become a Credit Hero!",
          "Contenu": "Great overview of credit repair software and onboarding process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 1,
          "Date": "2022-05-28T15:57:43.000Z",
          "Titre": "Wonderful experience!",
          "Contenu": "Wonderful experience!!  Very knowledgeable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindia Carrion",
          "Nb_Reviews": 2,
          "Date": "2022-05-27T04:51:42.000Z",
          "Titre": "I learn a lot",
          "Contenu": "I learn a lot. Thank you so much 😊"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shamika Terea",
          "Nb_Reviews": 1,
          "Date": "2021-11-06T17:00:18.000Z",
          "Titre": "this is an awesome course for learning…",
          "Contenu": "this is an awesome course for learning the software"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Latisha Smith",
          "Nb_Reviews": 2,
          "Date": "2022-03-10T19:01:01.000Z",
          "Titre": "I love that there is an update for crc…",
          "Contenu": "I love that there is an update for crc 2.0!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Crystal",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T00:06:33.000Z",
          "Titre": "Great",
          "Contenu": "Thoroughly presented info in challenge!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lionel Weathers",
          "Nb_Reviews": 2,
          "Date": "2020-02-12T02:05:08.000Z",
          "Titre": "Easy to Follow",
          "Contenu": "The training has been easy to follow. Informative..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiffany",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T05:28:34.000Z",
          "Titre": "Glad I took this journey with Credit…",
          "Contenu": "Glad I took this journey with Credit Repair Cloud."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raquel Riddick",
          "Nb_Reviews": 1,
          "Date": "2020-03-24T22:43:26.000Z",
          "Titre": "Pretty good course",
          "Contenu": "Pretty good course, it was VERY basic, though!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Road Runners",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T18:35:04.000Z",
          "Titre": "Great course",
          "Contenu": "Great course. Easy to understand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryanné Taylor",
          "Nb_Reviews": 2,
          "Date": "2022-02-24T04:07:17.000Z",
          "Titre": "Informative and understandable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Damaris",
          "Nb_Reviews": 1,
          "Date": "2022-02-19T18:19:03.000Z",
          "Titre": "I think it was very useful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M Kal",
          "Nb_Reviews": 2,
          "Date": "2020-01-24T17:52:36.000Z",
          "Titre": "good intro course to credit repair"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Johnny Johnson",
          "Nb_Reviews": 1,
          "Date": "2020-06-07T01:07:04.000Z",
          "Titre": "Great step-by-step program"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raquel La Croix",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T21:16:50.000Z",
          "Titre": "Great information."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darlington",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:39:36.000Z",
          "Titre": "Best Credit Repair training in America",
          "Contenu": "They are so down to earth with their teachings and you can’t miss a tiny bit of any part of the training session and it’s principles because they will repeat it and make sure you understand the whole process and it’s procedures until you become a good credit repair specialist from the day after you finish your 14 day challenge.Great Work and keep changing lives!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tilaya",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:55:09.000Z",
          "Titre": "Invest in Yourself and Buy This",
          "Contenu": "The information is presented in a user-friendly fashion.  The curriculum teaches what one needs to know to get their business started today.  Where else can you learn a trade and purchase the system to get a business started so easily?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Buchanan",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:54:18.000Z",
          "Titre": "Attention to detail..",
          "Contenu": "Credit Repair Cloud is very informative and engaging. They pay attention to the details with their clients and not just want you to achieve but also succeed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:49:28.000Z",
          "Titre": "Credit repair cloud has really made the…",
          "Contenu": "Credit repair cloud has really made the process so seamless and convenient for me. I don't know what it's like to use any other software but I do know what it's like to hand write a dispute letter and to go to the post office to mail it. With CRC I no longer have to do that and have saved sooooooo much time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "supreme shands",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T22:41:53.000Z",
          "Titre": "I reached out for help & my problem was…",
          "Contenu": "I reached out for help & my problem was solved in minutes Credit Repair Cloud is the Best in the world!!!!! Bella Rella & her team are Amazing!!!!! BELLA RELLA YOUR MY SHERO...."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dillon Flanagan",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T09:27:30.000Z",
          "Titre": "You won't regret getting started",
          "Contenu": "This right here, Is a great book, and it's free, 7 bucks ain't bad to be able to give yourself the opportunity to change your life, whether you want to fix your credit or have the fundamentals to create a business, this is awesome. it'll teach you most of everything, I say most because there is always room to grow, if we get comfortable, we stop excelling."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Jay",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:57:11.000Z",
          "Titre": "CRC is amazing and helps my business…",
          "Contenu": "CRC is amazing and helps my business tremendously. The support is prompt and always resolve my issues with care. Hopefully one day I will be in the Millionaires Club. We shall see!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antoinette",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T22:04:17.000Z",
          "Titre": "This course was everything I needed!",
          "Contenu": "This course was everything I needed! I got ahead of myself sometimes. I would have saved myself some unnecessary stress if I would have just waited a day for the next available lesson. Follow the course to the letter! It will answer all of your questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Venzuello Mcmillan",
          "Nb_Reviews": 8,
          "Date": "2023-12-04T08:21:32.000Z",
          "Titre": "I am grateful to have this opportunity…",
          "Contenu": "I am grateful to have this opportunity to just learn and learn and learn the business of Credit Repair. Thanks to Daniel Rosen, he is by far a great enthusiastic person that I have ever had the pleasure of getting to know.  That goes for the staff as well.  I glad I stumbled across him.  I am over halfway finish with the book that I purchased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FHF",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T04:14:58.000Z",
          "Titre": "I am thankful to have run across this company",
          "Contenu": "Credit Repair Cloud literally give you all the tools, and step by step guide to ensure signing up for their services was well worth the investment. From learning material to easy to follow software, credit repair cloud literally sets every new entrepreneur up for success."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yariliz",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:50:18.000Z",
          "Titre": "Awesome!!",
          "Contenu": "Awesome!!! The energy was everything!! The team is absolutely amazing 🤩 I can’t wait to continue my journey thanks to all of them!! 🙏🏼"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "supreme shands",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T13:17:54.000Z",
          "Titre": "The credit hero company is so easy to…",
          "Contenu": "The credit hero company is so easy to follow instructions so easy to do theres no way you can't win! And save lives im a changing lives Specialist now!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Ayala",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T18:10:35.000Z",
          "Titre": "To be honest i personally bought other…",
          "Contenu": "To be honest i personally bought other courses in the past and those trainings that i bought have a lot of missing information and when i purchase Credit Hero Challange i'm been learn step by step and no missing information at all and Credit Hero Cloud is an awesome software . I recommend CHC to anybody."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jojo Sunmonu",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T10:52:41.000Z",
          "Titre": "I strongly recommend CRC!",
          "Contenu": "This Credit Repair Cloud training is the best training I've experienced in my lifetime. I am sincerely grateful to this great software's creators and staff members. Thank you for this service! This is NEXT LEVEL! Now, It's time to scale up! Happy Thanksgiving in advance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandi",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T16:16:16.000Z",
          "Titre": "I absolutely think this Cloud is AMAZING!!",
          "Contenu": "I absolutely think this Cloud is amazingly helpful. All the information is all self explanatory and so simple to follow. There’s just so many words I’d like to input about this book but we’d be here with a non ending review so let’s make it short and easy , all of the needed text or information is at your fingertips and I highly recommend you to jumó on board with the Credit Cloud if you haven’t yet"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "supreme shands",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T23:19:52.000Z",
          "Titre": "I had a billing problem I reached out…",
          "Contenu": "I had a billing problem I reached out to my Credit Shero BELLA RELLA and she fixed my problem in minutes!!!! Thank you BELLA RELLA YOUR MY SHERO!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberlee",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T01:09:23.000Z",
          "Titre": "I love CRC!",
          "Contenu": "I love CRC! I feel completely supported and have everything I need to be successful at my fingertips. Daniel offers more than enough free content/trainings/materials to get your business off the ground. The CRC Facebook family has your back no matter what challenges you face in your business. I feel the CRC software is remarkably affordable considering all the value I'm getting. I've only just begun and I'm super excited for the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Squalls",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T21:57:56.000Z",
          "Titre": "Excellent!!!",
          "Contenu": "Very easy read. Explains everything. Very thorough. I didn't know credit repair could be this simple. There are some grammar errors in the book, but I can still follow. The only way you can make this business any easier from start to finish is to have 'ready-to-go' clients lined up and ready to start their subscriptions for those that get started with CRC. Of course that would be a \"dream come true business\" ( not expecting that to happen though ) Just saying you've thought through everything in helping someone get going in credit repair. Good job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dionyos  Sylvester",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T22:59:16.000Z",
          "Titre": "I have a BRAND NEW business established",
          "Contenu": "I have a business established, an address, a business email, a toll-free number and a professional website set-up for my new business venture. Eternally grateful for the Masterclass! Not to mention all the jam-packed wisdom in each module!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Venzuello McMillan",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:09:27.000Z",
          "Titre": "I like the calm and collective method…",
          "Contenu": "I like the calm and collective method of doing things.  Great editing for ppl like myself.  Very informative, upfront and personal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Credit Score Fixer LLC",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T13:35:37.000Z",
          "Titre": "The training was easy to follow and…",
          "Contenu": "The training was easy to follow and understand. The daily video support on what we were to learn that day was helpful. The knowledge given on how to do basic dispute is enough to start your own business. Looking forward to taking the advance disputing class."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fadi",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T01:53:53.000Z",
          "Titre": "Awesome Program",
          "Contenu": "Awesome Program! If you are on the fence with Credit Repair Cloud, Jump in NOW! You won't regret it.  The training is first class, the people are awesome.  Everyone is dedicated to help you succeed!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammi Morrison",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T22:39:22.000Z",
          "Titre": "This is eye opening",
          "Contenu": "This is eye opening. I am working my way through it as well as the challenge, working on my own credit. So helpful and I can't thank you enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "willie sinclair",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T19:24:09.000Z",
          "Titre": "great company they also have great…",
          "Contenu": "great company they also have great training when it comes from learning and growing my credit as well as the credit cleaning business. GREAT WORK CRC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taisha",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T16:47:25.000Z",
          "Titre": "Becoming a #credithero",
          "Contenu": "I learned so much about the credit repair industry and felt confident enough after the process to start my own business. There was a lot of material and it was presented in an easy to digest manner.  I am so excited to become a valuable, ethical credit resource for my community and to truly change lives in the best way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NEREIDA",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T17:05:43.000Z",
          "Titre": "I totally recommend this challenge to…",
          "Contenu": "I totally recommend this challenge to anyone who is looking to start their career in the credit repair business. lots of support and videos to learn from is this 14 day challenge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erica Batista",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T15:55:32.000Z",
          "Titre": "A very digestible course to start a…",
          "Contenu": "A very digestible course to start a business super fast. I have been self-employed for 15 years and self-motivated. Anyone interested should keep that in mind, this course is to start a legit business, that requires work, dedication, on-going training, etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Latarsha",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T23:19:43.000Z",
          "Titre": "The training was design for you to Succeed",
          "Contenu": "The training was set up in a way to help each person have success. The information was practical, repetition, and theorical. They have put both the training together with all of the various way people learn. It made the classes engaging, kept your attention drawn, and interactive. I really enjoyed it. Thank you Daniel and CRC Family. I'm really to start helping people change their life as well as my own..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Whitney",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T05:55:32.000Z",
          "Titre": "This was a wonderful experience for me",
          "Contenu": "This was a wonderful experience for me. I'm super excited about my new adventure getting my business started. Mr. David gave a lot of helpful information and I'm forever grateful for it. Anyone who's looking to start a credit repair business should start here with Credit Hero. Thank you so much for my heart ❤️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T15:31:05.000Z",
          "Titre": "Excellent I loved it, learned a lot!",
          "Contenu": "Excellent! I love the way this book is written! Don’t tell anyone but I couldn’t put it down. Great info - I underlined 1/2 the book and highlighted the other half! I learned so much, I’ll be reading it again! Thank you for this complete, thorough and well-thought out book on credit repair!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Stockholm",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T20:13:00.000Z",
          "Titre": "Great company with the best product and…",
          "Contenu": "Great company with the best product and best support. I could not be happier working with them and building my business with Credit Repair Cloud"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Weisman",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T05:39:28.000Z",
          "Titre": "Unbelievable only $47 it's more than a wowww …",
          "Contenu": "I spend 3 amazing weeks with Credit Repair Cloud where I have the opportunity to learn everything I did want to learn about Credit Repair. Now I'm very confident and ready many people as I can to be debt free. I highly recommend Credit Repair Cloud to everyone who really looking for something better. Nothing better than what I learned from Credit Repair Cloud and now I'm able to better manage my own Credit Repair Business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GREGORY CLARK",
          "Nb_Reviews": 3,
          "Date": "2023-04-13T06:56:02.000Z",
          "Titre": "CRC did an excellent job of taking…",
          "Contenu": "CRC did an excellent job of taking complex information and making it easy to understand and progress in your learning quickly. I powered through all of the course work and now I'm a CERTIFIED EXPERT! I now cannot only change credit scores but I can changes lives forever because of this training. This was amazing and I'm very glad to have had this experience. Thank you very much CRC!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allison Rodney Manley Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T05:22:32.000Z",
          "Titre": "Let's see how starting a business & result through CRC",
          "Contenu": "I like the fact that my hopes are up to being very successful, with the help of CreditRepairCloud and Support. Ill be giving honest reveiws on every platform as I go along with their courses. Lets see how fast my dream of running a successful business come true. Im excited :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T. Edward",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T04:25:04.000Z",
          "Titre": "Very Informative; highly recommended!",
          "Contenu": "The Challenge was very informative and a great foundation block for my new business!Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SONIA WOODS",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T17:45:26.000Z",
          "Titre": "Very Informative And Understandable",
          "Contenu": "Very Informative And Understandable. Each Segment Of The Course Was Explained Thoroughly. I Am Aware That If I Don't Know Something I Could Go Back To My Notes Or Ask For Help By Doing A Video To Explain. It's Really Good To Know It's No Judgement Zone Because When You Don't Know; You Don't Know And The Credit Repair Cloud Team Is Ready To Walk You Through This Without Any Hesitation. Blessing To You All For This."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas JD Sekesan",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T21:16:36.000Z",
          "Titre": "There’s not a single thing that I can…",
          "Contenu": "There’s not a single thing that I can say negative about this company. I thought they had a lot of resources, but they have way more than I thought in regards to resources, coaching,  knowledge, they have an amazing user friendly interface they have it all, you name it! Extremely excited and grateful to be working with Credit repair cloud!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Williams",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T19:02:13.000Z",
          "Titre": "This was a great course",
          "Contenu": "This was a great course! It was easy to understand and laid out very well. Like anything new you're learning, it takes practice to get it right. You won't get it by watching only once, you'll need to re-watch to catch some things that you didn't the first time. This course is a good foundation for beginning to repair your credit or starting a credit repair business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Wilson",
          "Nb_Reviews": 3,
          "Date": "2023-05-04T05:40:52.000Z",
          "Titre": "Credit Repair Cloud Software is GOLD",
          "Contenu": "Credit Repair Cloud takes the manual labor out of the equation.  Everything you need to clean up your own credit, start and run your own credit repair business, is loaded into this software.  AND they have amazing classes that walk you through the entire process.  This software is GOLD!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gloria",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T15:19:43.000Z",
          "Titre": "Amazing Experience!!!",
          "Contenu": "I had a great experience every step of the way. The Training was great and very explanatory. I have learned a lot that I didn't know about credit and credit bureaus, and it blew my mind. I love the fact that I wasn't by myself through the whole training and the support was amazing. I'm excited to start my journey to help others. Thank you, Credit Repair Cloud,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LOBO DE SUERTE",
          "Nb_Reviews": 4,
          "Date": "2023-08-24T19:39:02.000Z",
          "Titre": "As a participant in the Credit Hero…",
          "Contenu": "As a participant in the Credit Hero Challenge, I have learned and gained immense value from the experience thus far, from getting my certifications from the online digital courses. The Instructor Corey Gray, is amazing, and the host and founder Daniel Rosen, the CRC Software Support Issac. The overall journey has been enlightening."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sampada Patel",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T09:20:59.000Z",
          "Titre": "I was very nervous to start out as an…",
          "Contenu": "I was very nervous to start out as an independent credit repair service provider, until I found this easy to use software. I really liked using the portal as it was easy to understand. I quickly got a hang of it. I have been using it for the past 2 and a half years now and the overall experience has been satisfactory."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Matthews",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T21:31:51.000Z",
          "Titre": "Just my 5 Star opinion",
          "Contenu": "CRC covered everything regarding credit repair, most of all made it easy to understand. I have worked on my own credit these past 2 years going from 609 to 728 as of today, but if I knew then what I know now it may have been less than 2 years, but it is what it is. The CRC software is excellent and easy to navigate, but most of all makes the whole process move smoothly. The additional books, and PDFs that were given are vital to success, with a lot of useful text, information, do's and dont's, all covering each step of the process. The only issue I see is human error when entering information but that is fixable. The course work was repetitive at times but essential to understand how to do credit repair and be successful. I would recommend others take this Challenge even if it is only to fix their credit problems. For me, 5 Stars it has everything I need to move forward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T16:18:09.000Z",
          "Titre": "Great!",
          "Contenu": "First, the training was awesome.  I loved that I could take classes on my timetable.  I learned so much and feel prepared to move forward.Secondly, the Credit Repair Cloud Community answers questions I never even thought to ask.  Great support from folks in the \"trenches\"."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bettina",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T02:06:46.000Z",
          "Titre": "Excellent Program!",
          "Contenu": "All the training is laid out very well, full of valuable information and set up to help you succeed. I am extremely impressed. I would recommend this program. Amazing journey."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SHARELL",
          "Nb_Reviews": 2,
          "Date": "2023-07-10T20:00:26.000Z",
          "Titre": "I've been a Credit Repair Cloud…",
          "Contenu": "I've been a Credit Repair Cloud customer since 2018. I had an issue that I didn't think they would be willing to solve but, they not only offered me an incredible solution. They did it fast. I'm very happy with the service. they really made me feel like family not just a customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Uriah Jones",
          "Nb_Reviews": 2,
          "Date": "2023-06-24T05:56:22.000Z",
          "Titre": "Credit Repair Cloud!",
          "Contenu": "Credit Repair Cloud, is the best software ever, I stumbled across it, looking for information on starting my credit repair business. This software made it super easy to set up a great effective credit repair business. The training and support are fantastic. I look forward to getting my name on the millionaire's wall!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorisa",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T23:31:15.000Z",
          "Titre": "The course was informative",
          "Contenu": "The course was informative.  The trail session for the software should be at least 60 days for those going the challenge.  It will allow time to get results back from the test clients."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T20:04:22.000Z",
          "Titre": "The Challenge was awesome",
          "Contenu": "The Challenge was awesome. After I figured out how to follow the class and where I needed to be daily I was set! This is an awesome program that REALLY does what it touts. So very delighted we found Credit Repair Cloud! There is no fear now and feeling unstoppable. Clients are coming in during our TEST phase. UNSTOPPABLE!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T17:38:54.000Z",
          "Titre": "What an amazing journey",
          "Contenu": "What an amazing journey, this class gives you a broad and stream lined  knowledge of the credit repair business. support staff and instructors were great and Facebook lives were amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T19:23:20.000Z",
          "Titre": "Excellent customer service!!!",
          "Contenu": "Excellent customer service! I just signed up for the program and needed assistance two days in a row and each time my issues were responded to quickly and resolved with little effort on my part. This has really fortified my trust in this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanisha Holly",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T15:28:59.000Z",
          "Titre": "Trial….",
          "Contenu": "I am still within my trial period and I’m blow away at how easy the software is to use! Very useful resources that will make sure you succeed if implemented correctly! I signed up a week ago and I have about 10 clients 5 of which are paid😄 IM IN LETS GO!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spencer Rogers Jr.",
          "Nb_Reviews": 3,
          "Date": "2023-07-16T01:43:10.000Z",
          "Titre": "Credit Repair Cloud Training & Software",
          "Contenu": "I completed some of the Credit Repair training in 2020, but wanted to go through it again. I am so glad I did. My knowledge has been expanded and I have retained more from the training. Corey is an excellent trainer! I also signed up for the software and website. Within a few days, my website is ready to go. I am already using the software, making my way through the prompts on what to do next."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiffany",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T17:18:36.000Z",
          "Titre": "The course was very informative",
          "Contenu": "The course was very informative, gave me the knowledge I need to be able to help people repair their credit. Credit repair cloud did an amazing job with the course and software.  I'll recommend Credit Repair Cloud to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tenesha B.",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T19:36:44.000Z",
          "Titre": "14 Day Challenge Review",
          "Contenu": "I want to thank Daniel and the rest of the CRC family for providing this 14 day challenge. It was truly an experience, and I learned so much content to make my business successful. Thank you for all the resources and cheat sheets! Signed, your future millionaire!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dedee G",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T23:49:08.000Z",
          "Titre": "It was how thorough the instructors…",
          "Contenu": "It was how thorough the instructors were. The amount of knowledge they gave toward credit and disputes. Walking through the course while simultaneously showing how to do so truly helped me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcello",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T22:49:40.000Z",
          "Titre": "I’ve learned all the basic-need to know…",
          "Contenu": "I’ve learned all the basic-need to know information to launch my credit repair business! I am very grateful that I came across this company. I’m sure they have shaved several months or even a year off my learning curve! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy Littlejohn",
          "Nb_Reviews": 7,
          "Date": "2023-04-30T17:16:58.000Z",
          "Titre": "I’m thrilled I came upon Credit Repair…",
          "Contenu": "I’m thrilled I came upon Credit Repair Cloud. It has great tools to use & the teaching is absolutely great. They walk you through step by step & the support system is great. I’m looking forward to getting my name on that Millionaire wall soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Manuel",
          "Nb_Reviews": 3,
          "Date": "2023-05-01T03:23:54.000Z",
          "Titre": "It is important to never give up. And always pay it forward.",
          "Contenu": "The entire 14 days challenge gave me a basic understanding of credit repair. This company really wants to help people. I feel confident that this company will attract more people that want to grow and help others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T00:17:11.000Z",
          "Titre": "Great opportunity for learners for…",
          "Contenu": "Great opportunity for learners for stared a new business, with the rigt foot, Thank you Credit Repair Cloud. Vamos por el club del million !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T20:17:01.000Z",
          "Titre": "Daniel provides a \"tell all\" approach…",
          "Contenu": "Daniel provides a \"tell all\" approach which covers almost everything from A to Z when it comes to launching your own credit repair business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Thompson",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T00:45:10.000Z",
          "Titre": "The Credit repair guides were great…",
          "Contenu": "The Credit repair guides were great tools, love how the software is not complicated and everything is done through the software"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonya",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T03:09:55.000Z",
          "Titre": "Great Company!",
          "Contenu": "I’ve worked with a number of companies for many different reasons however this is the only one that I’ve ever felt like I’m not in this by myself! This company has a great system and outstanding support team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abner",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T22:40:35.000Z",
          "Titre": "Finaly a program that is not…",
          "Contenu": "Finaly a program that is not misleading, does not promise anything and then does not deliver, and absolutely caters to the customer. What an absolutely amazing experience going through their trial program and business builder challenge. Absolutely invaluable. I don't think there's a better software out there. You need CRC!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T10:28:29.000Z",
          "Titre": "The 14-day credit hero challenge…",
          "Contenu": "The 14-day credit hero challenge covered all the steps necessary to gain a full understanding of the credit repair business, and using CRC. And, outlined the path to help others and become a millionaire."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad Lower",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T00:29:27.000Z",
          "Titre": "CRC is awesome I met Daniel this year…",
          "Contenu": "CRC is awesome I met Daniel this year and decided to use his software to clean up a couple things on my credit.  I already helped one of my clients dispute some items on theirs and made money on day 2."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenesha",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T13:53:27.000Z",
          "Titre": "Very easy",
          "Contenu": "Very easy the customer service is above 5 stars. The team has patients and they work with you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcel Yamakawa",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T05:42:11.000Z",
          "Titre": "Credit Repair Cloud made it very easy…",
          "Contenu": "Credit Repair Cloud made it very easy to learn and get all the information at any time when needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T03:45:31.000Z",
          "Titre": "Adan Espino (Credit Repair Cloud…",
          "Contenu": "Adan Espino (Credit Repair Cloud Support) provided me with great costumer support ! thank you CRC Team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Plus Sized Shopper",
          "Nb_Reviews": 3,
          "Date": "2023-06-12T15:22:19.000Z",
          "Titre": "The 14 day Credit Hero Challenge was well worth the time and money spent!",
          "Contenu": "The 14 day Credit Hero challenge was one of the most structured, informative, interactive and well paced online challenges I’ve taken thus far! It took a lot of information and broke it up into smaller sections with videos and activities that were easy to understand and complete. I feel confident in my abilities to successfully add credit repair services to list of business services I already provide."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald Sims",
          "Nb_Reviews": 2,
          "Date": "2023-06-26T07:39:48.000Z",
          "Titre": "My experience with the credit hero was perfect for the individual with a busy work schedule!",
          "Contenu": "My experience with the credit hero challenge was fantastic. I really enjoyed the fact that I could review all the material when I got off work I feel I have learned a lot of information that is critical to opening a credit repair business. I really enjoyed the staff and their expertise and sense of humor, and willingness to help beginners like myself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ana maria georgiles",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T05:07:00.000Z",
          "Titre": "very comprehensive course really laid…",
          "Contenu": "very comprehensive course really laid out very nicely and user-friendly,if you pay attention you gain a lot of knowledgeand feel prepared almost to pull credit reports in a couple weeks,I did that and even sent off the dispute letters before I was completely done with the challenge,the credit repair cloud is awesome to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T08:20:01.000Z",
          "Titre": "I learned so much it taught me alot I…",
          "Contenu": "I learned so much it taught me alot I didn't know great extra free stuff and videos I recommend this challenge  to everyone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keyshia",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T15:30:10.000Z",
          "Titre": "Highly recommend!",
          "Contenu": "Amazing book filled with tons of information! 10/10 i recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Wash",
          "Nb_Reviews": 2,
          "Date": "2023-04-08T23:38:40.000Z",
          "Titre": "The software",
          "Contenu": "The software, the team, the resources, and material are great. I have been doing credit repair for quite some time and the software, information, and resources provided by credit repair cloud will enable me to take my business to the next level."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Boisvert",
          "Nb_Reviews": 6,
          "Date": "2023-07-19T13:45:27.000Z",
          "Titre": "Legitimate Company",
          "Contenu": "CRC Has great training and support. I highly recommend them if you are looking to improve your, or others, credit score."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHN",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T15:34:31.000Z",
          "Titre": "Daniel and his staff give you the tools…",
          "Contenu": "Daniel and his staff give you the tools AND the confidence to succeed , I am a retired police detective and I am excited to get started. Thank you, John Collins"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shakeitra Evans",
          "Nb_Reviews": 3,
          "Date": "2023-03-27T04:39:21.000Z",
          "Titre": "I AM GREATEFUL FOR THE CREDIT REPAIR…",
          "Contenu": "I AM GREATEFUL FOR THE CREDIT REPAIR CLOUD PLATFORM.AWESOME TRAINING,AND AWESOME TRAINEES. I AM EXCITED TO ATART MY OWN CREDIT REPAR BUSINESS BECAUSE I AM MNORE CONFIDENT BECUASE OF THE KNOWLEDGE THAT I NOW HAVE BECAUSE OF CREDIT REPAIR"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nikki D",
          "Nb_Reviews": 4,
          "Date": "2023-03-28T14:15:54.000Z",
          "Titre": "Road to Credit Success",
          "Contenu": "Wonderful book and easy to read and understand. I really love the sample credit bureau letters included in the book to help you get started on the road to improved credit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Alan Junior",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T05:43:13.000Z",
          "Titre": "About a 3rd through the courses and…",
          "Contenu": "About a 3rd through the courses and coaching and I Have to say this is such a great tool to learn all about credit repair easily, Highly recommend 5 out of 5!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LOBO DE SUERTE",
          "Nb_Reviews": 4,
          "Date": "2023-08-15T21:46:09.000Z",
          "Titre": "Learning How to Change Lives!",
          "Contenu": "The instructor was top-notch, Corey G. I really enjoyed the resources and material such as the templates, the downloads, the flow of the course, the assignment, and the accountability. I really enjoyed this course experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mina mercardo",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T11:36:01.000Z",
          "Titre": "Vida Charvet went out her way to help…",
          "Contenu": "Vida Charvet went out her way to help me out. I have been experiencing financial hardships since my accident in 3/16/2023 when an Amazon driver struck me being the passenger and things are so backed up and hard trying to make ends meet. I feel as if Anwulika Opone didn’t understand nor did she addressed my original concerns at all, which was me not having the $179 to begin with and she kept pushing the fact to pay the 179 and be discounted half the following month if I had the full 179 I would’ve paid it so that didn’t help at all but Vida instead granted me my original invoice $107 because of Credit added, that was discounted before the expiration took place which was more manageable to pay versus the original $179 . That’s why I would like to take the time to leave this review just to tell Vida thank you so much for understanding my concern and going out your way to addressing provide a solution and such desperate trying times when you still want to operate and do right by your customers . Thank you soooo much vida for your help. !! Things will not continue to be the same it will get better and I’ll be able to manage my payments more responsibly!!! Thank you again CRC !! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruben",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T00:15:58.000Z",
          "Titre": "Very informative from the very…",
          "Contenu": "Very informative from the very beginning and the teaching is well and easy to understand!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Moorefield",
          "Nb_Reviews": 3,
          "Date": "2023-05-13T14:02:47.000Z",
          "Titre": "Excellent program easy to follow with…",
          "Contenu": "Excellent program easy to follow with more than enough tools to be successful. All you have to do is apply yourself that’s it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wise Credit Services, LLC",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T22:16:16.000Z",
          "Titre": "Great experience and support during…",
          "Contenu": "Great experience and support during training. I'm going to launch my own business soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 5,
          "Date": "2023-07-11T01:34:05.000Z",
          "Titre": "Credit Repair Challenge Experience",
          "Contenu": "Wonderful Crew to help with any questions and concerns learned so much about credit repair and how to help others. Thank You!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin Borjas",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T00:28:25.000Z",
          "Titre": "They get to the point on basic…",
          "Contenu": "They get to the point on basic knowledge and understanding of credit repair. I understand more now than I did a few years ago. Very helpfull information"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T15:33:09.000Z",
          "Titre": "It was a real challenge but I enjoyed…",
          "Contenu": "It was a real challenge but I enjoyed it I had so much fun and I became educated to what Credit Repair is all about I’m so happy thanks a lot"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eb Champion",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T04:58:41.000Z",
          "Titre": "Just finished my CRC certification and…",
          "Contenu": "Just finished my CRC certification and Basic Disputing course and I am blown away.  This overall system is awesome and I can't wait to fully implement it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alzonia Chalise",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T10:15:03.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Helped me answer answered both my calls and my emails on a Sunday afternoon. This helped me tremendously and let me know this is the company I wanted to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guido Zecckine III",
          "Nb_Reviews": 3,
          "Date": "2023-03-31T13:31:19.000Z",
          "Titre": "Great job folks!",
          "Contenu": "Great, easy to follow training. Lots of enthusiasm as well. A wealth of knowledge, and the Credit Repair Cloud software is super user friendly too. Not only did I learn, it was fun! Thanks Daniel."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "McKinley Jones",
          "Nb_Reviews": 6,
          "Date": "2023-08-26T03:37:10.000Z",
          "Titre": "I’m glad I discovered Credit Repair…",
          "Contenu": "I’m glad I discovered Credit Repair Cloud!  It’s exactly what I need to generate more business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ancil B",
          "Nb_Reviews": 3,
          "Date": "2023-06-10T04:35:50.000Z",
          "Titre": "Credit repair cloud is awesome",
          "Contenu": "Credit repair cloud is awesome, the platform is very user friendly and the knowledge base training makes me feel empowered to fix my credit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosetta",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T01:11:46.000Z",
          "Titre": "Great class I recommend it if you’re…",
          "Contenu": "Great class I recommend it if you’re looking to learn more about credit repair or starting a business in the industry of credit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Floyd M",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T22:26:14.000Z",
          "Titre": "there is a lot of information and easy…",
          "Contenu": "there is a lot of information and easy to access"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis Jeffries",
          "Nb_Reviews": 3,
          "Date": "2023-06-21T20:06:41.000Z",
          "Titre": "Good information but things got…",
          "Contenu": "Very Good information but things got confusing when asked sign up for free 30 day software trial during the Challenge. two things going on simultaneously and logins got mixed up and other things going on simultaneously made things confusing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tierra",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T18:01:54.000Z",
          "Titre": "My experience",
          "Contenu": "What made my experience great was how they walk you through each subject step by step."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Mendez",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T10:54:54.000Z",
          "Titre": "Excellent affiliate support",
          "Contenu": "Excellent affiliate support Always receive prompt responses and a call back if needed Friendly staff and professional  CRC is growing fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anita Perez",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T18:05:12.000Z",
          "Titre": "My experience was great so far",
          "Contenu": "My experience was great so far! Cant wait to help Family and friends repair their credit! So excited to keep learning!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WOSRET",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T11:49:53.000Z",
          "Titre": "Very well organized and thorough training course",
          "Contenu": "There are many tools available to assist in the educational process, the instructors are very detailed and well experienced. The software is also top notch."
        }
      ]
    }
  ]
}