{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ctsounds.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jammie Ringgold",
          "Nb_Reviews": 4,
          "Date": "2023-12-09T02:26:49.000Z",
          "Titre": "Let’s hope you don’t receive something…",
          "Contenu": "Let’s hope you don’t receive something that is damaged from ct sounds because they will send used items to replace them. Terrible. I bought 5 amps 2 subs 3 sets of speakers four midrange speakers and tweeters and this is how they treat ‘valued’ customers . This company sucks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "juan avalos",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:06:26.000Z",
          "Titre": "I am very happy with your product",
          "Contenu": "I am very happy with your product. but I did send you guys 3 emails I wanted to know where I can get speaker covers for the speakers that are going into my doors. Nobody has responded."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gericho B.",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T09:06:04.000Z",
          "Titre": "Fix your return policy",
          "Contenu": "Fix your return policy. Allow the customer to get there full refund when they need to return the products before the 30 days and not charge the customer the return fee. For a big company, your return policy should be the same as Amazon when you sell your products there as well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Knoch",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T03:49:33.000Z",
          "Titre": "Worst customer service",
          "Contenu": "Package was never delivered, ups isn’t doing anything to help and neither is the company. Been about two weeks and no progress. Disputing the charge on my card and just want it over with."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "VC",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T15:10:55.000Z",
          "Titre": "I would never buy Ct",
          "Contenu": "I would never buy Ct. Light weight part and when I found out after I received, did not like it , they charged be 20$. Unacceptable. Will never buy and suggest people not buying from CT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oscar",
          "Nb_Reviews": 6,
          "Date": "2023-12-10T20:53:19.000Z",
          "Titre": "I bought a 2500 amp",
          "Contenu": "I bought a 2500 amp and I used maybe 20 hours and it burned out. I use this vehicle when I go to the beach on the weekends. And their warranty suck. They ask a million questions! It’s not my fault the cheap amp burned out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "andrew",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T01:09:55.000Z",
          "Titre": "Poor quality",
          "Contenu": "Poor quality. Felt and looked very cheap. Plan on returning."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jazer Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T21:14:42.000Z",
          "Titre": "Ordered some meso 6.5 mid range…",
          "Contenu": "Ordered some meso 6.5 mid range speakers and very disappointed with customer service. After over 2 weeks and spending money at an install shop because or the recommendation of a CT Sounds employee, they won't even exchange the merchandise. I can understand not refunding because an item was hooked up for 30 minutes lmfao but at least exchange the item so your customer is satisfied instead of basically saying screw you, you've used them now. Oh well, lesson learned. Won't buy another item. Fosgate is better anyway."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "OWNER OF CAR-MEDIX",
          "Nb_Reviews": 3,
          "Date": "2023-09-09T15:53:57.000Z",
          "Titre": "HORRIBLE COMMUNICATION",
          "Contenu": "HORRIBLE COMMUNICATION. MISSSING OVER 800 USD IN AMPS AND 1 WIRE KIT. NEEDED MESOS SUBS GOT TROPOS. HAD A SALESMAN CALL BEFORE PURCHASE GREAT GUY NAMES MATT NOW THAT I HAVE PROBLEMS CT SOUNDS SAYS THEY DONT HAVE PHONES. THIS COMPANY IS A JOKE. I BELIEVE MOST REVIEWS ARE NOT FROM ACTUAL CUSTOMERS"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan Brummett",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:10:44.000Z",
          "Titre": "Arrived three days late"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Thompson",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T05:41:14.000Z",
          "Titre": "Received the 12” tropo sub",
          "Contenu": "Received the 12” tropo sub that came in an enclosed, was exited to have a sub but when i went to tune it, it had a very bad buzz that couldnt get tuned out; and it sounds like paper when gently pressing in the sub. It isn’t wiring issue, had it checked by testing a different sub and it was fine"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Mcbride",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T18:17:21.000Z",
          "Titre": "I ordered these 2 speakers thinking…",
          "Contenu": "I ordered these 2 speakers thinking they might work in a 06 streetglide front fairing , but they are too big . Emailed y’all about returning them and you want to give me less than half of what I paid for them . Will not be returning them and plan on not b purchasing anything else from there and I will let everyone know about my experience thru Facebook , twitter ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LFD",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T20:18:38.000Z",
          "Titre": "First shopping experience with ct sounds",
          "Contenu": "I am pleased that my damaged item is getting replace, but the amount of time it's taking for the process is too lengthy.  I have purchased many items from a competitor and once received a damaged item.  I contacted them, sent them 2 pictures (which they did not even ask for) and their response was: no meed to do anything, a replacement has been shipped, please discard damaged item.  That simple! Not to mention it was a big ticket item.  Though i am not expecting to have the same experience everywhere, this was my first time purchasing from this company and to just know that my replacement is still at least 7 days out (after going through all the email process) I will get a replacement in a total of about 10 days seems kinda lengthy to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Jaramillo",
          "Nb_Reviews": 4,
          "Date": "2023-08-11T20:07:13.000Z",
          "Titre": "this speaker set looks like it's for a…",
          "Contenu": "this speaker set looks like it's for a barbie car! I'm totally disappointed! the boxes the components came in aren't marked as too which they are,  the directions are complicated because they have 2 different types of speakers and crossovers, but nothing is marked as to which one you have! a waste of 250$"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lloyd Greer",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T17:15:25.000Z",
          "Titre": "There game is wrong ..",
          "Contenu": "There game is wrong ... bought one amp that has less than 2 hours of play time before it shut down on me an quit working an had all the recommendations that the manual call for an speakers wired up has the book said todo so ... so out of faith waiting on warranty I bought anther amp an while hooking it up I noticed a screw on the outside plate dangling out lose an apparently its been strip because won't even screw in ... almost a thousand dollars in a poop show to where I wouldn't recommend them to any of my bass heads friends are to even my worst enemy.... an yes they have still avoided me an now ignoring me so go figured... never again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lewis Mumford",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T00:32:22.000Z",
          "Titre": "The website misrepresents the return…",
          "Contenu": "The website misrepresents the return policy.  The only way you find out is if you click on the link and read the complete policy.  “100% hassle free returns” isn’t completely true. And it isn’t 1 year, it’s 30 days from the tracking information is updated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WS",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T03:14:22.000Z",
          "Titre": "the quality of product not as good as before",
          "Contenu": "Paid for new subwoofers, but received both woofers has scratches and marks.on their website only allows 5 star reviews.  they won't let you review lower than 5 stars."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DeShane Burkhalter",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T01:34:23.000Z",
          "Titre": "Never received my order",
          "Contenu": "Never received my order, and the customer service about the entire situation was very dismissive and could care less, so far I haven't received my money back or the 2 meso 8\" subs I ordered. This is fixing to go to civil court because that seems to be the only way to recover my money that I paid for a product that CT Sounds dosnt care if I get or not. Absolutely horrible company. Stay away from at all cost."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Salvatore  Paonessa",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T17:24:38.000Z",
          "Titre": "Junk equipment and even worse customer…",
          "Contenu": "Junk equipment and even worse customer service do not buy from!!!!!!! I have spent over $800 for a 4 channel amp and a pre loaded subwoofer box 12 inch the amp came with 2 of the 4 channels not working and the subwoofer box came with one of the two woofers  not working only pops and cracks when turned on. I have sent numerous emails to try to resolve this issue and they get back to me saying that the warranty team had to look into it even that its brand new and came to me not working. There is no phone number and no one to speak live to you can only talk through email. Very horrible customer service. As of today my issue is still not resolved I feel like i have been scammed out $800 and have not working equipment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Modesto Arciniega",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T21:08:35.000Z",
          "Titre": "I didnt receive the product",
          "Contenu": "I didnt receive the product. But the delivery shows info and picture shows it was delivered, i dont know if the carrier took it after taking the pic or not. No one wants to reimburse me or send product. You should require a signature upon delivery."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Brankis",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T03:51:33.000Z",
          "Titre": "False advertising",
          "Contenu": "They advertise \"no questions asked returns\" with a banner and \"full refund\" is written in the return policy, until you click to the second page. I bought a dual 10\" loaded enclosure for $300 and they will only refund me $190 because the customer actually pays for the prepaid shipping label. I had this thing for 24 hours and did not like the build quality and my shipping box had holes in it. I'm supposed to forfeit 1/3 of the cost? Because of the banner, I assumed their returns were competitive with other companies. All other car audio companies offer free returns. I wouldn't have bought it if I knew the policy and the banner advertising returns as a feature mislead me. Customer service doesn't seem to care. I'm going to file a dispute with PayPal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nohel Cota",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:03:53.000Z",
          "Titre": "Never got my package I paid over $400…",
          "Contenu": "Never got my package I paid over $400 for"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Lecuyer",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T00:52:08.000Z",
          "Titre": "Never received my package...never got a…",
          "Contenu": "Never received my package...never got a tracking number. Had to call after 8 days of nothing just to be told my package was delivered. I have a camera on my door, I would know if something was delivered. They won't resolve the issue. Good luck. (Date not accurate, don't remember the exact date.)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barry Prather",
          "Nb_Reviews": 5,
          "Date": "2023-10-06T06:59:02.000Z",
          "Titre": "Really bad customer service",
          "Contenu": "Ordered some tweeters shipping OK. But the sound was very weak lacked detail. Just a nightmare to deal with. I know it was only $30 but to upset a customer for such a small amount seems stupid. I have one of their amps and a set of 6.5 coax. Just hope they don't blow since the customer service is so bad and slow. Listed on their website no hassle 1 year warranty, don't buy that. If you don't count 7 emails and still no real resolution as hassle free. Item has to be unused to return. So you can't try a speaker to see if you like it, even if it is not defective just low quality you can't really return it.  Has to be unused to return it. So hope you like it , if not your SOL. Any issues, they will blame on you or your system. If you are going to sell online and will not accept that people have different sound preferences and may not like your speakers just stop selling them,  stop ripping people off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maxwell Graham",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T06:23:45.000Z",
          "Titre": "I got a tracking message on the 18th",
          "Contenu": "I got a tracking message on the 18th, it stated my package should be arriving at 10:01 that morning, so I spent the whole day waiting for that package that never came, if that the best you can do as far as sending a person a package, I don't think I will be purchasing anything else from you again, very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angel Cruz",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T01:57:47.000Z",
          "Titre": "Horrible service orderd speakers on the…",
          "Contenu": "Horrible service orderd speakers on the 13th of January and still haven't received my package or update when I will see it !! Site has it posted same day shipping 2 business days that's false advertising !!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashton Guthrie",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T02:52:47.000Z",
          "Titre": "FedEx delivered to wrong address. Then it was a battle",
          "Contenu": "My orders was delivered to the wrong address. FedEx told me they tried to recover the package, but they were unsuccessful. The bs I had to go through was unreal. There's no number to call, so I was stuck dealing with Ismail by email. They refused to reship my order or offer a refund. I had to go to my bank. I've never been more disgusted in a company in my life. Still... They make quality products so I'll probably buy more from these a**holes. I just want an apology for this treatment. That would really be nice"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "OWNER OF CAR-MEDIX",
          "Nb_Reviews": 3,
          "Date": "2023-09-23T20:02:33.000Z",
          "Titre": "I ordered during flash sale over 2800…",
          "Contenu": "I ordered during flash sale over 2800 use order. I had great service prior to this with questions being answered. I bought mesos 12 subs all atv2 amps the sale was 24 hrs at first I wanted to buy team amps but only available through phone orders and eco sub so I saw was ending so I bought the mesos and at. the sale than went another 24 than another 34 than it turned into Labor Day sale than it was 24 more hours sale over. I asked for help the whole sale in order to get the eco subs and teams amp no more communication I received missing amps as well as troop subs. I ordered 4 6.5 subs got troops and no 1400 amp I also ordered 6 channel no amp than 2300 on each mess no 2300 mono amp, I want to not push my amps it seems the either blow b y reviews or just cook so I figured play it safe. I seem that the baskets and designs are the same as d4s, big Jeffs audio, def once etc etc. There is a general company that makes these speakers magnets etc etc so I def recommend buying somewhere else. THEY WILL NOT REFUND ME ANY ITEMS they say send the troop backs for basically2/3 of the money they keep all shipping so you are actually paying for shipping. IF YOU BUY THROUGH AMAZON YOU ACTUALLY GET 100% of money back but not through ct isn't that crazy. THIS COMPANY IS HORRIBLE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Covington",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T01:50:47.000Z",
          "Titre": "Company advertises \"No questions asked\"…",
          "Contenu": "Company advertises \"No questions asked\" return policy, but I guess you have to read the fine print.  They will NOT (by default) accept any return that has been opened or used.  I recently purchased (2) 10\" TROPO subwoofers and a CT-1000.1D amp.  I selected the amp based on CT-Sounds dyno video.  Upon installing the amp, I discovered that it is way under powered for these subs.  Literally 2 days later, I contacted the company about the \"no questions asked\" return policy and was told they don't accept returns of anything that been \"used\".  They were willing to make an exception for me, but it would cost me $60.  I paid $160 for the amp and they were going to credit me $100 towards a larger amp.  I realize that this is a large company and that my total purchase of nearly $400 is insignificant to them, but it's a lot of money for us working folks.  I will never buy from this company again and would never recommend them to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Troy Swick",
          "Nb_Reviews": 5,
          "Date": "2023-05-23T04:22:25.000Z",
          "Titre": "I purchased the bass knob for the amp I…",
          "Contenu": "I purchased the bass knob for the amp I had and the bass knob was messed up and it smoked my amp which was a team 3000.1 very expensive amp and they refuse to back there product by working with me to get it fixed I gave him multiple chances and they shot me down so I'm no longer supporting CT sounds and I go and compete and shows so I was getting there name out there now I will tell people how they really are they don't back their product makes them no good in my book"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Beebout",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T15:02:41.000Z",
          "Titre": "Your shipping company and update system…",
          "Contenu": "Your shipping company and update system sucks.  The shop app thing you use is not cute or helpful.  The whole order process is misleading.  I was told 2days on the 23rd and it's now the 30thand I might have decided that it's showing up today but I'm really not sure"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ethan Henning",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T04:54:46.000Z",
          "Titre": "I ordered a sub and an equalizer from…",
          "Contenu": "I ordered a sub and an equalizer from them and it was delivered to a completely Random address. They basically told me I’m out of luck with getting a refund or my money back. Crappy customer care do better"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ernest Mozingo",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T17:50:48.000Z",
          "Titre": "I was told 2 day shipping and here we…",
          "Contenu": "I was told 2 day shipping and here we are a week later and I still haven't received my items. Regardless of quality customer service is more important."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Smith",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T00:01:18.000Z",
          "Titre": "My amp lasted less than five minutes at…",
          "Contenu": "My amp lasted less than five minutes at less that half volume and 1/4 bass before smoking and shutting down completely"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tiffany Dubreuil",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T01:17:29.000Z",
          "Titre": "Box is crushed and subwoofer box is…",
          "Contenu": "Box is crushed and subwoofer box is broken. Your customer service sucks and nothjng is being done. If nothing is done within the next 2 days I will be contacting a lawyer"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zane Shultz",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T22:32:24.000Z",
          "Titre": "Your return system sucks",
          "Contenu": "Your return system sucks. I ordered the wrong item and I messaged to cancel it and you did, but you still sent it and now I’m down 22$ cause you don’t have refunds for the full price."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T14:39:23.000Z",
          "Titre": "You get what you pay for!",
          "Contenu": "Had an amp \"issue\" that I sent in for warranty repair. They couldn't figure out was was wrong with it and then told me I had to pay $30 to send me my broken amp back. Never again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Seung Lee",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T06:49:07.000Z",
          "Titre": "The speaker sounds muddy with low…",
          "Contenu": "The speaker sounds muddy with low definition compare to factory speaker.Had to go back to stock speakers.NO answer to my return request."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Antonio Arispe",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T01:39:59.000Z",
          "Titre": "Bought this as a Christmas gift for my dad",
          "Contenu": "Bought this as a Christmas gift for my dad and one of the terminals was broken when we were going to install it today. Looks like instead of fixing it they just tried to glue it?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Samuel Sosa",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T01:22:40.000Z",
          "Titre": "Confused return policy?",
          "Contenu": "I bought a loaded speaker saying 1300w... i have a 1200 amp...after installing i notice it is  not enough power...then i notice it was a 650w with a max 1350... i try to returned within the first week ( after they took a week to deliver not 2 days) because i was not satisfied with product and they told me due to their return policy i cant returned because is already used...The next paraghraph is a little bit of their confusing policy...\"We stand behind our products and if you are not 100% satisfied with your purchase you may return it within 30 days of delivery (delivery means the date the shipment was marked delivered by the carrier’s tracking number). Upon receiving your items, we request 2 business days to inspect the item and process your return. Once inspected and processed by our team for a refund, please allow 3 to 5 business days for your funds to arrive back to your original payment method. You can start a return by clicking the link: Return an ItemAm I eligible for a return?To be eligible for a return we require the following:Receipt or proof of your purchase from (ct sounds)(i.e. Order Number)The item must be unused and in the same condition you received it\"And the next was saying it has to be without missing anything that was on shipping box..so...you can open package and just by looking at it if u are not satisfied you can returnded??doesnt make sence..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wyatt Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T19:58:25.000Z",
          "Titre": "I thought this was a scam",
          "Contenu": "i ordered a set of speakers and when i was placing the order it said 3 day shipping that was 2 weeks ago and i just got an email yesterday with a tracking number and i track it and it says the package hasn’t even been sent to the shipper yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jeremy hallett",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T05:51:02.000Z",
          "Titre": "Not happy",
          "Contenu": "I purchased some 6.5 door speakers online and it says they were 240 watts. I get them in the mail and the box and speakers say 125 watts. Not whati was hoping for. I emailed and was told \"Our team confirmed it's 60 watt RMS power, not 75 watt RMS. The factory has misprinted the RMS power as 75 watt.\"  Didn't even get asked how they could fix it.. to me that is false advertising and is a big no no."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher GARTNER",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T09:25:03.000Z",
          "Titre": "Displeased",
          "Contenu": "“Same day shipping (two business day)” a week later… still ain’t got it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric West",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T15:21:23.000Z",
          "Titre": "Unaccurate advice",
          "Contenu": "Product didn't match the comments and description given from past reviews and research I did."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ADAM JAY COCHRAN",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T20:04:38.000Z",
          "Titre": "Not received my order and it says…",
          "Contenu": "Not received my order and it says returned and I haven't received my money back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesse Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T18:58:56.000Z",
          "Titre": "Haven’t received order",
          "Contenu": "Haven’t received order On UPS.com it says it was going to be delivered on July 22nd and nothing yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darren Meredith",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T01:55:06.000Z",
          "Titre": "Shipping sucks",
          "Contenu": "Shipping sucks, csr response was subpar. Try to force you to use that crappy app to check on shipping."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angel R",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T15:35:12.000Z",
          "Titre": "the product was good but the packaging…",
          "Contenu": "the product was good but the packaging was terrible and you probably are aware of the problem because we as costumer don't want anything that we spent our money to get damaged by some one in the distribution department who do not care about other peoples purchases."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aurelio Mendez",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T02:09:32.000Z",
          "Titre": "I’ll never buy from this seller I never…",
          "Contenu": "I’ll never buy from this seller I never received my package and they do not do refunds or replacement really bad customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Belvenise Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T19:06:10.000Z",
          "Titre": "One of the speakers came defective…",
          "Contenu": "One of the speakers came defective doesn’t work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blake Hulin",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T17:35:17.000Z",
          "Titre": "It has almost been a week and my…",
          "Contenu": "It has almost been a week and my package still has not been shipped out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Briar Frady",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T00:48:45.000Z",
          "Titre": "Said delivery was gonna be on the 13",
          "Contenu": "Said delivery was gonna be on the 13, then was pushed to the 16th. After I paid for 2 day shipping."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gordon peterson",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T00:17:35.000Z",
          "Titre": "I bought this 650 RMS 12 inch subwoofer…",
          "Contenu": "I bought this 650 RMS 12 inch subwoofer hooked it up and all it does is hum"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "OWNER OF CAR-MEDIX",
          "Nb_Reviews": 3,
          "Date": "2023-09-14T09:43:40.000Z",
          "Titre": "Worse company ever",
          "Contenu": "Worse company ever. Missing items 3 amps and elite gauge wire would not replace"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oscar",
          "Nb_Reviews": 6,
          "Date": "2023-08-27T20:42:52.000Z",
          "Titre": "I bought ATv 2  2300 blew quick!",
          "Contenu": "I bought ATv 2  2300 and maybe and use some on the weekend and it blew with maybe 20hrs on it. It sounded nice but it did blow pretty quick!:("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ray Redcay",
          "Nb_Reviews": 3,
          "Date": "2023-03-30T21:38:26.000Z",
          "Titre": "The speakers I just received won’t fit…",
          "Contenu": "The speakers I just received won’t fit my truck without modifications"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Allen Dausch",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T05:00:57.000Z",
          "Titre": "I haven’t received"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Shawn Sicard",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T11:39:43.000Z",
          "Titre": "I was charged $118.00 for 2 T-Shirts.",
          "Contenu": "I was charged $118.00 for 2 T-Shirts.Understandability there is a dollar exchange rate. Shipping charges are excessive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T04:24:31.000Z",
          "Titre": "Installed amp only worked for a couple…",
          "Contenu": "Installed amp only worked for a couple hours trying to get warranty is crazy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ivey William Rainwater",
          "Nb_Reviews": 2,
          "Date": "2023-01-31T02:44:17.000Z",
          "Titre": "had a local company install afterr all…",
          "Contenu": "had a local company install afterr all day yes all day 'it had a dead short many hours just too start over"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlos Silva",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T23:10:58.000Z",
          "Titre": "Bad shipping",
          "Contenu": "What went wrong I ordered a amplifier and a subwoofer box only got the subwoofer don't understand if I purchase them together why didn't they arrive together it's been close to 2 weeks and I still haven't received my amp I will never purchase anything from them again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Agapito Lucero",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T17:57:31.000Z",
          "Titre": "Never received them not sure if it was…",
          "Contenu": "Never received them not sure if it was the company or ups"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Philip Cleveland",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T00:36:00.000Z",
          "Titre": "I have repeatedly asked for a return…",
          "Contenu": "I have repeatedly asked for a return label for a product that didnt work with my amp, within mins of putting the order in i realized the connector was different than whats on my amp, i emailed them twice asking about it, finally after the second email they responded saying thabk you for your purchase nothing else, so i ordered an adaptor from amazon also, both arrived plugged them in and didnt work, started a return and they finally reply saying they will refund me 25$ just comfirm my address meanwhile i spent 40$ on the item, i reply back saying thats not right at all that i shouldnt have to pay to return it to you after the first two emails were ignored of mine asking about if it would work, now 6 emails later after they told me to comfirm i have heard nothing from them, they are ignoring me, will never do business with them again, stay away from this company!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cecil Benefiel",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T02:09:12.000Z",
          "Titre": "They told me a 1500 would be good for…",
          "Contenu": "They told me a 1500 would be good for the loaded 12's .but when I hooked it up to them . it smoked the speakers ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Flavio Paniagua",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T19:56:23.000Z",
          "Titre": "I received my 10” ctsounds strato…",
          "Contenu": "I received my 10” ctsounds strato yesterday and was so excited about it, but today when I opened it to install to my surprise it was damaged. I would like to exchange this for a new one like I payed for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Diggs",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T23:24:38.000Z",
          "Titre": "Zero response and lack of accountability by customer service department",
          "Contenu": "I purchased an amplifier. Four months later. The amplifier goes into protection mode and is otherwise no longer working. I have sent emails asking for a RMA to return defective amplifier. No response. And no follow up by customer service department. Never purchase anything from CT Sounds. They are very helpful and responsive prior to purchasing their products.Standing by their products post-sale or trying to remedy issues, clearly within the warranty period. No accountability or response. Purchase at your own risk."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryan Harris",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T14:30:22.000Z",
          "Titre": "Not happy with customer service",
          "Contenu": "The speakers I received from CT sound look like they were display model put in a package and sent to me. When I went to install the speakers the wiring for the 6.5 mid was good the wiring for the tweeters were good but the wiring for the 3.5 mid was incorrect. When I contacted CT sounds customer service they offered to send me the correct wiring if I pay for the shipping. I should not have to pay for shipping for a mistake that was made at the company level not my own. I am very disappointed with CT sound and their customer service. Do Better"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jared B",
          "Nb_Reviews": 1,
          "Date": "2022-07-29T21:08:29.000Z",
          "Titre": "Poor",
          "Contenu": "Poor. Was sent a defective amp and customer service will not respond to any emails. Amp is under warranty and didn’t work properly off the bat.Edit: customer service has reached out with updates/ apologies. Will update review based on how the rest of this experience goes"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DAVID",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T08:00:10.000Z",
          "Titre": "THIS PLACE IS A SCAM",
          "Contenu": "I NEVER RECEIVED MY ORDER."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacob reinsch",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T15:20:19.000Z",
          "Titre": "My speaker was damaged when I opened…",
          "Contenu": "My speaker was damaged when I opened the box..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nope",
          "Nb_Reviews": 1,
          "Date": "2022-10-02T15:55:20.000Z",
          "Titre": "I was going to start my business with…",
          "Contenu": "I was going to start my business with CT sounds but dealing with there return policy and customer service I've chose not to do business with them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Cutshaw",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T18:01:19.000Z",
          "Titre": "Still have not received my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "william linares",
          "Nb_Reviews": 2,
          "Date": "2021-11-25T05:11:47.000Z",
          "Titre": "Really disappointed",
          "Contenu": "Really disappointed. I been trying to keep track of my item and I just don't get a respond. For a company to work great they should have a phone number to get a quick respond. And don't have to wait for hours for a response..first and last time that I purchase from here. I may be returning the item back or deal with my credit card. We see I hope I can change my point of view."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edward Pellegrino",
          "Nb_Reviews": 2,
          "Date": "2021-11-29T11:35:56.000Z",
          "Titre": "Ct150.4",
          "Contenu": "Customer service was decent. Someone answered all my emails.Product was not. Bought a CT 150.4 and was not happy from day 1. My jl audio 300/4 (rated at half the power of a 150.4) walked all over this amp.Cuts in and out at high volume and gives bad interference that I never had in this vehicle since I put the system in.I was hesitant to try this brand and I wish I went with my gut instinct.  I basically threw away 220$"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leiora",
          "Nb_Reviews": 7,
          "Date": "2023-04-25T16:30:01.000Z",
          "Titre": "I didn’t receive any thing yet someone…",
          "Contenu": "I didn’t receive any thing yet someone stole it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose Sanchez",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T01:36:39.000Z",
          "Titre": "I give this a 1 star",
          "Contenu": "I give this a 1 star , but if I could I would give it a 0 star. I had got 3 subs from here. The first 2 came good, they are brand new. But this one looks like someone returned it & they shipped it to me. It is all scuffed up on the cone area. The plastic the subwoofer comes in looks like it was all crushed up & then they just put the subwoofer back into it. Also there is like crumbs or something onto the top of it. The stickers/ manual Was also all messed up as well. Also the chrome is already getting rusted bad. It also has a smell to it, not like the others or normal smell.  I never had a bad experience with the 1st and 2nd subwoofer I ordered, I was pretty happy with it till now. I’m not the type to give bad reviews or anything but when you spend over 100$+ you would like it to be new."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Raven",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T15:52:28.000Z",
          "Titre": "Was anxiously awaiting my order",
          "Contenu": "Was anxiously awaiting my order, which was supposed to get to me in a few days after order, but it never shipped. It sat in their warehouse and they didn't expedite it out to me after I had to write to them asking about it. Not good service at all. Not at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Francisco Rosas",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T00:01:18.000Z",
          "Titre": "Couldn’t buy extended warranty on the…",
          "Contenu": "Couldn’t buy extended warranty on the amp I got. Had bought amp before and was able to add extended warranty that time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gabriel Lopez",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T21:33:35.000Z",
          "Titre": "hooked up the amp and everything and…",
          "Contenu": "hooked up the amp and everything and the amp went into protect mode, and yes i know i did everything right i double checked and even redid everything, did all the troubleshooting and still nothing, now CT isn’t answering anymore"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gabe",
          "Nb_Reviews": 2,
          "Date": "2023-08-05T14:03:12.000Z",
          "Titre": "Never received product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Pontrelli",
          "Nb_Reviews": 2,
          "Date": "2021-10-12T12:36:16.000Z",
          "Titre": "I tried to find a number to contact…",
          "Contenu": "I tried to find a number to contact someone because my rear door speakers were 5.25 and I wanted to change my order. I contacted you 30 minutes after I placed the order and no one ever reached out. What a joke!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Payne",
          "Nb_Reviews": 2,
          "Date": "2021-12-02T01:30:22.000Z",
          "Titre": "Amp came in defective and they want me…",
          "Contenu": "Amp came in defective and they want me to send all kinds of pics of wiring and wait for their review for a replacement kinda crazy saying I spent my money now I’m waiting won’t order from ct again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick Blesi",
          "Nb_Reviews": 2,
          "Date": "2022-06-02T20:34:30.000Z",
          "Titre": "Been installing amps in my vehicles 30…",
          "Contenu": "Been installing amps in my vehicles 30 years this thing stopped working turned back on a second and the nothing didn't blow my 100 amp fuse ,just toast....."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dewayne  Gregory",
          "Nb_Reviews": 1,
          "Date": "2021-11-07T19:10:32.000Z",
          "Titre": "I ordered a meso speaker for my CT meso…",
          "Contenu": "I ordered a meso speaker for my CT meso system install. That ive got a planned YouTube channel. And never recieved the speaker. Im so upset because I attempted to contact CT company because it was sent to the wrong address in another state. I do not have any contacts at that address. When I contacted the carrier. I was informed only the shipper can change and reroute the package through Amazon logistics. I attempted to contact ctsounds almost 3 hours before the shipping agency first picked up the item to correct this problem and was left wondering whats going on. Then told there's nothing that can be done. I have liked what I've seen from each product but this experience was pretty bad. As I had a problem and not much was dont to help me after I purchased the item. I still don't have the item."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raymond T Sivell III",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T19:59:40.000Z",
          "Titre": "Service is horrible"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Menera",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T05:56:55.000Z",
          "Titre": "Package didn’t come in"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Dright",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T00:31:06.000Z",
          "Titre": "I was very disappointed on my…",
          "Contenu": "I was very disappointed on my experience with CT Sounds. I ordered their CT-3000.1D amp and when I had it installed, it was DOA. I reached out to CT and they told me to send it back but they charged me $20 shipping even though it wasn't my fault. Then I was told that they couldn't send me a replacement because that amp line was getting new heat sinks. I asked could I try something else then they asked my setup with I told them was 4 CT 8\" subs ending with 1 ohm. So they suggested to strap 2 CT-1500 amps together so I had to buy them at axtra cost. I received the amps just to find out that if strapped they would go down to only 2 ohms which won't work for me. They told me to send those back and charged me $20 shipping again. Then they suggested a AT-3000 amp which was $200 more so I just had them send me 4 6x9s and 2 6 1/2s and called it a day. So overall, I lost money and did not get what I really wanted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Cramer",
          "Nb_Reviews": 2,
          "Date": "2022-09-11T22:58:01.000Z",
          "Titre": "Still haven't received a tracking…",
          "Contenu": "Still haven't received a tracking number or my products a week later with 2 day shipping"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wyatt Brooks",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T02:31:12.000Z",
          "Titre": "Extremely slow",
          "Contenu": "Very, very, very slow customer service. Takes days to get an email."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emmanuel Alvis",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T15:43:54.000Z",
          "Titre": "I haven’t received yet ,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Blalock",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T23:54:37.000Z",
          "Titre": "Awful",
          "Contenu": "Sub showed up already defective, yet customer service deemed it my fault. Just awful and slow. Shame since their products to look nice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jarret Landry",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T06:24:09.000Z",
          "Titre": "Still haven’t received anything so…",
          "Contenu": "Still haven’t received anything so kinda hard to rate the service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ulises Orozco Ambriz",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T07:29:56.000Z",
          "Titre": "Never received my amp not going with ct…",
          "Contenu": "Never received my amp not going with ct sounds again since they couldn't do anything for me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "B.A",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T02:22:11.000Z",
          "Titre": "Amp did not work at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Caudill",
          "Nb_Reviews": 1,
          "Date": "2021-05-04T17:24:06.000Z",
          "Titre": "Still have not received my speakers!",
          "Contenu": "Still have not received my speakers!! Said they were sent back due to damage and have not received anything yet!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Billy Brann",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T20:16:58.000Z",
          "Titre": "Wrong items sent",
          "Contenu": "Wrong items sent, unable to contact CT Sound, no phone number listed on any invoices.  Poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adan Cobos",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T20:33:38.000Z",
          "Titre": "I give it a one star because i never…",
          "Contenu": "I give it a one star because i never got my package and i already made a report"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eddie T Williams",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T23:49:28.000Z",
          "Titre": "My package was busted open I'm so…",
          "Contenu": "My package was busted open I'm so disappointed 😞"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Pontrelli",
          "Nb_Reviews": 2,
          "Date": "2021-10-13T14:42:20.000Z",
          "Titre": "I sent several messages and still a…",
          "Contenu": "I sent several messages and still a week and a half later haven't gotten a reply. So sad!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Littlefield",
          "Nb_Reviews": 4,
          "Date": "2023-09-20T13:13:41.000Z",
          "Titre": "Customer service was terrible"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jesse Patchin",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:57:37.000Z",
          "Titre": "Going on 5 days no package in site…",
          "Contenu": "Going on 5 days no package in site really upset"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vince",
          "Nb_Reviews": 3,
          "Date": "2023-10-16T02:46:44.000Z",
          "Titre": "First time ordering from CT sounds and…",
          "Contenu": "First time ordering from CT sounds and it said 2 day free shipping and it’s been 5 and still don’t know when I’m getting it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ron Tanner",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T06:02:28.000Z",
          "Titre": "You Get What You Pay For",
          "Contenu": "Speakers that I purchased are the cheapest ones CT has 5x7, There's an old saying you get what you pay for!!! The Cheaper ones don't come with stickers either. I'm just not happy with this choice this time. I received a good offer email for the better 5x7 speakers but CT wouldn't honor it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Raymond T Sivell III",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T20:53:34.000Z",
          "Titre": "Worst return policy ever",
          "Contenu": "Worst return policy ever, compounded by the fact your website only allows one \"code\" forces multiple losses by returning the product. A store credit is not a discount or gift card, and shouldn't be treated as such in regards to A RETURN!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Talisha Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T01:04:25.000Z",
          "Titre": "Lesson learned",
          "Contenu": "One of the component speakers was rattling from the time of installation. A lot of low frequency noise when using the LC2. Customer service is slow, can't call and speak to anyone about the issues. Lesson learned"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-08-15T19:23:04.000Z",
          "Titre": "Not So Sure If I Should Give 5 Stars Yet",
          "Contenu": "I bought some speakers for my Chevrolet Silverado 1500 LT bought the wrong ones kept trying to text kept trying to text finally got a hold of somebody and I just wanted to label sent back the wrong speakers and get the right ones.I understand that they pay for the shipping but you don’t get much help online. You can’t talk to nobody on the phone. I hate when you can’t talk to anybody on the phone. You have to text them and they get back with you text too long I should be able to call them and ask questions I still don’t know what kind of speakers to order. they need to have better communication. It’s like they don’t really care."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "E.W.",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T08:23:57.000Z",
          "Titre": "Non existent support",
          "Contenu": "I did not realize that shipping on my $20 item was $45 until I paid. It was my oversight however I immediately tried contacting the company to report that I want to cancel my order since the shipping was more than double the item price, but I never got a response from them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Hughes",
          "Nb_Reviews": 4,
          "Date": "2022-12-31T15:28:00.000Z",
          "Titre": "Ordered a two way component set of 6.5…",
          "Contenu": "Ordered a two way component set of 6.5 inch speakers but received standard two way speakers instead. Disappointed and now install job will need to be delayed or I will have to purchase other speakers locally."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Navarrette",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T01:43:05.000Z",
          "Titre": "Delivery",
          "Contenu": "Your email said 2 business days for delivery. I ordered it last Thursday.  Friday was the first business day. I just received an email saying it won't be here until tomorrow. That's 4 business days."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "james Smith",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T09:17:19.000Z",
          "Titre": "I ordered it not realizing that the…",
          "Contenu": "I ordered it not realizing that the inputs there were four of them but you cannot use all four at the same time I realize this 5 minutes after I ordered it and I called to try to get them to cancel the order because there's not what I wanted"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Trent",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T03:06:26.000Z",
          "Titre": "Bad Customer Service",
          "Contenu": "Quick to take your money when your wanting to purchase something but they drag out the refund process and take their sweet time, Great products just not good customer service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Messick",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T03:48:18.000Z",
          "Titre": "First let me say the wiring  are…",
          "Contenu": "First let me say the wiring  are awesome. However, they have a 150 amp fuse for 4 gauge wire. 4 gauge wire is rated for a 60 amp fuse. Second is the speaker wire, it came as a kit but didn’t have the correct ends to hook up to the speakers. Also, the rca cables are one set at 17’. Wish they would have sold it in a 12” set so it could be in my fairing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ross Wellenbrink",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T20:20:46.000Z",
          "Titre": "Bought a speaker box and was not given…",
          "Contenu": "Bought a speaker box and was not given the discounted price for it so now I have to send it back and re buy it to get the discount"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erwin Hutcherson",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T04:18:46.000Z",
          "Titre": "They can start by not advertising two…",
          "Contenu": "They can start by not advertising two biz day shipping when it takes four biz days plus. I bought on the two day claim and I'm still waiting ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris H",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T23:06:19.000Z",
          "Titre": "Forgot to ship my order.",
          "Contenu": "6 days after my order I emailed ct sounds to verify my order had shipped.  It had not.  Not sure how they forgot to ship my order but it was shipped the next Monday and was received two days later."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew Jarrell",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T06:24:40.000Z",
          "Titre": "Item was shipped in 2 seperate orders",
          "Contenu": "Item was shipped in 2 seperate orders. Only one shipping number had tracking info and my biggest complaint is the shipping box says what exactly is in it so makes it super easy to be stolen. Really dissapointed in that aspec. Haven't hooked up my Meso 12s as they wouldn't fit in my Harmony audio prefab box so will review those after I build one or find a better pre fab they'll fit it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marco Aguayo",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T06:45:21.000Z",
          "Titre": "I can’t do that because I don’t get…",
          "Contenu": "I can’t do that because I don’t get anything"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher colpetzer",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T17:32:45.000Z",
          "Titre": "Ok subwoofer .30 day no hassle return is a lie.",
          "Contenu": "I like how u can feel subwoofer.but seems to miss some low frequencies. My other subwoofers have.its alright.30 day no hassle or questions return satisfaction. Is BULL... !I tried to return something about sound was off.i had to make video with this and that whole list of things.still told I couldn't return a subwoofer after 3 days of having it.sucks.i do like there subwoofer.but not worth spending money to have chance b stuck with junk."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Unhappy customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T02:18:42.000Z",
          "Titre": "Poor shipping practices",
          "Contenu": "Ordered an amp and wiring kit and amp showed up but no wiring kit I paid for.Not happy especially when I had to wait 5 to 6 days to get the wiring kit so I'm able to connect the amp at all.Poor shipping practices that to me are inexcusable and probably won't order from this company again..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Antuane McPherson",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T22:05:49.000Z",
          "Titre": "Taking way longer than I was originally told",
          "Contenu": "Keep changing my delivery date"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Larry Bowen",
          "Nb_Reviews": 2,
          "Date": "2022-12-25T12:12:27.000Z",
          "Titre": "I'm still waiting for the order"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Moises Torres",
          "Nb_Reviews": 1,
          "Date": "2021-08-08T22:33:24.000Z",
          "Titre": "Terrible shipping estimate.",
          "Contenu": "I put in an order on August 2nd that still hasn't arrived today on August 8th. Tracking shows it won't arrive until August 11th. The website claimed it was Free 2-5 day shipping. I wouldn't mind if it said free 1-2 week shipping. I might've purchased faster shipping. Or not. I'm sure the OFC big three kit that I ordered will be great but the lack of a dishonest/inaccurate shipping estimate was disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Filiberto Salazar",
          "Nb_Reviews": 3,
          "Date": "2021-08-10T23:17:19.000Z",
          "Titre": "One of my 4 subs arrived with glue on…",
          "Contenu": "One of my 4 subs arrived with glue on the dust cap and the surround had a 3 inch scratch/rip. Emailed the company and still haven’t heard from them. Sucks because Parker’s review on YouTube convinced me to buy these and now I’m stuck here waiting. Got all my wires, stereo and amp but here I am waiting for a response. Not good customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Missey",
          "Nb_Reviews": 3,
          "Date": "2021-07-08T00:48:05.000Z",
          "Titre": "The wait  for ya to ship things off can…",
          "Contenu": "The wait  for ya to ship things off can be a lot faster. Because  I order my Amp on the 2nd  and today is the 8th and still wasn't been ship out .I know this weekend  was the 4th of July weekend  but still it could  have been ship out a lot sooner"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Murrah",
          "Nb_Reviews": 2,
          "Date": "2021-12-02T05:53:35.000Z",
          "Titre": "Not what I thought",
          "Contenu": "Speakers came packaged very well and looked great box is really good but the speakers cannot Handle any power from an amp of 300w and higher. I unboxed them tonight when I got home from work and hooked them up to my 600w Jensen amp and they did not perform well under the wattage they just kept cutting off so I went down to a 300w boss amp and it was pretty much the same result. I don't know if I just got defective speakers or they just have to be pushed by a 100w amp kind of disappointed in the purchase cause the specs looked good and the appearance was great. I expected 2 600w speakers each that could together handle a 600w amp very disappointed in outcome they cannot handle 300w."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zildjian Olson",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T03:31:18.000Z",
          "Titre": "Two day same shipping took 6 days?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joshua Garten",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T12:17:11.000Z",
          "Titre": "It took 13 days to receive my order so…",
          "Contenu": "It took 13 days to receive my order so I felt like I was getting scammed since normal ground shipping via ups can go coast to coast in 4 days but what I ordered finally showed up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Filiberto Salazar",
          "Nb_Reviews": 3,
          "Date": "2021-08-10T23:11:03.000Z",
          "Titre": "Not so good customer service or QC",
          "Contenu": "Got my 4 subs this weekend and one of them had glue on the dust cap and a 3 inch cut on the surround. Sent pictures of it to you guys and haven’t heard anything."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "michael g",
          "Nb_Reviews": 2,
          "Date": "2022-12-01T05:15:01.000Z",
          "Titre": "so far 2 days late"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Austin Symank",
          "Nb_Reviews": 2,
          "Date": "2022-03-03T19:49:50.000Z",
          "Titre": "Amp pushes hard but requires lots…",
          "Contenu": "Amp pushes hard but requires lots battery to operate and the ozone 10'S DIDNT last 2 wks....  so kinda disappointed...."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jose Martinez",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T03:18:09.000Z",
          "Titre": "Bought 2-8” CT MESO subwoofers and 3…",
          "Contenu": "Bought 2-8” CT MESO subwoofers and 3 months later the sounded on both are getting detached and sound horrible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pauly",
          "Nb_Reviews": 4,
          "Date": "2022-09-17T19:51:33.000Z",
          "Titre": "Amp lasted about 15mins"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amp guy",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T22:55:49.000Z",
          "Titre": "Not delivered as promised within 2 to 5…",
          "Contenu": "Not delivered as promised within 2 to 5 days"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Austin Hecker",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T14:12:48.000Z",
          "Titre": "Delay to deliver My package"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:16:40.000Z",
          "Titre": "Ordered an amp and a pre loaded…",
          "Contenu": "Ordered an amp and a pre loaded enclosure.  The sub box showed up with a broken terminal on it. I emailed the company and they did respond but then wanted more and more info on item. It's a cheap item so not sure why they couldn't just send a replacement without a bunch of questions.  I can understand questioning damage to expensive items but a few dollar part is a bit ridiculous.  Plus why buy subs than have to go through questioning for several days then possibly wait even longer to use those subs if they do or don't decide to send a replacement part. Decided to just buy a new terminal so I could use the subs as I expected to when delivered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Jordan",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T23:04:19.000Z",
          "Titre": "Ship in plain box’s",
          "Contenu": "The amp I great but but u want to charge me an extra $15 bucks to ship to my P.O. Box but the amp I bought 6 months ago u did ship to my P.O. Box and did not charge me fo that so had to ship to my address and it was felt on my steps the box it was in had ct sounds all over the outside of it I work so it sat there on the steps for hours before I could get home thank god it was still there maybe when u ship to someone house and sit out side u might put it in a plain box something to think about other wise great amp"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Seth Cotton",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T11:17:01.000Z",
          "Titre": "Would probably give them a better…",
          "Contenu": "Would probably give them a better rating but I haven't hooked them up to an amp yet, so I don't really know what all they can do. For them to be only hooked up to my head unit they sound really good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mason",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:37:13.000Z",
          "Titre": "CT Sounds Audio Equipment",
          "Contenu": "I am writing this review based on two purchases from CT Sounds over the last 3 months. My review for these two purchases will reflect a 3 star review. My first purchase was flawless, so I am giving CTS 5 stars based on that purchase. My most recent purchase deserves a1 star review. My project will not be ready to start for about another 3 months, but I wanted to take advantage of their Black Friday promotion which offered a 23 % discount on their items. I ordered an amplifier and two sets of speakers. Prior to them shipping the items, I sent them an email letting them know that I had made a mistake on one of the speaker sizes and needed to modify my order. I gave them the option to correct the speaker size at that time, prior to shipping, or I could take the order as processed and check fitment, whatever was easiest for them. It was their recommendation to take the order as is and that I could exchange if the item did not fit.I received my order quickly, and within an hour of receiving the CTS equipment, I sent an email to CTS requesting an exchange as the items did not fit.Being that I had to reduce the size of the speakers, I also needed to exchange the amplifier as it was too powerful for the smaller speakers that I would ultimately need. I contacted customer service, and they said it was not a problem and that a return label would be sent asap so that I could return the equipment.Once I got the equipment in the mail back to CTS, I asked how the refund or store credit would be processed. I was expecting that whatever I purchased or exchanged would also come with a 23% discount since my initial purchase was made within that Black Friday sales window. However, that did not happen. I was given a cash refund for the cost of the equipment, however I was not refunded the state tax on that equipment. And, not only that, CT Sounds also applies a City of Houston Tax (I have not seen that and I am a Texas resident). That is a significant amount considering the size of the purchase I made. If CTS would have given me the same discount that I received with my initial purchase, I would be fine paying for the cost to ship back the items. Saying all that, CTS has been very courteous and professional through this situation, but I am disappointed with how it was handled. If I sent an email prior to shipment and it is their recommendation to check fitment and then make a decision, I think they should take care of a repeat customer and extend the discount that was given to make the original purchase. I am not writing this review to influence anyone not to purchase from CT Sounds. As previously mentioned, their customer service reps were very courteous both prior to and after the purchase. But I will say this, you need to know what you need prior to ordering because if you don't and an exchange is necessary, you might end up paying some money for items that you will never use (state/city taxes)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick Walker",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:24:39.000Z",
          "Titre": "The product had no instruction on the…",
          "Contenu": "The product had no instruction on the removal of the large silver bolt, I had to figure out how to remove and by the time I did one tweeter was ruined but was able still to use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ulises Cazares",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T23:04:05.000Z",
          "Titre": "Yea y’all didn’t put like what wood you…",
          "Contenu": "Yea y’all didn’t put like what wood you need to use or how to put it together just how ti make the pieces also the type of like carpet you use but other than that it’s good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott W.",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T22:02:53.000Z",
          "Titre": "I have not installed it yet",
          "Contenu": "I have not installed it yet. But I have seen youtube videos and I like it so far. I'm sure I will be happy. I got it on Black Friday deal at CTSOUNDS.COM.Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denise Proebstel",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T05:51:07.000Z",
          "Titre": "Everything was great except it says 2…",
          "Contenu": "Everything was great except it says 2 day shipping but then it goes through a carrier and it's however long they take so it ended up taking 10 business days instead of 2. Would be nice to know that before ordering not after."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Santiago Maldonado",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T05:45:12.000Z",
          "Titre": "The speakers are great but i got 2 6.5…",
          "Contenu": "The speakers are great but i got 2 6.5 meso and one came bent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dillon",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T04:32:16.000Z",
          "Titre": "Will buy again",
          "Contenu": "I recently purchased from CT sounds over two weeks ago and just now receiving my package due to a technical issue and on the company’s end. But they were very quick to respond to my email and got it shipped out right away. Good communication"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bret H.",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T22:40:14.000Z",
          "Titre": "I like the product very much",
          "Contenu": "I like the product very much, but the magnet came in with a scratch on it. I've been in contact with customer support, trying to get this resolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenten James",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T20:58:04.000Z",
          "Titre": "Great product, ordering process could be modified.",
          "Contenu": "The product was good, the only issue is I placed my order and realized instantly that I made a mistake. I messaged within a minute of placing the order to swap a dual 2 ohm sub to a dual 4 or cancel all together so I can reorder the correct one. They said they couldn’t find the order so I had to pay the restocking fee. This seems inefficient and unnecessary when I messaged right away but I accept that I made the mistake of ordering the wrong one. A better system for cancelling or modifying an order should be in place."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "FISHNTYME",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T22:36:24.000Z",
          "Titre": "Where did all the people go?",
          "Contenu": "The product is fine. Works like it should, I think. Not sure it is getting 1500w RMS @ 1ohm. 8\" meso appears it can handle more.Shipping was very poor for 2 day shipping. I understand I ordered on a Saturday and that particular Monday was a holiday. However, item didn't show up for 10 days.I kept getting email to review the product. Can't. Why? because it has even got here yet. I replied to 1 of them. Thought maybe someone would chime in with some customer service. Nope. Never heard back. Even if it was out of their control, some contact would have been nice. Unusual as I have received great CS in the past."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Baldomero",
          "Nb_Reviews": 5,
          "Date": "2023-09-07T19:11:10.000Z",
          "Titre": "The box was broken on transit is the…",
          "Contenu": "The box was broken on transit is the only thing I didn’t like the driver that was shipping the box he didn’t care and just left it all broken in front of the house"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Gooding",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T00:06:22.000Z",
          "Titre": "set of ozone 10-D4",
          "Contenu": "Bought a set of ozone 10-D4Hook it up based on you alls recommendations to a ATv2-1400.1d // 1800 Watt RMS Monoblock Car Audio AmplifierI Have the subs wired to 1 ohm configuration.All I smell is them subs cooking,I can’t finish a whole song.Maybe some advise on the amp"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "anthony thompson",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T01:27:27.000Z",
          "Titre": "Have not received my product yet",
          "Contenu": "Have not received my product yet. It says two day shipping and it’s been five days now since I ordered says it will be here Friday only complaint need faster shipping like it says on your website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T01:05:38.000Z",
          "Titre": "They are decently built and sound good",
          "Contenu": "They are decently built and sound good, but the cones weren't installed centered so the bolt holes were covered by the surround and the center caps aren't lined up/centered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy Page",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T03:50:05.000Z",
          "Titre": "Have been unable to find a enclosure…",
          "Contenu": "Have been unable to find a enclosure that will fit the the 7.48 cut the sub enclosure needs to be for the subs without building my own custom one"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bobby Wilkinson",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T16:48:28.000Z",
          "Titre": "I'm still up and down about this",
          "Contenu": "I'm still up and down about this. I'm running 800 true watts and I've been easy on the sub so far, but it seems like its getting hot and smells like like burnt wire coming out of the sub box. I guess we'll see. It looks like a quality speaker. I'm giving it a break in period, and then I'm going to put the power to it.????"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven Lamb",
          "Nb_Reviews": 7,
          "Date": "2023-05-22T10:07:29.000Z",
          "Titre": "The 3 stars is strictly due to the…",
          "Contenu": "The 3 stars is strictly due to the customer service rep not taking initiative to make me happy. A simple jesture of good faith would have done wonders. The subs I bought meso 10s  are nothing short of phenomenal. No complaints they sound great. The issue I had was the sub enclosure I bought from them. I checked and double checked to see if the meso would fit in this enclosure and the website has a green check mark confirming. The sub enclosure opening is listed at 9.45\" and the sub listed the cutout size as 9.29\" perfect right? The big day arrived and my subs wouldn't fit. The cutout was to small. So I contacted customer support and was told to sand the box to make them fit. I paid good money to not have to worry about this and did my homework to make sure of compatibility. All they had to do is make it right offer a replacement. But then communication just stopped after I told them I probably wouldn't purchase from them again. This would have been a 5 star glowing review had it not been for the customer service rep that had no interest in making this right."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marc Mcneil",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T22:00:17.000Z",
          "Titre": "Told me to wire a 1 ohm but it is not…",
          "Contenu": "Told me to wire a 1 ohm but it is not possible to wire a 2 ohm speaker at 1 ohm wish they would have sent me 4 ohm so I could wire it properly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WILLIAM SWANK",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T13:37:25.000Z",
          "Titre": "Haven't installed equipment yet but…",
          "Contenu": "Haven't installed equipment yet but reached out to customer service via email (because they don't list a phone number) and never got a response."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clarence Lambert",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T00:41:12.000Z",
          "Titre": "I have a return item what can I do?",
          "Contenu": "I haven't been able to contact anyone about a return item. How can I return my speaker and get  the correct item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis Oliver",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:21:57.000Z",
          "Titre": "shipping takes too long"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "German Gonzalez",
          "Nb_Reviews": 2,
          "Date": "2023-02-04T02:44:48.000Z",
          "Titre": "Coils start to smell at 1ohm",
          "Contenu": "Good sound and everything but the ct tropo xl 12inch sub I got I have it hooked up to the ct1000.1d amp at 1ohm sounds good but it smells like the sub is burning or something. Idk if it blows I guess I'll have to send it back.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rictor",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T11:17:43.000Z",
          "Titre": "Bought both speakers said 2 day…",
          "Contenu": "Bought both speakers said 2 day shipping took 5 days. Speakers are great though shipping sucks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex Kempson",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T04:59:09.000Z",
          "Titre": "The spiders need to be reconstructed to…",
          "Contenu": "The spiders need to be reconstructed to make them a little slimmer. Will not fit in 3 different boxes that are 12 inch and all with different diameters by the decimal. Great sub great bass/sound though when finally was able to make it work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T13:44:33.000Z",
          "Titre": "Super excited feeling all gone",
          "Contenu": "I have been excited for my ne speaker / amp upgrade for a couple years now and went ahead and bought all the equipment due to having a job kids I haven’t had time until now to install them, system sounds great high-quality the only issue is one of my Stratton component sets had a bad tweeter right out of the box. So I get a hold of ct sounds and let them know and all they can tell me is my Brand new speakers are out of warranty because I bought them previously and that they no longer make them. good feeling all gone so here I am with a bad new speaker And the only thing ct sounds can offer is for me to buy a new set of speakers because they don’t make these any longer just beware if you’re not gonna hook up the system quickly they’re not gonna cover it,Other than that it sounds fantastic and I am very happy but will probably switch brands due to this on next build."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alice Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T02:10:11.000Z",
          "Titre": "I didn’t enjoy your customer service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim Merrick",
          "Nb_Reviews": 3,
          "Date": "2022-08-30T06:14:42.000Z",
          "Titre": "Rethinking the overall situation",
          "Contenu": "The only problem I have with the whole circumstances of this situation is I had a problem with my amplifier and the only way I can get in touch with you is email now it's been about 2 or 3 days and I've been trying to contact you guys and you haven't gotten back with me yet I have sent you my email and I need to get verification where to send amplifier at where you guys can check it out for a defect this is the only problem I have with you guys we need to have a phone number from you guys where we can get in touch if we have a problem with with your products otherwise I'm very pleased with what y'all have thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rashad Jennings",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T05:33:41.000Z",
          "Titre": "Ordered the elite power wire kit.The…",
          "Contenu": "Ordered the elite power wire kit.The kit was so so wish it was real copper."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeremy Hicks",
          "Nb_Reviews": 2,
          "Date": "2022-07-23T22:56:44.000Z",
          "Titre": "No customer support yet,possible bad AT3000.1d, hoping to exchange.",
          "Contenu": "I bought a 3 way Meso 6.5 component speaker set, two Meso 10”D4 subwoofers and the AT 3000.1D amplifier. I followed the booklets that come with them, not enough information in any of them, would help to have more specifications of all three types of items. Component speakers and subwoofers worked good until the amp heated up and cut out the sound, have tried contacting them multiple times now and no response, warranty is 30 days and I’ve had them 7 days, would really have been nice to receive a response."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T05:12:43.000Z",
          "Titre": "Well they look great sound good",
          "Contenu": "Well they look great sound good. I'm not really impressed for the price they cost I'm kinda let down.  I could have went with ds 18 like I have in my work van which are way way louder way way clearer and half the price. Not saying there bad. I'm just not impressed at all. Was expecting more after reading reviews. The people who hype them up must have never heard or had great speakers. I'll be pulling them out and going with all ds 18 like my work van has. Way more bang for the buck for way  less money"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 2,
          "Date": "2022-06-25T05:46:34.000Z",
          "Titre": "You get what you pay for…",
          "Contenu": "The amp is definitely worth the price but the bass knob is horrible and they don’t even offer a better one even if you pay are willing to pay extra. The LED that is right next to the knob is so bright that you can’t even tell what level you have the bass knob turned to. That along with one of the mounting ears being damaged/bent when the amp arrived is the reason for 3 stars. Overall I’m satisfied with my purchase. With a better bass knob and if the amp showed up with no damage this would be a 5 star review."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Billy Vazquez",
          "Nb_Reviews": 4,
          "Date": "2022-07-04T19:21:30.000Z",
          "Titre": "The magnet on these speakers were to…",
          "Contenu": "The magnet on these speakers were to big to fit in the 6.5 pre made box, I really wanted them but I could not change the box size due to they were going into a Polaris Slingshot so not much room in the pods to make hole bigger. I will have to return them and find a different route."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy Burns",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T15:43:43.000Z",
          "Titre": "I bought 2",
          "Contenu": "I bought 2 - 1000 watt amps. One burnt up. The other one is fine. Waiting to see what customer service does for the messed up amp."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kevin mason",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T09:20:29.000Z",
          "Titre": "Ive heard nothing but good things about…",
          "Contenu": "Ive heard nothing but good things about CT sounds so I thought I would give them a try for my new build, from front to back  but unfortunately didn't have everything I'm needing . Amp and wiring kit out of stock which is what I'm needing to go with my paint and vehicle them.   Sorta on a time frame and home they restock VERY SOON !  only reason for the 3 stars"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "B Morris",
          "Nb_Reviews": 2,
          "Date": "2022-02-23T11:10:34.000Z",
          "Titre": "I've spoke to a customer service…",
          "Contenu": "I've spoke to a customer service representative a few times about my CT-80. 4AB amp, he said he was going to send a return label but never received it, the amp works great but the fuse holders are hot on top and bottom so will work without fuses also getting pretty hot, with gain at 1 or less on HPF, regards Brian."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "raul rivera",
          "Nb_Reviews": 5,
          "Date": "2021-10-05T15:48:49.000Z",
          "Titre": "Haven't got any of the products I ordered",
          "Contenu": "Till now I can't rate the products since I've been waiting since idk when to get what I order. I used to order another brand but this was my 1st time ordering from CT sounds to see the difference between CT sounds and skar audio...but I think it's gonna be my first and last"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hunter Johnson",
          "Nb_Reviews": 4,
          "Date": "2022-10-09T07:31:58.000Z",
          "Titre": "One speaker no work right",
          "Contenu": "Uh well good but one of my speakers isn't working correctly already sent an email explaining it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ihab Samir",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T09:15:10.000Z",
          "Titre": "Very slow shipping"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Abstance",
          "Nb_Reviews": 2,
          "Date": "2021-04-16T12:25:55.000Z",
          "Titre": "Warranty request and return request is…",
          "Contenu": "Warranty request and return request is bunch together on the website makes it harder 2 do. As my first shipping label was sent to me as return request thankfully someone caught it b4 I shipped"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sam Truesdell",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T05:19:26.000Z",
          "Titre": "3 starts for the overall experience so far",
          "Contenu": "The box I received for my subs was damaged. Not only was it damaged but the hole wasn't cut out large enough to clear the basket on the subs that I also ordered from ctsounds."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T16:06:03.000Z",
          "Titre": "Not fast response",
          "Contenu": "Take too long to respond"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon Hawk",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T05:29:02.000Z",
          "Titre": "Shipping  is slow to get out ;("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jacob Laurence Brooks",
          "Nb_Reviews": 1,
          "Date": "2022-04-03T13:19:17.000Z",
          "Titre": "Okay",
          "Contenu": "Okay, I will tell you guys how I feel and what I think. I got CT-2000.1D. The shipment came very fast in about 4 business days, thanks. I tried the amp and I can say it does have a lot of power. I was running it at about 4 ohms. WOW, like I said it has a lot of power, but it does not sound good. I can get angry very fast and I apologize, but I do not like the sound quality. I have tried many class D amps from big brand names. What makes me the most upset is how I read \"CT Sounds is so sure that you will love our audio products, that we offer a 100% money back guarantee for 30 days. This isn’t your typical money back guarantee, because it’s truly a no questions asked guarantee.\", but when I went to the return process they said \"If we discover the item was used we will not issue a refund or store credit. However, we will give you the option to send the item back to you at your cost + $30 processing fee + the original pre-paid return label.\" They just were telling me that you can return it for any reason even if \"You don't like the quality of the product for any reason\".I am broken and don't know what to do, I think I just lost over $200. I put it back in the box and I don't know what I am going to do with it. I might call them and see what they say over the phone, but at this point I'm not sure."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joshua Anderson",
          "Nb_Reviews": 3,
          "Date": "2021-09-24T09:17:59.000Z",
          "Titre": "I’ve just got my amp when I hook it up…",
          "Contenu": "I’ve just got my amp when I hook it up I’ll post a review but thank you so much for the amp !!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Jones",
          "Nb_Reviews": 3,
          "Date": "2022-09-04T03:54:09.000Z",
          "Titre": "Meso",
          "Contenu": "It handles lots of power and lows are nice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marco Gomez",
          "Nb_Reviews": 1,
          "Date": "2022-04-17T18:22:39.000Z",
          "Titre": "The box design I purchased has no box…",
          "Contenu": "The box design I purchased has no box spec only measurement"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Hopson",
          "Nb_Reviews": 1,
          "Date": "2022-03-13T21:22:32.000Z",
          "Titre": "Pretty good and great price"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luis Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T02:54:52.000Z",
          "Titre": "Slow delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ulises Cazares",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T02:59:21.000Z",
          "Titre": "The subwoofers that I ordered",
          "Contenu": "The subwoofers that I ordered I tought they where going to do good but they can’t go to max but still have some good bass also I want to know why it doesn’t go max because I ordered the wires from ct sounds to but not the amplifier also I have it in my room not a car"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trap-Tee",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T07:25:53.000Z",
          "Titre": "Speakers came on time /fast loved I got…",
          "Contenu": "Speakers came on time /fast loved I got them on sale can’t beat it they hit also overall happy with these I will order more next system I do . Thanks Ct sounds"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott W.",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T21:55:23.000Z",
          "Titre": "What I ordered was packed right",
          "Contenu": "What I ordered was packed right. I got all three speaker's in one box. No problem ordering and the prices are very low.I am on my second order now and waiting for third order,not too worried about problems. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dalton Lawson",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T06:14:20.000Z",
          "Titre": "Y'all need head units.",
          "Contenu": "Brah this company is awesome. They make great products. Just did a complete overhaul on my car all new speakers, subs, and amps. Now they just need to make head units to get that 5 star rating"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jamey Mayo",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T14:35:21.000Z",
          "Titre": "I received a return pair of meso 6x9's",
          "Contenu": "I received a return pair of meso 6x9's, thank had bent screw holes and aome goo from the install and paint flaking fom a rough installation. The team is investigating it and I sent pictures of the damage. They will probably make it right, it was probably drop shipped by someone else, I doubt the team would box up a roughly used product and sell it as new. So while I am disappointed, the quality of their products that I already own make it worth while dealing with a rare issue. As long as it is a rare issue I will continue to build my system using CT sounds products. The stereo will be the only part of my system that isn't CT products. It's my first complete system build , and I want all matching equipment. So while it isn't a five Star review I would still buy from them again as long as they fix my issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Ramirez",
          "Nb_Reviews": 4,
          "Date": "2023-09-21T05:20:45.000Z",
          "Titre": "The remote bass knob on my brand new CT…",
          "Contenu": "The remote bass knob on my brand new CT 2000.1 doesnt work at all, unable to adjust. Will call customer service tomorrow. The new 150.4 kicks!! Love the way my speakers have come alive. Upgraded from Skar, never going back!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TREY",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T01:55:48.000Z",
          "Titre": "New sub experience",
          "Contenu": "Product seams high quality.  Will know more after installation.  Delivery was fast.  The Bad packaging was poor exterior packaging was smashed on Delivery had to inspect for possible damage.  Looked like it had been dropped off the truck.. as far as I know no visible damage."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Littlefield",
          "Nb_Reviews": 4,
          "Date": "2023-09-07T14:19:19.000Z",
          "Titre": "Recent purchase …",
          "Contenu": "With my recent purchase of an amplifier and speakers, I purchased the wrong coil ohm subwoofers and it would have been nice if someone on that end had noticed. I know with your sale you guys were very busy. And I understand. If there was a phone line tech info department I would have been able to get the right subs the first time. After finding out my mistake now I have to wait for package to arrive and send it back pay for shipping and wait for processing and get the right ohm coil subs headed my way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben Miller",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T16:24:12.000Z",
          "Titre": "great sub for the price",
          "Contenu": "Quick shipping, product exceeded my expectations, and it thumps! good bang on a budget. definitely likes ported box over sealed box."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Wordlaw",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T04:13:20.000Z",
          "Titre": "Overall I'm satisfied",
          "Contenu": "Overall I'm satisfied, the tropo 10s performed beyond what I expected. But the chrome jack covering on the amp was still connected to my jacks when I unplugged them. However I got it bck on correctly & the amp still performs. Customer service offered me another one but not sure about returning it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noah Smith",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T06:12:31.000Z",
          "Titre": "Box was solid and good for the price",
          "Contenu": "Box was solid and good for the price, only giving a 4/5 because it said two day shipping when I ordered Monday, I received the package Saturday so it was longer than two days, it took almost a full week. Other than that , good job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROOSEVELT JOHNSON",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T02:29:03.000Z",
          "Titre": "F150 Setup of four 8’s",
          "Contenu": "After doing my research I decided to go with this set up of 4 Strato 8’s and a 2000.1 amp . Did not disappoint and gave my F150 exactly what I was looking for. Satisfied customer!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frankie Bocook Jr.",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T09:04:09.000Z",
          "Titre": "Good price, good product, 5 days to receive.",
          "Contenu": "Nice product quality, packaged well, decent discount coupon, only gripe was it took five days to get from Texas to Arizona. The label printed same day but package didn't get out for two days. I will likely order from them again. Thank you CT Sounds."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Wallace",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T09:23:05.000Z",
          "Titre": "Still haven’t received my order",
          "Contenu": "Edit: After posting this review CT sounds reached out about the issue. Offering to send a replacement item. Also oddly enough I got a notification on the “shop” app actually stating were my order was and when it was due to arrive. In light of this I told them I would let them know whether or not I received my item. For these reasons I’m changing my review to a more positive one.Still haven’t received my order. Any tracking numbers I got don’t work. Tried the shop app, ups, and uspm? Any and all tracking info does not work… starting to think I got ripped off"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chadwick Primeaux",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T14:19:24.000Z",
          "Titre": "The speaker look very nice and came…",
          "Contenu": "The speaker look very nice and came with everything needed to install. I am not overly excited by performance but I'm am sure it is due to the factory radio and not the speakers themselves. Nice speakers and I'm sure much better sounding with better input than I have."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darrell Walker",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T03:54:18.000Z",
          "Titre": "I'm liking the components but haven't received 1 single sticker to represent the equipment I have. That's kinda lame on ctsounds part.",
          "Contenu": "I'm really liking the components I've purchased, but haven't received any stickers to represent the brand I have. That's kinda lame on yalls behalf. But I'm loving the equipment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brent Matherne",
          "Nb_Reviews": 3,
          "Date": "2023-02-22T17:33:16.000Z",
          "Titre": "I love the product 100%",
          "Contenu": "I love the product, Amps, subs, mids and loud speakers and tweeters.. The only thing I am going to say that’s a little negative, is that shipments can take longer than expected, that’s from my experience. But I highly recommend there gearb100!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rodney Harvell",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T03:24:31.000Z",
          "Titre": "This is my second purchase from CT…",
          "Contenu": "This is my second purchase from CT sounds and I love their products. There was a little misunderstanding about shipping and that's the only reason it's not 5 stars. Great company and great products no doubt about it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Hixenbaugh",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T02:32:07.000Z",
          "Titre": "Decent amplifier could be better",
          "Contenu": "It is a very good amplifier. But I went through a lot. Something happened to the amplifier I had to send it back and they said nothing was wrong with it and I knew 100% that there was something wrong with the amplifier. They opened it up did not tell me that they did and I realized it when they sent it back. The warrantee sticker was removed and you can see torque marks on the screws on the bottom of the amp, but the amp came back in working condition. They charge me $30 to send it back and I didn’t even have it altogether. I spent $280 on an amp that was worth maybe 200. I am very upset that I had to pay $30 to get my amplifier sent back to me when the warranty and everything should’ve covered that if you purchase something from CT sounds make sure you do not plan on returning it, or you better have more money to send it back-and-forth because it’s not free"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dustin Grassman",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T21:55:47.000Z",
          "Titre": "Absolutely great products this is not…",
          "Contenu": "Absolutely great products this is not my first ct sounds purchase and it wont be my last..the only thing that could have been better was the shipping time I've ordered from ct sounds before and shipping was fast but this time my shipping took twice as long maybe because I put my order in on a friday it took like 7 or 8 days when other orders were like 2 or 3 days I'm not sure but either way it was well worth the wait ct sounds for the win..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T21:55:55.000Z",
          "Titre": "Got the amp really fast",
          "Contenu": "Got the amp really fast. Slim design so can install almost anywhere. Doesn’t  produce the best quality sound which I kind of expected that out of a cheaper amp. Will run it and play with the adjustments more to see if it comes around."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Felix Ramos III",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T03:35:09.000Z",
          "Titre": "I received my speaker box fairly fast",
          "Contenu": "I received my speaker box fairly fast. Once I opened the package everything looked top notch. Even the stitching with the companies name. My only gripe is the smell the box gives off, assuming it is from fabrication."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allan Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T19:10:05.000Z",
          "Titre": "Awesome amplifier! But....",
          "Contenu": "Amplifier performance is as advertised.  My issue was with the instructions.  The 12 Vdc Input is reverse in the manual when compared to the actual amplifier.  This resulted in a blown fuse.  Replaced the fuse after wiring correctly and amplifier is working great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aiden Weldon",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T03:41:51.000Z",
          "Titre": "The products are good, but..",
          "Contenu": "The products are good so far (in terms of quality of material and packaging). I ordered one of their 12 inch subs and a box for it. I'm really disappointed that neither came with the required 8 guage wire, even just a few feet of it. It would be around $6-7 worth of wire and would make my job a lot easier. Currently having to drive 15 miles one way to get to home depot that has it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jorge Renteria",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T02:48:42.000Z",
          "Titre": "Super fast service in less than 4 days…",
          "Contenu": "Super fast service in less than 4 days I already had the product with me, the reason I put 4 stars instead of 5 is because the knob was broken"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Burlin Pickens",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T13:27:25.000Z",
          "Titre": "Everything is awesome and authentic…",
          "Contenu": "Everything is awesome and authentic from the product to merch but the replies is just a tap late"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tysen",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T09:42:08.000Z",
          "Titre": "Box quality is top tier",
          "Contenu": "Box quality is top tier zero complaints, it did take a just about a week (6 days) for the box to arrive which is kinda wild shipping from houston to Az."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Jarrell",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T03:55:45.000Z",
          "Titre": "Nice box besides the dent in the front bottom lip due to shipping.",
          "Contenu": "Nice box but really tight fit for 2 Meso 12s. The wire terminals were hard to get in the box with wires attached and with the rubber surround rings the subs were a tight fit side by side. Didn't fit all the way down til screwed in. Thankfully they got a tight seal. I must say that with the 4 cubic feet of air space for the pair is way better than the 1.5 cubic feet recommended per sub after displacement. But solid built box and sounds great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Jacobs",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T23:17:43.000Z",
          "Titre": "1000.1D amplifier quit working",
          "Contenu": "I purchased my vehicle in 2021. It had CT sounds audio equipment in it, I had honestly never heard of ct sounds before. It has done great. I decided I wanted to upgrade from my 2 tropo 8in subwoofers and I bought 2 tropo xl 12in subwoofers. The amplifier I had running the 8in subwoofers is a ct sounds 1000.1D, I was told it was all installed by a shop and tuned so I left it wired how it was but did check and it was wired to a 1ohm load. It has done great until I got my new subwoofers yesterday September 27th, 2023. I am a technician at a certified Chevrolet dealership and I followed the schematic on the ct sounds website to wire both of my new 4ohm dvc 12in subwoofers to a 1ohm load. I powered up my car and was excited to hear my new equipment, sadly my amplifier was not working right, as soon as you power it on, it will flicker between protect and a non-protect state, it will gradually speed up until it is flickering very very fast. The amplifier is rated for a 1ohm load but unfortunately it did not handle it, I like the equipment and I understand things do break, I ordered the ct sounds 1500.1D as a replacement/upgrade for my new subwoofers and DO NOT plan to use the mono capability of the amplifier and instead wire each subwoofer independently at a 2ohm load. I hope this will not cause my new amplifier to repeat what my old one did, that is why I only give a 4 star review instead of a 5, my old amplifier has a 2020 sticker on the back of it so I know it is not very old, it unfortunately did not last. I hope my new equipment lasts longer, I am looking forward to my new amplifier and am hoping it works for years to come."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dean Quintana",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T01:43:27.000Z",
          "Titre": "4 stars just because I haven't…",
          "Contenu": "4 stars just because I haven't installed the amp but will update soon as I get it installed. Shipping was fast and responded to emails fast so great customer service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Damien Emerich",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T18:30:41.000Z",
          "Titre": "Shipped and received quickly",
          "Contenu": "Shipped and received quickly. Everything does seem to be built well. Only issue was pictures of the sub box were misleading, as the rear of box is angled instead of the front as the pictures make it seem. But everything works well, and looks great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Cole",
          "Nb_Reviews": 4,
          "Date": "2022-11-28T17:12:00.000Z",
          "Titre": "The response time was great",
          "Contenu": "The response time was great. Good product quality. However it would be great if you had prefab 6.5” sealed and ported subwoofer boxes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corey Morgan",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T00:09:18.000Z",
          "Titre": "The speed of the order and directions…",
          "Contenu": "The speed of the order and directions along with the sub was pretty awesome. Haven't got to put everything In my truck because of my work schedule. But soon enough I'll be able to write a awesome review!!!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jon Grandy",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T22:27:41.000Z",
          "Titre": "I haven't had a chance to build…",
          "Contenu": "I haven't had a chance to build anything yet. Going on a seven week vacation, so I won't be able to make the subwoofer box when I return."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan Rutter",
          "Nb_Reviews": 2,
          "Date": "2023-01-24T18:18:02.000Z",
          "Titre": "Amazing products",
          "Contenu": "Amazing products, but they loose a star due to them charging me $80 to do an exchange when my product was brand new and in the original packaging."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T03:28:24.000Z",
          "Titre": "Quality is very good sound is very good…",
          "Contenu": "Quality is very good sound is very good the delivery and shipment went pretty quick overall very satisfied with the product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam H",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T18:45:14.000Z",
          "Titre": "Only gave 4 stars due to the fact the…",
          "Contenu": "Only gave 4 stars due to the fact the tropo preorder took longer than expected to ship but overall the customer service was great and quick to answer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miguel Rangel",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T20:52:47.000Z",
          "Titre": "The outside of the box was labeled…",
          "Contenu": "The outside of the box was labeled differently from what I ordered, but I got everything I did order and am not disappointed!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Meyers",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T23:19:35.000Z",
          "Titre": "Great box design and very good prints…",
          "Contenu": "Great box design and very good prints to build enclosure. Sounds awesome. Only thing that could be improved on is it's a little on the small side for a 15 at 3.25 cubes but fits perfect in my hatchback and the cut sheet and blueprints make it a breeze to complete."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T03:49:43.000Z",
          "Titre": "Needs to have a person to answer the…",
          "Contenu": "Needs to have a person to answer the phone call and have a phone customer service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alberto jr Padilla",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T03:26:05.000Z",
          "Titre": "Had trouble at first but once you tune your good 💯…",
          "Contenu": "I thought they weren't that good but I had all the settings messed up and upgraded to the exo 12 and now Iam super happy.. I get sound quality and spl.. loving my system thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Jones",
          "Nb_Reviews": 3,
          "Date": "2023-10-20T05:09:11.000Z",
          "Titre": "Meso",
          "Contenu": "The power it can handle to be so small is remarkable. Hefty subwoofer for the size."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-05-10T16:45:49.000Z",
          "Titre": "The speed of the shipment is the first…",
          "Contenu": "The speed of the shipment is the first thing I admire the most. Secondly, is the response I got on the merchandise I purchased. It was fast and very informative. Now all I have to do is get it hooked up and see is your product what you say it is"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Viehauser",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T23:03:02.000Z",
          "Titre": "Good value for 2 sets of 5 1/4 in 2…",
          "Contenu": "Good value for 2 sets of 5 1/4 in 2 ways for my truck. Only draw back was you didn't sell adapters for the factory 6 1/2in holes in the doors."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sammy Simpkins II",
          "Nb_Reviews": 4,
          "Date": "2022-12-08T22:55:42.000Z",
          "Titre": "Great product well constructed sounds…",
          "Contenu": "Great product well constructed sounds great reasonable prices overall thumbs up and I will be ordering more"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lorenzo Mondragon",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T02:42:58.000Z",
          "Titre": "Great brand poor communication",
          "Contenu": "I love the subwoofers you guys sell for an amazing price I bought 2 before the coils stopped working it was a bit of a pain to get the warranty fixed but they got to me and were very kind the whole time but I have been waiting 4 days for them to ship my package out I still haven’t received and tracking information either they’re shipping is great no way the subwoofer is getting damaged"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brent Matherne",
          "Nb_Reviews": 3,
          "Date": "2023-01-29T18:32:27.000Z",
          "Titre": "Pretty damn good",
          "Contenu": "Pretty damn good. Service was good and so was the speakers I purchased. As a matter of fact, I’m bout to order 2 or 3 subs after I finish this review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TJ",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T18:28:02.000Z",
          "Titre": "I got a good quality product",
          "Contenu": "I got a good quality product,  but the 2 day delivery took 4 business days."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Blake Heisler",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T22:39:09.000Z",
          "Titre": "Great value",
          "Contenu": "Fast shipping, nice looking sub. Doesn't hit as hard as an Alpine Type S but it was half as much money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Culver",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T02:06:14.000Z",
          "Titre": "Bought the product because of reviews…",
          "Contenu": "Bought the product because of reviews about the CS. Hope I don’t need to utilize that service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trinidad Huerta",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T06:49:11.000Z",
          "Titre": "The sub sound great I love the two day…",
          "Contenu": "The sub sound great I love the two day shipping. The structure of the subs look well built"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Rouch",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T05:50:12.000Z",
          "Titre": "6.5 neo speakers.",
          "Contenu": "The 6.5 neos seem good so far but they have only been in the car for 3 days. And I've gotta get some tweeters. But seems good so far. Booger"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan Serrano",
          "Nb_Reviews": 2,
          "Date": "2022-11-01T22:01:02.000Z",
          "Titre": "Affordable quality equipment...",
          "Contenu": "My experience with ct sounds has always been great, fast shipping great quality and in all honesty they deserve 5 stars.  I rated 4 just because of a personal experience where I purchased some midrange speakers that didn't sound as expended with my system. Now I thought with their no questions asked return policy I could swap them for woofers.  But due to them being installed I couldn't return them... not really a\"no questions asked\" policy.  But other than that I stand by their equipment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christ-O-Fer Bryant",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T02:32:39.000Z",
          "Titre": "The speakers sound amazing shipping was…",
          "Contenu": "The speakers sound amazing shipping was fast"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WALTER WARREN",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T19:51:15.000Z",
          "Titre": "Fast shipping good service",
          "Contenu": "Fast shipping good service .  But product had a slight imperfection ! Overall great experience .  I would definitely recommend !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thad Nale",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T20:23:25.000Z",
          "Titre": "Shipping was fast",
          "Contenu": "Shipping was fast, great website. Will definitely be ordering more from CT Sounds"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Copeland",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T04:08:59.000Z",
          "Titre": "Ordering was easy order showed up on…",
          "Contenu": "Ordering was easy order showed up on the date they said"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Hudson",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T15:59:18.000Z",
          "Titre": "My experience with ordering from CT…",
          "Contenu": "My experience with ordering from CT sounds was flawless. My dissatisfaction came from my experience with the delivery process.I received an alert stating that my package was delivered but I never physically received it.I am in the process of communicating with USPS in regards to the issue but as of yet they don’t have any answers for me and I don’t have my product or the message net I spent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leander Haggan",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T17:20:36.000Z",
          "Titre": "Love the shipment process came in right…",
          "Contenu": "Love the shipment process came in right away"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "gilbert yorba",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T06:39:43.000Z",
          "Titre": "Placed my order one day",
          "Contenu": "Placed my order one day, 2 days later it’s on my door step !! Good job CT SOUND !!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T20:57:58.000Z",
          "Titre": "Happy with this product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin Plascencia",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T04:59:55.000Z",
          "Titre": "After the confusion all went well thank…",
          "Contenu": "After the confusion all went well thank CT Sounds"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JDellinger",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T07:38:05.000Z",
          "Titre": "Bought this amp after my kicker kx…",
          "Contenu": "Bought this amp after my kicker kx 1600.1 went out. I have 2 10in CT strato in a ported fox acoustics box. Wired to 1ohm. I bought this amp because 3000 watts should run these 2 subs perfect. They do sound good. Clipping happens alot sooner than with the KX,  it is tuned and set up professionally. The kicker kx was still better. Can't get them anymore unfortunately. I'm really happy with the subs, wish I would of just went with the T2500 from fossgate. This amp goes into protection mode and clips before even getting the subs warmed up. Not super happy with the amp the sound is just different not as good and kinda expensive for what you get. Subs are amazing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leslie Rogers",
          "Nb_Reviews": 3,
          "Date": "2022-05-05T05:40:41.000Z",
          "Titre": "Don't really have a lot to say about…",
          "Contenu": "Don't really have a lot to say about the performance at this point but customer service is on point, but I Will say the Meso 6×9 sounds great I also  ordered the Meso 6.5 with tweeters and cross over and the ATv2-200 4D amp. Now just want the Atv2-2300.1d for my 2 10's sub's. So when I get it together I can give you the real."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DoobieSlick",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T15:48:24.000Z",
          "Titre": "Fast shipping good quality product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Tigner",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T13:57:31.000Z",
          "Titre": "Speaker box itself was packaged well…",
          "Contenu": "Speaker box itself was packaged well and got here pretty quickly but the box the speaker box came in had no packing material so the actual speaker box got a little banged up. Speakers themselves fine so no biggy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin L.",
          "Nb_Reviews": 3,
          "Date": "2021-11-21T02:19:14.000Z",
          "Titre": "damaged packaging",
          "Contenu": "I bought a 12\" strato sub 8 months ago! everything was perfect!! I just bought the big 3 wore kit and Universal bass know. ups box was fine. the 2 items I bought came with damaged packaging.  it was broken, crumbled, torn  and nothing was sealed So im not sure If what I bought was maybe used or not.. im very surprised they sent out products with damaged packaging like that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Green",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T13:11:56.000Z",
          "Titre": "Great Product sounds really good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee Freeze",
          "Nb_Reviews": 1,
          "Date": "2021-11-07T20:52:49.000Z",
          "Titre": "For the price, can’t be beat!",
          "Contenu": "Would be 5 stars but the first amplifier I received didn’t work. CT sounds did ship me a new one and wow! The Tropo XL matched with the CT Sounds 1000w mono amp running @ 1ohm is incredible!!! Shakes the entire house and knocks my wife’s Stuff off the shelves from the driveway! The sound quality is also absolutely amazing as well! Been installing systems for over 25 years and this is now my favorite setup! If you want it loud, go with CT Sounds!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger Skillen",
          "Nb_Reviews": 2,
          "Date": "2022-02-09T02:39:21.000Z",
          "Titre": "My subs arrived on schedule",
          "Contenu": "My subs arrived on schedule, double boxed and damage free, as one would expect, I bought two sub box design, ported and sealed and I got a generic design. Maybe it said somewhere it would be generic but I bought it under the impression it would be for the speakers that I bought, the cutout for the speakers we’re not even the right size but close so I guess it would work. The box designs is not from CT but a third party “box builds” or something like that. Speakers look solid and fit and finish looks great, can’t wait to hear them. Still researching to build my own box"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2022-03-16T05:06:50.000Z",
          "Titre": "Arrived but haven't installed",
          "Contenu": "Arrived quickly.. but upon opening my box the bag containing the screws was open and had big hole in it allowing all the screws and fittings loose in the box.. not huge complaint it just seems like i was sent a \"open package\" instead of new"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T04:57:09.000Z",
          "Titre": "I ordered 2 15” Mesos",
          "Contenu": "I ordered 2 15” Mesos and I wasn’t disappointed at all. All I need now is a good amp. I’m going to wait until CT has some more amps available because I’m sure I’ll be happy with one of theirs. Everything from payment, shipping time , and packaging was excellent. Thanks CT Sounds. Customer for life!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Braden Blondin",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T02:54:47.000Z",
          "Titre": "Well I ordered 2 tropo xl 12 dual 4ohm…",
          "Contenu": "Well I ordered 2 tropo xl 12 dual 4ohm subwoofers  and a ct1500.1 monoblock amp.  Everything arrived in good time with no damage . Amazing quality epuipment . The only thing holding it back from a 5 star review is I spent a good chunk of money and no ct sounds merch  but thanks look forward to  repping the brand in Canada"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brent Matherne",
          "Nb_Reviews": 3,
          "Date": "2023-02-24T17:31:49.000Z",
          "Titre": "They are polite and seem to be good…",
          "Contenu": "They are polite and seem to be good people, I like em"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T01:14:14.000Z",
          "Titre": "Works great sounds amazing!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kimmy Schuler",
          "Nb_Reviews": 4,
          "Date": "2021-06-09T12:43:56.000Z",
          "Titre": "I placed three different orders",
          "Contenu": "I placed three different orders. First one was with pre order for Meso 8 inch woofer. This is the only order I had a problem with. It didn’t give much information on tracking/ movements. I contacted help and they did just that. Zero problems with other orders.      The only thing I could suggest working on is the point system. Super hard to get to a discount but very easy to get stickers. The stickers come with the speakers so now I have multiple stickers which is cool but much rather have T-shirt , hat, or discount.     Anyway my Feedback awesome product thank you very much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Wells",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T14:15:38.000Z",
          "Titre": "Placed my order late Thursday evening…",
          "Contenu": "Placed my order late Thursday evening and with the free shipping I got it 6 days later. I am overall happy with their service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim Merrick",
          "Nb_Reviews": 3,
          "Date": "2022-07-27T02:13:26.000Z",
          "Titre": "I was very satisfied with your…",
          "Contenu": "I was very satisfied with your professional help would advise you all to anyone anybody else thanks for all what y'all do I'm still not finished"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry gant",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T17:37:03.000Z",
          "Titre": "Took a little bit to get here but they…",
          "Contenu": "Took a little bit to get here but they kept me up to date on where my package was and when it was be here"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HULK_RAGE",
          "Nb_Reviews": 1,
          "Date": "2021-07-26T02:43:45.000Z",
          "Titre": "COMPANY HAS GREAT CUSTOMER SERVICE",
          "Contenu": "I HAD A LITTLE TROUBLE WITH. THE SHIPPING NOT CT SOUNDS FAULT THE USPS LOST TRACK MY ORDER, THE HELP I GOT FROM THIS COMPANY WAS GREAT.RECENTLY I ORDERED THE M-750.1D INSTALLING IT TOMORROW WITH AN 12\"MTX 7500 SERIES"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noe Botello",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T22:03:50.000Z",
          "Titre": "Customer service was awesome",
          "Contenu": "Customer service was awesome. I bought 2 meso 8inch subs and both where defective, emailed them about the situation and they got back to me within the next day. They replaced both subs at no cost to me. NO BS no hassle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Gandy",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T02:59:42.000Z",
          "Titre": "Real easy to make my purchase and a…",
          "Contenu": "Real easy to make my purchase and a good price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josue Alcala",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T11:42:41.000Z",
          "Titre": "Good but box had a dent in middle of…",
          "Contenu": "Good but box had a dent in middle of top lip of box"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Hicks",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T03:35:30.000Z",
          "Titre": "It was ok the bad part came from a old…",
          "Contenu": "It was ok the bad part came from a old deposit on as couple of subs it became a ordeal to recover my money which I didn’t appreciate at all but I finally got what I had left as a deposit which I will never do again with CTSOUNDS they became shifty and shady in my opinion. But on a better note you want get more bang for your buck anywhere I have two troop 10 and a 2000 rms amp of there’s and it slams the back of my 4 door f150 probably the loudest cleanest sound I have ever heard I have always had a decent stereo in my car or truck always mids with tweets and subs always ran the name brand amps and subs well anyone wanting good sound cheap look no further come listen to my unit you will understand yes I have nice mids and tweets I purchased elsewhere before I come across them but I will never buy elsewhere again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JaShon Adams",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T07:09:10.000Z",
          "Titre": "Great product",
          "Contenu": "Happy with what I got"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elijah Warner",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T03:00:04.000Z",
          "Titre": "Good subs",
          "Contenu": "Good subs, good price, shipping took longer then I was told, Google said 2 days Shopify said Friday it was delivered Saturday, overall positive experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray O.",
          "Nb_Reviews": 3,
          "Date": "2022-12-01T23:22:09.000Z",
          "Titre": "Easy access and site navigation",
          "Contenu": "Easy access and site navigation. Products arrive on time with no issues!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce Bean",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T09:06:13.000Z",
          "Titre": "My first time buying CT products and…",
          "Contenu": "My first time buying CT products and they sound great.  But I made my first purchase and a week later those items went on sale for a lot less, I contacted them to see if I could get credit towards purchasing some more products but they told me no. So I decided I would contact Amazon and complain to them as that is where I purchased so that I would as a customer be protected from stuff like this.. But as stated before the product sounds great, the service not as much.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Howell",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T07:02:39.000Z",
          "Titre": "All went better than expected ...",
          "Contenu": "All went better than expected .... it arrived pretty quick hooked it up right away been beating 2 skar 12s since it doesn't get too warm to the touch does pull a bit of power though running on 4 guage gonna have to upgrade that asap. It's nice to have the clipping light on the bass knob but the volt guage will blind you dont mount it straight towards you face not good for night driving"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Williams",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T12:54:51.000Z",
          "Titre": "They look really good",
          "Contenu": "They look really good. I have yet to test them though so I can’t fully do a 100% review but the way the look is nice and how heavy they are."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Isaac Escamilla",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T16:59:16.000Z",
          "Titre": "The item was delivered ridiculously…",
          "Contenu": "The item was delivered ridiculously fast. 2 days.This 10 inch sub is beefy and sound really good.  I have already recommended it to several friends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHRIS BALLENTINE",
          "Nb_Reviews": 11,
          "Date": "2021-06-05T09:19:03.000Z",
          "Titre": "Absolutely a great product they slams…",
          "Contenu": "Absolutely a great product they slams and I would buy again but the shipping time is horrible other than that great company and very good products!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cameron Bobo",
          "Nb_Reviews": 4,
          "Date": "2022-06-18T00:35:20.000Z",
          "Titre": "I love the equipment and will be buying…",
          "Contenu": "I love the equipment and will be buying more  Just wish it would've came in a more discreet package."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daddy phatts",
          "Nb_Reviews": 2,
          "Date": "2021-06-06T00:45:37.000Z",
          "Titre": "Shipping was was not that good..gave me…",
          "Contenu": "Shipping was was not that good..gave me a date then changed it , but when my sub finally came ....WOW I was impressed sub is a monster"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron L.",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T07:54:10.000Z",
          "Titre": "4 stars only because shipping was…",
          "Contenu": "4 stars only because shipping was delayed due to unreadable shipping label. If that was FedEx's bad then CT deserves 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ekachai Chomngarm",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T20:37:54.000Z",
          "Titre": "The 8\" subwoofer sounds awesome",
          "Contenu": "The 8\" subwoofer sounds awesome. I will recommend to my friends and I will buy TC sound again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cesar Martinez",
          "Nb_Reviews": 2,
          "Date": "2022-09-19T04:48:13.000Z",
          "Titre": "Great sound for RMS watts but a little…",
          "Contenu": "Great sound for RMS watts but a little late on shipping process"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "chris Pearson",
          "Nb_Reviews": 1,
          "Date": "2021-12-03T15:20:24.000Z",
          "Titre": "The product worked great",
          "Contenu": "The product worked great . But wouldn’t mind if I could see shipping information, before close to delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Jossy",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T07:30:34.000Z",
          "Titre": "Said 3 day shipping but day 3 passed…",
          "Contenu": "Said 3 day shipping but day 3 passed already hope I get my items soon!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Silvio dasilva",
          "Nb_Reviews": 4,
          "Date": "2022-04-04T12:59:28.000Z",
          "Titre": "Great speaker just thought it came with…",
          "Contenu": "Great speaker just thought it came with the box ,ad is confusing so now gotta have box built"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonas",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T05:38:48.000Z",
          "Titre": "Communication, shipping, and price were all better than I could ever expect elsewhere.",
          "Contenu": "Communication was great. Very nice people. Their product is awesome! The shipping was really good too. The amp I ordered got here a day early which around Christmas time is not easy to do. CT Sounds is definitely my go-to shop from now on!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vince",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T03:31:58.000Z",
          "Titre": "Only problem I have is you have 2 day…",
          "Contenu": "Only problem I have is you have 2 day shipping then say how would i expect it in two day from Florida to California need to fix that"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ARMANDO AGUILAR",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:33:34.000Z",
          "Titre": "Representative that was helping me tru…",
          "Contenu": "Representative that was helping me tru email very quick responds and very helpful with my questions. I bought 6.5 tropos speakers and man they sound so good.  Very good bass thanks again. I recommend any product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Young",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T23:19:43.000Z",
          "Titre": "Quality of the Product is outstanding",
          "Contenu": "Quality of the Product is outstanding, the prices is superbly priced and very competitive to higher end or brand names! for a lot less"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trever Miciewicz",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:18:38.000Z",
          "Titre": "2 CT 2000 watt amps/ 2 meso 12's/ 2 12 ported box",
          "Contenu": "The amp showed up very quickly I'll be going in the first week up January to get it all professionally installed, Two CT 2000 watt amps along with Two Meso 12's in a CT sounds dual ported box super excited for some real bass"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Willard",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T01:41:11.000Z",
          "Titre": "Good customer service fast response",
          "Contenu": "They answered my emails in a timely manner in order to return an amp I don't need that I purchased during black Friday sale so I asked them if they would sell me the correct amp I need for the same discount and of course they said no which is totally fair and I understand but they offered me 10% off my next purchase plus I have a 15% discount already for buying so many ct sounds stereo equipment.  I've got the at v2 3000 .1d and a atv2 80.4ab  4 meso 12s 4 neo midrange and two meso tweeters. Love this stuff no complaints except I need another 3k. Well I don't need it the 3k is already too much for 4 yes 4 12 inch meso subwoofer on pur power alternator and big 3 and3 agm 100 amp hours batteries. Shakin the world babe!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rmlt",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T03:36:56.000Z",
          "Titre": "Fantastic service!",
          "Contenu": "Easy ordering experience! Updates on whole process from start to finish! Quick delivery for us. Even suggested things we may need with our purchase so nothing was forgotten. Great prices! Would order from them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erasmo Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:10:57.000Z",
          "Titre": "It's my first time purchasing and was a…",
          "Contenu": "It's my first time purchasing and was a great experience Great service...,thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Lokey",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T19:45:52.000Z",
          "Titre": "Really nice sounding speakers",
          "Contenu": "Really nice sounding speakers. I have had several different set ups in multiple cars. I always go with CT Sounds. Look and sound great. Amps and subs are the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Chance",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T19:05:00.000Z",
          "Titre": "Product arrived on time and in great condition",
          "Contenu": "Product arrived on time and in great condition. This thing puts out some power compared to my old 3k. It was reasonably priced and not too big of an item for its power. Would recommend 10 out of 10. Plus they sent me 2 stickers and I'm a sticker person"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dock Tekk",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T23:33:58.000Z",
          "Titre": "The item arrived considerably earlier…",
          "Contenu": "The item arrived considerably earlier then expected and it was well packaged. The subwoofer box arrived in pristine condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Young",
          "Nb_Reviews": 4,
          "Date": "2023-12-02T12:08:41.000Z",
          "Titre": "Quality products",
          "Contenu": "Quality products, Free and Quick shipping on most orders if not all depending on what you buy, prices on items are very much affordable & is always a Big plus for returning customers, Discount percentages offered to customers, after receiving of the product, you feel that the company follows up with you to make sure you’re happy with Everything. It just makes you feel like you have a family of support. This is what Business Services and Products of AMERICA 🇺🇸 is all about!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Shirey",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T22:27:17.000Z",
          "Titre": "CT Sounds gets it done where others fail",
          "Contenu": "Ive been buying CT Soundsgear awhile now and recomend it to all my friends, especialy those just starting thier car audio journey. Heres why:CT Sounds ships quicklyYou get what you ordered every time It's probably the best bang for buck gear out thereIf there are issues, the CT Sound service team takes care of issue instead of putting blame on the buyer, giving the run around, or lame excuses!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Bigbee",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:47:18.000Z",
          "Titre": "Quickest shipping I’ve ever seen with…",
          "Contenu": "Quickest shipping I’ve ever seen with audio."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Bright",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T06:50:52.000Z",
          "Titre": "Sound so good you’ll never turn down",
          "Contenu": "Got component speakers for great price and they shipped out to me in a couple days got them put in and man they sound amazing and look sweet too, you should definitely get a few set of these."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Andrews",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T09:09:15.000Z",
          "Titre": "Top Notch Company",
          "Contenu": "I just purchased several speakers and accessories,  along with an amp.  I have been researching these speakers and watching videos about the products. Throughout this process, I have reached out to customer service with various questions.  Every single time I received a personal and prompt message with a detailed answer to my questions.  I have never seen such outstanding service with any company.  Keep in mind, this is prior to me spending a dime.  I am anxious to get my speakers installed and I am sure the quality with line with the service.  Just read the reviews, proof is in the pudding.  I wish this company the greatest success and I can only hope that other businesses model their services off of CT Sounds.  I will be a lifelong customer and you can bet I will be referring others.  Keep up the excellent work guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Stevens",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T00:08:00.000Z",
          "Titre": "Absolutely Amazing Products",
          "Contenu": "Absolutely Amazing Products, quick response to questions asked, overall Professional courtesy from the Top down, also the opening original story of CT Sounds  is cool, especially since the car is a Hyundai Veloster, which I have a 2013 Turbo that's getting all of the Superb CT Sounds gear upgrades."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Villalobos",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T00:16:25.000Z",
          "Titre": "Meso 8” subs /shipping and receiving are #1",
          "Contenu": "First I want to thank CT Sounds for using UPS as the shipping company with great service, I received package with no damage. CT sounds has great packaging. Communication from CT sounds was also very good and fast. Now I need to install asap and listen to these Meso 8” subs bring that bass."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff U.",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T04:05:11.000Z",
          "Titre": "Great service, product and quick delivery",
          "Contenu": "The product was greatly expressed in full detail on their website. Ordering was quick and easy while the delivery was pretty darn fast. Was expecting it on Wednesday or Thursday at the latest but it came in a day early."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Str",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T19:52:55.000Z",
          "Titre": "Thumping Box",
          "Contenu": "This box is phenomenal! It looks great, sounds wonderful, and really rumbles the lows. CT Sounds knows what they're doing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Chirillo",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T20:28:05.000Z",
          "Titre": "I have the meso sub tryed many…",
          "Contenu": "I have the meso sub tryed many different box’s by far this one sounds the best and I’m happy it’s not thin wood, and the box is durable I have 2 at 1 ohm getting 3000 watts to them and they will probably break my trunk again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T07:19:33.000Z",
          "Titre": "Excellent website, service and quality.",
          "Contenu": "I was extremely satisfied with the super fast delivery. The website was easy to use and had all the information needed to make a purchase. The quality of the subwoofer is great for the price, I look forward to ordering some more of everything in the future. Great job!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon Zimmerman",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:11:07.000Z",
          "Titre": "Im impressed with how thorough this…",
          "Contenu": "Im impressed with how thorough this company is. Definitely one of those rare breeds that strives for affordable excellence. Thanks :P"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rod Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T04:33:24.000Z",
          "Titre": "Website is great - Products look Great!",
          "Contenu": "Website actually works, and presents the information I was after, clearly and quickly.The amp and speakers I got look awesome and very, very well built - can't wait to install it all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T23:11:59.000Z",
          "Titre": "First and foremost",
          "Contenu": "First and foremost, I wanna thank very much Ismail for assisting me. He helped me thru the unfortunate mistake UPS created by delivering my order to another address. We had a few back and forth, until ultimately he must have got the approval to send me another set. I was happy with my first set of tropo 12s, now even more excited about the meso's. But now I'll forever be a CT Sound customer. I'll be ordering a better amp soon to get the meso's up to its ranks. Appreciate you all. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Gain",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T08:14:40.000Z",
          "Titre": "I’m doing a full CT sounds system in my…",
          "Contenu": "I’m doing a full CT sounds system in my 07 Honda Accord.. I had several integration questions and Matt from tech-support was extremely helpful and explained to me how things worked and simplified matters so that I can make the right choices for my system. You guys are awesome thanks for the technical answers. I needed .. after system is fully installed I will do a full in depth review of the products and the sound that they produce."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cody Berger",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:17:04.000Z",
          "Titre": "Was a easy breeze ordering,package came…",
          "Contenu": "Was a easy breeze ordering,package came on time and was packaged very well and they sound amazing well worth the money"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "One happy wife",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:39:06.000Z",
          "Titre": "The items arrived very fast and were…",
          "Contenu": "The items arrived very fast and were exactly as expected. They are a Christmas gift so I'm unsure how good they sound yet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reymundo Aguirre",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:57:06.000Z",
          "Titre": "Good quality 5.25 speakers will be…",
          "Contenu": "Good quality 5.25 speakers will be buying again but a set of woofers now and amplifier as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Neely",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:44:41.000Z",
          "Titre": "Very fast shipping",
          "Contenu": "Very fast shipping, great communication and great customer service. Items were packed greatly. Thank you. I will surely order again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erasmo Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:15:37.000Z",
          "Titre": "I'm new costumer..,,thanks for your…",
          "Contenu": "I'm new costumer..,,thanks for your great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Rodriguez",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T09:23:52.000Z",
          "Titre": "There products are awesome",
          "Contenu": "There products are awesome. There customer service is outstanding. Quality sounds. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gideon Williams",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T01:50:50.000Z",
          "Titre": "Sounds awesome!!",
          "Contenu": "Sounds awesome!!! I had some rockford speakers in my truck and these are way better! Very fast shipping, would definitely recommend this company @"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Kertzman",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:51:00.000Z",
          "Titre": "Previous sundown audio enthusiast",
          "Contenu": "Previous sundown audio enthusiast, but a CT SOUNDS car came to local company, I was amazed.. so with new car, I made the switch 💯🤘"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "michael choate",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T07:39:18.000Z",
          "Titre": "Got 2 meso 12s and 3200 watt amp and…",
          "Contenu": "Got 2 meso 12s and 3200 watt amp and sounds absolutely phenomenal highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Chalfant",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T05:51:16.000Z",
          "Titre": "Well the prices are hard to beat and…",
          "Contenu": "Well the prices are hard to beat and the service is fast unfortunately my install is gonna take awhile so I’ll update on that when I get there"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Reyes",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T07:44:42.000Z",
          "Titre": "Always check their deals",
          "Contenu": "I had gotten a chance to score on some deals for Black Friday and I am glad that I got a tracking number very quick and can’t wait to put these amps to work!!! Just gotta wait for them to be shipped"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris Wood",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:11:29.000Z",
          "Titre": "I've ordered several items from you…",
          "Contenu": "I've ordered several items from you guys and the service has always been awesome as well as the products I've got they all sound great and work great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kendrick Neals",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:52:42.000Z",
          "Titre": "I love the amp great product good power…",
          "Contenu": "I love the amp great product good power I will be purchasing more audio equipment real soon"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walton B. Smith Sr",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T11:51:43.000Z",
          "Titre": "Products over Price",
          "Contenu": "I have purchased so many items to upgrade my four vehicles sound system. All the components have exceeded my expectations!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alldayeveryday",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T05:24:33.000Z",
          "Titre": "Satisfied",
          "Contenu": "Very well packaged and fast shipping. Can’t wait to hook them up second time using ct sound subwoofers and will continue to use in the future. Can’t go wrong with the price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Barnes",
          "Nb_Reviews": 4,
          "Date": "2023-11-30T17:30:14.000Z",
          "Titre": "Great deals and easy checkout, just one gripe",
          "Contenu": "Great deals and easy checkout. The only thing I'm kind of upset about is I had a gift card code from awhile back ago and it wouldn't work. They should never expire, it's my money on a digital code!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark  Wooten",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T03:22:36.000Z",
          "Titre": "The amp and speakers got here promptly…",
          "Contenu": "The amp and speakers got here promptly and look to be top shelf quality. They sound great after installation in my old VW Vanagon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Herrera",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:03:47.000Z",
          "Titre": "Quality",
          "Contenu": "Quick delivery. The quality and sound is perfect. Easy to follow instructions for the connection. Will be ordering from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keifer Bell",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T00:02:25.000Z",
          "Titre": "One pleased veteran.",
          "Contenu": "Item came within 3-4 days and very well packaged. No complaints whatsoever.Thanks so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "john radegonda",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T18:08:46.000Z",
          "Titre": "Speaker replaced a pioneer champion…",
          "Contenu": "Speaker replaced a pioneer champion series that i had for years. It worked but i could smell the voice coil starting to burn up and it seemed to not hit the higher frequency bass (80-150 hz) . The 808 sounded great but died out if there was a higher bass tone so i tried one of these subs..im taking it easy breaking it in and so far so good..seems like i have all the frequencies back and i did try a real quick high volume and it does hit harder .. just 1 12 and im impressed..not that bad of a price either.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Lowrey",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T15:02:46.000Z",
          "Titre": "Great so far",
          "Contenu": "Great so far. Packaging and shipping were great! Very fast delivery. Due to the holidays I have not opened the packaging to begin the install. I will update this once it is all done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jermaine Jenkins",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T08:55:47.000Z",
          "Titre": "There’s nothing to explain once you do…",
          "Contenu": "There’s nothing to explain once you do your research there is no turning back just buy the damn products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARLIN KIMBROUGH",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T20:45:33.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Installed the Meso 10 with the AT1400.1 amp on yesterday. Great touch with the included instructions of the wiring diagram for the amp and subwoofer. After the break in I'll turn it up a bit but I think this combo might be too much for the trunk of a Honda Accord. Dynamat coming soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John S Orr",
          "Nb_Reviews": 10,
          "Date": "2023-11-28T23:55:18.000Z",
          "Titre": "No worries",
          "Contenu": "CT Sounds is great. Quality product, quality service, and an easy online shopping experience. No worries shopping with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean Uter",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T22:58:02.000Z",
          "Titre": "Great experience exactly what I was…",
          "Contenu": "Great experience exactly what I was looking for and highly recommended to anyone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gohard Tee",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T22:34:04.000Z",
          "Titre": "Good company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vivian Redmon",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:18:09.000Z",
          "Titre": "Very fast shipping I receive my…",
          "Contenu": "Very fast shipping I receive my speakers a day earlier then I was suppose to, got them in 3 days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T01:52:46.000Z",
          "Titre": "They answered all my questions and got…",
          "Contenu": "They answered all my questions and got my replacement crossovers ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor Benitez",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T18:58:16.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Ct sounds has an amazing customer service team. I was having some issues with my ATv-2 200.4d and after voicing my concerns the team was really helpful in resolving the issue. I couldn’t be happier with the service and products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald Conrad",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:39:50.000Z",
          "Titre": "quality parts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "christopher warren",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T19:24:07.000Z",
          "Titre": "Fast delivery.",
          "Contenu": "Fast delivery.. y'all product is awesome!!  The reason I bought a other CT 1500 .1 D is the ground on the amp  screw strip out and keep losing ground . So I just bought a other one ... This amp really pushes my 10 in soundqubes hard . They rated 600 rms a piece ... Can't beat the price !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Verkest",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T03:42:49.000Z",
          "Titre": "Website easy to navigate through",
          "Contenu": "Website easy to navigate through.  Only took a few days to receive. Wiring kit was good quality.  Will always consider CTsounds for future purchases and recommend to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Nulle",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T20:32:17.000Z",
          "Titre": "The speakers sound awesome",
          "Contenu": "The speakers sound awesome. The customer service was such a great help and very professional. Definitely recommend doing business with them as I will be purchasing my 3rd set of speakers without a worry in the world. Thanks CT Sound for a great buying experience and for making my jeep sound amazing!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "keith boyd",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:21:29.000Z",
          "Titre": "Easy website to navigate",
          "Contenu": "Easy website to navigate. Nice products extremely quick shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tito",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:09:53.000Z",
          "Titre": "Amazing",
          "Contenu": "Great product I have been using the 1400.1D and i like it alot, bought me another for a project and the design is sweet!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Vera",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:38:09.000Z",
          "Titre": "For not having a phone number to talk…",
          "Contenu": "For not having a phone number to talk to someone, they used the message and got what the customer wants with no problem. Thanks for your actions to complete my order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Brankis",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T10:41:14.000Z",
          "Titre": "At first I didn't like that they…",
          "Contenu": "At first I didn't like that they charged me $100 for shipping back a return but I ended up shopping with them again and have no regrets."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Hoover",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T05:13:52.000Z",
          "Titre": "Fast Shipping! Great experience!",
          "Contenu": "Had a shipping address issue that I emailed about and the response was super quick and they resolved it immediately. Great customer service and I definitely will be continuing to use CT Sounds for all my audio needs in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felix",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T00:45:43.000Z",
          "Titre": "Exelent product nice quality i can’t…",
          "Contenu": "Exelent product nice quality i can’t wait into get another 4🙏🏻🙏🏻🙏🏻"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge Ledezma",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:36:25.000Z",
          "Titre": "It came early and in well package so it…",
          "Contenu": "It came early and in well package so it won't get damaged ....definitely I'll buy some more stuff ..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Glasper",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:48:48.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping. Have not installed but the quality is very obvious. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DUDE SANCHEZ",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T15:32:32.000Z",
          "Titre": "The Quality and price of your products…",
          "Contenu": "The Quality and price of your products is unmatched! I’m very happy with the amazing sound I have in my SUV now!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaamil Jahmez Foster",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T06:19:49.000Z",
          "Titre": "The best out there.",
          "Contenu": "Since purchasing from ct sound within the last year has been amazing. I truly love the products. I just ordered 2 meso 8 inch dual 4 with the ct sound 2000.1 amp. Can’t wait to put it in my x5 and beat the block down"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Morris",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T04:03:57.000Z",
          "Titre": "Haven’t installed but happy so far",
          "Contenu": "Packing was good everything very secure. Fast shipping and cant wait to get it installed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh Mcelfresh",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T09:04:45.000Z",
          "Titre": "I've bought multiple products from ct",
          "Contenu": "I've bought multiple products from ct. Always fast shipping and great customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Neel",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T04:11:18.000Z",
          "Titre": "Quick delivery packaged very nicely",
          "Contenu": "Quick delivery packaged very nicely, ready to get them installed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emilio Garcia jr",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:51:24.000Z",
          "Titre": "great sound & well made product",
          "Contenu": "Received my product sooner than I thought it is a great product with good sound quality"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Bowman",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T19:56:51.000Z",
          "Titre": "Happy customer …",
          "Contenu": "Great products shipped quickly makes extremely happy customers. You guys never disappoint!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mike lawrence",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T04:42:31.000Z",
          "Titre": "One of the main things i enjoyed about…",
          "Contenu": "One of the main things i enjoyed about working with the ct sounds team was that i was able to contact them and did not have to wait long for a response.The prices are unbeatable and the products are in my opinion one of the best ive ever used.I would recomend ct sounds .."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arthur Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T22:47:47.000Z",
          "Titre": "The shipping was fast and the quality…",
          "Contenu": "The shipping was fast and the quality of the product looks amazing can't wait to see how it sounds"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T06:35:07.000Z",
          "Titre": "Shipment was quick for time of year…",
          "Contenu": "Shipment was quick for time of year even though it did say free 2 day shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob white",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T02:18:10.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Great sale super fast shipping can not wait till install all I bought"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shue",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T01:41:21.000Z",
          "Titre": "My item shipped fast",
          "Contenu": "My item shipped fast, and there was great communication from the company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Armstrong",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T14:45:19.000Z",
          "Titre": "You helped resolve my issue and…",
          "Contenu": "You helped resolve my issue and refunded my money"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John david",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T14:33:24.000Z",
          "Titre": "Fast delivery on a good product…",
          "Contenu": "Fast delivery on a good product everything was made with good quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reece Horton",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T03:26:00.000Z",
          "Titre": "This is the 3rd order I have placed…",
          "Contenu": "This is the 3rd order I have placed with CT Sounds and I'm almost to my total install. They have answered all the questions I have had about wiring and all and very prompted on doing that. Fast shipping and great products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Alpaugh",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T07:39:55.000Z",
          "Titre": "Easy check out",
          "Contenu": "Easy check out, high quality materials with great performance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randall Webber",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T06:00:45.000Z",
          "Titre": "Wow!",
          "Contenu": "Way more than expected! My CT speakers are awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Buldhaupt",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T05:29:38.000Z",
          "Titre": "Quality speakers and crossovers",
          "Contenu": "Quality speakers and crossovers. Packaging very good. Would purchase again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harris Blackmon",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:25:09.000Z",
          "Titre": "Great speakers for my truck rear seat…",
          "Contenu": "Great speakers for my truck rear seat enclosure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gideon Williams",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T02:54:22.000Z",
          "Titre": "I would 100% recommend this company!",
          "Contenu": "I would 100% recommend this company!! Very pleased with the quality of it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vincent Kalny",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T21:13:18.000Z",
          "Titre": "Excellent products",
          "Contenu": "Excellent products, cost and your order goes out right away!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:56:11.000Z",
          "Titre": "Amazing products highly recommend I…",
          "Contenu": "Amazing products highly recommend I have it pushing 2 12”s in my stang leme tell you when I say hits"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ezequiel",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T16:59:27.000Z",
          "Titre": "Team CT Sounds",
          "Contenu": "The team behind CT sounds is amazing there customer service is on point there speakers are quality and there shipping is fast, i’ll recommend anybody to CT sounds"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dominique Wright",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T11:05:12.000Z",
          "Titre": "High quality and amazing product and…",
          "Contenu": "High quality and amazing product and literally the best customer service I've ever dealt with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S.D.",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T13:15:49.000Z",
          "Titre": "Everything from shipping to the…",
          "Contenu": "Everything from shipping to the transaction. %100 satisfied with product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "El wedow",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T08:09:05.000Z",
          "Titre": "Easy installions great power on amp"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Downey",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:54:36.000Z",
          "Titre": "Just received my amp and packaging and…",
          "Contenu": "Just received my amp and packaging and all was great with timely shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Vargas",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T18:28:24.000Z",
          "Titre": "Great Company",
          "Contenu": "At first I had a problem with the delivery of my item. CT Sounds handled the matter professionally and I got my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric mosman",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T01:28:09.000Z",
          "Titre": "Very fast shipping, great product",
          "Contenu": "Very fast shipping, easy to follow install. Makes a difference with the new computer systems. Worth it..will buy from again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHRISTOPHER RANSOM",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T20:12:32.000Z",
          "Titre": "I exchanged all 4 speakers and Tweeters…",
          "Contenu": "I exchanged all 4 speakers and Tweeters in my 00 Jeep and they sound fantastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Thompson",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T21:52:23.000Z",
          "Titre": "Sub works as expected and wasn’t damaged"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Moore",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:55:26.000Z",
          "Titre": "Second time purchasing from CT Sounds",
          "Contenu": "Second time purchasing from CT Sounds.  Great prices and free shipping!  Great products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T20:10:59.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, to order, great price, delivered when promised!"
        }
      ]
    }
  ]
}