{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "dachmanaudio.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stephen Ennever",
          "Nb_Reviews": 6,
          "Date": "2023-05-02T15:24:29.000Z",
          "Titre": "I'm in the UK.",
          "Contenu": "I'm in the UK.I paid for it on the 3rd of April.On the 15th I received notice it had arrived in Switzerland & I would be informed when it would reach the UK. It takes me 14 hours to drive to Lucerne in Switzerland. It's now May, a month after my purchase, & it still hasn't shown up."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Spencer Horton",
          "Nb_Reviews": 3,
          "Date": "2022-01-31T18:07:35.000Z",
          "Titre": "Poor capsules Not ck12 copies",
          "Contenu": "Even though got sent more expensive pair they were not as good as some cheaper ones I had already got. Also description said that they were CK12 copies which they are not. Tested each capsule and one was 94pf and the other 48pf, so way off. Was told that they had isolated backplates but not the case either. I wouldn't buy from again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis Putscher",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T03:39:31.000Z",
          "Titre": "In comparison to my Neumann U87ai",
          "Contenu": "In comparison to my Neumann U87ai, the Dachman does not hold up or deliver on its’ promise. It is down at least 9 db in level and sounds dull by comparison. It’s not a terrible mic and may find use if I need an extra mic, but it would be far from my first choice."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Andreu Marques",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T14:01:23.000Z",
          "Titre": "Good product and excellent customer care",
          "Contenu": "Good product and excellent customer care. It's a pity I needed the customer care 2 times, but they are there to help you! The holder is a bit simple, for a $500 microphone, but it works."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "chrisdb",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T17:39:09.000Z",
          "Titre": "Let me start by saying the good far exceeds the not so great",
          "Contenu": "Let me start by saying the good far exceeds the not so great. What disappoints? The microphone mount takes an inordinate amount of force to lock down.The microphone is heavy and shock mount just droops down unless you REALLY crank down on the locking knob. I have found that mounting it upside down is better... it lowers the  center of gravity and is more  stable in this configuration.What's good? The fit and finish is excellent, and the  sound is warm and lush. Seriously, our  vocalist used it for vocals for the first time at a practice session and even going through a small Mackie mixer into a pair of powered monitors with no effects or EQ and it was stunning."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Danilo Romano",
          "Nb_Reviews": 2,
          "Date": "2021-10-18T14:25:00.000Z",
          "Titre": "Good store for musicians",
          "Contenu": "I would advice all music lovers this store because you can acquire here everything you need. It doesn't matter whether you're a professional musician and you have a band and you need equipment or it's just a hobbie for you. I bet you will anything you need here. Moreover, prices are comparatively cheap here, so it won't cost you much to acquire equipment. In addition, I would note here the work of the staff. They handle their work perfectly, they always can tell you something and you can be free for asking them questions which you have."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Bertrand Cardot",
          "Nb_Reviews": 3,
          "Date": "2021-08-27T21:12:55.000Z",
          "Titre": "Hello.",
          "Contenu": "Hello.I have an U87ia and I can compare. The sound is pretty the same: all the frequencies seems equals level, they are different by their sensibility the Dachman is 10-15 db less than the U87ia.Regard Bertrand"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T19:51:27.000Z",
          "Titre": "Great mic for the money",
          "Contenu": "Great mic for the money. Vibes are similar to an actual u87i. Definitely not one but a cool mic with more drip than anything else at the price point. They forgot about 1/2 the components in my order so I had to wait even longer than expected which was a major bummer. They did hook me up with an extra capsule tho so I gotta give them credit there. Speaking of capsules, im not too sure how I feel about the quality of the capsule itself. It seems to be the only questionable thing in the kit...which I found odd because they advertise themselves primarily as a capsule manufacturer. There is a definite \"burn in\" time you will need to do before the mic is really ready to go.....or at least that was my experience. The capsule sounded quite bad and harsh at first. It took a couple of weeks of constant usage usage to start evening out....and its still doing so slowly 2 months later. The build isn't too difficult if you're handy with a soldering iron and following directions....carefully. I will admit that they could definitely improve the build by taking the time revamp the instructions. (hopefully in the new kit) Overall, my experience with this product was.......eh ok. I marked this as 4/5 so my honest review gets through. 3/5 is what I'm actually giving it overall. I did receive one of the very last of the old kits so hopefully things are better with the MKII"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T04:44:49.000Z",
          "Titre": "In terms of the Mic 5 stars, Wooden box 2, instructions 4",
          "Contenu": "In terms of the Mic 5 stars. Mic box is a 2 out of 5. First box came broken second I will have to glue at some point. Parts and instructions Parts were organized nicely. Instruction book was pretty decent. If you want to make the build go smoothly do the prep required and make your life easier.  If I get the chance I would likely build another mic from them."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Next Uddannelse Kbh",
          "Nb_Reviews": 5,
          "Date": "2023-04-13T08:38:17.000Z",
          "Titre": "Could not deliver immediately, but..",
          "Contenu": "Could not deliver immediately, but all the way good information regarding expected delivery time, and later shipment ect. Great:-)"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Are Simonsen",
          "Nb_Reviews": 2,
          "Date": "2021-07-06T19:51:46.000Z",
          "Titre": "A favourite for vocals.",
          "Contenu": "A bit tricky to built, but high quality parts, and the sound is really great. My new favourite for vocals."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Kirchner",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T00:35:40.000Z",
          "Titre": "They (I brought two) came together…i",
          "Contenu": "They (I brought two) came together nicely. I haven’t had a chance to use them. I can’t wait!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Lundin",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T04:34:20.000Z",
          "Titre": "I was amazed to listen to my performance via the DA 87i!",
          "Contenu": "I was amazed to listen to the first recording of my male voice and acoustic guitar with minimal exra EQ input. The DA 87i is indeed the finest microphone I have used, with incredible tone via its sensitivity and quality design. Also, dealing with DA has been such a pleasure...I now would heartily recommend the company and its products, especially the 87i!"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "IFsound studio A Goro",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T18:22:38.000Z",
          "Titre": "Microphone for lots of sources",
          "Contenu": "Microphone has very aligned sound.Perfect highs gives you possibility to shape it by eq.Sound is not \"boomy\" and with Manley Voxbox sounds fat and warm.With Arturia studio preamps it sounds with presence....Very good for lots of sources becouse is not exposing unnecessary frequences.I have Brauner VM1 ,Rhode NTK  ...that microphone is proud in competition ."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Cameron McKenzie",
          "Nb_Reviews": 4,
          "Date": "2023-07-23T10:17:36.000Z",
          "Titre": "VERY IMPRESSED",
          "Contenu": "I live in Melbourne Australia. I ordered my DA 87i on a Wednesday afternoon, it arrived on my doorstep on Sunday. Unbelievable world we live in.  Anyway, have run it through its paces for a week or so. It's absolutely beautiful. It's a bit cruder than a Neumann, you get a pretty loud pop when you change patterns , but for the money I'm very happy to abide a few quirks. it sounds fantastic. Smooth, full of mid range, sounds high end. sounds old.  Best mic purchase, you will not be disappointed. unless you've got cloth ears."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darrell St.Blaine",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T00:04:45.000Z",
          "Titre": "I built the DIY DA 87i from the kit",
          "Contenu": "I built the DIY DA 87i from the kit.  It was a medium hard build (due to the small form factor) but the documentation was excellent and when I did run into some trouble I got excellent email support.  The mic sounds *wonderful*,  I use on vocals, acoustic guitar and mic'ing up electric guitar cabinets.  I would have zero hesitation in using it for just about any source."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Kates",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T06:37:41.000Z",
          "Titre": "DA 87i: Best microphone I’ve ever owned",
          "Contenu": "It’s true, it really is the finest microphone I’ve ever owned. And certainly one of the best I’ve ever heard. I A-B’d it against a classic Neumann U87 and several other mics, and it beat them all, hands down. Crisp without over-accented sibilance, but warm and full-bodied with wonderful transience and rich lows.I’m in awe of how beautifully it captures the human voice. This mic steps up my game as a voice artist considerably. I could not be happier with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "D.Maio",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T19:47:57.000Z",
          "Titre": "Great microphone.",
          "Contenu": "I pre-ordered a DA 87i a few months ago without really knowing what I was buying except from a few positive reviews. I must say the company kept me informed of the shipment process which I really appreciated. After a few weeks of heavy usage the microphone is great, seems to be well built and I must admit has an amazing sound. Personally I wouldn't hesitate to buy more microphones from them."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David Elias",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T21:03:35.000Z",
          "Titre": "Stellar DA87i",
          "Contenu": "Bought two DA87i.Marvellous and maybe best vintage u87 clones out there. I tried so many brands before finding the one!The greatest thing of all, Jushua from Dachman audio gives a perfect customer service."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "BVD Music Productions",
          "Nb_Reviews": 9,
          "Date": "2023-04-05T15:49:12.000Z",
          "Titre": "A great microphone for recording brass instruments.",
          "Contenu": "I’m super enthusiastic about my new Dachman microphone.The first time I used it was for a video recording of the first of Johannes Brahms 4 Ernstige Gesänge.The microphone made it possible to use my live dynamic range on my bass trombone in my playing.The sound is very natural, full with harmonics and making my instrument sound very vocal.If you google Ben van Dijk plays Brahms you will find my recording."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nikolas Bardossas",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T05:18:31.000Z",
          "Titre": "Customer service was excellent",
          "Contenu": "Customer service was excellent. They were so helpful with some questions that I had. And the mic arrived in great condition. The solders look amazing, the mic itself looks amazing and boy does it sound good. It's open and modern sounding but has that flavor we all so desperately love."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AVG Productions",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T06:53:22.000Z",
          "Titre": "Sounds Amazing",
          "Contenu": "Took a long time to arrive (as mentioned when you order) but it was worth the wait. It’s simply the best mic I’ve ever heard. The TapeOp review was certainly on point as far as I’m concerned. I was using Slate VMS previously, and while that is good, the Dachman is in another class. Completely lively and transparent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Samuel",
          "Nb_Reviews": 1,
          "Date": "2021-09-24T17:19:17.000Z",
          "Titre": "Repeat customer and will buy again",
          "Contenu": "Repeat customer and will buy again. Great products, great prices, and great pre-sale support with all questions answered. Microphone capsules from Dachman sound better than more expensive units from other sources. Quality and sound between identical models is very consistent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darrell St.Blaine",
          "Nb_Reviews": 2,
          "Date": "2022-04-23T17:48:55.000Z",
          "Titre": "The DA87i microphone kit was a walk in the park to build",
          "Contenu": "The DA87i microphone kit was well documented with all parts included and well organized.  When I did contact support with a question about which color denoted the diaphragm wire I got a same day response with a clear answer.I’ve build multiple DIY kits and I have to say that the DA87i is by far the best documented I’ve seen.  It was a breeze to build (though due to the small space inside the microphone body it does require a fair amount of manual dexterity).UPDATE:  OK, my walk in the park turned out to have a few bumps but Joshua's tech support was excellent and he helped me sort out my problems in record time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAYANTH DASIKA",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T09:51:46.000Z",
          "Titre": "Very Happy",
          "Contenu": "I preordered the DA 87i in January. I received the microphone in March, slightly longer than expected, but worth the wait. During the waiting period, all of my emails were answered promptly. The microphone is beautifully built and I feel it adds a nice warmth to my voice and acoustic guitar. I am very happy with this purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Thomas",
          "Nb_Reviews": 3,
          "Date": "2022-04-26T03:01:16.082Z",
          "Titre": "Dachman Has a New Satisfied Customer",
          "Contenu": "I have never ordered anything from Dachman Audio before and I grew concerned about shipping. I emailed support and Josh got back to me within minutes explaining the USPS carrier had not come, so they would take my order to the post office. To my surprise, I received it in 2 days! I have the Rode Classic II and modified it with the DA-CK12 for vocals. The recording I posted got an immediate response with people telling me how impressed they were with the clarity and presence of the vocals. I'm happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "otaylor",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T16:16:57.000Z",
          "Titre": "Great products and support",
          "Contenu": "The products from Dachman Audio are very high quality  and shipping is fast.  My original order had some damage in shipping.  Support was very quick to respond to my email and provide a paid return label and ship me a replacement at no additional cost.I can highly recommend Dachman Audio to my peers.  The products are awesome, and it's nice to know I'll be supported if there is any issue with my order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex B",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T00:38:12.000Z",
          "Titre": "DA 87i kit - BIG thumbs up",
          "Contenu": "The DA 87i is made of high-quality parts, and was, IMO, an easy kit to build. I enjoyed the process, which I found to be fun, relaxing, and satisfying. I've only just begun testing it out, and already the DA 87i is giving me the best vocal sound, that I've yet heard in my humble, amateur project studio. Although there was an extended wait time due to the well-known \"supply chain\" issues that have been experienced globally, this was not the fault of Dachman Audio. DA's customer service is exceptional - very responsive and thoughtful.I can be VERY critical, and don't give many 5-star reviews. I highly recommended purchasing this microphone - especially the kit version. Thanks, Josh!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Lawrence",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T21:06:58.000Z",
          "Titre": "Best mic I own !",
          "Contenu": "I am not great at soldering but the ready to made mic is great. It really is the best and most versatile mic I own. Smooth open sound and forgiving. I use it in vocals and acoustic guitar and I’m very happy. I need 2-3 more honestly and I think everyone should try them out. Certainly less harsh and sibilant than my much pricier Manley Reference…."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2021-06-30T13:46:29.000Z",
          "Titre": "As good as a Neumann, 1/3 the price.",
          "Contenu": "Great quality microphone with all the peripherals. Excellent instructions as easy to follow as a Lego set. Very basic soldering skills needed, just take your time and double check all components are in the right place before soldering. I’ve A/B’d my 87 clone against an original Neumann U87 and was shocked at the similarity. Would definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stefano Bonzi",
          "Nb_Reviews": 2,
          "Date": "2022-04-07T20:16:28.000Z",
          "Titre": "To be honest I wasn’t expecting the…",
          "Contenu": "To be honest I wasn’t expecting the microphone to sound this good! A friend of mine recommended it based on his experience with the previous version, this one is a lot smaller than the one he built and recommended.The build is a bit more difficult than what I experienced before with preamps and EQs but very well explained on the booklet, so I really didn’t have any questions, but just followed the instructions and completed the microphone in a few hours of fun work. It worked immediately after I plugged it in and it really sounds stellar, I showed the results to many people and everyone is blown away. It really sounds “expensive”. But it’s not.I might get a second one for the pair sometimes soon."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "JohannesMusic",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T10:11:04.000Z",
          "Titre": "Impressions of a Classic",
          "Contenu": "Listening to audio demos I was impressed with the DA-87i mic. Second time I was impressed was when I saw the price. Third time was when I tried recording vocals, voice-overs, guitar... an exquisite combination with my 73 preamp. Always wanted an 87-style mic and now finally it's here.Gripes are that import duties must be added to the purchase price when ordering from Europe. The container box is swell enough but the wooden lid doesn't perfectly align with the bottom part. The screw for attaching the mic to the shockmount is squeaky. Shockmount is nothing special and the small size of the wing (that locks the shockmount angle) makes it hard to get enough tension for the mic to stay rigidly in place - I would design it larger so you get more torque. But these are minor things. The sound from the microphone is lovely. Level of customer support arising from order delay was exceptional. All in all no regrets and I would buy again. Thanks Dachman!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Damian Guell",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T22:45:51.000Z",
          "Titre": "Great mics",
          "Contenu": "Great mics. Bought four.  Stellar in multiple uses. Only issue is a couple of the suspension mounts will not tighten, even with pliers. Contacted them and Joshua promised to replace them. I’m sure they will take care of this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Blackburn",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T05:22:52.000Z",
          "Titre": "The 87i is as good as the promo claims it is.",
          "Contenu": "I just love the 87i and it has become my default vocal LDC. The build quality is excellent and the sonics are very impressive. It is also incredibly quiet. There is nothing at this price point that compares."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 12,
          "Date": "2023-04-06T16:26:03.000Z",
          "Titre": "Communication was terrific",
          "Contenu": "Communication was terrific.  I was kept up to date on shipping, as well as any delays.  Early on I wrote to Dachman concerning a used U87 I had purchased, and was given thorough pointers and help.  I decided to purchase a new, assembled mic, based on that experience.  How does the mic sound?  Great.  What does it sound like?  A Dachman, which is not a bad thing.  I can't comment on how it compares to a Neumann, I don't own one.  I do own various Mic Parts mics, and the Dachman is every bit as good as they are.  It's also beautifully made."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Feinberg",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T04:00:18.000Z",
          "Titre": "A high quality, challenging build",
          "Contenu": "The packaging is beautiful, and all of the parts were as expected. Having done a few 500-series DIY projects from other shops, I was pleasantly surprised by the high quality and pleasing design of the instruction manual.There were no rude surprises in the difficulty, although it was my first time doing point-to-point wiring (using isolated \"turret\" junctions), which was pretty fiddly. I enjoyed the build very much.The mic sounds beautiful. I'd compare it favorably to my Neumann TLM 102, but with far greater flexibility. I look forward to trying it out as the figure-8 in a M/S configuration.When I had some noise problems after completing the build, I wrote for support, and immediately received a thoughtful and useful email, which served to make the mic pin-drop quiet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Prewitt",
          "Nb_Reviews": 2,
          "Date": "2021-08-27T17:53:54.000Z",
          "Titre": "High End Microphone Adventure",
          "Contenu": "If you are a true audio equipment lover as I am and have been for many years, then this Dachman DIY kit was made just for you. Imagine building a high end, all pattern microphone, with your own hands, from scratch. Not only do you get a pro performance mic but also the pride that you built it yourself. I’m enjoying the journey."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Victor Polsom",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T12:08:48.000Z",
          "Titre": "Great communication with Josh…",
          "Contenu": "Great communication with Josh throughout the process. He kept me informed about shipping delays caused by courier issues and responded VERY promptly to every email.The kit build went okay with only two issues. The wires from the capsule are quite short and the XLR wires are very light and broke at the solder point twice. I also had some initial issues with the two screws that hold the capsule in its cradle not quite aligning which caused some noise when the mic was moved. Both issues were resolved and now the mic sounds great!Once all"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Cinney, owner of Red Hor",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T17:53:30.000Z",
          "Titre": "Great Mic new weapon of choice !!!",
          "Contenu": "Great Mic.  Sounds amazing and is now my first choice for vocals and acoustic guitar. Had some issues with noise upon completion of the build but the folks at Dachman were great and pointed out where the noise was coming from and was easily resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Francis",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T03:19:01.000Z",
          "Titre": "First rate service!",
          "Contenu": "Calling and getting the order in was a breeze, and follow-up emails and personal calls were an extra nice touch. These folks know how to do customer service right."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al Jewer",
          "Nb_Reviews": 4,
          "Date": "2021-09-03T18:17:56.000Z",
          "Titre": "This mic rocks!",
          "Contenu": "We did a shootout between our studio U87 and the Dachman DA87i through an Avalon stereo preamp. They sound amazingly similar.I am an experienced bench tech and have to say this was a challenging build. Definitely not for beginners! However, the instructions are very good.The only real problem I had was that one of the polystyrene caps had a lead that fell off while I was mounting it. Dachman sent me a replacement right away at no charge.I should mention that I got both the capsule and transformer upgrades.This is a great mic at a fantastic price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2022-01-26T22:01:20.000Z",
          "Titre": "The Dachman 87i is GREAT!",
          "Contenu": "The Dachman 87i is GREAT!The sound of the mic is terrific. It sounds smooth and warm, clean and clear. I'll be recording with it for years to come. The build is extremely solid and a very near match to my Neumann U87ai. Great fun to build, with clear instructions. I did end up contacting Dachman a couple of times with questions, and received extremely prompt, accurate, and super-helpful responses to all of my questions, resulting is a really great mic that will last the test of time and be a great addition to my mic locker. Well done, Dachman!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Wayne Bartlett",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T02:05:13.000Z",
          "Titre": "Very impressed with the DA87SE",
          "Contenu": "I’ve had my DA87SE for about a month and am very happy with the mic. I’m using it primarily as a narration mic. Today I had a chance to A/B it with a U89i that I have used a lot over the previous 10 years. The Dachman stacks up extremely well regardless of the fact that it costs a fraction of the Neumann. I’m blown away!  I’m sure that it matches the U87 even better. We double recorded and with a 1.5 dB roll off at 2k on the Dachman you could edit between the 2 mic’s no problem. Congratulations on making such a wonderful mic.  So glad that I purchased it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian P",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T21:01:46.000Z",
          "Titre": "DA 87i DIY Microphone Kit",
          "Contenu": "I purchased a microphone kit for my son who is studying audio engineering in college. He had a class on building electronic components and has better than average soldering skills. The kit took some time to complete over a few days. Instructions were excellent. A few steps were a bit difficult and required a second set of hands to complete. He had a lot of fun completing the kit and the resulting microphone sounds amazing! This is not something for a novice. I would definitely recommend it to someone who enjoys DIY and loves high quality audio gear. Dachman customer service is the best I've seen anywhere. I was trying to get this by Christmas and they worked with me to get it in time. After the microphone was built, my son had some technical questions. Dachman responded extremely quickly with answers that were extremely helpful and solved all his issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luke Payne",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T04:30:30.000Z",
          "Titre": "The mic seems remarkably good at this…",
          "Contenu": "The mic seems remarkably good at this price point.  I am very happy with how it sounds, the build quality and the full customer experience.  Longer than usual wait after purchase but worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Ayres",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T23:35:44.000Z",
          "Titre": "Invitation To The Party",
          "Contenu": "Well... here's my review. I'm thinking it's not a bad idea to get another DA87SE as I use it quite a lot, on everything. It wins more than loses, but more than that, the final product, after the mix, sounds better. It's not the most expensive mic I have, so I've already got my money back just on vocals and acoustic guitars, piano. I've even had luck as it being a solo room mic for the drums. The mic does what all good gear does: demonstrates it's eagerness to be invited to the party! Again and again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Brock",
          "Nb_Reviews": 3,
          "Date": "2021-08-31T16:23:54.000Z",
          "Titre": "Great customer service!   I want to say that having done lots of…",
          "Contenu": "I want to say that having done lots of soldering, this kit was fairly easy for me. The instructions were well written and the pictures would help even the newer kit builders.I was especially impressed with the service I got that solved a problem that I had. I wrote late at night with a transformer problem. I was answered right away and asked to send pictures. They replied immediately, and a new transformer was sent to me. I have a working (and really nice) microphone. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Proffitt",
          "Nb_Reviews": 3,
          "Date": "2023-04-13T04:17:28.000Z",
          "Titre": "The company and Joshua are customer…",
          "Contenu": "The company and Joshua are customer centered and responsive to questions and problems. A problem - RF interference with one of my two DA 87A mics - has been dealt with quickly and professionally."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Brock",
          "Nb_Reviews": 3,
          "Date": "2022-03-02T19:00:15.000Z",
          "Titre": "I have built two microphone kits now",
          "Contenu": "I have built two microphone kits now. Both have well made parts and high quality parts.The assembly directions are well thought out and easy to use. It helps if you have had experience soldering. The finished product is something that will last."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Parmenter",
          "Nb_Reviews": 2,
          "Date": "2022-04-07T19:57:44.000Z",
          "Titre": "Clear instructions FTW",
          "Contenu": "This somewhat complex build was made much easier thanks to the very clear step by step instructions. I've got another great sounding mic to add to my locker."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Saint",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T03:21:28.000Z",
          "Titre": "this kit is not for a newbie",
          "Contenu": "this kit is not for a newbie, some good soldering skills are required. I took my time and followed the excellent instruction booklet slowly and was rewarded with a first time functional microphoneA good magnifying glass is required to read the component values as well as inspecting the board for solder shorts. after I  identified each component I used painters tape and a sharpie to mark the values to make component placement easier. Take your time and clean the board when the instructions say to. Cleaning will pay dividends. Use acetone or nail polish remover, Rubbing alcohol has no effect on the flux residueI took three nights of 2 hrs each to assemble the kit and it worked 1st time. No hum, buzzing., 60hz pickup at all. The Mic is super sensitive at low volumes and will pick up any little annoyance in the room. I had to remove the batteries in a clock in different room when test recording an acoustic guitar as it was plainly heard during quieter sections.I was very impressed and if you have a good amount of soldering experience its a rewarding few days of assembly to get a quality product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "justin choi",
          "Nb_Reviews": 4,
          "Date": "2023-02-22T04:58:50.000Z",
          "Titre": "The DA 87SE is a class",
          "Contenu": "Got this piece for my recording studio and it's perfect. Crips, clear sound, my accoustic guitar sounds awesome paired with the mic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "chester oszustowicz",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T00:06:24.000Z",
          "Titre": "Bottom line the product os amazing and…",
          "Contenu": "Bottom line the product os amazing and best out my vintage 87s sold my two and will buy two more Dachmans"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Charette",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T01:19:48.000Z",
          "Titre": "DA 87I",
          "Contenu": "Great microphone,  has sounded great on vocals, accoustic guitar and my Wirlitzer 200A.  Great deal great mic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Del Grande",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T20:32:38.000Z",
          "Titre": "Great microphone",
          "Contenu": "Great microphone!  Big warm sound! A great presence in my studio. Great service & delivery as well."
        },
        {
          "Note": 5,
          "Lieu": "SI",
          "Pseudo": "pustuc",
          "Nb_Reviews": 2,
          "Date": "2021-08-22T17:09:54.000Z",
          "Titre": "D87i is the best mic I own",
          "Contenu": "I have a modest mic locker, a dozen mics not more. Four of them are Large diaphragm condenser mics and I can easily say D87i is the best mic I own. It sounds warm, with silky top end and a lot of details. Definitely not sorry to pull the trigger and would do it again in a heart beat."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Fedor Puzikov",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T10:48:25.000Z",
          "Titre": "Thanks a lot",
          "Contenu": "Thanks a lot! Everything is very good! I tested with the original U67 mic, your U87 mic capsule sounds almost the same as the U67 mic! I wish you success and creative inspiration!Best regards, Fedor Puzikov."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Parslow",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T21:28:26.000Z",
          "Titre": "I love Dachman Audio",
          "Contenu": "Very happy with my purchases from Dachman Audio and the customer service is superb. They have found a loyal customer in me and I am spreading the word. Thank you DA! keep up the great work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RandalCummings",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T20:30:29.000Z",
          "Titre": "Immediate Gratification",
          "Contenu": "I love it when I decide to push the buy button, my order was immediately processed on it's way to me that same day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 2,
          "Date": "2021-06-29T18:00:51.000Z",
          "Titre": "They have been great to work with",
          "Contenu": "They have been great to work with. Had an issue with a capsule I purchased and they immediately sent a replacement. Will continue to purchase from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Gregg",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T03:44:43.000Z",
          "Titre": "So far",
          "Contenu": "So far, so good. I'm digging the U87 clone. I haven't used it a bunch yet but I don't anticipate any issues. Dachman were good to their word. The only tiny niggle is the pattern switch is a little off and wonky but still operates as it should."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T19:08:43.000Z",
          "Titre": "Well-made, well-documented",
          "Contenu": "Well put-together kit, extra points for professionally printed full color pictures in the detailed and thorough instructions. Not a beginner soldering project, but if you have experience soldering it comes together fairly quickly and easily.Oh and the mic sounds great too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian McKeever",
          "Nb_Reviews": 7,
          "Date": "2022-04-15T12:51:38.000Z",
          "Titre": "A great product and I'm looking forward…",
          "Contenu": "A great product and I'm looking forward to building it!  Item arrived on time and as expected.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel",
          "Nb_Reviews": 7,
          "Date": "2021-06-29T19:01:03.000Z",
          "Titre": "u87 clone kit",
          "Contenu": "Pre-ordered a u87 clone kit. Kit arrived as described and in reasonable time. Great deal, would definitely do it again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maddie Dohmen",
          "Nb_Reviews": 2,
          "Date": "2021-08-11T18:15:17.000Z",
          "Titre": "So fast",
          "Contenu": "Incredibly high quality parts, shipped quickly and well packaged. I already expected the best and I was not to be disappointed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luke Desiato",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T04:13:17.000Z",
          "Titre": "Very responsive and the mic is awesome",
          "Contenu": "Very responsive and the mic is awesome. Great quality and sound. Very versatile for vocals and instruments."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "KOCHXBOS GALLERY / STUDIO",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T13:49:27.000Z",
          "Titre": "In time",
          "Contenu": "In time, great microphone and thank you all at Bachman audio, best! From Amsterdam. Hans"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Golden Hatch",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T00:55:25.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good, I’ve never used a Neumann microphone so I have no way to compare it but I own a lot of very nice microphones and I do believe this may be the nicest microphone I now own."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delilah",
          "Nb_Reviews": 1,
          "Date": "2021-09-03T19:36:22.000Z",
          "Titre": "Great value!",
          "Contenu": "Great value, exactly as promised. The kit is very high quality with clear instructions and solid design."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kevin Karlstrom",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T21:48:43.000Z",
          "Titre": "Loving the new microphone",
          "Contenu": "Loving the new microphone. I am very pleased with this microphone already."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Bram",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T18:33:13.000Z",
          "Titre": "Product excels in every way",
          "Contenu": "Product excels, in every way. Especially for the price. Great response time and customer support too! Recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monty Warren",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T20:50:48.000Z",
          "Titre": "Impressive",
          "Contenu": "Impressive. Good all purpose quality studio mic at an amazing price."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "K Douglas",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T02:04:50.000Z",
          "Titre": "For the price",
          "Contenu": "For the price, it’s a really decent microphone! Pleasantly surprised! A+ 87 clone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Eakins",
          "Nb_Reviews": 2,
          "Date": "2022-11-24T01:40:58.000Z",
          "Titre": "Very good mic.",
          "Contenu": "So far this mic sounds very good. I have not yet had a chance to compare against my friends U87, but I'm impressed with what I'm getting from it so far."
        },
        {
          "Note": 5,
          "Lieu": "SI",
          "Pseudo": "SASO",
          "Nb_Reviews": 2,
          "Date": "2021-06-29T18:17:14.000Z",
          "Titre": "Easy to bulid and excellent sounding…",
          "Contenu": "Easy to bulid and excellent sounding mic!We compare it with the original U87 and they were prity close.Nice job!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T14:56:00.000Z",
          "Titre": "This mic is working great",
          "Contenu": "This mic is working great. Very good sounding for AC guitars, voice and more.The low end is rich and full and the high end is sweet.A pro quality microphone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie Doane",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T13:17:26.000Z",
          "Titre": "An impressive product from an impressive company",
          "Contenu": "In addition to the DA-87Ai sounding fantastic, I was impressed with how the company communicated when the shipment was delayed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge F",
          "Nb_Reviews": 4,
          "Date": "2023-08-01T14:23:28.000Z",
          "Titre": "Crystal clear sound…",
          "Contenu": "the sound recorded with this microphone is crystal clear"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Manu Vergeade",
          "Nb_Reviews": 3,
          "Date": "2023-04-05T18:46:02.000Z",
          "Titre": "Wonderful Recreation of Mythic U87",
          "Contenu": "Wonderful Recreation of Mythic U87 ! Thank you for giving regular news during the process , from building until shipping !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy Sneap",
          "Nb_Reviews": 2,
          "Date": "2021-12-22T00:10:36.000Z",
          "Titre": "U87 kit",
          "Contenu": "It worked first time !Fun little projectGreat communication and service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Orrick",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T01:08:42.000Z",
          "Titre": "Josh was very responsive and very…",
          "Contenu": "Josh was very responsive and very helpful. Mic sounds amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 6,
          "Date": "2022-09-17T01:08:59.000Z",
          "Titre": "A real fun build!",
          "Contenu": "A real fun build, the mic sounds amazing! I’ve already use it on numerous projects."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al Jewer",
          "Nb_Reviews": 4,
          "Date": "2022-04-07T20:26:10.000Z",
          "Titre": "Great kit!",
          "Contenu": "Great kit!A/B with a genuine U87, we liked the Dachman better!Smoother high end without the \"bite\" that the U87 can have.Liked it so much, we got a second one."
        },
        {
          "Note": 5,
          "Lieu": "GT",
          "Pseudo": "Cryptuschrist",
          "Nb_Reviews": 3,
          "Date": "2023-04-26T01:45:47.000Z",
          "Titre": "Great product!",
          "Contenu": "Fast delivery! Good quality product! My rode nt1 is alive again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian K.",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T04:24:30.000Z",
          "Titre": "The DA 87i --incredible sounding mic",
          "Contenu": "The DA 87i is an incredible sounding mic...excellent frequency response and expressive detail. A solidly-built, well-engineered incredible value."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Richard St-Onge",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T15:51:02.000Z",
          "Titre": "Good stock. Great service.",
          "Contenu": "High quality item made abailable at a fair price. Item arrived fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Urso",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T06:13:43.000Z",
          "Titre": "U87i is wonderful",
          "Contenu": "U87i is wonderful. Great mic, very useful. If I had to keep only one mic this would be it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh B",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T01:22:45.000Z",
          "Titre": "Great mic for the money",
          "Contenu": "Great mic for the money. You will not be let down with this mic. Running it thru a tube amp and compressor"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arnold Brown",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T02:33:30.000Z",
          "Titre": "Great Company",
          "Contenu": "Great Company. Great Microphones. Josh Rocks Great Prices AAA+++++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jake Kelly",
          "Nb_Reviews": 2,
          "Date": "2022-04-08T22:30:43.000Z",
          "Titre": "Affordable capsules and reasonable…",
          "Contenu": "Affordable capsules and reasonable shipping time. Great US-based option for DIY microphone parts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2021-11-17T13:48:56.000Z",
          "Titre": "Great product and excellent pricing!",
          "Contenu": "Great product and excellent pricing!  The customer attention is fantastic as well as sincere."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2021-06-30T03:38:56.000Z",
          "Titre": "quality components",
          "Contenu": "quality components, clear instructions, and useful support when I needed it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Kisiel",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T12:40:55.000Z",
          "Titre": "Communication and attention to detail…",
          "Contenu": "Communication and attention to detail on the customer service end was spectacular! Great product, Great People!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brett Hansen",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T22:22:23.000Z",
          "Titre": "U87 shootout",
          "Contenu": "The mic sounds excellent! Listened right next to my own u87"
        },
        {
          "Note": 5,
          "Lieu": "SI",
          "Pseudo": "SASO",
          "Nb_Reviews": 2,
          "Date": "2022-03-10T06:53:58.000Z",
          "Titre": "Top mic's!!",
          "Contenu": "Top mic's!!! I will order some more that is for shure.Best wishes to Dachman audio."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "john lommock",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T20:44:01.088Z",
          "Titre": "I love the mic and the build support…",
          "Contenu": "I love the mic and the build support was great, what more could I ask for?"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brad Mitchell",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T23:14:38.000Z",
          "Titre": "Excellent microphone and great (not to…",
          "Contenu": "Excellent microphone and great (not to mention FAST)support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyro",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T20:03:19.000Z",
          "Titre": "Great price",
          "Contenu": "Great price, sound quality of the capsule is great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Wilson",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T00:28:37.000Z",
          "Titre": "Easily the best sounding mic I own"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Rolando Hernández",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T17:31:21.000Z",
          "Titre": "Excelent quality and sound!!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T19:30:28.000Z",
          "Titre": "Great people and product",
          "Contenu": "Great people and product! I highly recommend!, 👍👍👍👍👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SkepticalJohn",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T05:30:59.000Z",
          "Titre": "So far, So good!",
          "Contenu": "So far, so good. Best bang for the buck mic I’ve ever purchased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erik Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T02:58:09.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, excellent communication. My DA 87i Microphone sounds amazing!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Jörgen Wärnström",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T18:43:48.000Z",
          "Titre": "Excellent sounding microphone and good…",
          "Contenu": "Excellent sounding microphone and good customer service. Top, top company!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T09:51:31.000Z",
          "Titre": "Friendly and worked with me",
          "Contenu": "Friendly and worked with me, though I made the error"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "chase",
          "Nb_Reviews": 1,
          "Date": "2021-07-05T21:05:23.000Z",
          "Titre": "Great Service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Saul Gravy",
          "Nb_Reviews": 1,
          "Date": "2021-11-20T04:55:01.000Z",
          "Titre": "Made my mxl770 worth keeping around."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark Pringle",
          "Nb_Reviews": 4,
          "Date": "2023-04-06T11:34:34.000Z",
          "Titre": "Great Mic",
          "Contenu": "Great Mic, great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trevor Gabriel",
          "Nb_Reviews": 1,
          "Date": "2021-10-21T21:10:04.000Z",
          "Titre": "Excellent quality studio mics",
          "Contenu": "Excellent quality studio mics and a competitive price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Majilton",
          "Nb_Reviews": 2,
          "Date": "2022-09-17T00:46:35.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, great communication, great product."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Sato",
          "Nb_Reviews": 3,
          "Date": "2021-06-29T18:02:14.000Z",
          "Titre": "excellent item",
          "Contenu": "excellent item, friendly manual. highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Majilton",
          "Nb_Reviews": 2,
          "Date": "2022-02-14T19:35:36.000Z",
          "Titre": "Excellent range of condenser capsules."
        }
      ]
    }
  ]
}