{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "davekny.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Watchdog",
          "Nb_Reviews": 26,
          "Date": "2023-12-21T09:17:59.000Z",
          "Titre": "Lifetime guarantee I don't think so.",
          "Contenu": "Lifetime guarantee I don't think so.The first Solo wouldn't even close properly, so they shipped me another one.But this has only lasted two years broken in very stormy winds.Lifetime guarantee?  you have to pay for shipping so how can it be free?I thought paying for a £100 umbrella would be the answer to my problems. I'm not convinced.☂️☔️🌂"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "What Name",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:06:10.000Z",
          "Titre": "After a few uses the umbrella broke",
          "Contenu": "After a few uses the umbrella broke.  It was repaired and after 1 use it broke.  I now use a $30 umbrella and it lasts through windy days.  Davek wouldn't survive that."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Martin Johansson",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T17:22:14.000Z",
          "Titre": "Crappy quality & no unconditional lifetime warranty for Swedes it seems ...",
          "Contenu": "I have bought 4 umbrellas from Davek since I like the look of them. The quality however is so so and I have replaced 3 of them since they provide what they call \"Unconditional Lifetime Guarantee\". Now an umbrella broke again, the 4th, and I contacted support. Now I receive the information that for some reason they do not ship replacement umbrellas to Sweden. I can buy umbrella on their website and have it shipped to Sweden, but apparently not when I excercise my \"unconditional\" lifetime guarantee, because then it is suddenly conditional that I do not live in Sweden. So, somehow you have to make sure that you do not live in a country to which they do not ship for some obscure reason."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jane Phillips",
          "Nb_Reviews": 5,
          "Date": "2023-11-23T23:42:29.000Z",
          "Titre": "I paid my money and they refuse to ship…",
          "Contenu": "I paid my money and they refuse to ship my order I bought two umbrellas for $150.00 every day I get a new excuse why they cant ship my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-09-08T22:23:42.000Z",
          "Titre": "Shipping - oy!",
          "Contenu": "To have to pay for return shipping AND have money taken off for the shipping to my house is ridiculous. Especially when selling $100 umbrellas. $20 just for me to find out your umbrella is not made with the quality matierals as described and not worth the previous price you are charging. You could do better."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Eddie McDonnell",
          "Nb_Reviews": 3,
          "Date": "2022-10-06T02:56:34.000Z",
          "Titre": "The quality of this umbrella does not live up to its claims.",
          "Contenu": "The quality of this umbrella does not meet their claims. It is poor quality, hard to operate the automatic opening button, in fact does not now operate. Hardly used and now will not open. Do not buy its a waste of money. The customer service is also non existent, don't answer emails and not bothered about disatisfied customers."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 27,
          "Date": "2022-06-20T17:02:06.000Z",
          "Titre": "\"Elite\" umbrella, not elite quality.",
          "Contenu": "Elite umbrella, used for special occasions, rarely. Looks nice. Poor quality. Spokes break, didn't even know how it happened. Twice. Have already had one replacement (cost of return and shipping was around £25). Not bothering a second time, will buy a better quality umbrella for less."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 4,
          "Date": "2023-08-10T18:11:39.000Z",
          "Titre": "I reached out in regards to the product…",
          "Contenu": "I reached out in regards to the product itself and no one ever got back to me on anything. I don't feel as though product is worth $65 it's not even an automatic umbrella. I asked to return it for full refund and no one got back to me with the label how can I return it for full refund is there a way I can get a prepaid label? Thank you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Y Li",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T22:18:04.000Z",
          "Titre": "The quality of umbrella is below…",
          "Contenu": "The quality of umbrella is below average, not worth the price. The return process is much hassle, and making it worse, Davek said I had to pay for the original shipping if I return the product. I’m not happy at all but don’t want to lose 20 dollars on shipping, so have to keep it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela Terry",
          "Nb_Reviews": 3,
          "Date": "2023-05-27T00:18:06.000Z",
          "Titre": "NOPE! Feels Like a $20 Umbrella",
          "Contenu": "I see the reviews, but sent mine right back. I paid to ship it back ($9.00) and then they deducted their shipping cost from my return ($10.00) which is noted on the return policy. So I lost $20 bucks to see thin fabric, color not as saturated as the photos, with a flimsy operating system. I guess for an umbrella more costly than most, I was expecting to \"get it\" when I held it. It feels like a 20$ umbrella. Very surprised."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Y BARRY CHUNG",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T23:21:33.000Z",
          "Titre": "BAD return policy",
          "Contenu": "I bought three Davek umbrellas of different sizes, and decided that the commuter size was just too small for me and I want to return it.  I looked into the return policy, and found the policy to be very unfriendly.  Other companies would autogenerate a return shipping label for me.  Your company makes us to all the work for the return, pay for return shipping, and would deduct the original shipping cost from the refund.  That is a very bad return policy and I will not order any more products from your company.  Nor would I recommend you to my friends.  A good return policy is what people looking for these days, in the age of online shopping."
        },
        {
          "Note": 1,
          "Lieu": "TW",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T20:02:52.000Z",
          "Titre": "Bought the Duet umbrella from Davek’s…",
          "Contenu": "Bought the Duet umbrella from Davek’s website before a trip to SE Asia. The first rainy day I brought it out on (literally today) I found out the umbrella has a leak in the middle of the canopy. Big drops of water drip-drip-dripping on my head while I’m trying to stay dry. For like $150 this is beyond unacceptable. I checked and they want me to pay them MORE money to SHIP it to them so they can “fix” the faulty umbrella. I’ll just buy from a better company for far less. What a scam. Don’t buy from this company, it’s all marketing and zero followthrough."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teresa Crooks",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T16:31:23.000Z",
          "Titre": "Travel umbrella impossible to open",
          "Contenu": "Travel umbrella impossible to open. Too hard. It then cost me $18 plus to return between what Davek  deducted and the cost of mailing it back. Extremely disappointed."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rory R.",
          "Nb_Reviews": 32,
          "Date": "2023-09-26T12:11:06.000Z",
          "Titre": "Rib broke first time used",
          "Contenu": "My Solo umbrella arrived last week. I checked it and it seemed okay. I then tried to use it today, for the first time as it was raining and one of the ribs broke on opening. I am very careful with my  things and so opened it as appropriate."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "mark young",
          "Nb_Reviews": 7,
          "Date": "2023-07-19T18:38:39.000Z",
          "Titre": "Very poor product",
          "Contenu": "This umbrella was bought 3 years ago. It never really worked fully. I've only used it about five times and now it has broken completely as it won't close  really disappointed. My advice would be save your money. I could have bought a new cheaper umbrella every  year for the price of this."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Darrel",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T11:52:44.000Z",
          "Titre": "I bought my umbrella last year and took…",
          "Contenu": "I bought my umbrella last year and took to my home in Asia I used it once for about ten minutes it open and closed fine next time, was one year later and it would not open would spring out but not lock in place and not fully open this was pretty pricey umbrella for ten minutes worth of use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annie Najarian",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T20:05:47.000Z",
          "Titre": "I was so excited to receive my…",
          "Contenu": "I was so excited to receive my umbrella, but was immediately disappointed with its inability to readily open.  I have used drug store umbrellas which work much more smoothly."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Juan Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T23:49:36.000Z",
          "Titre": "Very disappointed at their return…",
          "Contenu": "Very disappointed at their return process. I had to pay to return the umbrellas... plus they also deducted the fee for shipping it to me."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nick Bain",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T20:11:40.000Z",
          "Titre": "Terrible Quality",
          "Contenu": "Paid £60 for the mini umbrella, I have  better and stronger umbrellas that I paid £10 for, so flimsy and underwhelming, contact customer services and was told that they are ‘supposed’ to feel flimsy,  do not waste your money and get a cheaper product from Amazon"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sergio Rosas",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T03:46:55.000Z",
          "Titre": "Damaged umbrella",
          "Contenu": "Umbrella has a faulty open switch...it doesn't completely open when you press the button.  Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve in Denver",
          "Nb_Reviews": 1,
          "Date": "2022-05-01T15:52:00.000Z",
          "Titre": "Poor design",
          "Contenu": "Umbrella is very difficult to open and  awkward. Design feels cheap. Would never recommend. Very disappointed in Denver."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arie",
          "Nb_Reviews": 2,
          "Date": "2023-05-05T01:55:29.000Z",
          "Titre": "Broken Umbrella",
          "Contenu": "The umbrella broke as soon as soon as I received it and used it the first time. I have $10 umbrellas that fared much better! I will be sending it back."
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Luigi",
          "Nb_Reviews": 2,
          "Date": "2022-12-10T12:05:24.000Z",
          "Titre": "I had just purchased two mini and",
          "Contenu": "I had just purchased two mini and, wouldn’t you know, a day later they have a sale. Buy 2, get one free 😭. It’s my luck, not this company. It always happens to lil old me. Oh well. That’s life’s!Anyway, Can’t wait to try it. They’re on the way as I type. One is for my lil wife. I’ll write another review once I do try it. Needless to say, they look great 👍🏼"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-05-05T02:18:09.000Z",
          "Titre": "The smaller one was too small",
          "Contenu": "The smaller one was too small. The medium one was very heavy.Poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ROBERT C. EICKHOF",
          "Nb_Reviews": 3,
          "Date": "2022-05-06T20:12:59.000Z",
          "Titre": "i returned two mini umbrellas as the…",
          "Contenu": "i returned two mini umbrellas as the quality for price wasn’t as i expected, i was willing to pay the price as I expected premium quality -"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JAMES LAFLEUR",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T01:02:48.000Z",
          "Titre": "This is my third request for a receipt…",
          "Contenu": "This is my third request for a receipt of my last purchase. Somebody has dropped the ball."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "shriyabisht",
          "Nb_Reviews": 3,
          "Date": "2022-11-12T04:51:14.000Z",
          "Titre": "I used the umbrella today for the first…",
          "Contenu": "I used the umbrella today for the first time and there is a big hole in it right next to the joint !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T22:12:33.000Z",
          "Titre": "You have fantastic marketing",
          "Contenu": "You have fantastic marketing.  There is nothing special about your umbrellas."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eduardo Santana",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T03:53:30.000Z",
          "Titre": "The worse business transaction ever! Run from Davek!",
          "Contenu": "The worse business transaction ever!  I purchased an  umbrella about a month ago, and ended up receiving an old model that looked used. So, I returned it, and now the company refuses to refund me using their very well elaborated excuses. What a scam! Don’t waste your money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yong Hou",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T03:24:12.000Z",
          "Titre": "Poor sent quality",
          "Contenu": "Poor sent quality, replacement pictures sent …"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BRUCE TRIGO",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T18:25:30.000Z",
          "Titre": "Failed Expectations",
          "Contenu": "After receiving the umbrella l learned it was smaller than expected. I thought Davey would try to help me find something for my needs but they just said send it back. After actually seeing this umbrella and comparing to others I am not convinced that it is worth the price charged. My opinion is that the inflated price is a marketing strategy to make one think they are buying something exceptional."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ivan Topchu",
          "Nb_Reviews": 6,
          "Date": "2021-08-16T10:51:41.000Z",
          "Titre": "Very cheap quality.",
          "Contenu": "Very cheap quality.I bought davek mini umbrella for £50.The entire metal frame rusted in a year and the fabric also became stained with rust.I wanted to sent it for replacement and was asked ro pay £9.99 plus delivery payment (£4.80 royal mail).For that kind of money Davek should replace it for free."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mr Sung",
          "Nb_Reviews": 7,
          "Date": "2021-02-20T22:26:27.000Z",
          "Titre": "Not good at all",
          "Contenu": "First purchased the umbrella, it last almost a season in Los Angeles.  So that means a small hand full of times.  It was repaired then it made it a day.  So an expensive umbrella the has the breaks and paying shipping for both ways means the value is trash.  It looks pretty for an umbrella, but it's use is just to hang on a hook.  There are 20 dollar umbrellas that last longer and will save you so much more money in the long run"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim Wallace",
          "Nb_Reviews": 2,
          "Date": "2020-05-28T18:55:51.000Z",
          "Titre": "They make a quality umbrella but…",
          "Contenu": "They make a quality umbrella but customer service is really, really bad.  I ordered two and received one.  They would not provide another tracking number, just said that it was coming.  After almost 2 weeks and me calling again, they finally sent my second one.... and by ground.  They would not ship next day or even 2 day.  For an umbrella that cost this much, they should have better customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Strve Rosenthal",
          "Nb_Reviews": 2,
          "Date": "2019-11-19T19:41:56.000Z",
          "Titre": "Was disappointed in the mini umbrella…",
          "Contenu": "Was disappointed in the mini umbrella as you must open n close it manually.  There is no button or lever to do that    I would have thought for the price that would have been a given.  They did offer exchange for a bigger umbrella that does have a button to open n close but with shipping costs etc it was just easier to buy one at Walgreens. Their response to my emails were prompt n courteous ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "New Customers",
          "Nb_Reviews": 1,
          "Date": "2019-12-07T11:23:10.000Z",
          "Titre": "Very Disappointed x2",
          "Contenu": "My husband and I bought two for a trip to Italy last month, mine broke the 1st day I used it and my husband’s broke about 4 days later. The same thing happened to both  of us . . . a small spring popped off one of the spokes when we depressed the button to close the umbrella, causing the spoke to flop. We had to laugh that we spent so much money on them and our $5 umbrellas bought from street vendors have lasted much longer"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mr Sung",
          "Nb_Reviews": 7,
          "Date": "2020-03-17T21:59:27.000Z",
          "Titre": "They look nice, but is a garbage product.",
          "Contenu": "They look nice and have a great warranty.  However, they are not durable.  It's cheaper to buy inexpensive umbrellas, because you'll pay for shipping both ways.  I have a new umbrella that after a handful of uses break. I used the warranty and the fixed umbrella broke after 1 day of use.  Not a windy day, just open and close a few times.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dangding Bo",
          "Nb_Reviews": 10,
          "Date": "2019-08-01T17:54:45.000Z",
          "Titre": "Poor quality on the Elite.",
          "Contenu": "Unlike the other models, the elite umbrellas are poorly build. The first one received had the tip felt off and the aluminum. Fitting pitted.  The replacement had the stitches on the leather handle cover getting loose and the seam falling apart.A Davek representative chalked it off as imperfections that customers usually don’t mine. Now I have to make a second trip to UPS to send back this POS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James B.",
          "Nb_Reviews": 2,
          "Date": "2020-01-17T21:16:27.000Z",
          "Titre": "I ordered the Duet",
          "Contenu": "I ordered the Duet, which I immediately thought, in its unopened position, was way to too heavy and bulky. I have been unable to reach Davek by phone (it appears that there is no customer service phone number) to discuss a possible exchange for a different model. It seems that my only option is to return it within 30 days, dated from the order date. It took about 6 days to get it, and my view is it should be dated from the delivery date, not the order date. Please reply ASAP."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dayne Kono",
          "Nb_Reviews": 1,
          "Date": "2019-07-01T18:55:31.000Z",
          "Titre": "It was way too heavy and bulky and that…",
          "Contenu": "It was way too heavy and bulky and that is why I ordered the travel version. At that cost I thought there could have been better a design and materials used. I will keep it at home for use around the neighborhood or to leave in the car so I can test how durable it is in any event, but there is no way that I will be able to commute or travel with it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oleg Kozlovskii",
          "Nb_Reviews": 1,
          "Date": "2018-09-25T14:53:50.000Z",
          "Titre": "Umbrella I received was smaller than I…",
          "Contenu": "Umbrella I received was smaller than I expected. I contacted customer support to potentially swap my umbrella for bigger, more expensive model, but they never got back to me (10 days and counting). Umbrella certainly looks like a good quality, but it does not really matter if it gets my backpack wet. Also, non-existent customer service is a great concern, especially for such price."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tayab Hussain",
          "Nb_Reviews": 1,
          "Date": "2019-04-04T21:02:05.000Z",
          "Titre": "i purchased 3 mini umbrellas",
          "Contenu": "i purchased 3 mini umbrellas, and one already broke.  The thread holding the fabric to the skeleton broke.  i have had it for only 2 weeks and it hasn't even rained yet.  a little dissapointed in the quality for the high price i paid.  i am sure the full size umbrellas are built better, but quality shouldn't be compromised because its a \"mini\".  i know there is a life time warranty, but now i have to jump through hoops to take care of it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SD",
          "Nb_Reviews": 1,
          "Date": "2018-10-23T22:30:41.000Z",
          "Titre": "Save Your $$$",
          "Contenu": "The mini umbrella I ordered arrived broken - it wouldn’t open or close properly.  Then because we wanted a refund in lieu of exchanging it, Davek made us pay for the return shipping.  Product quality and customer fall woefully short for a company that supposedly prides itself on both.  Never again and I will share my experience with as many people as I can."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Bernier",
          "Nb_Reviews": 1,
          "Date": "2019-05-05T10:57:21.000Z",
          "Titre": "I have read reviews by a few customers…",
          "Contenu": "I have read reviews by a few customers who made complaints and I’m sure they received just compensation. That said, I have two, a single and a double; they have done exactly what they were advertised to do and they did it well . It didn’t turn inside out in the wind and it has kept my butt dry when raining. Thank you for a great product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Obenauer",
          "Nb_Reviews": 1,
          "Date": "2017-04-17T14:17:04.000Z",
          "Titre": "It has nothing to do with your product",
          "Contenu": "It has nothing to do with your product.  I never recieved it.  It got lost in ups.  I have lodged a complaint.  If unresolved in a couple weeks i will order again and request alternative delivery option.  I am never home during ups delivery and just dropping by without proof of delivery (signed receipt) doesnt work in my case.  I am certain you have a good product, otherwise i wouldnt consider orderinh it again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick L",
          "Nb_Reviews": 2,
          "Date": "2020-03-02T11:34:34.000Z",
          "Titre": "Disappointed...",
          "Contenu": "The actual fabric is nice and they shipped it quickly but for the price I paid I would not have expected the handle to have areas where the coating was incomplete and not properly sealed onto the wood.  I probably should have gone with a more established company for a gentleman’s umbrella like Fox."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jacqueline levethal",
          "Nb_Reviews": 1,
          "Date": "2019-08-31T14:49:38.000Z",
          "Titre": "Better Product Description",
          "Contenu": "I ordered my umbrella from  an ad that popped up in my NY Times reading. Thought I would splurge on a really GOOD umbrella even though I live in California.  It arrived wrapped in gold gift paperwhich I did not request.  The handle was too heavy and there was a clip very awkward  to get my small hand around.  It didn’t fully open the one time I tried it.  I returned it and had to pay the $20.00 postage myself.    Forget the gold paper give good customer service and describe more accurately your product."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Adrian Martin",
          "Nb_Reviews": 2,
          "Date": "2020-08-23T21:25:55.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Very disappointed, the umbrella was heavy and poorly constructed. The retaining catch broke within half a dozen uses, so it kept trying to spring open. Shortly after on a mildly breezy day one of the arms bent completely out of shape. It went in the first available bin."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Penny Wing",
          "Nb_Reviews": 1,
          "Date": "2019-05-20T20:33:49.000Z",
          "Titre": "I need to return them",
          "Contenu": "I need to return them.  They will not click up and stay up.  I was going to use them as gifts but tried them all.  You have to keep playing with them to catch the lock at the top to stay opened.  Probably should look into your next size up.  These are not strong enough and do not catch."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Evelyn Cook",
          "Nb_Reviews": 2,
          "Date": "2019-04-19T20:30:56.000Z",
          "Titre": "I was very unhappy with my purchase",
          "Contenu": "I was very unhappy with my purchase.  I was standing in the rain and wind at the train station fighting with my inverted umbrella in front of the doctors and lawyers who are also my clients that I would recommend this umbrella to.  A bad experience for me and poor marketing for them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristen Zschomler",
          "Nb_Reviews": 1,
          "Date": "2018-09-03T14:46:23.000Z",
          "Titre": "I have not received my umbrellas",
          "Contenu": "I have not received my umbrellas. I got notice that the order was received, and even that it had shipped over a week ago. There was no tracking information provided, so I sent an email inquiring where my umbrellas were. I have received no response, and the umbrellas are still not here."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Neo Samurai",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T11:03:00.000Z",
          "Titre": "Good product but only marketed to USA customers.",
          "Contenu": "Was after a new, strong but lightweight travel umbrella to compliment my Helinox hiking umbrella. This Davek Solo umbrella was just advertised on my news feed/website here in Australia and looked great! Perfect! BUT - Unfortunately everything was only in inches/ounzes which means nothing to us in Australia (and rest of the world) - why not simply quote both metric and imperial sizes/weights together? Tried to send an enquiry email through the Davek website for further info. but the 'Contact' link only directs/links me to a Twitter feed!!! (I don't have) What happened to basic email? You lost another customer here. Basic stuff - sheesh."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremiah Lee",
          "Nb_Reviews": 4,
          "Date": "2020-05-27T19:38:10.000Z",
          "Titre": "Loudly QC and lousier customer service",
          "Contenu": "I purchased 9 umbrellas from you before and all went well but one.  The customer service was just outrageous. When I received a long umbrella elite - it came with an aluminum part all pitted.  I called to have it replaced. The replacement had the leather on the handle splitting at the seam. When I called again,  I was told they would prefer to refund me as I was too picky.  I explained that you send two defective items and complained about their ineffective QC.  The representative told me off saying there is always slips with QC.  So much for the image of quality Davek is trying to impress their clients."
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Juhani Karhuvaara",
          "Nb_Reviews": 1,
          "Date": "2018-10-28T09:44:33.000Z",
          "Titre": "Illegal business practices",
          "Contenu": "Umbrella broke in 8 months. Under the customer protection laws of the European Union, the umbrella has to be replaced free of charge. Completely free of charge, no processing costs. Davek customer support didn't answer my inquiries until being threatened with legal action. Once I finally managed to send the package back, it was returned to me as undeliverable. Delivery cost itself was still on me, enough for two conventional umbrellas.  This company is absolutely NOT interested in caring for its products or customers. Should have believed the negative reviews."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David Park",
          "Nb_Reviews": 1,
          "Date": "2020-06-10T05:27:37.000Z",
          "Titre": "I purchased 2 TRAVELERs models and they…",
          "Contenu": "I purchased 2 TRAVELERs models and they both broke within 2 months of use.I sent out both for repairs, and one of them broke again in 2 weeks of light use.I will not bother sending in for repairs again, and strongly recommend not to buy these junks."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Alan Gregory",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T00:12:13.000Z",
          "Titre": "Heap of rubbish",
          "Contenu": "Heap of rubbish , first one returned for repairs after 3 months , freight at our cost ,could have purchased another couple of cheap umbrellas for the cost, just put repaired umbrella in the bin , not worth the money and frustration."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wendy B",
          "Nb_Reviews": 2,
          "Date": "2020-03-03T16:40:04.000Z",
          "Titre": "Mini umbrella was horrible and useless",
          "Contenu": "Mini umbrella was horrible and extremely difficult to open all the way. I didn’t even have the energy to send it back and literally threw a $50.00 purchase in the garbage. Would never buy from them again and will stick with Blunt umbrellas."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 2,
          "Date": "2019-11-25T15:47:14.000Z",
          "Titre": "Poor Quality",
          "Contenu": "The umbrella has been scratched and falling apart on its own since I bought it.  Customer service seems unwilling to help.  This is uncharasteristic of other overly priced products on the market.  Would not recommend this product to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Smith",
          "Nb_Reviews": 1,
          "Date": "2019-07-23T12:26:03.000Z",
          "Titre": "Unfortunately for me",
          "Contenu": "Unfortunately for me, it broke on its second use.  One of the ribs would not close.  I know there's a lifetime guarantee. Haven't yet decided whether paying for the shipping both ways and sending it in for repair is worth the effort."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Massoud Pourzamani",
          "Nb_Reviews": 1,
          "Date": "2019-02-07T15:48:36.000Z",
          "Titre": "I bought my two umbrella about over a…",
          "Contenu": "I bought my two umbrella about over a year ago and one already broke. I called the company and the person who answered the phone cared less. I have not even used my second umbrella yet. I am very disappointed at your service.Massoud Pourzamani"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phil W",
          "Nb_Reviews": 1,
          "Date": "2018-08-14T15:37:20.000Z",
          "Titre": "Sent me the wrong color",
          "Contenu": "Sent me the wrong color, I did not ask for Black I asked for Plum.  The enclosed packing slip was even initialed by someone showing they had checked my order.  How about hiring some people who can get the color right.  It cannot be that difficult."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Isaiah",
          "Nb_Reviews": 1,
          "Date": "2018-05-17T17:59:34.000Z",
          "Titre": "Good umbrella, terrible gadget.",
          "Contenu": "Good umbrella, but the bluetooth doesn't work well and has sent me probably 100 notifications over two days, none of which have been accurate or useful.Not worth 130 bucks. Contacted Davek about it and the best they offered was to return it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annie Green",
          "Nb_Reviews": 1,
          "Date": "2016-05-26T22:33:51.000Z",
          "Titre": "Don't bother - Not a great umbrella, slow shipping, no customer service, returns cost shipping + $10 \"restocking fee\"",
          "Contenu": "I ordered two umbrellas a week before Christmas (Davek Mini and Davek Traveler). They didn't arrive until the end of January. When they arrived, both were flimsy and certainly not worth the price. My mom's $20 Eddie Bauer umbrella is far sturdier. I returned both (I had to pay shipping AND a $10 restocking fee). When I contacted customer support to request the restocking fee be waived for slow shipping and poor quality, they did not respond. So frustrating. I also wonder why all the people here got invitations to write a review, when I didn't. Looks like Davek is good at guessing who's happy and who's not."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Peter Lonergan",
          "Nb_Reviews": 1,
          "Date": "2019-07-07T01:11:23.000Z",
          "Titre": "Replacement guarantee is rubbish",
          "Contenu": "Bought two umbrellas one for me, one for my wife.Mine works OK but the mechanism in my wife`s failedon the second use. Davek`s replacement guarantee is rubbish in my opinionsent several emails and no much as a reply.Beware"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2018-05-14T17:06:06.000Z",
          "Titre": "My umbrella broke in less than a year",
          "Contenu": "My umbrella broke in less than a year, and then the company wanted me to pay shipping to turn it back in and receive a replacement back. Not going to sink any more money into this company. Umbrella is heavy and unwieldy. Not worth the price and the service is lacking.Response to Davek: I don't think you understand my concern regarding cost and timing of shipping, quality, and your lack of a direct response. Now during the rainy spring, I'll be without an umbrella for an indefinite period of time. The \"guarantee\" does not seem to really satisfy needs. All of this less than a year into what was supposed to be a high quality umbrella."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Gregory",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T00:53:38.000Z",
          "Titre": "Incredibly disappointed",
          "Contenu": "Incredibly disappointed in the performance of this product. We have very mild winters in Adelaide. First time I used it in inclement weather it failed dismally.  This is why I am cautious to purchase high end products online. Could have purchased something similar at half the price and return process so much easier and cost effective, but unfortunately got taken in by the hyped marketing. Temporary replacement umbrella $20 (survived the same weather well + $15 freight $10 postage adds $45 to the joy of my experience of Built to Endure life's storms! Unconditionally Guaranteed for life! Engineered to Perfection! We think it's better to buy one high-quality product that will last for many years, than an endless stream of replacements! Blah Blah Blah Blah!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Cora Yau",
          "Nb_Reviews": 2,
          "Date": "2021-11-28T05:18:21.000Z",
          "Titre": "Flimsy, bad quality for a $139 CAD umbrella",
          "Contenu": "I bought the Davek Solo in Dec 2016, and being in the super rainy Vancouver I must say I am pretty disappointed in this umbrella.  For the past 5 years I had to send in my umbrella for repair pretty much 1-2 times a year.  The spoke design seems to be pretty weak as it breaks pretty easily.  While it has a lifetime warranty, I had to pay for shipping for the past 6 repairs which had already cost me the amount equivalent to the price of a brand new Solo by now.  For an umbrella this expensive, I'd expect much stronger framework and not something so flimsy, easy-to-break, poor quality like this umbrella.  Another spoke on the Solo umbrella just broke on me again today - but I am not going to spend more money on this anymore.  I will just get another brand that will last me much longer than Davek Solo."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "maziatr",
          "Nb_Reviews": 1,
          "Date": "2020-01-26T09:17:43.000Z",
          "Titre": "I am very disappointed by both the…",
          "Contenu": "I am very disappointed by both the product and the company’s customer service.  After just 15 months of vey light use which excluded usage in any type of windy conditions, my umbrella has developed a malfunction with one of its spokes.  I have had umbrellas a fourth of the price which have lasted for years - so much for Davek claim that you will only ever need to buy one umbrella.What adds insult to injury is the fact that their customer service wants me to pay for shipping to them and back before they even take a look at it.  I suggest they should look at Amazon and how they treat their customers.  Needless to say I will be spreading the word about them in anyway I can for the way they have treated me."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "DDF design",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T18:18:15.000Z",
          "Titre": "Just throwing away our second Davek…",
          "Contenu": "Just throwing away our second Davek umbrella. NOT IMPRESSED!! The first one I could not close easily!! And you want to be able to close an umbreall quickly and easily when entering a building or a car - not struggle with it - pushing and pushing, trying to get it closed - and getting wet in the process as having to hold the umbrella down to be able to use more force to finally get it closed. And I am a fit and strong woman!! Davek replaced that umbrella and the new one, using it the second or third time, one of the ribs broke. And no, I am not a person that is hard on things. I take care of my belongings. My daughter also bought a Davek umbrella and she also had to return hers for a replacement due to a fault with a rib.So - NOT IMPRESSED!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sibi Kurian",
          "Nb_Reviews": 1,
          "Date": "2019-04-19T20:51:30.000Z",
          "Titre": "Very rude",
          "Contenu": "Very rude, unresponsive, uninterested, unhelpful customer service over the phone. Defective item received. More than a hassle than I ever expected! Will never recommend DavekNY to anyone based on my experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Knauth",
          "Nb_Reviews": 1,
          "Date": "2019-11-09T17:50:06.000Z",
          "Titre": "Do not waste your money!",
          "Contenu": "This is my second Davek umbrella. The first time I used both umbrellas, they broke. These are very poorly made. Umbrellas I have purchased on the street for $10 have lasted longer. Do not waste your money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michael jahn",
          "Nb_Reviews": 1,
          "Date": "2016-06-16T20:25:37.000Z",
          "Titre": "Doesn't work",
          "Contenu": "Followed instructions, even bought new battery in hopes the one in phone was bad, and still couldn't get green light to blink and phone to recognize umbrella. I sent two emails to support and no reply or phone call."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Al Morrison",
          "Nb_Reviews": 3,
          "Date": "2021-06-18T14:00:01.000Z",
          "Titre": "We just receive the Davek Umbrellas we…",
          "Contenu": "We just receive the Davek Umbrellas we cannot review as we haven't use them, therefore we cannot review.  As of this writing we cannot render an opinion. Check back with us.AM"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Flores",
          "Nb_Reviews": 1,
          "Date": "2020-02-24T19:00:00.000Z",
          "Titre": "I really did not like the umbrella…",
          "Contenu": "I really did not like the umbrella design.It is almost exactly the same as my $20 umbrella and does not offer much more for the massive price difference. I will be returning my order."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Joan Kolk",
          "Nb_Reviews": 1,
          "Date": "2019-08-13T22:22:50.000Z",
          "Titre": "I would love to write a 5 star review…",
          "Contenu": "I would love to write a 5 star review but unfortunately my umbrella never worked Doesn’t go up or down with buttonI run around with it up as far as it will goMakes me so sad 😞"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Doud",
          "Nb_Reviews": 12,
          "Date": "2019-11-22T15:40:12.000Z",
          "Titre": "Marketing Crap",
          "Contenu": "I specifically clicked OFF notifications and the company still sent me some. This sort of scarcity mindset is sad. When a client clicks off further notifications - DON'T send any."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "S",
          "Nb_Reviews": 1,
          "Date": "2019-09-19T07:10:46.000Z",
          "Titre": "Two umbrellas, both broken. Not worth the investment at all.",
          "Contenu": "Two umbrellas, both broken, Davek is definitely not worth the investment.I'm an Aussie, I live in a country in the middle of one of the worst droughts we've ever seen, so I haven't had to use my umbrella much since I purchased it. Regardless, my mother and I both purchased Davek umbrellas at the same time, and my mum's umbrella has broken twice and had to be replaced, which is covered by their warranty, however you have to pay to ship the umbrella to Davek and then PAY AGAIN for them to post one back to you.Mine has now broken too. Within a month of my mum's umbrella breaking FOR THE SECOND TIME. If I bother to pay postage both ways to get a replacement, I'll definitely be selling mine and purchasing another umbrella. One that I can rely on the handful of times it rains in Sydney."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "I am so foolish",
          "Nb_Reviews": 1,
          "Date": "2022-04-02T16:59:36.000Z",
          "Titre": "Definitely not worth $50!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dick Tracy",
          "Nb_Reviews": 6,
          "Date": "2018-09-07T17:59:59.000Z",
          "Titre": "Davek just qualified as junk umbrella club",
          "Contenu": "Bought the Duet & Solo combo costs me $223+ excluding overseas shipping.  Was happy with such well-made umbrellas compared to those China-junks.  Well guess what, the Duet umbrella frame broken off less than 6 months!  For no apparent reasons, no thunderstorms, no winds, it just decided to break.  Rather than sending this junk back, I have to figure out how to sew it back (not sure Davek will even honor overseas shipments).   Perhaps I have to say some prayers to the Solo, caress it, and hope for mercy and deliverance.  Well Davek, congratulations in joining the Low quality junk club!UPDATE:  If you honor overseas warranty / return, then let’s talk.  I’d also question as to why it failed within 6 months.  Otherwise, big mouth with big claims just wouldn’t help to begin with.  Downgraded to 1 star."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Tubby",
          "Nb_Reviews": 1,
          "Date": "2017-05-04T18:55:36.000Z",
          "Titre": "davek traveller flawed",
          "Contenu": "I am extremely disappointed with the Davek traveller. It has now broken in the same spot twice. Once on the original umbrella, and once on the replacement. This is after minimal use, and no abuse. Both times have been while I have been traveling, as this is why I bought the umbrella. The gauge of the pressed metal spars is too thin. The spring tension wire exerts too much force where it passes through the spar. Consequently the spar bends, then work hardens and breaks.I would not recommend anyone buy the Davek traveller. the postage payable to replace the umbrella is unsustainable, particularly considering the premium price paid. I hope davek reengineer this product.Update- davekny responded immediately to assist. I cannot fault the US office customer service. Time will tell if this replacement will break the same way."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joan F",
          "Nb_Reviews": 1,
          "Date": "2019-10-03T03:06:29.000Z",
          "Titre": "Broke on first time in light wind",
          "Contenu": "First outing with light wind. Not only did the umbrella go inside out, but one of the spokes snapped.  I feel like I've been duped by very effective marketing."
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Mr Jaakob Happonen",
          "Nb_Reviews": 4,
          "Date": "2017-12-10T21:32:44.000Z",
          "Titre": "Warranty is bluff",
          "Contenu": "Warranty is bluff: you have to pay 10 pounds plus shipping to repair, from Finland it is 25 pounds. For that price, I can buy another better make in Finland."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mr burns",
          "Nb_Reviews": 3,
          "Date": "2017-12-11T16:27:59.000Z",
          "Titre": "No news",
          "Contenu": "Haven’t received yet. No information about when it’s coming. No tracking number. Wouldn’t buy again from site regardless of how great the umbrella is."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Christie",
          "Nb_Reviews": 2,
          "Date": "2019-02-16T23:12:36.000Z",
          "Titre": "Quality looking materials but breaks consistently",
          "Contenu": "These umbrellas look and feel great initially. The leather wrapped metal handle is weighty and has a quality feel to it. One immediately noticeable downside to the design is how bulky it is when folded (some other brands fold to an even slim column, but these umbrellas \"poof\" out around the velcro clasp quite a bit). Unfortunately I've owned three Davek umbrellas, and all of them have broken after a few months of use. The metal pieces in the mechanism become damaged and the umbrella won't properly open or close without manual adjustment each time. The velcro stitching on all three of my umbrellas has also come undone (leaving the velcro hanging by the stitching on one side. I have never experienced these issues with much cheaper brands of umbrellas. While there is a lifetime warranty, you have to pay for shipping plus an additional $10 for return shipping, and I'd much rather have an umbrella that doesn't break in the first place."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mark cunningham",
          "Nb_Reviews": 1,
          "Date": "2022-03-16T14:17:26.000Z",
          "Titre": "Terrible customer service!!!!",
          "Contenu": "Terrible customer service!!!!!  I bought the solo and upon receiving it I found it to be too small of a canopy that would not sufficiently protect me. Contacted them and found out I would have to pay for the return shipping, unlike other companies I’ve dealt with that send return labels. I had them send the one for 2 as a replacement which obviously cost me more. So far with the cost of the umbrella $159 and over $12 shipping I’ve spent a good amount. While waiting for this umbrella I read many reviews of the most highly rated umbrellas and in most did not see any Davek umbrellas in the top with the exception of the elite appearing in one article but not at the top. I contacted the company to discuss returning mine for the elite but requesting free return shipping since I’ve already spent enough. The woman was very rude and had an angered tone, stating they have already spent too much shipping 2 umbrellas to me for free. This in a day when many companies ship for free and send return free shipping labels.  I am truly disgusted with this interaction. Save yourself some $ and read up on the best umbrellas which mainly includes umbrellas at a much lower price"
        },
        {
          "Note": 1,
          "Lieu": "JO",
          "Pseudo": "Jude",
          "Nb_Reviews": 5,
          "Date": "2017-05-20T06:47:50.000Z",
          "Titre": "DO NOT BUY THIS! (Disappointing performance)",
          "Contenu": "I bought the Davek Solo a few months ago. I was looking for a good-quality umbrella that would last a long time and decided to invest in a Davek after seeing all the positive reviews saying that Davek umbrellas are the best. I used my Davek for the first time last week. The reason I hadn't used it yet is because it doesn't rain much where I live. The umbrella seemed very well-built and sturdy so I was very excited to use it. To put it slightly, the umbrella didn't live up to my expectations at all. It felt really cheap (the fabric part). It was also a little windy that day and and I had trouble balancing the umbrella; it felt like it was going to fly away. It is was not THAT windy, not at all. The umbrella looked and felt very sturdy laying around my room, but when when push comes to shove, it is pretty useless and unreliable. I am utterly disappointed and wish I had just a bought a cheap one as I am pretty sure it would've performed way better."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katherine Adler",
          "Nb_Reviews": 1,
          "Date": "2019-03-27T13:57:57.000Z",
          "Titre": "The umbrella is the right size for…",
          "Contenu": "The umbrella is the right size for carrying in one's purse, but it is much too heavy to carry anywhere.  I sent it back immediately."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allison Levine",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T03:34:34.000Z",
          "Titre": "It broke on my first use of it",
          "Contenu": "It broke on my first use of it, I went to close and one of the arms snapped off making it unusable. Very dissapointed."
        },
        {
          "Note": 1,
          "Lieu": "VI",
          "Pseudo": "Amelia Headley LaMont",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T18:03:42.000Z",
          "Titre": "My order was placed about a month ago…",
          "Contenu": "My order was placed about a month ago and I have not received the item nor any indication as to when it will be delivered"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leo",
          "Nb_Reviews": 1,
          "Date": "2021-03-13T22:11:59.000Z",
          "Titre": "Was disappointed at the quality for the…",
          "Contenu": "Was disappointed at the quality for the price and no auto opener. Opening it manually was difficult. Returning both."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jared Brees",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T02:52:58.000Z",
          "Titre": "Fragile, decorative junk",
          "Contenu": "This is basically a rebranded Totes umbrella with a carbon fiber (or similar) tip rather than the standard aluminum.It doesn't open fully without a shake, and even when open, any wind will cause it to start collapsing, or flip inside-out.The first real rain I took this out it tonight, it flipped inside out, and now several of the arms are bent. Would not recommend, even at a $50 price point, much less at a $150 price point.Also, the handle looks fancy and all, but is very uncomfortable to hold. The wrist strap is too small for any practical use; it'll just catch you as you're trying to put the umbrella away.When I initially bought this, I'd emailed DavekNY about my concerns about the similarity to the Totes umbrellas (right down to the \"ENSON-D4\" stamps on the aluminum arms), but they refused to provide any evidence that these were not just some mass-produce junk that they rebranded and swapped out the handles on. I decided to hold off on writing a review until I'd used it in the rain. Now that I have, I'm confident speaking about it.The one thing I give it credit for, is looking pretty. It's aesthetically rather nice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "megan ortega",
          "Nb_Reviews": 1,
          "Date": "2017-02-12T06:56:13.000Z",
          "Titre": "Just plain BAD umbrella",
          "Contenu": "I got this umbrella as I read online that is was one of the 'best' brands. I paid $149 for this umbrella. I figured the price may just be worth it as it may not break. First use I pulled it out and was impressed. I liked how it opened and closed with the button. Looked very fancy with all the packaging. I used it for at least an hour and the medal hinge became undone. I saw a loose bolt pop out and figured I could try to fix it. Next thing I know a rope on the pole itself appeared and I could no longer open the umbrella properly. I would have to hold the top in order for it to hold up. I did NOT do anything out of the normal. For all that money I paid--I was like \"really?\" I got angry. I landed up shipping it back and wanting a refund. It costs me $17 to ship back which I don't think I should pay for since it broke. Davek should provide a free shipping tag to return.  What a total bummer. This umbrella is probably made with cheap parts.  With all that happened to me....I wouldn't recommend any umbrella from this company."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "L Terry",
          "Nb_Reviews": 2,
          "Date": "2021-07-29T14:57:59.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service, paid money to return a faulty product, emailed, messenger no respinse at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Shmo",
          "Nb_Reviews": 2,
          "Date": "2021-01-01T21:22:22.000Z",
          "Titre": "Not worth the price",
          "Contenu": "Not worth the price. Didn’t want to send a bad review, but since YOU forced the issue, that’s what you get."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda Cline",
          "Nb_Reviews": 1,
          "Date": "2020-03-09T14:55:27.000Z",
          "Titre": "Bought the mini umbrellas for my three…",
          "Contenu": "Bought the mini umbrellas for my three grandkids of school age. One was broken and useless within two days."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Odette Go",
          "Nb_Reviews": 3,
          "Date": "2019-07-12T15:35:08.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Very heavy for an umbrella. Plus mine broke after less than two weeks with minimal use. So disappointed"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "George Palatianos",
          "Nb_Reviews": 1,
          "Date": "2017-10-23T22:08:08.000Z",
          "Titre": "Be very sceptical of the slick sales …",
          "Contenu": "Be very sceptical of the slick sales and claims made by this company.Davek has poor customer service once they sell you their product.After purchasing two solo's and two minis (the minis are of poor manufacturing quality and difficult to close once opened) I tried to return to get a swap using my replacement card, I was advised that the cards are not valid in Australia, fortunately I was later on a family holiday in San Francisco and also advised by a number of department stores there that they would not honor the replacement card guarantee, one store assistant advised perhaps you will have more luck in a store in New York? My conclusion is that the replacement card is a marketing gimmick and gives the customer nothing.Additionally I constantly receive promotional emails from Davek with discounts for products I'm not interested in, however when I tried to make a purchase was told this product was at full retail price and \"unfortunately we are not running a promotion on Traveler model at this time\" My conclusion from dealing with Davek is that Davek does not value it's customers, does not honor it's manufactured product guarantees and once it makes a sale it has no interest in you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rae",
          "Nb_Reviews": 2,
          "Date": "2018-12-14T00:23:10.000Z",
          "Titre": "Didn't arrive as promised before my…",
          "Contenu": "Didn't arrive as promised before my trip. .Dont need anymore. Will return when I get home."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Audrey C",
          "Nb_Reviews": 1,
          "Date": "2017-06-01T18:56:39.000Z",
          "Titre": "I haven't received my order placed on …",
          "Contenu": "I haven't received my order placed on May 25, 2017, so asking for a review is a bit premature."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darlene WAGNER",
          "Nb_Reviews": 1,
          "Date": "2019-08-09T13:05:38.000Z",
          "Titre": "My Davek Umbrella broke the first time…",
          "Contenu": "My Davek Umbrella broke the first time I opened it. Waiting to hear back about a replacement:("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MINA",
          "Nb_Reviews": 4,
          "Date": "2023-11-03T20:50:00.000Z",
          "Titre": "The umbrella is heavy and smaller than…",
          "Contenu": "The umbrella is heavy and smaller than I expected.(not the mini).It is hard to pull down to lock when closingand the folds are hard to put together neatly.A very nice color though."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T13:20:50.000Z",
          "Titre": "Great concept but…",
          "Contenu": "An great value proposition on paper, but lackluster product and subpar customer service.I think the concept of having an high quality umbrella with a lifetime guarantee and loss protection is great, it is what brought my interest in the product in the first place. (I have never used the loss protection so cannot speak on that to be fair)I have purchased the Solo, but have had multiple issues with frames bending after a short period of use.After the first replacement, I have notice a frames not extending out fully, which after - few uses got progressively worse and had to send it in again for repair. When I received the second pair, it also had the similar issues which later evolved into an unusable umbrella. To be fair, the second replacement at this moment is still usable.I have reached out to customer service to express my concern, but they genuinely seem to not care, and said that is the normal range of motion. Maybe they are right, I will give them the benefit of the doubt, but so many issues on what they advertise as a premium umbrella should not be occurring so often.I do have the mini as well, and that has worked great for years, so my advice is the following:1. Do not buy the Solo —— if you look online other people have had issues as well. (The mini works great as a backup/emergency umbrella would recommend that one if you need a backup umbrella) 2. Do not expect much from customer service.Fees for shipping and replacement/repairs do add up, so I will see how the second replacement goes, but I will not be purchasing from them or be asking for further repair. (Update: I have realized I reviewed them a few years back as well. Going back for a repair given my poor experience, that was on me, my fault. Never again.)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T14:17:46.000Z",
          "Titre": "Unfortunate returns process",
          "Contenu": "Umbrella was hard to close, returned it.  I had to pay $12 for return shipping AND a ~$10 restocking fee.  Not a great returns process for what is trying to be a higher end brand."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "S E",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T03:25:03.000Z",
          "Titre": "Ongoing Davek Duet Issues",
          "Contenu": "Last year I took a video and sent it to Davek that showed how the umbrella, a Davek Duet, would not open after hitting the release button. They were responsive and quickly replaced it. The replacement, however, buckles with a bit of wind. Specifically, the spines continually turn inside out with just about any gust of wind. This umbrella is not ideal for windy conditions, and I am unfortunately 0-2 with this model."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Fiona",
          "Nb_Reviews": 2,
          "Date": "2022-07-21T17:46:53.000Z",
          "Titre": "I recently purchased the mini as I…",
          "Contenu": "I recently purchased the mini as I wanted a sturdy umbrella to take with me in my smaller handbags. I’ve just received it (the shipping seemed to take a while) and I feel really let down by the presentation. It came wrapped in a bit of flimsy bubble wrap with a blurry invoice that looked like a child had printed it off. When I’ve spent £55 on an umbrella, I’d expect it to come in a nice little box or something at least! But instead, at first glance, it looked like something you’d get from Shein. I haven’t used it yet so can’t comment on the quality but so far, I’m pretty disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "joseph walker",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T18:10:54.000Z",
          "Titre": "Not quite the quality I expected",
          "Contenu": "The Mini retails for about $60. I got the umbrella at $39. It doesn't feel like a quality umbrella. I had bought a Temella brand at around $20 and it's quality feels better than The Davek Mini."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 4,
          "Date": "2022-04-08T10:07:26.000Z",
          "Titre": "Broke third use",
          "Contenu": "I received the traveler as a gift. It broke in some wind the third time I used it, which surprised me as they are supposed to withstand wind. I contacted the company about a repair and I have to pay to ship it back to them, and pay £9.99 for the shipping back to me. I am not very impressed given the price of the umbrellas, and business usually pay shipping in these situations."
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "Ken T",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T06:56:11.000Z",
          "Titre": "Extremely overpriced and not any more…",
          "Contenu": "It is a nice looking umbrella, but extremely overpriced and not any more durable than your average decent umbrella.  Have purchased the solo and commuter and have already had to send one back to get fixed.   I now have one with a couple of the arms bent due to wind, and tie of umbrella to the arm broke, and the other doesnt fully open to the locked position.  While it is nice to have it fixed for free, but I have to pay for shipping each time, and take the time and trouble to ship it back, which is a pain and which adds even more to the cost of an overpriced umbrella.  So, I give up and will not ship them back again.  Will throw them away and stick with your average priced umbrella from Totes or other company. Much cheaper, even in the long run having to buy multiple average priced umbrellas.  Do not recommend Davek and will not buy again.  They package a nice looking umbrella with the same basic durability of your average umbrella and charge a fortune for it, trying to make it look very upscale, but in the end, the lack of durability makes it a fail."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "MADELINE",
          "Nb_Reviews": 7,
          "Date": "2023-04-01T19:27:14.000Z",
          "Titre": "The umbrella seems flimsy",
          "Contenu": "The umbrella seems flimsy.  It's  hard to open.  I bought the little portable one, so maybe the larger ones are more sturdy.  But this expensive little umbrella doesn't seem much better than the ones for $19.99."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-10-06T16:30:36.000Z",
          "Titre": "The canopy is too small and the…",
          "Contenu": "The canopy is too small and the umbrella too heavy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Katherine",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T01:37:42.000Z",
          "Titre": "It honestly feels so flimsy",
          "Contenu": "It honestly feels so flimsy for the price I paid. I haven’t gotten a chance to use it yet, but I don’t think it will work for me in windy rain."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "kathryn g sleek",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T16:37:44.000Z",
          "Titre": "I thought this would be very…",
          "Contenu": "I thought this would be very different..it isn’t. I could have bought one for a fifth of the price at T.J.MAXX that I like jus as well"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mb",
          "Nb_Reviews": 2,
          "Date": "2022-05-06T01:21:09.000Z",
          "Titre": "This umbrella is not as advertised I do…",
          "Contenu": "This umbrella is not as advertised I do not think it will last in a wind and rain storm. For the $$ not worth it."
        },
        {
          "Note": 2,
          "Lieu": "AF",
          "Pseudo": "Jose Luis",
          "Nb_Reviews": 2,
          "Date": "2021-04-30T01:51:39.000Z",
          "Titre": "Questions of trust?",
          "Contenu": "Received my umbrella, tried it out and would not close, automatically. Fresh out of the box! Wrote to customer support and they ask that I provide \"video\" proof of my problem!!! Really, I paid $150 for it and want it to work properly out of the box! I trust you to send a quality working product, but you don't trust your customer? This is my 2nd umbrella!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debbie Smith",
          "Nb_Reviews": 1,
          "Date": "2021-02-13T17:00:54.000Z",
          "Titre": "I wanted to love this umbrella",
          "Contenu": "I wanted to love this umbrella, but I just can't. I know it's the lowest end of their umbrellas. I bought it because it's small and I wanted to take it to Europe. The quality is less than desirable. I paid extra for an umbrella that I thought would stand the test of time. This umbrella isn't it. Maybe the bigger ones are better quality."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary Amerson",
          "Nb_Reviews": 3,
          "Date": "2019-12-13T22:57:07.000Z",
          "Titre": "The product is amazing",
          "Contenu": "The product is amazing.  UPS stinks.  They should get a new delivery service.  UPS has bee telling me for three days they are going to deliver.  At the end of the day they send out a note stating the package was delayed.  I waited all day and then UPS does not deliver.  I think they should just go ahead and add the \"S\" into their name \"USPS\"."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "AndrewP",
          "Nb_Reviews": 9,
          "Date": "2018-12-04T18:49:29.000Z",
          "Titre": "We want this umbrella to be the last…",
          "Contenu": "We want this umbrella to be the last umbrella you will ever need - however you can't get the color you have ordered and paid for so awful experience so far, do you really want to own an umbrella for that long if it is not in your chosen color? just hope the experience of owning the umbrella is better than Davek ordering / purchase process."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 2,
          "Date": "2017-04-18T15:34:18.000Z",
          "Titre": "Slow service",
          "Contenu": "Hi; Sorry for the 2 stars, but I'm not able to rate the actual umbrella yet, as it hasn't arrived. I placed my order on 4/7, got a UPS notification that it shipped on 4/12, and it's supposed to be here tomorrow on 4/19. The whole process seems pretty slow to me, especially since it's raining hard outside right now, and I would have loved to have been able to use it today."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "G Diaz",
          "Nb_Reviews": 5,
          "Date": "2020-03-04T22:13:57.000Z",
          "Titre": "Looks good but very flimsy",
          "Contenu": "I got the Solo umbrella mainly because of the size and the closing mechanism, it also looks good and the fabric feels nice...BUT is not very sturdy, it wobbles a lot with light wind gusts and turns upside down very easily; my wife's $20 umbrella handles wind so much better than my $150 Davek."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SH",
          "Nb_Reviews": 2,
          "Date": "2019-09-06T15:31:46.000Z",
          "Titre": "The buckle on the bag is awful",
          "Contenu": "The buckle on the bag is awful. You can't open or close it while you are wearing the bag. To open the buckle, you have to take the bag off and approach it from the front. The mechanism is concealed by the flap of the bag. Reach under the flap to grab the sides of the lock, squeeze the lock, and pull. To close the buckle, do the same. No way at all to accomplish this while wearing the bag. The bag is also extremely heavy, even with nothing in it. In short, it's beautifully designed and looks great, but impossible to use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Naaman Dolphus",
          "Nb_Reviews": 5,
          "Date": "2018-08-03T21:26:49.000Z",
          "Titre": "The umbrella is well made and…",
          "Contenu": "The umbrella is well made and definitely quality.  However, it is not a $150 umbrella.  I will be returning it before the 30 days are up.Davek service was really good when I called to return the product.  Refund was extremely prompt less the shipping cost which I knew when I bought the umbrella."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barbara West",
          "Nb_Reviews": 1,
          "Date": "2016-09-13T16:00:04.000Z",
          "Titre": "Received small tote broken",
          "Contenu": "I surprised my daughter in law with this umbrella knowing how well they are built but then she received it broken. They are replacing it but now I have doubts how well they are made. I was so excited that I was able to give her something very special but the excitement turned to disappointment"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alan Johnson",
          "Nb_Reviews": 2,
          "Date": "2020-04-13T00:35:11.000Z",
          "Titre": "I thought this was going to be an…",
          "Contenu": "I thought this was going to be an automatic open and shut umbrella. It's cheap and difficult to open. I like my Totes much better. I paid less money for my Totes and it's a far superior product. I'll eat this one but it's the last one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2019-03-16T03:47:14.000Z",
          "Titre": "just another umbrella if the app doesn’t work",
          "Contenu": "Have had this for only 3 months. Good umbrella but the loss alert app stopped working. Still waiting for a response from customer support. Major feature of the umbrella is worthless without a functioning app. My Weatherman umbrella is more reliable after 2 years."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Emily Hoober",
          "Nb_Reviews": 1,
          "Date": "2016-09-14T17:15:27.000Z",
          "Titre": "Replacement Disappointment",
          "Contenu": "I liked the idea when I purchased the umbrella that I could get a new one if I lost it. But it turns out, with only a 25% discount and the cost of shipping, the replacement was almost as much as the original. I've now paid almost $100 for my little umbrella. Waste of money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Martha Dudman",
          "Nb_Reviews": 2,
          "Date": "2019-10-20T10:02:56.000Z",
          "Titre": "My umbrella arrived with a black dirt…",
          "Contenu": "My umbrella arrived with a black dirt mark on the side.  Since I am about to leave the country and don't have time to return it, I will keep it, but I am disappointed.  Also it is bulkier than I expected, and does not fit easily in the cover."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris R.",
          "Nb_Reviews": 2,
          "Date": "2020-06-18T20:39:12.000Z",
          "Titre": "Cute but flimsy",
          "Contenu": "I expected the mini to have a little more substance, but it feels like one gust of wind will tear it apart. It's also REALLY small, better suited to a dash from the car than actual use. The price is ridiculous for what you get."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AIH",
          "Nb_Reviews": 4,
          "Date": "2017-08-28T15:29:49.000Z",
          "Titre": "Offer for 10% discount was bogus.",
          "Contenu": "I am annoyed by the fact that they did not give me the 10% discount promised on the web page for a first order because I bought a package of two umbrellas. The offer was not conditional and these umbrellas are expensive. Seems like a bait and switch."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 5,
          "Date": "2017-11-14T18:22:29.000Z",
          "Titre": "Not Worth $100!",
          "Contenu": "After submitting my  totally honest and truthful review, I now see so many additional, obviously quickly written, contrived reviews trying to offset my review, as well as other truthful reviews.Be smart enough to see thru these contrived reviews. Clearly, this $100 umbrella is a total rip-off for this price. There is an umbrella available on Amazon for $21+ that's every bit as good as Davek's \"Solo\". Don't be duped here. This product is flat out NOT worth $100!Sure, it was delivered quickly and when I called Davek with questions (such as where it was actually manufactured (China, by the way) there was no problems whatsoever."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Linda McKim",
          "Nb_Reviews": 7,
          "Date": "2021-08-13T04:37:35.000Z",
          "Titre": "Costly mistake",
          "Contenu": "I bought the smallest umbrella in January for keeping in my handbag. It certainly is small and light, but obviously that means the quality suffers. I have used it a handful of times, and unfortunately a small screw in the spokes broke off. This is when I discovered the drawbacks of a “lifetime” guarantee. I have to pay for postage to send it for repair and also enclose postage of £9.99 to have it returned to me. Considering how quickly it broke this time, I can imagine quickly spending more than it cost in the first place to have it repaired. In my opinion it has lasted such a short time that Davek should at the very least be paying for postage. In my opinion it’s not fit for purpose. So no, I won’t be returning it and will have to put it down to a costly mistake."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beverly Guerra",
          "Nb_Reviews": 2,
          "Date": "2017-07-18T17:51:13.000Z",
          "Titre": "I'm rating the umbrella",
          "Contenu": "I'm rating the umbrella, itself -- not the experience.  The Customer Service experience was excellent.  The Umbrella itself was not very functional for the money.  I will keep it but, based on this umbrella, I would not order another one from them.  I think that for the money, my umbrella should have at least an automatic close and open button but instead, the umbrella opens and closes manually.  So, I was disappointed in the quality.  I like the size because I travel a lot and wanted something small for my suitcase -- I'm a flight attendant and space is important.  But I really wanted something with an automatic open and close feature on it.  Thanks!  Hope this helps."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JOSEPH BRUSO",
          "Nb_Reviews": 1,
          "Date": "2016-07-20T19:55:01.000Z",
          "Titre": "I paid almost",
          "Contenu": "The Davek products are great BUT I paid nearly $50 on an $850 order on Thursday for 2-Day air delivery but did not receive my order until the next Tuesday (5 days after irdering) and yet I received no refund of my $50!"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Rick",
          "Nb_Reviews": 4,
          "Date": "2018-08-06T19:53:44.000Z",
          "Titre": "Definitely overpriced I purchased the …",
          "Contenu": "Definitely overpriced I purchased the mini I admit I should have researched it more it is simply way too small a coverage and heavy at that. I did not realise it was a manual mechanism again at that price I just assumed it was auto pop up.Update : I am quite shocked at receiving an email indicating my above review was removed because of what I stated above  which is the truth and which I still stand by a year later it is sad that this umbrella company can “bully” Trustpilot to remove my comments which is of course only “my opinion” I am sinply amazed 😓🙁.In terms of service well my experience is only online but the website appeared user friendly and the parcel arrived in a timely fashion."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2016-12-26T17:04:42.000Z",
          "Titre": "Still waiting for delivery",
          "Contenu": "Slow delivery of product - 10 days and not due until tomorrow. By far the slowest product delivered this holiday season. It would be wise for Davek to send their opinion poll after their product arrives."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Quintal",
          "Nb_Reviews": 2,
          "Date": "2016-12-14T19:28:45.000Z",
          "Titre": "it's just too small",
          "Contenu": "This was a gift for my wife, a daily commuter. The shipping was great, very quick. Unfortunately the coverage the umbrella provides is really too small.  I'll need to figure out what to do next."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nancy Pikulik",
          "Nb_Reviews": 2,
          "Date": "2020-10-04T18:45:41.000Z",
          "Titre": "I loved the idea of this",
          "Contenu": "I loved the idea of this. I do use Tile which works for me. However, with the Davek locator, I can be in the car with my umbrella in my tote right next to me & my phone is constantly notifying me that my umbrella is lost, then it's found, lost, then found. If indoors, it might not be so distracting, but while driving, it does become a distraction. I suppose I can turn off the connection until I get out of the car & turn it on when I've opened the umbrella for the rain, but, if I forget, the device doesn't service its purpose. I'm confused as to what's best to make this work for me. Please help with suggestions. Between the ones I've purchased & the ones I inherited from my mother, I must have 8 Davek umbrellas & wouldn't want to use any one of them. Thanks. Nancy"
        },
        {
          "Note": 2,
          "Lieu": "TH",
          "Pseudo": "John Kim",
          "Nb_Reviews": 1,
          "Date": "2019-08-05T05:32:31.000Z",
          "Titre": "I purchased 2 traveler umbrellas. Unhappy.",
          "Contenu": "I purchased 2 traveler umbrella, one for my girlfriend and for myself. I found them to be beautifuly made. Within 6 months, both umbrellas were damaged beyond repair. The culprit is the very weak material used for the ribs. I have analyzed the damages. One rib was twisted and bent like a pretzel. I could not believe how thin the metal was. One rib was separated from the joint that folds. Lastly, one rib just snapped off, as if the metal was cut in half with a sharp knife. Due to the cost of the umbrellas, we have been very careful using them. I have spent over $250 having 2 of them shipped to me in Thailand from Japan, believing these will last for years. I am very disappointed and I will not purchase this model again. Davek definitely needs to use much stronger metal for the ribs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kellie Herman",
          "Nb_Reviews": 2,
          "Date": "2019-11-04T17:01:59.000Z",
          "Titre": "The umbrella color is beautiful",
          "Contenu": "The umbrella color is beautiful, but the mechanics and size is insufficient and feel cheap. Nothing about this umbrella was cheap. Always wanted a Davek, but was disappointed. Sorry."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Jessica Abberton",
          "Nb_Reviews": 2,
          "Date": "2020-09-01T09:54:08.000Z",
          "Titre": "I am not satisfied with product",
          "Contenu": "I am pretty upset about this product. I got the travel size Davek Umbrella in March paid $150 (worth around $180ish) and my umbrella was broken within a couple of months (I hadn't used it much but only kept in in my handbag unused in it's case. One day I opened my umbrella when I needed to use it and noticed it was broken all of a sudden! I kept the warranty card for the umbrella and emailed through to the team and they sent me another one.. Well this other one they sent me is also broken now and I swear that I do not do anything out of ordinary with them! So I do not recommend buying these umbrellas and I do not think they are the quality that they advertise to be! It makes me upset as all I want is a decent umbrella that doesn't go upside down in the wind and this one did so and also broke at the metal bits."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melinda",
          "Nb_Reviews": 1,
          "Date": "2019-10-21T15:36:00.000Z",
          "Titre": "Wrong Color - Zero Customer Service - No Response",
          "Contenu": "I emailed nearly immediately after ordering asking for a different color (within 5 minutes). No response. Wrong color umbrella. Great product, but the buying experience sucked."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Daniel Rodrigue",
          "Nb_Reviews": 1,
          "Date": "2020-05-21T14:32:09.000Z",
          "Titre": "On the first use a gust of wind caused…",
          "Contenu": "On the first use a gust of wind caused the unbrella to turn over and one of the branches broke. I wrote to the company and sent photos and I never got an answer. So bad..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Duncan Shrout",
          "Nb_Reviews": 1,
          "Date": "2019-07-27T21:52:25.000Z",
          "Titre": "The new umbrella I received does not…Too Much",
          "Contenu": "The new umbrella I received does not work. I have to pay both ways to receive a new second umbrella. This company advertises in the Times, and yet it does not work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "irene lozach",
          "Nb_Reviews": 2,
          "Date": "2018-03-02T13:44:06.000Z",
          "Titre": "Great umbrella. Until it’s not....buyer be informed",
          "Contenu": "I have ordered and used or gifted two Davek umbrellas in three years and both have proven just as unreliable as any umbrella you'd buy on the street at the beginning of a rainstorm in NYC. Each have, remarkably, had a broken rib within a year of modest and responsible use in addition to problems with details such as hanger loop breaking off after zero use and decorative bits popping out. I have to say that their claims of quality and durability should come with qualifications. Their policy of replacement once you pay them postage, pack your broken umbrella and return it was made good on in a timely manner, however, and Dave K was concerned about this review to a point that he emailed me twice during the return process. The replacement umbrellas appear to conform with the quality of the original purchases. This is one way to provide a guarantee though time will tell if further returns and their accompanying inconvenience are required."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dr Antony J Lepire",
          "Nb_Reviews": 3,
          "Date": "2020-01-24T17:28:49.000Z",
          "Titre": "VERY BAD PRODUCT",
          "Contenu": "The umbrella is very cheaply constructed and it jams.The clip to lower it CUT MY FINGER.Gee. Other than that, the blue color is not red!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "T Smith",
          "Nb_Reviews": 2,
          "Date": "2019-03-19T20:00:22.000Z",
          "Titre": "I ordered two Davek umbrellas",
          "Contenu": "I ordered two Davek umbrellas, a Solo and Traveller. Today, the third time my wife used the Traveller, it broke while opening. Disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keith akioka",
          "Nb_Reviews": 1,
          "Date": "2016-12-27T00:03:32.000Z",
          "Titre": "Shipping options",
          "Contenu": "Davek,Unfornately the review I'm giving Davek may not be to your expectations. The fact is i ordered your product on sunday the 18th expecting better shipping options then ground. I know weather permits in ground shipping, so with that said i have not received your product and will not get your product until the 28th of Dec., with no updates from UPS since the order except for \"IN Transit\".This was a gift for xmas but since ground shipping is all you offer to your customers, we are at the mercy of the shipping agancy and Davek..         I suggest in the near future Davek  offers customers much more options on shipping. Will I order the product again, in the near future sure i will.  I know your products/product are top notch and craftmanship that goes into the umbrellas are second to none. I feel at this moment and time i will not be ordering your product again or referring you on Social Media  until shipping options are improved.Happy New YearRegards,Keith"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "S. Baker",
          "Nb_Reviews": 1,
          "Date": "2017-11-09T08:24:09.000Z",
          "Titre": "Returning a piece I ordered was much …",
          "Contenu": "Returning a piece I ordered was much more complicated than I felt it should have been, and they were not accomodating with an exchange."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve Miley",
          "Nb_Reviews": 4,
          "Date": "2019-03-15T16:36:39.000Z",
          "Titre": "Not recommended for NYC weather",
          "Contenu": "The shaft is very flimsy and not strong enough for any wind. You’ll spend most of your time fighting this while getting wet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jared Brees",
          "Nb_Reviews": 1,
          "Date": "2020-09-11T16:21:29.000Z",
          "Titre": "Just rebranded Totes",
          "Contenu": "This just doesn't make sense. So I bought the Davek Duet, a $150 umbrella. As best as I can tell, it's basically the same build quality as my $25 Totes umbrella (which also has a lifetime warranty, though was shredded in the recent derecho).The fabric is a little nicer, sure, and the handle is amazingly solid. BUT the wrist strap is too small to be easy to use, and because it's so thick and stuck in one spot on the handle, it makes it very uncomfortable to hold the umbrella with your left hand, assuming you want to be able to press the button with your thumb.The fabric is still only tacked on at the same amount of points as the Totes umbrella, nothing fancy. Also, it often doesn't completely open with just a button press - you have to give it a little shake or manually push the slider up the rest of the way. I contacted support when I found this, and even offered to try oiling the shaft, but they claimed this is \"normal\".This is a $25 umbrella with a $5 rock-solid good-looking uncomfortable-to-use handle - as best as I can tell, certainly not worth $150."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laura Young",
          "Nb_Reviews": 1,
          "Date": "2021-02-08T17:39:38.000Z",
          "Titre": "Stiff",
          "Contenu": "Stiff, difficult opening action was a huge disappointment to me. On the positive side, I did like its small size."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Roth",
          "Nb_Reviews": 1,
          "Date": "2019-04-21T22:37:08.000Z",
          "Titre": "My trackable umbrella still doesn't…",
          "Contenu": "My trackable umbrella still doesn't work.  Contacted customer service but waiting to get replacement parts."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Anne",
          "Nb_Reviews": 2,
          "Date": "2018-05-05T23:11:51.000Z",
          "Titre": "Poor Customer Relations skills",
          "Contenu": "I ordered two different coloured Davek traveller umbrellas expecting to get exactly what I paid for and ordered. Nowhere were the colours I chose displayed as out of stock.I received an email from the Davek Team saying one of the colours I had ordered was out of stock. My return email requested that I did not want to receive two umbrellas of the same colour and not a black umbrella.The umbrellas are very experience $139 for each so one would expect to receive what was purchased.My order arrived and I received two fushia coloured umbrellas.No good enough Davek Accessories that is not what I purchased.Yes I could return one but that would cost me extra money.The reason why I gave Davek two stars is because the Davek Team displayed poor communication skills - I did not order two of thesame coloured umbrellas and the package department made a decision to disptach me two of the same coloured umbrellas. I feel as a customer Davek Accessories should have dispatched to me what I ordered or refunded $139 for one umbrella  because the company could not supply what I ordered.Davek Accessories needs to value their customer's patronage."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dennis Redmond",
          "Nb_Reviews": 2,
          "Date": "2020-08-22T14:24:31.000Z",
          "Titre": "When it arrived",
          "Contenu": "When it arrived, it would not stay open. I’ve returned it for a replacement. Have not received it yet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 8,
          "Date": "2019-03-10T22:22:05.000Z",
          "Titre": "I do research for a living and thought…",
          "Contenu": "I do research for a living and thought this umbrella was the one which would last a \"lifetime\".  Unfortunately, it's going back in the morning after about a years usage and $150 for ownership.  The \"firing mechanism/button\" failed and the leather fob which joins the strap to the umbrella is already flaking which is quite odd considering the price.  I hope they replace it and to be fair to the company - maybe I just got a \"bad\" one?  Time will tell...*UPDATE (3/10/19) The company replaced the above umbrella with a new one which to their credit - they did stand behind their warranty.  It would have been nice if someone would have at least responded to my concern regarding their products quality, however there was only an invoice and new umbrella in the box.  I also drive late model BMW's and when taken in for service they provide me nice loaner vehicles with a smile.  This weekend my loaner is a new 108K vehicle.  They smiled and said enjoy!  Now that's what I call customer service.  Companies need to understand it's also the words that go with the product which make our day many times, respect us and we will return the favor ten fold."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roben Farzad",
          "Nb_Reviews": 1,
          "Date": "2019-03-04T19:28:51.000Z",
          "Titre": "Your ads followed me around the…",
          "Contenu": "Your ads followed me around the Internet endlessly. Creepy. I tried to opt out but you would not relent"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Malangone",
          "Nb_Reviews": 3,
          "Date": "2019-03-29T02:08:41.000Z",
          "Titre": "The Bluetooth umbrella keeps connecting …",
          "Contenu": "The Bluetooth umbrella keeps connecting and reconnecting Over and over. It's virtually useless"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Theresa Concert",
          "Nb_Reviews": 2,
          "Date": "2020-11-12T14:05:08.000Z",
          "Titre": "Don’t know if it works on mini no",
          "Contenu": "Don’t know if it works on mini. Could not figure out so just dumped in the draw."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick Sklarin",
          "Nb_Reviews": 1,
          "Date": "2019-11-09T16:22:42.000Z",
          "Titre": "Delivery took over a week",
          "Contenu": "Delivery took over a week, expected faster delivery. Products seems fine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T23:58:06.000Z",
          "Titre": "Quality of mini umbrella was way less…",
          "Contenu": "Quality of mini umbrella was way less than I expected."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Bigaouette",
          "Nb_Reviews": 1,
          "Date": "2020-02-23T01:11:46.000Z",
          "Titre": "From The Very Best, To The Very Worst",
          "Contenu": "My original Davek Umbrella I bought 3 years ago was strong, heavy duty, with leather wrap around.  Three years later I wanted to buy another one, the same because the original one I bought three years ago was worn out.  But it lasted a great three years.  I go to the same store where I purchased the first one, and I’m being told that particular one I purchased three years ago was discontinued.  Supposedly the next one I purchased was supposed to be similar to the one I purchased three years ago.  When I took the lid off of the box and took this umbrella out of the box, not only it did not have that leather wrap around, it was smaller,  and when I opened it, it was smaller, and the material looked cheap.  It was not heavy duty.  It was lightweight!!  Lightweight against the winds in NYC will not last beyond a few months, that about the time it would fall apart.  I did not keep this, I took it back to the store.  The management said this was the best they could do.  I asked for a refund.  The following week I called the Davek Corporate Office, on Madison Avenue.  After explaining my plight to one of the executives, he said he would look to see if it could be find the exact kind I purchased three years ago by calling the warehouse.  A couple of days later I received another Umbrella.  I opened the box, it was not the heavy duty one, but it did have the leather wrap around.   Instead, it was the same lightweight cheap one I bought at the store.  The only thing different was it had the leather wrap around.  It was smaller then the original and lightweight.This was no good.  I called the corporate office again, and spoke with the same executive.  He said that there was nothing more they could do.  Except get a refund by send them back the other one.  I sent it back.   Not happy about this.  Davek was supposed to be about Quality!  The original one I bought three years ago was $149.00, but it was worth it!  Now, I spend $149.00, and get a smaller, lightweight piece of garbage."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Oscar Dennis",
          "Nb_Reviews": 1,
          "Date": "2020-02-20T18:03:56.000Z",
          "Titre": "Not made for the cross-winds of London."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 2,
          "Date": "2017-08-03T15:46:55.000Z",
          "Titre": "The sewing on the strap became loose …[UPDATED]",
          "Contenu": "The sewing on the strap became loose after two uses. Reached out to the company upon registering the product, but no response. I don't think it is fair that I would have to pay shipping and handling for a repairing/replacing a faulty product.*UPDATE*Firstly, I would like to revise the rating from a 1-Star to 2-Star, since 1-Star was defined as \"1 star: Bad – unacceptable experience, unreasonable and rude conduct.\". None of the representatives were rude in any way, so I thought this revision would be fair.Secondly, to clarify, this is on the Solo Umbrella. While my review is negative, I do love the look and feel of the umbrella except for the defective strap. I've also bought the Mini, which is holding up great so far.Thirdly, upon the post of my first review, I did receive an e-mail from their support team:\"Sorry we missed your original email. If your umbrella needs repair, you can send it back to us as per the warranty. We will either fix it or  more likely send a brand new umbrella back to you. Please send the umbrella back to us for repair/replacement...Include your name, mailing address and receipt for return shipping payment  with your return. \"While I understand that it is fair for customers to pay for shipping both ways (to Davek and back to you) if it is a repair due to regular wear-and-tear or customer-driven factors. However, it does not seem fair to the customers who received a defective product, who will have to pay shipping to davek PLUS an additional $9.95 for return shipping (essentially a 20 dollar penalty). This was my original issue, and that being responded by a standard template response that does not even address the issue, was a major disappointment for me. Since I don't want the strap to ruin the integrity of the entire umbrella, I will be returning this for a replacement. Hopefully that one will hold up.Their lifetime guarantee does offer some great benefits for long-term users, but can really short-change those who receive a defective product.Fellow customers, please be aware you are taking that risk with this umbrella."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carmine",
          "Nb_Reviews": 8,
          "Date": "2023-09-27T19:37:40.000Z",
          "Titre": "THE DAVEK MINI and return policy",
          "Contenu": "Ordered both the THE DAVEK MINI and THE DAVEK SOLO. Arrived in a reasonable amount of time. THE DAVEK SOLO is an attractive umbrella, that is fairly well made, but not worth the price.THE DAVEK MINI is attractive but in function and quality build falls short and is not much better than a $15 umbrella you can purchase from a street vendor. I was going to return, but you have to pay for shipping back and they also deduct $10 for the original shipping to you. So it will cost you more than $20 to return a $59 umbrella. BTW you can also purchase these umbrella's from AMAZON."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mat",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T20:46:33.000Z",
          "Titre": "The signature umbrellas quality is meh",
          "Contenu": "The signature umbrellas quality is fine. Definitely not what I’d expect from a $150 item. The metal finishes feel like plastic covered with metallic paint, the shafts fiberglass pattern makes it look like it is chipped, the metal part on the handle doesn’t look like it was completely put on before gluing, and the leather feels fake. I will say the release mechanism is very good, quick to open, and feels sturdy. I wouldn’t buy again though, I feel like this is the company’s high margin product. It would be extremely difficult to tell this apart from an Amazon equivalent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James M Montagne",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T19:12:56.000Z",
          "Titre": "The umbrella for two that arrived works…",
          "Contenu": "The umbrella for two that arrived works fine and is beautiful, the mini umbrella does not open at all rendering it useless. A solo bought a few years back malfunctioned in the fall of 2022🥲!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "marjorie rubin",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T16:19:57.000Z",
          "Titre": "The umbrella is  nice but when I tried…",
          "Contenu": "The umbrella is  nice but when I tried to exchange it, it would cost $22 in shipping.  For the price of these umbrellas it should be free shipping on returns or exchanges."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elena Malova",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T02:07:55.000Z",
          "Titre": "Look very cheap."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vic",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T15:47:50.000Z",
          "Titre": "Lightweight umbrella",
          "Contenu": "Only had it less than a week, Nothing spectacular, just a small umbrella. Haven't had a chance to try in rain yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rahmon Animashaun",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T14:58:59.000Z",
          "Titre": "I love the big umbrella",
          "Contenu": "I love the big umbrella, but the mini umbrella was a waste of money, I’ll probably trash it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruce Hollihan",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T16:31:25.000Z",
          "Titre": "It would have been better if you…",
          "Contenu": "It would have been better if you honored your coupon for the purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phil Battershell",
          "Nb_Reviews": 2,
          "Date": "2022-09-09T00:00:25.000Z",
          "Titre": "It seems flimsy",
          "Contenu": "It seems flimsy. It doesn’t go up automatically and it seems small"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John L",
          "Nb_Reviews": 3,
          "Date": "2022-01-10T17:16:09.000Z",
          "Titre": "The umbrellas are great",
          "Contenu": "The umbrellas are great.  Not so with their zippered wallets.  Difficult to fit credit cards and difficult to remove.  I've bought Bellroy products to compare and the leathers are softer and more manageable.  Time will tell how durable these are in comparison.  In the meanwhile I'm not completely thrilled with this product but will live with it for now.  Umbrellas, \"YES\", wallets, \"NO\"."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carol Virkus",
          "Nb_Reviews": 2,
          "Date": "2021-09-04T04:16:17.000Z",
          "Titre": "Being Seventy-nine Years Old",
          "Contenu": "Being seventy-nine years old and having several umbrellas in my life, I thought I would get a small umbrella that would last. I must say that I've never bought an umbrella that cost more than ten dollars. Spending fifty dollars seemed that it should certainly be good. I was disappointed when I received it. Yes, the size was great. Its construction seems good. I do have a problem getting it opened with my arthritis."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 12,
          "Date": "2021-11-04T14:29:59.000Z",
          "Titre": "Replacing a broken umbrella",
          "Contenu": "We bought a Davek Traveler which we used minimally for a year then one of the spokes broke and we applied for it to be replaced.  Surprised to have to pay 40% of reg. price.  Thought it should have been replaced free. New umbrella arrived rapidly, seems to work fine, have not used it in rain."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter Spitzer",
          "Nb_Reviews": 2,
          "Date": "2022-03-12T19:38:40.000Z",
          "Titre": "The umbrella is OK, but not great",
          "Contenu": "The umbrella is nice, but the cover/sleeve for it when it is closed is too tight, and when the umbrella is open/extended an unnecessary flap of material hangs off one of the spokes.It’s an OK umbrella, but I wouldn’t call it great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nambr",
          "Nb_Reviews": 1,
          "Date": "2020-10-16T03:47:08.000Z",
          "Titre": "Beautiful but hasn’t rained since they arrived",
          "Contenu": "This is for the loss alert sensor for the umbrella I put it on the umbrella and have been taking my umbrella back and forth to work but have not got to use it yet because it hasn’t rained since I got it so I was showing my daughter my new umbrella a the little sensor is already lost off the umbrella what a waste 😅it is called for rain tomorrow so maybe I’ll get to try out both my new umbrellas then I will update on them"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RACHEL LEHMAN",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T15:07:17.000Z",
          "Titre": "Although I haven't used it yet",
          "Contenu": "Although I haven't used it yet, when i opened the umbrella the handle seems pretty loose and not as sturdy as I was expecting.  I ordered the mini for an upcoming trip overseas and the size seems perfect for my small bag.  I ordered red and the color is fabulous. I'm just not sold on the handle and how it will hold up in the weather. I thought about returning it but then saw they don't pay for returns. And if I do return it, I have to pay for the original shipping amount, which they deduct from the amount reimbursed.  I decided to keep it as the size and color are perfect. I'm just praying it does its job and is able to weather any storms."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kirk Mckeever",
          "Nb_Reviews": 1,
          "Date": "2020-08-25T01:09:42.000Z",
          "Titre": "The Royal Blue\" was not...",
          "Contenu": "The Royal Blue\" was not.   The color I received was Light/Medium Light---very disappointing...Royal is a masculine color, light blue is not.....I liked the umbrella enough to give it as a gift, and ordered another one.....if this one is not the \"correct\" color, I will send it back for a refund.   As a business, you have to get these things straight."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elizabeth Clemente House",
          "Nb_Reviews": 1,
          "Date": "2020-02-07T01:13:56.000Z",
          "Titre": "I think the umbrella is fine",
          "Contenu": "I think the umbrella is fine. It seems very sturdy and is easy to pop up and down. However, I had to hunt through the neighborhood to find it because it was delivered to the neighbor in back of me. It took me a while to track it down, and it took a while to have an online chat with a representative from UPS. If the carrier had sent me a picture, it would have been helpful. I would have known where to start."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathan Metilly",
          "Nb_Reviews": 1,
          "Date": "2019-12-18T01:10:58.000Z",
          "Titre": "When the umbrella came in it looked…decent",
          "Contenu": "When the umbrella came in it looked good! However, after only a day of very light use, (no rainiest carrying it with me) the end cap came off! I called in and spoke with a representative about it and she said she'd send another one out to me. If I pay a chunk of change for an umbrella I expect it to give me years of trust worthy service and not disassemble at the very sight of me! lol"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carol Corley",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T03:41:15.000Z",
          "Titre": "Not as sturdy as we’d hoped",
          "Contenu": "The umbrella comes in impressive packaging, looks great and opens and closes powerfully. But when open, it doesn’t feel as strong as we thought it would. We bought it to replace a wind-proof umbrella we got from Hammacher Schlemmer years ago and recently lost. The old umbrella was much sturdier. We’ll see how this performs in strong wind."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Walter Blanco",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T17:49:20.000Z",
          "Titre": "Nice umbrella, but lacks open and close button.",
          "Contenu": "I guess I didn’t do my homework, because I bought my wife the $100 umbrella, which is beautiful, very strong and has a button that both opens and closes the umbrella. I decided to get the smallest model, which I thought was super convenient at 7 inches. I assumed that the little one was as sturdy as the other and also had the button. I was mistaken on both counts. I’ll keep the umbrella because it’s a pain to return things, but I’m disappointed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Y",
          "Nb_Reviews": 1,
          "Date": "2019-02-12T21:11:46.000Z",
          "Titre": "Davek Mini and Traveler…",
          "Contenu": "I bought the Davek Mini and Traveler combo. I like the Mini. It lives up to the name and works well for a small, manual umbrella. I'm not wild about the Traveler. It has an overly small handle for the weight of the umbrella and is tough to hold. The strap is awkward. I cannot fit my hand through it, it is stiff leather, it doesn't fall to a hang but instead sticks out, and it is more nuisance than functional."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J Fadale",
          "Nb_Reviews": 1,
          "Date": "2020-02-21T20:17:59.000Z",
          "Titre": "The Davek mini",
          "Contenu": "The mini umbrella is quite nice and it is the right size for my purse which is what I was looking for in a good umbrella, however it is manual and that is exactly what I was not looking for in a good umbrella. I'm sure that this is my fault and that I somehow missed this in your description but with all that I need to carry while on my way into work, this is not at all what I wanted or needed. I absolutely need a small umbrella with automatic opening, so I will have to return the Davek  mini."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vicki Davis",
          "Nb_Reviews": 1,
          "Date": "2019-04-09T14:30:51.000Z",
          "Titre": "I purchased the smallest size travel…",
          "Contenu": "I purchased the smallest size travel umbrella. The size is good for packing as it is small and light. However, it is difficult to get opened. It takes some muscle to get the ribs to lock into the shaft.  It is a struggle in the rain and if one has anything else in hand (purse, packages, etc.), it is impossible to manoever.  Prepare to get wet!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alson Ching",
          "Nb_Reviews": 1,
          "Date": "2019-07-09T03:54:32.000Z",
          "Titre": "Average/Above Average",
          "Contenu": "So far, the umbrella is average and there are actually lighter umbrellas out in the market that have just as good or better quality than these Davek Umbrellas.  Also, shipping to Hawaii is expensive, but I took the chance on this umbrella anyways.  It does the job, but because there are others (from Japan where my wife frequents a lot), I have to give it the average rating.  Although it is lighter than most mini umbrellas, there are still lighter and better ones out there."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joyce G",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T16:09:52.000Z",
          "Titre": "Received the umbrella right away and…",
          "Contenu": "Received the umbrella right away and packaged well. A nice and compact umbrella. But there was a scratch on the end cap of the handle that is quite noticeable since it’s a shiny cap. Wrote to customer support and awaiting for a response for a replacement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phil Light",
          "Nb_Reviews": 2,
          "Date": "2020-02-22T17:14:02.000Z",
          "Titre": "It's an okay compact umbrella but overpriced.",
          "Contenu": "It's an okay compact umbrella, but the quality does not justify the high price. For instance, the frame geometry is complex, and there are small, hand-tied strings that tether the fabric and the frame. These tethers help coax the fabric into conforming to the shape as the frame folds. On my product, one of these string ties has come completely undone, and another is untied and about to come unraveled. It will still function, but it doesn't fold neatly without manually tucking the fabric into place."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Harlan Lachman",
          "Nb_Reviews": 2,
          "Date": "2019-07-05T22:39:52.000Z",
          "Titre": "Davek Traveler.",
          "Contenu": "Davek Traveler.I ordered this umbrella from Davek. It is what it is. I was surprised by its girth (hard to pack), lack of coverage for its length, and the aggressiveness of the mechanism. I returned it. I hope to replace it with a Knirps T100. Even counting the $20 I lost on on shipping both ways, I will save money and getting more coverage with the Knirps. Based on the ads and reviews, I expected more for a luxury priced umbrella.  Nothing wrong with it. Nothing special either."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Noah David",
          "Nb_Reviews": 1,
          "Date": "2019-04-26T15:51:48.000Z",
          "Titre": "Can’t recommend these umbrellas for long term use",
          "Contenu": "The return/exchange process for defective umbrellas is expensive. It costs $20 to do an exchange because they make you pay for shipping both ways. Then the new umbrella they send you is of lower quality than the one you sent in for repair. My original umbrella had a leather strap. This new one has a nylon strap. I wouldn’t buy from Davek again and customer service hasn’t been helpful at all. They want another $10 to send me the version with the leather strap. It’s laughable."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Trevor",
          "Nb_Reviews": 3,
          "Date": "2017-11-10T15:10:53.000Z",
          "Titre": "While I love the Davek umbrellas",
          "Contenu": "While I love the Davek umbrellas, I was disappointed to discover that I could not order the umbrella I wanted from the company's Canadian site. I had to order it from the US site and have it shipped to a friend in the United States.Davek: it's an international market out there. Don't pare down your catalog for international customers.Thanks for making great products - but give us access to all of them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan Rodgers",
          "Nb_Reviews": 1,
          "Date": "2019-04-08T21:54:21.000Z",
          "Titre": "Good umbrella, and not yellow.",
          "Contenu": "So far the mini umbrella is doing well. It’s very light, opens easily, and seems to do well with light wind. I haven’t had occasion to use it in a heavier wind.  I’m disappointed that the yellow is actually orange, and not at all close to the yellow on the website. If I could change that, I would. Otherwise, I like it a lot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RobertL",
          "Nb_Reviews": 1,
          "Date": "2017-11-10T01:14:10.000Z",
          "Titre": "Davek Solo- Nice, but not $100 worth of nice",
          "Contenu": "I just received my Davek Solo umbrella, and honestly my several years old $20 Totes umbrella opens more smoothly, and completely- the Solo doesn't quite open completely, it stops about an inch shy of being fully open, have to \"manually\" push it up. I'm sure it is otherwise more strongly constructed, but certainly doesn't seem to be worth $100."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dorothy Fabry",
          "Nb_Reviews": 1,
          "Date": "2018-10-17T15:05:22.000Z",
          "Titre": "Poor Product Information",
          "Contenu": "The information about the Traveler umbrella was misleading. The umbrella is much heavier & bigger than I expected. Product information did not give weight & size. It was not easy to find returns information on the website & not possible to get a return label forcing me to go to a Post Office which was not convienent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2017-08-26T20:38:27.000Z",
          "Titre": "Surprised by very small diameter when open.",
          "Contenu": "I was surprised by how small all three of the umbrellas are.  By this I'm referring to the diameter when they are open.  So I am not certain how useful they will be to me.  In retrospect, I should have paid more attention to the size information before I placed the order.  The other important test - how well they hold up over time - I will not be able to assess until I have had and used them for some time.  I hope they prove worth the cost."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "G. D. Baker",
          "Nb_Reviews": 2,
          "Date": "2016-08-17T00:47:35.099Z",
          "Titre": "For the price, packaging and product was a let down",
          "Contenu": "Ordered the set with the mini-umbrella as a gift  The large umbrella was in a box but the mini umbrella was wrapped separately  in bubble wrap. The items were not secured. There is a sturdiness to the product but once closed you have to stuff the umbrella material into the pouch. I and my recipient felt deprived of a pleasant shopping experience. I am not sure I would order a Davek product for myself."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Danette",
          "Nb_Reviews": 3,
          "Date": "2016-11-08T15:20:28.000Z",
          "Titre": "Time will tell.",
          "Contenu": "Received the 3 umbrellas I ordered. The mini @ $49 is where I am most sceptical. It is small and light. Stiff and difficult to open it. Does not appear or feel like \"more\". So I will need time and experience to \"sell\" me either way. The Solo and Traveler are as I expected. Sizes are perfect. Not as easy to put up as others I've owned but I'm sure that will become my standard soon enough."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Joe Auricchio",
          "Nb_Reviews": 1,
          "Date": "2017-02-08T18:23:35.000Z",
          "Titre": "One strut already bent after 3 days",
          "Contenu": "I've had my Davek Solo for 3 days and already one strut is bent. It still works but is a little slower to open/close and one side of the umbrella is not fully rounded. I haven't been mistreating it. Hopefully it will hold up and not get worse, otherwise I'm going to have to take advantage of that warranty very soon. I really hoped this Davek would be stronger than my previous umbrella which was one-twentieth the price..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Torpey",
          "Nb_Reviews": 3,
          "Date": "2016-07-25T15:47:20.000Z",
          "Titre": "Umbrella arrived in destroyed box. Shipping cost too high for this service.",
          "Contenu": "I just received the above order via UPS and wanted to share with you some photos of the mangled box in which it arrived.Fortunately, the umbrella appears to be in OK shape though the accompanying brochures and Packing slip were also a bit crunched. I attempted to send some photos to your support email, but they were rejected.Shipping costs of $9.95 seem somewhat high when a package arrives in this condition."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T05:21:25.000Z",
          "Titre": "Bad Gift Wrap",
          "Contenu": "I bought this item as a gift. I’m confident the umbrella would be superb and work as advertisedBUT the GIFT WRAP was very poorly done. Crooked folds, crinkled paper, and unsightly placement of tape. Simple doesn’t match the premium feel the brand portrays."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Betsy Triggs",
          "Nb_Reviews": 1,
          "Date": "2016-05-09T22:48:10.000Z",
          "Titre": "Expensive to return",
          "Contenu": "Bought the Traveller umbrella and am quite satisfied with the product, but not the color. The fuschia is not as it appeared to me on the website. I was told that to exchange it for another color, I would have to pay postage to return it plus postage to receive the new one. At $20 postage (plus initial postage), it's not worth it. Most other companies have free postage on exchanges."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald Brink",
          "Nb_Reviews": 1,
          "Date": "2016-06-23T16:22:16.000Z",
          "Titre": "No Free Shipping for a $99 Umbrella",
          "Contenu": "I don't get it, really. They offer free shipping on orders of $100 or more, and they price their signature umbrella at $99. It is just insulting to the customer. I don't know who runs their marketing, but he/she does not understand customers. It IS an outstanding umbrella. I just don't care for their little trickery about \"free\" shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DJM",
          "Nb_Reviews": 1,
          "Date": "2018-06-05T15:23:10.000Z",
          "Titre": "My husband bought a Davek umbrella for…",
          "Contenu": "My husband bought a Davek umbrella for me on Gilt.  It broke almost immediately.  The loss protection code only allowed for a discounted purchase of a replacement, not a full replacement, as it was required to register it since it was rom a 3rd party.  So, I ordered a new one thinking  was now protected....NOPE...new one was discounted, so no warranty....I probably would not have spent the money if I knew there was not warranty...especially after the first one broke with very normal use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kasim maklai",
          "Nb_Reviews": 1,
          "Date": "2017-03-10T18:13:34.000Z",
          "Titre": "Good Product, But Has A Few Flaws For The Price",
          "Contenu": "The umbrella is beautiful and well made, with the exception of where it hooks back into the fiberglass when you bring it down. It seams like it should probably have a ring around the hole, or something to make the appearance cleaner, as it does not look neat as you would expect. Also, when bringing it down, it moves a bit, making it difficult to secure in a fast situation. Great Product, I guess it's the little things when you spend that much on an umbrella!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2019-11-26T04:34:40.000Z",
          "Titre": "Davek Traveler - Sunflower Yellow",
          "Contenu": "1. Compact/Portable2. Good Coverage3. Very water resistant/wind resistant 4. Excellent Craftsmanship5. Exceptional Overall UmbrellaUnfortunately...after one use of this umbrella, one of the springs and the binding came undone during a 10 minute walk. I'm not sure how this happened from one use but I may have received a somewhat faulty umbrella. Not to worry, this umbrella is exceptional otherwise, plus Davek has a lifetime warranty on all of their umbrellas (I think) So I'm sure it will be no problem to exchange for a new one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sherry  B",
          "Nb_Reviews": 4,
          "Date": "2017-09-27T13:44:52.000Z",
          "Titre": "Good Quality but HEAVY",
          "Contenu": "The umbrella itself is good quality.  It is SO heavy!  The handle where the mechanism is is disproportionately heavy.  Hanging it from my belt loop pulls my pants down. The button is very hard to push. Wish I had sent it back, but Hurricane Irma was hitting my area and I had to evacuate as well as I needed an umbrella."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bruce kruenegel",
          "Nb_Reviews": 2,
          "Date": "2016-12-09T00:11:36.000Z",
          "Titre": "black friday weekend 20% off a bit too late",
          "Contenu": "The umbrella was to arrive on 11/30 after the Thanksgiving weekend, yet Davek did not menton the black friday sale until after the product was ordered.  I am sure the sale was anticipated and the retail stores of old would have told you of an upcoming promotion but everyone is on-line now and there is no need for that, I guess"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Benjamin Grass",
          "Nb_Reviews": 1,
          "Date": "2018-03-12T18:44:28.000Z",
          "Titre": "it would be best if your tracking info…",
          "Contenu": "it would be best if your tracking info for expedited orders came from Davek.You send via UPS which I get, however I do not know which shipper you use and was not aware to look for that info regarding my order, from someone else.I paid extra for shipping service but did not feel like extra service was provided."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Victoria Riley",
          "Nb_Reviews": 2,
          "Date": "2019-02-12T23:38:26.000Z",
          "Titre": "Purchased the Solo Black/Wasabi",
          "Contenu": "Purchased the Solo model.  Beautifully packaged and arrived quickly.  I was intrigued with the auto-open/close feature and the quality construction.  I was surprised at how heavy the umbrella was, especially considering the compact size.  There is also an odd \"clip\" on the handle which makes holding the umbrella a bit awkward.  Not sure what the clip is meant for.  The color combo (black/wasabi) is beautiful and I wish it was offered on other models. But due to the negative attributes (for my use), it was returned."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick Biddleman",
          "Nb_Reviews": 1,
          "Date": "2017-11-28T16:03:25.000Z",
          "Titre": "The Davek Mini did not open …",
          "Contenu": "The Davek Mini did not open automatically.  Reviewed product online at davekny.com. and umbrella did not specify manual operation.  Umbrella was difficult to keep in the open position.  Too much force was necessary to lock open.  It was difficult for my spouse too close.  Will be returning the product to Davek"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "KMigs",
          "Nb_Reviews": 1,
          "Date": "2020-02-21T18:37:03.000Z",
          "Titre": "Not impressive - Mini",
          "Contenu": "Purchased the mini. Not impressed. Hard to lock in place and the material is not what you expected. Cheap vinyl materials was used like the other inexpensive mini umbrellas you’ll find on amazon.  The high quality on it was the handle itself only. So i am giving it a 3 star."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "scott c springer",
          "Nb_Reviews": 2,
          "Date": "2016-05-23T14:52:40.000Z",
          "Titre": "We,all see I suppose",
          "Contenu": "Ordered this fine umbrella, still hoping at some point it may find its way . thanks for asking, may I suggest that if you offer free shipping to entice then strap the thing to a snails backside that asking for a review of the product can only be a review of my experience to date.  Haventbseen the thing yet, but hopeful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chad Thibodeau",
          "Nb_Reviews": 3,
          "Date": "2021-04-26T16:26:49.000Z",
          "Titre": "Was expecting I guess really impressive…",
          "Contenu": "Was expecting I guess really impressive and solidly built umbrellas by Davek but these appear to be just a notch above a nice $40 umbrella and not worth the $120 expense.  Duet doesn’t open all the way with the button push—quite disappointed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christine Rainwater",
          "Nb_Reviews": 2,
          "Date": "2016-10-14T22:36:01.000Z",
          "Titre": "Difficulte to operate",
          "Contenu": "I recently purchased the 1x THE DAVEK TRAVELER umbrella.  The opening mechanism works great but in closing the umbrella (it retracts easily enough) but getting it back to be fully collapsed is difficult.  I was trying this outside in dry weather - I would hate to do this with a wet umbrella as I will get soaked."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg In Atlanta",
          "Nb_Reviews": 1,
          "Date": "2016-12-15T19:09:52.000Z",
          "Titre": "Buying was easy",
          "Contenu": "Bought the classic and the traveler as gifts.  Quick and easy but would have been nice if I could create my own combination order as I would have opted for the XL and the traveler.  It saved a little money. The quality and presentation were good but the coverage is pretty poor on both of these models IMHO."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gold55",
          "Nb_Reviews": 5,
          "Date": "2016-07-26T15:23:07.000Z",
          "Titre": "High Quality Product",
          "Contenu": "The Davek Duo is a well made high quality umbrella. Most of the concerns of traditional umbrellas have been resolved. Still needing refinement  are below:It is a heavy productThe round handle is difficult to hold when windy.The wrist loop does not open enough to put your hand through."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey  Gray",
          "Nb_Reviews": 1,
          "Date": "2021-02-14T02:33:58.000Z",
          "Titre": "The umbrella is amazing",
          "Contenu": "The umbrella is amazing. The tracker failed to work even with trying two brand new batteries. The build quality of the tracker seems poor - the exact opposite of the umbrella quality which is great. Best to get a Tile tracker instead."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Bergstedt",
          "Nb_Reviews": 1,
          "Date": "2017-02-20T16:46:03.000Z",
          "Titre": "Good Marketing - Questionable Quality",
          "Contenu": "I received my Davek Solo.The supports are a bit non-uniform.The closing latch is cumbersome.The construction seems imprecise.  I might return it.I feel like I paid $65 for marketing, and $35 for the actual umbrella.Nice packaging, good quality marketing-Questionable quality."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2019-12-13T18:59:05.000Z",
          "Titre": "The umbrella is heavier then I would…",
          "Contenu": "The umbrella is heavier then I would like. Hard to carry. It is taller then I can use.If I could I would have returned it. But it seems your company is not consumer friendly. I am sorry I bought it. I would not recommend it to anyone. SorryPaul Portugal"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Harris",
          "Nb_Reviews": 1,
          "Date": "2018-01-29T00:10:12.000Z",
          "Titre": "I bought a duet and solo and the …",
          "Contenu": "I bought a duet and solo and the handles wiggle like a cheap umbrella. Also the plastic cap on the solo popped off and I had to glue it back on. And the duet does not opens all the way automatically. Otherwise they seem to be good umbrellas and perform very well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicki C",
          "Nb_Reviews": 1,
          "Date": "2017-12-07T18:34:33.000Z",
          "Titre": "Disappointing",
          "Contenu": "This review is for the mini umbrella. Be sure to check the specifications which indicate that it is a manual open close mechanism. The mechanism feels very cheap, and I have had other small umbrellas which open and close with ease in a superior fashion. The canopy size is also insufficient for good coverage. Now the umbrella needs to be returned, and the company will not be reimbursing for the shipping. I was considering replacing it with a travel umbrella, which is slightly larger and has the automatic open close mechanism, but the Exchange policy does not include reimbursement for shipping."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Carla Johnson",
          "Nb_Reviews": 9,
          "Date": "2019-04-15T11:27:51.000Z",
          "Titre": "Disappointed",
          "Contenu": "Thought the umbrella would be great, however after only two uses a spoke is bent. Still waiting for response to my email re refund or replacement. Expensive umbrella and even my cheap umbrellas have lasted years longer than that. Disappointed ☹️"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dick Tracy",
          "Nb_Reviews": 6,
          "Date": "2018-05-05T18:29:56.000Z",
          "Titre": "Imperfectly Expensive Umbrella",
          "Contenu": "Bought a combined umbrellas of Davek Solo and Duet.  Strangely the Solo’s trigger mechanisms is not as responsive as Duet.  You need to press harder for it to open or close the umbrella.  Kind of disappointing when you paid so much for an umbrella."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry Bogert",
          "Nb_Reviews": 1,
          "Date": "2019-05-25T20:56:53.000Z",
          "Titre": "Mixed feelings.",
          "Contenu": "Small umbrella (Travelers) works well. Large one (Solo) very difficult to open or close, requires two thumbs and a hammer grip.  Both look very nice and I presume shed rain well (used only the small one so far, for the reason mentioned)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TRR",
          "Nb_Reviews": 3,
          "Date": "2016-06-01T16:11:30.000Z",
          "Titre": "There is a drawback",
          "Contenu": "The umbrella is acceptable, but the carrying strap is not large enough to fit over a hand onto a wrist, so it has to be carried in your fingers or in some sort of bag when not in use. To me this is an unnecessary drawback in such an expensive umbrella."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary Poyssick",
          "Nb_Reviews": 1,
          "Date": "2017-08-29T15:07:03.000Z",
          "Titre": "It's OK",
          "Contenu": "It's OK. I bought if for my wife and she was not that impressed. It's stylish for sure, but closing it is somewhat difficult and it's not that much different than ones that are much cheaper. I like it but I would not order it again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Bioteau",
          "Nb_Reviews": 1,
          "Date": "2017-01-23T16:14:08.000Z",
          "Titre": "Umbrella Works Locator Doesn't",
          "Contenu": "I purchased the umbrella for it's design and strength and that is working out for me.  I upgraded to umbrella with a locator since I am forever leaving my umbrella under a desk or lunch table.  This has not worked since I purchased the item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JJ",
          "Nb_Reviews": 1,
          "Date": "2019-05-21T19:45:17.000Z",
          "Titre": "The umbrella is great",
          "Contenu": "The umbrella is great, the ordering process is smooth, but the order tracking and shipping tracking information is not available anywhere on the web site. I had to write an email to find out where my order was. That made me anxious."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Olivera",
          "Nb_Reviews": 1,
          "Date": "2019-12-04T19:24:23.000Z",
          "Titre": "Returned my purchase",
          "Contenu": "I purchased the solo and traveler in a combo deal.  The solo for myself and the traveler for my wife.  The main reason I purchased the traveler was to give my wife a good quality, light Umbrella she could carry in her tote bag.  Unfortunately, the umbrella was heavier than expected and the handle was a bit too uncomfortable.  The Solo was also a bit too heavy and uncomfortable.  The Solo opened automatically but would not close as described.  I needed  to return it for an exchange and the company would not pay for the return postage.  I returned them on my dime but felt that the company should at the lease pay for return postage when the umbrella does not function as described."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Davek Solo",
          "Nb_Reviews": 1,
          "Date": "2016-06-22T15:19:57.000Z",
          "Titre": "Davek Umbrella Purchase",
          "Contenu": "Product arrived promptly, but did not operate properly.  The umbrella opened, but one of the nine \"arms\" would not close.  I would have thought that (for $100 umbrella) quality control would be better - testing merchandise before fulfillment.After I called for a return/replacement - I was assured that I would receive the new umbrella Monday (it arrived Tuesday).  No discount or offering for my troubles to make a trip to a UPS store to manage the return process.  Would I recommend to a friend - unsure.  Am I satisfied -  (somewhat), but time will tell (as my concern now lies with the operational quality over time vs. price I paid)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "elaine platt",
          "Nb_Reviews": 1,
          "Date": "2018-09-06T02:16:31.000Z",
          "Titre": "you billed me three times for the same…",
          "Contenu": "you billed me three times for the same transaction, and now I have to go through the hassle of getting things straightened out.I wouldn't order online from you again--there's something terribly wrong with your system."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J. Ward",
          "Nb_Reviews": 1,
          "Date": "2018-08-01T15:17:34.000Z",
          "Titre": "The shipping is in need of attention",
          "Contenu": "Update 8/1/2018: I bought a second Davek dual umbrella and recently tested it in the DMV area with these continuous down pours and was very disappointed that it barely covered me compared to my much cheaper work umbrella. On the good side of the story, it held up during the slight winds on that day.The shipping is in need of attention. The package was delivered with evidence that someone cut through and examined its content. Thankful that the content was gift wrapped. Disappointed that Davek didn't offer engraving. Product seemed sturdy and of high quality.  Can't wait to gift it to my new son n law at their wedding this weekend. It will be tested around the world."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Margaret Kessler",
          "Nb_Reviews": 2,
          "Date": "2017-01-23T04:14:32.000Z",
          "Titre": "Okay. Not quite as expected.",
          "Contenu": "I was anticipating a really top notch umbrella but what I received was fine. The handle is a but hard to hold due to an ill placed holder. Overall, though, the fabrication and material seems quite good, so I'm optimistic."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2016-05-19T16:40:28.000Z",
          "Titre": "Average Umbrella",
          "Contenu": "Bought the Solo. Pretty well made, but not worth the price. My original lasted about a year and a half only, with normal use, mostly sitting in my work brief. The leather strap broke about 6 months in, one arm would not retract without manually moving it, then finally an arm split in half when opening, out of nowhere. So I sent back.Lifetime guarantee is pretty good. Any issues, send it back, in about a week, they send it a new one (they charge shipping, for both ways, ~$20 total). Be sure to register your umbrella ASAP. If not, and you throw away original box/tags, they will be stingy with loss protection guarantee, even if you have original purchase receipts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leon Charles",
          "Nb_Reviews": 2,
          "Date": "2017-01-13T22:12:30.000Z",
          "Titre": "Google Pixel does not work well with the Davek Alert",
          "Contenu": "Spoke to Davek and performed a few tests. It seems the umbrella connects and operates well on an iPhone but not my Google Pixel. I will also reach out to Google to see if there are some issues on the Bluetooth side.Thanks"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Rolf Erni",
          "Nb_Reviews": 1,
          "Date": "2020-11-14T20:41:39.000Z",
          "Titre": "My Davek Solo started coming apart…",
          "Contenu": "My Davek Solo started coming apart after six months of normal use. I am still waiting to hear back from Davek after I sent it in for repairs. The umbrella is overpriced and I do not recommend it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth Freeman",
          "Nb_Reviews": 1,
          "Date": "2018-07-20T15:29:34.000Z",
          "Titre": "Meh....",
          "Contenu": "Very well made umbrella but a tad small for the price.  I’m a small person and still get more wet than acceptable. I’ve owned $20 umbrellas with a slightly larger radius thus giving more coverage from the rain."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gregory Lewnes",
          "Nb_Reviews": 1,
          "Date": "2018-07-18T15:56:27.000Z",
          "Titre": "Umbrella seems well made",
          "Contenu": "Umbrella seems well made, but I found this model to be too small. To cover a grown man completely the umbrella must be carried close to ones face and centered on the nose. I should have purchased a larger one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jamea A.",
          "Nb_Reviews": 1,
          "Date": "2017-03-28T17:40:51.000Z",
          "Titre": "Mehhhh",
          "Contenu": "My expectations were super high for these expensive a$$ umbrellas. I bought a combo package that included the solo and elite. The three stars are only because the customer service is great, other than that these things are just plainly over priced. I do plan on sending these made in China overpriced umbrellas back to New York. It's an umbrella. The wording used to describe these things are simply fillers, don't be fooled. I was truly expecting better craftsmanship. The pommel and the button to open the umbrella are cheaply crafted...surely a couple of more dollars could yield better material. Slapping your name on something and self promoting yourself as the best...this should be disputed. Really."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2020-03-18T03:52:41.000Z",
          "Titre": "Extending great, retraction not so much",
          "Contenu": "It works very well when extending but retraction requires a lot of pressure to close the handle. The button is too hard for my wife to push. She's a bit disappointed as it was a gift to her."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan Schmidt",
          "Nb_Reviews": 3,
          "Date": "2019-05-13T16:34:12.000Z",
          "Titre": "So much heavier than my old mini…",
          "Contenu": "So much heavier than my old mini umbrella (not a Davek), but I suppose because it's built to last!Very impressed by your lifetime warranty, including %0% offer on a replacement even you lose it!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janeth Zata",
          "Nb_Reviews": 1,
          "Date": "2019-04-27T03:55:52.000Z",
          "Titre": "The advertisement on Facebook was that…",
          "Contenu": "The advertisement on Facebook was that the price was $89.00 for the  cost of one small Davek umbrella and there was a 15% discount for each order. I ordered 2 umbrellas because of the advertised 15% discount & the free shipping. There was a free shipping but there was NO 15% discount!!!!. I was disappointed!!.The total charge was still $89.00 each x 2 = $178.00 with no 15% discount. A very FALSE Advertisement. I advise everyone not to believed on any Facebook ad anymore. I don’t & I won’t anymore!!!!!!!!!!!With 15% discount the price for each umbrella, could have been only $75.65 each x 2 = $151.30. I should have been charged for $151.30 with 15% discount but NO, Davek still charged me with the full amount!!!!. It sucks!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chandran Palanisamy",
          "Nb_Reviews": 2,
          "Date": "2018-10-26T19:36:19.000Z",
          "Titre": "Not sure worth the price...",
          "Contenu": "I saw multiple creases and wrinkles at folds and expected a neat single predefined crease, especially at this price -this review won't let me attach a photo. The mechanism appeared sturdy though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sean McConnell",
          "Nb_Reviews": 2,
          "Date": "2018-07-21T13:10:32.000Z",
          "Titre": "not worth the price",
          "Contenu": "The umbrella is made well but I don’t think it is worth the price. I think windbrella is a better umbrella at half the cost the the Davek. I wouldn’t buy another or recommend that anyone else buy one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick Gillis",
          "Nb_Reviews": 1,
          "Date": "2016-08-29T15:23:11.000Z",
          "Titre": "I returned the Alert. I'm sure it's a very nice umbrella but I never opened it.",
          "Contenu": "I was disappointed. I ordered and received the Davek Alert. The concept behind the Alert is that you won't lose/forget your umbrella due to your use of the Davek App. What they neglect to say (until you dig through the Q & A on your app store. This should be but is not mentioned on davekny.com) is that YOU HAVE TO ACTIVATE THE APP EACH DAY THAT YOU INTEND TO USE the umbrella. Honestly, if I could remember to re-activate an app every time I needed its functionality I would probably not be forgetting my $125 umbrella to begin with.I was also disappointed that in returning the umbrella I have to reimburse Davek's 'free shipping' which means it's not really free. (That, at least, IS mentioned on their site.)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Public transit user",
          "Nb_Reviews": 2,
          "Date": "2016-09-05T16:19:35.000Z",
          "Titre": "Umbrellas are great; website needs work",
          "Contenu": "The print point for free shipping is just above the price of two mini umbrellas. And while I would have been happy to purchase one locally, the locations for the Chicago area weren't correct."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Jia Lei",
          "Nb_Reviews": 1,
          "Date": "2017-12-05T07:32:05.000Z",
          "Titre": "Expect it to be better for the price",
          "Contenu": "I got the Davek Mini in yellow color. It’s not as strong as I expected, difficult to open and you can see some loos threads which need to be cut off. Minor scratches on the shaft as well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Mahon",
          "Nb_Reviews": 2,
          "Date": "2021-09-02T18:19:26.000Z",
          "Titre": "I ordered a mini umbrella and travel…",
          "Contenu": "I ordered a mini umbrella and travel umbrella.The travel one stoped working after just several openings.I did not save the box or paperwork for return."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Liam Moyna",
          "Nb_Reviews": 17,
          "Date": "2019-10-19T11:47:55.000Z",
          "Titre": "good but needs a couple of little tweaks.....davek-mini",
          "Contenu": "Hi I got the miniWhen you shake it, it's dry, that is brilliant. It survived a relatively windy wet day very well, blew out a couple of times went back into shape well.kept me dry...now the bad points....Davek please take note.The closing wrap around fastening strap needs some extra protection where it's stitched to the umbrella, a little square patch either side will prevent this, can already see a little hole here...this will rip with time. Disappointing.Also when it blew out the stitching broke on a couple of the supports so again may make that a little more robust too. The handle could do with being about 6\" longerNo automatic function on this model.... and no belt clip.I do like it.... but it could be so much better!I'm an engineer so I'm fussy and if there's a flaw I'll find it!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Grim",
          "Nb_Reviews": 1,
          "Date": "2020-08-16T13:55:04.000Z",
          "Titre": "The wifi enabled umbrella arrived and…",
          "Contenu": "The wifi enabled umbrella arrived and is fine, except it is way too small. It came with no return label. I had to request instructions for returns from the company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Haley Lamey",
          "Nb_Reviews": 2,
          "Date": "2019-02-21T13:36:21.000Z",
          "Titre": "The opening mechanism is difficult - The Davek Mini",
          "Contenu": "The opening mechanism is difficult.  It does not open easily and it does not fold up nicely.  For the hefty price tag, I am a little disappointed.  Considering returning it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Franz Josef",
          "Nb_Reviews": 1,
          "Date": "2020-02-08T06:42:27.000Z",
          "Titre": "Heavy, durable, but not user friendly.",
          "Contenu": "I bought two umbrellas, the mini, and the traveler. The mini is a decent buy. I travel a lot and it fits in my backpack or a messenger bag. However, I am unsure whether it has fully opened since it clicks indicating it is locked and ready to use, but at times, it doesn’t. I don’t see anything in the reviews about it.The traveler is aesthetically nice. It looks like an expensive umbrella, which it is. That is where my positive ends. I was planning to give it to my mother since it gave me the impression that it would be easy for her to use with just the push of a button. It isn’t. First of all, it’s quite heavy. Secondly, the wrist strap gets in the way. Thirdly, I find it extremely (yes extremely) difficult to pull it back to lock it. I am a guy in my 40s and my mother is in her 70s. This won’t be a good buy if you have some hand or wrist issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous Davek Fan",
          "Nb_Reviews": 1,
          "Date": "2018-03-10T21:53:12.000Z",
          "Titre": "I appreciate Davek umbrellas",
          "Contenu": "I love Davek umbrellas, but I've had three of them break on me within a year of use and have had to have them replaced by Davek - which is also what make them so great."
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "ryan lee",
          "Nb_Reviews": 3,
          "Date": "2017-08-28T15:52:20.000Z",
          "Titre": "not worth it",
          "Contenu": "Brought one umbrella that easily broke. I ended up buying another through their lost/damage 50% off program... and they don't offer free shipping for $100+ umbrella..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leah Rummel",
          "Nb_Reviews": 1,
          "Date": "2018-05-11T21:35:22.000Z",
          "Titre": "Great umbrellas",
          "Contenu": "Great umbrellas,  But I ordered black and brown for our trip to Europe.  I received pink and brown.  Too late to send back before the trip.  Guess I am using the pink."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2019-11-01T16:49:47.000Z",
          "Titre": "The umbrella looks and feels great, but doesn't open all the way.",
          "Contenu": "The umbrella looks and feels great, but doesn't open completely by itself. I have to shake it to get it to pop all the up. For $150, it shouldn't happen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia Ragland",
          "Nb_Reviews": 2,
          "Date": "2021-01-18T20:16:08.000Z",
          "Titre": "Ineffective Alert",
          "Contenu": "This product isn’t very effective. Email alerts are not helpful when needing to know that my umbrella was left behind. A sound alert is more efficient."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TC",
          "Nb_Reviews": 1,
          "Date": "2017-01-10T17:13:05.000Z",
          "Titre": "Rough First Impression",
          "Contenu": "I ordered the Davek Solo and was excited to begin using my new luxury umbrella. Everything looked great when I unpacked it. The umbrella felt study and substantial. All of the materials were top quality. Unfortunately when I hit the release/open button the umbrella only deployed about 90% of the way. The umbrella did not open into a locked position, I had to manually open the umbrella the rest of the way. I was disappointed that such a well-regarded item didn’t work right out of the box.I contacted customer service and explained the problem to them. They apologized and offered to send out a new umbrella immediately. They also offered to send a shipping label to return the defective one. I have not received the replacement umbrella yet. I am hopeful that my first umbrella was an anomaly and the replacement will provide many years of service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lau",
          "Nb_Reviews": 2,
          "Date": "2018-05-24T19:48:43.000Z",
          "Titre": "Ordered the mini umbrella and…",
          "Contenu": "I just received the mini umbrella and haven’t had a chance to try it out. The quality looks good. It was a bit stiff to open. I’m hoping that’s because it’s new?.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sunnydas",
          "Nb_Reviews": 2,
          "Date": "2016-08-25T13:49:55.000Z",
          "Titre": "DaveK Traveler",
          "Contenu": "We were very happy with the umbrella's look and function; but, we thought it was overpriced for its size. We kinda wished we'd bought a larger diameter model."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janick Barger",
          "Nb_Reviews": 1,
          "Date": "2018-01-25T00:16:48.000Z",
          "Titre": "I like the size of the umbrella (the …",
          "Contenu": "I like the size of the umbrella (the mini) but I was disappointed because the mechanism is not as smooth and easy as expected from an umbrella of this price !!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "OO",
          "Nb_Reviews": 1,
          "Date": "2018-11-20T17:10:34.000Z",
          "Titre": "Seems overrated",
          "Contenu": "Seems overrated. Well built and sturdy but doesn’t justify the price. In this  price class, it should at least have a double canopy for wind resistance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Katz",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T01:58:05.000Z",
          "Titre": "expecting umbrella to be slightly…",
          "Contenu": "expecting umbrella to be slightly larger for the model ordered .  Airtag did not work initially when umbrella was in closed position.  working on retry . Slightly heavy, but the tradeoff if it indeed works on high winds, then it is worth it.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TZohn",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T03:55:39.000Z",
          "Titre": "Received umbrellas in a timely manner",
          "Contenu": "Received umbrellas in a timely manner. They are light weight as desired. Disappointed they don’t open with a push button."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay Tapp",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T16:10:35.000Z",
          "Titre": "My original umbrella actually broke",
          "Contenu": "My original umbrella actually broke, which was a bit disappointing. I did have a replacement number and was able to purchase another umbrella for 50% off - still a good deal of money. I'm hoping that it will actually demonstrate the quality that is part of the brand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GTKYL",
          "Nb_Reviews": 5,
          "Date": "2023-07-07T02:02:33.000Z",
          "Titre": "I ordered three umbrellas in three…",
          "Contenu": "I ordered three umbrellas in three sizes; the tiny one for traveling; the mini for my attaché case and the regular size (to be determined as to where to use it). The construction is fine and the button to open and collapse is nice. My only complaint, and it's a small one, is that they weigh more than I would like because the material is thicker than any other umbrella I've owned. You have to carefully fold the pleats to make it collapse down to where it fits in its sheath."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynne Schilling",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T20:15:21.000Z",
          "Titre": "Handsome umbrella",
          "Contenu": "I would have given this umbrella 5 stars if not for the fact it is difficult for me to do the final closing. I have arthritis in my hands and it is hard to muster the strength required to close it completely. I am hoping with use the umbrella will be easier to close."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leslie Young",
          "Nb_Reviews": 4,
          "Date": "2023-03-30T20:26:25.000Z",
          "Titre": "I love the size of your mini umbrella",
          "Contenu": "I love the size of your mini umbrella.  It fits in my purse perfectly.  I ordered 2 more for my friends - I wish you would provide a gift box for your mini umbrellas (as you do for the others) It's makes for a better presentation for a gift."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T13:58:07.000Z",
          "Titre": "Love the umbrella but there’s an…",
          "Contenu": "Love the umbrella but there’s an obvious flaw on the cane handle.  I don’t mind when a natural flaw looks natural.  But this one looks like a genuine chip in the wood.  Someone should have caught this. It’s such a great hand-assembled and high-end product.  Do details matter."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HN",
          "Nb_Reviews": 4,
          "Date": "2023-03-05T18:43:32.000Z",
          "Titre": "The best.",
          "Contenu": "Wonderful umbrellas; the Bluetooth accessory is not necessary. Would opt out of that. I have one of each of the umbrellas. Great balance, sturdy and compact."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janet Bourbon",
          "Nb_Reviews": 2,
          "Date": "2022-06-05T22:34:22.000Z",
          "Titre": "So far so good",
          "Contenu": "Haven’t had a chance to use it yet. But the color is great. It arrived promptly, within a few days. The mechanism is smooth,  and the umbrella appears to be sturdy and well-made. Plus, packaging was both effective and upscale. Now it just has to rain!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ellie",
          "Nb_Reviews": 2,
          "Date": "2022-07-11T19:49:42.000Z",
          "Titre": "The umbrella is exactly as shown",
          "Contenu": "The umbrella is exactly as shown, very small when folded, and perfect for traveling. I can even fit it inside my purse. A little pricey for an umbrella but I like it. Delivered quickly as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "THEODORE HURLEY",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T22:23:27.000Z",
          "Titre": "well i had 3 umbrellas sent to my home",
          "Contenu": "well i had 3 umbrellas sent to my home. all had the same problem. none of them opened all the way up folks on the phone were helpful  and always sent me a replacement. all had the same problem. i did keep the 3rd one sent to me even though it too had the same problem. i do wish i could get something for the time spent"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolyn Gallese",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T00:04:54.000Z",
          "Titre": "So helpful to offer a discount on a…",
          "Contenu": "So helpful to offer a discount on a replacement for a lost umbrella! Really appreciate that!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ernesto Ricacho",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T21:55:26.000Z",
          "Titre": "There was one item from the three…",
          "Contenu": "There was one item from the three original orders  that was not in the package of shipment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Parker Iller",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T17:55:04.000Z",
          "Titre": "Quality everything would recommend",
          "Contenu": "Quality everything would recommend, scuffs and scrapes on handle of 1 boxed umbrella."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Veronica Herrera",
          "Nb_Reviews": 2,
          "Date": "2022-03-31T19:29:27.000Z",
          "Titre": "I think it's great in size & color",
          "Contenu": "I think it's great in size & color. I bought for my son to use when he travel on bus it fits great in his backpack when he'll need it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mail order client",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T00:05:26.000Z",
          "Titre": "Where is the guarantee?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2022-01-06T18:04:46.000Z",
          "Titre": "Handsome piece of machinery.",
          "Contenu": "I have not had a chance to use the umbrella as it's January in Chicagoland do umbrellas are not a big issue now. I must admit the umbrella appears to be very well made and appealing to the eye. I like the open and closing mechanism I can see where the locator would come in handy as some would not have a second thought about picking this handsome piece up. Rather expensive so I hope it holds up to the Chicago wind."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sean Courtney IV",
          "Nb_Reviews": 5,
          "Date": "2021-08-07T17:36:11.000Z",
          "Titre": "Pocket sized rain protection",
          "Contenu": "For a small umbrella, the coverage is ample for door to door dashing through the rain. The closing of the umbrella is a little tight; a push button for it would have been a better device. Overall I’d give it a thumbs up. I had it in the back pocket of my khaki pants and didn’t even know it was there. Living in Florida an umbrella is a necessity."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nate Wynd",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T15:20:21.000Z",
          "Titre": "Perfect but for one thing",
          "Contenu": "I received an order confirmation, but not a shipping notification, so my purchase was almost stolen because I did not know when my purchase was going to be delivered.Other than that, the entire experience was great. It was easy for me to find the product I was looking for, with the customization I wanted. Of course the product itself is of excellent quality. It is durably constructed and stylish. A great combination for a necessity like an umbrella."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J. A. W. S.",
          "Nb_Reviews": 2,
          "Date": "2021-01-14T22:07:11.000Z",
          "Titre": "High quality",
          "Contenu": "The quality of your umbrellas is outstanding. Color options good and shipping was efficient. Only comment is the price- a bit high but the phrase \"you get what you pay for\" fits. I'd like to see more bundling options for next year's Christmas presents. I have now purchased 4, having left 2 somewhere (obviously someone else also realized the quality because they were not returned)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BEN HERNANDEZ",
          "Nb_Reviews": 1,
          "Date": "2020-12-10T20:33:32.000Z",
          "Titre": "I have not opened the box to see what…",
          "Contenu": "I have not opened the box to see what the umbrella looks or feels like because it is a Christmas gift but I assume it will be fine. I received the product in good time so that is good, but the \"Gift box\" I paid an extra $5 for was extremely disappointing! It was flimsy and ugly and probably only cost .75 cents to make and a $1 at most to purchase. Do not offer that option in the future - or charge us more for a higher quality gift box. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Sandilla",
          "Nb_Reviews": 4,
          "Date": "2020-01-20T00:48:50.000Z",
          "Titre": "Nice umbrella!",
          "Contenu": "I am happy overall. The umbrella is not wind-proof, as it was blown inside out once when I first used it. The good news is that it didn’t break, and I was able to pop it right back into shape. The tracking feature is nice. A transmitter in the handle sends an alarm to my phone app when my phone gets out of a certain range of the umbrella: this keeps me from losing it. I’m very happy, overall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Brady",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T01:42:15.000Z",
          "Titre": "Overall very pleased with the quality…",
          "Contenu": "Overall very pleased with the quality and style of the umbrella. My only concern is the runner being made of plastic. My previous umbrella, which I hoped would be of a high quality and last for many years, also had a plastic runner that broke at the latch making it unable to remain closed. My hope with the new product is that it will not suffer the same fate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank Gonzalez",
          "Nb_Reviews": 4,
          "Date": "2020-01-28T10:53:13.000Z",
          "Titre": "Not 100% what I expected, but I'm keeping it.",
          "Contenu": "I can tell by the construction of the umbrella that it is meticulously made. What I'm disappointed about is that I expected a \"traditional\" umbrella that would lock tight once opened. That loose feeling is not something that I'm used to, but I trust that it will work once the rain comes. Another thing, and I know that I'm nitpicking was the high shipping cost for a very light $50 item. Yet I'm keeping the umbrella, go figure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kris Paltridge",
          "Nb_Reviews": 3,
          "Date": "2019-12-02T17:25:51.000Z",
          "Titre": "Can I get 101% perfect?",
          "Contenu": "I'm going to be very picky, here! The auto-open/push button feature is great. And the push button close. But I have to pull the umbrella all the way down to its locking position before its push button will open again. I like the half size when fully locked&loaded but in&out of the rain, thru a door, into a car, back out again, sometimes you just need a 101% perfect umbrella lol. Delivery was fast. Thank you for a 99.99% perfect umbrella!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeremiah Lee",
          "Nb_Reviews": 4,
          "Date": "2019-07-17T18:59:52.000Z",
          "Titre": "7/8 chance of getting a good one.",
          "Contenu": "One in eight was bad and thus the 4 stars.I have several different devek umbrellas: 1 solo, 5 mini, a Seville and an elite.  All but the Elite are very well made and long lasting.I got a lemon Elite with a piece of aluminum insert came pitted and the metal tip felt off before the first use. The company send me a replacement and a label to return the defective one immediately - so the customer service is very good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth S",
          "Nb_Reviews": 1,
          "Date": "2019-06-08T14:57:38.000Z",
          "Titre": "The travel Davek umbrella is light and…",
          "Contenu": "The travel Davek umbrella is light and small, both desirable traits. However it doesn’t open or close easily.  It’s too soon to say whether it’s durable or weather a strong wind will destroy the spokes as is the case with cheaper umbrellas.   Obviously if it’s not durable it’s not worth the price— for five times as much as your standard mini drugstore umbrella."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle Rayner",
          "Nb_Reviews": 1,
          "Date": "2019-04-20T01:13:55.000Z",
          "Titre": "I guess the risk one takes when buying…",
          "Contenu": "I guess the risk one takes when buying a high-end, expensive umbrella online is that you don't get a sense of how it feels to hold it. My selection, it turns out, is rather heavy. And while it is, technically, a compact, it's much longer than traditional compacts when in the folded position. And I find the strap to be irksome and wish it was removable. That said, it was delivered in a beautiful box and it works well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mary russell",
          "Nb_Reviews": 1,
          "Date": "2019-06-10T18:31:12.000Z",
          "Titre": "I purchased the combo pack of travel…",
          "Contenu": "I purchased the combo pack of travel and mini umbrellas.  Each appear to be sturdily made, very well constructed.  I used the travel in a wind blowing New York City rain storm and it held up well. My only difficulty is closing the umbrella with ease as I am a fairly slight 80 year old.  The mini is small enough to fit into a dress bag."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LHG",
          "Nb_Reviews": 2,
          "Date": "2018-07-27T15:54:45.000Z",
          "Titre": "The Duet umbrella....",
          "Contenu": "The Duet umbrella seems very well made, although haven't had a chance to use it in a storm yet, and is the right size for anyone living in a city where wind is a major factor.  However, it is quite a bit heavier than any other umbrella I've owned.  But I'm sure that's why it is touted for its durability.....  strength of the frame vs. lighter weight."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joan Tomlinson",
          "Nb_Reviews": 1,
          "Date": "2018-08-17T00:15:50.000Z",
          "Titre": "I was very pleased with the efficiency…",
          "Contenu": "I was very pleased with the efficiency of their website and shipment.  However, I requested a RED mini umbrella (shown on the packing slip), but a BLACK umbrella was shipped to.  Since I am leaving for a European trip in a few days, there is not enough time to return it and receive a replacement.  I am very disappointed that the incorrect color was shipped."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Sroub",
          "Nb_Reviews": 3,
          "Date": "2018-11-07T18:03:48.000Z",
          "Titre": "Pocket-sized umbrella",
          "Contenu": "Pocket-sized umbrellaI bought the small umbrella, which I carry in a pocket in my briefcase. I have no complaints other than it doesn't look quite as good as the photos which were superb.  I'm now waiting to get caught in the rain.  I may consider buying the larger umbrellas for Christmas gifts this year, but they're a little pricey."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Lundy",
          "Nb_Reviews": 1,
          "Date": "2019-08-17T14:52:57.000Z",
          "Titre": "Love the beauty and craftsmanship (but it’s heavy)",
          "Contenu": "Love the beauty and craftsmanship. The dimensions are perfect—just the right length and diameter. The only issue is it is significantly heavy. I appreciate the old school craftsmanship of using a single piece of wood, but I believe a carbon fiber shaft inserted into the same wooden handle would make it much lighter."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Satisfied",
          "Nb_Reviews": 6,
          "Date": "2020-01-17T20:55:34.000Z",
          "Titre": "Solid construction",
          "Contenu": "Solid construction, have not tested in the windTwo minor issues:  Not easily contracted, hoping this eases with use but takes a firm two hands for my wife to foldSecondly, cover does not easily wrap around umbrella, too tight of a fit for ease of use.We purchased two of the small, portable umbrellas"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Smalley",
          "Nb_Reviews": 2,
          "Date": "2018-01-23T16:17:22.000Z",
          "Titre": "Love the Umbrella and the functionality …",
          "Contenu": "Love the Umbrella and the functionality of it.  I haven't had a chance to use it too much, but I can tell it'll give me years of great use.My only complaint would be that I do wish that the handle was a little larger than it is.  I know the whole idea is to make it as compact as possible, but I think that the handle (with the clip) can kind of make it a bit unwieldy/hard to grip tightly on a windy day.  Other than that it's amazing!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Luu",
          "Nb_Reviews": 1,
          "Date": "2020-02-28T17:42:25.000Z",
          "Titre": "Great and Strong Umbrella",
          "Contenu": "When I received the umbrella, it only opens 75% of the way. I believe its just a defect of mine but i do love the retraction button. Hopefully the lifetime warranty will fix this.  I do wish that the Alert notification on my phone actually provided some sort of “sound” when the connection is lost."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Saunders",
          "Nb_Reviews": 1,
          "Date": "2020-02-28T01:34:34.000Z",
          "Titre": "Great umbrella",
          "Contenu": "Great umbrella, but found I only got 25% rebate on replacing my lost umbrella.  I would have gotten 50% on a more expensive one.  Since the umbrella price was commensurate with the value, why the lower discount?By the time you added the shipping cost, I paid nearly full price for the replacement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Lambert",
          "Nb_Reviews": 1,
          "Date": "2017-09-21T03:11:04.000Z",
          "Titre": "Great product, but came damaged",
          "Contenu": "Great product, but it arrived damaged. Bought the traveler umbrella which has a strap attached to the handle and a small locking hook to secure it to a shoulder bag or purse strap.  The hook was broken, when the umbrella arrived, so I sent it back asking for a replacement.  I'm anticipating delivery of a new one in about two days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CK",
          "Nb_Reviews": 1,
          "Date": "2018-12-27T13:44:41.000Z",
          "Titre": "Great colors",
          "Contenu": "Great colors, mini umbrella was a pain and waste to purchase because it’s not retractable and barley covers you in the rain. It’s a nice conviene size for a small bag but good luck packing it back up without it being all bulky. I use the travel size instead and have no use for the mini. I wish I neve bought it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia Burkett",
          "Nb_Reviews": 3,
          "Date": "2018-10-29T15:57:13.000Z",
          "Titre": "Quality product but took off one star…",
          "Contenu": "Quality product but took off one star for customer service.  No live person on weekends when most of us are not working and can take care of personal issues.  I am returning the product because  my arthritic hands make it painful to operate.  Thought mini was also auto open and close (features not easy to see on smart phone).  Reordering next size to get auto feature and one as a gift for daughter.  Not sure how quickly my return will be processed but that will go into the rating for replacement order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory Ford",
          "Nb_Reviews": 2,
          "Date": "2017-11-15T01:06:41.000Z",
          "Titre": "Customer Service and Knowledge that goes Beyond What You'd Expect",
          "Contenu": "When the owner of this company heard that I was disappointed with the product I received, he contacted me.  Through an exchange emails he figured out what I had been displeased with.  He provided me with some education around what made for a truly effective umbrella AND he provided me with an umbrella that satisfied all of my concerns.  These people care about their product and about their customers!  And they back up their care and concern with effective service. i am very pleased."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Lent",
          "Nb_Reviews": 2,
          "Date": "2019-10-05T13:51:41.000Z",
          "Titre": "The Solo is almost perfect",
          "Contenu": "The Solo is almost perfect, but not quite. My one quibble is the strap at the knob. What is its purpose? It's not long enough to put around your wrist, which is the only reason I would use it. Just wrapping it around two fingers makes a hand incapable of doing much of anything else but hold it. The strap on your Traveler looks designed to put around the wrist, so I don't understand why you wouldn't use the same principle for the Solo,  Great product, though. I love the umbrella's quick-release feature and its sharp looks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jorge Aparicio",
          "Nb_Reviews": 1,
          "Date": "2019-10-12T22:16:23.000Z",
          "Titre": "Blunt umbrella versus Davek",
          "Contenu": "It was a very difficult choice to pick between a blunt umbrella versus a davek umbrella as the blunt umbrella can withstand winds greater than 50 mph wind. In addition, I do feel that the handle is very small compared to the blunt umbrella and consequently was holding the umbrella by the shaft. Both mini and travelers umbrella. I do love the sophisticated look. Perhaps I need to buy either the solo or duet davek umbrella to feel a different handle grip. I look forward to the new models, styles and sophisticated look that davek has to offer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay Kammerer",
          "Nb_Reviews": 3,
          "Date": "2018-09-22T13:59:42.000Z",
          "Titre": "Quick order fill",
          "Contenu": "Quick order fill, nice product, but is over-priced and does not come with a gift box.  When you order 6 of the same item, common sense should dictate that these are to be gifts.  Also, the mini model does not have a push-button to open or close the umbrella.  Order the traveler if you want that feature."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KO",
          "Nb_Reviews": 1,
          "Date": "2018-03-20T20:25:30.000Z",
          "Titre": "Quality Umbrellas - Worth the Price / Think Twice on the Mini",
          "Contenu": "I have a Davek umbrella that I have been using for the past 2 years and I feel that it's one of the best buys I've made. My friends are jealous when their cheap umbrellas crumple in the wind.This time I got a \"mini.\" It doesn't work as smoothly as my other Davek, and it is just a bit too small to actually protect anything other than the top of my head from rain.The guarantees Davek makes sound good, but who keeps an umbrella registration number hanging around where they can find it? LOL!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arthur Bahr",
          "Nb_Reviews": 1,
          "Date": "2018-10-08T18:55:48.000Z",
          "Titre": "Beautiful umbrellas, could be larger",
          "Contenu": "These umbrellas are gorgeous, and both the quality and service seem to be excellent. For the price, however, I would wish them to be just slightly larger: the deluxe cane-handled one doesn't keep one completely dry even when the rain is coming straight down. Beautiful accessories, though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharon Hartnett",
          "Nb_Reviews": 2,
          "Date": "2018-10-31T18:33:50.000Z",
          "Titre": "Sweet",
          "Contenu": "It is a tad small.  I haven’t had to use it yet but it will be my emergency umbrella.  I wanted something small that I could slip into my tote and this will do nicely.  It’s not too heavy either.  I got plum, beautiful rich color and looks well made.  I’m sure CT weather will be fine for it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David T",
          "Nb_Reviews": 4,
          "Date": "2018-11-05T14:38:21.000Z",
          "Titre": "Classic black mini",
          "Contenu": "Came in 2 days after I ordered. Good packaging. With my visual assessment, it appears to be made of durable good quality materials. I have not tested it yet on a rainy and windy condition. Nothing much fancy. I thought its automatic. Not ideal size for a big. Hopefully its worth the price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2020-09-11T14:23:53.000Z",
          "Titre": "So far I would say the umbrella is very…",
          "Contenu": "So far I would say the umbrella is very good. I have not used it in the rain yet so only time will tell how it performs. It opens well and seems sturdy. I don't use an umbrella that often but I want one that wil work when needed. I like that they are available in bright colors other than traditional black which makes them easier to find.Comments:1) Care must be taken in the manual stage of closing the umbrella. It is too easy to accidentally press the button to open it.2) This is minor and applies to all umbrellas. When closed they are never easey to roll tightly to slip on the cover."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2018-03-05T19:49:27.000Z",
          "Titre": "Great quality. Need to update on the UI a bit.",
          "Contenu": "Quality of the construction and materials are top notch.  They changed the carrying case sleeve for the umbrellas from a thick case with a leather trim to something a little more standard, but still high quality.  I've purchased two duets, five solos, and an elite over the past five years and all have been solid.  Tracking order is difficult - emails for shipment are available but finding a tracking number/link is not.  No option to exclude a receipt in the package (I was sending umbrellas as anniversary/retirement gifts)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stanley Jeter",
          "Nb_Reviews": 10,
          "Date": "2020-01-11T22:04:21.000Z",
          "Titre": "Remarkable Quality",
          "Contenu": "Where have you been , I mean I have complained that umbrellas today are made of very cheap quality. But When I walked into a shoe store here in Raleigh, NC I immediately spotted high quality. I asked the salesman what was the cost he said $149.00 , I immediately said I want it I challenge you to pursue other accessories other than bags, and wallets. You just found a permanent lifetime buyer, and I am going to refer your name  many times to prospective buyers. There is a saying seek and you shall find well another dream of mines came true. Much success as I know you will !!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mrs Linda Clark",
          "Nb_Reviews": 9,
          "Date": "2020-04-03T13:39:11.000Z",
          "Titre": "Great customer service",
          "Contenu": "OK, I  confess to having problems with the Traveler model; that's the reason for only 4 stars. BUT here's the rub: the customer service was terrific. No quibbling about my issues and a prompt response to my emailed complaint have made me a believer in the company.  I've always believed that nobody's perfect but how the \"imperfection\" is handled says far more to me about a company than the fact an imperfection occurred. And it is clear from other reviews that Davek umbrellas are topnotch. Once I get my replacement, I am sure I will be writing a 5 star review!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Megan",
          "Nb_Reviews": 2,
          "Date": "2018-10-02T16:32:44.000Z",
          "Titre": "I love all 3 umbrellas I ordered",
          "Contenu": "I love all 3 umbrellas I ordered. The only issue was that a spoke on the Traveler broke the first time I used it. I notified Customer Service and they responded immediately and said this was VERY unusual. They remedied the issue immediately and sent a brand new replacement unit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Bennier",
          "Nb_Reviews": 1,
          "Date": "2019-02-28T18:30:46.000Z",
          "Titre": "Priced for perfection, but not designed for it",
          "Contenu": "The DAVEK DUET is a quality umbrella to be sure, but probably not worth the price. The leather loop which connects the handstrap to the umbrella is designed in such a way that it will crease whenever the handstrap is being used properly; i.e. when the strap is in hand and the umbrella is suspended below. The only time it won't crease is when the handstrap is laying alongside the length of the umbrella, which is only good if you don't store it hanging. This creasing will shortly result in that leather looking very worn, even while the umbrella is relatively new."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RC",
          "Nb_Reviews": 2,
          "Date": "2020-02-21T07:26:34.000Z",
          "Titre": "I bought the smallest model as I wanted…",
          "Contenu": "I bought the smallest model as I wanted to keep it in my briefcase.  It has the manual opening feature and frankly is hard to open.  While the quality seems good it does not seem like it is that noticeably nicer than a $10:umbrella I can buy elsewhere."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Troy G",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T15:56:31.000Z",
          "Titre": "Product is the best",
          "Contenu": "Product is the best, but my 2 very expensive umbrellas shipped to me in a very flimsy box and one end had broken out and was open.  surprised that both umbrellas didn't fall out.  need more durable shipping packaging."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deborah Barth",
          "Nb_Reviews": 4,
          "Date": "2021-02-01T14:48:53.000Z",
          "Titre": "Would have given 5 stars, but for ...",
          "Contenu": "Love the style and the quality. I would have given 5 stars but the mini (I bought the combo pack) didn’t have a button for opening the umbrella. Have arthritis flare-ups and a button would obviously make this easier to open for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashley Coffey",
          "Nb_Reviews": 2,
          "Date": "2020-02-10T17:56:52.000Z",
          "Titre": "Beautiful and almost perfect",
          "Contenu": "Beautiful, and beautifully made. Opens easily and collapses when I push the button. I just wish it didn’t take so much strength to pull it back in. It’s a little hard for an old lady with tiny hands!😆 But I will never fear another rainstorm!"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Way",
          "Nb_Reviews": 1,
          "Date": "2019-02-14T12:34:18.000Z",
          "Titre": "Made in China",
          "Contenu": "Marketing seem to convey that the umbrellas are from New York, but they are actually made in China. Not so much an issue about where it is made, but I actually chose Davek over Knipps because I was of the impression that it was assembled where it was founded."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sabra Johnson",
          "Nb_Reviews": 2,
          "Date": "2018-01-06T17:27:40.000Z",
          "Titre": "I was gifted the mini Davek because $50 …",
          "Contenu": "I was gifted the mini Davek because $50 is way too much for me to spend on an umbrella, especially a tiny one. I took it on a month long backpacking trip to Western Europe and it was light to carry. It doesn't seem super sturdy but the website says it is. It didn't break during my trip when I used it or packed it, so time will tell. I had a really hard time finding it in person to avoid the hefty shipping fee. All of the retailers listed on the Davek website say they don't carry Davek and have never heard of the company. Their website desperately needs updating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jane Wolagiewicz",
          "Nb_Reviews": 1,
          "Date": "2020-07-18T12:33:16.000Z",
          "Titre": "You can really tell the quality with…",
          "Contenu": "You can really tell the quality with it's umbrella. I have not had the chance to use it yet. My only reason for giving it 4 stars and I have not put it's to the real world test and it's difficult to get it back into its sleeve."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dr. Liz H.",
          "Nb_Reviews": 3,
          "Date": "2018-11-21T03:44:14.000Z",
          "Titre": "love the umbrella",
          "Contenu": "love the umbrella, which is made of high quality steel and beautifully engineered.  My only issue is that it has a leather strap for carrying, and the strap won't let me open  the  umbrella left handed.    Otherwise it is perfect and well worth the money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "robert neitro",
          "Nb_Reviews": 2,
          "Date": "2022-01-07T16:19:44.000Z",
          "Titre": "Love the mini umbrella but was…",
          "Contenu": "Love the mini umbrella but was surprised that there weren't any instructions included on how to use it. Also, I was expecting something in writing concerning the lifetime warranty etc..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick Park",
          "Nb_Reviews": 1,
          "Date": "2017-12-09T21:20:08.000Z",
          "Titre": "Davek Savile",
          "Contenu": "Very nice umbrella and amazing craftsmanship. There were a  few things missing which Davek should have provided for an umbrella of this quality and price. The canopy was very wrinkled and it was not shipped in a protective box of any kind. It was only covered in plastic which was a let down. I was expecting a perfectly ironed canopy in a nice high quality box. It would be nice to have a protective box to store this inside if traveling or just for general protection. Davek should really look at how Swaine Adeney Brigg presents their umbrellas if they want to sell one of this quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff H",
          "Nb_Reviews": 2,
          "Date": "2018-03-11T21:52:08.000Z",
          "Titre": "Solid umbrella, but not 5x better than others.",
          "Contenu": "Solid umbrella.  Handle a bit awkward with a clip.  Other umbrellas have more ergonomic handles.  I bought one and will carry it.  If you have money to burn and you want a heavier feel to your umbrella, go for it.  Really not different then a good 25$ umbrella."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith Frisch",
          "Nb_Reviews": 3,
          "Date": "2021-02-20T01:06:04.000Z",
          "Titre": "Product meets expectations",
          "Contenu": "Product meets expectations. Delivery was faster than quoted. A bit pricey in my opinion, but would still rather pay than have a product that doesn't perform, especially in an umbrella.Would consider future purchases."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eunice Coorlas",
          "Nb_Reviews": 5,
          "Date": "2020-12-06T03:22:06.000Z",
          "Titre": "Amazing that one tiny umbrella can…",
          "Contenu": "Amazing that one tiny umbrella can accomplish all it does. Well made, easy to store in a briefcase or handbag, it is ready to use on a moments notice.I’m very pleased with my Davek umbrella and have purchased some for gifts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allen Setzer",
          "Nb_Reviews": 1,
          "Date": "2018-07-06T13:45:11.000Z",
          "Titre": "Davek Savile",
          "Contenu": "The umbrella (Davek Savile, Black) is simply made, which is a good thing. The mechanisms involve few moving parts and appear sturdy. Some of the metal bits clipped on to the wooden frame (such as the cap on the end of the umbrella) feel a little loose, but nevertheless strong. The heft is good. The canopy is of a strong, heavy canvas. The wood is comfortable to the hands. The only improvements I would suggest are extending the crook so that the umbrella might be hung over one's shoulder, and tightening up the metal a bit. Overall, a fine piece. The most valuable part by far is the unconditional lifetime warranty."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C. Kelly",
          "Nb_Reviews": 1,
          "Date": "2017-12-05T02:23:02.000Z",
          "Titre": "Excellent though expensive.",
          "Contenu": "Excellent umbrella though I think the price is a little too premium even for a luxury item. Has held up well so far in NYC storms but it'll need to hold up for at least a year before it becomes more worthwhile than my usual throwaway umbrellas."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melinda DeVries",
          "Nb_Reviews": 1,
          "Date": "2018-09-24T14:18:58.000Z",
          "Titre": "Is it worth it",
          "Contenu": "I like the umbrellas I ordered but I don’t think the price is worth the price tag. Maybe because of the lifetime warranty but the cost is almost as much as a designer umbrella. I got 2 mini umbrellas & the golf umbrella. Spent over $200."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dylan Sierk",
          "Nb_Reviews": 2,
          "Date": "2018-05-27T17:57:05.000Z",
          "Titre": "Build quality is fantastic",
          "Contenu": "Build quality is fantastic. The size of the solo is perfect for carrying around. My only complaint is the auto open doesn't open the umbrella all the way and needs a little help locking open. All in all I'm very happy with my purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keng Onn Wong",
          "Nb_Reviews": 2,
          "Date": "2019-02-24T22:32:30.000Z",
          "Titre": "Nice umbrella",
          "Contenu": "Nice umbrella - solid workmanship and so far no complaints. I think the fancy red box that the umbrella is packed in is unnecessary though - I'd rather the money for that goes into R&D and/or into lowering the overall price."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "V. T.",
          "Nb_Reviews": 3,
          "Date": "2018-10-07T11:11:15.000Z",
          "Titre": "Great Duet Umbrella",
          "Contenu": "The umbrella looks and feels great. Quality parts are evident above and under the canopy. The Duet does have one small design flaw; the team could have designed a better way to anchor the leather velcro name strap once the umbrella is open -- it just hangs there off of one end (hopefully it does not produce a weak point in high winds). They could have added another piece of velcro where the name strap could be attached properly on the umbrella canopy. It would look more professional and it would clearly advertise the umbrella and its company without someone having to contort themself into another dimension. Very pleased with the purchase regardless."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "HAMED DALLALI",
          "Nb_Reviews": 1,
          "Date": "2017-08-29T23:55:40.000Z",
          "Titre": "I go the Davek alert model to prevent …",
          "Contenu": "I got the Davek alert model to prevent loss. It's perfect! The only problem is that the alarm notification on your cell phone is activated by delay when you leave the umbrella.so if you leave it on a bus, you might realize too late!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "marty",
          "Nb_Reviews": 1,
          "Date": "2019-08-23T16:30:24.000Z",
          "Titre": "nice but not tops",
          "Contenu": "Frankly, I haven't needed to use it yet, so my four-star rating results from the heft and feel of the product along with it's sturdy well-built box...but stops short of five stars due to price, which seems excessive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JR",
          "Nb_Reviews": 2,
          "Date": "2018-09-04T01:23:04.000Z",
          "Titre": "I love both the umbrellas I have from…",
          "Contenu": "I love both the umbrellas I have from Davek,  however, the larger one's button works kinda hard....and they are really not that large. But you get a fabulously engineered piece of equipment.These are very nice umbrellas. -jr"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NYCSID",
          "Nb_Reviews": 3,
          "Date": "2017-11-03T00:25:48.000Z",
          "Titre": "Just got this umbrella",
          "Contenu": "I just got this umbrella so it's hard to rate it at the moment.  It's a beautifully made umbrella with a little style if you get one with a colored panel.  I hope it'll hold up to all the rain and wind we get here in NYC."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Virginia Snodgrass",
          "Nb_Reviews": 2,
          "Date": "2018-10-23T22:50:31.000Z",
          "Titre": "I haven’t opened my umbrella yet…",
          "Contenu": "I haven’t opened my umbrella yet because it hasn’t rained. It is very compact so I hope that it is big enough. The color is great. I gave one to my ex-spouse because it came with a lifetime warranty, unlike our marriage. :-D"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janis Roscoe",
          "Nb_Reviews": 2,
          "Date": "2019-12-05T20:59:09.000Z",
          "Titre": "I haven’t used my second to smallest…",
          "Contenu": "I haven’t used my second to smallest new purchase. I need a light weight travel umbrella and this is the highest rated. I would enjoy giving it 5 stars, but until I use it later this month, I can’t honestly do that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer PASQUINI",
          "Nb_Reviews": 6,
          "Date": "2017-12-09T04:26:03.000Z",
          "Titre": "I had been looking at these umbrellas …",
          "Contenu": "I had been looking at these umbrellas since I saw them on either 20/20 or 60 minutes a year of so ago. Really feel in love with the Saville. Classic, elegant, technologically amazing. Why I gave 4 stars was because after finally ordering the Saville. I order it on a Friday didn't hear or get an email as to when to expect my package. I called and received the tracking. My $350 umbrella was left outside the front door in plain sight. Then opening the UPS box, I was thinking that the umbrella would be incased a beautiful box and tissue. Rather surprised it was just wrapped in plastic. I was so excited to finally getting a Davek umbrella just a little lack luster."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bl",
          "Nb_Reviews": 3,
          "Date": "2017-08-24T16:30:55.000Z",
          "Titre": "These umbrellas are extremely well …",
          "Contenu": "These umbrellas are extremely well made, but the solo was just a little smaller than I wanted. I admit, I should have paid closer attention to the specs provided. I'll get another one but for now I'm returning the solo."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T15:20:03.000Z",
          "Titre": "Good",
          "Contenu": "As the name infers, pretty small coverage area, but mechanically sound. Ordered plum, true to online color. Pretty happy, need a larger companion umbrella w automatic opennow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth T.",
          "Nb_Reviews": 2,
          "Date": "2018-11-08T18:58:39.000Z",
          "Titre": "Overall a Good Buy",
          "Contenu": "Great quality and very convenient size and weight. It is a little bit smaller than I like, but it will work for travel and those \"surprise\" down pours.I have purchased another for a friend!"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Ezequiel Manrique",
          "Nb_Reviews": 1,
          "Date": "2017-11-06T15:28:15.000Z",
          "Titre": "Thanks!",
          "Contenu": "the experience in general was very good, unfortunately some quality details in the bag that I bought prevent me from better qualifying the experience ... in any way thank you very much and see you soon"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Non frequent umbrella user before purchase",
          "Nb_Reviews": 2,
          "Date": "2017-09-04T13:37:06.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I had trouble finding the color/model I wanted at retail stores.Used it a few times during strong wind conditions and it held up well. Hopefully it will stand the test of time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frances Zehmer",
          "Nb_Reviews": 2,
          "Date": "2019-07-28T15:35:11.000Z",
          "Titre": "Great mini umbrella",
          "Contenu": "Great mini umbrella.  Not so great order packing department.  Ordered two umbrellas, only received one.  Had to follow up in order for second one to be shipped (which arrived immediately):"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Carlos Silverio II",
          "Nb_Reviews": 1,
          "Date": "2018-10-04T22:09:17.000Z",
          "Titre": "Wishing for more color variants",
          "Contenu": "I own both Solo and Mini and it is still in good condition despite acquiring this way back 2007. I hope the company would offer more variety of colors to choose from. Especially for the Duet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy  Nakatani",
          "Nb_Reviews": 1,
          "Date": "2021-02-25T20:27:33.000Z",
          "Titre": "Very difficult to lock closed!",
          "Contenu": "I purchased the Traveler umbrella in the red color.  The umbrella came in a timely manner and was well packaged.  The umbrella was heavier than other ones that I own, so it might not be as welcome to put in your luggage with strict weight limits on airlines.  The color was nice, and the umbrella operated fine with the button; you push it once to open and then once again to close.  The only issue that I have is that it was soooooo difficult to pull/push the umbrella closed so that it would lock in a down position.  The first four or five times that I tried, I could not get the umbrella to lock down.  I thought that there was a defect in the locking mechanism, but I was finally able to get the umbrella to lock in the down position.  I don't know if I'll be happy trying to struggle with locking the umbrella when traveling!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GW",
          "Nb_Reviews": 1,
          "Date": "2018-02-25T01:09:45.000Z",
          "Titre": "Order was easy, better umbrella cover needed",
          "Contenu": "Process of ordering was easy. I would like a better umbrella cover. One that is water proof and covers the entirely of the umbrella, as opposed to the one end being open,.exposing the handle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Brown",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T22:50:01.000Z",
          "Titre": "Obviously a well constructed umbrella",
          "Contenu": "Obviously a well constructed umbrella. Not quite large enough to keep the rain completely out as I learned on my first rainy day, but still very nice. it seems to open a bit slowly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 4,
          "Date": "2021-12-03T09:09:22.000Z",
          "Titre": "Made very well",
          "Contenu": "Made very well, lifetime warranty is a plus. Wish the handle was a little bigger on the one I purchased. It would feel more secure in windy conditions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Grace",
          "Nb_Reviews": 1,
          "Date": "2018-01-26T22:06:23.000Z",
          "Titre": "Packaging impressive and the umbrella …",
          "Contenu": "Packaging impressive and the umbrella looks durable. It hasn’t rained since getting it but I don’t see any problem with it and if there’s any the warranty is lifetime.... I like that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Lentz",
          "Nb_Reviews": 2,
          "Date": "2017-12-16T17:36:55.000Z",
          "Titre": "Make the handle lighter and it's a perfect travel umbrella.",
          "Contenu": "I bought the davek mini travel umbrella. I was a little disappointed to see how heavy the handle was because it could be a much lighter travel umbrella without the heavy metal handle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Loo",
          "Nb_Reviews": 2,
          "Date": "2021-03-22T15:00:44.000Z",
          "Titre": "1 star review. Horrible customer experience",
          "Contenu": "1 star review. Horrible customer experience. I received one as a Christmas present and wanted to make an exchange for a different color. I had to pay to ship it back (they don't offer any return label and I had to pay to ship it back). After not having heard or received anything from them I called them. The lady on the other line took care of it promptly and sent me my replacement which I received a couple days later -- it is defective and doesn't open all the way. Shortly thereafter, I get an email saying that before they can ship my replacement (not realizing they had already sent it to me) I would need to pay more money. I emailed them telling them I've already received it and the poor experience I received. They responded back apologizing and word-for-word wrote \"Since you have already received your new unit the shipping fee has been waived.\""
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Len",
          "Nb_Reviews": 3,
          "Date": "2019-07-19T19:52:02.000Z",
          "Titre": "To be honest hasn't rained since I…",
          "Contenu": "To be honest hasn't rained since I bought it. Did open up the umbrella to check how it is made and I was not disappointed. Check back when it rains in the Boston area"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carlos C",
          "Nb_Reviews": 3,
          "Date": "2019-07-10T19:56:11.000Z",
          "Titre": "Have not used it all that much, but",
          "Contenu": "Have not used it all that much, as the rain slowed down after I got it. But I am pleased with their quality and construction. I hope to enjoy it for a long time coming."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FRANCESCA",
          "Nb_Reviews": 35,
          "Date": "2021-04-29T17:25:38.000Z",
          "Titre": "Great quality but very heavy!",
          "Contenu": "I received the umbrella and bonus travel umbrella. Haven’t used them yet as it hasn’t rained! The larger one seems VERY heavy. Not sure I will keep it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alfonso Uribe",
          "Nb_Reviews": 1,
          "Date": "2020-03-15T20:51:20.000Z",
          "Titre": "The operation is not as smooth as I was…",
          "Contenu": "The operation is not as smooth as I was expecting, as you push up you feel the different stages of the opening process. I also thought it had automatic opening."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Ponder",
          "Nb_Reviews": 2,
          "Date": "2019-05-31T16:02:58.000Z",
          "Titre": "Umbrella is great",
          "Contenu": "Umbrella is great.  Would give 5 stars if it was better value for money.  EXPENSIVE!  You can probably get an equally good umbrella for far less money.  Overpriced."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B Kalish",
          "Nb_Reviews": 1,
          "Date": "2017-10-18T17:36:28.000Z",
          "Titre": "Good product. Very expensive.",
          "Contenu": "Had a little trouble at first with obtaining the product I wanted but in the end, customer service was helpful. Nice product. Very expensive. I hope I do not lose it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn B",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:03:58.000Z",
          "Titre": "I purchased the Davek Solo and used it…Exceeded My Expectations",
          "Contenu": "I purchased the Davek Solo and used it this morning during 50 mph wind gusts to see if it would live up to its claims.  I walked two blocks to my office and no one else dared to put up their umbrella.  I made it to my destination and the umbrella stood up to its claims.  It did not turn inside out!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Zbear",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T05:47:31.000Z",
          "Titre": "The umbrellas are really what I…",
          "Contenu": "The umbrellas are really what I expected. I bought one Davek commuter and one Davek mini umbrella. They are really sturdy and lightweight. Fits my tote bag perfectly! I just don’t know if they have UV protection features. Would be great if they have. Does anybody know if they do have anti-UV features? Thank you very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rallen",
          "Nb_Reviews": 5,
          "Date": "2023-12-04T18:30:53.000Z",
          "Titre": "A quality gift",
          "Contenu": "I wanted to gift my daughter a quality umbrella. I’ve purchased Davek umbrella in the past.  So, i did not have any hesitation with this product.  Ordering thru the website is so easy. I’m sure she’ll enjoy for many seasons."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Alanis",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T18:32:44.000Z",
          "Titre": "Quality Products",
          "Contenu": "The umbrellas are individually packed in a very classy and great quality box/package. The umbrella is also of great quality with regards to material and craftsmanship. These will make great Christmas gifts for my adult children."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Lopez",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T01:06:33.000Z",
          "Titre": "Impressive and substantial umbrella no rain tested yet.",
          "Contenu": "I received the umbrella the day after a day of rain. I have not had rain and have not used it yet. It is a substantial umbrella and the weight was surprising. I don’t know the intended purpose of a clip on the handle. It won’t attach to a belt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Warren M",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T23:08:29.000Z",
          "Titre": "The Umbrella's are the best I have ever…",
          "Contenu": "The Umbrella's are the best I have ever owned. Extremely durable and well built and stylish. Delivery is quick and communication throughout the process was outstanding,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Slattery",
          "Nb_Reviews": 16,
          "Date": "2023-11-02T23:55:07.000Z",
          "Titre": "Love the mini",
          "Contenu": "Love the mini, it is so easy to carry and use during drizzly long walks, very lightweight and not a burden. I also got the Solo. The button is a little hard to operate, especially when my fingers are cold, but it provides good coverage, and I like that the website points out that if it inverts, you can press that button and it will pop back into shape!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "--",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T16:04:48.000Z",
          "Titre": "Best umbrella ever!!!!",
          "Contenu": "This is my second Davek umbrella (I wanted to try a bigger one). I love them so much! They last literally forever and never break."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ginge Brien",
          "Nb_Reviews": 10,
          "Date": "2023-11-06T12:57:20.000Z",
          "Titre": "Best umbrella on the market.",
          "Contenu": "Davekny.com is easy to order and if you call the store,  the ladies that answer are always kind & helpful. I recently purchased a “DUET”. I also have a solo. They truly are the best umbrellas. Highly recommend. Considering the inflation they are not expensive when you realize they will last forever if used for the intended use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Zajac",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:23:06.000Z",
          "Titre": "The umbrella is high quality which is…",
          "Contenu": "The umbrella is high quality which is what I was looking for. Also like the lifetime warranty."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "glenn",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T16:13:54.000Z",
          "Titre": "You probably won't need to use the Warranty, but if you do...",
          "Contenu": "First off - these umbrellas are built like tanks - to last and perform!  How it broke on my is a question I'm not sure of, but things happen.  The warranty coverage was the BEST experience I have ever had with a consumer brand. (even better than APPLE!).  A quick replacement, easy to work with and I'm back to staying dry in the rain again!  Superb, well done Davek!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anais Paulino",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:54:58.000Z",
          "Titre": "Dream job gift",
          "Contenu": "Gave this to my brother as a gift for getting his dream job. He absolutely loved it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Teleky",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:51:24.000Z",
          "Titre": "Quality and craftsmanship of these…",
          "Contenu": "Quality and craftsmanship of these luxury umbrellas are unmatched. Thank You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angeles C",
          "Nb_Reviews": 3,
          "Date": "2023-10-05T17:12:35.000Z",
          "Titre": "I decided to purchase another umbrella…",
          "Contenu": "I decided to purchase another umbrella when my very old Davek umbrella started showing its age. I would notbuy any other brand because my old umbrella worked so well for so many years. I keep it in the car along with the tiny Davek that I also purchased this time for surprise showers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "anb",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T23:25:20.000Z",
          "Titre": "Great little umbrella",
          "Contenu": "Great little umbrella. I bought this for a trip to Italy when rain was in the forecast almost every day. It worked very well. It was sturdy in the bad weather and then folded up nicely for when it wasn’t needed. I carried it in my interior jacket pocket and barely felt it. The umbrella also shipped very quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Warren Hart",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T21:16:31.000Z",
          "Titre": "Davek Umbrellas has awesome customer service!",
          "Contenu": "I was blown away by Davek Umbrellas' customer service. I emailed about a minor issue with my new umbrella. They responded in a couple of minutes asking a thoughtful question to help clarify the issue. They immediately provided a great solution. It's rare to see companies today who truly understand how to deliver customer service and Davek sets a great standard here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Figueira",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:04:37.000Z",
          "Titre": "Product quality is great",
          "Contenu": "Product quality is great, the ordering process was easy. I bought several for gifts. FYI, the commuter fits well in my car door pocket. Solo is the flagship and worth it, we use to block sun as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T04:51:38.000Z",
          "Titre": "I like the umbrella",
          "Contenu": "I like the umbrella. It looks like it'll be perfect for me. What I didnt like was the FedEx driver leaving my package outside of my apartment building. I live downtown. I'm not going to order from anywhere that uses FedEx anymore."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IndyJohn",
          "Nb_Reviews": 4,
          "Date": "2023-10-08T18:21:30.000Z",
          "Titre": "Great quality and customer service",
          "Contenu": "Great quality and customer service.  I forgot my 10% discount, sent them an email and they responded right away that they will refund 10% on my order as soon as it was processed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Enedina",
          "Nb_Reviews": 5,
          "Date": "2023-11-06T20:01:36.000Z",
          "Titre": "Great product,",
          "Contenu": "I have 3 umbrellas already and decided to buy on for my aunt. Their product is well made. Mine lasted a very long time, over 10 years and when a brace broke it was replaced immediately. So, THANK YOU!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ginge Brien",
          "Nb_Reviews": 10,
          "Date": "2023-08-03T18:48:30.000Z",
          "Titre": "Awesome product & service",
          "Contenu": "Thank you Davek. After approximately 10 years , I had my umbrella pinched while I was shopping. An absolute heart break. Thank G-d for the warranty. I received my new Solo Davek as promised quickly. Davek truly are quality umbrellas. I plan to come back snd get the Duet. 😁"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia Johnston",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T21:03:33.000Z",
          "Titre": "Sure beat my Tilley hat.",
          "Contenu": "I took this tiny umbrella on a 14 day visit to the rainforests and beaches of Costa Rica. Because of the small size I was able to carry it in the back pocket of my shorts or in my sling bag. Although I used it three times for rain, it was most valuable as a parasol against the blazing sun. This tiny umbrella has joined the list of \"vital\" items on my packing list."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Albert",
          "Nb_Reviews": 8,
          "Date": "2023-11-07T18:17:34.000Z",
          "Titre": "Excellent Experience",
          "Contenu": "Umbrellas are great and the ordering and shipping went well. I can't think of anything they could do better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Davek Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T20:12:16.000Z",
          "Titre": "Third time is a charm...",
          "Contenu": "So far so good.  It is as attractive, compact and useful as advertised.  My problem is that I keep losing them, but I like them enough to keep replacing them.  I'm on my third now.  The first didn't make it back from The Bahamas.  I'm hoping someone down there is enjoying it. And then I went to a historical lecture locally with a bunch of well-heeled attendees during a rain storm.  We all dutifully left our wet umbrellas outside.  Sure enough someone one took mine...like they had a Davek too!  They left me with some no-name, black and manual (like mine) one that literally broke the next day as the rain continued.  I'll be sure to be on the lookout at the next rainy event.  Well, I must say from experience that I don't have to wait long for them to be delivered.  I also like those nice bags that they come in.  I have three."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie P",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T03:56:44.000Z",
          "Titre": "Lightweight",
          "Contenu": "Lightweight. Perfect fit for my bag. Quick to open and close as rain came and went and as I wandered in and out of different structures. Especially loved the stand-out pink color. Appreciate the details - leather strap, wooden handle. Easily convinces me to start an umbrella collection!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wing",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T00:54:08.000Z",
          "Titre": "Superior build quality compared to other umbrellas.",
          "Contenu": "Davek New York umbrellas packaged the product very well. it came in a nice umbrella box. Build quality and materials used. Built-in tracking device & easy to follow instructions, absolutely awesome!!! They in the umbrella business hands down. Expensive! \"You get what you paid for\"."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard Hall",
          "Nb_Reviews": 9,
          "Date": "2023-08-16T14:26:43.000Z",
          "Titre": "Fantastic customer service",
          "Contenu": "This company is exceptional. My trusty Davek (the Duet) developed a wonky spoke after several years of excellent service against the British weather. I followed the instructions on the website and within days a brand new one arrived; all I had to pay was postage. I didn't think such fantastic customer service still existed but Davek proved me wrong."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Jones",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T15:59:44.000Z",
          "Titre": "The Return Process Was Very Easy",
          "Contenu": "Ordered an umbrella for my wife, but alas, she didn't like it because it was too small.  Anyways, the return process was really easy and I have already received my credit.I was pretty impressed with the quality of the product, though, so I will probably order another one later."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond Kalendek",
          "Nb_Reviews": 7,
          "Date": "2023-07-04T11:57:32.000Z",
          "Titre": "A Fine Umbrella",
          "Contenu": "Davek umbrellas are well-made and dependable and won’t self-destruct in the first tempest. While I’m a proud owner of a James Smith & Sons, and plan to add soon both Brigg and Michel Heurtault umbrellas to my rotation, when the sky threatens rain, I’m most apt to grab my Davek Duet: without doubt an umbrella of extraordinary utility."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl Hayes",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T01:40:56.000Z",
          "Titre": "Picture Perfect",
          "Contenu": "So easy to place an order without difficulty.   Orders arrive promptly, well packaged and damage free.  I contacted customer service before placing my order as I really wanted the yellow umbrella.   I was reassured of its beauty.  My Solo and I make a great team.. surviving 1.65 miles together in the rain and wind. Best rainy day ever!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Burke",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T21:29:25.000Z",
          "Titre": "5 stars",
          "Contenu": "Great and fast shipping for being delivered across the country. Unfortunately, I missed the rain in CA by a day so haven’t had a real world test. But the quality is exceptional and I’d really feel I bought the first and last 2 umbrellas I’d ever need in life. Purchased the Duet and DAVEK Elite ⭐️⭐️⭐️⭐️⭐️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Byers",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T23:24:45.000Z",
          "Titre": "Umbrella is amazing",
          "Contenu": "Umbrella is amazing, but had a flaw that should have been caught. That said, a replacement was immediately sent with a return shipping label, so all is well. Umbrella is a tad on the heavy side for it's size, I'll stick to keeping it in the car and carry my Blunt umbrella for international travel."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yang",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T01:46:18.000Z",
          "Titre": "The only umbrella i buy",
          "Contenu": "My first davek umbrella is almost 10 year old. It experienced London and NYC wind and rain storms but still in good condition. I love it. Just purchased same umbrella in a different color. Easy to carry, and looks elegant"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theresa Nastasi",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T22:30:18.000Z",
          "Titre": "Great quality umbrellas",
          "Contenu": "Great quality umbrellas, good customer service, prompt delivery time. I have bought several umbrellas from davek and know im getting an umbrella that will last the test of time. Will continue ordering from this company. Like the lifetime guarantee too ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen",
          "Nb_Reviews": 5,
          "Date": "2023-07-03T18:32:41.000Z",
          "Titre": "Unbreakable Umbrella",
          "Contenu": "I bought one of these umbrellas for my husband last year and he loves it. My old umbrella broke so David suggested a Davek umbrella because they are the best and the company will replace it if I lose it or if it breaks. But that’s doubtful! These umbrellas are so strong. They don’t fold-up in high wind like other umbrellas. I love the lavender stripe in mine. David has the pretty blue. The price is worth it. Thank you DAVEK!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin Bertincourt",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T19:23:13.000Z",
          "Titre": "We have been using our Davek umbrellas…",
          "Contenu": "We have been using our Davek umbrellas for several months now and love how robust and well finished they are. They so far resisted without flipping every bit of New York weather subjected them to"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dusty",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T14:47:53.000Z",
          "Titre": "I purchased a Davek umbrella for…",
          "Contenu": "I purchased a Davek umbrella for durability, styling, and lifetime warranty. Recently, I had to have my umbrella repaired/replaced and the process could not have been simpler. Their Customer Service was prompt and courteous in response to my issue and a replacement was sent to my home within twenty-four hours of my claim. Thank you, Davek"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Manzo",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T22:54:12.000Z",
          "Titre": "Great quality and I love my two Golf…",
          "Contenu": "Great quality and I love my two Golf umbrellas!Watching for a great deal on the standard, more compact personal ones next and possibly the loss prevention gizmos too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JASON T of San Francisco",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T01:38:23.000Z",
          "Titre": "Davek’s umbrellas quickly appeared in…",
          "Contenu": "Davek’s umbrellas quickly appeared in my search results for high quality, rugged, long lasting umbrellas. I will take care of my new umbrella and expect that it’s built quality will provide me the protection I need for years to come. Oh, and with style."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danah Woodruff",
          "Nb_Reviews": 7,
          "Date": "2023-03-31T05:53:09.000Z",
          "Titre": "Real classy!",
          "Contenu": "Love the coverage on the solo and the compactness of the travel umbrella. Love how the solo pops open with the press of a button. Ordering these new special umbrellas is all it took to get the sun to come out (haha :-)  I did get to use some borrowed ones on a very rainy trip last June.  Went for long walks in the rainy forest and really enjoyed these classy umbrellas!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sally",
          "Nb_Reviews": 8,
          "Date": "2023-01-25T23:16:13.000Z",
          "Titre": "Brilliant Company",
          "Contenu": "I purchased a Davek umbrella over 5 years ago. I was initially sceptical about the lifetime guarantee. The tiny mini umbrella I purchased has proved to be such good value for money. Last week we had very strong winds - so strong that the shaft of the umbrella hit me in the face whilst I felt like I myself was being blown away, before the umbrella flipped inside out and finally broke. I remembered about the lifetime guarantee and contacted Davek. I sent them a picture of the broken umbrella, they asked me to pay a shipping fee and sent me a new umbrella. The service was excellent and this company really keeps its promise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SCOTT EDWARDS",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T23:26:41.000Z",
          "Titre": "The Terminator of umbrellas",
          "Contenu": "The Terminator of umbrellas, Davek's are bad to the bone. Reliable, sturdy, stylish, and solid. Makes we want more rain. And if a terminator needed an umbrella, I got money says they'd roll Davek.  Don't mess."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Christoph Weber",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T07:25:02.000Z",
          "Titre": "The order was quick and straightforward.",
          "Contenu": "The umbrellas arrived at the other coast within a few days. Not only did we get the mini umbrellas, but also two stuff bags to keep them more protected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Lithgow",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T03:03:56.000Z",
          "Titre": "Fast turnaround",
          "Contenu": "Fast turnaround. I’m rarely without my Davek mini so I was happy that after having sent it in over a long holiday weekend I received a replacement my first day back in the office."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Florbena Pantaleon",
          "Nb_Reviews": 3,
          "Date": "2023-07-04T00:06:46.000Z",
          "Titre": "They sell products that they vouch for…",
          "Contenu": "They sell products that they vouch for no more no less. When they say, it's sturdy, durable, dependable and classy you better believe it. It should be a part of an executive outfit just saying."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cole S",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T18:50:21.000Z",
          "Titre": "Great quality product",
          "Contenu": "Great quality product, performs as exactly as expected against rain, wind, and mobility. Very fast shipping too :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan Moore",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T15:57:43.000Z",
          "Titre": "My Davek was stolen : (",
          "Contenu": "My original Davek umbrella was stolen, so I used the one-time replacement program offered by Davek. Fortunately I still had the replacement code.  The ordering process was simple.  Using the code was also a straightforward process.  I got the new umbrella within a few days and it was wrapped in a very sturdy box.  I have always loved my Davek umbrella and the replacement program made it simple to continue to tradition."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Julie Manoel",
          "Nb_Reviews": 2,
          "Date": "2022-12-22T05:30:15.000Z",
          "Titre": "I ordered yellow mini umbrella for…",
          "Contenu": "I ordered yellow mini umbrella for gift.The person I purchased it for wanted a yellow umbrella.Unfortunately the umbrella was more of an orange colour. However the umbrella was very light & made beautifully.I contacted Davek & they provided full refund no questions asked.Excellent customer service.Refund provided promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geraldine Martinez-Magarelli",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T03:06:32.000Z",
          "Titre": "We love Davek umbrellas",
          "Contenu": "We love Davek umbrellas. We were at a rainy music festival weekend with friends and they were so impressed with our Daveks that we decided to gift them for their birthdays."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blaine Goldstein",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T20:25:21.000Z",
          "Titre": "By far the highest quality umbrella…",
          "Contenu": "By far the highest quality umbrella I’ve ever owned.  We have 4 of them some that are 15 years old.  They stand behind their warranty.  The Golf umbrella is sensational!  Keep doing what you’re doing!  Really a fan !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ina Vaughan",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T01:44:42.000Z",
          "Titre": "What makes my experience so great customer service, you actually get to a live person without being on hold !",
          "Contenu": "What makes my experience so great, the umbrella broke no hassles at all, sent the picture received a new umbrella. Customer service excellent!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Umbrella",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T19:19:35.000Z",
          "Titre": "Very nice umbrella",
          "Contenu": "Very nice umbrella. I purchased it for the rainy doggie walks. Haven’t put it to the test yet . It’s bit heavier then other ones but the quality is very impressive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Nilsson",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T16:29:23.000Z",
          "Titre": "Quality as Committed",
          "Contenu": "When I ordered the umbrella, I received a prompt acknowledgement of my order, and follow-up emails to advise of product shipment and delivery. The umbrella arrived as committed. It was a present for my wife, who was completely impressed by its quality and ease of use. Thank You"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Rajdhani Express",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T10:46:56.000Z",
          "Titre": "This is my 2nd purchase from Davek",
          "Contenu": "This is my 2nd purchase from Davek. Upon buying the first one, they gave me a discount on my 2nd purchase. Super happy with their product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WR",
          "Nb_Reviews": 3,
          "Date": "2023-04-08T02:42:34.000Z",
          "Titre": "Received umbrella and in record time",
          "Contenu": "Received umbrella and in record time.  Umbrella appears very well made.  I have not had a chance to try it out as we are awaiting more rain.  However, this Davek umbrella replaces an umbrella that blew inside out during a windy rain a short time ago!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Federico Gil",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T22:33:33.000Z",
          "Titre": "When I placed my order",
          "Contenu": "When I placed my order, I ordered the wrong color. I quickly contacted your support help and was able to change my order to the right color' before my order was shipped.   My wife and I are very pleased with our umbrellas."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rallen",
          "Nb_Reviews": 5,
          "Date": "2023-04-02T05:59:08.000Z",
          "Titre": "First time customer",
          "Contenu": "First time customer.  My rating/review is for the initial ordering and delivery.   It has stopped raining so I have not used the umbrellas.In need of an umbrella, my search yielded DavekNY.  After reading the reviews (and being the 1st time), I decided to order the mini and the commuter.  The website is very informative and easy to use.  After ordering on March 20, I received same day confirmation.  March 21, I received notice of shipping.  March 27, both umbrellas arrived.Packaging was undisturbed.  No outside damage.  Inside, I could tell that care was given for the West Coast shipping.  The mini arrived in it's sleeve.  The commuter arrived in a classy box. No damage at all. I'm impressed with the entire ordering process thru delivery. The umbrellas look to well made. I don't believe I will be disappointed once the next storm hits. I do recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah S",
          "Nb_Reviews": 3,
          "Date": "2023-03-09T16:11:55.000Z",
          "Titre": "Clear and Concise",
          "Contenu": "Davek’s website was clear and concise, the ordering process straightforward, with timely and informed delivery, and the umbrella’s were packed with extreme care. I’ll get to try out the umbrella’s soon, as more rain is coming!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Saqqara Mizrahi",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T00:43:02.000Z",
          "Titre": "So glad I finally bit the bullet and…",
          "Contenu": "So glad I finally bit the bullet and purchased one of these umbrellas! Absolutely in love with the pure quality in every detail, and the way water doesn’t stick to it. I love the rain even more now, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Karoly",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T16:33:37.000Z",
          "Titre": "I have been using my umbrella for over…4 years",
          "Contenu": "I have been using my umbrella for over 4 years now and it happened to break which i was surprised about, with a quick photo and minimal shipping cost, a new one was sent to me, will forever use this company! BEST umbrellas BEST service. thank you Davek"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Buddie Carroll",
          "Nb_Reviews": 2,
          "Date": "2022-12-02T14:32:02.000Z",
          "Titre": "Dave’s Experience",
          "Contenu": "I have used several umbrellas over last 15 years.  They are quality and durable in design and use.  They are not oversized for cumbersome use.  The reason I have used several over the years is due to leaving and losing  them.  I always reorder for my use.  Good umbrellas!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mmmaris",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T14:37:25.000Z",
          "Titre": "Repeat customer",
          "Contenu": "My family now has several Davek umbrellas. We love them because they are compact, sturdy and stylish. Sadly, two of them recently broke. Happily, Davek customer service replaced them, incredibly quickly. We're delighted to recommend Davek."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T20:17:59.000Z",
          "Titre": "I purchased the Davek Elite and also…",
          "Contenu": "I purchased the Davek Elite and also the travel size. Wow what an amazing umbrella. No way this thing will break under normal use or with high winds. You have to purchase one to see for yourself. Absolutely worth the extra money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gigi Brienza",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T14:55:32.000Z",
          "Titre": "The overall experience was delightful",
          "Contenu": "The overall experience was straightforward and delightful. I received my shipments promptly and they were nicely presented/packaged. I had a hard time figuring out the size I needed - ended up buying the solo (too small but kept it as a back-up), bought the golf umbrella instead (too big! but I returned it and the return process was very simple and I was promptly refunded), and then bought the Duet (I think that is the name) and this umbrella is just right, as Goldilocks would say. So, I have had three purchase experiences with Davek in the last week, and all made me feel valued as a customer. The size issue on the umbrellas is more an issue I have with conceptualizing measurements vs a product description issue, but maybe a video showing the product in use by humans on the website could be helpful to understand size/operability better. Very happy with this brand and company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Verduzco",
          "Nb_Reviews": 3,
          "Date": "2023-03-06T00:55:31.000Z",
          "Titre": "Well quality is easy to recognize",
          "Contenu": "Well quality is easy to recognize. First off it's not cheap money wise; also the company has a great customer service. Davic has both. Thank you . Great work will never go unnoticed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 5,
          "Date": "2023-08-03T19:22:00.000Z",
          "Titre": "Great service",
          "Contenu": "Great service.  The quality of the umbrellas is tops.  As someone who not infrequently loses these things, however, the replacement service is exceptional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Dalal",
          "Nb_Reviews": 16,
          "Date": "2023-05-04T18:56:35.000Z",
          "Titre": "I own several Davek umbrella models",
          "Contenu": "I own several Davek umbrella models, and they are all of excellent quality and durability. As for the company, the customer service is very alert and understanding, and follows through on issues. Overall, worth the price and peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Gramlich",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T16:42:53.000Z",
          "Titre": "It was easy to select the model I…",
          "Contenu": "It was easy to select the model I wanted and purchase it online.  (In the past I've purchased them in a local, independent store.) The umbrella arrived quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Richmond",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T15:07:50.000Z",
          "Titre": "Superb Davek umbrella",
          "Contenu": "This is my second Davek umbrella. I LOVE your products. The smaller one I first purchased is as good as new and I've had it several years. It's great for keeping in the car. I wanted the new one for walking my dog when it rains and for other general times of need. I LOVE IT! Your umbrellas are so well made - worth every penny!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RUSSELL",
          "Nb_Reviews": 4,
          "Date": "2023-02-03T16:56:27.000Z",
          "Titre": "Quick delivery of our order",
          "Contenu": "Quick delivery of our order. After receipt our review of your product confirmed quality goods that we anticipate to last a long time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KERN BAKER",
          "Nb_Reviews": 10,
          "Date": "2023-03-30T11:24:36.000Z",
          "Titre": "Quick delivery and just the umbrella I…",
          "Contenu": "Quick delivery and just the umbrella I need for travel. Small and compact… it will fit in my pocket!I have installed the electronic device to alert me should I ever walk off and leave it somewhere.Can’t wait till the next rainy day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 13,
          "Date": "2023-07-08T15:49:08.000Z",
          "Titre": "Great for travel and every day.",
          "Contenu": "Love these! We have four, two live in our travel bags, the other in our car and one at home to grab in a hurry. They literally fit in your pocket or a pocketbook/tote but work as well as the big boys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Jeanty",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T18:43:16.000Z",
          "Titre": "Shipping was fast and easy",
          "Contenu": "Shipping was fast and easy, great quality and vibrant color."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Faith Tenorio",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T22:27:53.000Z",
          "Titre": "We bought different sizes of davek and…",
          "Contenu": "We bought different sizes of davek and we love them all. Durable and nice quality. We are giving our family and friends this umbrella as a gift and they love it too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris Kamish",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T15:55:56.000Z",
          "Titre": "Love it!",
          "Contenu": "Received my order quickly!  Nicely packed and so compact for my work bag.   Love my new umbrella.   Great gift idea for the travelers in your life!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Barnett",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T15:47:44.000Z",
          "Titre": "Excellent quality",
          "Contenu": "Excellent quality.  Very rigid and sturdy.  Quite pleased with this umbrella."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Conole",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T21:18:37.000Z",
          "Titre": "Have not had to use the umbrella yet…",
          "Contenu": "Have not had to use the umbrella yet but did open/close. Vert good quality. You can feel and see how well made it is.  Won’t fall apart like other popular name brands do after one season."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LP",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T17:04:26.000Z",
          "Titre": "Good quality umbrella and efficient…",
          "Contenu": "Good quality umbrella and efficient delivery. This is my fourth umbrella. I have given as gifts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CindyP",
          "Nb_Reviews": 3,
          "Date": "2022-11-10T22:31:00.000Z",
          "Titre": "Perfect umbrella why not have both sizes!",
          "Contenu": "I already own the large umbrella and wanted a small purse size and because my Davek has been the best umbrella I have ever owned I ordered the small one. It came on time and exactly as pictured. I have used it already and it performed perfectly. I love my new umbrella and so happy I ordered it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen L",
          "Nb_Reviews": 7,
          "Date": "2023-04-06T19:25:59.000Z",
          "Titre": "This is my 3rd Davek…..my experience…",
          "Contenu": "This is my 3rd Davek…..my experience has been that this umbrella has tremendous durability.  I have been pretty happy with it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Hofeldt",
          "Nb_Reviews": 3,
          "Date": "2023-02-03T01:01:33.000Z",
          "Titre": "Love the high quality Davek products",
          "Contenu": "Love the high quality Davek products! They’re worth the investment and I won’t be throwing out umbrellas every year now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T20:15:41.000Z",
          "Titre": "I sent a Davek to my sister",
          "Contenu": "I sent a Davek to my sister for her birthday as it is the most reliable and attractive umbrella I have. She loved it and I hope gets many years of use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Della Ratta",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T00:09:39.000Z",
          "Titre": "Quality made!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "BRENT A CANTLEY",
          "Nb_Reviews": 4,
          "Date": "2023-05-05T01:51:10.000Z",
          "Titre": "I loved receiving the free umbrella…",
          "Contenu": "I loved receiving the free umbrella with my purchase. I especially loved receiving the discount on the mini umbrella. I take it everywhere."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ani",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T23:32:32.000Z",
          "Titre": "I have purchased two Savek Sevile in…",
          "Contenu": "I have purchased two Savek Sevile in navy blue. Both to give to special people in my life. This is the perfect gift for someone who admires beauty and exquisite craftsmanship. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori Mercer",
          "Nb_Reviews": 13,
          "Date": "2023-07-06T05:45:13.000Z",
          "Titre": "Quality & Beauty",
          "Contenu": "What a beautiful and quality travel umbrella. I am going to enjoy carrying this on my next trip."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mauri Foster",
          "Nb_Reviews": 3,
          "Date": "2023-02-02T19:52:30.000Z",
          "Titre": "Great experience from start to finish",
          "Contenu": "Great experience from start to finish! Ordering was simple, delivery smooth and prompt. The product is well made."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wony Kahng",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T21:49:20.000Z",
          "Titre": "I got Duet and Mini umbrella",
          "Contenu": "I got Duet and Mini umbrella. They are good at looking and function. Mini one had a defect and I emailed. Davek replied right away and they shipped new one. I amazed with their service. I strongly recommend Davek even the prices are high. It worth. Thumbs up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mohan",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T19:45:15.000Z",
          "Titre": "Purchased the mini...easy to carry in…",
          "Contenu": "Purchased the mini...easy to carry in my trouser pocket....started raining at the parade...didn't have to get wet...thanks to the compact mini."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara from San Francisco",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T17:37:39.000Z",
          "Titre": "Solid and protective",
          "Contenu": "Solid and protective. The larger umbrellas are a bit heavy so my husband loves his."
        },
        {
          "Note": 5,
          "Lieu": "LB",
          "Pseudo": "Dory Khoury",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T19:42:31.000Z",
          "Titre": "I shopped online and the delivery was…",
          "Contenu": "I shopped online and the delivery was fast. The Davek Umbrellas are one of a kind for their quality and the materials used."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Satine",
          "Nb_Reviews": 3,
          "Date": "2023-04-06T18:18:43.000Z",
          "Titre": "Easy to open and close",
          "Contenu": "Easy to open and close. Did not blow inside out with strong gusty winds. Comfortable handle. Kept me dry. Highly recommended.MarkNYC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Keller",
          "Nb_Reviews": 8,
          "Date": "2023-01-13T19:33:54.000Z",
          "Titre": "Very solidly made",
          "Contenu": "Very solidly made. Quality materials. I have the smaller one that is easier to carry in a pocket. This one is nice getting in and out of a car when it is raining."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kanoho",
          "Nb_Reviews": 5,
          "Date": "2023-03-06T11:02:03.000Z",
          "Titre": "Great product and service",
          "Contenu": "I very much like the umbrella I ordered. The ordering process was easy and I received the umbrella exactly as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL OHRIN",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T20:30:31.000Z",
          "Titre": "Best part about it is my wife LOVES her…",
          "Contenu": "Best part about it is my wife LOVES her compact umbrella! Looks very well made and mechanism works smoothly. Delivered on time as stated ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allan Mandell",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T18:52:41.000Z",
          "Titre": "Exceptional umbrella and fast shipping",
          "Contenu": "Exceptional umbrella and fast shipping.  If you want a high quality product, Davek is the place."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Washington",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T19:45:58.000Z",
          "Titre": "It was a gift to my daughter",
          "Contenu": "It was a gift to my daughter. She loves her Davek, especially with the tracker. She's in an out of business offices. This is one less thing to keep up with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T17:56:42.000Z",
          "Titre": "Highest quality",
          "Contenu": "One of best umbrellas on the market.  Can handle winds in urban centers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 3,
          "Date": "2023-07-07T03:30:20.000Z",
          "Titre": "Best Customer  service ever",
          "Contenu": "Best Customer  service ever. I had a Solo that I bought  in 2013 and it just broke. I called  Davek, sent a photo of the umbrella, and they sent me a new one. No questions  asked."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Fultner",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T18:51:32.000Z",
          "Titre": "Presentation was very nice!",
          "Contenu": "I haven't used the umbrellas that I bought yet, but the packaging and presentation were top notch!"
        }
      ]
    }
  ]
}