{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "dialpad.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Tang",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:26:25.000Z",
          "Titre": "Don't sign up unless you are sure",
          "Contenu": "I signed up for a trial account and tried to cancel before my first billing cycle.  The link internally on the portal to cancel is \"broken\" and has been for at least 6 months.  I thought I had canceled my account. I had asked for it to be canceled and 6 months later they are still charging me.  My advice: look at RingCentral instead."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Monika Barańska",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T12:00:59.000Z",
          "Titre": "Zero trust",
          "Contenu": "Absolutely ridiculous, I signed one month contract and then I realised they keept charging me from JUNE. I contacted them on multiple channels and apart from being reassured that they will cancel my account nothing happend and I got charged once again."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Deb Ontheweb",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:33:03.000Z",
          "Titre": "Kept charging my creditcard after I had previously requested a refund and did not continue with trial",
          "Contenu": "I tried dialpad. I told them I would not proceed. Kept charging my credit card after I had previously requested a refund and did not continue with trial."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sam S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:22:54.000Z",
          "Titre": "Did you get a free trial? Don't get scammed.",
          "Contenu": "If you are exploring a free trial with Dialpad, be warned: at the end of the 14-day trial, you are automatically upgraded to a paid account without an opt-in or email notification.Their Customer Success team refused to give a refund-- even a pro-rated refund.I'm our company's CTO and was excited to use them, but they are difficult to do business with. It looks like we'll be using OpenPhone."
        },
        {
          "Note": 1,
          "Lieu": "LB",
          "Pseudo": "Hasan Dbouk",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:47:09.000Z",
          "Titre": "The rudest sales team I ever…",
          "Contenu": "The rudest sales team I ever encountered. I mean the arrogance and the lack of support for a client who is in the process of registering is bewildering. What if I'd had already paid them and worked with them how would that support be then?Laughable company!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Omer Siddiqui",
          "Nb_Reviews": 10,
          "Date": "2023-11-29T18:30:26.000Z",
          "Titre": "Don't take their service.",
          "Contenu": "I took Dialpad's service two months ago, their website clearly states that unlimited calls. Yesterday they cancelled my account by saying that your usage is more. What a pathetic service. I request not to take their service, They are lying. Support request # 2961225The service which I was told about before using was said to be unlimited even on their website it’s clearly mentioned that it’s unlimited usage, but my account has been cancelled due to usage without any prior intimation and no one emailed me /called me to inform about the usage. Yesterday when I posted my review then one of Their representatives contacted me via email his name is Dulce, he said he will review my case and will get back to me but I haven’t received any updates from him till yet and my account has not been activated.I will go to every extent to pursue my case."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard S",
          "Nb_Reviews": 9,
          "Date": "2023-11-21T00:10:22.000Z",
          "Titre": "First there software is BROKEN",
          "Contenu": "First there software is BROKEN, not unfinished that would be too good a compliment it's outright broken.Nothing in my trial worked. I ended up calling them to cancel my account for 2 days later to be bombarded with more zendesk tickets telling ME to cancel my own account. Go there on my PC and it's a white page (500 server error) to cancel. I've never experienced such a crappy company all year, it's disgusting. Oh and day after I signed up, I was emailed the next day, I replied asking for assistance and never heard anything back. Don't waste your time, these \"positive\" reviews are fake as far as I am concerned the software is broken and their service is a shamblesEdit: No I will not be forced to waste my time any further because you simply don't like my review. Pay me for my time or do one! I am not telling you what you have done wrong on my time. Do your own research!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt V",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T14:00:56.000Z",
          "Titre": "Horrible customer service and no sense of urgency",
          "Contenu": "Signed up for service a month ago and still can't text. Have sent corporate paperwork and contacted onboarding and customer service several times with no help. They were quick to take money for a service we can't even use yet. They are holding up business and don't seem to care. This was suppose to take only 10 days and we are way past that with no set timeline now.***UPDATE*** Forwarded info to the director in response to my original review and still NOTHING. Not even a response. They will continue to take your money for a service that isn't even usable with absolutely not ETA...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Isaiah Bassett",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T22:47:08.000Z",
          "Titre": "Adrien was incredible! BUT THERE ARE GLITCHES!",
          "Contenu": "Adrien was incredible! But Dialpad's online portal is horrible.I am a solo entrepreneur that has an urgent need for a cloud based calling service to help my business. I was unable to start my account due to glitches in their system. After spending close to 30 minutes on the phone with Dialpad, calling my bank to make sure my card was ok, opening 3 different web browsers, and multiple emails I was unable to sign up. Poor experience. Thanks Dialpad! I went to Aircall instead."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sam Greenslade",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T13:09:19.000Z",
          "Titre": "Do not purchase if you are a UK company…",
          "Contenu": "Do not purchase if you are a UK company looking to make calls in the US.They oversold the product stating that we could do this, although when we went to add more users they said we have to be a US company to do it. Very disingenuous. Customer service was not helpful."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T19:08:41.000Z",
          "Titre": "Trying to cancel my account",
          "Contenu": "Hi I was happy with my Dialpad account worked great until I tried to cancel it,It seems impossible to cancel I’ve been trying for 6 weeks to date and my account is still active,I’ve spoken to over 15 different people from there and sent 4 emails requesting that my account needs to be cancelled and I’ve had 4 ticket numbers but still no joy,I’ve called my credit card company to see if they can stop any further payments but they can’t it needs to be Dialpad that closes the account and I can’t see how that’s possible,So if you committed to staying with Dialpad I highly recommend them as long as you never leave and try to cancel,This is actually the first review I’ve ever left I’m just so frustrated not sure what else to do"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Garry",
          "Nb_Reviews": 5,
          "Date": "2023-06-19T07:18:37.000Z",
          "Titre": "SCAMMERS !!!!!!",
          "Contenu": "Do not under any circumstances use this company , you will regret it . They will charge you for services that were not agreed and will lie about what is actually in their packages . And when you call them the staff are rude , incompetent , and will not resolve your problem , they will just Pam you off till your next bill where they will over charge you again , SCAM COMPANY OUT TO ROB PEOPLE !!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Shelly Madan",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T21:39:18.000Z",
          "Titre": "Do not use DialPad",
          "Contenu": "Having trouble setting up text messages, unable to speak to support. You can only speak to a human if you are buying, not available if you need support. Generated multiple support tickets, zero response. Unable to cancel subscription, when you try to cancel from admin console. The system prompts you to generate another ticket. Pathetic experience, stay away from DialPad. FYI we have been using RingCentral, tried dial pad because RingCentral doesn’t offer SMS service in our region.Hi DulceI have replied to your message and despite your escalation, still no one has bothered to reach out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julian Crosson-Hill",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T18:21:28.000Z",
          "Titre": "Worst support I've ever encountered",
          "Contenu": "Dialpad has the worst support I've ever encountered. I chatted with a sales rep who was wonderful. They assured me their service would work with my existing hardware and checked that my number was portable. They even offered me an excellent discount to purchase. I signed up for an annual plan and ported my number. During porting, I had to contact them because they emailed to say that the port failed. Then they said it hadn't and it was a mistake. The number seems to work, but I'm concerned. Then, I attempted to connect my phone. I followed all the steps in their process and got an error. I tried it several times. The onscreen instructions say to send your device's MAC address to support, so I did this and explained the problem. They sent me a copy/paste of the help document and process I'd just done 3 times.I wrote back to explain that I'd done this and was still getting an error. I received back a copy/paste of the help doc and the process I'd already followed. I called in, and they were going to escalate it to their technical team and respond via email. Guess what? I got a copy/paste of the help doc. Stay away from this company. They may be inexpensive, but if you ever need help with your service, you won't get it. Now, I'm trying to get my number ported back and hoping for a refund, but I expect it to be a fight."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Murry Thurman",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T23:39:59.000Z",
          "Titre": "Horrible company with horrible customer…",
          "Contenu": "Horrible company with horrible customer service. I spent over a week simply trying to get an account set up. Their platform throws constant errors in which you have to contact support to get an explanation of the error and they never give you an answer,Stay away from this company!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J.P.",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T23:14:12.000Z",
          "Titre": "Reliability is a problem",
          "Contenu": "While the interface is good and fairly intuitive, the quality and reliability have been a consistent problem over our months of use. Whether from a mobile device or PC, calls drop, there are periods of dead air and some voicemails are texts are extremely hard to locate later. As a small business, an unreliable phone system is a deal breaker and I'm checking out other vendors."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ed",
          "Nb_Reviews": 14,
          "Date": "2023-06-06T18:20:38.000Z",
          "Titre": "You managed to max out the level of how…",
          "Contenu": "You managed to max out the level of how annoying repetition any youtube advert ever did since Roman times, your french exuberance made sure for generations non of my gran gran gran gran children will ever use dial pad, and we will burn down any diaLPAD villages we ever see in our paths. Congratulation to have taken your vagina and rub it in my face for the 45000x times, i am not interested, get of my D with your dialPAD for losers, no surprise you get zero love.To a response from your company that belives I will waste my time emailing. Are you low IQ or you can not read well. I just wrote that you played your YOUTUBE advert for 450.000 time and looking at the same annoying lady and same stupid youtube advert, means you are so dumb at the advertising and your repsonse to trust pilot review is even worse."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Monika Barańska",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T11:38:05.000Z",
          "Titre": "Lack of support",
          "Contenu": "Absolute mess, once the contract is signed, they disappear, there is no demo, no guidance how to proceed with the process. I really want to simply pay & start using the tool as my team is waiting for it to be resolved. I have been asking a support center and my account manager who gives no relevant information to the customer for a week now to resolve my issue and start to use the tool."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Tanya Mathews",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T02:54:36.000Z",
          "Titre": "If you have a large office with…",
          "Contenu": "If you have a large office with multiple sites, this is not an option for your business. Our three offices have been in limbo for 6 months because we wanted desk phones not tied to employees. They cannot accommodate this structure, nor can they connect the phones to transfer internally. You must use an app. which is not feasible for our large multi location office. We still get charged for phones that do not work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 8,
          "Date": "2022-06-27T23:12:26.000Z",
          "Titre": "A nice UX design with a terrible engine behind",
          "Contenu": "We have been clients with call centers, talk etc for years. We have put up with their service issues, lack of features, months of delays and misrepresentations. We are constantly suffering issues like calls not connecting, numbers blocked, lack of features and a ton of other staff.This company and service is NOT equiped to provide service as call centers. Stay away and you will save yourself a ton of frustration. We are currently paying about 3K a month.. terrible tool, don't let yourself fool by the startupy, modern UX, etc.. this is a piece of...   However, if you want to get it for you as a single user (dialpad talk) it may work but don't think this will work for any remotely professional call center operation."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Adrian Mansfield",
          "Nb_Reviews": 4,
          "Date": "2023-06-26T14:57:00.000Z",
          "Titre": "Scam service - simply DO NOT use",
          "Contenu": "My account was sold to me with full flexibility to add and remove users and numbers.  I made it a key point of the process as that was what I had with my previous supplier so that I can add as we grow and remove costs if the business need changes... Then contract is for 3 years and with no ability remove once someone is added - WHY would anyone sign up to such a deal?Also promised call recording and review - not provided and Dialpad meeting but again this isn't offered as the main service is only available in the US...Then to add insult to injury my \"account manager\" reached out to resolve the issues and has since left without anyone replacing her.  So I'm now stuck with a contract, no means to discuss issues with Dialpad and on-going charges for a missold agreement"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Regina Grogan",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T05:01:21.000Z",
          "Titre": "Am I hallucinating this hellscape?",
          "Contenu": "Am I hallucinating this hellscape?My fleet wasn't able to send inbound or outbound messages. Thus, I sent the company a scathing email asking them to cancel my account and detailing everything that was wrong with the product. Today, I get an email THANK YOU FOR RENEWING DIALPAD!!!! Did you purposely ignore my request to cancel? Furthermore, when you call the San Jose number to get support, it politely tells you that you cannot get support and there is nowhere else to get support. Then, when you contact the automated chatbot, nothing goes through there either. Good luck canceling! WOW! Chargeback city, baby. Switched to google voice and never, ever ever going back. I'm actually extremely disappointed because I'm one of the people that worked on the partnership with Google and I thought this product was better. They sold it for better than what it actually was. Google should sever ties, IMO. Would never have signed off on this partnership if I knew this was how the service actually was here."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard Dana",
          "Nb_Reviews": 4,
          "Date": "2023-07-06T07:37:38.000Z",
          "Titre": "Poor quality product with low level…",
          "Contenu": "Poor quality product with low level functionality and horrendous customer service. It’s taken us 4 months to try and leave them. Stay away. We’re now with Aircall who seem far better."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Arran L",
          "Nb_Reviews": 7,
          "Date": "2022-06-20T16:17:41.000Z",
          "Titre": "The worst customer service I've ever…",
          "Contenu": "The worst customer service I've ever encountered.I signed up for a trial account but before I could even use the software my account was blocked. After wasting an hour talking to customer support who just fobbed me off with vague answers I received an email to say my account has been permanently terminated because suspicious activity has been detected.How can suspicious activity be detected when I only just signed up?The only suspicious activity I see is from Dialpad, who took my debit card details before telling me I'm 'not allowed' to use the software.I will look elsewhere for call forwarding solutions for my travel company.AVOID THIS COMPANY AT ALL COSTS."
        },
        {
          "Note": 1,
          "Lieu": "BZ",
          "Pseudo": "Blake Finley",
          "Nb_Reviews": 18,
          "Date": "2022-09-30T20:45:25.000Z",
          "Titre": "Barely works and zero customer service",
          "Contenu": "We used DialPad for our mid-sized company with dozens of phone lines for well over a year. They had absolutely horrible service, it never worked right, had constant bugs and no one could ever help with any of the issues. Just endless email loops and excuses. We would come in one day and find that they had dropped numbers from our account and there would be no new ones in their place and we just wouldn't get calls from our clients that week, or we would realize that all the analytics data was nearly worthless since it was so buggy. They also overbilled us almost monthly (often by hundreds or thousands of dollars), which always took hours to get them to admit that they made a mistake and correct it. After dealing with dozens of similar issues we parted ways and would definitely not consider them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "andrew mendez",
          "Nb_Reviews": 2,
          "Date": "2023-02-21T07:36:25.000Z",
          "Titre": "Terrible customer service provided by Jowalsh Ortega",
          "Contenu": "I forgot to cancel the subscription after we stopped using the services and they kept on charging for 9 months. When we finally realized 9 months down the road that we are being charged for services we do not use anymore, dialpad did not have the courtesy to partially refund us even a single month."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gatis Baumanis",
          "Nb_Reviews": 8,
          "Date": "2023-05-23T19:21:16.000Z",
          "Titre": "bad app..",
          "Contenu": "bad app..Charged 4x more than advertised.No option to delete or cancel the subscription they take the money and charged me already 2 times..No customer service.. no replay to delete the account"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T15:56:02.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Terrible experience. Signed up and immediately had my account terminated before I was able to log into my account. When I contacted support, they said the billing department had locked me out. After taking hours to get back to me, the billing department said my account had been cancelled due to violation of their policies and accused me of \"fraudulent activity,\" but provided no details on what the alleged \"fraudulent activity\" was or how it happened before I had even logged into my account.Called customer service the next day and they were not able to help, provide any direction on how to proceed, or tell me what happened."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Therese Anthun",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T16:39:22.000Z",
          "Titre": "terrible company",
          "Contenu": "terrible company, cancelled my acconut, no one can help, cant find my address, cant set up or reactivate account,,,, spent hours trying to sort it outridicilous"
        },
        {
          "Note": 1,
          "Lieu": "DO",
          "Pseudo": "Iris Santos",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T21:57:18.000Z",
          "Titre": "Scam instead of Trial",
          "Contenu": "I signed up for a trial (with a debit card). the same day I wanted to cancel my account, but you can't, you need to contact support. I requested a cancellation via support, but they can't cancel my account, they need to escalate your request and open a ticket, so someone else starts to reply to your emails/ticket with everything possible less give you a cancellation of your trial. They ask questions that are not necessary to cancel an account, then they send you an email offering a meeting, then they offer you a discount when I have replied to EVERY email from dialpad saying I just want them to CANCEL my account.4 days have passed since my request, and I have been replying to emails from Dialpad every day, and they still don't cancel my account.This is not a trial, this is a scam."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Atrybe Inc",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T17:13:14.000Z",
          "Titre": "Super Cheats",
          "Contenu": "Super Cheats! I took 2 numbers for outbound calls under the pro plan and it was mentioned that you can do unlimited calling using the pro plan. The price of the pro plan is US$35 per month. Its not mentioned anywhere that to make outbound calls you need to take the \"sell\" plan. They activated the \"sell\" plan and charged US$300 on my card after the trial period."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heros Tempus",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T22:18:36.000Z",
          "Titre": "A lie of omission is still a lie.",
          "Contenu": "I needed a phone for Multi-Factor Authentication at work. My old phone died and my new one was taking longer to ship than expected. I thought the Dialpad free trial would work to fill the interim. I was wrong. Despite making no mention of a daily limit on the website, I had quickly burned through my allotted time just trying to setup MFA and my account was disabled. I had to pay up just to be able to log into work. I wouldn't have minded so much if the page advertising the free trial had bothered mentioning the limits to the trial. But there was no mention of a daily minute limit. The only limit mentioned on the trial page is a 14 day limit for the trial period. I even looked in the terms of service and found no mention of a specific daily minute limit. They do reserve the right to cancel an account for any reason without warning, which they did to me when they noticed I was reaching an arbitrary limit that had not been disclosed to me at any point. That's just deceptive business right there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Cornell",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T19:40:59.000Z",
          "Titre": "Do it yourself, they won't help you!",
          "Contenu": "I signed up for the free trial under a monthly plan.I had forgotten about the date as i spent hours trying to get someone to do the onboarding with me but they never had a time that worked with me. The features look promising BUT in all fairness I did not get a chance to use them. At the end of the free trial they charged me a yearly rate when I wa on the monthly plan. I contacted them to try to work it out as I am not happy with my current provider. Since they could not get anyone to help with the onboarding, we agreed to cancel with a refund. It has been over a week and no refund issued. I reached out to them by chat and said if er can complete onboarding TODAY then we would be willing to discuss the service(i mean it was already paid for). they did not even answer me after that. Well their plan of using the policies as written to fight a chargeback will not work with me because I have it in writing that they would issue a refund and have NOT! Again, the service looks really promising BUT the customer service is the worst I have ever seen!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BJ Desire",
          "Nb_Reviews": 4,
          "Date": "2023-07-20T04:01:29.000Z",
          "Titre": "Miserable experience",
          "Contenu": "Miserable experience. I left another provider to come to Dialpad because I was unsatisfied with the customer service and experience I was having with the original company. Let me just tell you, I am now RUNNING back to my original provider with open arms. It's absolutely amazing when you look at how much $ this company has spent and how poorly designed of a product they actually have. I had a positive experience with customer service for the most part and call quality was not really an issue, but the software they built, functionality, versality, flexibility, ingenuity is HORRIBLE. They should be embarrassed. There are basic features and functions that you would think they would have released in an early beta and yet their software has been around for quite awhile now and still lack these features. It's no wonder they're based out of California. Just like their state gov't they charge you more than anyone else and yet can't even deliver basic amenities or quality of life."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Garrett Ozar",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T20:56:54.000Z",
          "Titre": "Long time Dialpad Customer- stay far away",
          "Contenu": "Stay far away if can. Customer of Dialpad since 2020. They have been increasing our price drastically, removed the ability for us to downgrade or remove seats, and are holding us hostage by charging us for more than double the users we have using the platform. We had someone on our team create \"Sell\" seats and entered in more than we needed. Dialpad removed our ability completely to downgrade those seats. Somehow we have double the seats than we have employees and we flagged this to them 9 months ago. They said they would fix it. They keep increasing our price and billing us more. I've escalated this and no one will help. Clearly struggling with churn so they just make it impossible for you. We weren't even looking at moving away, we just wanted our account to be accurate to the seats and not overpay by double. Multiple people on their team have told us they would remove unnecessary users from our account and no one ever follows up to make it happen. We've been dealing with this for over 9 months and have been paying them $25k/year."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R Carter",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T15:29:47.000Z",
          "Titre": "Scammer Vibes",
          "Contenu": "Seems real scammy. I cancelled in February and see a notice that I’ve been charged in March so I check and I’ve been charged TWICE. I email them directly from their email to dispute this charge and it says the email is invalid. I never trust companies that make you jump hoops to get your money back. They also have this sketchy 3 day refund rule. I just want my $71.96 ASAP because after reading the rest of these comments this company is low key trash."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Dialpad DISASTER",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T18:09:21.000Z",
          "Titre": "Free Trial DISASTER",
          "Contenu": "I signed up for a free trial and forgot to cancel (which allegedly 40%+ of people generally do). After I was charged for a 1 month subscription, I emailed support requesting a refund and cancellation. Then I was charged again the following month! Since I didn't type out a reason for my initial cancellation request for charge #1, they didn't process the cancellation for charge #2! So I emailed support and typed out an explanation why I'm discontinuing their services (i.e. no longer invested in sales calls industry).Month 3 comes and I was charged again! So I went from forgetting to cancel my free trial to getting charged for 3 months (in addition to the time cost of sending 2 email requests to cancel.)Instead of emailing Dialpad a third time to request a cancellation, I saved time by contacting my bank to block future charges from Dialpad. This action would have saved me time and money after charge #1.Perhaps Dialpad intentionally makes it difficult to cancel subscription requests as part of their business strategy? It's much easier to unsubscribe from spam text messages with a simple reply such as: Stop"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T00:51:00.000Z",
          "Titre": "Download of audio sessions does not…",
          "Contenu": "Download of audio sessions does not work any longer.Still experiencing voice issues and very disturbing background. It's pretty difficult to quickly identify who's making noise making it difficult to quickly mute them..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "N/A",
          "Nb_Reviews": 9,
          "Date": "2022-05-31T05:27:51.000Z",
          "Titre": "why don't you have a cancel button?",
          "Contenu": "why don't you have a cancel button?Your rep got back asking for a support code.  Why do people need to go thru these extra steps just to cxl a trial acct?For the past 10 yrs the system has spammed me.   if client doesn't need the system allow them to remove the acct easily. Adrian (Dialpad)May 28, 2022, 00:56 PDTHi Juls! Adrian here from Dialpad and Dialpad Meetings. Thank you for reaching out and I apologize for the inconvenience that this has brought you. Please verify your support code for this request. To find your Support Code, please log in to dialpad.com/  settings,  navigate to your profile, and scroll down until you see Support Code below Timezone. If you are not seeing it, please refresh the page. Also, before we move forward with the cancellation, we'd love to get some feedback on what we could have done better to keep you with us. May I know the reason for the cancellation? If you are switching to another service, would you be able to tell us who you are switching to? Your comments are appreciated!Best,AdrianDialpad, Inc. | Dialpad Meetings"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ed Stojancevich",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T19:16:00.000Z",
          "Titre": "They are absolutely awful. They lie and offer SUBPAR support.",
          "Contenu": "They are absolutely awful. What I agreed to signed up for isn't what was delivered. It is going on 3 months and they are experiencing \"technical issues\" that are preventing me from utilizing the phone service. I would NEVER recommend this company to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Hug",
          "Nb_Reviews": 1,
          "Date": "2021-01-21T16:06:01.000Z",
          "Titre": "I've had Uberconference for 2 years and…",
          "Contenu": "I've had Uberconference for 2 years and have been waiting patiently for them to catch up with the rest of the pack.  The last straw is the fact that they do not have video capability for Apple mobile devices.  This is ridiculous.  I then asked them for my money back and they refused.  They even would not allow me to take down my credit card while my account is still active.  Uberconference is truly the worst of the pack.  DO NOT  GET TRAPPED BY THEM!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Danny R",
          "Nb_Reviews": 28,
          "Date": "2020-02-13T22:15:48.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible - site makes you work REALLY hard to just log in - pages are unclear and, despite spending 45 minutes with 2 different advisors, neither were able to help get me set up. I gave up"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Garry",
          "Nb_Reviews": 5,
          "Date": "2023-08-16T15:43:21.000Z",
          "Titre": "Now 3 months on and still having…",
          "Contenu": "Now 3 months on and still having problems with dialpad , joke company!!! Worst customer service ever!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 2,
          "Date": "2023-05-03T01:15:54.000Z",
          "Titre": "Turned off our sms features while we…",
          "Contenu": "Turned off our sms features while we were still simply asking questions about it. Really unprofessional."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Wilson",
          "Nb_Reviews": 5,
          "Date": "2023-03-07T02:09:13.000Z",
          "Titre": "The service with dialpad never really worked…",
          "Contenu": "The service with dialpad never worked very well. Not only did we miss calls but it was difficult to use. We tried canceling but they acted \"confused\" only to find out they increased our plan (ie. more money) without telling us. Good thing we caught it and got out. Zoom phone is easier"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 6,
          "Date": "2023-02-06T21:40:53.000Z",
          "Titre": "DialPad are liars",
          "Contenu": "DialPad are liars.  I specifically called them after receiving an email notification of the price increase of more than 15% for continued service.  They assured me that my account was not going to be effected by this increase and it was going to remain the same amount.  Lie number one.  I called after the increase and the charge was more than previously paid.  They assured me it was an error and they would provide me a credit and sorry for the misunderstanding.  I was charged ever more the next month.  Lie number two.  I call about it and share that I do not want to continue and that I have began searching for another provider.  \"Oh so sorry, please don't leave.  We'll fix it.\" was their response.  HELL NO.After finding another provider and paying to have their service and starting the port of my phone number to them, DialPad would not release the phone number causing me to not only have to pay for a month of service with the new company, but now I've lost the number altogether because I told them to cancel the service after they BILLED ME AGAIN the higher amount NOT AGREED UPON and I was lied to in the past twice.Tech is okay- 3 stars. Customer service is -1 star."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kevin Lee Smith",
          "Nb_Reviews": 21,
          "Date": "2023-02-25T16:56:24.000Z",
          "Titre": "ABDOLUTELY ABYSMAL",
          "Contenu": "ABDOLUTELY ABYSMAL. After paying £600 for a pro licence for 3 people, a week ago they decided to turn off my ability to be able to send SMS texts. Since this is my primary communication medium with my customers they have killed my company. After numerous calls numerous emails backwards and forwards over 6 days they keep telling me it's because I've run out of credit. My account does not run on credit, it runs on unlimited calls and unlimited texts. Strangely I am allowed to send texts to American numbers but not the UK numbers when I'm a UK based company. It seems obvious that someone in the system thinks that I'm a US customer rather than a UK customer but do they take that information in and run with it? No, they keep repeatedly over and over and over again telling me I've run out of credits and I have to buy more credits for $180. They kept telling me it's what the billing department had told them, so I called and I pressed number 2 to speak to the billing department after wasting 30 minutes explaining the tragic story of what the hell had gone on, the lady then told me to hang on a minute I'll just talk to the billing department, so the stupid system put me through to technical support when I specifically press number 2 to talk to billing. OMG. DO NOT USE THIS COMPANY. THEY ARE ROBOTS WITH NO ABILITY TO SORT OUT ISSUES.UPDATE 25/2 - They messaged here and told me to email Dulce. I did. 2 days later, no response. This is typical of this terrible company. Words are cheap."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kevin Lee Smith",
          "Nb_Reviews": 21,
          "Date": "2023-06-13T13:08:02.000Z",
          "Titre": "BUYER BEWARE - ABSOLUTE INSANITY",
          "Contenu": "BUYER BEWARE - Having had various problems with dialpad after spending over £600 with them. I tripped over the latest insanity today. I tried calling an 0844 number (UK Border Agency) (7p/minute) and the system told me I didn't have enough credit (I had £10 of credit). I called support. First they told me its becasue that number charges £20/minute. I told them thats obviously not correct. Then was told it cost £7/minute, to which I told them the \"p\" in 7p/minute is not pounds but pence. Then I was told that I was not allowed to call  premium rate numbers - becasue I need to pay for 15 licenses before they would \"enable\" that!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Did they tell me when I paid my £600 up front \"Just so you are aware sir, there will of course be certain numbers that it will be impossible for you to call\" Of course not, becasue that would mean I would not have used them or paid them any money.ABSOLUTE INSANITY.Read their reply. A misunderstanding! Everything has to be some kind of insane conversation with these people. Then when u expose it, its just a misunderstanding! What they should say, is, \"we are terribly sorry sir it's obviously insane for us to force you to buy 15 licenses in order to be able to make phone calls to premium rate numbers. I'll get that sorted out immediately, and I'm sorry for any inconvenience m. Please accept this £10 credit as a gesture of goodwill and as evidence of our commitment to not do insane things in the future\" But no, they continue with their political bullsh*t of \"there was a misunderstanding\". ABSOLUTELY INSANE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca W.",
          "Nb_Reviews": 2,
          "Date": "2020-01-14T21:05:00.000Z",
          "Titre": "Not as promised.",
          "Contenu": "I joined uberconference specifically because they held out that you could place outgoing phone calls from within a conference call.  This is untrue, as verified by customer service.  Very disappointing.SEE www. uberconference .com/features/conference_call_out"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 5,
          "Date": "2023-04-05T21:35:13.000Z",
          "Titre": "Misleading, and poor customer support",
          "Contenu": "I don't have anything particularly positive to say unfortunately. The product appears to be good on mobile, although the website UI is an incredibly confusing mess. It seems to be targeted towards bigger organizations vs small businesses.Either way, I signed up to a free trial and had the intention of porting a number in. Since you can't do this during the free trial, you are prompted to complete the upgrade. The price shown was 180/year + \"taxes and fees\", however there was no transparency around what exactly these taxes and fees would be. It didn't show me ANYWHERE on the page in terms of the full total during this upgrade. I proceed with the upgrade, only to find out I was charged $287 of the $180/year that was shown to me. Over $100 in taxes and fees which were not shown to me whatsoever.Since being charged this amount almost a week ago, I have had absolutely zero luck with speaking to anyone about getting a refund as per their payment and refund policy. If you call their billing department, there is no-one available to speak. I left a voicemail and no-one called me back. If you ask on live chat, they claim it can only be done by email.When I finally get escalated to an email thread with someone from \"Customer Success\", I STILL do not have a refund I asked for repeatedly. The conversation has proceeded like this:Me: Hello. I would like a refund... (with my reasoning)Dialpad: What is wrong with the product?Me: I feel mislead with the pricing. Please refund.Dialpad: What about a discount instead?Me: I just want a refund. Please process the refund as per your policyDialpad: Are you sure you want a refund? Is there something we can do?Me: I just want a refund.Dialpad: No responseStill no refund. I can't speak to anyone about getting the refund, and now I am going to have to file a chargeback. What a joke."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T16:25:37.000Z",
          "Titre": "Very difficult to get everyone setup to…",
          "Contenu": "Very difficult to get everyone setup to use Uber Conference on their phones, computers and tablets."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T20:21:14.000Z",
          "Titre": "This company's performance has been…",
          "Contenu": "This company's performance has been highly unsatisfactory, ranking it among the worst in my experience. Despite assuring us of free SMS to Canada and USA during the duration of our contract, they abruptly began charging us. Obtaining the promised services has been an ongoing battle, as their sales team initially made extravagant promises. The presence of hidden fees adds to the complications, making it financially burdensome. Communicating with their customer service is nothing short of a mockery. I endured a 30-minute wait on hold, only to be neglected by the agent, who failed to check in with me even once. When attempting to cancel our services, we were merely transferred to an answering machine, further exemplifying their lack of commitment to customer satisfaction.Their software proves to be plagued with significant issues, particularly for medium-sized contact centers. Multiple contacts with the same number can be created, resulting in chaotic and disorganized records. Merging these contacts is not an option, and there is no functionality to add a number to a Do Not Call (DNC) list. Furthermore, managing multiple contact centers becomes an arduous task due to the absence of a consolidated view, forcing users to navigate between multiple screens to access queues. Timekeeping for agents is also disorganized, with a messy system that requires additional upsells to another company, incurring an extra charge of $30 per seat. Real-time statistics per agent are inaccessible, as generating a report necessitates a 24-hour wait. The software's numerous flaws, such as these, contribute to daily frustrations and difficulties. It is evident that the software is being developed by individuals lacking firsthand experience in call center management."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Waters Deep",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T19:01:56.000Z",
          "Titre": "Horrible customer service and…",
          "Contenu": "Horrible customer service and impossible to actually get a refund on services as they describe on their site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jaime Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T02:51:38.000Z",
          "Titre": "Stay away if honesty matters to you",
          "Contenu": "Stay away if honesty matters to you! Their product is good which makes this writing this difficult but they are internal practices are highly questionable.Here’s what happened to me. I had called inquiring about pricing as I was had questions and needed exact pricing. I had been burn in the past where online you see one price but when you sign up and get your invoice, it’s substantially larger.In my case, they offer me an excellent price for a one user phone plan. I explained to the sales rep on the phone I was in the business start up phase and needed to account for all expenses. All I needed was basic phone features , couldn’t care about the extras. I was very specific and asked what the total amount would be. I provided him my zip code for him to give me a total price to include taxes and fees. He quoted me $129 for the year which was a fantastic price and was slightly better than some other competitors I had been researching. That would of came out to about $11 monthly average for signing up for the yearly payment option.I said it sounds good, he even sent me the invoice on the spot for roughly $129 and I paid for it on my cell phone right then and there. After getting off the call, I noticed a charge for $227 a few hours later and was wondering if I had been double billed in error. Thinking it would resolve itself over night or even may be a temporary hold. Nope, I finally had to call. I called and they apologized, the lady said the extra amount, which came close to $100 was for fees.Fees? I specifically asked for a total that included fees and taxes. So I asked to cancel on the spot. They said that I should hear back soon. A week went by and nothing yet. Had to call again, this time the new rep was nice enough to actually cancel my account on the call. Not sure why you have to call twice to cancel an account. In my eyes, If a company can’t be transparent upfront about pricing, it makes you wonder what else they would lie to you about.Anyways, after the headache from dialpad, I went with Zoom VOIP which advertised $15 monthly, no year up front required. Their monthly price with taxes and fees is $16.24Now that’s the part that really gets me. How is Dailpad cheaper per month at around $11 but with their fees/taxes they average $18.92 ($227 / 12 months = 18.92)Where zoom is $15 and comes out to $16.24 Makes no sense as both are VOIP providers.All I got to say is shady practices, I would never recommend Dial pad to anyone I know.My recommendation to the company is that it’s a shame they use these practices. The product is fantastic but the whole experience matters. Be transparent, honest, and fourth coming. That means more to me than anything else when I put an element of my business in your hands."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "MD UK",
          "Nb_Reviews": 3,
          "Date": "2023-07-17T01:24:13.000Z",
          "Titre": "Doesn't allow you to cancel…",
          "Contenu": "Doesn't allow you to cancel subscriptions and continues to deduct money from the account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Edward",
          "Nb_Reviews": 8,
          "Date": "2023-07-10T17:15:58.000Z",
          "Titre": "worst experience dealing with an online service in 25 years",
          "Contenu": "I have been using Dialpad for ~ 15 months & although most of the support agents have been kind, responsive & helpful, both the service & their policies are not up to par, especially the service reps that handle unsatisfied customers. It appears I'm not alone, many others here agree.First, the service dropped my calls often (from the desktop app), normally about 3-4 times a month. Sometimes I could not call a number at all with no ringing after making a call or no ability to use an auto attendant (press any keys during the call). I had reported most all of those incidents to support & after 15 months, nothing was getting better or resolved. The iPhone app often would not allow me to place a call from my contact list, only if you hit the 'phone' icon in a specific area of the app (not on the contact's page) would the call initiate. The iPhone app would also lag in response, turning on or off the speaker, initiating the call or ending the call, all were delayed so often you would have to hit the icon/link several times to get it to work (or not work). The desktop app was also not stable even though I kept it updated. The VM transcriptions were wildly off.Then a few months ago I inquired about the charges and policies related to the new SMS/MMS registry. The rates on my service went up about $80 per year unannounced & the answer was 'taxes'. I spoke to customer service several times and we could never get a bottom line number of why the cost of the service went up that much without an explanation. They said it was 'taxes' & nothing could be done about that. I researched my online account, the help desk and my billing details & found nothing related to the 'taxes' and the increase & I mentioned to customer serivce that I wasn't satisfied. The first suggestion was 'did I want to cancel my service' which I found odd. I said I'd like to speak to someone before cancelling & was told I'd be contacted in a few days. I really wanted to understand why the rates went up without any notice or explanation.A week later, I was contacted by a rep named 'Julian' who emailed me and asked if I wanted to continue to cancel. He did not attempt to provide reasons why I should stay with Dialpad or even discuss my concerns. I asked to speak to someone before cancelling and he avoided the entire topic & followed up with me a few days later asking if I wanted to continue to cancel.I asked for a refund if I were to cancel because I had just renewed 2 months earlier & paid for a full year. He replied that wasn't their policy & wouldn't be possible. Only after I explained my dissatisfaction and that it was basically theft to collect for an entire year & not provide the service, he said he could request an approval for the refund.After I found an alternative service that I was happy with, I told him it would take about a week to port my numbers over and then I would reach out to him again. He emailed and asked 'would you like to cancel your service now?' and within 3 minutes of receiving that email, my service was disconnected. I never even had a chance to reply.After calling customer service and getting help from a very nice rep, she was as confused as I was why my service was disconnected without my consent. She attempted to contact 'Julian' but he would not respond to her. We stayed on the call together for a while and then she said she would follow up with me once she was able to restore my service.Please note I run a business and for this 3 hour time frame that it took to restore the service, my clients and prospects were getting a 'disconnected' message which not only refects poorly on my company (and reputation) but also cost me business.After about 3 hours my service was restored.I then contacted 'Julian' again and kindly asked him to wait on the request until the numbers were ported and then we could continue the cancellation.About 5 days later the numbers were ported and I again contacted 'Julian' to continue with the refund request authorization and cancellation. He replied and said that I was no longer qualified to request a refund. I replied to ask to speak to a manager or someone about this. I replied again, no answer. 4 days later, today, my service was canceled without any communication.Probably the worst experience dealing with a company since I've been working online, and that is 25 years now. And I don't leave negative reviews, only a handful in that time frame.Still to this day, NO ONE from Dialpad has reached out to me, asked if I would reconsider, asked what the issue was or anything relating to my service. Nothing. Even after I requested more than 4 times to be able to speak to someone about this. I did not receive a refund for the prorated service I didn't get now that my service is cancelled & paid through next March (2024). Disappointed is an understatement in this case & am considering my options at this time."
        },
        {
          "Note": 1,
          "Lieu": "BZ",
          "Pseudo": "Blake Finley",
          "Nb_Reviews": 18,
          "Date": "2022-01-31T21:18:29.000Z",
          "Titre": "The product is barely tolerable",
          "Contenu": "The product is tolerable, but the people working there are incapable to an amazing degree. It literally took weeks and dozens of attempts to get them to send us a new contract to renew... Not with any new terms. Just to let us renew and take our money. Apparently, they have bad enough service that no one ever renews so they don't even have a team to handle that?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jodi",
          "Nb_Reviews": 3,
          "Date": "2021-12-31T16:35:04.000Z",
          "Titre": "DIALPAD IS HOLDING MY PHONE # HOSTAGE",
          "Contenu": "DIALPAD IS HOLDING MY PHONE # HOSTAGE.  I signed up for Dialpad because it integrates with my CRM and case management program. The integration worked well and that's the only good thing I have to say. I have been trying to get my phone # ported out since December 13th. Today is the 31st.  They keep denying the port out saying the pin doesn't match, YET their reps keep giving me the pin.  I am stuck with a sub par phone system that is costing me business and THEY WON'T RELEASE MY PHONE THAT I HAVE HAD FOR 25 YEARS."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Carbiz Rentals",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T04:20:25.000Z",
          "Titre": "Such a disappointing experience",
          "Contenu": "From the first interaction with Dialpad, I was promised amazing features and operations. We had 3 experience sessions, in person and over video calls. I was promised SMS and Mobile DID and so much more. It was only AFTER I signed the contract did Dialpad start to backtrack on ALL their promises and told me that actually NONE of the key items are available and can not be delivered. WORST experience ever!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Misty Barker",
          "Nb_Reviews": 1,
          "Date": "2021-01-27T13:18:04.000Z",
          "Titre": "terrible user interface and user experience",
          "Contenu": "Please, please, save yourself the trouble and find another service. Terrible UI, so many quirks that make it horrible to use.When I send a text, it creates a new line in the dashboard, and I cannot see at a glance who the text was sent to. It doesn't just update the conversation.That is one of about 10 different, terrible UI decisions."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sessel",
          "Nb_Reviews": 14,
          "Date": "2022-04-20T12:59:42.194Z",
          "Titre": "Another Bait And Switch Operator",
          "Contenu": "Another bait and switch operator. I chatted in to get pricing for additional minutes, which the operator wouldn't give me. They catch you with a low monthly fee, and then seem to rip you off with a high use rate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff K",
          "Nb_Reviews": 1,
          "Date": "2019-10-01T22:22:46.000Z",
          "Titre": "Still on hold... horrible",
          "Contenu": "I’ve spent the last several hours on the phone trying to resolve a basic issue and the support team has been terrible. I’m a brand new customer trying to get set up and once you have signed on, paid your annual fee and are no longer interacting with the excellent sales team, go ahead and expect long holds and a support team that is not knowledgeable about their product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MW",
          "Nb_Reviews": 1,
          "Date": "2019-09-30T15:28:28.000Z",
          "Titre": "UberConference stinks",
          "Contenu": "UberConference stinks. I was a 4 year plus customer I am closing my account with them. They make you look an stupid because their system does not work,. They updated their system within the last month (Sept 2019) or thereabouts and its been down hill since then. Their customer service cannot help and appear overwhelmed by the problems."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Judy",
          "Nb_Reviews": 1,
          "Date": "2018-01-11T18:05:26.000Z",
          "Titre": "Zero customer support - even for paid plan.",
          "Contenu": "Sales person sold us the business plan by promising us we could do customization. It appears, however, that what she said we could do was not true. I've been trying to contact customer support and there is a recording that just says that there is no one in customer support available to take our call. Emails and chats go into a black hole.  Worst customer service I've ever experienced."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracey L",
          "Nb_Reviews": 27,
          "Date": "2019-11-14T20:01:05.000Z",
          "Titre": "Audio quality is unreliable",
          "Contenu": "Audio quality is unreliable, failed multiple times during business calls. Customer service contradictory and email support system does not work.(Asked for a prorated refund via chat support and was told I would get it. Then I got 10 emails asking me to confirm I was still getting the problems. I replied to each one but they didn't see the responses so I had to log on to their chat system again and was then told that they refused to give a refund (even though the service is close to unusable).(Post review update: I was provided a prorated refund.)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Refinnej",
          "Nb_Reviews": 3,
          "Date": "2021-10-28T22:06:00.000Z",
          "Titre": "This app/program is terrible",
          "Contenu": "This app/program is terrible.  I quit my job due to the implementation of this in conjunction with Service Titan, which we already had.  Yes, part of it is an idiot owner who wants settings that don't work in our work environment, but Dialpad decreased my productivity by more than half.  I can no longer multi task (ie. work on one account in between taking calls) because it attaches all my calls to wrong jobs in Service Titan.  This is good for a call center that does nothing but scripted calls.  This is not good for a small business that has a lot more to do than read a script and fill in the blanks.  Also, 30% of my outgoing calls won't dial out through Service Titan."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wesley Nappi",
          "Nb_Reviews": 1,
          "Date": "2019-03-05T23:19:26.000Z",
          "Titre": "Pray you never need their customer support...",
          "Contenu": "The system works for the most part but if there is a problem be ready to figure it out yourself. Contacted customer support many, many times about the same problem.  They never fixed it, I found a workaround but the problem is still there.  The conversations between me and customer support are long so to make a very, very long story short.  They told me the problem was me and would not help.  I figured a way around and now it works but not how it's supposed to work.I would use another system but the whole company is on dialpad and I didn't want to add even more work to this problem by changing to another service."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Rafat Nabi",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T03:34:09.000Z",
          "Titre": "They cancel your account without consulting you know even if its not your fault",
          "Contenu": "I heard a lot of about dialpad. Heard they were a good service. Don't know if they were paid reviews. Because I just signed up for a trial for my staff overseas to make calls locally. I even spoke to their sales rep about this they said it was ok. Anyways the moment he tries to log in they cancel my account. They don't call me, they don't talk to me, just cancel. Why did they cancel, doesn't say on the email. That's it, follow up or go away. I have to then speak to someone on their chat system to ask what happened and they explained because there was an IP difference. So why cancel my account though? Why not just block access outside of Australia. Then I wanted to lodge a complaint but could not. I can't even have their management know that their customer treatment is appalling."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Littlefield",
          "Nb_Reviews": 2,
          "Date": "2019-04-15T19:18:50.000Z",
          "Titre": "Since this only seems to be for 4 to 5…",
          "Contenu": "Since this only seems to be for 4 to 5 star review I'm sure mine will never show up. Dialpad is the most frustrating company and application I use everyday. The user interface is confounding. Bugs linger for eons while new features are added. The desktop, smartphone and iPad apps provide great flexibility for how calls are handled but there is NO consistency in design which creates great confusion with me (an Electrical Engineer) and other users. We are a frustrated small company. I can't imagine how a large company could manage the support calls these apps would create. It would be interesting if all the 5-star reviews had some detailed praise. The address book us very limited and separate from the phone's address book."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T18:09:52.000Z",
          "Titre": "Absolutely horrible process of trying…",
          "Contenu": "Absolutely horrible process of trying to remove our numbers from their platform. We have run into 3 separate issues in the span of two months which have been Dial Pad's fault."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PB",
          "Nb_Reviews": 6,
          "Date": "2020-12-01T22:38:39.000Z",
          "Titre": "If you want horrible service, Dialpad is for you.",
          "Contenu": "We are two months in and Dialpad has been a nightmare. It is a daily struggle to get our calls. They truly seem not to care. They create a ticket and the issues are never resolved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amber",
          "Nb_Reviews": 3,
          "Date": "2020-11-23T22:43:25.000Z",
          "Titre": "Lots of hidden fees",
          "Contenu": "Lots of hidden fees. $15/month turns out to be $180 then they charge you a bunch of hidden fees. Came out to $256. Had no idea until I was charged. Don't recommend it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cam King",
          "Nb_Reviews": 9,
          "Date": "2021-03-18T19:11:46.000Z",
          "Titre": "SERIOUSLY? WHY ALL THE STARS?!",
          "Contenu": "Where do I even begin? First, it's hard to believe all these good reviews are REAL. The business I work with uses Dialpad along with Service Titan, and we've had nothing but issues for the last eight months. Calls are frequently dropped, or a customer suddenly can't hear me when I'm right in the middle of booking their appointment. This happens DAILY. The set up for after hours call routing is confusing and hard to configure. I've had issues for over a week and customer service STILL hasn't resolved them. They continue to talk in circles and do absolutely NOTHING but pass me along to someone else who knows NOTHING and asks me the same questions I've already answered multiple times. And don't even get me started on the phone app. HORRIBLE. All in all, the WORST phone/customer service company we've used. We're switching to RingCentral next week, and I can hardly WAIT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Littlefield",
          "Nb_Reviews": 2,
          "Date": "2020-12-21T19:08:10.000Z",
          "Titre": "No Ability to Execute",
          "Contenu": "Dialpad has vision but, no ability to execute. One of my best days is when I canceled my account. Their apps are clunky and poorly designed. It's obvious that groups developing for each device are operating in silos. Features work differently in each app. The only consistency is colors.  I did my best for close to two years deal with this, but what I could not deal with is the unreliable communication platform and substandard support. A major part of the infrastructure is open source and the support people who are based offshore do not have the knowledge or skills to get problems fixed. The *switch* gets mangled so that when I tried to call a customer the call was rerouted to another number. The problem was permanent and could never be fixed. It happened to several contacts. I'm still searching for a visionary VoIP solution that is well designed with a reliable rich feature function menu. Dialpad is not it."
        },
        {
          "Note": 1,
          "Lieu": "SK",
          "Pseudo": "Ivana",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T12:18:41.000Z",
          "Titre": "Horrible customer support and…",
          "Contenu": "Horrible customer support and experience. Sales were supposed to reach me, but instead of that they just deleted my account out of nowhere..."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ecomhandle Agency",
          "Nb_Reviews": 2,
          "Date": "2021-12-29T13:54:38.000Z",
          "Titre": "very very bad service lot of issues on…",
          "Contenu": "very very bad service lot of issues on their desktop app  they can ruin your entire business just avoid them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan Killoran",
          "Nb_Reviews": 1,
          "Date": "2019-09-12T15:50:36.000Z",
          "Titre": "Subpar customer support",
          "Contenu": "Subpar customer supportDialpad's tech and marketing talk a big game, and the tech delivers about 95% of the time. But support is awful. The customer success associates are not well informed, slow to answer, and are generally answering questions based on scripts that are haphazardly written. You will get the impression that customer support either:1. Did not read your question/email in it's entirety2. Does not understand Dialpad's processes3. Has never been in a customer support role ahead of this one4. Might not have a grasp on the English language, and may just be copying and pasting 90% of their responses to you5. They are absolutely overloaded and just can't devote more than 20 seconds to your email. We were super excited to work with Dialpad, but the customer support experience is killing that excitement quite thoroughly. We're a new customer (less than 3 months here) - this should be the honeymoon phase of the relationship, but after nearly 100 emails back and forth between my team and customer support, we're pretty much done."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-06-16T19:39:19.000Z",
          "Titre": "high costs and unhelpful customer service",
          "Contenu": "Not very clear or helpful advice from the customer service team and excessively high costs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Howze",
          "Nb_Reviews": 1,
          "Date": "2020-12-24T05:13:09.000Z",
          "Titre": "This is the worst thing in the world…",
          "Contenu": "This is the worst thing in the world like why can't it be business and personal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Travis Wyatt",
          "Nb_Reviews": 16,
          "Date": "2021-04-03T20:50:46.000Z",
          "Titre": "Very wary. False reviews",
          "Contenu": "Very wary. Look at all the positive reviews. All done on the same date. Hmmmmm"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2020-04-28T19:15:40.000Z",
          "Titre": "Broken Contract and Misleading Support",
          "Contenu": "We have been using dialpad for around a year now. The software itself is clunky but generally gets the job done, albeit after significant time tweaking everything. We have four desk phones that mostly work, but most features you would expect in a desk phone don't work with Dialpad. We have remote workers, though, which makes dialpads decentralized system a fairly good for for us.What really makes the software unusable is the support behind it. We applied to their latest \"startup\" offering and got accepted. After a week of back and forth, their general counsel wrote up our license agreement, and we both signed. The day after the contract was executed we got a random email saying they would not honor it and that the multiple employees who dealt with us were not properly trained to extend such an offer. We complained that we already had a contract signed by their general counsel, but they don't seem to care. Our costs will be around $350 more a month than under the contract they are breaking.Now we are in the process of moving to a different provider after having spent many hours configuring everything to their system. Worse, the IP phones Dialpad supports don't seem to be easily configurable to other similar companies.I would recommend against Dialpad. The software is a great idea with terrible implementation and misleading 'support'."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Patrick Knight",
          "Nb_Reviews": 3,
          "Date": "2022-04-14T09:16:49.000Z",
          "Titre": "Poor connection, misleading charges and terrible customer service",
          "Contenu": "I run a law firm and all of our advice is given online, with a team that all works remotely. I chose dialpad based on the reviews but have to say my own experience of them didn't match what I had read and ended up cancelling after a few months.Call quality in the UK is not consistent. Ranges from really good to really poor in any given moment. This is not what you need for a business grade system. They also have very poor integrations with CRM's, particularly Zoho CRM. Lastly we use an 0800 number and their pricing is VERY expensive and all minutes rounded up. So even if you spend 1 second trying to connect, you get charged for a minute. I notified them of our intention to cancel the service and we moved to Ringcentral. Whilst waiting for the number to port, despite not using the service, they \"topped up\" our 0800 calling credit with £100. I did realise this into it was raised by our accounts department. I cancelled our service once the number had ported and then asked them for the £100 credit to be returned as we were not able to use it and nor did we ask for them to top our credit up. They outright refused, stating some small print in their terms and conditions that means you forfeit any outstanding credit when cancelling.That might well be the case, but it highlights their poor customer service where a team of people in Malaysia or some other low cost call center country are unable to apply any discretion or goodwill in order to maintain positive relationships with their clients.If you are in the UK and looking for a reliable provider with good customer service and connections, as well as an excellent integration for Zoho and other CRMs, then I recommend Ringcentral."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deep South Auto Parts",
          "Nb_Reviews": 2,
          "Date": "2019-05-03T22:34:14.000Z",
          "Titre": "Dialpad could improve by firing…",
          "Contenu": "Dialpad could improve by firing everyone who answers a phone there and replacing them with test monkeys too dumb to be considered for cancer experiments...any primate with thumbs would be a considerable improvement.I've used their service for four or five months and every call to the so-called support team was a terrible experience. They are rude at the highest levels of that company.I paid for two lines at the annual rate and decided to find a different company after being disrespected repeatedly for asking simple questions about their poorly designed software. Since paying for the year in advance, one might expect a refund for the cancelled months, right? From a reputable company, yes. From Dialpad? That would be a no!When you ignore this review and buy the service anyway, don't expect a refund when you've had enough of the snarky remarks and passive aggressive comments from the children manning the phones over at Dialpad. This is because company policy only allows refunds to be given to those purchasing the month-to-month plans. However, they will do you a solid and escalate your refund request to a supervisor who will never get back to you with a definitive no. You'll figure it out when nothing happens.So, unless you enjoy being treated like a nuisance for not waking up the day after your purchase and having all the knowledge necessary to get the most from their service, DO NOT USE THIS COMPANY! Trust me, spend your money elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Robinson",
          "Nb_Reviews": 3,
          "Date": "2021-01-07T17:12:17.000Z",
          "Titre": "Worst of them all"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "robbie cloud",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T13:43:13.000Z",
          "Titre": "no nothing wrong just shy about Tuesday…",
          "Contenu": "no nothing wrong just shy about Tuesday because i wanted to stay home and i'm sorry females sometimes tuesdays are different but for me i could still stay home when wanted days off still."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Emilio Raul Izquierdo",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T17:34:15.000Z",
          "Titre": "Terrible Support,",
          "Contenu": "Terrible support, it's like pulling teeth to get a straight answer. The answers from support will also change depending on the agent you are connected with. At times you'll have to reference their own docs so that they get on the correct path. Very confusing billing processes. More often than not the invoices do not match the portal. Further, you cannot remove user access and licenses without losing all data associated to that user."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Raida Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T00:22:36.000Z",
          "Titre": "Used to be easy to chat with support",
          "Contenu": "I really used to like how easy it was to chat with Dialpad support by clicking Help and having the option to go straight to a live chat with an agent. It made things a lot more easier instead of being taken to a page where I have to go through Troubleshooting links, and nothing matches my concerns."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Dee Spang",
          "Nb_Reviews": 2,
          "Date": "2022-06-02T05:48:34.000Z",
          "Titre": "No better than any others - not fit for our purpose",
          "Contenu": "This product is not better than any other similar product.  I will say, it is much easer to use than GoTo Connect (avoid!).  Intuitive enough, but could be better.  Its so called link with your contacts database is poor and the support to fix issues is slow (still waiting after 2 weeks for a basic fix).  Its analytics is nothing more than smoke and mirrors, providing no real insights.  Overall, another product that doesn't live up to its own hype."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T20:38:10.000Z",
          "Titre": "Will not let me cancel account",
          "Contenu": "The service itself is decent but the customer service is horrible. They will not allow me to cancel my account and continues to charge me despite stating multiple times I no longer need the service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Heather Branstetter",
          "Nb_Reviews": 3,
          "Date": "2023-02-11T15:57:18.000Z",
          "Titre": "Technical support from the company is lacking",
          "Contenu": "Technical support from the company has been lacking. I have had problems dialing out and when I called the company they said there was no problem on their end. I lost clients. The issue was resolved months later when my company IT tech said to uninstall the phone app which severely limits my access to dialpad services while traveling. Recently, the desktop app was not ringing in properly and I was missing calls. After my poor experience with several technicians and my last issue I took the time to figure out the problem myself which took several days and many lost calls. When the product works well it's a dream! When it doesn't it's a nightmare and for a small business like mine major issues has financial consequences especially when this is a paid service that doesn't consistently work. The only reason I will renew the contract with dialpad is because it's the only company, that I have found, that is HIPPA compliant. And I have been offered an incentive to leave this review."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Pharmacy Bond",
          "Nb_Reviews": 10,
          "Date": "2023-06-07T18:51:45.000Z",
          "Titre": "Excellent but zero customer service",
          "Contenu": "We have been with this company for around a month and let me tell you this …Pros:* excellent software * clear voice * AI is very useful * mobile app and desktop app is fluid and works wellCons:* call queue is only available on the pro version ( in fact most useful features are only available on the pro version) * you cannot call and receive calls at the same time under one licence * additional users double the cost of the licence* NO CUSTOMER SERVICE ( no designated customer support number and you only find this out when you sign up)- customer support is only available to enterprises. As a pro customer you are not important and your business means nothing to them .You will have one point of call ( a lady called Charlene who is usually busy in meetings and I get the impression she is the only point of call for the entire uk customer base). She may refer you to customer support if she feels there is a need but this is the only way you will get referred to customer support- if you are lucky enough to get through to her. BASICALLY YOU DO NOT HAVE CUSTOMER SUPPORT !7.6.23. Thank you very much for taking the time to reply . I did what you said and you are right there is a number. However, it has taken me over a month and a somewhat a negative review via trustpilot to get this number and I should not have needed to go to such lengths to get this number. I won’t name her but the sales person who sold me Dialpad and who remained my first and only point of contact up to this point is very incompetent because she was very clear time and time again that there is no customer support for all customers except for the enterprise customers. I am now wondering what else she has misinformed me on. On trialing Dialpad I was given a particular price for the addition of sms and an additional line and a few weeks back when I reached out to add those services they suddenly multiplied by an factor of 3 and I’m now wondering whether these were correctly quoted. I would be grateful if you can either make contact or provide me with contact details so I can call you and double check a few points."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "nonono",
          "Nb_Reviews": 1,
          "Date": "2020-01-17T05:51:26.000Z",
          "Titre": "so much wrong",
          "Contenu": "so much wrong, so little help, very limited options overall.  I wish we had gone with another service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah Keller",
          "Nb_Reviews": 2,
          "Date": "2022-12-01T20:10:15.000Z",
          "Titre": "Wouldn't recommend",
          "Contenu": "Our company was forced to use this by IT to save money. We constantly have dropped calls and when I do connect, it takes up to 45 seconds to hear the customer and for them to hear me. Not a fan."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 2,
          "Date": "2021-05-27T11:17:02.000Z",
          "Titre": "I think the dialpad services are great but",
          "Contenu": "I think the dialpad services are great.  However, the app does not integrate into my computer very well.  Sometimes it opens on its own, other times it does not.  Sometimes I answer the phone and the person at the other end does not hear me.  I fish around and change things but it is never fast enough or very professional looking.  I am waiting for my computer guru to enlighten me as to why it will not act as transmitter when I answer. I have reverted to using my personal phone for business."
        },
        {
          "Note": 2,
          "Lieu": "PT",
          "Pseudo": "André Maurício",
          "Nb_Reviews": 1,
          "Date": "2020-09-12T19:42:16.000Z",
          "Titre": "Dialpad app for macbook is a cancer",
          "Contenu": "Dialpad app for macbook is a cancer. It blocks all computers, prevents them from shutting down and doesnt allow you to shut down the app either. I have tried many times to block it out of starting with the start of the computer but it eventually ends up on the allowed apps again. Very very bad"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Yoann Bohbot",
          "Nb_Reviews": 2,
          "Date": "2019-12-23T23:23:59.000Z",
          "Titre": "They say they do contact syncing...kinda, but not really.",
          "Contenu": "They say they do google contact syncing, but it only works for direct lines. If you are a team, this won't work for people that call your main number. You will only see the regular caller id for that number.The WIFI to Carrier switching doesn't work well, and you can't disable it.Support is very soso. There is no centralized place to see open tickets, so you are bombarded with emails, because they are really intaking specialists that ask you to do all the work, and then send you unrelated articles, after about 20 exchanges and 2 weeks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ally",
          "Nb_Reviews": 1,
          "Date": "2020-06-26T15:33:36.000Z",
          "Titre": "Disappointed",
          "Contenu": "When calling out, no one can hear me. The app will freeze often. Overall its a pain, im grateful to have something to use while working from home but there are so many issues. Hopefully things improve."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kassandra Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2019-02-26T21:48:38.000Z",
          "Titre": "Barely gets the job done",
          "Contenu": "Had their VOIP service for nearly 4 years. Not a huge fan of their customer service. They only have agents that communicate via email, and it's never timely. The agents were helpful, but it was just not the best way to receive technical assistance. It would take days to resolve a simple issue. In addition to that, their actual service was never reliable. There would be random times where I wouldn't get notified when a call would come in, or worse, I wouldn't get a call go through at all. There was also a bit of a lag in answering calls.As for their billing department, they nearly cancelled our service because we were short 15 cents one month. They also do not have an auto-pay option available."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Warren Ragoonanan",
          "Nb_Reviews": 1,
          "Date": "2019-02-26T21:18:36.000Z",
          "Titre": "We have several instances of really…",
          "Contenu": "We have several instances of really choppy audio.  More than once, we have had someone have to leave Uberconference and come back in."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "VEGA Partners",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T18:18:59.000Z",
          "Titre": "I haven't been able to port my google…",
          "Contenu": "I haven't been able to port my google number and help has been slow - 24 hours response between questions."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Matt",
          "Nb_Reviews": 3,
          "Date": "2022-03-09T15:05:11.000Z",
          "Titre": "Terrible UK sales & aftercare service",
          "Contenu": "Our organisation reviewed around 4 telephony providers and the demonstration we had from Dialpad was by be far the worst. It was disjointed / unprofessional and the account manager delivering the pitch really did not even know their own product. They couldn't answer many of our relatively basic questions which wasn't at all reassuring. Our stakeholders receiving the demo would have disregarded them as a provider immediately however, luckily for them, our head of IT had used Dialpad at a couple of previous companies and rated it extremely highly. He delivered separate demonstrations to our own internal teams after Dialpad themselves had butchered their presentation. He should have been on commission because he was the only reason we decided to go for it in the end.The product is in fact pretty good whilst at times can be a bit buggy. The transcription service which was the main thing they actually made a real effort to show us doesn't work at all, so we have just disabled it.We've had a few queries / requests after using Dialpad for a period of time - every time we've reached out to our account manager (same person as original pitch) we have just been ignored, or had to chase to finally get an answer weeks later.All the positive reviews on here seem to be outside UK so maybe it's just the UK operation that is poor, as the product is okay. If you want a decent telephony system Dialpad does the job, but if service means anything to you, then I would avoid."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Frustrated User",
          "Nb_Reviews": 2,
          "Date": "2019-10-03T02:36:18.000Z",
          "Titre": "Good idea, poor customer support, not a terribly user friendly interface",
          "Contenu": "My telco arranged for this service as an interim solution.We started on a 14 day trial.But we never received a notification that the trial was about to end, (I guess we should have diarised this) but then we were left without phone/telecommunications during business hours.I tried to log into the account to upgrade and pay, I couldn't log in. It just kept returning me to the login screen.When I spoke with online chat, they said that the account was cancelled.When I said I needed to gain access they said their billing people were gone for the day!!! :-OI said this wasn't good enough I was transferred to someone else who managed to get the account reactivated so I could log in and upgrade, which I did.The user interface doesn't really make that much intuitive sense to me (at least not from a desktop). You have to ferret around looking for options and then having to drill down and back up when you don't find them.I have also had prior online chat experiences that were variable in quality and effectiveness.The other factor is how strong your internet connection is overall as this is a voip system which required good internet. If you're not savvy in the slightest then don't use this service. If you have a little bit of know how, be prepared to have to spend time understanding how it works."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Sammy Simpson",
          "Nb_Reviews": 1,
          "Date": "2019-02-27T08:56:18.000Z",
          "Titre": "Delay in sound"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathan Gibson",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T22:43:11.000Z",
          "Titre": "I wanted a transcript of the chat but…",
          "Contenu": "I wanted a transcript of the chat but didn't get one and it disappeared before I could copy and paste it. Not a good experience. But the agent was great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T21:31:28.000Z",
          "Titre": "Updated 7-26-23 after Dialpad responded to this review",
          "Contenu": "UPDATE as of 7-26-23 - I am amending my 1 star to 3 stars as after posting this review Dialpad was extremely responsive in addressing my issues after going back and forth with my CSM and their contract team for over 2 months. They made some strong concessions in an attempt to honor our original agreement from last year when we upgraded our contract.We are continuing to work with them and I have no complaints about the product itself. It is awesome. However I would still warn others to read their contracts closely before signing up.---------------------------------------Watch out for the bait and switch and read your contracts closely. We have been happy with our experience with them up until this year. Have over 30 users on their platform and spend thousands with them. Never have I ever worked with a tech platform that will allow you to upgrade a users seat type BUT refuse to allow you to remove their old license. Forcing you to pay for 2 licenses for the same users even AFTER their sales rep sold us on the ability to add seat types to lock in lower pricing but NEVER mentioned we would not be allowed to remove the old seat type. CRAZY, they are going down hill fast, stay away!!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wes",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T22:48:03.000Z",
          "Titre": "Support was responsive",
          "Contenu": "Support was responsive, and I think they did all they could really on tracking down the issue. Could be better on trying to come up with a temporary fix.  If voicemail is down in this instance, is there anything else we could do?  I wasn't really sure on my end."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T07:16:48.000Z",
          "Titre": "5 star is typical but this is as of lately",
          "Contenu": "Typically your service would get a 5 star service, add on the pandemic constraints with over burdening and I would give you 6 stars. However in the last 2 weeks, service has had static, calls dropped and other issues. I still do plan on continuing to use, just hope that it returns back to the excellent service."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jeddore",
          "Nb_Reviews": 2,
          "Date": "2020-08-05T14:14:09.000Z",
          "Titre": "Great for the price, good overall.",
          "Contenu": "We've had a few hiccups with calls dropping, so we still use the virtual meeting program we used before joining Dialpad. However, this is still a great service for the price. We especially love the fun hold music and the other interactive features. Another thing I love is that anyone with a Dialpad account can create a meeting, whereas with the program we primarily use, it's locked to just a few accounts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Franklin Fooder",
          "Nb_Reviews": 1,
          "Date": "2020-08-20T13:38:33.000Z",
          "Titre": "works well, but with one big caveat",
          "Contenu": "In general, I like UberConference. Performs well, and support is good. But I just learned something that is troublesome, and everyone should know. UberConference allows ANY PARTICIPANT to mute any other participant. That's nuts. Muting should be the responsibility ONLY of the organizer. Goodness knows what the UberConference designers were thinking of when they allowed this. This allows any random invitee to screw up the whole telecon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dulce",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T03:03:32.000Z",
          "Titre": "Get's the job done",
          "Contenu": "Dialpad gets the job done. It does get a lot of spam calls throughout the day but other than that it performs well. There have been some glitches, and after a restart everything is running smoothly again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T22:27:29.000Z",
          "Titre": "I would like to have multiple contacts…",
          "Contenu": "I would like to have multiple contacts on same call - conference call - down load on home computer, when I am working from home, I can answer on computer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lin",
          "Nb_Reviews": 1,
          "Date": "2020-01-16T06:47:08.000Z",
          "Titre": "Has potential but needs improvement",
          "Contenu": "I've used the system several times and my client calls have been dropped during conferencing. The connection seems to be unstable. I also don't like the browser limitations."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T19:23:26.000Z",
          "Titre": "I loved a ton of things about Uber…",
          "Contenu": "I loved a ton of things about Uber conference, but the reality is, every client had a hard time connecting because of the variation between mobile and desktop connection, etc."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T18:33:31.000Z",
          "Titre": "Everything is great for the price…",
          "Contenu": "Everything is great for the price except for one issue I face sometimes. The phone doesn't ring but shows a missed call. Apart from that I think it's a nice service!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maria Claudia M",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T00:20:11.000Z",
          "Titre": "I have used Dialpad for 2 years",
          "Contenu": "I have used Dialpad for 2 years. It is really user friendly and great for companies. I would not use it for large call centers."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Martin",
          "Nb_Reviews": 2,
          "Date": "2020-01-21T17:53:12.000Z",
          "Titre": "First connection had a lot of static",
          "Contenu": "First connection had a lot of static, reconnected good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Delaphous Solutions LLC",
          "Nb_Reviews": 1,
          "Date": "2021-10-04T04:09:37.000Z",
          "Titre": "Trial Reveals All",
          "Contenu": "I like the freedom that this company offers, however, the navigation is fairly tricky. It's hard to differentiate incoming and outgoing calls, texts, etc. I don't believe it's mobile-friendly. I have the number on my website so ill try to adapt for now. I will say that customer service is always available. That's a pro."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "lavender heather",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T18:46:02.000Z",
          "Titre": "not as good as it seems",
          "Contenu": "The phone apps are often glitchy and frustrating to use.  There is no automatic call recording on individual lines so when you transfer someone to another employee the call recording stops unless they remember to turn it on.  Admin can't access call recordings on individual lines. You can't bulk download your recordings making it extremely difficult when an employee leaves"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T21:04:16.000Z",
          "Titre": "In my brief experience with this phone",
          "Contenu": "In my brief experience with this phone, I've discovered it is very difficult to keep the transcript off of the screen I'm trying to see while talking to the person on the phone. I can't move the little box anywhere on my screen so I can see it, it's either in the upper left hand corner or maximize it and pull it down to the bottom. It won't stay there, it keeps popping back to the top. I haven't gotten that many calls yet, but that is the thing that sticks in my crawl..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jayj",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T21:45:38.000Z",
          "Titre": "Setup and transition and price",
          "Contenu": "I love everything Dialpad has to offer and it has definitely helped our business in being able able to weed the slackers out. I give 3 stars because set up and transition was not as easy as described. I will say that their tech support is great thou. Dialpad is a little pricey too."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "April",
          "Nb_Reviews": 1,
          "Date": "2019-01-22T13:05:52.000Z",
          "Titre": "Needs better Call Quality",
          "Contenu": "There are many features of dialpad that are extremely useful for a customer service team. For example, I can have a group of users assigned to a number and ring all of those people when someone calls. People can be easily added and removed to the call group. What I don't care for is the call quality. There are delays that are disruptive to the flow of a call."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Bríd",
          "Nb_Reviews": 1,
          "Date": "2019-01-31T00:49:49.000Z",
          "Titre": "The experience of Dialpad",
          "Contenu": "The experience of DialpadMy experience with Dialpad is generally pretty good. It functions well most of the time, and I love the connection to Salesforce and its ability to pull contacts from that.However, I do find the delays in the service are sometimes more common than I would like, and the line can be very crackly at times."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Katie Strzeszewski",
          "Nb_Reviews": 1,
          "Date": "2019-02-27T16:01:17.000Z",
          "Titre": "Service is rather spotty",
          "Contenu": "Service is rather spotty. The desktop app is prone to freezing and randomly disconnecting from my mic and headphones. I end up taking quite a few calls on my phone app due to this. The phone app is spotty as well - sometimes it takes AGES to connect and make the call, and sometimes the call goes through immediately but has no audio. It's rare that I make a call from the phone app and it works perfectly on the first try. And it's even worse when an update rolls out - that just makes things all sorts of wonky."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chase",
          "Nb_Reviews": 1,
          "Date": "2018-10-25T14:23:39.000Z",
          "Titre": "Good service at reasonable price, but some support and admin issues",
          "Contenu": "Service works well at a reasonable base price. Admin console could use a lot of updating so that admins are able to make more changes without having to email into support. Recently started charging for held/unused numbers on accounts and didn't communicate costs until after we were charged."
        },
        {
          "Note": 3,
          "Lieu": "HN",
          "Pseudo": "Airington law office",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T18:57:14.000Z",
          "Titre": "App issues",
          "Contenu": "App issuesI have problems where I cannot disconnect the calls, regardless of where I am using it, the website, or the desktop. Also will be great to set up the recording of the calls automatically instead of activating it individually for each"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "charlie",
          "Nb_Reviews": 1,
          "Date": "2019-04-15T17:48:44.000Z",
          "Titre": "Really good, need improvement",
          "Contenu": "Really like the platform; allows fast way for users to connect by phone and online. Generally really pleased with it. However, sometimes the Google Calendar plugin does not function correctly, it stops broadcasting the screenshare, or the screenshare freezes for the viewer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "C. Beard",
          "Nb_Reviews": 1,
          "Date": "2019-03-04T15:05:29.000Z",
          "Titre": "Dialpad is great if you are operating…",
          "Contenu": "Dialpad is great if you are operating on a budget.  The only drawback I have is that its not stable all the time.  It will go down when you least expect.  The sound quality can fade once you answer.  But its great if you are on the road and need to keep up with calls."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "John McIver",
          "Nb_Reviews": 1,
          "Date": "2019-02-26T21:21:51.000Z",
          "Titre": "Good customer service, some connection quality issues.",
          "Contenu": "Very good customer service, feel like they really care. That being said, I do often have connection issues on my calls. Understandable as the service is reliant on a good internet collection, but that is what is stopping me from marking my rating higher."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "QQFS Panel",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T13:24:00.000Z",
          "Titre": "Dialpad had issues connecting to 049…",
          "Contenu": "Dialpad had issues connecting to 049 numbers in Belgium, which is operator Orange, from our company's Belgium Customer support channel. - My original ticket included ONE OTHER number and the first support person only tested that and said \"it is invalid yes. most probably 493, 495, 497, 498 are also not active numbers. I don't see any problem with her account\" - Then Nicole W Came through and actually tested this, fixed the issue and made it work! She's a star! This whole ordeal took 4 days. I do not applaud the lazy first worker Rand, who should be getting training on what his job is.The only reason they got 3 stars is because of Nicole, who would have gotten 5 stars if I could rate only her performance."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2018-10-25T20:28:52.000Z",
          "Titre": "I use dialpad for work",
          "Contenu": "I use dialpad for work, and it works when I need it to but sometimes notifications do not coming through on my phone which can cause me to miss calls etc. I would prefer if the integration with iphones was a bit better. Otherwise, it works well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2019-01-24T21:18:24.000Z",
          "Titre": "Dialpad Takes the Telephone back 25 years",
          "Contenu": "Dialpad isn't a fully developed application.  Constant dropped calls, terrible customer service, sales reps have no idea how to describe new features.  Overall, wouldn't use this if I didn't have to."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2018-10-25T11:30:57.000Z",
          "Titre": "Every time it updates it puts shortcuts…",
          "Contenu": "Every time it updates it puts shortcuts on my desktop and the icon disappears from the system tray and I have to put it back to visible.Inability to share screens like Skype, Webex, or Uberconference."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 1,
          "Date": "2020-11-30T14:23:30.000Z",
          "Titre": "I really wish that our customer service…",
          "Contenu": "I really wish that our customer service reps that answer the phones could see who the other reps are on the phone with.  Right now, they cannot see which customer they are on with."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T19:45:00.000Z",
          "Titre": "Needs some work but overall good product",
          "Contenu": "Great service and little to no downtime and easy to implement/train users on. We have it integrated through ServiceTitan so a lot of the admin features/settings are not available to us (not sure if that is ServiceTitan or Dialpad). The integration with ServiceTitan could be better or more integrated (again not sure if that's Dialpad or ServiceTitan related or both). Reporting is very cumbersome and not user friendly. Lacks some obvious features of other contact systems especially when it comes to IVR, reporting, and Admin settings/functions. There is some work to be done to compare/compete with other contact systems, overall we are happy with Dialpad especially with it being \"partially\" integrated with ServiceTitan and how easy it was to implement/train/use the system for 50+ users"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 1,
          "Date": "2019-02-26T21:22:03.000Z",
          "Titre": "We drop a lot of calls which is super…",
          "Contenu": "We drop a lot of calls which is super frustrating in a sales & service environment. Other than that the functionality of the system is quite robust."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Betty Lee Virtus",
          "Nb_Reviews": 1,
          "Date": "2019-03-05T22:00:22.000Z",
          "Titre": "Like it but have some issues at times",
          "Contenu": "We chose dialpad so that we had a flexible phone system for the changes that were planned in the business.  The change came in combination with a Sprint business account.  We learned that Dialpad will not work with our server/cloud situation due to the software we use to connect to our server sessions.  Headsets do not work on the server sessions, we have to use the app on a desktop and open another window to access our information on the server session.  We have figured the solution on our own but find that we cannot always answer the phone when it rings without having to refresh the app - missing inbound calls..  Using Dialpad on my cell phone is not  easy.  I am lucky if I successfully answer 1 in 10 of the calls forwarded there.  Most of the time, the outbound calls are just fine and once we get into our work, we have adjusted to the way we have to use our server session and the dialpad desktop app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Property Manager",
          "Nb_Reviews": 1,
          "Date": "2019-06-10T23:04:46.000Z",
          "Titre": "Works great (most of the time)",
          "Contenu": "Occasionally, phone calls don't come through consistently (they show up as a missed call) but other than that it's been great!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott Perman",
          "Nb_Reviews": 1,
          "Date": "2019-03-06T00:20:50.000Z",
          "Titre": "Good if you only have a few users",
          "Contenu": "Good if you only have a few users, but not a substitute for a real phone system.  There is no way to park calls or page other phones."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dialpad user",
          "Nb_Reviews": 1,
          "Date": "2018-10-25T13:14:37.000Z",
          "Titre": "Not great",
          "Contenu": "We consistently have issues with Dialpad as a company. We often have to restart and troubleshoot. It is an issue on a recurring basis."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jawar Nelson",
          "Nb_Reviews": 1,
          "Date": "2019-03-05T21:16:03.000Z",
          "Titre": "NOT killing the desk phone",
          "Contenu": "I read on your website or somewhere at one time your motto was \"Killing the desk phone\" Every desk phone I have ever used, included a speaker phone option available at the touch of 1 as in SINGLE button. I suggested that feature to your company last year when. I consider it a basic phone feature you should included in version 1. Why do we have to contact you to move licenses from 1 site to another. That is just stupid and antiquated way of thinking. Your product idea is great but it needs a lot of improvement. I find your GUI complicated and kind of cumbersome. Some listed options don't even work as an average person would expect. Another good example is that the app is not keeping user settings after updating.The address book is another thing. I hate about the app. 1st it doesn't respect Call as XXX settings when calling(out) to people. 2nd One contact is duplicate 2, 3 or more times for some users.Your applications GUI, call dropping etc is why some people in our company are actually opting to keep their desk phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Landstar",
          "Nb_Reviews": 1,
          "Date": "2019-06-17T16:24:53.000Z",
          "Titre": "Dialpad Year In Review.",
          "Contenu": "Have Had dialpad for over a year now for my small business with 3 employees. Its spotty to say the least. When it's good it's great and when its bad well... Call Quality is always amazing. My major complaint is with the Windows desktop app. when we call out it activates the headset linked to our PC, Sometimes when we call out the app will start to dial out, stop then dial out again within a 1 second period of time. this happens so quickly it triggers the headset to turn on, turn off and doesn't get the turn-on signal again. Customer service always seems like they are out on errands most of the time too or not to concerned with the issue. they have never completelypushed me aside and always came through for me however they always seem like they got better things to do. Moble app honestly has never failed me. Pretty much always realible. Very modern look which i like alot. This product is very appealing to business/ proffesionals of any trade with its look. All in all with all things considered I Would Recommend this product to anyone needing a cloud phone based system however it could use some bug fixes and attention to the desktop app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tyler S.",
          "Nb_Reviews": 6,
          "Date": "2019-10-24T01:46:02.000Z",
          "Titre": "Mixed experience",
          "Contenu": "I've been using this as the main phone & SMS tool for my small online business for the past 2 years or so. In theory, I love the concept of VOIP for my business with everything handled online, and I think I chose them also because they support integration with my Obi device that allows me to use a traditional phone/headset with a VOIP service.In practice, it's just been ok. Lots of bugs, in my opinion, and I really haven't seen much progress with them. For example, I don't get most missed call notifications from the Mac desktop app so I have to open the app to check all the time. The organization across \"departments\" (i.e. different call menu options) is not intuitive. Sometimes the landline doesn't ring. And now for almost a week my texting did not work and I didn't even know the first couple of days as there was no error message, so I probably just missed some business / frustrated some potential customers. And then their customer support was slow and not that helpful.I hope they get new management to really nail this product for small online businesses like ours, or otherwise I will search for a better service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Davis",
          "Nb_Reviews": 2,
          "Date": "2019-02-26T21:14:00.000Z",
          "Titre": "Texting and use of features is great",
          "Contenu": "Texting and use of features is great, but call quality is subpar. More dropped calls than completed calls."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2019-06-17T20:36:36.000Z",
          "Titre": "Very acceptable voice conference for the money",
          "Contenu": "Very acceptable voice conference for free. Quality of screen shares needs to be enhanced."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Mahbubul",
          "Nb_Reviews": 1,
          "Date": "2019-06-11T00:57:29.000Z",
          "Titre": "Uber is see awesome",
          "Contenu": "Uber is see awesome. The only issue is that the recording does not record screen share."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel K",
          "Nb_Reviews": 2,
          "Date": "2019-03-05T21:24:57.000Z",
          "Titre": "When you dial out it shows an out of…",
          "Contenu": "When you dial out it shows an out of state  number which is annoying."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Anu",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T02:34:14.000Z",
          "Titre": "It gets hang sometimes and I have to…",
          "Contenu": "It gets hang sometimes and I have to delete and download it again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shiloh Hour",
          "Nb_Reviews": 1,
          "Date": "2019-03-14T23:02:53.000Z",
          "Titre": "We have too much noise I have…",
          "Contenu": "We have too much noise I have complained but no body cares to help"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doug Lassiter",
          "Nb_Reviews": 3,
          "Date": "2019-10-21T16:08:10.000Z",
          "Titre": "I've been using UberConference for professional telecons with 30-40 people",
          "Contenu": "I've been using UberConference for several years for a weekly professional telecon involving 30-40 people. In general, it works well. The recording option is excellent, and high quality. The phone line connections are almost always very good. That being said, a few months ago they did a big changeroo, in which control is now with a local app rather than an online web page. They did that with no warning. Just *poof!* you gotta be using this app! The new app works, but is less capable than the original implementation. One thing REALLY pisses me off. The original Uberconference used to have, in one corner of the page, an indicator of who is talking now, and who was last talking. That is now gone. The indicator of who is talking now is where the participant icon is highlighted. Now, these icons are big, and there are only eight or so on a page. So if you have a telecon with 40 people, and you want to know who is talking, you have to quickly scroll through all the icons to look for the one that is highlighted! But even worse is noise management. With forty people on the line, someone always has background talking, a barking dog, or something. You want to mute them. The indicator of who was last talking (or, interrupting, as it might be) was a great way to do this identification. That indicator is now GONE. So now, while the noisemaker is occasionally making noise, you have to quickly scroll through all the icons to see which one gets briefly highlighted when the noise is happening. This is AWFUL for noise management! I have complained about this to UC, and they say \"thanks, we'll think about it!\". Crapola. I'll probably be looking for a service that does things the way UC used to responsibly do it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T21:48:55.000Z",
          "Titre": "It's good",
          "Contenu": "It's good, but sometimes too many options!"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Mauro",
          "Nb_Reviews": 1,
          "Date": "2018-11-01T13:43:12.000Z",
          "Titre": "some noises in calls"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Anwar White",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T14:07:51.000Z",
          "Titre": "Asked for a refund because I had to let…",
          "Contenu": "Team was great during onboarding.Asked for a refund because I had to let my sales team go and they refused to provide it. I did end up receiving the refund but it took more effort than it should have."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EGEM",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T18:26:19.000Z",
          "Titre": "Great, but issues.",
          "Contenu": "Overall, great service.  But, not perfect.  Loved that you didn't need a pin to dial-in until Chinese robocalls / war dialing started back in October 2019.  Wish you could block foreign calls.  Also, managing contacts is weak.  Always typing names for each meeting for known numbers.  Lastly, can't have multiple users manage a single number.  So, you have a single point of failure for reoccurring meetings."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kaela Bath",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T21:37:07.000Z",
          "Titre": "Helpful",
          "Contenu": "For the most part, Dialpad is a helpful resource! My only complaint is that if you don't have the application fully open, and a call comes through, the application doesn't open up for you. Then the notification goes away so there's no way of knowing then the caller or if the call connected (which takes a few seconds, which is fine but obviously could be better). The transcription of the call is very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Martin",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T13:14:14.000Z",
          "Titre": "Pleased overall with Dialpad",
          "Contenu": "We are pleased overall with how Dialpad performs in our business communications. The ability to place a phone call to technical support is great, compared to Vonage, which only has chat support for small businesses. While the mobile app for iOS has worked excellent, the app for Windows desktop has consistently given issues, not sure why."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 1,
          "Date": "2020-01-27T16:11:36.000Z",
          "Titre": "Everything generally mostly worked fine, although there are some problems not resolved.",
          "Contenu": "Everything mostly worked fine, although there were audio difficulties with one person who could hear us but the rest could not. Not sure what the problem was. Another person does not want to connect by computer, having had problems connecting. We think it has something to do with his browser being Firefox, but we aren't sure."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Shenru Hu",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T04:58:01.000Z",
          "Titre": "Amazing service, but high pricing.",
          "Contenu": "So far, I haven't had any issues with them. Whenever I had issues, I just gave them a call, and it was resolved within minutes. However, the pricing is quite high compared to our previous provier, but with AI transcription and all those creature comforts, I can find the pricing justifiable."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Patrick M",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T21:42:31.000Z",
          "Titre": "Pros & Cons",
          "Contenu": "PROS:- Simple enough to use platform- Good prices- Lots of simple customization- Can get hold of Customer Support easily CONS:- As per other comments, getting a helpful answer from Customer Support is difficult. They only read the same stuff I can access myself online. Also the answers differ from person to person- The definitions to certain objects is far too vague and their team cannot give you a clear answer. EG: What is 'Auto Transfer'? Is this within my control or not? No clear answer about what it is or how I can improve it.- CSM support leaves a lot to be desired. I have stopped contacting them for the past few months and mainly research myself, or call Customer Support if needed. Last resort is CSM."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "American Business Funders",
          "Nb_Reviews": 4,
          "Date": "2023-02-08T15:38:06.000Z",
          "Titre": "Dialpad is very worth using!",
          "Contenu": "I recently switched VOIP services to Dialpad. The reason to move was an easy one, everything that they lacked, Dialpad has! Fantastic UI/UX, easy to navigate, intuitive phone app, easy integrations to CRMs. Clear calls, on the Windows app, web app, desk phone and phone app.I will increase my review to 5* once they have 100% integration with Yealink. Setup was REALLY simple, too. It works great with the physical phone, but the button on the headset doesn't work to hang up or answer from the Windows app yet. (And I know they're working on this, as of Feb 23.)"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "SUBWAY Thirroul",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T15:15:11.000Z",
          "Titre": "Great app at best price in market",
          "Contenu": "Great app at best price in market! Loads of features to suit your business needs. Only issue we had faced & reported but not resolved is call volumes on Andriod phones is extreemly low, can only use on speaker. On the other hand Windows app is flawless!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Catherine Alin",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T23:20:05.000Z",
          "Titre": "Overall it is a great phone program",
          "Contenu": "Overall it is a great phone program, and being able to text is beyond helpful, and it's so easy to add contacts to keep track of clients. Sometimes it is a little glitchy though, and though I haven't had major problems, it isn't perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Monteiro",
          "Nb_Reviews": 2,
          "Date": "2020-08-04T19:28:07.000Z",
          "Titre": "If you are looking for a straight…",
          "Contenu": "If you are looking for a straight forward conference calling solution, for a smaller number of people, this works great!  I have not tried using it on a larger scale group, so it may work for that too.  But, it has it voice intelligence solution built in to help transcribe the call, an action items list to help to take notes while in the platform so you can focus on the call/video at the same time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T19:52:27.000Z",
          "Titre": "Excellent tool for free conference call…",
          "Contenu": "Excellent tool for free conference call management.  Our small firm has been using UberConference for about a year without problems (the only caveat is calls are limited to 45 minutes in free version).  Good control tools while on the call, screen sharing and reports."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Evelyn",
          "Nb_Reviews": 2,
          "Date": "2020-01-14T20:52:43.000Z",
          "Titre": "The conference line has always been…",
          "Contenu": "The conference line has always been very clear and uninterrupted.One of the features that we like best is that you do not have to use pin to join the conference line.The new website looks great too.Can payment be made in Canadian currency since we live in Canada and use Canadian Dollars?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam Wacker",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T15:01:48.000Z",
          "Titre": "Dialpad's desktop app is the best…",
          "Contenu": "Dialpad's desktop app is the best aspect of Dialpad. Easy call transferring, robust settings options, and solid call connection. The mobile app and Zendesk integration are not as friendly, especially the mobile app which seems to have a really hard time connecting to calls."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R.",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T22:33:36.000Z",
          "Titre": "Dialpad has been very helpful",
          "Contenu": "Dialpad has been very helpful in contacting clients. I use it daily to connect with clients. At times it can be a little confusing to navigate but after a little practice, it has become an integral part of my work day"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristen Swanson",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T00:28:17.000Z",
          "Titre": "I use dialpad for work",
          "Contenu": "I use dialpad for work, It is awesome that it records calls and stores them for future. We also send all calls to a specific email. The only drawback are 1. we can only text one at a time, so when doing reminders, we cant send all at once. The other is that we cant archive anything, so if we need to followup on a call, we have to search through all calls to find, and kep a separate journal to know who to follow up on. If you have more than one person checking calls, this is hard to share everyones journal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Whitney",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T20:25:17.000Z",
          "Titre": "Dialpad has been very useful",
          "Contenu": "Dialpad has been very useful, but it's pricey! We have loved the features and how it integrates into our Salesforce solution. However, its pretty pricey and it costs our small nonprofit a good amount just to use its basic features."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ren",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T21:55:48.000Z",
          "Titre": "Less Complicated in Some, More in Others",
          "Contenu": "Dialpad is genuinely a great service, specially in their customer service front. However, nothing can be perfect, and the system does have its ups and down, like only having a minimum of 4 digit extensions, only able to do blind transfers, room phones are kinda annoying to set up and use, and finally, for whatever reason, whenever i finish setting up a desk phone, I'm unable to every access the phones IP Config Utility again.While the service is great, after talking to them for various things, their support team is honestly just reading what's on the help center verbatim.Another very frustrating thing is that there is no way to directly contact the porting team. This has caused completely avoidable issues many times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emily Toenjes",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T21:34:13.000Z",
          "Titre": "Love Dial Pad",
          "Contenu": "Love Dial Pad! It delivers and works well with our company, I didn't give 5 stars only because of the upcoming text message changes that don't have anything to do with how we do work.Works well, would recommend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T19:54:28.000Z",
          "Titre": "Easy to use and record calls",
          "Contenu": "I enjoy using this service because it is easy to use and record calls. The sound quality is good, and of course the price is great! The only downsides: 1) the log in experience--difficult to log in online; I have to log in by phone, and then wait to be connected to my conference line. And 2) you can't send out recordings to participants."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Salmon",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T17:33:46.000Z",
          "Titre": "Works great",
          "Contenu": "Works great, I've used a lot of other 'dialers' and some don't have VM capability, which is crazy to me?! This one works great, I use it in conjunction with SalesForce and I wish it had some better integrations with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Greenbaum",
          "Nb_Reviews": 10,
          "Date": "2023-01-27T01:23:23.000Z",
          "Titre": "Good Service",
          "Contenu": "Okay. I'm sold. While I wish there were more pro features in the standard plan. Dialpad is pretty on point with calling and AI. It's not perfect, and there's room for improvement (and the taxes were 150%), but overall, I do recommend giving them a look."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Irv",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T19:57:21.000Z",
          "Titre": "Recent software changes took a while to…",
          "Contenu": "Recent software changes took a while to get used to.  Conference calling works well, except when they change your phone number effective January 1, notify you on 12/31, and you have meetings already scheduled with the old number on 1/2 !!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kleiton Soares Santos",
          "Nb_Reviews": 2,
          "Date": "2022-08-26T23:55:08.000Z",
          "Titre": "It's excellent.",
          "Contenu": "It's excellent.Best phone service we could get for our company. The only reason I'm giving 5 stars is that the app on the mobile phone isn't great for calls, most of the time there is a delay. Other than that it's fantastic!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Local Reviewer",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T17:04:12.000Z",
          "Titre": "Overall very efficient, with click-to-call and voicemail drop features",
          "Contenu": "This calling software has been very helpful for my job for a call center. Compared to the previous call software that was used, the DialPad functions of click-to-call and voicemail drop have increased productivity. I like that identifying our different calling projects by name and phone number can easily be done and updated as often as needed by my supervisor. My company uses DialPad in its basic capabilities, but I can see there are options for receiving calls, receiving voicemail, call transcripts, call summaries, and more. My only feedback for improvement is that sometimes loading the software, and the connectivity for some calls, isn't as clear or as fast as I would prefer, but that also may be due to my Internet service. Overall, I'd give the software an A-."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 2,
          "Date": "2020-01-14T19:01:54.000Z",
          "Titre": "Simple way to conference",
          "Contenu": "Easily accessible for callers, decent price. I like that I can cancel anytime and not incur any extra fees. Also, like that when I need it again, the price is the same and there are no additional fees to restart service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Wellington",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T23:18:22.000Z",
          "Titre": "Love how conversations are transcribed…",
          "Contenu": "Love how conversations are transcribed really really helpful. I wish there was a way to add notes on a contact as well. Very useful app highly recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marina",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T19:36:01.000Z",
          "Titre": "I use uberconference regularly and it…",
          "Contenu": "I use uberconference regularly and it works well.  I would like to be able to see why another user is having trouble with their camera or audio, otherwise I would rate as 5star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nat Lsll",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T01:28:40.000Z",
          "Titre": "I've been using Dialpad for a couple of…",
          "Contenu": "I've been using Dialpad for a couple of years now and never had any issues. Customer service is excellent and everything works very well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob V.",
          "Nb_Reviews": 2,
          "Date": "2020-01-14T18:18:57.000Z",
          "Titre": "Outstanding!",
          "Contenu": "The reliability and convenience and quality of Uberconferences, and the reliable recordings that come out of them, are terrific - second to none. I was impressed yesterday that when my Internet connection dropped for a few seconds, the recording continued, and I neither lost the first part of the conversation nor had to do anything to pick up the second half after the restore. The service would be perfect if I could use it to call out to interviewees, rather than force them to call me. But I'm sure you hear that a lot, and in all other ways count me as a big fan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T23:49:04.000Z",
          "Titre": "Small Business Software moving towards Enterprise",
          "Contenu": "Dialpad is one of the best soft-phone/VoIP systems out there and the first one we started using around 2016 after upgrading from our analog system. We still find value utilizing this system, even at the steep-ish price we pay yearly. I'm glad of the route we went, if we ever go to self hosted or have or own PBX, we'll know what kind of features we want versus what we need.The features we use are great like group calling / ringing groups (departments), auto recording for said departments, call transferring (hard transfer only), auto attendant, open/closed hours, hold music, set holidays and more. The integrations are great as well, especially the HubSpot integration so that the team sees that call historical data of a contact so that we are on the same page. The analytic reports are nice so you can see trends (I can see when we typically see more or less calls depending on the day, month, year and now compare years). There isn't much to complain about except for the price. Maybe if they had a self hosted option that would be cool at a lower rate. Something to where the company has more control over it's data. Also their voice transcription sucks, it's funny to read them sometimes because they are so off. Overall it's probably the best soft-phone SaaS out there, but make sure to explore the options."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dwayne Corley",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T23:00:44.000Z",
          "Titre": "Account Cancellation",
          "Contenu": "I got what I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joy Dillon",
          "Nb_Reviews": 2,
          "Date": "2023-02-07T22:10:51.000Z",
          "Titre": "I like them",
          "Contenu": "I like them. The ease of calling and messaging is fantastic. I do wish it was a bit better about showing up as scam to some people, but I imagine there isn't anything to do about that. I do like the way you can send a message to the IT people easily if needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clarissa",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T20:56:35.000Z",
          "Titre": "User-friendly and convenient",
          "Contenu": "Uber Conference is very convenient to use for group conference calls. The ability to schedule them ahead of time and have the app send out reminders with the call-in info is very convenient for the host. The clarity of the calls is great, as well as the hosts ability to control the call features such as recording or muting. My one complaint is that when participating in a conference call via the app, I have had my phone’s screen auto-lock, which then mutes me and makes me unable to hear the other participants and the only fix I have found of force-closing the app and rejoining the call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shamia Watson",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T21:35:18.000Z",
          "Titre": "Dialpad is user friendly",
          "Contenu": "Dialpad is user friendly. It works as expected and callers are not given a prompt of what service you are using, like other apps do."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Graves",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T16:23:08.000Z",
          "Titre": "Love this and works perfectly.",
          "Contenu": "Love this and works perfectly for all my business phone needs. The only issue that I have is that everytime I open it up I get hints on the account, searching and inbox and I can not figure out how to get it to go away. Other than that, very happy."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T07:17:54.000Z",
          "Titre": "Dialpad is an excellent VOIP provider…",
          "Contenu": "Dialpad is an excellent VOIP provider and it has improved our sales operation's efficiency and productivity. Onboarding was relatively simple and the interface is logical and easy to use for staff of all proficiencies. The mobile app is excellent and works perfectly alongside the Windows app. The only negative points for us were issues with billing in the first 6 months, related to the custom package which we were sold and Dialpad's initial inability to bill correctly, and the imperfect Salesforce CTI which still has some limitations which our team have to work around. Overall I would not hesitate to recommend Dialpad."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "XT wang",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T05:37:42.000Z",
          "Titre": "Overall very reliable",
          "Contenu": "Overall, very reliable service and it gets the job done, would like more features and easier UI, phone app some time has delay before I can hear the other end, transcript feature is amazing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Southeastern",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T18:21:28.000Z",
          "Titre": "Great Conferencing Tool",
          "Contenu": "This is a great conferencing tool that allows for the recording and the transcript to go out immediately following the call. The only thing that would make it better is if it was free."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T17:04:34.000Z",
          "Titre": "Awesome!",
          "Contenu": "Love that you can use the application or even on the internet browser if needed.  Use it for my primary internal communication."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ED",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T18:19:41.000Z",
          "Titre": "What's different?",
          "Contenu": "Its a nice platform but logging in/getting prospects in can be inconvenient. Also, platforms like Google Hangouts are free and offer very similar experiences."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shanyce Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T21:48:43.000Z",
          "Titre": "Awesome for our company!",
          "Contenu": "Dialpad is handy and easy to access/operate especially for the remote first company that I work for. I specifically like the feature that transcripts voicemails without listening to the actual voicemail, which comes in handy when receiving a call during a virtual meeting. I also enjoy the feature when transferring a call, you have a variety of options that include transferring the call immediately or contacting the recipient first to see if they are available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lorraine Marcano",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T15:56:12.000Z",
          "Titre": "Having Dial Pad has been an asset in…",
          "Contenu": "Having Dial Pad has been an asset in our office.  Our clients love that they can text us as well as call our office."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T01:49:58.000Z",
          "Titre": "Sometimes the sound quality is not…",
          "Contenu": "Sometimes the sound quality is not always good. Mostly it is fine!It is reliable but very occasionally the call can drop off."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T15:55:42.000Z",
          "Titre": "I love the concept and the service this…",
          "Contenu": "I love the concept and the service this offers. I would give it 5 stars except the settings are not clear or easy to navigate. I think it could use some wording changes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T19:11:51.000Z",
          "Titre": "We are new to Dialpad and have really…",
          "Contenu": "We are new to Dialpad and have really enjoyed it so far! It allows for easy transfers between team members and the guides are so easy to follow!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T20:54:54.000Z",
          "Titre": "Recording quality is pretty good",
          "Contenu": "Recording quality is pretty good. Easy to use, don't get dropout. Automated transcripts are pretty useless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PAULA",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T22:00:52.000Z",
          "Titre": "Very versatile",
          "Contenu": "Very versatile and you can see who's on the call and even record the call to send out to those who couldn't attend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ClikFocus",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T18:03:44.000Z",
          "Titre": "Pretty solid, only minor challenges",
          "Contenu": "Some connection challenges from time to time, but pretty rare and generally a very easy program to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Paul",
          "Nb_Reviews": 2,
          "Date": "2022-09-01T18:42:36.000Z",
          "Titre": "DialPad is great for calling…",
          "Contenu": "DialPad is great for calling internationally. I think it's a solid product and my preferred calling app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T16:53:30.000Z",
          "Titre": "I think it's really great",
          "Contenu": "I think it's really great!  Sometimes connectivity and delays can happen, but the user interface is great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Francie Roush",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T03:41:21.000Z",
          "Titre": "I love the integration with other…",
          "Contenu": "I love the integration with other platforms. Very user friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leo Mindlin",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T18:07:04.000Z",
          "Titre": "The core software is terrific",
          "Contenu": "The core software is terrific. Admin and Meetings can use some improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pastor",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T17:58:00.000Z",
          "Titre": "UberConference - Great!",
          "Contenu": "We  really like UberConference. They have met a great need in our ministry."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HG",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T20:14:02.000Z",
          "Titre": "New user",
          "Contenu": "My employer just provided us with Dialpad and it seems very easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Hauch",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T19:08:40.000Z",
          "Titre": "Oliver was helpful and quick to respond"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Arturo",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T19:20:58.000Z",
          "Titre": "Most of the time it was great",
          "Contenu": "Most of the time it was great, except for a couple of calls where the quality was not that good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Eagleson",
          "Nb_Reviews": 2,
          "Date": "2023-02-07T22:18:53.000Z",
          "Titre": "Satisfied!",
          "Contenu": "to date we have been quite satisfied with the platform!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lamonte",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T00:17:05.000Z",
          "Titre": "Pretty good so far",
          "Contenu": "Pretty good so far, just wish it was cheaper since we only use it maybe twice per month."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karla M.",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T21:02:07.000Z",
          "Titre": "Great experience",
          "Contenu": "Have had a great experience using dialpad, has some pretty neat features that make documenting information during calls easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sameh",
          "Nb_Reviews": 1,
          "Date": "2020-01-16T17:24:35.000Z",
          "Titre": "some reliability issues comes and go",
          "Contenu": "some reliability issues comes and go, especially with sharing screen, and sometimes with selection of bluetooth mic and speaker"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Casey Cheek",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T20:27:28.000Z",
          "Titre": "Excellent",
          "Contenu": "DialPad has been helpful in managing calls, voicemails, and tracking. Definitely recommend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T22:47:50.000Z",
          "Titre": "The new interface takes some getting…",
          "Contenu": "The new interface takes some getting used to."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T20:01:32.000Z",
          "Titre": "Good quality sound",
          "Contenu": "Good quality sound. Very good customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rosemarie",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T21:43:45.000Z",
          "Titre": "It is great that I can get calls from…",
          "Contenu": "It is great that I can get calls from my computer....Dial pad is very easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T14:29:09.000Z",
          "Titre": "Product is reliable + good value"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T16:34:16.000Z",
          "Titre": "You cant really tell if when the number…",
          "Contenu": "You cant really tell if when the number will be marked as spam or scam likely so for a person who frequently uses Dialpad. It's hard to reach out frequently to the Customer Team to get it changed. But, they do have an easy interface to work with, it's easy to text or call people!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abundant",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T18:10:31.000Z",
          "Titre": "Great quality call & service",
          "Contenu": "Great quality call & service. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CW",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T13:32:38.000Z",
          "Titre": "Spam Number",
          "Contenu": "This is a great way to have anyone you are calling or trying to get a hold of without actually using your personal phone number. But, the only reason I gave yall a 4 star is because this number comes  up as a Spam Number to most of my customers, and they will not pick up the phone. And I can not text most because they still have land lines not cell numbers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customerJon",
          "Nb_Reviews": 1,
          "Date": "2021-02-16T23:14:55.000Z",
          "Titre": "Almost perfect",
          "Contenu": "There are a few annoying things that affect the user experience. That said, the service/product as a whole is great. It replaces a very cumbersome experience with one that is much better. My work phone is now anywhere that my computer/mobile is. Would like it if the handoff between mobile and PC were better. Example: if I have the phone app open and on my PC, when a call rings to my PC, I'm locked out of answering it on the mobile app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Marshall",
          "Nb_Reviews": 1,
          "Date": "2020-11-25T20:48:13.000Z",
          "Titre": "I use the service as a loan originator",
          "Contenu": "I use the service as a loan originator. I don't have any other software to compare it to, but it has come in handy when I need to make reference to a past conversation. I haven't decided whether I like certain aspects yet, but for the most part, it does what it is supposed to do. It probably translates 80-90% of my conversations accurately."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T17:56:32.000Z",
          "Titre": "I really like Dialpad",
          "Contenu": "I really like Dialpad. I like the option to text or call and the call quality is usually good. The main issues I’ve had is occasional issues with connection while making a call and I would like to have the option to do a video/FaceTime call.I do think the user interface could be better through the app where some steps using the app for calls or texts is a bit clunky, but overall Dialpad has been very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicki",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T13:03:00.000Z",
          "Titre": "It's a great tool",
          "Contenu": "It's a great way to connect with customers from your laptop/desktop without having to use any additional equipment, such as desk phone or mobile phone. You can also download the app on your mobile phone and take it with you everywhere. It's a great communication tool. I love that I can also text my customers if they're not responding to my call due to the unrecognized telephone number."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Schaffer",
          "Nb_Reviews": 2,
          "Date": "2020-01-14T18:12:17.000Z",
          "Titre": "Great product, almost perfect!",
          "Contenu": "Overall, it is a great and affordable way to hold conference calls and screen sharing with a group.  The interface for the meeting is easy to use and makes it easy to mute others who forget they are on a call while doing something else!Only downside I have seen is I, and others, occasionally get kicked out of the meeting or their audio disappears.  Can fix but rejoining but it breaks the momentum of the meeting."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T20:29:22.000Z",
          "Titre": "Overall",
          "Contenu": "Overall, Dialpad has been an amazing tool for us to communicate with our clients. There was just a time when we experienced delays of messages in our group chat. It was quite hard to catch up with urgent informations because it wasn't visible in one of our staff's account."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GOOD",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T19:40:32.000Z",
          "Titre": "No Complaints. Service just works and works well.",
          "Contenu": "Quite reliable. Overall does a great job for local/international calls. Only complaint is the ios/android app could be a bit more optimized as there are still some bus that need to be worked out. Texting feature which includes images is awesome and works perfect as well. Customer support and overall call quality/reliability has been great though. No complaints."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T20:16:57.000Z",
          "Titre": "Dialpad has solved a lot of problems for us!",
          "Contenu": "Dialpad has solved a lot of problems for us. We used to have a pretty usual office phone system, which is to say that it was cumbersome, difficult to use, and had a needless reliance on vendors for administration. Dialpad puts all of the settings I need right in my hands, at a lower price, and allowed us to \"take the phones with us\" wherever we go!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trey",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T16:16:59.000Z",
          "Titre": "This is honestly one of the best…",
          "Contenu": "This is honestly one of the best softphones I've ever used.  It's intuitive, and simply works most of the time.  My only gripe is there isn't a way to program pauses into dial strings (a feature request I've made numerous times), so I can dial into regular conference calls with one click.  That's why I give it four out of five stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T12:04:05.000Z",
          "Titre": "Simple reliable service",
          "Contenu": "Simple reliable service. The dialpad platform is easy to use and keep track of calls missed or voicemails. The transcript of voicemails may need a little update to be more accurate otherwise all the features are effective to use. My phone runs entirely though dialpad on my laptop and my headset which is connected via USB/Bluetooth."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2019-08-08T03:09:57.000Z",
          "Titre": "I enjoy the ease of using Uber…",
          "Contenu": "I enjoy the ease of using Uber conference. I prefer using the paid monthly/business option because no pin is required and the time is unlimited. I also enjoy using the app as well as having the option to host a conference from my laptop. I have also used the free conference option. It isn't bad, but the 45mins given is short 1 hour would be good. Overall, clear sounding and easy to use!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2019-08-07T13:43:28.000Z",
          "Titre": "I've relied on UberConference for over…",
          "Contenu": "I've relied on UberConference for over 3 years now and continue to use it.  I don't think I've ever had a call dropped and the connection is usually excellent.  My one star off is because sometimes people have a problem with the PIN not working.  Either I have a lot of PIN-challenged colleagues or there is something to their issue.  Still the best deal around!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T18:40:31.000Z",
          "Titre": "Dialpad Review",
          "Contenu": "Our company has really enjoyed using Dialpad. It has streamlines a lot of our phone business and made it easy to create call centers, add new users, and transfer between a headset and mobile phone. The constant updates are a little annoying and the call quality isn't great all the time but overall we have loved Dialpad."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T17:47:25.000Z",
          "Titre": "Dialpad is great",
          "Contenu": "Dialpad is great when everything works. There are times when calls drop but I usually refresh the page and call back and that works fine. I appreciate how it integrates with Salesforce so I don't have to make my notes twice but on some contacts, it doesn't work and I don't know why. Overall, Dialpad is great when it works."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael \"Buck\" Buchanan",
          "Nb_Reviews": 1,
          "Date": "2019-08-06T17:03:45.000Z",
          "Titre": "UberConference is a great resource",
          "Contenu": "UberConference is a great resource, especially working as a consultant working with different organizations that have different technologies. Is it perfect? No, but no service really is. I love the ability to do an easy screen share as well as be able to record meetings and share them. Sometimes there is quite a lag, but it has gotten better in recent months. I would recommend UberConfernece for those looking for an easy application for meetings."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Mesa",
          "Nb_Reviews": 1,
          "Date": "2019-08-06T17:35:45.000Z",
          "Titre": "I had a great experience using this…",
          "Contenu": "I had a great experience using this product. The Web and Mobile app are very easy to use. The layout is nice and is great at recognizing who is speaking very quickly. The Transcript feature is neat and allows you to check back in case you missed something.Connection to the internet to use the app has to be really stable though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2019-02-27T14:27:05.000Z",
          "Titre": "Simple to set up and great customer support",
          "Contenu": "I like the simplicity of Dialpad and all the features. I have the desktop app and the Chrome plug in and sometimes they don't sync seamlessly. I had some trouble setting up my phone line but the support team was incredibly helpful and was able to get that working for me once again. Now I can't imagine doing my work without it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trish",
          "Nb_Reviews": 1,
          "Date": "2019-04-15T17:52:13.000Z",
          "Titre": "Great resources",
          "Contenu": "We enjoy and value the ability to use UberConference for our remote multi-person discussions. The call quality is generally good and very clear, and the recording feature is awesome!  We sometimes have problems with the screen share being dropped, but that could be a problem with the quality of our internet connection - not sure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T15:25:24.000Z",
          "Titre": "Great Alternative to seperate mobile device",
          "Contenu": "Dialpad is a good alternatice for have an additional device. My work provides the service and I like being able to toggle back and forth between the 2 numbers. Still a little slow sometime, especially the syncing between the computer and the app on the mobile device, but were not using quantum computing yet!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jamie Lowry",
          "Nb_Reviews": 5,
          "Date": "2021-02-20T00:31:31.000Z",
          "Titre": "We appreciate Dialpad!",
          "Contenu": "Our experience with Dialpad has been pretty pleasant. As with any product there have been a few hiccups along the way but Dialpad has proved to be a great fit for our mobile-environment. We stay very busy and the application is efficient and helpful to our workflows!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2019-04-15T18:31:58.000Z",
          "Titre": "Uber Conference has been a great…",
          "Contenu": "Uber Conference has been a great platform to host my weekly team meeting calls. It is easy to use. I like that people can log on via the phone or computer. I like that I get my own local number for my conferences. The only thing keeping me from giving it a 5 star rating is the reminder feature is 5 minutes before the call is to happen. I wish there was a feature where I could set up a reminder to all my participants at a varying intervals. Maybe 12 hours before and also maybe an hour befoe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2019-02-26T21:50:14.000Z",
          "Titre": "The service is great for the…",
          "Contenu": "The service is great for the organization, recording, and keeping of contacts, phone calls, and phone logs. Great analytics for tracking inflow and productivity. Had prior stability issues but have not experienced them for about a month now. Their support technicians are quick to respond to any issues, too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Toombs",
          "Nb_Reviews": 1,
          "Date": "2019-02-26T22:44:34.000Z",
          "Titre": "The platform has amazing potential",
          "Contenu": "The platform has amazing potential. The hardest thing to deal with overall is dropped calls. This is not always an issue but when it is an issue it usually is brutal. The program also has a speech to text beta program that is absolutely amazing if it works out. Overall experience is a good one!!!"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Gianna",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T23:43:25.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use and allows multiple staff to share one department. The voicemail transcripts being sent to emails needs more improvement but being able to listen to the voicemail with just one click is a good thing. Been using it for more than a year and no major complaints so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melinda",
          "Nb_Reviews": 1,
          "Date": "2019-06-11T13:43:47.000Z",
          "Titre": "Strong Pros, Medium Cons",
          "Contenu": "Sometimes the app crashes and if I switch from using 2 monitors to 1 it doesn't migrate back to the home screen. It also doesn't enable me to have group texts. Aside from these issues, it offers lots of functionalities that are more user-friendly than Google Voice's product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susanne",
          "Nb_Reviews": 1,
          "Date": "2019-08-06T17:09:06.000Z",
          "Titre": "Great free app for phone meetings and screen sharing",
          "Contenu": "Great free app for phone meetings. The best aspect is the ability to share your screen. Be aware if you schedule the meeting through the app with a specific meeting length, the software will cut everyone off when the meeting is over—no running long! Hmmm...maybe that’s a good thing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MGA",
          "Nb_Reviews": 1,
          "Date": "2019-04-15T18:13:46.000Z",
          "Titre": "Love this service",
          "Contenu": "Love this service.  Didn't give it 5 stars only because the dashboard could be more user friendly and there is no option to manually update contacts.  They must sync with your Google account which can take a while.  Must play around with interface to figure out how to find things."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2019-02-27T22:37:20.000Z",
          "Titre": "Fine service, wish call quality were more reliable, but features make up for it.",
          "Contenu": "Great customer service - they are missing some features I think should be standard - such as integration with my phone's phone book in the way that say Sideline works, where it calls straight to my phone line and I can see that it is a sideline call.  It's either that or their voip is less reliable over my data than is Sideline.  Of course Dialpad has some crazy features that nobody else seems to have, so I keep them for that reason (auto-AI-transcription, for example, and a dead simple and attractive GUI).Generally I'm pleased."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anna Flowers",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T13:28:28.000Z",
          "Titre": "Fixing a Failed Port Request",
          "Contenu": "I needed support with a port request from a different carrier which was giving me errors. I reached out when the required additional information I had gotten from the previous provider was rejected on Dialpad. The issue was somewhat complicated to resolve, and I wasn't able to enter the correct information on my own. It took quite a while, I imagine due to complexity with the communication between providers. I wish this was able to be resolved more easily and quickly, since it ended up taking several weeks to port the numbers.Miguel stayed on my support ticket the whole way through. He was extraordinarily helpful and ultimately made sure the issue was resolved 100%. Thank you Miguel!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jo La",
          "Nb_Reviews": 1,
          "Date": "2019-08-06T22:35:05.000Z",
          "Titre": "Overall Uberconference has been great",
          "Contenu": "Overall Uberconference has been great.  There were a few situations early on (a few years ago when we first signed up), where the call quality was bad, we had annoying noise in the background, etc.  But I can honestly say the past couple of years have been fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2020-05-20T16:49:47.000Z",
          "Titre": "This is our fifth VoIP phone system",
          "Contenu": "This is our fifth VoIP phone system, and the best we've had so far. We can dial out from a central number, and voicemails are shared among the team. There's text messages, and call routing on even the basic plan. Call Quality is very good, at least here in Colorado. That said, the dialer app could be more intuitive. There are a lot of settings and options on the user end, and it's not always clear what they do. We get odd empty 5 second voicemails from time to time, and the actual implementation of text messaging could be improved considerably, as it feels like it was just jammed in there as an afterthought."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Bettina",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:54:36.000Z",
          "Titre": "Anthony went above and beyond",
          "Contenu": "Anthony is very helpful. Went above and beyond to assist. He could have just answered my question but he did more than that. He assisted me and showed me what I was needing 2 months ago when we signed up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Rayl",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:33:17.000Z",
          "Titre": "RR was Great",
          "Contenu": "RR was Great! While my issues weren't resolved during the chat, it was out of his control. He kept me updated during the entire process and will be sending me updates as other teams get the issues worked out."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "junior",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:05:29.000Z",
          "Titre": "Roger was awesome",
          "Contenu": "Roger was awesome. Very patient, clear and helped me with my exact needs. he even suggested i reach out to the sales team and request a trial for the Pro plan because that plan was specific to my business. I did exactly that. Cheers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl H.",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:17:35.000Z",
          "Titre": "Dialpad Meetings - The Communications Service I have had",
          "Contenu": "I have had Dialpad Meetings as a service provider for way over 10 years.  The service itself has always been exceptional, and Dialpad continues to upgrade its service without upping its fees.  I am always able to get timely, competent, efficient, personal and friendly support with a direct call through a number clearly displayed on the Contact Us page.  This morning's encounter with my support rep, Eric, just reminded me of what a great service Dialpad Meeting is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ashley mottern",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:55:18.000Z",
          "Titre": "Thank you Martin",
          "Contenu": "Martin was extremely patient with me even though I was very hard to deal with.  He did not give up until he found a resolution to my issues."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Antonio Echevarria",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T14:22:23.000Z",
          "Titre": "Very good tool. Exceptional experience when asking for support.",
          "Contenu": "The tool is very robust and helps me track my team performance quite nicely. But this review is for their online support team. I had an issue when trying to add a user to my sales center. I had to open a ticket on their online support center. Within a couple of minutes Jessica C was in touch with me via email. After a couple of mails she solved the problem. For my previous experience using the tool, and this great support experience I'm giving Dialpad a 5 star review."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Cole Davis",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:35:34.000Z",
          "Titre": "Easy to use system and very efficient",
          "Contenu": "Easy to use system and very efficient, customer service is very helpful as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Calah",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:38:11.000Z",
          "Titre": "The Agent I worked with was very helpful. Thanks Clarice!",
          "Contenu": "The Agent I worked with, Clarice, was super patient with helping me TS an issues I couldn't figure out with a new user we added to our account. She helped me isolate and resolve the issue quickly and gave next steps incase it happened again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amos",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T00:33:15.000Z",
          "Titre": "I spoke with Mc",
          "Contenu": "I spoke with Mc, and he gave me a very straight to the point answer, giving me information with whom i should speak with to resolve my issue. Sadly speaking with Denmark didn't lead me anywhere."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Abigale Rudland",
          "Nb_Reviews": 8,
          "Date": "2023-11-17T13:52:15.000Z",
          "Titre": "Thanks to Charlene for great service",
          "Contenu": "So impressed with Dialpad so far. Charlene was just such a pleasure to deal with - always available, responsive to calls and emails, and incredibly patient at navigating 5 people through the set up process. The whole customer experience was heads above any other provider I've tried. Instead of getting bounced around to someone new each time, you get one person assigned to you, who really understands the problems you're trying to solve. Also, no slick sales people offering you the world and then you find when it comes to induction that they don't offer that thing you wanted after all. Everything they said the app could do, the app could do. Thanks so much Charlene for all your help - hugely appreciated."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "GHQ Servicedesk",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:28:30.000Z",
          "Titre": "I had a great experience with Garcia",
          "Contenu": "I had a great experience with Garcia - Dialpad Support teamEverything is so smooth with her helpSwift action and kind support."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jake Paul Quintos",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:39:21.000Z",
          "Titre": "The support is awesome!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Sharon Carter",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:02:22.000Z",
          "Titre": "KUDOS TO JOHN",
          "Contenu": "KUDOS TO JOHN. He has been so patient and helped us out all the way, fixed our SMS issue which was lingering on for months. We are grateful for the excellent customer support from Dialpad."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucy",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T03:18:22.000Z",
          "Titre": "Reaching someone LIVE on tech support : )",
          "Contenu": "I'm so lucky that I was connected with Rey from Tech Support who was able to help me with everything I needed.  When I explained what I wanted to accomplish, he explained that I needed to purchase 2 \"AI\" lines to replace the 2 \"additional\" lines that I had purchased.  As I purchased the 2 \"AI\" lines, he put in the request to credit my account for 2 \"additional\" lines mistaken purchase.  Then Rey helped me obtain 4 sequential phone numbers for my company.  This is a service that only tech support can provide -- it isn't listed in the HELP section.  Rey made the process fast and easy.  Rey is a knowledgeable and customer-focused tech support rep.  The problem/solution situation I described is a shining example of why it's so important to allow customers to have direct access to tech support is vitally important.  (NOTE: I had to call the sales office in order to get connected to tech support.  Prior to this, I had carefully read all info pertaining to my set up needs and no where did it explain the difference between purchasing another \"AI\" line vs. an additional line.  It's really a shame that I had to waste so much time watching the DialPad set up youtube and re-reading the HELP section which didn't address my needs.  But having that live conversation with Rey in Tech Support solved everything.)"
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Surge Rains",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T22:25:06.000Z",
          "Titre": "Dialpad's Ryan McCarthy - One in a million",
          "Contenu": "Dialpad is a great company, with excellent apps, admin platform and all the latest bells and whistles you could imagine. The best part though, is their people. Especially our account manager - Ryan McCarthy. If all the people in this world would take their work to heart the way he does - we would all live in a better place. I cannot describe how thrilled we are to have him on our side. Thank you, Ryan, for the stellar work and for the commitment to your client that makes many other competitors look real bad :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Nova",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T22:21:34.000Z",
          "Titre": "Andren Rey Bungubung went above and…",
          "Contenu": "Andren Rey Bungubung went above and beyond to help me today. I was frustrated and emotional and he stayed calm, positive, and reassuring. He was kind and thoughtful and went out of his way to make sure I got the help I needed. Andren is an example of what excellent customer service looks like. I was ready to cancel my DialPad account, and because of Andren, I will continue to be a loyal customer. You have a wonderful rep and I hope you know how lucky you are to have him representing the company. Thank you Andren!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Pronto Autoglass",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T03:47:17.000Z",
          "Titre": "Unmatched Customer Support",
          "Contenu": "Dialpad's customer service is unmatched. I've dealt with their team about 7 times for support, upgrading numbers and general questions and every time I was on the phone instantly and off in less than 5 minutes. Compared to any other provider, Dialpad's support is truly the best. Highly recommend for small businesses! Thanks to Karen U and the team at Dialpad for making our lives so much easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dion Huey",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T16:34:03.000Z",
          "Titre": "Very helpful!",
          "Contenu": "Even though my inquiry wasn't resolved during the initial contact, Christian helped escalate it to help me get it done.  Much appreciated!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Danny Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:24:36.000Z",
          "Titre": "Nice work ELRoy Bragado",
          "Contenu": "When looking into Dialpad I've been dealing with consultants between Australia and overseas for weeks, unfortunately I've received mixed info contradicting each other, or no answers to my questions until yesterday.  Thank you to ELRoy Bragado for his patience and outstanding customer service.  He's given me peace of mind to finally use Dialpad as of yesterday.  So far so good and I'm sure I'll have more questions for in the future, but for now I've got more confidence in moving forward with Dialpad thanks to ELRoy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T05:39:41.000Z",
          "Titre": "Mike Garcia is the best Customer Service Specialist",
          "Contenu": "Mike's patience in understanding my problem was truly commendable. His approach made it remarkably easy for him to swiftly resolve not one, but two issues that had been plaguing me for days. Mike, I want to extend my sincere gratitude to you! Please continue your outstanding work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott S.",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T02:33:47.000Z",
          "Titre": "Marlon was extremely patient, polite and very professional",
          "Contenu": "Marlon was extremely patient, polite, very professional and very knowledgeable.  He figured out the problem and delivered the solution!  Thank you Marlon and Dialpad!  What a relief that he was available this evening to help me get these two accounts opened and ready to go in the morning!  GREAT JOB!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connor Makovitch",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T21:46:41.000Z",
          "Titre": "Greatly appreciate the help we were given!",
          "Contenu": "Greatly appreciate the help we were given. Ultimately we were not able to get our issue fixed, but our agent, RR, got tons of info from us to send to the next level of support for us to get this figured out one way or another. Super polite and willing to help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T14:43:16.000Z",
          "Titre": "Finally got the full answer",
          "Contenu": "I finally received the information after numerous requests on updating the department from the main line and replacing each of them with a Contact Center. No one else at DialPad expressed this to me in the other emails or calls. This was a frustrating situation that should have been much easier."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "ICONN Assistant",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T19:36:57.000Z",
          "Titre": "Joshua Gabrinez is absolutely fantastic!",
          "Contenu": "He has an incredible grasp of the product. I made an initial call this morning, but I must admit I got a bit frustrated with the first tech support agent I spoke with. Luckily, I decided to call again, and that's when I had the pleasure of speaking with Josh.He not only resolved my issue but explained it to me as if I were in grade 1. I really appreciate that because I'm not the most tech-savvy person, and his patience and understandable approach made all the difference.Josh is undoubtedly an invaluable asset to your company. I strongly recommend that you not only keep him but also give him the credit he truly deserves! 👏👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruthie",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T00:42:41.000Z",
          "Titre": "Andren Bungubung",
          "Contenu": "Andren Bungubung, was an awesome Tech support for our org. A sense of urgency is always needed being a homeless shelter. Personal Diagnostics via email was provided; I almost solved my issue myself but having over the phone aid solved my problem. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C. Pope",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T19:26:05.000Z",
          "Titre": "Ray was fantastic and helped me with my…",
          "Contenu": "Ray was fantastic and helped me with my issue with Dialpad.  He worked hard to get me a solution. I was very pleased with Ray. I worked with another tech support person prior to him who just read a script and could not help me and refused to transfer me to someone else.  Ray was fantastic though and I cannot thank him enough for his help."
        },
        {
          "Note": 5,
          "Lieu": "BA",
          "Pseudo": "Moe M.",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T20:20:06.000Z",
          "Titre": "my experience was amazing",
          "Contenu": "my experience was amazing, i had problems sending SMS and didn't know how to fix it and the agent Jansin walked me thru everything and explained it step by step to me. We solved the problem, and everything is good now, this kind of help is really hard to come by, so I highly appreciate him helping me thru it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat Sinnott",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T21:09:13.000Z",
          "Titre": "Great customer service.",
          "Contenu": "Didn’t have to wait on hold, love talking to a live agent. He was super knowledgeable and assisted me a great deal!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabriel Vine",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T19:45:54.000Z",
          "Titre": "Support better than anticipated!",
          "Contenu": "Although I was initially put off by the fact that support was being handled through WhatsApp, the whole process was fast and much better than expected.  And, perhaps most important,  the support person, Joey, was knowledgeable and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Lesmi LLC Office",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T23:13:50.000Z",
          "Titre": "JOSH IS SUPER AWESOMe!!!",
          "Contenu": "JOSH DESERVES A MILLION CLAPS AND PAT ON A BACK FOR BEING PATIENT AND UNDERSTANDING WITH ME, HE SHOULD BE A ROLE MODEL TO THE COMPANY, MAKE HIM AN AMBASSADOR EVEN!!! NOTHING BEATS HOW SPLENDID HE IS AT HELPING PEOPLE AND ORGANIZED HE IS! THANK YOU JOSH, MAY YOU BE BLESSED EVERYDAY! YOU HAVE AN AWESOME DAY FIT FOR AN AWESOME YOU! DON'T FORGET TO SMILE ALWAYS :D"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "joshpof",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T00:33:29.000Z",
          "Titre": "Great customer experience",
          "Contenu": "Karen U was great at answering my questions and resolving then quickly. I have over 20 years in sales and customer service and I must say she is an asset to your business.  Great work Karen! Thank you for your help."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "CNS NewZealand",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T04:19:49.000Z",
          "Titre": "Been using dialpad for almost 3 years…",
          "Contenu": "Been using dialpad for almost 3 years now.Cant be more happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Robertson",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T02:15:18.000Z",
          "Titre": "Very powerful system for AI assisted Call Center operations",
          "Contenu": "Very powerful system for AI assisted Call Center applications. Lots of options. Any time I have configuration questions or issues that are not covered in the extensive cascade driven Help section, I reach out to live chat. The wait times for agents at all reasonable waking hours for PDT TZ have been short and every agent that has helped me resolve an issue has been knowledgeable, courteous and professional. Great product, excellent Customer Support."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jude Cornish",
          "Nb_Reviews": 3,
          "Date": "2023-08-21T11:38:07.000Z",
          "Titre": "Super supportive onboarding and support…",
          "Contenu": "Super supportive onboarding and support team.William Sandbach answered all of my (many) questions and made sure that I got the best start with Dialpad.Although the platform looks perfect for my needs, his support is a big reason as to why I'll be moving from a trial to a paid plan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Altacolor",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T16:08:14.000Z",
          "Titre": "Extensive Documentation & Support",
          "Contenu": "We came from an old-fashioned in-house PBX system and considered a number of vendors before trying Dialpad. Support is excellent and very thorough and fast. Documentation is ridiculously extensive, yet well laid-out and clear. Call quality is excellent and the built-in auto-attendant, transcription, follow-me, desktop and phone apps are all stable and excellent. No down-time or network problems. The cost per-seat is competitive and it works well. We're a small user, but that doesn't seem to make a difference since the customer services is first-rate. And, it just works. What more could you want?"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Saroj Shah",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T06:20:34.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, very happy with the way Jun explained everything and resolved our issue."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mike",
          "Nb_Reviews": 3,
          "Date": "2023-08-03T04:23:57.000Z",
          "Titre": "Scalable product with killer real-time transcription",
          "Contenu": "Dialpad is such a great product from my experience so far. I'm running a small business. Initially just myself but now expanding to a second department. I love how economical it is for my purpose, and yet how scalable it seems to be for when the business expands. IMO the killer piece of functionality is the transcription of every call. So great to have a record I can go back to, and saves me taking copious notes. Even better is that it does this in real-time, so if the line is not perfect or if I switch focus for a second, I can still see what the other person said."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Eckardt",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T19:30:16.000Z",
          "Titre": "Thank you Marlon!",
          "Contenu": "Mr. Marlon was fabulous! Patient, professional, and knew exactly how to walk me through my issue efficiently and with expertise and kindness.Please add this review to Mr Marlon's employee file.Dr. Patricia A Eckardt 09/07/2023 115pm EST"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "kriss Lowell Olib",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T21:58:30.000Z",
          "Titre": "Jansin is very helpful",
          "Contenu": "Jansin is very helpful. The willingness to help is outstanding. Explains very well. I hope that he gets a promotion or a raise atleast. Overall, very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clay Selland",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T22:34:15.000Z",
          "Titre": "Had a question that was not easily…",
          "Contenu": "Had a question that was not easily answered (a bit outside the box) and received quite a bit of help including drawing on additional resources within the team.Not 100% handled quite yet but they switched the conversation over to email so I didn't have to hang on. Very very professional and I'm very very happy about the help received"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt C",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T00:22:02.000Z",
          "Titre": "Thank you, Sarah!",
          "Contenu": "Sarah was responsive, polite, and able to identify my needs quickly and bring resolution to my requests!  The interaction as a whole was wonderful as was her follow up when I got disconnected out of the chat to ensure everything had been accomplished!  Thank you, Sarah!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "MichelCo.",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T21:05:56.000Z",
          "Titre": "I can't ask for a better phone service",
          "Contenu": "I can't ask for a better phone service. Every time, I need help someone is there, as patient as can be because the answer could be right under my nose after a long day.Communication is clear and precise and I have no problems following along.Thank you DialPad Team!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DalMaidtion Cleaners",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T02:23:19.000Z",
          "Titre": "Jansin was fantastic",
          "Contenu": "Jansin was fantastic - one of the best calls with a customer support agent I've ever had. Answered all my questions, hopped on a video call to walk me through my Dialpad interface - anyone else who gets support from him is lucky!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Aldrin Dalanon",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T13:43:01.000Z",
          "Titre": "Kudos to Krizia! Love her work. This issue and request has been over a…",
          "Contenu": "This issue and request has been over a month ago and Krizia has been very helpful kind and very much willing to help. If only I can get her promoted to her job, i would love to but this survey and feedback is the least I can do to help her out. She helped the whole company/business and me in every possible way. I hope you keep her as she’s definitely an asset of your company. Kudos and Great Job Krizia.."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jody F",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T23:39:11.000Z",
          "Titre": "Great support",
          "Contenu": "I've only signed up for a trial at this stage but needed helpdesk support 3 times. Each time support (in particular Krizia) was fast, friendly and effective. It bodes well if this is what their support is like all of the time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Your Favorite Mechanic",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T21:42:15.000Z",
          "Titre": "He is the cats pajamas",
          "Contenu": "I have been working with Mr. Garcia on my Dialpad service and other than one other technical service representative. His answers have been spot on and corrected my issues first time. Mr. Garcia is the cats pajamas with his technical expertise. Thank you again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T00:35:41.000Z",
          "Titre": "Great customer service!",
          "Contenu": "RR was extremely patient, informative, and answered all my questions.  I had more technical questions related to new service and he took all the time needed to ensure every question I had was resolved."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Dispatch",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T20:26:18.000Z",
          "Titre": "Helpful support service",
          "Contenu": "Rey made it easy to sort out my issue regarding getting the text service to work."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Oliver Clubb",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T15:55:10.000Z",
          "Titre": "Great app with awesome support :-)",
          "Contenu": "Dialpad is a really great communication product that can help teams improve productivity and achieve their business goals! It is great for small global teams but also has enough features to run multiple  large call centers. Their sales and technical support ranks among the best of the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Casssandra Stevens",
          "Nb_Reviews": 2,
          "Date": "2023-06-17T03:52:23.000Z",
          "Titre": "Karen P is GREAT",
          "Contenu": "I was helped by Karen P. and she was beyond fantastic. I had previously chatted with a rep online & we just went round in circles, so I called the support phone number & was lucky to get Karen P. She was so nice, understood my issues and was able to answer all my questions fully and quickly. She made sure that ALL of my concerns were addressed & that I understood everything. Thanks to her I was able to get everything set up and optimized in less than 30 minutes - despite all my questions and requests. She was absolutely wonderful and EXACTLY what a good customer service agent should be. So thankful for her time & help today."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Raim Rando",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T00:08:04.000Z",
          "Titre": "Excellent",
          "Contenu": "From sales to tech support I got a very nice experience talking to customer care. The tech support who assisted me have enough knowledge and expertise about the software. The sales explained to me a lot how the service works and it's features. Overall, kudos to the people that I talked to dialpad. You guys deserves a raised!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Minh",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T19:49:20.000Z",
          "Titre": "Andren is very knowledgable",
          "Contenu": "Andren is very knowledgable. He knows what he is doing. As soon as I explained the problem to him, he immediately pointed out what the root cause was. I am very happy with this kind of support."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Xylene Criste",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T20:25:20.000Z",
          "Titre": "Sarah is different from the 2 reps that…",
          "Contenu": "Sarah is different from the 2 reps that I talked to the other day.  She was very patient, helpful and knowledgeable.  She had answers to all my questions and I really appreciate how helpful she was."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T23:39:07.000Z",
          "Titre": "Showed me how to resolve my issue wihtout calling support.",
          "Contenu": "Called to have a number moved from a former employee to the new employee. in the past when we removed a user we had to wait 72 hours for the number to go back to the pool or contact dial pad to fix. He showed me how to fix the reason for my call on my own, which was not possible in the past but dialpad listened to feedback and make it possible for my to self service our account.      Couldn't be happier!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "SIGMA OFFROAD",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T03:42:29.000Z",
          "Titre": "Had technical issues",
          "Contenu": "Had technical issues. Also being very technology iliterate. I was so happy Jeff was my support agent and was very helpful I hope he sees this as he needs a pat on the back. If I didnt come across someone so helpful and patient with me from Dialpad I would have gone to another company for my business phone services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DANIEL DVOSKIN",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:39:34.000Z",
          "Titre": "Fantastic service and easy to understand"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janssen  Kuhn",
          "Nb_Reviews": 3,
          "Date": "2023-07-27T04:11:48.000Z",
          "Titre": "I'm still on the trial with Dialpad but…",
          "Contenu": "I'm still on the trial with Dialpad but so far the experience has been great. I had a good talk with someone from sales, he was very helpful. And more recently I had a good talk with someone from customer support. He answered my question perfectly and also told me something else I didn't even know I needed to know!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Genius In  Days Usa",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T23:01:54.000Z",
          "Titre": "Best Customer Care ever",
          "Contenu": "Jansin Locsin who was my customer care guy, was absolutely incredible in fixing everything I needed in record time. Super productive and super relyable"
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "Alex",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T20:23:29.000Z",
          "Titre": "The app has been outstanding",
          "Contenu": "The app has been outstanding! We've been loyal users for more than 2 years. Each time I tap into the live chat for support, I'm promptly linked with someone, and my concerns are sorted out in no time. Couldn't be happier with Dialpad and their support crew."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wolfgang Schmitz",
          "Nb_Reviews": 5,
          "Date": "2023-08-02T01:18:10.000Z",
          "Titre": "Roger was my hero in the darkness.",
          "Contenu": "He patiently and effectively handled my request with politeness and speed. Rockstar.The one certain thing I can say is time and time again the support staff has always been stellar for me."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Ron Irvin",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T10:17:30.000Z",
          "Titre": "Quick response time and turnaround time",
          "Contenu": "As always, the customer experience with Dialpad has been exemplary.  Quick response time and turnaround time.  The issue was solved in a day.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T23:14:55.000Z",
          "Titre": "Jhonard helped me resolve a slack…",
          "Contenu": "Jhonard helped me resolve a slack integration issue. He was very polite and helpful in providing ideas, and took my loom recording to his product partners when we got stuck. Thanks again for your help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexa F.",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T22:04:32.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I had a wonderful experience with my support agent, Rebecca. She provided solutions before I even phrased my questions and offered guidance in multiple capacities. I left the conversation with a smile and continue to feel fully supported by this team. Thank you, Rebecca!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pref",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:48:59.000Z",
          "Titre": "All my questions were answered by Rey",
          "Contenu": "All my questions were answered by Rey! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Anunciado",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:46:44.000Z",
          "Titre": "Jun is very good",
          "Contenu": "Jun is very good. Hire more Jun"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Daniel Petrushevskyi",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T15:41:59.000Z",
          "Titre": "Best voip experience I've ever had",
          "Contenu": "Dialpad capabilities and stability in comparison to other VoIP tools our company used before are outstanding. You can read full transcripts of live calls, barge calls with a single click.The AI allows you to have insights on the call center agents performance up to \"moments of uncertainty\".Would recommend using Dialpad for every company that runs a call center."
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Semco Florida",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T20:36:22.000Z",
          "Titre": "Jansin was successful with my set up request!",
          "Contenu": "Jansin was able to understand what I wanted to do quickly and went the extra mile to test to see if it was possible, he was able to find a solution and help me set it up succesfully. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ijeoma Eze",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T21:28:29.000Z",
          "Titre": "Jansin was excellent in guiding and…",
          "Contenu": "Jansin was excellent in guiding and helping me complete the SMS registration. There is no way I could have done it without his guidance. He is an excellent employee to Dialpad. I appreciate his professionalism and patience. Thank you for doing a great job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Payne",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:32:29.000Z",
          "Titre": "Always good experiences with Dialpad.",
          "Contenu": "Dane was patient, knowledgable, and helpful.4:31 pm"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosie Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T00:00:57.000Z",
          "Titre": "I love Dialpad",
          "Contenu": "The platform is user friendly and when I had an issue I reached out to support and they were so quick with help and resolved my issue, which happened to be my user error. I appreciate their patience and guidance and can’t say enough about this platform. Truly great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Regal Trademarks",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T23:49:39.000Z",
          "Titre": "Best staff, Quality service, Acceptable Rates.",
          "Contenu": "The agents are very cooperative. Best service I have experienced. Very patient and very helpful. Dolores helped me out today. Besides that the pricing is worth it for the service that they provide. Will always recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noah Sullivan",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T22:57:19.000Z",
          "Titre": "GREAT SERVICE!",
          "Contenu": "Andren is obviously well versed in your company's technology as well as a very creative and methodical problem solver.My problem was an unsupported microphone that would not properly record my voicemail greeting.  He was able to diagnose this problem and recommend an alternate solution by uploading a converted voice file from my mobile phone.I am very satisfied with this experience.  Andren should be on track for management of your training department and should get a raise before someone else snags him from your team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cuyler Harvey",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T19:47:47.000Z",
          "Titre": "Very quick",
          "Contenu": "Very quick, responsive, and knowledgeable. A live person was connected via chat quickly without having to jump through a bunch of hoops first."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Lindsey",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T23:36:16.000Z",
          "Titre": "Jansin Locsin",
          "Contenu": "Jansin was able to resolve our issue after several weeks of trying with your online tech support.He was awesome!Great job Jansin"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Brian Morland",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T19:59:44.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "The rep Michael was fast, kind and capable. He even tried to apologize for a delay, but there was no delay. He got it done fast and easily, but still wanted to do better. Great customer service. Couldn't have been better."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Usman Anwar",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:17:42.000Z",
          "Titre": "Always Available",
          "Contenu": "Always there, available, helpful and to the point."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Pontus Madsen",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T04:51:47.000Z",
          "Titre": "Haven't tried the product yet, but if I do, I know I'll be happy.",
          "Contenu": "Haven't tried the product yet, but have to say the customer rep' that I talked to was absolutely amazing. After ended session, she followed up and provided me with more info that was good for me to know. She also followed up on the people she passed me on to and if they where doing their part (which they were).Amazing!Haven't tried the product yet, but if I do, I know I'll be happy and confident that all my problems will be solved."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tom Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T10:49:47.000Z",
          "Titre": "DialPad Setup with Will Sandbach",
          "Contenu": "Will (William) Sandbach made my introduction to DialPad very concise, efficient, and pleasant.His vast knowledge of the company is evident, an asset to DialPad's UK sales team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mariah",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T21:52:50.000Z",
          "Titre": "The program is very easy to use",
          "Contenu": "The program is very easy to use. Its a fun way to communicate with patients. You are also able to use a texting feature which is nice as well when communicating with others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Lord",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T23:09:57.000Z",
          "Titre": "Pao did an amazing job",
          "Contenu": "Pao did an amazing job. She knew the answers to my questions and I felt taken care of during the entire chat session. In the end, my issue was resolved and I learned something new. Give her a raise!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Elaine",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T07:23:38.000Z",
          "Titre": "Jun was incredibly helpful and let me…",
          "Contenu": "Jun was incredibly helpful and let me know what he was doing to fix the error I was experiencing at every step of the way!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KAK",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T18:05:10.000Z",
          "Titre": "Denmark Capinpin was very attentive",
          "Contenu": "Denmark Capinpin was very attentive, and clear about Dialpad's steps and our steps to bring a reserve phone number online with our office Dialpad setup. Very quick response and resolution!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Alva",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T00:22:02.000Z",
          "Titre": "Miguel was very thorough",
          "Contenu": "Miguel was very thorough, insightful and helpful altogether. Thank you for his expertise and knowledge on how to handle the situation"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenn Evans",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T00:49:08.000Z",
          "Titre": "Jansin's support =10/10",
          "Contenu": "Jansin was a patient, kind, and knowledgeable support representative. It's all too common to encounter short-tempered or unhelpful support staff in other companies, but Jansin was not like that. He efficiently and effectively resolved my issues without any frustration or difficulty."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence Candilas",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T19:56:49.000Z",
          "Titre": "SUPER helpful!",
          "Contenu": "Jessica was extremely helpful and took care of everything I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Spruill",
          "Nb_Reviews": 6,
          "Date": "2023-05-09T22:38:33.000Z",
          "Titre": "Rome did a good job",
          "Contenu": "Rome did a good job of clearly answering my questions. He was patient and while i was on hold for quite awhile, he apologized, and helped answer my questions, which was the end goal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ethan Bratt",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T01:20:55.000Z",
          "Titre": "Great support for porting",
          "Contenu": "Jansin did a great job helping me with some questions on number porting. They were polite, prompt, and completely helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wolfgang Schmitz",
          "Nb_Reviews": 5,
          "Date": "2023-10-02T21:58:05.000Z",
          "Titre": "Roger was faster than being Oscar Mike",
          "Contenu": "Roger was faster than being Oscar Mike. Speedy and excellent service. A++ would summon again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ovando",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T23:12:24.000Z",
          "Titre": "Edzer was amazing",
          "Contenu": "Edzer was amazing! Very helpful, researched and help me solve several transition issues all at once."
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Josue Castro",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T15:52:00.000Z",
          "Titre": "Great tool, amazing people",
          "Contenu": "Dialpad came to improve how we communicate with our customer but also internally. It provides insights that help us improve customer satisfaction as well as agent performance. coming from 12 years experience in the BPO industry, I truly recommend Dialpad in all aspect, as a tool and as a company with great values that will help you achieving your goals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Kander",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T20:58:08.000Z",
          "Titre": "Customer service rep righted their mistake and saved the day!am a new customer with Dial Pad and…",
          "Contenu": "I am a new customer with Dial Pad and became very upset when some vanity numbers I had picked and knew were available, were lost because of time delays with Dial Pad.  I had spent an entire week checking with all of the phone number sources before finally arriving at a few exciting numbers that would be important to our marketing and image.  I was given a number of status names such as: cooling, reserved, available.  These names meant nothing.  I responded with questions as to what these meant relative to the numbers I wanted.  The response was that they were now unavailable...they could not hold for very long.  I was furious.  These were numbers I would never be able to get again.  I was able to reach Marie de La Pena in support.  She was patient and listened carefully.  She took action, pressed the issue to the appropriate departments, and got the same numbers that I was told were no longer available.   How she did this I do not know.  But she saved the day.  I want to thank her from the bottom of my heart.  She is a credit to her company, especially in present times where service means little.   We were thinking very seriously of canceling our business with Dial Pad because of this ineptitude. Now we plan to stay.  Thank you again Marie."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Drew Livingston",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T16:50:29.000Z",
          "Titre": "Great support when needed",
          "Contenu": "Great support when needed! I was also calling outside of normal business hours so nice to be able to get a live person!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samon Whitelow",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T19:31:05.000Z",
          "Titre": "Great tool for businesses!",
          "Contenu": "Dialpad has been a great resource to help us run our business and it comes with a ton of useful features! I would definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jillian Wyatt",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T23:38:56.000Z",
          "Titre": "The customer care representative was patient and attentive.",
          "Contenu": "The customer care representative was extremely attentive and patient! I was having trouble figuring out how to register for my business and they helped me and walked me through the whole process."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "RecyTraders Ltd",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T13:24:38.000Z",
          "Titre": "Great Customer service",
          "Contenu": "Great Customer service Emily Gilbert, our Business Development Representative from Dialpad, was an exceptional professional to work with. Her patience, expertise, and outstanding communication skills were instrumental in our decision to choose Dialpad as our communications partner. Emily's dedication and ability to build trust with our team made Dialpad the obvious choice for us. We highly recommend Emily and Dialpad to any organization seeking a reliable and customer-centric communications solution. Thank you, Emily, for your excellent support and for being a key reason behind our choice of Dialpad."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Jenkins",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T01:47:13.000Z",
          "Titre": "Karen U did a great job",
          "Contenu": "Karen U did a great job. She was able to submit a request for me."
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Thomas Rawson",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T21:44:09.000Z",
          "Titre": "Great help from Ray The Tech Support Rep",
          "Contenu": "Ray was fantastic at helping solve the issues we had."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Geraldo",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T19:23:11.000Z",
          "Titre": "Sarah did a great job working with me…",
          "Contenu": "Sarah did a great job working with me and following up. Unfortunately, I have not had that same dedication from other employees at Dialpad."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Neyaz Ahmad",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T13:23:43.000Z",
          "Titre": "We are so happy with your support now…",
          "Contenu": "We are so happy with your support now our issue has been resolved. thanks for support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie S.",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T16:45:24.000Z",
          "Titre": "Dialpad Support staff are the best!",
          "Contenu": "Noah Gonzalez was responsive and friendly. He made it easy to handle my concern, and was quick with a response/resolution."
        }
      ]
    }
  ]
}