{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "digitalkeysbox.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicholas Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T07:15:28.000Z",
          "Titre": "it didnt work would like a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointment",
          "Nb_Reviews": 1,
          "Date": "2021-12-19T01:16:31.000Z",
          "Titre": "Tried to install multiple times but it…",
          "Contenu": "Tried to install multiple times but it unsuccessful, couldn't get any help or reply via email, and of course ZERO refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "todd pederson",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T12:33:53.000Z",
          "Titre": "I purchased this product two days ago…",
          "Contenu": "I purchased this product two days ago and STILL waiting for the activation code. You have my money, I can only hope you don't treat all your customers this poorly. Todd"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alfonso Chang",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T17:52:46.000Z",
          "Titre": "Unable to activate microsoft office…",
          "Contenu": "Unable to activate microsoft office 2019 softwares.using internet or phone. Request monetary refund. Unable to contact the seller."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob Ahlborn",
          "Nb_Reviews": 5,
          "Date": "2021-02-01T23:19:43.000Z",
          "Titre": "This is a scam",
          "Contenu": "This is a scam.  I don't know where all those positive reviews came from, but I think they wrote the reviews themselves.  I bought Office Professional 2019 from them, and while it installed fine, it only worked for a month - it appears it was a trial copy only good for 30 days, and then most functionality in programs is limited.  I tried reloading, no luck. Tried calling, but their phone #'s are not valid.  Online link wouldn't work, phone to Microsoft said it was not a valid code.  Tried emailing digitalkeysbox.com, never received an answer.My review will not change - it's amazing how they contacted me a few hours after the bad review posted, but it took them a few DAYS to respond to me sending them an email with my problem.  I doubt they ever would have responded to my original email if I hadn't posted a bad review.  In addition, their response to my review looks like a standard response that I have seen sent to others with a bad review of them.  I also don't think they read my review because it was working, and I did try the phone option with Microsoft."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "brian rogan",
          "Nb_Reviews": 1,
          "Date": "2020-09-05T13:57:20.000Z",
          "Titre": "When i logged in and i saw the  account…",
          "Contenu": "When i logged in and i saw the  account is llocked out. I  dont have the keycode anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Lofthouse",
          "Nb_Reviews": 2,
          "Date": "2020-09-19T21:21:25.000Z",
          "Titre": "I downloaded Windows 10 upgrade and it…",
          "Contenu": "I downloaded Windows 10 upgrade and it crashed my computer!!! NOT HAPPY AT ALL."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ROBERT",
          "Nb_Reviews": 8,
          "Date": "2020-09-21T12:49:16.000Z",
          "Titre": "Bad key",
          "Contenu": "Key doesn’t work after 24 hours"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ruby payne",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T21:16:33.000Z",
          "Titre": "cannot get it to download"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mona",
          "Nb_Reviews": 3,
          "Date": "2022-02-02T06:41:52.000Z",
          "Titre": "Wanted Home Office and they gave me Pro",
          "Contenu": "I bought the Home and Student 2019 edition of Microsoft Office, which is what I wanted.  I only need word and excel.  There was a choice to upgrade to 2019 Pro for $7 more dollars that included everything.  I declined and proceeded to download.  The download was taking way too long and I noticed the Pro version was being downloaded with crap I didn't want on my computer like One Drive and Skype.  It took hours to remove them.  2019 isn't a very good product to begin with and 2010 version much easier to use.  Lesson learned in dealing with these types of businesses.  Don't buy from this company.  I gave it two stars because the programs work and didn't mess up my computer too bad.  I'm still trying to get all of One Drive off."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James F",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T18:38:30.000Z",
          "Titre": "The whole process was not user…",
          "Contenu": "The whole process was not user friendly, however all finally worked out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Bonnice",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T05:23:42.000Z",
          "Titre": "License was valid but hard work required to take advantage of it.",
          "Contenu": "I needed clarification that the MS Office download would only work for the last three mac OS versions.  I was able to get around it by going to learn.microsoft.com?en-us?officeupdates?update-history-office-for-mac (replace? by /) and downloading version 16.62The instructions also didn't work.  Going to redeem.microsoft.com and plugging the license key resulted in a complaint that I couldn't put in the key until I was logged in.  But I was logged in.  I found another way.  And when I got there, the license was accepted."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald May",
          "Nb_Reviews": 3,
          "Date": "2022-06-25T16:13:34.000Z",
          "Titre": "Question those 5 star reviews",
          "Contenu": "I question those 5 star reviews.  The product downloaded fine and installed on a Windows 10 machine.  Product key did not work.  Message is the limit has been reached on the number on time the key could be used.  I tried several times online and by phone.  Emailed the different email addresses four times. Received one reply (from a different email address from the one to  which I was told to write).  They said a response with a solution would come in 10-12 hours.  No emails after that.  Days later here I am.  I called the phone number twice (no answer once and the call spoke a message that the line had been disconnected. The other time it rang and rang.  Of course, they have my money.   Notice the response to negative reviews is that the buyer is at fault.  I did everything correctly. I am not a novice.UPDATE  6 days after initial purchase:I heard from DigitalKeysBox. I was sent a 2nd product key and which allowed me to activate the software. (This was sent from the email address pcsoftmail.sale). The email asked what I meant that the key did not work? Also told me to follow the instructions.  Since I had already used the 2nd activation key and had successfully activated my software I ignored the email.  I received another email from the same address which asked me to EDIT (not amend or update) my initial review, which I am doing now. So, all is well now from my side. There is a bit more to the story, but I will spare everyone."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Robert Geranis",
          "Nb_Reviews": 1,
          "Date": "2020-09-19T13:32:07.000Z",
          "Titre": "The key did not work properly",
          "Contenu": "The key did not work properly. I had to get MS to fix the problem, if the provided key would have worked without issues I would not feel uncomfortable about the computer change I have planned. It would have been a higher rating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T17:00:12.000Z",
          "Titre": "INew Windows 11 Laptop",
          "Contenu": "I'd just purchased a new laptop with Windows 11. The OS was the Home version. I decided to upgrade to the Pro version. I found an email from my earlier purchase of a Windows Pro License. I clicked on the link, was taken to the web site and from there, ordered and received a Windows 11 Pro license. I installed the license following the supplied instructions and everything went smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T19:30:33.000Z",
          "Titre": "Helpful chat and easy install the first time",
          "Contenu": "I had a number of pre-purchase questions that the chat operator patiently and politely answered. She confirmed that this is a Retail license (though incorrectly said that the ISO would be included in the download, otherwise 5 stars). If you need to chat, be patient, stay on the line and don't rely on the estimated wait time.Installation went smoothly. MS license verification tool confirmed that it was a Retail channel license. It also lists a Retail(Grace) channel license that has now expired. I suspect it is to allow 5 days for adding your license key or a temporary free version of Office 365 that MS wants you to buy. You can find the product for a few dollars less elsewhere but comments on many of those providers talk about how the key failed and they had to work with the seller to (hopefully) get a valid replacement key. My install was hassle free the first time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Betsy Stoltzfus",
          "Nb_Reviews": 2,
          "Date": "2021-10-13T23:16:39.000Z",
          "Titre": "I appreciated her kind help in…",
          "Contenu": "I appreciated her kind help in activating Microsoft Word. It took some time for me to figure things out, but she stuck with me through the whole process and even took over my screen for a bit to finish things out. I'm grateful for the time she invested and for her patience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott L",
          "Nb_Reviews": 1,
          "Date": "2021-08-23T00:51:27.000Z",
          "Titre": "Product key did not work at first but..",
          "Contenu": "DigitalKeysBox promptly provided the product key.  I already have a Microsoft account and it was waiting for me to type in the key.  For some reason it kept rejecting the key even though I checked it over and over.  Really, I typed it in correctly!  I suspected fraud of course and I got very nervous.  I finally tried copy and past with the key and Microsoft finally accepted it.  Visio Professional 2019 is now up and running on my Windows 10 system so all is well.  I gave DigitalKeysBox only 4 stars because I had to have a beer afterwards to get calmed down."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Leonard",
          "Nb_Reviews": 2,
          "Date": "2021-12-12T17:56:52.000Z",
          "Titre": "My experience…",
          "Contenu": "The ordering process was easy. I had a problem installing my two products. I only received one product key. I had to email back and forth with the vendor until after two tries I finally received the second product key. Once received, installation of the second product was seamless. The vendor did respond quickly to my emails. I would purchase software through this vendor again now that I have a clue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nadine",
          "Nb_Reviews": 3,
          "Date": "2022-11-21T14:57:27.000Z",
          "Titre": "Issue with my key",
          "Contenu": "Since writing my review, DigitalKeysBox reached out to me and sent me a new key, so I am updating the below review from 2 stars to 4 stars.__________________________I had a problem with my last order for Microsoft Office 2021 for Mac.  I got an error message from Microsoft that read \"Contact whomever you got this code from. It can't be redeemed.\"I emailed support at their email listed, and I was sent a response the following day saying that I needed to log into my Microsoft account, but I had already done that and sent screen shots.  Then they did not respond again to my email when telling them it didn't work so they could aid in trouble shooting.  I emailed them again and am waiting for a response.A few days ago I tried to call their support number 585-666-0760, but that number is no longer in service.  So I turned to the chat.  In the end, the representative just told me to wait for an email because the rep didn't know what to do.The only reason I am giving them any stars is because I placed an order with them several years ago and it worked well.  This time, I am having issues with the key they provided, and they are not responsive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Buchele",
          "Nb_Reviews": 1,
          "Date": "2021-07-31T15:03:07.000Z",
          "Titre": "Good price, a bit of a bother but good tech support.",
          "Contenu": "Ordering and payment were easy through PayPal.  Downloaded the office suite, install code worked, but when it came to activation, the internet option said the license number had already reached its max number of installed.  Got online with help-chat, and was guided through the phone activation process, which was a bit of a bother but ultimately successful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Pitts",
          "Nb_Reviews": 1,
          "Date": "2020-09-21T21:48:25.000Z",
          "Titre": "The price was great",
          "Contenu": "The price was great! But the first key didn't work. Waited three hours like the instructions stated. It still failed so I contacted support where they gave me additional steps that also failed. So, they gave me another key, it worked on the first try. They did great with helping me get my Windows activated! Thanks! I will use them in the future. Customer support is top notch!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "STEPHEN C",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T06:59:46.000Z",
          "Titre": "Great value",
          "Contenu": "Great value.  Some minor problems activating the software (all self-inflicted). The directions were clear. I contacted DigitalKeys when I had my problem and they answered immediately (I was expecting a long delay in response time). I fixed the problem with Microsoft and have fully functional software at a very reasonable price. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan Cook",
          "Nb_Reviews": 1,
          "Date": "2020-09-21T23:09:45.000Z",
          "Titre": "I would recommend this website if you…",
          "Contenu": "I would recommend this website if you are looking for inexpensive option to get Microsoft Office. Product key they provided worked. There was a minor issue getting the software activated, but this was solved very quickly by contacting their 24/7 online chat. Excellent customer service. Only thing that was a little scary is that I got a email notification from paypal checkout that the payment went to a person whose name was in Russian. All seems legit, though."
        },
        {
          "Note": 4,
          "Lieu": "BM",
          "Pseudo": "Canucklehead",
          "Nb_Reviews": 1,
          "Date": "2020-12-20T01:57:10.000Z",
          "Titre": "Good price but need accurate activation codes first time",
          "Contenu": "Great sale price for Office 2019 Home & Business for Mac (even in US dollars for a Canadian spending CDN dollars). DigitalKeysBox just need to work out the wrong activation code upon purchase so the buyer doesn't have to contact support to get the right activation code. The buyer immediately thinks that they've been ripped off  by an online scammer until the glitch is eventually solved via several emails. Other than that I would recommend DigitalKeysBox to others and give them four stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Boehmke",
          "Nb_Reviews": 1,
          "Date": "2020-09-26T04:06:48.000Z",
          "Titre": "It wasn't explained initially what I…",
          "Contenu": "It wasn't explained initially what I had to to do, but when I did what they made me think I had to do and that didn't work, they got me straightened out.  I had to upgrade to Windows HOME computers to PRO so that I could control them remotely.  Everything works fine now after support told me what I needed to do."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Happy customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T20:55:54.000Z",
          "Titre": "Good deal. Great Service.",
          "Contenu": "Good deal. Great service. I was able to ultimately download and install the Office suite I ordered. Had a problem with the initial download key but customer support jumped on it immediately after I explained the problem via chat session and they issued another key."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "AJ",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T13:40:45.000Z",
          "Titre": "Registering the product was time…",
          "Contenu": "Registering the product was time consuming.  I purchased 2 keys for different computers.  Both had the same error message when I tried to register online.I had to call in both times spending over an hour on the line."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allison Phillips",
          "Nb_Reviews": 1,
          "Date": "2021-06-05T17:39:47.000Z",
          "Titre": "Thank you Customer Support",
          "Contenu": "My initial download did not contain the purchased software. Digitalkey Box Customer Support worked with me to rectify the problem.  I now have the software I purchased.  Thank you Customer Support"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2020-11-10T18:53:17.000Z",
          "Titre": "everything worked out great the…",
          "Contenu": "everything worked out great the directions were a little confusing and it took a few tries but all is good now.  It may be do to my skill level I have not done a new windows install for a very long time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Blaylock",
          "Nb_Reviews": 1,
          "Date": "2020-06-22T02:54:56.000Z",
          "Titre": "There were several issues were a link…",
          "Contenu": "There were several issues were a link wasn’t provided to download the software, or the license wouldn’t work, however, theY responded quickly and got the problems resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacquie",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T19:49:53.000Z",
          "Titre": "This worked great",
          "Contenu": "This worked great!  Not sure if it was me or the system but had to wait until the next morning for it to activate the code. More instructions would be awesome!!Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clifton Bomar",
          "Nb_Reviews": 3,
          "Date": "2020-12-27T20:38:03.000Z",
          "Titre": "Upgrade Worked at Considerable Savings",
          "Contenu": "I had a few issues at first, but I got immediate assistance from Customer Service which allowed me to complete the installation. All went well after that."
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "samur jinn",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:44:34.000Z",
          "Titre": "Impressed by the good prices",
          "Contenu": "Impressed by the good prices. Really good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol Stanley",
          "Nb_Reviews": 1,
          "Date": "2020-06-22T18:09:23.000Z",
          "Titre": "The service was wonderful",
          "Contenu": "The service was wonderful.  There was a little glitch & as soon as I contacted them, it was fixed! That rarely ever happens!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph",
          "Nb_Reviews": 2,
          "Date": "2020-08-13T17:27:38.000Z",
          "Titre": "Office Pro 2019",
          "Contenu": "Product as desbribed. Easy to follow directions to download. I would definitely recommend this website to anyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela Harley",
          "Nb_Reviews": 1,
          "Date": "2021-06-25T19:42:16.000Z",
          "Titre": "Product as promised",
          "Contenu": "Product as promised.  Contact them if you need assistance and they can help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Heitzer",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T16:48:54.000Z",
          "Titre": "Had a hard time getting it to down…",
          "Contenu": "Had a hard time getting it to down load,but there support teammade it easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Starhaven",
          "Nb_Reviews": 1,
          "Date": "2020-10-04T19:03:12.000Z",
          "Titre": "Good Support",
          "Contenu": "Key didn't work at first but support fixed it for me"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "farjaad farjaadsiraj",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T12:01:30.000Z",
          "Titre": "this is your article is very imprasive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol Hansen",
          "Nb_Reviews": 1,
          "Date": "2020-07-19T00:58:18.000Z",
          "Titre": "Downloaded program",
          "Contenu": "Downloaded program, Works, Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FNU Farheen",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T05:33:12.000Z",
          "Titre": "The product key they gave me is…",
          "Contenu": "I earlier gave a 1 star review because I thought they never responded to my email and gave me an invalid key. But when I checked my spam I had a response from them the same day I emailed them. After that I got immediate responses from them and the Microsoft key successfully worked"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sarithagray",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T21:23:13.000Z",
          "Titre": "No delay in response",
          "Contenu": "When I needed an updated link so I could download the right Microsoft Office, I was sent the link immediately. I works really well. I bought another one for my laptop as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MEGAN A VEASY",
          "Nb_Reviews": 4,
          "Date": "2023-11-18T13:40:32.000Z",
          "Titre": "Digital keybox is literally one of the…",
          "Contenu": "Digital keybox is literally one of the easiest ways to get copies of your keys. I love that they have cute designs and it just takes minutes..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine Pellegrino",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T05:38:24.000Z",
          "Titre": "Everything was smooth with the…",
          "Contenu": "Everything was smooth with the installation of the software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Camper",
          "Nb_Reviews": 1,
          "Date": "2021-09-14T07:05:41.000Z",
          "Titre": "Good Support",
          "Contenu": "Office key as purchased for Office worked but had issues w/pre installed portions of MS Office that came with new laptop....Giant headache needed a 64 bit link.  DigitalKeysBox helped out as requested. Apparently you need to unistall any pre installed Office files..download an MS POffice uninstall tool from MS...before you proceed. Finally got Office working with product key as provided...but MS makes it difficult if you don't sign up & buy an ongoing subscription to Office 365..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerred Walter",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T20:07:29.000Z",
          "Titre": "Great product and customer service",
          "Contenu": "Great product and customer service! Would highly recommend. I had an issue with my key not activating and they were prompt in replying and fixing my issue until I had an activated single us copy of MS office. Very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allen",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T01:58:25.000Z",
          "Titre": "Need to re-install software",
          "Contenu": "Response times to my initial and follow-up e-mails were   measured in just a couple of hours at most for each.  Suggestions and directions for solutions to fix issue were exact and clear.  Their patience with me was exemplary when I asked for further assistance.  Overall, a truly outstanding experience."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Karl",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T09:39:05.000Z",
          "Titre": "I ordered MS Office",
          "Contenu": "I ordered MS Office. Delivery was immediate after payment went through. The provided activation key worked without problems after deinstalling the old Office app and installing the new. I hope it will still work in case I have to reinstall Windows"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter Roeske",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T18:48:31.000Z",
          "Titre": "This organization is great",
          "Contenu": "This organization is great. I ordered, paid, & installed Office. Then I ran into a series of bad things. I could not get it activated. DigitalKeysBox came through & helped work out the problems. They come through providing  exactly what they advertise at a very reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Proctor",
          "Nb_Reviews": 4,
          "Date": "2023-04-15T20:30:30.000Z",
          "Titre": "Office 2016 reloading",
          "Contenu": "I had a motherboard failure on my laptop and I used the online live chat contact to  address the problem I had reinstalling Office 2016 that I had purchased from Digitalkeysbox.com. They provided me what I needed to reload Office and get it back up and running. Quick, professional and effective support. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Black",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T21:57:01.000Z",
          "Titre": "A lot of worry, for nothing. DKB.com is THAT great",
          "Contenu": "Lost my activation key (don't ask) and was afraid I'd have to \"threaten legal action with Paypal receipt).Not the case, at all. In fact, all I did was issue was name and email address and I received my activation key immediately.Talk about zero-stress problem solving/ resolution. I cannot recommend DigitalKeysBox.com enough. They are, without a doubt, amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Floyd",
          "Nb_Reviews": 4,
          "Date": "2023-06-07T21:58:17.000Z",
          "Titre": "EZ Support is 2nd to none!",
          "Contenu": "Made several purchases in the past; no problem. This time with a Win 10 Pro install on a Win 7 PC, I had my hands full. Thanks to DigitalKey's excellent EZ support! Had overlooked the basics! The Win 7 PC did not have the Service Pack installed. Felt like an idiot. Using the support advice, the Win 10 install worked like a charm! Thank you for quality products!"
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Oghmabandis",
          "Nb_Reviews": 18,
          "Date": "2023-08-04T16:23:58.000Z",
          "Titre": "MS keys website.",
          "Contenu": "Client support was very attentive and helped me to choose the right solution for my goals.The prices are also appealing. Recommend to everyone who needs cheap and fast MS products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "pjh",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T12:39:27.000Z",
          "Titre": "GREAT Software w/ GREATER Service at GREATEST Price !!",
          "Contenu": "Initially was hesitant when purchased good licensed software from DigitalKeysBox.com recently, BUT had a great experience working thru a kink in the system with the folks at DigitalKeysBox.com -- so much so, that I came back when more software was needed for a new system.Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Heath",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T16:15:15.000Z",
          "Titre": "DigitalKeyBox did an excellent job",
          "Contenu": "DigitalKeyBox did an excellent job of providing the software I needed.I was impressed with how fast way the transaction went.I will be using DigitalKeyBox again for more software."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ade",
          "Nb_Reviews": 2,
          "Date": "2023-03-13T17:17:44.000Z",
          "Titre": "This review is long overdue but due to…",
          "Contenu": "This review is long overdue but due to our systems upgrade, I was unable to write this review on time. The Company support was wonderful from the start to the finish, I was guided throughout the process of installing Microsoft office 2021. We actually bought 3 Microsoft office 2021 and the keys arrived within a few minutes after payment was made. I choose this company because of the reviews that I read about them and I wasn't disappointed with the services that I got."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Merski",
          "Nb_Reviews": 1,
          "Date": "2021-10-22T19:10:53.000Z",
          "Titre": "Purchase of Office 2019",
          "Contenu": "Support during purchase of a replacement of my MS Office 2019 was quick and smooth.  Very knowledgeable staff.Purchase was required as Office 2019 disappeared from my computer when on-line repair for issues Outlook occurred.  MS did not recognize my original Product Key and a replacement was needed.Support included assurance that should this happen again it will allow replacement on this laptop.  Many thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pinecliff HOA",
          "Nb_Reviews": 1,
          "Date": "2022-01-20T18:23:14.000Z",
          "Titre": "I had an issue with the license key…",
          "Contenu": "I had an issue with the license key after having to replace my laptop that failed.  These guys helped me make sure my license got properly configured on the new laptop after having some issues trying to authenticate with Microsoft.  Amazing support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George from Ontario, Canada",
          "Nb_Reviews": 4,
          "Date": "2022-07-24T13:20:23.000Z",
          "Titre": "My go to site for software.",
          "Contenu": "Digitalkeysbox has been my go to site for Windows and office software for many years. Not only are the items easy to purchase and well priced, the Customer service is excellent. I purchased software and didn't install it for a year. When I did, the install procedure changed. I reached out to customer service and they immediately replied and helped me out. They earned the 5 stars I'm giving them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "shusky",
          "Nb_Reviews": 1,
          "Date": "2021-10-16T04:28:45.000Z",
          "Titre": "good customer service, knowledgeable",
          "Contenu": "I was upgrading 2 computers from Windows 10 Home to WIndows 10 Pro. One product key worked and computer updated perfectly, the 2nd key did not work and I got error messages. I opened a chat window and was put in touch with Milana within 1 minute. I explained the problem to her, the first option she gave me did not work, but a different product key did work. She was knowledgeable and provided quick service. I'm pleased with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat and Linda Curry",
          "Nb_Reviews": 2,
          "Date": "2022-01-13T16:36:33.000Z",
          "Titre": "Great product. Good service. I'd do it again!",
          "Contenu": "I did my research and decided DigitalKeysBox was worth a try at the incredibly good advertised price.  So far, I am NOT unhappy. They upgraded my product and helped me fix a glitch that occurred after downloading the product.  The only unfortunate thing is that their 7/24 support service that advertised a 1 minute wait time was actually more like 1 HOUR.  But again, at this price, I'd do it again!  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret Robinson",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T21:17:32.000Z",
          "Titre": "You were very quick to respond",
          "Contenu": "You were very quick to respond - not the 10 to 12 hours as indicate when I started the contact.  That was very important.You knew exactly what I needed to provide and once received, you quickly sent me the information I needed to activate the product.Those are 2 very important factor issue resolutions when help is needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Klug",
          "Nb_Reviews": 1,
          "Date": "2022-05-30T13:05:54.000Z",
          "Titre": "DIGITALKEYSBOX - 5 STARS",
          "Contenu": "Folks, unless you are a company entity with 5, or more, computers, DIGITALKEYSBOX is, singularly, your best choice for downloading MS-Office. It's a one-time purchase for only one computer that is sold at a nominal price (around $35). So, even if you had 5 computers, it's better than an annual licence agreement with Microsoft.  And the support at DigitalKeysBox is exceptional!  Recently my hard drive crashed, and although my data was recovered, I was given Windows-11 instead of Windows-10 (my old O/S). Basically, my old version of MS-OFFICE  from DigitalKeysBox wouldn't download correctly.  I sent an email to the support team at DigitalKeysBox and within 24 hrs, I had the new product key at no charge.  These guys want to help, and I support them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "robert",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T01:08:27.543Z",
          "Titre": "Everything worked easy to install",
          "Contenu": "Everything worked easy to install. I did have a problem that I waited 9 months to activate the office pro key that I got with windows 10 so the key wouldn't activate i emailed them expecting them to tell me its past the time that they could help but nope got an email a few hours later with an updated key and I was all good with my office activation. I used another company before and couldn't get their key to work but digitalkeybox is the real deal. Highly recommend I will be coming back when I upgrade my other pcs to 10 pro."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck Y.",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T01:56:25.000Z",
          "Titre": "Just purchased and installed MS Office…",
          "Contenu": "Just purchased and installed MS Office Home and Student 2021after carefully researching DigitalKeysBox.  I simply followed the instructions and everything went fine.  I am just starting to use Word and Excel, so far so good. I would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Wolfe",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T18:25:53.000Z",
          "Titre": "Highly Recommend DigitalKeysBox",
          "Contenu": "I highly recommend purchasing from DigitalKeysBox for your software needs.  The price was very reasonable and there are many choices.  After your purchase, please use their staff to assist in getting the software downloaded correctly.  They are very prompt and will help virtually.  Their services are a must use for your computer needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Smolinsky",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T19:55:38.000Z",
          "Titre": "Great value and great service experience!",
          "Contenu": "I recently purchased an upgrade to go from Windows 10 Home to Windows 10 Pro from Trustpilot.  The price was very reasonable.  I had a bit of trouble applying the upgrade and used the online help.  The response was very quick, and my support agent Milana was very nice and extremely helpful.  She was even there to greet me after a reboot to guide me the rest of the way.  A great value and great service to boot.  Very uncommon these days.  Thank you Milana and Trustpilot for making the purchase and install of my software very seamless and efficient!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darren Adams",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T23:58:11.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Let me start by saying that I'm not very tech savvy.  After purchasing the Office suite of apps, I tried unsuccessfully several times to download and install them on my laptop.  Each time I would get an error message, which made absolutely no sense to me since I don't speak Techie.I reached out to tech support, and Milana was able to walk me through the steps to get to where she could access my computer remotely.  She then spent about an hour or maybe a little bit longer clearing room on my computer for the Office suite of apps, and then installing them for me.  All the while she was very professional and reassuring.  What took Milana an hour or two would've literally taken me days to figure out.  I can't properly express just how thankful I am for her assistance today, and I would definitely recommend DigitalKeysBox to whoever needs software. Thank you again for everything Milana.  You rock!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheila Grimes",
          "Nb_Reviews": 2,
          "Date": "2021-12-12T23:16:48.000Z",
          "Titre": "Not the version I was expecting!",
          "Contenu": "I downloaded Office 2016 for my laptop but isn't the same version as the one on my PC. It saves everything to the cloud, which I don't want, as I work on unpublished books. It's not user-friendly at all, and I'm finding it impossible to work with. After contacting their support team I realized I'd purchased a different version of Office 2016. The error was entirely mine! They did everything they could to help, even offered a replacement, but I managed to figure it out. The support team could not have been more helpful - my apologies for causing you all so much grief."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Mitchell",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T22:06:47.000Z",
          "Titre": "Excellent customer service and quick…",
          "Contenu": "Excellent customer service and quick response time.  My initial purchase did not work on my computer and this company responded promptly, gave me instructions on troubleshooting the issue, then ultimately sent another product key due to the first one not working.  They were very efficient and treated me with professional courtesy. Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christie Teater",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T15:02:15.000Z",
          "Titre": "I am so glad to have found this site",
          "Contenu": "I am so glad to have found this site.  I was able to buy Microsoft Office at a fraction of the price of other sites.  When I downloaded the software, I had major problems installing it--not their fault--I am 70 years old and didn't learn this stuff in school like you young whippersnappers! :)  I contacted digitalkeysbox.com at their support email address, and they worked with me until it was up and running. They were very patient and knowledgeable and were determined to get my software working for me.   I will be back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa",
          "Nb_Reviews": 2,
          "Date": "2022-01-22T15:00:19.000Z",
          "Titre": "Good Support",
          "Contenu": "I was having trouble getting the website needed to download Office. I went to chat and they gave me the direct link which was all I needed. I did need to uninstall the trial version of Office 365 which came with my new computer but after I did that installation was a piece of cake. Greg and Milana stayed on chat until setup was complete which took about 30 minutes. Support was great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ILoveGuppies",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T20:29:36.000Z",
          "Titre": "I place order for 1 Windows 10 Pro…",
          "Contenu": "I place order for 1 Windows 10 Pro license Activation key. It did not work. I contact DigitalKeysBox chat line on the web Browser. HelpDesk support remote into my computer and fix this issue in a couple of minutes. Excellent!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Williams",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T18:45:45.000Z",
          "Titre": "Great and fast service",
          "Contenu": "Great and fast service, worked exactly as expected. This is my second time using them.I added another laptop and needed another license, the process was painless and quick.Love that I can use PayPal, much easier and convenient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie Bruno",
          "Nb_Reviews": 4,
          "Date": "2021-12-04T17:45:51.000Z",
          "Titre": "Happy Customer!",
          "Contenu": "I had trouble re-activating my MS office when I had to re-install on a new computer. I did an online chat and a remote session and wella! Activation took no time at all!Very glad we purchased through DigitalKeysBox."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T22:46:05.000Z",
          "Titre": "DigitalKeysBox…Great Company!",
          "Contenu": "I would like to commend DigitalKeysBox for a purchase process that was flawless. I purchased the Microsoft Office package (2019) for my home computer by simply following the directions after purchase. All went as planned and the program was on my computer in a flash. Thanks DigitalKeysBox for providing this service!SD"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Carver",
          "Nb_Reviews": 4,
          "Date": "2021-10-20T20:17:02.000Z",
          "Titre": "Digital Keys Box was awesome to work…",
          "Contenu": "Digital Keys Box was awesome to work with.  After my purchase, I found Office already on my new laptop.  They helped me figure out that it was a trial, subscription version, and helped me uninstall it and made sure that the one time purchase version that I bought from them was securely installed.  They were most helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Taylor",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T19:40:42.000Z",
          "Titre": "Wow, what a deal.",
          "Contenu": "Wow!  What a deal.  Although I was apprehensive to purchase given the low price, the favorable reviews on this website plus the low cost convinced me to try it.  I followed the instructions regarding uninstalling previous versions and restarting my computer and the download and install were flawless. Excel and Word startup and open existing files so much faster than Microsoft 365 ever did.  Thankfully, I also received Outlook 2021 in the download for which I am very grateful.  Didn't realize I had received it initially and spent 3 hours trying unsuccessfully to get the mail program that comes with windows 10 to sync with my email server.  Fortunately, I found my previous Outlook.pst file and when I clicked on it Outlook 2021 opened and I had lost none of the emails I had when I last used the 365 version earlier in the day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sal",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T17:31:13.000Z",
          "Titre": "Great service…",
          "Contenu": "Quickly received by email the product key and link to download the installation file. It worked and now I have my upgraded PC. At first, I was hesitant because of the advertised low price. But after reading their website explanations, I gave it a try. I'm very happy I chose this method."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Serbin",
          "Nb_Reviews": 2,
          "Date": "2023-03-13T00:06:42.000Z",
          "Titre": "I came back for more!",
          "Contenu": "Selecting the product I needed, paying for it and the delivery all fell into place. They thought through the process and made it logical. Using Paypal for payment was a good decision. This is not my first purchase here. Came back for more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-19T17:51:52.000Z",
          "Titre": "Purchased Microsoft Office 2019 at a…",
          "Contenu": "Purchased Microsoft Office 2019 at a very reasonable, almost unheard of, price.  I had a few problems loading but that was my fault.  Asked for assistance and their  customer service was excellent! Don't be afraid to give them a try!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Albert",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T16:24:18.000Z",
          "Titre": "Worked Fine",
          "Contenu": "It took about 10 minutes to download, install, and activate. Very easy. There was only a few minutes of confusion over whether Office 365 was installed (They tell you to uninstall it is). I determined it wasn't and proceeded with no problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colette Merrill",
          "Nb_Reviews": 4,
          "Date": "2021-11-07T22:58:45.000Z",
          "Titre": "To the Rescue Again!",
          "Contenu": "This company answered all of my help calls accurately and quickly. I had trouble downloading Office the first time because I wasn't sure what to do. Even though I felt silly asking such simple questions, they answered me and told me exactly what to do and it installed perfectly. The second time I needed big time help was today. I bought a new computer and the download page wouldn't download Office again since it was a different computer. I contacted them once more and they got it downloaded for me in nothing flat. I would not be afraid to buy any product from them. The service is above average, and the answer time is unbelievably short."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike B",
          "Nb_Reviews": 2,
          "Date": "2021-12-11T22:11:39.000Z",
          "Titre": "Incredible Service",
          "Contenu": "Incredible Service!  I just purchased MS Office but, inadvertently, purchased the program for Windows and I’m a MAC user.  I wrote to the DigitalKeysBox support folks and explained my mistake.  Their response was very quick (surprising since it was on the weekend) and they provided me with the proper version for Mac which downloaded and installed without any difficulty.  Fantastic customer support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yvonne Culbertson-Abbate",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T21:56:31.000Z",
          "Titre": "I was having an issue downloading the…",
          "Contenu": "I was having an issue downloading the software , and they had so much patience with me. They responded back to me immediately and walked me through everything . They were extremely helpful, I’ll definitely purchase through here again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Humboldt Tech Solutions",
          "Nb_Reviews": 3,
          "Date": "2023-09-06T16:14:51.000Z",
          "Titre": "This business is awesome!",
          "Contenu": "This business is awesome!My business always purchases any Microsoft kids through them and they get delivered immediately, always work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Checa",
          "Nb_Reviews": 3,
          "Date": "2021-09-14T17:48:37.000Z",
          "Titre": "Easy Peasy!! :-)",
          "Contenu": "Quick, seamless download of MS Office 2016! Easy download and install then opened Excel and got straight to work in minutes. Great value! Highly recommend Digital Keysbox."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Michalski",
          "Nb_Reviews": 1,
          "Date": "2021-12-18T18:16:39.000Z",
          "Titre": "Had some difficulty getting the Office…",
          "Contenu": "Had some difficulty getting the Office product I purchased to install correctly.  Was getting frustrated, but the support group came to the rescue and quickly resolved the issue (Microsoft bug).  They saved the day quickly!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 3,
          "Date": "2022-11-28T21:57:23.000Z",
          "Titre": "Purchased a new key for Win 11 Pro and…",
          "Contenu": "Purchased a new key for Win 11 Pro and had installation issues.  Reached out to support which was excellent and very responsive!  They resolved my issue.  Would buy from digitalkeysbox without hesitation!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rajand Parsad",
          "Nb_Reviews": 4,
          "Date": "2022-07-28T21:23:34.000Z",
          "Titre": "Digitalkeybox is a great place to buy.",
          "Contenu": "Digitalkeybox is a very safe and quick sale outlet for safe and as advertised software at very good price and great value. I followed the instructions and it was easy, mostly automatic download. Thank you for your service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tntj yt",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T16:23:03.000Z",
          "Titre": "I had my system repaired Dell",
          "Contenu": "I had my system repaired Dell. My OS and and my MS Office was removed by Dell.  Milana was able to successfully and professionally restore my MS Office to my machine.  I'm so grateful of the speed and efficiency that Milana was able to resolve my issue.  What a great day for me.  Thank you so much.  It was wonderful to just sit back and watch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don M Stein",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T22:34:45.000Z",
          "Titre": "The Office product for my MAC is…GREAT",
          "Contenu": "The Office product for my MAC is working perfectly. I had a problem with installing but the \"DigitalKeysBox\" chat person walked me successfully through the installation. Thank you! All is working as it should. Great service and great price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael H.",
          "Nb_Reviews": 2,
          "Date": "2022-01-18T23:13:30.000Z",
          "Titre": "Easy, Reliable, and Secure",
          "Contenu": "Digital Keys Box works great!  The staff is very friendly, and downloading and installing is an ease.  I highly recommend them for downloading software, they are also very secure.  - Jane/Michael"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charatsri Neeladanuvongs",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T02:14:23.000Z",
          "Titre": "Malina is very responsive and…",
          "Contenu": "Malina is very responsive and professional.  Max is very knowledgeable and helped solve the problem.  Both of them have been very helpful and conducted themselves professionally.  They are assets to your company.  Thank you for all your assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Dixon",
          "Nb_Reviews": 3,
          "Date": "2021-10-21T20:30:05.000Z",
          "Titre": "Great technical support coupled with a…",
          "Contenu": "Great technical support coupled with a ton of knowledge and patience. Great help in walking me through the various steps & now everything works great. Will be contacting them again for software & support. 5 Starts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn Fujiwara",
          "Nb_Reviews": 2,
          "Date": "2022-01-06T03:35:58.000Z",
          "Titre": "I was having issues on my first install, but on the 2nd attempt all worked out well/",
          "Contenu": "I was having issues on my first install, but after I was able to remove all older office files, do a reboot  and a clean reinstall- i am back in action.  Very happy with the instruction provide about a a clean install."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan C",
          "Nb_Reviews": 1,
          "Date": "2022-09-18T23:07:44.000Z",
          "Titre": "Failed, Then Corrected with Valid Key.",
          "Contenu": "I ordered the MS Office PRO 2019. The original key failed. After contacting DigitalKeysBox, I received a new key with exact instructions to activate MS Office. It was effortless and worked like a charm!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 2,
          "Date": "2021-12-30T01:14:37.000Z",
          "Titre": "This website is legit",
          "Contenu": "This website is legit. The keys are real and the staff are actually helpful and willing to communicate with you and solve your issues. I bought Microsoft Office and it came as promised. Would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kathryn brinton",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T17:10:40.000Z",
          "Titre": "Thank you so much for the time and…",
          "Contenu": "Thank you so much for the time and patience in correcting my install problem.  The technician was awesome!  Shout out to Milina!!  Would definitely recommend your product and tech team!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alvin Dabhi",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T20:55:04.000Z",
          "Titre": "Fast and Efficient service",
          "Contenu": "Fast and Efficient service. After initial install, i ran into a download install. I reached out to Digital Keys via their chat option and one of their tech's jumped right on to help me clear it. Thank you once again for your help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C.L. Jones",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T12:41:17.000Z",
          "Titre": "Very good replacement for the original word program.",
          "Contenu": "This site will not give you a useable program unless you buy another program to go with theirs so stay away from this site, unless you just want to give them your money. I learned the hard way. my first review was not right, After a little help I had access to the program and I found that it worked better than the original word program. I like it much better. I wish I had taken time to be able to use it before I reacted so badly. I highly recommend this product and the company that stands behind it. Curtis"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherry Camp",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T14:48:00.000Z",
          "Titre": "I was having a hard time finding my…",
          "Contenu": "I was having a hard time finding my download and Greg was amazing walked me through each step. I will def use this site again!! Amazing customer service. You have been bookmarked and I will recommend you to everyone I know....."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Conant",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T18:10:07.000Z",
          "Titre": "Office 2019 Installation Trouble",
          "Contenu": "Had trouble finding the app in my Windows 11 new computer.  Chat with Digital Key Box brought up TeamViewer and they installed and activated the software, very timely, professional.  EXCELLENT!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. O.",
          "Nb_Reviews": 2,
          "Date": "2021-10-19T17:24:52.000Z",
          "Titre": "The technical help was spot on and…",
          "Contenu": "The technical help was spot on and resolved my installation issues.   The corrective follow-up did the job and I can start using the software.  Thank you IT people at DigitalKeysBox."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Putnam",
          "Nb_Reviews": 4,
          "Date": "2022-10-26T20:50:57.000Z",
          "Titre": "I was very happy to receive all of the...",
          "Contenu": "I was very happy to receive all of the information I needed to download and set up Office 2019 Pro. Super easy and convenient to get everything immediately. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 4,
          "Date": "2021-11-11T23:24:28.000Z",
          "Titre": "Very satisfied.",
          "Contenu": "The transaction was instantaneous and I received my key promptly.  I had an issue with activation, but support responded quickly and walked me through the process with success.  Very pleased"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henderson County G&M Society",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T16:43:18.000Z",
          "Titre": "Microsoff Office install issues",
          "Contenu": "While trying to install Microsoft Office I ran into some issues that were preventing the install. When I communicated this with DigitalKeysBox support, they provided additional information and web site links that helped me complete the installation. Their responses were timely and accurate."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Terri Prosacco",
          "Nb_Reviews": 2,
          "Date": "2023-01-16T12:01:47.000Z",
          "Titre": "Flash delivery!",
          "Contenu": "Flash delivery! Good prices. I have no questions! Ideal online shop with soft keys for Microsoft Office! Recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jan DeCourtney",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T15:20:03.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent, I'm fairly clueless when it comes to computers these days.  purchased an upgrade and they installed it remotely for me, so GREAT."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PA",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T00:25:25.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Very professional and knowledgeable. They were able to assist me quickly and I am very happy with the results. Would definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ralph",
          "Nb_Reviews": 2,
          "Date": "2021-12-26T18:20:26.000Z",
          "Titre": "Actual Programs and outstanding service",
          "Contenu": "I had problems installing Office, they were right there when I emailed them with two solutions. It installed and works great. I also bought Windows Pro and I had to reset my computer about a month later. I had lost the key for it. Again, they came to the rescue and sent the key after looking up the transaction. They are great to do business with and I highly recommend them. R.K."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dozer Roman",
          "Nb_Reviews": 7,
          "Date": "2022-02-20T22:49:50.000Z",
          "Titre": "Skeptics prepare to be proved wrong (jn a great way)",
          "Contenu": "I'm ALWAYS skeptical and cautious when it comes to purchasing software online, certainly when said software is from a company claiming to buy \"digital keys\" in bulk and sell for a massive discount.What sold me was the fact that I could pay for the software using PayPal and thus not have to expose my credit card information.Overall experience was \"couldn't be more perfect.\"1) Purchase was fast and easy.2)Instructions stating to \"remove ALL Office software preloaded on your computer\" were clear and concise (I had the following apps showing as installed, these were preloaded with my Windows10 software that I had purchased through Microsoft: \"Office\" and \"Excel\" and \"Word\". I uninstalled those).3) Followed the link for setup.office.com4) Followed instructions5) Launched Excel and was ready to activate software. I half expected to have to launch EACH app (Word, Power Point, etc.) and activate each one individually. Nope. The app asked me to validate software over phone or using internet. I choose \"Internet.\" It was practically instantaneous, thanks to Microsoft on that for having a fast network infrastructure.6) Came here to say THANK YOU to DigitalKeysBox for providing an easy, fast, safe, and secure purchase/ install and to let all you skeptics know, this IS 100% legit. I saved $120 at least that I would have otherwise spent using the Microsoft Store/ App purchase.Love and respect for all you do, DKB.com. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Zappala",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T02:07:31.000Z",
          "Titre": "So far I’ve been very happy with the…",
          "Contenu": "So far I’ve been very happy with the softwares download and execution. My main concern was actually receiving the an authentic Microsoft product key but the full key was received as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-09-29T13:43:42.000Z",
          "Titre": "Issue resolved quickly!",
          "Contenu": "I had an issue with one of two upgrade keys I purchased; I chatted with a rep and had the problem resolved in under ten minutes.  EXCELLENT customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl Rotruck",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:26:32.000Z",
          "Titre": "Quick and easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Norberg",
          "Nb_Reviews": 2,
          "Date": "2022-08-12T02:18:27.000Z",
          "Titre": "Successful",
          "Contenu": "The first time, the purchase didn't complete.  A few days later I tried again and managed to buy one key.  (I tried earlier to buy two, but now only one was available.)  I have bought keys repeatedly from this source and this is the only key source I have found where the keys always work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T19:26:34.000Z",
          "Titre": "They were great when I first purchased…",
          "Contenu": "They were great when I first purchased the software, but when my computer crashed and I had to start from scratch they came through.  They helped me get my software again.  I will be always going to them first for software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce A",
          "Nb_Reviews": 1,
          "Date": "2021-09-03T14:57:33.000Z",
          "Titre": "Office Pro Plus 2019 key delivered…",
          "Contenu": "Office Pro Plus 2019 key delivered within seconds.  Download and installation went smoothly.  Everything worked as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pringle",
          "Nb_Reviews": 1,
          "Date": "2021-10-11T13:13:48.000Z",
          "Titre": "Awesomely EASY!",
          "Contenu": "Awesomely EASY!! Installed Visio 2019 without any issues. License Key worked as advertised! I will definitely use DigitalKeysBox again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "chris rogers",
          "Nb_Reviews": 1,
          "Date": "2021-12-05T00:00:59.000Z",
          "Titre": "i wiped a hole pc and reinstalled…",
          "Contenu": "i wiped a hole pc and reinstalled windows i just bought a digital window key and it was instant had the key right after i paid and it worked with no issues"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erasmus",
          "Nb_Reviews": 4,
          "Date": "2022-03-11T12:24:19.000Z",
          "Titre": "Purchased MS Office 2019 Professional…",
          "Contenu": "Purchased MS Office 2019 Professional Plus at amazingly low advertised price, and download and installation were quick and easy. I am truly impressed and will share my experience with anyone looking for the software you carry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LC",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T17:00:46.000Z",
          "Titre": "Fast and easy to install",
          "Contenu": "Fast and easy to install, if you currently have a Microsoft account. It will not require you to uninstall Microsoft 365, you can change the license."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dylan K",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T19:28:55.000Z",
          "Titre": "I had received errors when I put in the…",
          "Contenu": "I had received errors when I put in the activation code and I sent them an email requesting help and they got back with me within the hour and told me how to fix it and it worked like a charm!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony W",
          "Nb_Reviews": 2,
          "Date": "2022-07-24T15:12:57.000Z",
          "Titre": "Software arrived as described",
          "Contenu": "Software arrived as described, quickly, seamlessly installed, working great. One of the best deals out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony W",
          "Nb_Reviews": 2,
          "Date": "2022-07-24T15:12:28.000Z",
          "Titre": "Software arrived as described",
          "Contenu": "Software arrived as described, quickly, seamlessly installed, working great. One of the best deals out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge",
          "Nb_Reviews": 6,
          "Date": "2021-12-04T12:16:00.000Z",
          "Titre": "These people are great",
          "Contenu": "These people are great. Great prices, fast delivery and  extremely good service and issue solving.I recommend them fully ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "don kaufman",
          "Nb_Reviews": 5,
          "Date": "2022-02-24T14:52:46.000Z",
          "Titre": "I got what I ordered at great price  plus online chat…",
          "Contenu": "I got what I ordered plus online chat for installation support. Completely satisfied with $$ and to not do biz with MS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. O.",
          "Nb_Reviews": 2,
          "Date": "2023-03-12T22:52:23.000Z",
          "Titre": "Milana knew her product and she did an…",
          "Contenu": "Milana knew her product and she did an excellent job of keeping a customer satisfied.  Knowledge of software products was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C Wright",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T22:08:32.000Z",
          "Titre": "Customer Service Rocks!!",
          "Contenu": "I was switching from Office 365 to Office 2021 and was having issues. I emailed what was happening and in a few short steps the issue was solved. Great service!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Floyd",
          "Nb_Reviews": 4,
          "Date": "2023-05-02T22:07:32.000Z",
          "Titre": "EZ to use",
          "Contenu": "EZ to use! Excellent guide (and price)! All genuine, no problems! Will purchase from company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nikki",
          "Nb_Reviews": 2,
          "Date": "2022-02-05T15:59:13.000Z",
          "Titre": "Had a little hiccup installing it but I…",
          "Contenu": "Had a little hiccup installing it but I got on the online chat and Milana was extremely helpful!! I definitely appreciate the assistance and am happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TD",
          "Nb_Reviews": 3,
          "Date": "2021-12-10T20:19:55.000Z",
          "Titre": "Quick and easy installation and activation of authentic Microsoft software",
          "Contenu": "I was unsure whether DigitalKeysBox (DKB) is legitimate. I decided to make a one-time purchase of a lifetime license of Microsoft Office Professional Plus 2019 with DKB on Dec. 6, 2021 in part because of the high 4.9/5 rating of DKB on Trustpilot based on 327 reviews at that time, although there are reports that Trustpilot may contain fake reviews. I was surprised when PayPal informed me that my payment was made to an entity that appears Russian. However, the installation and activation process described on the DKB product webpage before my purchase using a legitimate Microsoft website and the product key provided by DKB after my purchase was accurate, quick and easy, and the Office Professional Plus 2019 I installed and activated on my PC is the authentic Microsoft software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Veronica Picon",
          "Nb_Reviews": 2,
          "Date": "2022-11-25T21:12:01.000Z",
          "Titre": "Milana was amazing at solving an issue…",
          "Contenu": "Milana was amazing at solving an issue while downloading Office 2021. She was knowledgeable and super fast.Thanks for a terrific service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Campbell",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T10:32:55.000Z",
          "Titre": "4 times purchasing from digitalkeybox",
          "Contenu": "4 times I've purchased a product key for office suite for a client. Worked every time i have used them. Definitely buying again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "g lee",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T00:16:33.000Z",
          "Titre": "Worry free assistance with install & activation",
          "Contenu": "Agent assisted with the install and helped correct one minor problem.  No pressure, install and activation seemed smooth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 3,
          "Date": "2022-11-26T15:29:49.000Z",
          "Titre": "Great Site and Support",
          "Contenu": "Have used DigitalKeysBox before with no problems.  Keys are delivered within a few minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ANITA",
          "Nb_Reviews": 2,
          "Date": "2021-10-15T19:40:16.000Z",
          "Titre": "could not be happier",
          "Contenu": "I just downloaded MS Office ..Not only was the price amazing but Milana stayed on the chat with me all the way through it.  I couldn't be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R.Caz",
          "Nb_Reviews": 1,
          "Date": "2021-09-05T19:36:49.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent.  Took less than 10 minutes from purchase to activate and install.  No problems; very easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Rackham",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T15:00:09.000Z",
          "Titre": "Great price and VERY fast service",
          "Contenu": "Great price and VERY fast service. Absolutely no drama The next time I need software I will check here first before paying full price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHN JR",
          "Nb_Reviews": 3,
          "Date": "2022-01-01T02:46:30.000Z",
          "Titre": "I needed Microsoft Office so I found…",
          "Contenu": "I needed Microsoft Office so I found this website.  Best price and the product key was delivered instantly to my email.  Everything works great. Highly recommend."
        }
      ]
    }
  ]
}