{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "directdeals.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordan",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T20:05:56.000Z",
          "Titre": "Scam software site",
          "Contenu": "Purchased $500 in software, never received it. If you want to order from them try calling their \"24x7\" support number first... no one ever answers it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JACK JR  ATNIP",
          "Nb_Reviews": 3,
          "Date": "2021-11-06T03:53:56.000Z",
          "Titre": "I purchased an office program for $139",
          "Contenu": "I purchased an office program for $139.  It was never delived nor a note explained why it wasn't.  I called and talked to a person that could not understand simple English or wanted me to think he wasn't able to understand. I am completely dissatisfied with your service and would prefer to have my payment returned or have the program delivered post haste.  There is no way I would trust these thieves again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 5,
          "Date": "2021-08-26T14:01:25.000Z",
          "Titre": "Purchased software for instant…",
          "Contenu": "Purchased software for instant download, still waiting 3 days later.  Company blames it on paypal but are unwilling or unable to take care of the issue.  Now I have to wait for 7 days to make sure the charge comes off before I purchase again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Russ",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T22:40:00.000Z",
          "Titre": "I didn’t get my order and it was never…",
          "Contenu": "I didn’t get my order and it was never explained why. I ordered a Windows 10 LTSC license which I understand are hard to get, but at least give me an explanation as to why my order was canceled. Thank you for refunding the money at least."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Radek Urban",
          "Nb_Reviews": 1,
          "Date": "2021-11-16T18:19:26.000Z",
          "Titre": "No answer",
          "Contenu": "Started a support ticket about my purchase, didn't get an answer.They replied to my review though, unclear why it's easier to communicate via review than via their support email."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 9,
          "Date": "2021-10-12T01:43:41.000Z",
          "Titre": "Didn't receive the order.",
          "Contenu": "I ordered Windows 11 Pro last Friday and I still haven't gotten the product code in my email - just this request for a review. I think I deserve and explanation as to why my purchase is so late;"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NA",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T13:27:42.000Z",
          "Titre": "Bought 2016 Project.",
          "Contenu": "Bought 2016 Project.. Key didnt work...Got upgraded supp to 2019.. and new key still didnt work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darren",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T20:51:21.000Z",
          "Titre": "I have ordred office 2019 keys about 20…",
          "Contenu": "I have ordred office 2019 keys about 20 of them and about 3 or 4 have been bad keys."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T00:13:47.000Z",
          "Titre": "100 app that has nothing to do with…",
          "Contenu": "100 app that has nothing to do with windows.  So not happy"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "yoav kadosh",
          "Nb_Reviews": 2,
          "Date": "2022-06-01T16:56:34.000Z",
          "Titre": "Never got the product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 2,
          "Date": "2021-02-15T03:18:54.000Z",
          "Titre": "How can I review a product I haven't received !",
          "Contenu": "I received a review request before my product. Can't review something I don't have. That's why you get 1*"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2021-02-01T03:09:09.000Z",
          "Titre": "Poor customer service",
          "Contenu": "Poor customer service. Keys fail to install, or stop working months later. Switching to a different vendor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AirWing Systems",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T00:52:00.000Z",
          "Titre": "Painful Experience",
          "Contenu": "Each purchase I have made seems to be plagued with the absent of the software key. They say the sent it, but it's not in my spam or anywhere. Finally I do get it When they send a second time."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T03:05:46.000Z",
          "Titre": "Office Home and Student Purchase",
          "Contenu": "I was sent a non-functioning key for Office Home and Student.Customer support was quick to rectify the problem, but, in doing so, they sent me a key for Office Professional and now I have extra software that is taking up space on my computer and that I will never use. On the other hand, at least I can move this package to a new computer when the time comes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2022-10-10T15:29:54.000Z",
          "Titre": "When we make a purchase",
          "Contenu": "When we make a purchase, we almost instantly get the license key.  This is a great asset for us when it comes to upgrading software for one of our clients."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T21:21:47.000Z",
          "Titre": "They almost earned 5 stars but….",
          "Contenu": "I would have given more stars if the first Key Code sent had allowed me to install the product. A lot of trouble on my part was needed to finally get a new Key code and a Direct Deals employee had to to remotely install it. Since my internet is very poor, I had to drive 30 miles to the nearest location with sufficient internet speed to complete the download but since the first key code didn’t work, I had to do that on two different days. I appreciate the professionalism of the Direct Deals staff and I would possibly consider buying from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cameron Stokes",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T13:57:46.000Z",
          "Titre": "Will Use Again, Recommend",
          "Contenu": "Fast, legitimate licensing for Windows products. Had trouble authenticating my credit card, but was able to call support and quickly speak to a real human who helped me right away. Recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "P. Berube",
          "Nb_Reviews": 6,
          "Date": "2022-01-19T23:46:09.000Z",
          "Titre": "I purchased a version of Microsoft…",
          "Contenu": "I purchased a version of Microsoft office from DD and mistakenly puchased one without the program I needed. One of their customer service reps let me pay the difference to get the right one and helped me install it  Was happy for the help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T15:39:52.000Z",
          "Titre": "You guys are pretty good",
          "Contenu": "You guys are pretty good.  I still feel uncomfortable buying licenses online but because I've had bad experiences, but I don't think so with you guys.  I'll keep using you guys."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Hipolit Adamski",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T15:33:41.000Z",
          "Titre": "This is the working format that suits…",
          "Contenu": "This is the working format that suits me. There are no additional expenses. I didn't see any delays or anything."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fedex",
          "Nb_Reviews": 2,
          "Date": "2021-10-26T16:23:19.000Z",
          "Titre": "After waiting throught a chat for help…",
          "Contenu": "After waiting throught a chat for help someone called me and waited until my download was complete.., I appreciate that"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dillon",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T15:19:25.000Z",
          "Titre": "Had to send photos of credit card which…",
          "Contenu": "Had to send photos of credit card which was unusual and time consuming. Rest of shopping experience was 5 star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T18:59:04.000Z",
          "Titre": "Good experience on the whole",
          "Contenu": "Good experience on the whole. The order was wrong at first but quickly got corrected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2021-10-31T22:24:39.000Z",
          "Titre": "The need that I purchased Windows 11 I…",
          "Contenu": "The need that I purchased Windows 11 I was unable to download the program due to slow processor on my computer your team offered help but I have deleted that contribution until I get my laptop back from service approximately two weeks I did not give you a higher standard simply because I haven't really used the service yet"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "RET Customs Brokerage",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T15:29:46.000Z",
          "Titre": "Instant delivery of products and great…",
          "Contenu": "Instant delivery of products and great service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T20:38:21.000Z",
          "Titre": "Prompt and valuable support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Idaho Tators",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T18:15:24.000Z",
          "Titre": "Very smooth transaction!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 1,
          "Date": "2019-09-17T05:16:31.000Z",
          "Titre": "Took a couple of tries",
          "Contenu": "I purchased the Microsoft Office 2016 software for around $70 and received a download link. I entered the product key and everything seemed to work fine until I actually opened Microsoft office and received an activation popup window. Basically, it said that the activation key had already been used the maximum number of times. I contacted the company and they sent me a new key. Same problem. I'm waiting for a new key, but I'm pretty sure I've just been scammed. Hoping that this review will help other people to avoid being taken advantage of. (Am simply looking for a place to buy a legitimate older version of Microsoft office and thought that DirectDeals would be trustworthy since they claim to be a Microsoft partner, but alas they are not).UPDATE: September 16, 2019It took a couple of tries but now I finally have a working activation key. Am satisfied with my Microsoft Office 2013."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Eric e",
          "Nb_Reviews": 1,
          "Date": "2021-12-24T20:37:50.000Z",
          "Titre": "Direct deals is Great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2021-02-04T22:43:23.000Z",
          "Titre": "Pretty simple process ordering and…",
          "Contenu": "Pretty simple process ordering and downloading software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T22:41:29.000Z",
          "Titre": "Got product as advertised and worked…",
          "Contenu": "Got product as advertised and worked great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Browner",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T06:27:42.000Z",
          "Titre": "Microsoft Office 2021 Professional Plus",
          "Contenu": "They helped my father install Microsoft Office 2021 Professional Plus. They even set up the Office Shortcuts for him."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frieda Ruppaner-Lind",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T23:23:10.000Z",
          "Titre": "Great experience!",
          "Contenu": "Great, fast and efficient help with an activation issue for Windows 11 on a new PC!This was definitely a great experince with customer service. I reveived a quick response by email and the representative was extremely helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stanley",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T16:09:08.000Z",
          "Titre": "Updated Review: Amazing Customer Service",
          "Contenu": "UPDATED REVIEW: I want to thank Mr. Suraj Das for all of his assistance. His customer service was amazing and professional. I highly recommend him and the services the company provides. It's not often that you get this type of customer service. Item purchased not delivered. Tracking shows stuck in mobile. Called facility and they had no information. Item was scheduled to be delivered today 3/28/23."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 2,
          "Date": "2022-06-17T00:06:23.000Z",
          "Titre": "Surprisingly Great Deal",
          "Contenu": "I hadn't heard of DirectDeals, LLC before so needless to say, I was concerned about purchasing a knock-off copy of MS Office rather than a legit copy.  I took the chance and was pleasantly surprised.  My activation key was acknowledged by Microsoft and I was off to the races using the software.  The purchase, download and activation were quick and easy. I've made two purchases from the company thus far and have been quite satisfied both times.  I will most likely make more purchases in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ElsieTerrier",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T18:21:22.000Z",
          "Titre": "Wonderful & Trustworthy Company",
          "Contenu": "Wonderful & trustworthy company.  We were having problems installing MS Office 2019 and Ankush was able to fix multiple errors that did not pertain to our purchase DirectDeals.  Ankush went above and beyond to help us install MS Office.  Thank you so much, Ankush."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T20:55:11.000Z",
          "Titre": "Needed to rebuild an old server with…",
          "Contenu": "Needed to rebuild an old server with Win Server 2012R2, and was able to quickly purchase and download ISO immediately. That version unfortunately would not load, so we decided to try WS2012 instead. Was able to easily exchange the purchase and within 45 minutes not only had a response, also had the version needed. On a Saturday. Server is once again working."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Boyd",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T22:02:28.000Z",
          "Titre": "Great customer service with Suraj",
          "Contenu": "I got a new laptop with windows 11 home, wanted to upgrade to windows 11 pro. Microsoft store, bought it and it didn't install, gave an error instead. Lost $100.  When to Direct Deals, they got me the activation key right away, still had problems getting it activated. Then Suraj jumped on my machine with teamviewer and fixed my problems. He also did a few updates and got the license activated in no time. Made my day, will do business with them again in the future. Better than doing business with Microsoft."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cherie",
          "Nb_Reviews": 2,
          "Date": "2022-05-04T16:05:53.000Z",
          "Titre": "Excellent service, definitely recommend!",
          "Contenu": "This was my first time ordering from DirectDeals. I purchased SQL Server 2019 and SQL Server 2019 user CALs. Our IT consultant told me I should have purchased a SQL Server 2019 device CAL, and DirectDeals exchanged it without a problem. They also set up our Microsoft tenant. Their customer service was very helpful and responded quickly. I would definitely use DirectDeals again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Stallard",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T02:36:45.000Z",
          "Titre": "DirectDeals LLC",
          "Contenu": "Ankush, was excellent!!  He helped me download my Microsoft Office software and set it up on my computer.  I couldn't have done it without his expert knowledge and know-how. He had a tremendous amount of patience and was able to communicate to me what I needed to do to help him while he fixed my computer email.  He ensured all the programs that were downloaded worked perfectly before he left.  EXCELLENT CUSTOMER SERVICE!!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick DeBari",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T19:45:44.000Z",
          "Titre": "Direct Deals",
          "Contenu": "Ankush was incredibly helpful with setting up Outlook 2021 remotely for me and also importing my old pst files. He was extremely patient with me on the phone for a very long time. The support from Direct Deals was incredible. Highly recommended!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judith",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T17:23:45.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "While the item purchased was not compatible or what I needed for my device, Direct Deals refunded my payment and provided tech support for other options available for devices I own. Gayle , owner of Direct Deals called me personally to see how he can provide better service for my technology needs. Thank you for your time."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Frank Mitchell",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T15:03:08.000Z",
          "Titre": "Just received my first order from…",
          "Contenu": "Just received my first order from Direct Deals, a Bosch vacuum cleaner. Good communication from the vendor throughout the process. Purchase arrived in good order and is exactly as described. Ordered on a Thursday evening, delivered to George mid-day Monday. Very, very happy."
        },
        {
          "Note": 5,
          "Lieu": "TZ",
          "Pseudo": "Douglas",
          "Nb_Reviews": 2,
          "Date": "2022-05-02T06:24:24.000Z",
          "Titre": "Challenges overcome for a unique situation. Happy with results.",
          "Contenu": "Had a challenging start due to my unique situation.  The company reached out to me to explain the situation and to work with me. Took a few emails and photo verification, but I received legitimate keys to products advertise.  I will order again soon. I have several purchases to make.  Currently installing Office 2021 on a computer from my first purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TD",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T12:41:39.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy. I wanted to upgrade my current Office 2013 to the latest version Office 2021 and found DirectDeals online with a very competitive price.  A few clicks to order the product and within minutes, I received email receipt of the purchase and separate email with the download link and product code. The code is registered with Microsoft that will allow me to install on another device should I upgrade my laptop in the future.  This is how I'll buy software going forward.  No more looking for CD/DVD to install/reinstall software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 1,
          "Date": "2021-07-27T03:36:36.000Z",
          "Titre": "You were fantastic with the scenario I…",
          "Contenu": "You were fantastic with the scenario I was faced with.  I needed Remote Desktop user licenses on an account I took over from another IT provider that wasn’t keeping up with the end user needs.  I ordered the license late Sunday and I had the license key I needed by 8 am Monday.  This allowed multiple users to be able to access their Remote Desktop profile by 830 AM Monday morning.  Great job!  Definitely will be using you going forward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2021-10-20T13:34:45.000Z",
          "Titre": "DirectDeals.com rules above all others",
          "Contenu": "DirectDeals.com rules above all others. Easy purchase process and received our product key within minutes, there were no problems at all with activation.We use DirectDeals.com for software licensing whenever we can."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew Fischer",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T22:37:07.312Z",
          "Titre": "Recently purchase software and some troubleshooting",
          "Contenu": "I purchased some software through DirectDeals and had some technical difficulties with obtaining my downloads and getting them formatted.  I engaged their chat support and Ankush was able to help me troubleshoot the various issues and get me on my way.  He was very knowledgeable and a pleasure to work with.  I wouldn't hesitate to recommend DirectDeals to anyone.  Thanks, again to Ankush for his help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erik",
          "Nb_Reviews": 1,
          "Date": "2021-12-24T20:24:55.000Z",
          "Titre": "Trouble with Product Key",
          "Contenu": "I purchased MS Office but was unable to make the product key work. I contacted support and Suraj was able to get the whole thing sorted out. He was very patient with my frustrations and I very much appreciate his capability to troubleshoot. Everything seems to be working great now.  Thanks for your help Suraj."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 9,
          "Date": "2021-06-27T16:48:57.000Z",
          "Titre": "The Windows Pro was what I needed at…",
          "Contenu": "The Windows Pro was what I needed at just the right time and price. I bought it on a Saturday, so the download was delayed some. The email explained about after-hours purchases. I thought I would have to wait until Monday, but I was pleasantly surprised when the download arrived a couple hours later, The product key was valid, and the installation went perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Former Suwanne, GA Homeowner",
          "Nb_Reviews": 2,
          "Date": "2022-08-01T20:20:20.000Z",
          "Titre": "1st time customer will definitely be return customer",
          "Contenu": "I ordered my first software from DirectDeals and the experience was exceptional…4.9 of 5 stars!!  Anamul was patient, answered all questions, and quickly processed the order!  The download process was flawless except for entering the key was for an upgraded version.  Called Anamul and he stated what I ordered was out of stock and DirectDeals gave me a free upgrade (no extra cost)…wow, now that is outstanding customer service!  The only problem I encountered was the phone connection had a lot of static interference and was difficult to hear Anamul.  Strongly recommend buying from DirectDeals!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cherie",
          "Nb_Reviews": 2,
          "Date": "2022-08-24T16:01:02.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! We had a problem with a product that we purchased from DirectDeals. I emailed Customer Service and received a response and resolution within a day. They not only replaced the product but sent instructions on how to troubleshoot the installation and then followed up to make sure that it was installed and working properly. Great prices and great service. I highly recommend DirectDeals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mishelay Miller",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T23:18:35.000Z",
          "Titre": "Great communication and customer…",
          "Contenu": "Great communication and customer service. My computer had a lot of issues and they were good at helping me figure our the best thing for my computer.  I would highly recommend DirectDeals.  Thanks so much for all of your help. Ankush helped me a lot."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T17:29:24.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service.  The sales rep was able to work with us and our service provider to determine the correct edition for us.We got a quote done up almost immediately, and the premade shopping cart was astounding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn Hughes",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T21:10:12.000Z",
          "Titre": "Direct deals LLC",
          "Contenu": "Ankush, This technician was GREAT, he was very clear in making sure I understood everything.  He was very, very patient with me. I would recommend your company to everyone because of his knowledge and professionalism with me as a potential customer.Carolyn Hughes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 2,
          "Date": "2021-10-22T20:12:07.000Z",
          "Titre": "It's always great buying from…",
          "Contenu": "It's always great buying from DirectDeals.  I appreciate their competively-low prices and when I have a problem they are quick to reply and work with me on a resolution.  I and my company have been doing business with them over the years and I have zero doubt we'll continue to do business with them in the future.  DirectDeals is our go-to for any of our software and licensing purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T23:08:58.000Z",
          "Titre": "This was fantastic support!!",
          "Contenu": "This was fantastic support!!Suraj did the job after we figured out it was some crazy Microsoft querk on reloading the machine...  With my order number he was able to give me a new key that worked.  --- big not here - don't loose your order number!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 3,
          "Date": "2022-08-11T02:59:54.000Z",
          "Titre": "Suraj hung in there until I was Fixed !",
          "Contenu": "Suraj stayed with me on a technical issue until it was resolved.  He's a good support specialists and I am happy with DirecDeals (this was my 10-12th purchase from them over last 5 years)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Satisfied in Alabama",
          "Nb_Reviews": 3,
          "Date": "2021-05-24T13:27:21.000Z",
          "Titre": "Fast to respond",
          "Contenu": "Fast to respond, Great PricesI have been dealing with Direct Deals for a long time and have always found them to be very responsive. Never have any problems registering or activating software. Most often purchase Microsoft office."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Duffy",
          "Nb_Reviews": 2,
          "Date": "2022-12-11T18:13:56.000Z",
          "Titre": "I have been using Direct Deals for…",
          "Contenu": "I have been using Direct Deals for years now and even have my own account.  Whenever I have an issue they resolve it very quickly with no problems.  I had a purchase that was a few years old and they even helped me there when I installed it on a new computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy Mills",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T13:35:43.000Z",
          "Titre": "I would highly recommend DirectDeals.",
          "Contenu": "If you are looking for a place to buy stuff online, I would highly recommend Direct Deals. I ordered the wrong product but their customer service was great. They checked on the correct product and provided an option to exchange it. The exchange process was quick and easy. I received my new product quickly. I will definitely buy from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bobkat",
          "Nb_Reviews": 2,
          "Date": "2022-02-28T23:52:19.000Z",
          "Titre": "Best place to shop for Microsoft products",
          "Contenu": "After my order for a Microsoft product was confirmed and then found to be unavailable, the DirectDeals team immediately offered me an upgrade to a more recent version at the same price.  Then when the Activation Code failed, they provided me with another which did eventually work after jumping repeatedly thru the hoops imposed by Microsoft.This is not my first purchase of Microsoft software from DirectDeals and I have always been impressed with their prices and support. I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ulyses",
          "Nb_Reviews": 2,
          "Date": "2021-05-13T19:03:37.000Z",
          "Titre": "Best online store for Windows licenses, super fast delivery",
          "Contenu": "I got a new server and I needed a Windows Server license ASAP, I went ahead and place the order with Direct Deals and almost instantly, I received my new Product Key. Excellent service, super fast E-delivery. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "System Admin",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T13:51:35.000Z",
          "Titre": "DD is a professional’s source for software…",
          "Contenu": "I’ve successfully relied on DirectDeals for many years for both the business computer network I am responsible for, as well as my personal computer network. In all, over 40 servers/PCs. DD has been unfailingly prompt (within 20 minutes of ordering) in delivering the various software. The instructions for downloading & installing that come with each emailed software is concise and correct. The one time I screwed up using an Office Key, DD’s customer service via email was quick to reply and allow me to recover even though it was MY mistake in deploying it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MAC",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T18:59:38.000Z",
          "Titre": "I have been using Direct Deals for a…",
          "Contenu": "I have been using Direct Deals for a while now, I am especially happy to see them on the Microsoft Trusted Partner list.  That aside, every time I have requested post sales support they have been very diligent and responsive solving my issue 100% of the time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2021-09-10T22:53:49.000Z",
          "Titre": "I was impressed with the rapid response…",
          "Contenu": "I was impressed with the rapid response to my questions and requests.  There customer service is \"old school\", courteous and friendly, I have kept their info in the event that I am ever in need  of their services / products in the future.  Thank you to each of the gentlemen I spoke with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T00:45:53.000Z",
          "Titre": "DirectDeals has been a great help in…",
          "Contenu": "DirectDeals has been a great help in getting the software my organization needs right at the time we need it.  Keith and the team over there are incredibly responsive and always willing to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DMA_staff",
          "Nb_Reviews": 1,
          "Date": "2022-02-25T18:39:19.000Z",
          "Titre": "Excellent prices",
          "Contenu": "Excellent prices! Have purchased various MS Office products from them since 2018. Recently purchased various MS Office Pro 2021 and all product keys work fine. Product keys were delivered same day they were purchased. Saved a lot of money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spike",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T17:31:30.000Z",
          "Titre": "Always quick and easy",
          "Contenu": "Always quick and easy! If everything in life went as smoothly software ordering from DirectDeals, I would be one happy camper. Even after having to transfer Office 2013 from a failed computer to a new one, the download and the Product Keys still worked.Keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted R",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T23:01:03.000Z",
          "Titre": "Ankush",
          "Contenu": "Ankush, gave exceptional service - patient, reassuring and competent.  I will be happy to recommend Direct Deals to anyone.  This is what you need and expect from a reseller at the highest levels."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2021-09-18T14:56:53.000Z",
          "Titre": "A Trustworthy Software Reseller",
          "Contenu": "I have been dealing with DirectDeals for almost 7 years and have only had one issue in the entire time, and that issue was resolved within an hour or so of the purchase. These guys are great and I would recommend them to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARY RICHARD",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T19:29:23.000Z",
          "Titre": "This was a very pleasant experience",
          "Contenu": "This was a very pleasant experience. Suraj is very pleasant and patient and I was totally lost without his knowledgeable expertise.  I am most appreciative for such assistance and I will be happy to tell my friends of this experience. I do appreciate DD especially because of Suraj."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2021-07-06T13:56:18.000Z",
          "Titre": "Very Positive Experience",
          "Contenu": "Transaction was easy. However they did send me the wrong Product Key which I sent an email of notification. They were on it and was able to get the correct key the next working day since it was 4th July. Very happy with the communications I got on this and the end product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathryn Doyle",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T17:09:48.000Z",
          "Titre": "I had a very positive experience with resolving a downloading issue of a purchased product.",
          "Contenu": "I had a very positive experience with DirectDeals. I had an issue downloading a product and they were very responsive to problem solving the issue even over the weekend. Special thanks to SURAJ for his quick email responses and his assistance in resolving the issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Lengel",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T19:29:52.000Z",
          "Titre": "Performance Review",
          "Contenu": "Exceeding helpful and patient.  It was a pleasure working with someone that really cared about the customer.  We need more response like this.Thank you,Terry Lengel"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Redman",
          "Nb_Reviews": 2,
          "Date": "2021-08-07T19:08:39.000Z",
          "Titre": "Successfully downloaded",
          "Contenu": "Successfully downloaded, installed and activated my copy of windows 7. Always my go to source for software. Has worked very well multiple times in the past"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connie Wharton",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T18:34:26.000Z",
          "Titre": "Ankush",
          "Contenu": "Ankush, Thank you so so much! Your service was absolutely spot on! Very professional and you knew exactly what you were doing, very knowledgable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marylou",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T20:11:33.000Z",
          "Titre": "Ankush and Suraj",
          "Contenu": "Ankush and SurajVery Patient and Great customer service,so very appreciative of their help and knowledge!Thank you so much,Marylou"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nevin",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T04:29:12.000Z",
          "Titre": "Product code was good",
          "Contenu": "Product code was good. No issues. Wasn’t sure about site at first but everything was smooth and easy. Fast delivery. Don’t normally review but figured I would to maybe help someone else on the fence about getting a windows code."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry A. Stanley",
          "Nb_Reviews": 3,
          "Date": "2022-09-13T01:03:02.000Z",
          "Titre": "Ankush provided Great support on this…",
          "Contenu": "Ankush provided Great support on this Task!!He was very patient, professional and knowledgeable!I thank him very much for his service on this task!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ash",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T22:36:29.000Z",
          "Titre": "Excellent service every time we order",
          "Contenu": "Excellent service every time we order.  If there is a problem with product or product key, they resolve it quickly.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allan",
          "Nb_Reviews": 1,
          "Date": "2021-09-12T11:26:39.000Z",
          "Titre": "Thank you Keith and DirectDeals for…",
          "Contenu": "Thank you Keith and DirectDeals for your prompt attention in repairing my order AND for offering upgraded replacement software at a discounted price for my troubles . . . ALL within one hour!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Richard Bourne",
          "Nb_Reviews": 3,
          "Date": "2021-11-18T22:58:15.000Z",
          "Titre": "Very Satisfied. Great Purchase",
          "Contenu": "The product was as advertised and well priced. Customer service answered my few questions promptly. I would recommend buying from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2022-11-21T18:24:49.000Z",
          "Titre": "Very QUICK SERVICE!!!",
          "Contenu": "Ordered a Microsoft Office license from you.  When I went to install the license, it said that the license was already used.  I emailed support and they got me a new license key very quickly.  Very happy with the quick service!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexandra Kemp-Spollen",
          "Nb_Reviews": 2,
          "Date": "2022-05-04T23:40:59.000Z",
          "Titre": "Suraj-client care",
          "Contenu": "Suraj, was able to assist me in the installation when I had trouble. It saved me a lot of frustration. Excellent client service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel Rizzitelli",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T17:38:17.000Z",
          "Titre": "HAD SOME DIFFICULTIES BUT THE SUPPORT…",
          "Contenu": "HAD SOME DIFFICULTIES BUT THE SUPPORT WAS OUTSTANDING AND I WILL LOOK TO \"DIRECTDEALS\" 1ST WHEN I NEED ANYTHING THEY CAN DO FOR ME."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Bond",
          "Nb_Reviews": 2,
          "Date": "2022-09-28T23:07:27.000Z",
          "Titre": "Directdeals",
          "Contenu": "Ankush, was the most amazing skilled support staff I have ever worked with. He was tenacious and worked until he had all of my services fine tuned with my account. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2023-01-16T00:35:13.000Z",
          "Titre": "The download went smoothly",
          "Contenu": "The download went smoothly, and the code you gave me unlocked the full potential of this code-writing powerhouse!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Bryant IT Manager",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T18:58:18.497Z",
          "Titre": "The best service I've received in years…",
          "Contenu": "The best service I've received in years from any IT/Technology/Distribution platform. The folks are super responsive and one of the most competitive priced Microsoft distributors around! A++ Around-the-clock"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T13:57:45.000Z",
          "Titre": "Repeat Customer",
          "Contenu": "I have been purchasing licensed software from DirectDeals for a couple of years and have always been satisfied. Any time there has been a hiccup in the delivery or licensing, they have been responsive and corrected the situation quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T22:27:43.058Z",
          "Titre": "I have used a couple other software…",
          "Contenu": "I have used a couple other software services over the years, but you guys have been a quick resource for licenses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Indra",
          "Nb_Reviews": 2,
          "Date": "2021-09-08T15:47:46.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service, effective products.  If I ever have an issue, they respond and correct it right away.  Top Notch Company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendell Davis",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T18:46:48.000Z",
          "Titre": "Suraj - Very Good",
          "Contenu": "Suraj, was extremely helpful and efficient in helping us to activate Windows Server when the key provided was having an issue.  Very courteous and knowledgeable!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 3,
          "Date": "2021-10-13T23:49:39.000Z",
          "Titre": "I'm a regular customer..",
          "Contenu": "I'm a regular customer... these guys are responsive and helpful if anything arises... no problems!!  I would recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T03:16:22.000Z",
          "Titre": "I needed a Windows Server 2019 license…",
          "Contenu": "I needed a Windows Server 2019 license quickly and the price was great.  The download and product key were sent to me within minutes.  It was a great experience and I will use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T15:35:34.000Z",
          "Titre": "We always come here for our licenses",
          "Contenu": "We always come here for our licenses. Never had any issue obtaining and utilizing them! Always great customer service from them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T00:09:02.000Z",
          "Titre": "Very happy",
          "Contenu": "Very happy!  We intend on many, many purchases with DirectDeals.  They worked with my accounting department to facilitate purchasing, now and in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T19:30:54.000Z",
          "Titre": "DirectDeals, LLC",
          "Contenu": "Ankush, was awesome the help i received was way beyond what i thought it would be i highly recommend DirectDeals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carey E",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T23:47:33.000Z",
          "Titre": "Good deal and a customer service rep…",
          "Contenu": "Good deal and a customer service rep actually called me right after I posted a question! Can't beat that"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve3513",
          "Nb_Reviews": 13,
          "Date": "2022-10-08T00:22:36.000Z",
          "Titre": "Great to do business with!",
          "Contenu": "Their prices are excellent.Their support is excellent, and has resolved any problem I presented them with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bradford",
          "Nb_Reviews": 2,
          "Date": "2021-05-06T18:23:26.000Z",
          "Titre": "Always a pleasure to work with!!",
          "Contenu": "Always a pleasure to work with even when Computers fail to get me codes in a timely manner.  Fast at responding to issues!  A+++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Munkee Fun",
          "Nb_Reviews": 3,
          "Date": "2022-06-06T22:55:20.000Z",
          "Titre": "Great products at Great prices!",
          "Contenu": "I was looking for software at a reasonable price. DirectDeals delivered! I got just what I was looking for at a GREAT price! Very happy and all is well! Will do business with again ! A++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve3513",
          "Nb_Reviews": 13,
          "Date": "2021-11-07T18:58:01.000Z",
          "Titre": "The service is excellent",
          "Contenu": "The service is excellent. I've placed 17 orders with them in the past 3 years  and the service has only gotten better."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Noel Laporte",
          "Nb_Reviews": 3,
          "Date": "2021-04-15T20:03:45.000Z",
          "Titre": "Great price for the software and quick…",
          "Contenu": "Great price for the software and quick delivery through instant download. Software is also legit with authentic Microsoft License. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AR BandS",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T17:20:49.000Z",
          "Titre": "Suraj from support was very prompt and…",
          "Contenu": "Suraj from support was very prompt and helpful with the install process of software purchased. thx."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Phillips",
          "Nb_Reviews": 3,
          "Date": "2022-11-01T16:38:30.000Z",
          "Titre": "Had an issue with my login",
          "Contenu": "Had an issue with my login but was quickly resolved and was able to complete my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sidney",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T22:41:56.000Z",
          "Titre": "DirectDeals, LLC",
          "Contenu": "Ankush, He was very helpful in helping me find what I needed for my computer needs Thank you very much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Business Technology Solutions, Inc.",
          "Nb_Reviews": 2,
          "Date": "2021-06-11T17:36:29.000Z",
          "Titre": "DirectDeals has been a trusted vendor…",
          "Contenu": "DirectDeals has been a trusted vendor for years. Always great prices and excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert H.",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T12:50:39.000Z",
          "Titre": "Great service & quick delivery of our…",
          "Contenu": "Great service & quick delivery of our license key.  Will use DirectDeals again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 9,
          "Date": "2021-08-19T20:40:07.000Z",
          "Titre": "The response time was excellent and my…",
          "Contenu": "The response time was excellent and my software activated flawlessly with the product code they provided."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "D. Lewis",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T16:03:58.000Z",
          "Titre": "Excellent",
          "Contenu": "I am very happy with Direct Deals and  thankyou Suraj for quick assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dylan Newsome",
          "Nb_Reviews": 2,
          "Date": "2021-11-04T08:20:41.000Z",
          "Titre": "Easy and Quick!",
          "Contenu": "I have purchased all my office licenses for three dealerships here for years. Easy and quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rickey Anderson",
          "Nb_Reviews": 2,
          "Date": "2022-02-24T00:31:19.000Z",
          "Titre": "I just want to say Suraj is one of the…best",
          "Contenu": "I just want to say Suraj is one of the best, the guy was awesome, the guy know his stuff, he is truly one of the best"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2021-06-24T16:46:41.000Z",
          "Titre": "A+!!!",
          "Contenu": "A+I received a valid key in 9 minutes (check your spam folder if it ihas been more than, say, 15 minutes.)Will buy licensing from again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cleonia",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T03:10:51.000Z",
          "Titre": "I am pleased with the service that…",
          "Contenu": "I am pleased with the service that DirectDeals gives.  Every time I order from them, I receive what the item."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shanti",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T15:38:15.000Z",
          "Titre": "Correcting the issue in a timely manner",
          "Contenu": "The product key did not work, but I spoke with Keith and he sent me a new one and now it is working perfectly. Thank you for the on time response."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T16:00:10.000Z",
          "Titre": "2012 Standard R2 Purchase was quick and…",
          "Contenu": "2012 Standard R2 Purchase was quick and easy. Received the license within a day."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Leslie",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T13:31:45.102Z",
          "Titre": "My first time using directdeals",
          "Contenu": "My first time using directdeals, great product, great service, very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Satisfied in Alabama",
          "Nb_Reviews": 3,
          "Date": "2021-04-05T15:41:40.000Z",
          "Titre": "Great Prices for Great Products",
          "Contenu": "Ordered Microsoft Office H&B and had the licenses within minutes. Never a problem activating or registering on our Microsoft Account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T17:31:48.000Z",
          "Titre": "Suraj",
          "Contenu": "Suraj, is very professional & should get a raise in pay. Thank you. Miss Barbara"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Belenv",
          "Nb_Reviews": 3,
          "Date": "2021-11-11T00:03:19.000Z",
          "Titre": "Transaction was quick and received…",
          "Contenu": "Transaction was quick and received product key in a timely manner as well. Great site"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pam Elste",
          "Nb_Reviews": 6,
          "Date": "2022-11-01T20:10:26.000Z",
          "Titre": "I had problems with the upgrade of my…",
          "Contenu": "I had problems with the upgrade of my laptop with the software I purchased, but customer service worked with me until I was able to get a successful update and activation of the new software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Belv",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T23:50:15.000Z",
          "Titre": "Great and prompt service",
          "Contenu": "Great and prompt service, reasonable price too, which is a great plus!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T19:41:08.000Z",
          "Titre": "Excellent deal with once I place the…",
          "Contenu": "Excellent deal with once I placed the order very quick turnaround"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve3513",
          "Nb_Reviews": 13,
          "Date": "2021-06-30T23:58:14.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent. Fast delivery and everything works like it's supposed to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2021-12-11T17:31:59.000Z",
          "Titre": "Great company to deal with",
          "Contenu": "Great company to deal with. Service and technical support was excellent would highly recommend this company"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Lukas Moench",
          "Nb_Reviews": 1,
          "Date": "2022-03-12T13:31:05.000Z",
          "Titre": "This is something that can help at any…",
          "Contenu": "This is something that can help at any time.I can recommend it as something that can be used for a long time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosa",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T07:56:58.000Z",
          "Titre": "excellent customer service!!",
          "Contenu": "excellent customer service!!! they went the extra mile in helping me resolve my problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arnold Grimes",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T01:27:21.000Z",
          "Titre": "DirectDeals LLC",
          "Contenu": "Ankush, was excellent. I will use Direct deals in future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deirdre",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T04:11:04.132Z",
          "Titre": "Super simple",
          "Contenu": "Super simple, great price, prompt delivery with great instructions for download."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Katz",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T17:49:02.000Z",
          "Titre": "Excellent reputable company",
          "Contenu": "Excellent reputable company.  Saved a bundle on Windows 11 pro."
        }
      ]
    }
  ]
}