{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "domidocs.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elaine Kokes",
          "Nb_Reviews": 6,
          "Date": "2023-05-09T17:31:07.000Z",
          "Titre": "What exactly did I pay for at $199.",
          "Contenu": "What exactly did I pay for at $199.?   When I check for my records, I have to pay more money to get them and more money to get the C/S rep to call me if there's an alert?   Please explain what I paid for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andy",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T16:02:22.000Z",
          "Titre": "I have called twice to get email to set…",
          "Contenu": "I have called twice to get email to set up my account. i have never received email"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert A Roell",
          "Nb_Reviews": 2,
          "Date": "2023-02-23T16:50:48.000Z",
          "Titre": "You charge me twice for $299.00 once on…",
          "Contenu": "You charge me twice for $299.00 once on the 15th and again on the 23rd."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shirley",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T19:55:39.000Z",
          "Titre": "Still too early - updated on 6/30/2023",
          "Contenu": "Updated 6/30/2023:The response from DomiDocs made no sense. I haven't been in touch with anyone from their team! I also haven't received any monthly \"reports\" since the first one. It's hard to believe they're actually monitoring my property in case anyone has tried any shenanigans.It's actually too early to rate this service, as I've had it for only 3 weeks, and anything could happen down the road. However, I do not know why they are asking questions about the residents of the property and they do not answer comments/questions submitted via their web Contact Form."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Victor Pierson",
          "Nb_Reviews": 2,
          "Date": "2023-04-26T17:08:19.000Z",
          "Titre": "I think that I got what I 'm paying for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "carson",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T04:02:38.000Z",
          "Titre": "My info from your search of the title…",
          "Contenu": "My info from your search of the title was not up to date."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Setele",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T19:59:45.000Z",
          "Titre": "Customer support answered all of my…",
          "Contenu": "Customer support answered all of my questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "P. Daniels",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T21:22:06.000Z",
          "Titre": "New Member",
          "Contenu": "I have been with HomeLock for around 6 months.  Everything has gone well so far.  The pricing for the coverage was very reasonable compared to other companies.  They send routine updates and so far, we have not had any issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Graciella",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T00:38:34.000Z",
          "Titre": "A representative kept calling me to see…",
          "Contenu": "A representative kept calling me to see if I was ready to enroll. I had tried to enroll but I was not allowed to finish the process. The She was able to help me get enrolled."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T18:23:02.000Z",
          "Titre": "comfort for seniors",
          "Contenu": "It is a great comfort for Senior Citizens to have this protection and not worry about losing their home to fraud.  DomiDocs communicates regularly, which is helpful in keeping track and providing assurance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Kilb",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T00:02:41.000Z",
          "Titre": "HomeLock confirmed its status as the #1…",
          "Contenu": "HomeLock confirmed its status as the #1 protection for our property title & the cost was not overly expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Grant",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T20:54:05.000Z",
          "Titre": "I was given the facts",
          "Contenu": "I was given the facts. The danger to my property being used for the benefit of thiefs and the protection of monitoring and the warning if there is an intrusion. ="
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T23:06:03.000Z",
          "Titre": "I tried to call but no one answered",
          "Contenu": "I tried to call but no one answered, so I went on line it worked great, that's why it's only a 4 star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geraldine A",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T00:37:05.000Z",
          "Titre": "Efficient",
          "Contenu": "Easy to negotiate the system and response was great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T00:47:04.000Z",
          "Titre": "New experience",
          "Contenu": "A little confusing; but with verbal coaching, the experience smooth and satisfying."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nelda",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T22:01:49.000Z",
          "Titre": "I am just not sure what you do ?",
          "Contenu": "I am just not sure what you do ??  Do you keep watch for me ?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PETER",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T14:28:53.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. Time will tell."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WILLIE",
          "Nb_Reviews": 4,
          "Date": "2023-02-22T01:40:23.000Z",
          "Titre": "Update information with recent…",
          "Contenu": "Update information with recent activities"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T17:05:45.000Z",
          "Titre": "Do not know yet"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dwayne",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T19:35:28.000Z",
          "Titre": "Great",
          "Contenu": "Great , Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harold",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T11:22:55.000Z",
          "Titre": "Everything!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Purvis",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:48:15.000Z",
          "Titre": "Great Support",
          "Contenu": "Had trouble logging in as I could not re-set my password.  Also, I am visually impaired and have an issue with the 'clutter' on your website.  Shari was very helpful and patience with me as I moved around the sitel"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T22:59:37.000Z",
          "Titre": "Shari",
          "Contenu": "Shari, my customer service contact, answered all my questions and was patient in listening to my reasons for wanting fraud protection for my house. She called me back the following day after I got the Homelock coverage. She kept her promise to call back the next day which shows integrity and following through on a promise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Mobley",
          "Nb_Reviews": 4,
          "Date": "2023-11-10T23:11:39.000Z",
          "Titre": "Updated information about your business",
          "Contenu": "Shari helped me and reviewed the services I am receiving from your company. She also reminded me of the discount I will received by buying your services for 3 years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Norris",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T20:22:17.000Z",
          "Titre": "HomeLock is on the job!",
          "Contenu": "This is my first experience with HomeLock and it was great to see that they are on the job.  I was notified of an alert and when I checked into it, the online representative was very helpful in helping me to understand what the alert was and what action I needed to take.  Very impressive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T16:33:51.000Z",
          "Titre": "I called to request a copy of my deed…",
          "Contenu": "I called to request a copy of my deed and was able to get the ball rolling and within the hour I received  my deed via email. My experience with DomiDocs has always been excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "paul f",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T22:57:51.000Z",
          "Titre": "customer service agent was very prompt, complete, and gracious. service agent was very prompt",
          "Contenu": "customer service agent was very prompt, complete, and gracious. in today's world i really appreciated it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T19:48:20.000Z",
          "Titre": "I was skeptical about this offer when I…",
          "Contenu": "I was skeptical about this offer when I heard it on the Sean Hannity radio show.  After further research my wife I realized stealing homes was becoming problematic & looked further in the home lock security.  The process was easy & all questions & concerns were answered to satisfaction.  We now live knowing that our most precious asset is protected.  We would recommend this security to all who are concerned about home title theft."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Schulman",
          "Nb_Reviews": 4,
          "Date": "2023-03-14T20:17:45.000Z",
          "Titre": "An interesting concept to insure no one…",
          "Contenu": "An interesting concept to insure no one can take your home away from you. keeping tabs on the paperwork that local governments keep on hand, which is now primarily stored in digital form, most of us would not think about. Great idea."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valerie and Jim",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T19:33:13.000Z",
          "Titre": "When we first signed up with Domidocs…",
          "Contenu": "When we first signed up with Domidocs they sent us a complete report on the status of our home title just like they advertised. Since then  we receive notifications any time there is activity relating to our property. Until I heard the ads for Home Title Lock and did some research I was unaware of the potential for someone to steal our home right out from under us. I appreciate the work they do to help protect the largest investment we have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah E. Armstrong",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T01:08:05.000Z",
          "Titre": "My experience with DomiDocs",
          "Contenu": "I contacted DomiDocs, Inc. the first time in 2021 and from the get go they inspired confidence in me. Explanations of service easy to understand, made things easy for me. I was quite impressed by their honesty, prompt reply and solution. I overpaid and there were no excuses or delays, prompt refund.  DomiDocs periodically gives me the results of their surveyance. They are not \"pesky\" meaning they don't overwhelm me with e mails, trying to impress me about their work. DomiDocs, Inc. Thanks for your service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harmon",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T19:01:22.000Z",
          "Titre": "Excellent Experience with DomiDocs",
          "Contenu": "We have been with DomiDocs for more than one year and have been exceptionally please with the service they provide. The monthly report is very detailed and provides the information needed to know if our property is secured or we need to take action. The entire application process was simple and easy to to do. Again, we are exceptionally pleased with DomiDocs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T18:20:18.000Z",
          "Titre": "Do not risk loosing your assets",
          "Contenu": "I absolutely believe everyone should use title lock. I know it seems crazy but in many areas a fraudulent document created and presented to the county court records could take away your ownership right's. Your home is your largest asset, protect it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven and Beverly",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T20:38:24.000Z",
          "Titre": "The security provided and peace of mind…",
          "Contenu": "The security provided and peace of mind is well worth what we bargained for. In the past there had been several attempts by persons unknown hacking into our account, but ever since we joined DomiDocs, we've had no further difficulties with that as a problem. We're grateful for their service and will continue to utilize what they have to offer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T21:52:56.000Z",
          "Titre": "Very happy with HomeLock so far",
          "Contenu": "I've just started using HomeLock.  I did some research into the title lock company I saw advertised on YouTube and what others were available.  HomeLock impressed me with all of the checking they do and their low price.  There was one error in their initial pull of information about my house - they had my daughters listed as owners of my house (due to a legal document I had filed with their names).  However, after one quick call and a day later they had it corrected!  And Sheri sent me an email explaining everything and telling me which document they had referenced.  So, I'm very happy with their service so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T19:05:14.000Z",
          "Titre": "Best Service!",
          "Contenu": "I get monthly reports and current reports if there is any activity. Staff is very knowledgeable. Gives me piece of mind. I initially signed up for the nationally advertised program and there was absolutely no communication and could not reach a human to get any info. How could I trust them with my biggest investment? I highly recommend DomiDocs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Rutkowski",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T03:10:22.000Z",
          "Titre": "DomiDocs Agent Shari Louis is very…",
          "Contenu": "DomiDocs Agent Shari Louis is very professional, knowledgeable, courteous, and customer-driven. She made my request go very smoothly. Ms. Louis is a stellar example of your company and deserving of a higher position!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 4,
          "Date": "2023-02-15T20:07:10.000Z",
          "Titre": "So far, So good!",
          "Contenu": "One never really knows how well a service or product holds up until it is needed. Thus far I have been fortunate in not having my identity or property stolen so I really can't gauge how effective Domi Docs would be in that scenario. However, I have talked with them from time to time over the course of my subscription period to access their monitoring and they seem to be providing the service I paid for without any glitches. That is really all I could ask for at this point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Rule",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T20:00:49.000Z",
          "Titre": "Got alert message",
          "Contenu": "Got alert message, called and was graciously help and guided by agent, thanks for the assurance, that we have nothing to worry about.  We appreciated"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy Dietrich",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T16:38:40.000Z",
          "Titre": "Sence we have been with Homelock",
          "Contenu": "Sence we have been with Homelock, we have been at ease knowing, if anything happens with our mortgage they have our backs. Homelock customer service is great also.After all, our home is our biggest investment! Why wouldn't you want to have the added protection to make sure your covered? I can't even imagine what would happen if someone did take our home, and with Homelock we don't have too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T20:09:20.000Z",
          "Titre": "I received EXCELLENT SERVICE AND…",
          "Contenu": "I received EXCELLENT SERVICE AND INFORMATION from Stacy during me phone calls. I’m convinced that HomeLock is the best protection out there and has a reasonable price!Unfortunately I got hit with a HUGE TAX liability and had to cancel my enrollment to muster all the funds available.HomeLock/Domidoc’s was exceptionally quick refunding my money. A very pleasant encounter notwithstanding my cancellation.I will preach HomeLock/Domidocs to my friends and family! 5 Gold Stars!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pete",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T19:21:42.000Z",
          "Titre": "Security at a Reasonable Price.",
          "Contenu": "Was very impressed by your website and the ease which I was able to enroll in your protection of my home.  I had put off enrolling for a couple of years with one  excuse or another but now I feel much more secure than prior to my enrollment.  Was also very impressed with the reasonable cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T21:15:41.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I signed up in order to supplement an ID protection service I already had.  The site is easy to navigate and informational.  I received a couple alerts and panicked.  I then called their very helpful CS phone line and the staff was VERY HELPFUL and the call was answered QUICKLY.  The rep walked me through everything:  explained the nature of the alert, how to dismiss it since it was nothing to worry about, and what to do in the future.  The rep was very knowledgeable and easy to understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T15:35:41.000Z",
          "Titre": "Peace of Mind, Organization of Information",
          "Contenu": "Aside from the peace of mind knowing the activity surrounding my home is being monitored, the website provides a place to store and access all of the pertinent information about the home--everything from the name of your plumber to county, insurance, mortgage, etc.--stuff you don't even think about (until you need it!)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Purvis",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T19:51:05.000Z",
          "Titre": "Useful Property Tax Info legally blind and Stacy was very…",
          "Contenu": "I am legally blind and Stacy was very patience and helpful in signing up for your program.  She not only spent time with me, but has responded to my emails as I try to learn how to use the profile.  The profile form me is 'cluttered' and I need assistance with it.  Do appreciate her help and assistance.  She will be the reason I will be renewing next year.  When I get good service, I like to see that it got recognized.  Robert Purvis"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T22:25:37.000Z",
          "Titre": "Home Title Review, 813 Santa Barbara, Farmington NM 87401",
          "Contenu": "The DomiDocs, Inc. representative had in-depth knowledge about home title theft and went over them with me in detail to assure me that my home would be protected by using their services. Note: there was a lot of things I was unaware of."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kam",
          "Nb_Reviews": 4,
          "Date": "2023-02-16T03:16:47.000Z",
          "Titre": "Great Follow Up Team of Representative",
          "Contenu": "Great Follow Up Team of Representative Ms. Stacy Called and went through all the list items with history records and explained well at our convenient time and day. That was extra efforts of representative with great skills of customer service at customer comfortable time. Great service and protection plans for any investors peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T12:56:37.000Z",
          "Titre": "An apparent mis filing was discovered…",
          "Contenu": "An apparent mis filing was discovered whereby information had not been logged in properly. The company discovered this and notified me in a timely fashion so that I could follow up at the county court house.  The problem was Identified and corrected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T19:16:09.000Z",
          "Titre": "What a great investment",
          "Contenu": "What a great investment! Now I don't have to worry about my home title being changed without my knowledge. They alert you as soon as anything happens to your home's records on the internet. Got an alert last August and they took care of the issue right away. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T02:00:14.000Z",
          "Titre": "Questions about coverage.",
          "Contenu": "Spoke with Stacy and she answered all of my questions about coverage without any embellishment.  She was clear about cost and what might work best for us.   We had reviewed other policies and were impressed with this one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sha",
          "Nb_Reviews": 3,
          "Date": "2023-02-14T20:38:23.000Z",
          "Titre": "My home title/deed is in safe hands with Home Lock/DomiDocs Inc.",
          "Contenu": "I feel confident that my home title/deed is safe from fraud due to Home Lock/DomiDocs, Inc. watchful eye.  I don't have to worry if someone is using my homes title to get cash or take my property away from me.  I signed up for one year and came back for another 5 year term.  Thank you for watching over my title and keeping my investment safe from fraud."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Margett",
          "Nb_Reviews": 3,
          "Date": "2023-02-14T19:26:50.000Z",
          "Titre": "Protection",
          "Contenu": "Once you sign your docs. You forget about them and think every thing is ok with your home title. Its so reasuring that my home is montered and when there is an inquiry about your property you are notified and then desern if further action need. Thank you HomeLock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Pedro Navarro Torres",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T19:19:03.000Z",
          "Titre": "Is a no brainer< keep an eye on the",
          "Contenu": "Is a no brainer< keep an eye on the, in this times were fraud is seen every day, cannot stress knowing that our property is safe with you, super easy, and stress free, you can check it out at any time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T19:04:07.000Z",
          "Titre": "Highly Recommended",
          "Contenu": "I have with DomiDocs for several years and found them to be responsive to your questions. All the staff are knowledgeable. The monthly reports are good information providing you with the amount of property inquiries. I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T19:11:22.000Z",
          "Titre": "Knowing that your safe from white collar thieves",
          "Contenu": "Its comforting that home title lock will protect my most expensive asset. This is my retirement investment and it would be devastating if someone could take it away from me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T19:25:26.000Z",
          "Titre": "Home title protection",
          "Contenu": "It is comforting to know that if the title of your home is searched in any way, you are notified right away. Especially  when a home is such a big expense it would be a terrible  & frightening  thing to have your home stolen away from you! I am so happy to have DomiDocs,Inc. Watching out for me & my family's  home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mathew Tillotson",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T14:19:59.000Z",
          "Titre": "How important to protect your biggest investment, and its 1/2 price of other service",
          "Contenu": "Stacy was very pleasant and explained all the different Checks they preform on my property. Also informed me that they were half the price of similar services advertised on radio, that was very important as well,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Business Owner",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T07:38:40.000Z",
          "Titre": "DomiDocs provides an excellent service…",
          "Contenu": "DomiDocs provides an excellent service ensuring the security of the Property Title of my home.   This service gives me peace of mind.The periodic online updates are especially helpful.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EARL DENSTEN",
          "Nb_Reviews": 2,
          "Date": "2023-02-23T20:59:27.000Z",
          "Titre": "At ease with DomiDocs",
          "Contenu": "I saw an ad on TV how some low life could actually sell your home right out from under you and I got very uneasy and for a company that could prevent that from happening.  I found DomiDocs and opened an account. I filled out some questions about my home and DomiDocs did the rest, it was seamless.  I get a monthly report and I am resting without fear my home will be stolen.Earl"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T20:44:38.000Z",
          "Titre": "Peace of mind.",
          "Contenu": "I feel very confident that my home title is being protected.  I receive regular updates from DomiDocs, and when I had a recent change, they noticed it and alerted me immediately.  The staff is great and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billie Hartzheim",
          "Nb_Reviews": 6,
          "Date": "2023-04-14T01:44:16.000Z",
          "Titre": "This gives a person peace of mind",
          "Contenu": "When I signed up I felt a great amount of peace about my home title.  I do not have a mortgage and with so much bad things being done to people that are unaware, I needed to do something.  I got a report and this makes a person more confident.  It is so easy to check bank, and credit card activity but a different story on home. Insurance does not take care of your home title and if it occurs you will have to pay a lot of money to get out of the trouble someone else brings to your plate. I urge people to look into this for peace of mind. I found out about home title lock from my radio station Fox News."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret M.",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T04:23:59.000Z",
          "Titre": "It gives me such a sense of peace that…",
          "Contenu": "It gives me such a sense of peace that Homelock is monitoring my home’s deed. It would be absolutely devastating to have my home stolen out from under me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vicki Allen",
          "Nb_Reviews": 3,
          "Date": "2023-02-15T21:53:56.000Z",
          "Titre": "I haven't been with DomiDocs for very…",
          "Contenu": "I haven't been with DomiDocs for very long, but so far the service is good.  I have had a property on the market to sell and received numerous alerts.  From a customer stand point, it would be better if more details were available when I get an alert.  I login to read the alert, but it doesn't really show many details.  Or I don't understand how to get more details.I sold the property noted above.  I logged in today to remove that property, I could see how to add a property, but not how to remove a property.  I used the online support and they took care of removing the property.  That experience was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin & Cybil",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T00:37:46.000Z",
          "Titre": "Your customer service was top touch",
          "Contenu": "Your customer service was top touch. I was having problems and trying to fill out the paperwork on line. Stacy from customer service explain the plan and took care of the and email to me. Just that help it taken care of. For someone that was having problems with system it that could get “Quickly” on the and it took all 5 minutes. Hora!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T21:10:31.000Z",
          "Titre": "I feel my home ownership is protected",
          "Contenu": "I feel my home ownership is protected. I am on auto-renew so I do not need to be concerned about remembering to pay or be dropped from coverage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andreia",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T19:26:13.000Z",
          "Titre": "Peace of mind at its best!",
          "Contenu": "I am very satisfied with the service provided by Home Lock. I felt at easy knowing that a trustworthy Company was monitoring any and all activities concerning my investment property. i highly recommend their service. Andreia"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Luisi",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T18:24:51.000Z",
          "Titre": "Industry professional viewpoint",
          "Contenu": "Working at a top five U.S. bank, I am acutely aware of fraud and the way people have had their homes stolen from under them. The DomiDocs service provides me the peace of mind that assures me that my wife and I remain the rightful owners of our house and property."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Kendrick",
          "Nb_Reviews": 5,
          "Date": "2023-02-14T23:32:21.000Z",
          "Titre": "A layer of comfort",
          "Contenu": "Very easy to sign up and gain a level of comfort. I have received notifications that required me to look at a potential problem and was very satisfied with the ease. Thanks for a great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T20:50:00.000Z",
          "Titre": "We have the peace of mind knowing our…",
          "Contenu": "We have the peace of mind knowing our title cannot be breached by scammers. The signing up process was easy and we appreciate your service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John & Kathryn",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T11:17:36.000Z",
          "Titre": "Signing up was easy",
          "Contenu": "Signing up was easy.  We sleep better knowing you are watching out for us.  We live in a very different world today because there are people out there who will take what you worked hard for.  Please keep us safe from those who take."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T20:10:55.000Z",
          "Titre": "I've never used a service like this…",
          "Contenu": "I've never used a service like this before and when I got my first report I was surprised at the detail included in it. They are keeping me aware of all that is going on with my property. Wish I had found this company sooner. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T18:27:00.000Z",
          "Titre": "The system is very easy to use and…",
          "Contenu": "The system is very easy to use and reflects all parameters simply. I find the dashboard view quite helpful and I feel confident that I am being protected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James R.",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T06:36:13.000Z",
          "Titre": "How Home Lock has protected my home.",
          "Contenu": "Home Lock has protected my home from criminals who would try to market it over the internet. They contact me when any suspicious activity occurs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony F",
          "Nb_Reviews": 3,
          "Date": "2023-02-15T18:53:06.000Z",
          "Titre": "Setting up the account was easy",
          "Contenu": "Setting up the account was easy. I liked the comprehensive database searched. I also like receiving the reports instead of having to log onto the account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T19:02:32.000Z",
          "Titre": "Had been looking for a company that has…",
          "Contenu": "Had been looking for a company that has great coverage at an affordable price. I found it here. My hose is paid off and I always worried, now I sleep with no worries."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 7,
          "Date": "2023-09-08T23:26:28.000Z",
          "Titre": "Someone came on fast for me",
          "Contenu": "Someone came on fast for me.  I was concerned about an alert that my husband got on his email, but thinking it was a scam.  It was!  I was given answers to all my questions and I appreciate it, with the peace of mind.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T19:19:59.000Z",
          "Titre": "Great Service!",
          "Contenu": "Easy to sign up. Great monitoring program. Customer Satisfaction is top on their list! Well worth the investment to protect your home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Excited customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T00:44:23.000Z",
          "Titre": "Great first step",
          "Contenu": "This was a great experience to start my relationship with Home TITLE Lock. Docs delivered easily and conveniently via Email.  Customer service rep was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marla",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T21:33:36.000Z",
          "Titre": "I was hearing horror stories about…",
          "Contenu": "I was hearing horror stories about title theft. i have felt more secure knowing my titile is monitored by DomiDocs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Robertson",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T18:21:20.000Z",
          "Titre": "I felt a need to protect my investment…",
          "Contenu": "I felt a need to protect my investment in the property I have and selected DomiDocs as the proper company to protect me. They are very well priced and I get constant updates as to their monitoring"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued LifeLock Customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T19:31:12.000Z",
          "Titre": "Reports and Service",
          "Contenu": "Any and all requests made concerning this protection are noted with their report, including details and dates. Feel protected and comfortable that if any fraudulent attempts are made and successful, they’ll stand behind their warranty."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Gomez",
          "Nb_Reviews": 4,
          "Date": "2023-02-14T21:12:17.000Z",
          "Titre": "Extreme satisfied.",
          "Contenu": "I have had several policies before and never heard from them, unless it was time renewal. Domidocs, has notified me of a potential fraud possibility and the tread was quickly responded to and resolved. I am not changing service companies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kennan DAVID Griffin",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T00:56:51.000Z",
          "Titre": "Homelock gives consistent reviews that…",
          "Contenu": "Homelock gives consistent reviews that gives me peace of mind. I have had my Identity stolen and the possibility of home theft is a strong possibility."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T22:44:00.000Z",
          "Titre": "DomiDocs Protects Me",
          "Contenu": "DomiDocs provides me with piece of mind in that I know they are monitoring my house and title information and let me know if there's a problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy",
          "Nb_Reviews": 4,
          "Date": "2023-09-07T20:54:19.000Z",
          "Titre": "Alerts",
          "Contenu": "The service is great. They do well at keeping up on your information. And send alerts when needed so you never have to worry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T21:01:42.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service ! when you call them, it is very easy to get ahold of a live person! They always have the correct answer.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "frank",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T00:32:37.000Z",
          "Titre": "Easily see how many inquiries into my…",
          "Contenu": "Easily see how many inquiries into my homes title. Peace of mind knowing that my home title issafe from fraud."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T18:19:47.000Z",
          "Titre": "Love the reports sent to me on a…",
          "Contenu": "Love the reports sent to me on a regular basis to keep me posted on the status of home loan. There is peace of mind knowing someone is looking out for you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esther and Ed Davidson",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T19:44:21.000Z",
          "Titre": "We found a problem with the title to…",
          "Contenu": "We found a problem with the title to our property about 10 minutes after signing up for your service. It's corrected and all is well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T21:39:03.000Z",
          "Titre": "Both my need and the actual HUMAN…",
          "Contenu": "Both my need and the actual HUMAN support.  I was able to schedule a conversation time easily.  The conversation i had filled in many of the blanks I had."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vicki Lanting",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T20:27:57.000Z",
          "Titre": "Great service",
          "Contenu": "Great service.  Spoke with a person directly who answered my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T20:19:14.000Z",
          "Titre": "When I called Doni Docs",
          "Contenu": "When I called Doni Docs, INC your associates very helpful. When I called and left a message someone always called me back. Thank you for great service. Raymond Almada."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam's mom",
          "Nb_Reviews": 3,
          "Date": "2023-02-15T18:53:19.000Z",
          "Titre": "avoided slot of stress, quick resolution at a potential furure property closing.closingial losing alialtial",
          "Contenu": "the notice, provided has it helped to save a step / delay prior to a future house closing. perfect saving of time and resolvable stress.....yay!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ollie",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T17:32:23.000Z",
          "Titre": "I appreciate the monthly updates and to…",
          "Contenu": "I appreciate the monthly updates and to know that you all are watching out for me against those who commit fraud."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Giblin",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T04:57:02.000Z",
          "Titre": "Shari was friendly professional and…",
          "Contenu": "Shari was friendly professional and very knowledgeable. I would recommend your company and Shari in particular. A real pro! Bravo 👏"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T20:00:59.000Z",
          "Titre": "I have no issues to this point.",
          "Contenu": "I have no issues to this point.How do I know if there is an issue with my property?  Will you notify me or will I have to monitor some site?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathryn",
          "Nb_Reviews": 3,
          "Date": "2023-04-01T01:30:04.000Z",
          "Titre": "Relief and no more sleepless  nights!",
          "Contenu": "Part of feeling great is the fact that I won't worry about anyone getting their hands on my title or my equity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Kirst",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T19:37:50.000Z",
          "Titre": "The customer service rep was great",
          "Contenu": "The customer service rep was great. Answered my questions clearly and simply."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gayla & Robert",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T20:25:33.000Z",
          "Titre": "Good communications",
          "Contenu": "Good communications. I don't have time to check all the different sites they monitor, so they do it all for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T20:33:38.000Z",
          "Titre": "I've rested easier knowing that I have…",
          "Contenu": "I've rested easier knowing that I have someone watching my my account. It is difficult to do all on your own. I very pleased with the updates that I get along with alerts. Thank you for a job well done!! Joan"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Anderson",
          "Nb_Reviews": 3,
          "Date": "2023-02-15T02:56:35.000Z",
          "Titre": "Peace of mind:",
          "Contenu": "This is a great company to work with. They keep track of everything going on with my property. With no loan on my house and all the fraud going on out there it gives me a peace knowing someone can steal my property. With these guys watching out for that I feel safe and secure that no one will. Thank you Mark"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-02-17T15:07:04.000Z",
          "Titre": "Kept me updated on the status of my…",
          "Contenu": "Kept me updated on the status of my account. Confident the company was looking out for my assets.Took the stress and worry off my mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T04:40:40.000Z",
          "Titre": "I had great experience with the…",
          "Contenu": "I had great experience with the companies from phone calls and conversations to call backs to check if everything's was going well with the services  and email updates."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T19:53:02.000Z",
          "Titre": "DomiDocs made me feel at ease they are…",
          "Contenu": "DomiDocs made me feel at ease they are a top notch company. I didn’t have to worry about anything. They take good care of their customers.Thank you for being there for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Israel",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T20:12:59.000Z",
          "Titre": "Monthly property report.",
          "Contenu": "Monthly report that keeps you well informed of everything pertaining to your property."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Baumgartner",
          "Nb_Reviews": 13,
          "Date": "2023-05-08T00:57:19.000Z",
          "Titre": "I am new to DomiDocs",
          "Contenu": "I am new to DomiDocs, Inc., but they seem to be on top of things.  I just want to protect my home title from being confiscated by thieves."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DENNIS CRULL",
          "Nb_Reviews": 3,
          "Date": "2023-02-15T18:21:46.000Z",
          "Titre": "HOME TITLE PROTECTION THAT YOU CAN AFFORD",
          "Contenu": "Setup was easy and much more affordable than the competition.  I like receiving the monthly reports."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marshall",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T19:10:38.000Z",
          "Titre": "Peace of mind",
          "Contenu": "I like it, that DomiDocs sends monthly info. That they answer my questions to my satisfaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T01:23:56.000Z",
          "Titre": "They keep me informed…",
          "Contenu": "They keep me informed on what is going on with my home.  I don't have to worry about anything sneaking up and I'm not informed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nioami Yankanah",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T04:37:53.000Z",
          "Titre": "The process was so easy and…",
          "Contenu": "The process was so easy and straightforward step by step instructions. Love the regular updates I received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "edward wilson",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T22:45:24.000Z",
          "Titre": "The lady on the phone with absolutely…",
          "Contenu": "The lady on the phone with absolutely wonderful five stars to her 💞"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Ann Ostrowski",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T01:06:28.000Z",
          "Titre": "You went into detail about your whole…",
          "Contenu": "You went into detail about your whole program."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie Perleoni",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T17:42:26.000Z",
          "Titre": "The phone call was answered right away",
          "Contenu": "The phone call was answered right away, very helpful with solving my issue ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard A",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T19:10:54.000Z",
          "Titre": "Efficient and cost effective",
          "Contenu": "Easy to work with. Cost effective. Gave us great peace of mind that someone is looking out for us so we don't have to worry about losing our home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROBERT",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T22:39:11.000Z",
          "Titre": "Quick and tRo the point answers to all…",
          "Contenu": "Quick and to the point answers to all questions.  Very understanding and clear as to my respondsibilities."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MS",
          "Nb_Reviews": 3,
          "Date": "2023-02-15T04:32:28.000Z",
          "Titre": "It provides more information than the…",
          "Contenu": "It provides more information than the competitors but still gives the same protection in the event of a problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 2,
          "Date": "2023-04-04T04:24:59.000Z",
          "Titre": "I was able to speak with a real person…",
          "Contenu": "I was able to speak with a real person that was knowledgeable, friendly and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T18:40:01.000Z",
          "Titre": "I feel secure with your service keeping…",
          "Contenu": "I feel secure with your service keeping us protected from evil doers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnney",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T04:01:40.000Z",
          "Titre": "Monthly reports were prompt and…",
          "Contenu": "Monthly reports were prompt and thorough. Good coverage for our property."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T00:27:09.000Z",
          "Titre": "I feel confident that your office is…good job",
          "Contenu": "I feel confident that your office is working to protect our home and title. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T20:32:21.000Z",
          "Titre": "I purchased 3yr protection so I worry…",
          "Contenu": "I purchased 3yr protection so I worry less! They send me updates and keep me informed!!"
        }
      ]
    }
  ]
}