{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "eartune.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce Mull",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T19:25:31.000Z",
          "Titre": "I bought two different sizes and…",
          "Contenu": "I bought two different sizes and neither size sealed out the noise  as good as my original earbud ear pads they were not worth the money"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T18:04:17.000Z",
          "Titre": "Fidelity UF-A × 1 are a bad product",
          "Contenu": "I ordered the Fidelity UF-A × 1 for my Airpods pro 2 thinking that they might be a better fit than the original ear tips. Wrong. So very wrong! Regardless the size I chose, regardless how well I try to seat them in my ears, the result is a very poor seal and therefore a very poor ANC performance. At least, know I know that the original ear tips are actually very good. I’m sorry to say, but the Fidelity tips are absolute cheap crap."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Evan Moore",
          "Nb_Reviews": 2,
          "Date": "2022-06-20T17:09:37.000Z",
          "Titre": "DO NOT waste your money on these. Worthless purchase.",
          "Contenu": "Not even remotely close to working as advertised. Doesn’t improve bass quality, does not fit more comfortably in your ear than the stock silicone ear pieces. Threw them away after a week of use, incredibly disappointed. Product is not worth $20. I feel like these should be given away free at gas stations."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wesley Corbett",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T02:51:14.000Z",
          "Titre": "the audio quality of my campfire…",
          "Contenu": "the audio quality of my campfire satsumas was very diminished by these unfortunately. They introduced phase issues that weren’t there before. Seems like the channels are just so long?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Manuel Santos",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T17:43:18.000Z",
          "Titre": "Description did not let me know I need…",
          "Contenu": "Description did not let me know I need to turn off a function of my Bose earbuds to use my ear tune product. After I asked the so called technical department about how to get them to work , I figured it out myself. Paying this much for the Bose ear buds plus the cost of the ear tune and not being able to use this function was not worth the money. Plus the sound quality was severely diminished when they did work. I would not recommend this product if you have the Bose quite comfort model."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2022-02-06T15:16:13.000Z",
          "Titre": "Plastic piece underneath foam is far…",
          "Contenu": "Plastic piece underneath foam is far too big which makes these extremely uncomfortable. Everything makes it seem like there would have been way more foam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Stevens",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T22:07:38.000Z",
          "Titre": "No one responded to my question on your…",
          "Contenu": "No one responded to my question on your website chat… I’d like to spend more money with your company .. but you didn’t answer my question.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keenan Boyd",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T20:04:18.000Z",
          "Titre": "I had big hopes for these but they…",
          "Contenu": "I had big hopes for these but they didn’t fit at all. I’ve tried most foam AirPod pro inserts and these fit the worst. The sizes run smaller than others I’ve tried so I’m outta luck."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AirPods Pro user",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T15:10:32.000Z",
          "Titre": "Not a fan personally.",
          "Contenu": "Bad fit, not good seal, don’t feel soft at all compared to the standard Apple white option. I’m returning them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adrian Vaughn",
          "Nb_Reviews": 2,
          "Date": "2020-08-05T15:30:57.000Z",
          "Titre": "Universal EarPod Tips 👎🏽",
          "Contenu": "Universal EarPod tips do not stay secured to EarPods and almost got stuck in ear canal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hartluck",
          "Nb_Reviews": 2,
          "Date": "2021-04-06T18:15:16.000Z",
          "Titre": "Buyer beware!",
          "Contenu": "Ordered the small, medium, large set and only two of them would fit on the airpods. Yeah, one medium and one large would fit!? Not worth the money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JLH",
          "Nb_Reviews": 1,
          "Date": "2021-12-11T05:07:58.000Z",
          "Titre": "The ear tips do not work",
          "Contenu": "The ear tips do not work. I’ve tried all the sizes and they all still fall out of my ear. The memory foam is hard and does not expand. Not much different from the normal ear tips."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Navarrete",
          "Nb_Reviews": 1,
          "Date": "2020-10-25T06:14:12.000Z",
          "Titre": "At first I thought man this is an…",
          "Contenu": "At first I thought man this is an awesome product but after further inspection and trying them on size my size I noticed the imperfections in the material and that my foam disconnected from the top that clicks into the aipods and I’m nervous that if I put those back into my ear the foam will get left in my ear."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NateD",
          "Nb_Reviews": 3,
          "Date": "2021-01-16T23:35:11.000Z",
          "Titre": "These foam tips looked great online but…",
          "Contenu": "These foam tips looked great online but never arrived."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Meef",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T06:28:22.000Z",
          "Titre": "Expensive and worrisome",
          "Contenu": "Although the earplugs are advertised as being for sleep, sadly they do get a bit painful in the middle of the night from the pressure they place on the outer ears. And they do create a pressure in the ears that possibly seems dangerous to the health of the ear. I’m not convinced they are actually safe."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carl Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:25:19.000Z",
          "Titre": "Tips don't seal well in my ears"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "courtney pritchard",
          "Nb_Reviews": 2,
          "Date": "2020-08-10T23:30:16.000Z",
          "Titre": "Poor quality memory foam tips in my…",
          "Contenu": "Poor quality memory foam tips in my opinion.Edit - Eartunes reached out to me for additional feedback and have since refunded my order without me requesting it. Great customer service!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeffery S",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T21:10:19.000Z",
          "Titre": "The product was delivered quickly but…",
          "Contenu": "The product was delivered quickly but it said it was medium size and the one I received is the size of the small tips that came with my headphones so unfortunately they won’t work for me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Romeo",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T23:24:01.000Z",
          "Titre": "Honestly this took way too long",
          "Contenu": "Honestly this took way too long. It seemed like i couldn't get ahold of an employee and then was told the molds I sent in had no order #. Ok, so the one on the bag was covered by UPS. But the pic they sent me didnt show the box the molds were in in the package. That had the order # on it. OR the package slip that had thr Order #, address, and instructions, that was also in that package. The molds just werent in an envelope and thats all. They'd have been destroyed! Missed the time frame for it to be the gift I was hoping to give. Now They've switched buds because the ones she had didn't fit so theyre useless... Other than that, Its my understanding they fit at least, and they eventually came in so theres that too."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Basya Marcus",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T03:22:01.000Z",
          "Titre": "Tried the ear pieces twice- two nights…",
          "Contenu": "Tried the ear pieces twice- two nights …neither time did they diminish environmental sounds… very disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "elijah",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T13:16:51.000Z",
          "Titre": "20 dollars for this?",
          "Contenu": "20 dollars for this? 6 foam eartips that do basically the same thing as the originals? i regret buying this, it was a waste if money"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T05:49:20.000Z",
          "Titre": "I'm not sure...?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MICHELLE V",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T22:15:56.000Z",
          "Titre": "Product works but overall experience not the best",
          "Contenu": "I can confirm they work, but do take a few tries to figure out how they fit in your ear. The reason for 3 stars vs more was my overall experience. Before purchasing, I reached out to Eartune asking for the time I can expect the product to ship and was quoted 3-4 weeks. With this in mind I waited until 4 weeks to check in as I had not received any updates. At this time, they responded letting me know my ear molds were smaller than normal and asked if I still wanted to proceed and I let them know yes. I also shared I would be traveling in 2 weeks and was hoping to have them by the date I would be leaving. After a week I still had no updates on shipping and reached out again. They got back to me 2 days later which was the Friday before my trip (leaving Monday) saying they had shipped that day. As expected this was not ready by Monday and I didn’t receive it until Thursday. I had to have someone pick it up for me as I was out of town and overall just frustrated with the lack of communication. If you are interested in purchasing the product, it does work but expect delays in shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luis G",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T02:05:09.000Z",
          "Titre": "Slightly Better",
          "Contenu": "Overall, these replacement ear tips are better than the Apple tips. However, these also start falling out like the Apple ones, but last a bit longer inside the ear canal. I purchased the “Mix” sized black tips. The Medium size fits the most comfortable, in my experience with Eartune memory foam Air Pod Pro tips. At this point, I’ll keep using the Eartunes, for the sake of not spending more money on an already expensive product like the Air Pods Pro."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Syderdog",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T17:39:56.000Z",
          "Titre": "The company shipped exactly what I…",
          "Contenu": "The company shipped exactly what I ordered in a timely manner. The problem is of my own making-I wear an x-small ear tip and I hoped the small sized eartune would suitable. Sadly, it is not hence the 3 star review.  I cannot evaluate the product performance but I believe the company produces a quality product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay Macklin",
          "Nb_Reviews": 3,
          "Date": "2023-03-08T17:24:47.000Z",
          "Titre": "While I appreciate the product…",
          "Contenu": "While I appreciate the product, the communication style was more cold and slow vs warm and responsive. The molds I was told were not right yet the product fits perfectly. The time it took to get the plugs was over 3 months. Way too long for what they are."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jarod Smothers",
          "Nb_Reviews": 1,
          "Date": "2020-12-11T23:12:06.000Z",
          "Titre": "Was sent a request to review how they…",
          "Contenu": "Was sent a request to review how they did on my order. Well considering my order hasn’t arrived and is currently sitting in Puerto Rico “I live in St. Louis” so you can see why this would be a problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Rycroft",
          "Nb_Reviews": 4,
          "Date": "2022-04-14T17:50:04.000Z",
          "Titre": "Much Better than the apple ear pieces",
          "Contenu": "Much Better than the apple ear pieces, however, they still don't stay in my ears very well when walking.  Very comfortable I could wear all day.  In the end they saved me from buying NEW earpods for now at least."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Kim",
          "Nb_Reviews": 6,
          "Date": "2023-01-12T15:14:41.000Z",
          "Titre": "Took a long time to get here",
          "Contenu": "Took a long time to get here. No shipping follow-up towards the end. The large size, is not equivalent to others larges, and are not even wearable in my ears."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Z",
          "Nb_Reviews": 1,
          "Date": "2021-08-02T14:19:33.000Z",
          "Titre": "Average",
          "Contenu": "Definitely stay in the ear better, bass was slightly dulled down compared to regular air pod pro tips, sound cancellation as well but overall not a bad product"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Blalock",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T16:54:36.000Z",
          "Titre": "These earplugs work pretty well",
          "Contenu": "These earplugs work pretty well. There are a couple of issues I have with them. First of all it seems the leashes are too short. I have only used them with my hooded wetsuit. They seem to hurt my ears under my hood. It might be better without the hood."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rod Tompkins",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T23:29:05.000Z",
          "Titre": "Service was quick",
          "Contenu": "Service was quick, doesn't fit as well as I had anticipated, but this could be a result of the mold provided to Eartune."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EDW",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T17:21:33.000Z",
          "Titre": "Good but not great.",
          "Contenu": "To obtain a great fit these foam ear tips possible could be shaped differently.  While I realize they are universal fit maybe a somewhat oval shape might be better for some people. Possibly seek the help of hearing professionals as Au.D or MDs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jose Torres",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T16:52:50.000Z",
          "Titre": "I like these",
          "Contenu": "I like these, they did what they needed to do. I was able to hear instructions while gunfire was going off. The fir wasn’t bad either, it was comfortable and didn’t hurt. Once the firing was done and ear protection was removed I had 0 ringing in my ears. I would recommend these to anyone that does allot of shooting and doesn’t want to spend a ton of money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Francois Bleibel",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T02:49:35.000Z",
          "Titre": "Great in-ear custom fitted tips",
          "Contenu": "Great in-ear custom fitted tips: they were well molded and fit extremely well to my ear canal.Entire process took a long time. You need to schedule an appointment at their Santa Cruz location for the fitting, then it takes 4 weeks from the fitting until you receive the final product."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Mitch Ryan Jusay",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T19:22:47.000Z",
          "Titre": "Custom Tips for Campfire Audio Ara",
          "Contenu": "The tips were well made; the fit well and are very comfortable, and they do not alter the sound alot, I honestly think it sounds better. Giving only 4 stars tho since it took a bit longer than 3 weeks before shipping started, altho shipping was fast given that I live at the other side of the globe. Overall a great experience, would definitely buy again in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Mangiameli",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T18:40:19.000Z",
          "Titre": "I like the product overall",
          "Contenu": "I like the product overall, but... It's much better than the silicone options Apple included.  Having said that, I don't like the sizing options and I don't like that I have to spend $20 to get a multi size kit.  I wish they had several multisize kits, available in a single color to keep costs down.  Like an xs, s, m or a m, l, xl.  Three options close to what you think you need for like $10.  I got the medium and it's better than the silicone, but I think I needed the large for a better fit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AirPods Pro Custom Tip Custome",
          "Nb_Reviews": 1,
          "Date": "2022-06-30T01:13:05.000Z",
          "Titre": "Great product and glad you make it!!!",
          "Contenu": "Great product so far; thank you for providing AirPod custom tips to the market!  Two suggestions:Clearly label the AirPods / AirPods Pro versions on your website (like say “works with AirPods 3rd generation”) for custom tips. I imagine you may be losing sales since it isn’t clear and I hesitated for the regular AirPods. This will happen when they release new Pros soon too so I’d keep up with that. Provide a few more updates proactively since it is a long process. Getting updates a few times would let me know nothing got lost or off track."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "E Hanlon Miller",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T21:47:38.000Z",
          "Titre": "Great company",
          "Contenu": "Great company. Quality product. They take what they do seriously. It's nice that they offer an option to send all three sizes. Still doesn't fit quite right and hurts my ear eventually but its much better than the stock buds that fall out or competitor buds that I can't wear as long."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Zentgraf",
          "Nb_Reviews": 1,
          "Date": "2021-01-16T18:32:14.000Z",
          "Titre": "My left ear canal seems to be a weird…",
          "Contenu": "My left ear canal seems to be a weird shape so I thought I would try these, they are definitely better for my ear than the stock silicone tip but could be better, I was expecting them to go a bit further in but at least I can run with them in now and not worry about one falling out. Delivery took awhile but that’s probably because I had them delivered to my military base and mail is finicky here. Thanks guys!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Miller",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T11:35:59.000Z",
          "Titre": "Better Comfort, Not As Good Noise Cancellation",
          "Contenu": "The purchasing process on the website was a little confusing and resulted in me not getting what I ordered at first.  Eartunes has since made it right even though it was probably my fault that it was wrong in the first place.  The product itself is nice.  The foam is more comfortable than silicon pieces originally on the AirPods.  The only thing I don't like is that the foam does not block sound as well as the silicon.  This may be because I should have ordered the extra large instead of the large.  Update: Thanks to amazing support from Eartunes, I was able to get the extra large.  The extra large work better in terms of comfort and staying in place but not as good at blocking noise as the stock silicon.  The extra large is still better than the large at blocking noise for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2020-09-16T15:06:23.000Z",
          "Titre": "Great but not perfect.",
          "Contenu": "Love how they snap in like oem silicone tips. Sound quality is just as good as originals, if not a bit airer. Memory foam is also quite comfortable and puts very little pressure on my ears. However claims that it can improve noise isolation are not entirely accurate unless you were unable to get a good seal before. If anything noise isolation has very slightly decreased. For me that wasn’t a deal breaker because the ANC still works about 98-99% as well as it did with the silicone tips and they actually stay in my ears! TLDR; If you just have the problem, like me, of your earbuds constantly falling out even with a good seal it will only fix that issue. Please also make a sample pack that comes with SML instead of just three packs of sss mmm lll."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Antczak",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T01:18:33.000Z",
          "Titre": "Directions were quite vague what does…",
          "Contenu": "Directions were quite vague what does transperancy mean"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick DeLeon",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T15:22:01.000Z",
          "Titre": "Drummers best friend",
          "Contenu": "They’re cumbersome at the beginning but they definitely isolate as I’d hoped they would. As a drummer suffering from a bit of tinnitus, I can appreciate the outside noise filtering that these are capable of! I’m gonna be using them a lot!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James S.",
          "Nb_Reviews": 3,
          "Date": "2022-08-04T00:56:44.000Z",
          "Titre": "Well worth the wait.",
          "Contenu": "I ordered and received my molding kit very quickly. I then waited for my earpieces to be manufactured. After the estimated production time I inquired about the status of my order and was told that there were delays in production. After another four weeks I inquired again and was told there were delays in production. My order was finally shipped after a couple more weeks and arrived before the date that the usps said it would. Well worth the wait. The ear pieces fit as promised and are everything the company has promised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 4,
          "Date": "2022-07-22T23:22:43.000Z",
          "Titre": "No instructions...?",
          "Contenu": "Once I was able to get them installed, they are pretty transparent and comfortable. These were a good price for molded ear plugs but I would have liked ANY documentation or instructions on which side was which, and how they should be inserted and how to use the included ear lube. It took one month to receive them after the molds were taken. It took me several minutes to figure out which way they were supposed to be oriented to fit in my ear. Also, the carrying case is really bulky, and huge compared to the size of the hearing protectors, I would appreciate a keychain type case to make sure that it goes with me easily. I'm not sure if the included ear lube needs to be used every time, if so, a container that closes instead of a ketchup pouch that leaks inside the case would be a big improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jackson Francois",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T13:36:38.000Z",
          "Titre": "A little work, but great",
          "Contenu": "*I want to preference this by saying this is my first pair of custom in-ears.* Although the product was delayed in getting to me, it fit my ears completely. However, at first I couldn’t hear out of the left ear. After careful examination, I noticed that the left ear canal had a blockage. I had to take a pin to clear out the material obstruction in the middle of the canal. This is why I gave it 4 stars and not 5. After that, I went on to use them on stage for a performance and they’re the best fit I’ve ever had."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Shelton",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T21:02:09.000Z",
          "Titre": "Great Customer Service - Professional Organization",
          "Contenu": "The only reason I didn't give 5 stars is that there were no helpful instructions when my custom fit tips came.  I wasn't even sure which one was for which ear, but I figured that would become obvious.  I watched videos and even those were not helpful. They are difficult to get in the first few times but you get used to it.  One of mine is still difficult every time, but I assume that's because of my ear.It did take the 5 weeks that they say it may take and I had gotten anxious.  I also thought I was going to get a different type of case that held tips and buds.  It wasn't what I had seen on the web site/maybe a video.Customer Service responded right away when I wrote a couple of times to make sure I had done my order correctly.  A confirmation of receipt of the order/impressions would have been nice.Overall a good experience.  I'm very happy with my purchase of custom fit tips for Airpod Pros."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R Web",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T20:28:31.000Z",
          "Titre": "I wish I got the xtra large tips",
          "Contenu": "I wish I got the xtra large tips. I think they would fit perfectly for me,  but having never seen an XL version of foam tips before it scared me away. Great packaging, seems premium."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin Jay Beach",
          "Nb_Reviews": 2,
          "Date": "2022-01-16T22:33:08.000Z",
          "Titre": "I received product promptly and appears…",
          "Contenu": "I received product promptly and appears to be of good quality. The larger of the ear cushions are still a little small but a most definitely better that the original cushions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darryl Cobbs",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T06:36:26.000Z",
          "Titre": "The ear-molds fit perfectly",
          "Contenu": "The ear-molds fit perfectly.  Only drawback is that the stick out further than I would have liked and I was hoping the Shure e535s would be deeper.  They sound is okay, but not as full as I had before the molds."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JP",
          "Nb_Reviews": 1,
          "Date": "2020-09-28T14:59:17.000Z",
          "Titre": "Great stability & sound seal",
          "Contenu": "I purchased mine through Amazon. Definitely much more stable in my ears than the silicone tips that come with the AirPod Pros. I wish they came in white. I got the grey and while they're true to color, it's such a light grey that it kinda just looks like a dirty white against the crisp white of the AirPods."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymoose",
          "Nb_Reviews": 6,
          "Date": "2023-06-13T17:12:48.000Z",
          "Titre": "The product is really good",
          "Contenu": "The product is really good. I wasn't quite as enamored with their communication during the time they were creating it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erick Garcia",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T20:52:49.000Z",
          "Titre": "They definitely don't fall out as much…",
          "Contenu": "They definitely don't fall out as much as the regular ones they get dirty if you have alot of wax in your ear for some reason I feel as the noise cancelation is off don't know why bout overall I like it bout still gonna have to give it a 4 star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sayeed",
          "Nb_Reviews": 2,
          "Date": "2020-10-10T01:16:34.000Z",
          "Titre": "The Fit is Great",
          "Contenu": "They fit really good. I just have huge ear canals so the buds don’t have rebound that contours them. But I would definitely use these on a long trip where I have to keep my AirPods on. They’re super convenient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edwin Nunez",
          "Nb_Reviews": 4,
          "Date": "2020-07-09T17:16:58.000Z",
          "Titre": "Good ear tips, bad packaging.",
          "Contenu": "The ear tips seem to be fine. They’re very comfortable and do a good job of isolation. The problem I had is with the packaging. It’s simply terrible. I had to peel through glue and cardboard to get access to the ear tips. Not sure how that got by R&D."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hanul J. Kim",
          "Nb_Reviews": 2,
          "Date": "2023-01-21T07:47:14.000Z",
          "Titre": "Cool case, meh eartips",
          "Contenu": "Eartips kinda fit, but not well enough to pass the eartip fit test. case is sick, cleaning tool does its job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward Sadler",
          "Nb_Reviews": 5,
          "Date": "2020-07-07T12:35:08.000Z",
          "Titre": "These are pretty good",
          "Contenu": "These are pretty good. Fit very well. Nice and comfortable but the need better colors."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay Hutchinson",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T15:53:30.000Z",
          "Titre": "Smaller case needed",
          "Contenu": "Smaller case needed, needs to be pocket sized to bring to a concert.  This case is huge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T18:58:56.000Z",
          "Titre": "So far so good",
          "Contenu": "They are definitely not falling out but still early. So far so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Brace",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T07:16:37.000Z",
          "Titre": "Plugs are great",
          "Contenu": "Plugs are great. They fit great and work really well with my iPods. Took about 4 weeks to get them was the only problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Micah Mendoza",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T14:29:55.000Z",
          "Titre": "Get 1 size higher than you usually wear"
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "Litza Reyes",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T03:59:32.000Z",
          "Titre": "They are very comfortable",
          "Contenu": "They are very comfortable, durable."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Abilash Keerthivasan",
          "Nb_Reviews": 1,
          "Date": "2020-10-26T18:57:51.000Z",
          "Titre": "Worth the money!",
          "Contenu": "Fits good and feels really comfortable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derek Jones",
          "Nb_Reviews": 1,
          "Date": "2021-10-16T14:56:00.000Z",
          "Titre": "Great product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grey Lawson",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T20:29:49.000Z",
          "Titre": "They fit great",
          "Contenu": "They fit great, have better isolation and bass response, and they stay in while I run!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T02:34:48.000Z",
          "Titre": "Great replacement for apple earpieces",
          "Contenu": "Arrived quickly.  The earbuds were easy to install and fit comfortably inside the ear canal and don’t drop out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Miller",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T04:34:47.000Z",
          "Titre": "I Love these Ear Fidelity Units !!",
          "Contenu": "I love these Ear Fidelity units !! They have enabled me to realize the full potential of my Sony WF-1000XM5 earbuds. No more weak bass due to a poor seal !! The full frequency range is produced faithfully now !! And the soft silicone material is super comfortable !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 5,
          "Date": "2023-10-25T20:48:51.000Z",
          "Titre": "Will be used at the Gun Range",
          "Contenu": "I've used electronic earmuffs for shooting for years, which are great for handguns, but depending on the rifle of shotgun, they get in the way. I finally decided to buy a pair of electronic earbud type hearing protection but looking at all the brands i know, I knew I wasn't going to pay $200 to $400 for something I wouldn't be using a lot, so I decided I wouldn't buy them. Then I found Eartune, and figured why not give them a try, after all, they have a good return policy. I could live with the price of the Eartune Hunt earbuds and the shipping was very quick. I haven't been able to go to the range yet but the fit is good. I have tried them in a loud environment and they seem to do a good job. From other reviews, I expect a lot and don't think I'll be let down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Keiser",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T15:27:51.000Z",
          "Titre": "Custom plugs are comfortable and very easy to deploy!",
          "Contenu": "The material appears that it will hold up well.  These custom plugs are comfortable and very easy to deploy.  I have funky ear canals [apparently] and these have changed my listening experience!   I work around a lot of noisy equipment (saws, sanders, motors) and these custom plugs fit so snug that the noise cancelling feature of my earbuds are much more effective!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin StClair",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T18:58:00.000Z",
          "Titre": "FANTASTIC",
          "Contenu": "FANTASTIC. I got custom tips for my 2020 Andormedas, they fit perfectly and really brought new life to these IEMs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy L",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T18:00:50.000Z",
          "Titre": "Must have foam replacement tips",
          "Contenu": "These foam AirPod tip replacements make all the difference in daily use. I always felt like the original silicon tips were loose and didn't fit well. I was afraid they were going to fall out at any moment when I was moving around. Comfort, security, and improved sound.  Apple AirPods should be shipping with these from the factory."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Virgilio Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T01:51:25.000Z",
          "Titre": "Ordering is simple, & quick w/ great customer service.",
          "Contenu": "Ordering was simple, placed the order and someone contacted me about when will I be sending my ear molds.  You can do it on your own but I paid $70+ to have an audiologist do it, mailed it to them and 4 to 5 weeks later custom ear tips at home.These things are amazing only now have I realized how bad the battery life is for Airpods Pros, as I am happy to leave my custom ear tips in my ears all day. Eartune's custom ear tips puts the Pro in the AirPods Pro as the given ear tips are terrible and now I can not get enough thanks to Eartune."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Spielman",
          "Nb_Reviews": 2,
          "Date": "2020-08-11T00:36:16.000Z",
          "Titre": "This is an amazing company to work with…",
          "Contenu": "This is an amazing company to work with when you're looking for a perfect pair of earbud adapters, custom made (when you send in professionally created molds of both your ears). They are made of surgical type rubber that's pliable enough to insert into your ear canal, while housing my new Xelento by Beyer Dynamics) perfectly, creating a seal so they stay firmly in your ears and provide for much better noise control and, an awesome sound. Their customer service? world class. Highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin Lettvin",
          "Nb_Reviews": 2,
          "Date": "2023-03-04T18:01:36.000Z",
          "Titre": "Nice product. Would love to have more color choices!",
          "Contenu": "Nice product. Hard to find anything else like it with a standard stem and an oval tip. Very soft and pliable silicone that doesn't cause ear soreness with prolonged use. Only suggestion: you guys should offer them in other colors besides black!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 2,
          "Date": "2022-03-31T13:52:06.000Z",
          "Titre": "Fidelity U eartips perfect for JBL Reflect Flow Pro",
          "Contenu": "Love the sound of the JBL Reflect Flow Pro earbuds, but their stock eartips were uncomfortable and didn't fit well. Tried using foam eartips from a different brand, and they also felt uncomfortable. The round shape just didn't fit well in my ears. Eartune Fidelity U eartips are exactly what I was searching for: lightweight silicone, flexible and comfortable, create a great seal, and don't slide out of place. My only regret is not finding these first!! Now, I can wear my JBL earbuds all day with zero discomfort."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul De La Cruz",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T06:56:42.000Z",
          "Titre": "Eartunes are far superior",
          "Contenu": "Eartunes are far superior to the ear plugs provided by Apple.  I bought the Beats earphones that hooked over the ear because my AirPods kept falling out during workouts.  Switching out to Eartunes has solved that problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MercyMA",
          "Nb_Reviews": 1,
          "Date": "2020-12-10T23:46:23.000Z",
          "Titre": "Great tips, great support!",
          "Contenu": "I've spent years trying to find silicon tips that will stay in my ears for longer than a few minutes. Eartune's Fidelity U tips are the first tips that actually stay in place, create a good seal, and bring out the best in my IEMs. Customer support is also great—had some shipping trouble, and they promptly sent out another order same day and at no additional cost. Well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Brown",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T17:40:48.000Z",
          "Titre": "Great customer service, high quality products!",
          "Contenu": "Eartune has great customer service, they told me to get my impression redone because the Audiologist didn’t follow the directions. It took a few extra weeks to get my first AirPod Pro Custom IEM Tips, but they were totally worth it. I have since ordered another pair of AirPod Pro tips with the new adapter, a pair of shooting ear plugs, and I just ordered a set of live music ear plugs. I love the quality of the ear tips, nothing standard fits and stays in my ears, so Eartune is my best option."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MCBRIDE, HEATHER",
          "Nb_Reviews": 3,
          "Date": "2023-07-19T18:07:02.000Z",
          "Titre": "Only thing that has ever worked for me!",
          "Contenu": "I have very oddly shaped ear canals and can literally never get earbuds to stay in — I’d tried everything! The earmolds I ordered just came in and they fit perfectly, stay easily in my ears, and have allowed me to start using my Apple AirPods for the first time. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Oliver",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T23:07:46.000Z",
          "Titre": "I was looking for foam eartips for a…",
          "Contenu": "I was looking for foam eartips for a set of IEMs that only come withedium where I was hoping for a large offering considering the price.  Shopped around at a few different sites, messaged this one on some dimensions I was needing, they gave that info and I ordered.  With that, of course they offered a free return and refund if it didn't work.  But they work perfect and here we are."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse Emperador",
          "Nb_Reviews": 1,
          "Date": "2020-12-11T20:45:47.000Z",
          "Titre": "Quick Deliver, Great Product",
          "Contenu": "Ordered foam Eartips for Airpods Pro. They were delivered in 2 days (faster than Amazon deliveries currently), and the product works great, keeping my Airpods Pros from falling out of my ear during workouts. I'm just confused why they are moving away from the ADV. Sound Branding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Prime",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T16:32:08.000Z",
          "Titre": "Customer Service is Excellent…",
          "Contenu": "Customer Service is where Eartune stands out for me.  I had left a review about memory foam eartips not fitting properly.  They immediately followed up and offered the next size down for me to try.  They worked well.  This experience led me to choosing this company for custom iem molds for my AirPod Pros."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael N",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T23:37:47.000Z",
          "Titre": "The fit is great, and the customer service is excellent.",
          "Contenu": "It all started with me asking if my earbuds would work with their process. Their customer service team were polite and responsive to all my questions and concerns. The fit is what I hoped for with custom molded ear tips as well as the sleep ear plugs I got with them. I'm very happy with everything and highly recommend these guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Ahn",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T20:18:58.000Z",
          "Titre": "No longer constantly pushing my earbuds back into position!",
          "Contenu": "I had custom earbuds made for my Airpod Pro 2s, and they work flawlessly. Now my wireless headphones don't fall out when I exercise or eat (chewing always used to work one or the other out of my ear), and I don't have to constantly push them back into position. I can't say enough good things about them.I also bought the case to store the earbuds with the wireless headphones. I like the case, but the earbuds don't stay in the lid compartment where they are meant to. I'd add a second strip of elastic fabric across the top half of the lid (not just the bottom half), so they stay in place, but it's not a big design problem. I just find them on top of the charging case when I unzip and open the carrying case on occasion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Orannukhroh",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T18:42:45.000Z",
          "Titre": "I bought the Fidelity U for my Sony…",
          "Contenu": "I bought the Fidelity U for my Sony WF-1000 XM4 because I read in one of the review that the eartips that include are uncomfortable. Well, the original eartips for me is not uncomfortable but this Fidelity U eartips just make the whole earbuds much more comfortable to wear, better fit, and my ears don’t hurt if I wore them for long periods of time which I have with the original ear tips after 2 hours. Best part, it fit enough for me to wear while running which is why I bought the earbuds in the first place. Overall, it’s a solid investment for your Sony WF-1000XM4."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sotirios Tzanetakos",
          "Nb_Reviews": 1,
          "Date": "2020-10-02T15:28:51.000Z",
          "Titre": "Apple cheats out at the last step of production.",
          "Contenu": "The original pieces that came with my airpod pro’s absolutely suck. I can’t believe that Apple which makes such great products cheaper out on the last part. I have a question for them: who cares how good a product is if it’s uncomfortable and slides out (no matter what size is used) ??  The memory foam pieces are superb. And they’re inexpensive enough to have no problem replacing them when worn out. I will be a returning customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 6,
          "Date": "2022-09-09T15:56:17.000Z",
          "Titre": "Excellent products and the ordering…",
          "Contenu": "Excellent products and the ordering process was straight forward.  I mailed in my impressions, the earplugs and IEM tips I ordered were a perfect fit and I am 100% satisfied with both.Questions I sent to customer service were promptly answered. Excellent across the board."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Gagne",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T17:57:47.000Z",
          "Titre": "Simple solution for need to remove custom earmolds to charge",
          "Contenu": "They fit well, and provide the isolation I was looking for. But I don't need that isolation level all the time, just in very noisy environments. With that in mind,  my only hesitation with your custom mold's design was the need to remove them every time before I could put the airpods pro back into the case. Fortunately I've arrived at a simple solution. I have some earbud tips that fit nicely onto your white baffles -- the baffles being the white hard plastic deals that snap onto the airpods pro- which I now keep on the baffles most of the time, and THEY fit in the charging case. So for regular use I have your white baffles installed plus eartips similar to Apple's in size and performance. Then, on those occasions I need better isolation, I pop off those tips and use your custom earmolds. Very happy with this solution. Eartune might even consider shipping a few sizes of similar earbud tips as maybe an option, perhaps including a small surcharge, with your custom mold orders."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy Carson",
          "Nb_Reviews": 1,
          "Date": "2021-04-03T02:31:48.000Z",
          "Titre": "Amazing Customer Service!!",
          "Contenu": "I received the ear tips in a matter of days. I ordered the medium sized ones based on their recommendation on the website. I could definitely tell a difference, but they didn’t quite seal up like I would have expected. I contacted them and they immediately sent me the next size up to ensure that I was satisfied with their product. I have to say, they make an amazing product and it is truly a game changer. My AirPods have never sounded better. It also enhances the noise canceling as well, which is a plus! I will continue to, and have already, recommend them to my friends and coworkers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Smith",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T17:28:10.000Z",
          "Titre": "AirPods slipping out? This is your solution",
          "Contenu": "Found these on an ad on Instagram and I’m glad I did because earbuds are always a pain point for me when they slip out of my ear. These pretty do exactly as stated- They’re comfortable; I’ve used some of these foam ear buds for my AirPod Pros in the past and they were kinda uncomfortable after 20-30 minutes. I have these in for like two hours and they’re great - They don’t slip out my freaking ear, thank god lol, the MAIN point of me getting these- They don’t deteriorate the sound. These are dope, definitely will be buying again and if you’re debating getting them because you have problems with your AirPods slipping out your ears too? Just pull the trigger and buy these and do yourself a favor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C Emory",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T18:32:37.000Z",
          "Titre": "I have the memory foam tips for air pod…",
          "Contenu": "I have the memory foam tips for air pod pros. There’s no warranty but after I messaged them and explained what happened to my original pair I received 30% off on a replacement pair and they are very comfortable so  based on quality and excellent customer service I would recommend anyone to order from this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Busser",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T17:40:37.000Z",
          "Titre": "I have used many eareplugs for surfing…",
          "Contenu": "I have used many eareplugs for surfing and these are hands down the absolute BEST!!  They never fall out! I use these 3 or 4 times a week and can't imagine surfing without them. My ears thank you Eartune!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harvey  H",
          "Nb_Reviews": 2,
          "Date": "2022-05-02T16:09:09.000Z",
          "Titre": "There earbud tips for my galaxy pros…",
          "Contenu": "There earbud tips for my galaxy pros work much better than what comes with the original ear buds. They are comfortable and seem to seal better plus stay better in my ears. Perfect replacement to enjoy my galaxy products. Love em. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin StClair",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T19:27:41.000Z",
          "Titre": "Sounds great",
          "Contenu": "Sounds great, and super comfortable.The delivery lead time was quite long, but it was delivered right when they said it would so you can't beat that. Very happy with everything!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T17:27:32.000Z",
          "Titre": "Great fit",
          "Contenu": "I must have a very oddly shaped ear canal. The standard AirPod Pros 2 tips just didn't feel secure. I ordered the foam ones from here and they are absolutely perfect. Snug but not uncomfortable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marv",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T14:53:09.000Z",
          "Titre": "Eartune foam memory tips are superior…",
          "Contenu": "Eartune foam memory tips are superior quality. Installing them creates an initial distortion in the tips but the foam rebounds perfectly. The fit is great and sound accuracy has improved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sydney Lebowitz",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T20:22:02.000Z",
          "Titre": "The custom ear molds fit perfect and…",
          "Contenu": "The custom ear molds fit perfect and they were shipped according to schedule.I'll be buying more custom products in the future for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Xavier Garcia",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T15:16:12.000Z",
          "Titre": "10/10 Recommend!",
          "Contenu": "They sent me my request extremely fast. The packaging was nice and instructions easy to understand. The airpod tips was very easy to replace and in no time I could feel the comfort and security of the new tips. Plus I love the color options!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Max Welter",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T20:43:24.000Z",
          "Titre": "Expectations Met - Strongly recommended for earbud enthusiasts",
          "Contenu": "Considering the cost for the product and the effort required to schedule and have impressions created, I had high expectations for the effectiveness both of stability and passive noise isolation. I am pleased to find that the custom molded ear tips live up to the promise. Although the time of manufacture was long, I received my tips within the suggested timeframe of 4 weeks. Eartune has earned my trust and appreciation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Strickland",
          "Nb_Reviews": 2,
          "Date": "2021-04-09T14:51:08.000Z",
          "Titre": "Customer service went above and beyond to make sure I was satisfied.",
          "Contenu": "The team at eartune went above and beyond to make sure I was going to be happy with the eartune fidelity tips for my AirPod pros. The problem was that I have extremely tiny ear canals. The eartune team initially told me that my AirPod pros would protrude so much it would look funny and asked if I would like a refund. I refused the refund and told them I didn’t care if they stuck out too much as I just wanted my AirPod pros to stay in my ears. So a few days later they informed me that they had modified the original design in order to accommodate my tiny ears as well as not look ridiculous. I love them. My AirPods stay in and they are comfortable. They fit so well I’m able to ride my scooter with them in! Thanks eartune!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darren Dodson",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T20:57:36.000Z",
          "Titre": "Second set of 3-pack purchased",
          "Contenu": "This is my second set purchased, airpod pros fell out all the time prior to using these. Work out twice a day and they do not fall out weight lifting and outdoor running. Game changer from originals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hayden Schmitt",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T19:56:10.000Z",
          "Titre": "Great to work with",
          "Contenu": "Great to work with, flexible if you change your mind about the specifics of your order. The custom ear tips are incredible!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JZz",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T22:17:19.000Z",
          "Titre": "these are form fitting and are…",
          "Contenu": "these are form fitting and are comfortable to wear for extended periods of time.   They stay put, even while extreme sweating....."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corbin",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T16:24:28.000Z",
          "Titre": "Works great and they feel even better",
          "Contenu": "Works great and they feel even better. A huge upgrade from the original apple tips and fast shipping. Will definitely be returning for more products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Baker",
          "Nb_Reviews": 1,
          "Date": "2020-08-01T22:21:38.000Z",
          "Titre": "great customer service and they feel great",
          "Contenu": "I ordered the medium size and wasn't able to get a good seal. The great people at Eartune sent me the small right away.  I tried these and the felt much better, but I was not able to get the good seal according to apple whenI did the fit test.  I am able to get the good seal indicator with there original medium size tips, but not the foam.  I am not sure if this is an apple thing or just my goofy ear canals??  Thanks Eartune for the great customer service.  I will use the size small tips because they feel great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan Hull",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T21:53:06.000Z",
          "Titre": "Peace of mind",
          "Contenu": "Love the foam ear pieces. They hold in my ears much better than the silicone ones. Before I was always worried of them falling out while working."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 2,
          "Date": "2021-10-04T20:11:29.000Z",
          "Titre": "Great customer serivce",
          "Contenu": "Original earbud tips did not fit, but after contacting customer support, the next inner diameter size was shipped out at no charge. Excellent customer service. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jimmie perry jr",
          "Nb_Reviews": 1,
          "Date": "2021-08-14T15:11:19.000Z",
          "Titre": "Best ear tips",
          "Contenu": "The air pods ear tip didn’t ever feel right in my ears so I’d have a lot of pain after awhile wearing them and this company came into my life and has changed it forever. By far the best product I have ever bought"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "christian",
          "Nb_Reviews": 2,
          "Date": "2020-12-14T22:53:11.000Z",
          "Titre": "Works as advertised",
          "Contenu": "Works as advertised. However, blocks most sound so you can't have a conversation with anyone around you without yelling."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Berg",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T16:56:46.000Z",
          "Titre": "Perfect.  Great Product.",
          "Contenu": "Easy to attach. Great design.  Solid color.  Fits very well. No need to adjust after wearing them for over 30 minutes.  Have not fallen out of my ears since I started using them. Great product. Glad I found these as even the largest original air pod ear cones would not stay in for long periods.  Thank you Eartunes.  I’ll be ordering a 2nd set just so that I have a spare."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek Simoneau",
          "Nb_Reviews": 2,
          "Date": "2021-02-01T17:46:58.000Z",
          "Titre": "Excellent products!",
          "Contenu": "Excellent product, works perfectly! I no longer have to worry about my $250 AirPod Pro’s falling out of my ears and losing them. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Hutson",
          "Nb_Reviews": 4,
          "Date": "2023-01-12T23:31:55.000Z",
          "Titre": "Product delivers as advertised",
          "Contenu": "Product delivers as advertised. Makes a big improvement over the stock eartips. Good price, fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Edwards",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T05:16:06.000Z",
          "Titre": "They are a great upgrade",
          "Contenu": "They are a great upgrade ! They 100% stay in my ears while mowing. The mower always seemed to vibrate the Apple AirPod Pros out and that was trying all three sizes. Not now ! Great product and would recommend to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T17:57:39.000Z",
          "Titre": "Fits great..way better than the originals",
          "Contenu": "Fits great..way better than the originals.  Much tighter and way less movement in the ear when exercising.  Improved sound as well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phillip Jones Sr.",
          "Nb_Reviews": 5,
          "Date": "2023-02-04T17:06:21.000Z",
          "Titre": "Great Product",
          "Contenu": "I ordered the Airpod Pro 2 eartips and they are a great fit and stay in no matter what.  Will definitely buy more products from this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CJ",
          "Nb_Reviews": 6,
          "Date": "2021-03-15T04:30:25.000Z",
          "Titre": "Love these",
          "Contenu": "Love these - so much better than the silicone tips that come with AirPods...and a quality unmatched by other foam tips."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Otto",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T16:12:17.000Z",
          "Titre": "The eartunes fit with out any issues…",
          "Contenu": "The eartunes fit with out any issues and it improved the sound quality of my air pod pros. They also do not slip or fall out when working out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Laus",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T20:52:03.000Z",
          "Titre": "Excellent ear plugs.",
          "Contenu": "Excellent ear plugs.I use them for shooting. I have had custom in ear plugs made before these far out preform the fit and finish of others I have had.Thanks for r a great product and fast serviceR.C.Laus"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MONIQUE PARKER",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T17:41:41.000Z",
          "Titre": "The foam earbuds I bought for my…",
          "Contenu": "The foam earbuds I bought for my AirPods Pro are Great my ear buds stay in my ear now without falling out"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Bollard",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T19:54:47.000Z",
          "Titre": "Great plugs for surfing",
          "Contenu": "Great earplugs for surfing. They stay very secure, feel great and I can still hear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MattY",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T18:34:15.000Z",
          "Titre": "Fast and free shipping, max comfort",
          "Contenu": "Fast and free shipping, and my AirPod pros actually stay in my ear with these."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doris M",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T04:19:50.000Z",
          "Titre": "Love my new ear buds",
          "Contenu": "Love my new ear buds. It’s so comfortable to sleep with and they keep me from waking up. The noise canceling is superb."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Miles",
          "Nb_Reviews": 2,
          "Date": "2023-05-22T16:25:06.000Z",
          "Titre": "A+ thank you so much for my package I…",
          "Contenu": "A+ thank you so much for my package I really appreciate it and I love it so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy Alfonso",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T17:29:35.000Z",
          "Titre": "Great product.",
          "Contenu": "The tips that came with my AirPods were too big for my ears. Eartune’s Foam Tips fit perfectly and snuggly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gino G",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T22:33:21.000Z",
          "Titre": "Excellent service and follow up",
          "Contenu": "I ordered three items and one of them was shipped as the wrong size. Eartune quickly sent me a replacement free of charge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "THOMAS NICKODEM",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T18:05:49.000Z",
          "Titre": "A perfect fit!",
          "Contenu": "A perfect fit for my ears all the way around, great work on these custom tips😀"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Martinez",
          "Nb_Reviews": 3,
          "Date": "2022-04-08T02:11:22.000Z",
          "Titre": "Love them",
          "Contenu": "Love them! They fit great and are vey comfortable when wearing them for long periods of time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana Massie",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T21:58:27.000Z",
          "Titre": "Terrific team",
          "Contenu": "Terrific team. The whole process is very smooth. Impressive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nitin Sharma",
          "Nb_Reviews": 1,
          "Date": "2020-07-27T17:58:08.000Z",
          "Titre": "Great eartips",
          "Contenu": "Great eartips. My AirPod Pros finally stay in my slippery ear canals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler Rorabaugh",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T03:45:56.000Z",
          "Titre": "Earplugs",
          "Contenu": "They work pretty good. I’ve used them 3 times and there doesn’t seem to be any water getting into my ear. Great job👍🏼"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Markovitz",
          "Nb_Reviews": 2,
          "Date": "2020-12-22T19:59:41.000Z",
          "Titre": "Awesome product fits perfectly with a…",
          "Contenu": "Awesome product fits perfectly with a great pop of color.  Sadly they ran a bogo the day after I ordered but great product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff J",
          "Nb_Reviews": 4,
          "Date": "2022-03-15T16:16:18.000Z",
          "Titre": "Feels great in my ears",
          "Contenu": "Feels great in my ears, perfect quality, very fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "aileen rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T05:12:25.000Z",
          "Titre": "AMAZING",
          "Contenu": "They are so good, they do not move at all and I love how they don’t fall out when I workout. I do like to workout and walk a lot and they stay in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ohanio Harris jr",
          "Nb_Reviews": 2,
          "Date": "2021-03-13T17:02:52.000Z",
          "Titre": "Nice alternative if want to change the…",
          "Contenu": "Nice alternative if want to change the color of the tips"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "George Staikos",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T16:42:05.000Z",
          "Titre": "Awesome product",
          "Contenu": "Awesome product, great attention to detail. Support was excellent too. Definitely recommend these to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Mejia",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T19:33:47.000Z",
          "Titre": "Must Have",
          "Contenu": "Definitely a must have. Would love to try more products from this company! Thank you they fit great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kurtis Cox",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T22:58:31.000Z",
          "Titre": "Eartunes are  a great product",
          "Contenu": "Eartunes are  a great product.  My AirPods will stay in my ears now and don't fall out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie S.",
          "Nb_Reviews": 4,
          "Date": "2021-07-17T14:27:03.000Z",
          "Titre": "Exactly what I needed!!",
          "Contenu": "Exactly what I needed!  Now my earbuds fit perfectly!  Great product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda Diehr",
          "Nb_Reviews": 6,
          "Date": "2021-04-17T11:39:30.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent! Comfortable fitting and work well with my AirPods!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2022-10-07T19:04:27.000Z",
          "Titre": "Easy and fast",
          "Contenu": "Easy and fast!  My aqua fit great and as advertised don't come out in waves"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Engel",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T22:03:59.000Z",
          "Titre": "AirPods Pro",
          "Contenu": "Custom plugs for my AirPods are so dope"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Jackson",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T05:52:01.000Z",
          "Titre": "These air buds have saved my life and…",
          "Contenu": "These air buds have saved my life and my marriage thank you for everything"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Washburn",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T16:49:44.000Z",
          "Titre": "Much better fit than the default."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Brooke",
          "Nb_Reviews": 2,
          "Date": "2022-08-05T16:36:13.000Z",
          "Titre": "Great service",
          "Contenu": "Great service . Product exactly as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony A",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T20:34:40.000Z",
          "Titre": "Awesome product!!",
          "Contenu": "Awesome product!!! Fast shipping!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ely",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T04:41:49.000Z",
          "Titre": "I bought their eartips and fit really…",
          "Contenu": "I bought their eartips and fit really well, i like em."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Layla Davis",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T22:21:52.000Z",
          "Titre": "Great",
          "Contenu": "Way better then the original"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Barton",
          "Nb_Reviews": 1,
          "Date": "2020-08-17T14:45:05.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service.    Just excellent.   Quickly resolved issue with courteous and quick communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Padilla",
          "Nb_Reviews": 2,
          "Date": "2022-09-04T23:44:44.000Z",
          "Titre": "Nice fit",
          "Contenu": "Nice fit. Perfect"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Arthur Esposito",
          "Nb_Reviews": 2,
          "Date": "2022-10-06T02:18:02.000Z",
          "Titre": "Great fit",
          "Contenu": "Great fit, easy process!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. Hall",
          "Nb_Reviews": 1,
          "Date": "2021-07-17T17:05:17.000Z",
          "Titre": "Made me love my EarPods again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mauricio Puma",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T16:24:09.000Z",
          "Titre": "Great fit works as designed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Reifenberg",
          "Nb_Reviews": 2,
          "Date": "2022-06-28T18:26:21.000Z",
          "Titre": "4 pairs 4 excellent examples of…",
          "Contenu": "4 pairs 4 excellent examples of excellence. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wesley Sun Chee Fore",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T18:39:40.000Z",
          "Titre": "Works great",
          "Contenu": "Works great! And product came in quick!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pinak Dhokale",
          "Nb_Reviews": 2,
          "Date": "2020-10-15T23:16:11.000Z",
          "Titre": "Excellent customer service and product!"
        }
      ]
    }
  ]
}