{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ecigmafia.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Mackrides",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:28:05.000Z",
          "Titre": "Received numerous faulty black liquid…",
          "Contenu": "Received numerous faulty black liquid vapes, asked about it and the customer service response was “Sorry theres no warranty” never buying from here again, cheap fake chinese vapes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristin Benavidez",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:47:10.000Z",
          "Titre": "Not what I was expecting",
          "Contenu": "They came on time which was pretty good considering where they were being shipped from. BUT.... As soon I as I open the very first one which was the (strawberry flavor) was disappointed. After 2 hits it got super hott, then started blinking as if were already dying. It got super hot and stayed thar way for a long time, I thought it was gonna blow up for realz. It was just an all bad experience for me because this is my absolute favorite brand of vape and I can't find anyone selling them in or around where I live, so I was very excited to finally get them. But the excitement was just as quickly turned in to disappointing. I'm a lil scared to open the others in fear that I not only my hopes up but also wasted my money aswell."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John  Datson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:35:24.000Z",
          "Titre": "Last 2 times I’ve ordered it’s taken 4…",
          "Contenu": "Last 2 times I’ve ordered it’s taken 4 business days to even update the tracking"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wm Randall Sides",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T06:02:39.000Z",
          "Titre": "Gotta believe they sold me a bunch of…",
          "Contenu": "Gotta believe they sold me a bunch of knockoff disposables. Never seen the logos fall off a bonafide. Also, too many didn't work, right out of the package, didn't work at all. Contacted EcigMafia and received their usual refusal to stand behind what they sell."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sherry Scheneman",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T01:02:56.000Z",
          "Titre": "Trying a new pod mesh cause had one to…",
          "Contenu": "Trying a new pod mesh cause had one to many bad experiences with the 5500 pod mesh and well these ones are weak and one that didn’t work and now have to try to get them to return my money..so get to play email tag"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie B",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T04:09:47.000Z",
          "Titre": "Shipping Speed",
          "Contenu": "I always have ordered from you because of the shipping experience being so FANTASTIC!! It has gone down hill tremendously. It used to be 2 days to my house from you now it is taking a week. The package is sitting at your place with just the label created for about 2 days before it even leaves to USPS. Then after it leaves tracking never updates. Also I have asked EVERY SINGLE TIME to have my items shipped in a box to prevent damage and you never comply. So frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeryl Anderson",
          "Nb_Reviews": 12,
          "Date": "2023-12-11T09:03:54.000Z",
          "Titre": "No morals, cheapskates, will not stand behind their product.",
          "Contenu": "I've been using ecigmafia for a couple years now and in the beginning I had a disposable device not work correctly and when I reached out to customer service they asked I send a video of the device malfunctioning which I did and they credited my account. Sometime later I had opened a device to find the inside of the bag it came in soaked in ejuice and the device was DOA. I emailed support and they gave me push back saying they aren't reaponsible for the product they sell and the device manufacturer is at fault and I would need to take it up with them. BUT they offered to do me a HUGE favor and repace the device after I paid for shipping and send the defective device back to then. I told them I would just eat the cost this time, attempting to be gracious. They ignored my response appearing less than grateful for my being reasonable or loyal. Since then I have had four more deivices I've had to throw in the trash as they arrived as described above. I haven't even bothered to deal with ecigmafia's cheapskate customer service. Spend hundreds on their site but then basically be accused of trying to commit fraud if I get a bad device and expect them to back up what they sell. I'll be seeing if there is a different vendor that values my patronage next time I shell out for 20+ devices per order. I'm disgusted with companies dodging resposibility and nickel and diming a person at every opportunity."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica Vigil",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T22:30:33.000Z",
          "Titre": "The products are fine for the most…",
          "Contenu": "The products are fine for the most part, but the team that answers the customer service email address are rude and condescending.  I had a warranty issue because I got three duds out of the 10 I ordered and the response that I received was \"we have never had a problem with those\".  Then I asked about getting charged for shipping and was explained that the \"math was simple\".  So, yeah..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Drew M.",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T06:00:58.000Z",
          "Titre": "Still waiting for my order....",
          "Contenu": "So I made an order Monday and tracked it and it's Saturday and still haven't received it. I've had a friend order multiple times from there and the previous order was done Sunday evening and was received Thursday. While tracking this order for one thing it sat at 1 post office for 3-4 days and today it finally showed up in Denver at 4:13am, yet somehow I still didn't receive it today. I know to cover yourselves you say it can be a week, but you're shipping 2-3 day Priority mail. Mail even delivers on Saturday. 5-6 shipping days and I still don't even know if I'll get it by next week. I'm not saying it's crazy for something to take 7 or more days, but I've order from other places before and if you order Monday you're definitely getting it by Friday. Considering you sent me this email a couple days ago asking to review my purchase. I assume it means you think I should have received the product by now to review it right? Pretty tough to do a review when I haven't received the product. I learned my lesson and most likely will try a site with more reliable delivery times. Lesson learned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charlie Chapman",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T00:01:13.000Z",
          "Titre": "I don’t like the fact that I ordered…",
          "Contenu": "I don’t like the fact that I ordered two items that clearly say bogo on them and did not receive bogo. The money I spent on the items plus shipping to receive only the two vapes I picked was the same as me walking in my local store, only I wouldn’t have had to wait five days for it. To be fair I did get half of a store credit back, but I feel that if it says bogo on it, you shouldn’t have to do any extra stuff to get bogo"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 3,
          "Date": "2023-11-09T17:47:45.000Z",
          "Titre": "My most recent email conversation with support",
          "Contenu": "My most recent email conversation with support left me in shock as they stated I needed to open each item within 72 hours to make sure the safety seals were in tact.  Yes, they offered a refund for the damaged items, yet I do not need to check each item I purchase at the grocery store when I get home, that would make no sense.  They have lost my business moving forward!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Darling",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T00:13:38.000Z",
          "Titre": "Worst customer service ever",
          "Contenu": "Worst customer service ever, shorted me 16 dollars of product, then state its already shipped nothing we can do, yeah ok, never doing business with this shotty place ever again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Johnny  Flores",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T16:52:46.000Z",
          "Titre": "Don’t know where my order is tracking…",
          "Contenu": "Don’t know where my order is tracking says label was canceled and I have messaged 2 times to ask what the status is no response at all. A little more than disappointed especially since I hadn’t had any issues in shipping thus far so it would be nice to have some understanding as to what has happened or some type of update."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremy  Roach",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T19:02:25.000Z",
          "Titre": "The order didn't go threw never dose…",
          "Contenu": "The order didn't go threw never dose even tried last night with my sisters account and like always nope"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rghuf",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T23:50:12.000Z",
          "Titre": "Product worked fine for just over the…",
          "Contenu": "Product worked fine for just over the 30 warranty then the trigger switch broke and would not fire my vape. Will not order again from this store and I was going to keep ordering different products. Oh well!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T00:11:42.000Z",
          "Titre": "Fake product did not pass yocan…",
          "Contenu": "Fake product did not pass yocan verification"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesse The Man, The Myth, and the Legend!",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T07:47:57.000Z",
          "Titre": "Slow shipping",
          "Contenu": "Im super bummed because I have ordered before and received my order extremely quickly, but this time it has taken way longer! The items still haven’t been shipped and the tracking info states that it hasn’t even been delivered to the post office! Don’t get me wrong the deals are amazing and in all reality I will probably order with them again, but I’ve been telling anyone I know who vapes about how awesome this site is to only be let down by slow shipping!! :(("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesus  Figueroa",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T02:24:14.000Z",
          "Titre": "Wanted to purchase menthol e liquid",
          "Contenu": "Wanted to purchase menthol e liquid. You had it as in stock. Ordered 3 and only let me purchase 1. Gave the impression you wanted to make extra on the shipping fees."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "No Bueno",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T22:09:18.000Z",
          "Titre": "Order 24 disposables 6 faulty",
          "Contenu": "Order 24 disposables. 6 of them faulty. They wouldn’t stop firing after the first pull. Reached out to ecigmafia. They said they can’t do anything about it because 72 hours had passed since receiving the delivery. Maybe they expected me to test all 24 upon receiving them? Does anyone do that? Test every single disposable they receive immediately?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer  Matthews",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T01:49:11.000Z",
          "Titre": "Never again",
          "Contenu": "I have ordered from cigmafia twice and both times I've been sent vapes that quit working after a week. According to the return policy ecigmafia will not assist me in fixing the problem. I will NOT order from ecigmafia again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "pete  srader",
          "Nb_Reviews": 8,
          "Date": "2023-12-12T22:11:35.000Z",
          "Titre": "I didnt get my package until dec 4th i…",
          "Contenu": "I didnt get my package until dec 4th i ordered on the 24 of nov. Im done w ecig mafia.  They suck"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicolas  Gorsky",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T03:00:52.000Z",
          "Titre": "customer service is a joke",
          "Contenu": "customer service is a joke. they lost a customer over $5.00"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "UK",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T17:08:01.000Z",
          "Titre": "Most of your stuff is out of stock",
          "Contenu": "Most of your stuff is out of stock. Have been waiting for the vaporess gen 80s for more than a month (after confirming with support that it will be available in 10 -12 days) Dinner lady salt nic is almost out of stock. If you wait for an item to get back in stock, the other item gets out of stock. Thats not how wholesale works."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara Marstiller",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T02:12:58.000Z",
          "Titre": "Bought a vape kit that went bad in a…",
          "Contenu": "Bought a vape kit that went bad in a month and they refused to replace it or the faulty pods..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa White",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T21:29:13.000Z",
          "Titre": "I ordered my vapes on October 7th and I…",
          "Contenu": "I ordered my vapes on October 7th and I live just below Memphis in NW Mississippi. For some reason my package left Memphis and was sent to Atlanta GA. It is now October 15th and I still don't know why my package appears to be in Atlanta. I usually get my packages delivered promptly. Now we have a big issue. I need help from customer support. I called and left a message."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "pete  srader",
          "Nb_Reviews": 8,
          "Date": "2023-12-01T19:38:28.000Z",
          "Titre": "Its been going on a week and no…",
          "Contenu": "Its been going on a week and no package. Ecig mafia sucks.  Dont waste your time or money dealing with them . unless you like dealing with bs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roy Oellermann",
          "Nb_Reviews": 3,
          "Date": "2023-10-05T03:19:40.000Z",
          "Titre": "I have usually have a great experience…",
          "Contenu": "I have usually have a great experience with this company however this order has been terrible. I placed an order 5or6days ago on the weekend. They filled it on October 2nd and made a shipping label and stated is has been shipped however 3days later the post office still has yet to receive the package this is unacceptable. Don’t mark things as shipped when only the label is made."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Carpenter",
          "Nb_Reviews": 4,
          "Date": "2023-11-17T12:12:16.000Z",
          "Titre": "I placed another 143.00 dollar order I…",
          "Contenu": "I placed another 143.00 dollar order I was shorted a 18650 (2 pack ) only one came I order a lot of stuff with you guys and I hope you make it right I got more than enough mafia bucks to cover a battery I’m going to leave a review on YELP !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TALMADGE CORE",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T21:14:58.000Z",
          "Titre": "WRONG  items sent!!!",
          "Contenu": "WRONG  items sent!!!! Need to return these and this is a MAJOR INCONVENIENCE!!!! Please send email with instructions"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan Briscoe",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T21:06:23.000Z",
          "Titre": "yall take way too long to ship",
          "Contenu": "yall take way too long to ship. 3 days is ridiculous. i live 60 miles away from your facility yet my package went to florida first. why not have shipping options? i would gladly pay more to not have to wait till the resurrection for package to arrive. you should really offer faster shipping options. its 2023."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dwayne Scott",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T01:10:55.000Z",
          "Titre": "Customer service was abrupt and off…",
          "Contenu": "Customer service was abrupt and off putting. Zero effort to resolve issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jamie Aragon",
          "Nb_Reviews": 5,
          "Date": "2023-11-04T01:22:29.000Z",
          "Titre": "I have still not received my entire…",
          "Contenu": "I have still not received my entire order. I've been trying to get ahold of yall sending emails seeing when I'm going to receive it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ralph Gaspar",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T22:37:41.000Z",
          "Titre": "3/4 broken disposables",
          "Contenu": "3 out of the 4 vapes had issues.  One never came on after the first hit.  The other two burnt out after a couple days of using it.  Surprisingly the HorizonTech piña colada vape is still going strong.  Disappointing considering I've heard good things about this site.  Maybe just bad luck, but 3/4 devices going out so quickly doesn't look too great."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timbathy",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T19:25:09.000Z",
          "Titre": "Read shipping comments ffs",
          "Contenu": "8$ shipping for 4$ order with a total weight under 75 grams is awful, especially when I had two active orders and it's flat rate shipping. Was forced to convert \"mafia bucks\" due to an error and wasn't replied to at all when contact support trying to revert the coupon back to points. Reached out 3 different ways and wound up just using it on the separate order in frustration after over a month of nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOSEPH MILSTEAD",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T12:30:19.000Z",
          "Titre": "Orders are taking too long to be…",
          "Contenu": "Orders are taking too long to be shipped and received. There's no reason for this save for bad planning. Time to reevaluate the shipping situation. ASAP ! No this ain't the only time it's been the last 3 at least."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua  Augsburger",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T22:59:06.000Z",
          "Titre": "avoid dragbars 5000",
          "Contenu": "Both of the dragbars I ordered continued to run 5-10 seconds after hitting them, flavor was terrible. Within a minute or so after instantly gave me a sore throat and sick feeling for hours.When I tried to return them they asked for a video of the malfunctioning, I replied with you guys can because I will not experience that again after.This is the first time I’ve felt an instant sore throat as well as feeling sick and I’ve probably had 50-60 disposables within the past year. None of them did that"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alexandria Lee",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T16:00:37.000Z",
          "Titre": "horrible shipping length and customer service- far better websites out there: buy beware",
          "Contenu": "If you expect any type of decent shipping services for the amount paid for shipping, there are much better websites. It took 5 days just to generate a shipping label, there tracking doesn't work, and there is no one that answers inquiry about package location. worst site i've order from thus far, but if you have several weeks to wait on product then you might not mind the ridiculousness that I am STILL waiting to receive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Silvia Mahoney",
          "Nb_Reviews": 2,
          "Date": "2023-01-10T01:12:37.000Z",
          "Titre": "Sent the order to the wrong address…",
          "Contenu": "They sent the order to the wrong address and then tried to blame me it was returned to sender by the post office so it's obvious that I didn't send it there hopefully they'll send it back to me at the right address or I'll get a refund this is nothing against the product and which is great and usually the service is great and the shipping is super fast so I'm really surprised that this happened"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Celeste  Sigley",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T02:32:36.000Z",
          "Titre": "The disposable  vapes I received lasted…",
          "Contenu": "The disposable  vapes I received lasted 6 hrs now trying to charge says 100% and its dead I really haven't had a problem except this time and 2 more of same to try"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Caitlyn Riggs",
          "Nb_Reviews": 2,
          "Date": "2023-01-09T23:09:40.000Z",
          "Titre": "WASTE OF MONEY! USELESS PRODUCTS!",
          "Contenu": "I recently realized that I ordered the wrong kind of pod. Their customer service is HORRIBLE! they would not even give a partial refund. I wasted $200 of my hard earned money on a product that I will never use and has no value to me. I barely make $1600 a month. Customer service was so rude. They will NEVER get my money again and I will spread the word everywhere. You should treat your customers better if you want them to come back and give you more money. Smh..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashley Treviranus",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T23:20:22.000Z",
          "Titre": "Junk!!!!",
          "Contenu": "The last order I received 3 of the disposable vapes didn’t work. One of them just didn’t work at all which was the strawberry cotton candy one that I was looking forward to and both the biff bar vapes stayed on after you would take a hit off them so after being stuck on they tasted like burnt paper so I threw them away! Very disappointed with what I paid for this time!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Community Made Tiny Homes",
          "Nb_Reviews": 3,
          "Date": "2023-10-11T15:56:11.000Z",
          "Titre": "This is my 3rd order",
          "Contenu": "This is my 3rd order, and it gets slower and slower for fulfillment and shipping, takes over a week to travel less than 500 miles? I get autoparts from NY in 3 days shipped ground? They print a label when u order then it sits for a wk prior to shipping?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tk",
          "Nb_Reviews": 2,
          "Date": "2023-01-10T22:52:55.000Z",
          "Titre": "Wasted my time.",
          "Contenu": "I tried to place an order but they could not send certain products to that state. So I tried to change it to my home and that wouldn't work because my billing and mailing address are different. Contacted them to see if there was a work around. Surely I am not the only person this has happened to. But nope. Just a waste of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANTHONY",
          "Nb_Reviews": 2,
          "Date": "2023-10-15T22:44:20.000Z",
          "Titre": "I ordered 4 disposable Orion vapes and…",
          "Contenu": "I ordered 4 disposable Orion vapes and 3 keep firing after you hit them I reached out to support Friday and still haven't heard back this has happened the last 4 times I've ordered and got defective devices"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joanna Mearis",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T08:18:37.000Z",
          "Titre": "My order was placed last week roughly 7…",
          "Contenu": "My order was placed last week roughly 7 days ago. When I look at tracking it has been sitting in Atlanta Georgia since July 11th 2023 waiting for a label to be created. I have not experienced anything like this with my previous orders. I can't think of a reason of why my shipment is still in Atlanta waiting for the label to be created it is now July 17th."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M in South Florida",
          "Nb_Reviews": 2,
          "Date": "2023-01-09T22:26:17.000Z",
          "Titre": "Placed 2nd BOGO order Black Friday 2022…",
          "Contenu": "Placed 2nd BOGO order Black Friday 2022 for my 77yo Dad that has smoked since 14. (E-Cigs are safer than a flame) Order was pilfered/stolen enroute.  I even purchased their protection plan with \"ROUTE\". ECig Mafia solution is to simply refund the order, stating the product is no longer available.  After my own research I have found That particular 2200 puff amount is what is no longer available, other puffs are available yet never offered as a solution. They simply do not wish to honor a BOGO. Very Sad way of doing business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcelo Martinelli",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T22:39:04.000Z",
          "Titre": "Credit card cloned at ecigmafia",
          "Contenu": "There was a charge attempt at my card 5 days after using it at ecigmafia. Luckily I've created a single use virtual card to use at ecigmafia and the charge was declined. \"$15.00 charge at EVERCLEAN CAR WASH declined on your card because it was already in use at ECIGMAFIA. Cards can only be used at a single merchant.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Crosley",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T05:17:48.000Z",
          "Titre": "Slow slow slow processing and shipping",
          "Contenu": "Made order on the 1st, didn’t get processed till the 3rd. On the 4th said in transit in Georgia somewhere, it’s now night of the 5th still sitting in transit same place it started. Very disappointing. Y’all got your money instantly I’d expect to get product in less than 5 days. I know it’ll still be at least another 2 days, really frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dominic Murga",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T19:03:19.000Z",
          "Titre": "I have spent thousands of dollars with…",
          "Contenu": "I have spent thousands of dollars with this company and they sent me an order where every single SMOK disposable vape was leaking and lights flashing when I received it. I reached out to customer service only to be told that they won’t do anything for me because it was past 72 hours. I explained I don’t open the disposables until I am going to use them so there was no way for me to know! I will be letting over 20,000 followers on my Instagram Facebook and Twitter know not to ever use them! Terrible customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T19:34:01.000Z",
          "Titre": "JOKES",
          "Contenu": "JOKES! I ordered 2 vapes and obviously didn’t open both of them, because I use ONE at a time, so 2 weeks after my first one I’m ready to open my second one, puff on it and it makes this Werid sound, don’t think to much about it until a few extra puffs and it stays on with the light and consistency burning, it finally turned off after 5 minutes and I threw it out! Then my spouse was throwing something else away and noticed our garbage can glowing blue from the light! It was so defective it almost burnt our kitchen down! I tried to get a replacement and they told me they don’t offer warranty!!!!! JOKES DO NOT BUY FROM THEM!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Ward",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T00:09:54.000Z",
          "Titre": "Terrible Customer Service",
          "Contenu": "Customer service representative hard to understand (English is obviously not their first language) emails were answered with rude scripted answer and no attempt to resolve the issue. Everything else about the company has been excellent, great products at fair prices and fast shipping. If only they could figure out a way to be more responsive and helpful when there is an issue, this would be a 5 star rating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JAM",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T05:40:11.000Z",
          "Titre": "I decided to spend more than $200 so I…",
          "Contenu": "I decided to spend more than $200 so I could get faster shipping for free and now here I am a week later and I still don’t have my order or even know when I will get it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-06-04T18:49:54.000Z",
          "Titre": "Shady products",
          "Contenu": "The last two orders I placed both were delivered with several vapes that didn't work or leaked so bad the were empty when I received them. Customer service response was they don't guarantee disposables. Took my business else were."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nadine  Chavarria",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T17:57:58.000Z",
          "Titre": "Ordered 2 mods on clearance and neither…",
          "Contenu": "Ordered 2 mods on clearance and neither of them charged I called and called left voice mail and no one contacted me. Will never order from here again and will post to my INSTAGRAM FB AND TIK TOK PAGES letting ppl know not to buy mods or anything from you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tawnya  Mellow",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T02:47:28.000Z",
          "Titre": "I was supposed to receive my order…",
          "Contenu": "I was supposed to receive my order today, but instead I got a notice from the post office saying that it was returned to the sender because the address was not correct. It was a very important order and I am very upset. I tried to reach out to customer service. No one answered so I left a message. I got an automatic text response, saying that they’ve reached get back to me shortly and they never did, I need to speak to customer service in person and end up getting a full refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jimbo's semi-customs",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T12:59:10.000Z",
          "Titre": "Be Careful Your Information May Be Hacked",
          "Contenu": "I received an email shortly after placing my ordering claiming to be from ECigMafia saying I didn't pay for my order correctly and had committed fraud.  That they were turning in over to the police.  I knew right away it was from a hacker.  They had my email, phone, and address.I contacted ECigMafia to let them know and within 10 minutes received a reply stating they were aware of it and were working on it.  This means they knew they had a hacker and didn't let the customers know ahead of time, to me that's terrible business.Then I didn't receive the correct amount of coils I ordered and was charged for.  Since the price wasn't very much I just let it go.They should have offered some sort of incentive to those customers whose accounts were hacked.  I won't be doing business with them anymore and I was a long time buyer from their site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brittany Brand",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T07:26:13.000Z",
          "Titre": "Don't expect to get your order for 9-10 days....",
          "Contenu": "Before you order it says your order will deliver in 2-4 days. However they did not ship out my order until 11pm on Sept. 7th and I placed my order on Sept. 5th. They wrote me and said weekends and holidays don't count. So I now won't receive my order for a total of 9-10 days! Which is ridiculous!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gus Hernandez",
          "Nb_Reviews": 3,
          "Date": "2023-05-04T16:09:52.000Z",
          "Titre": "Placed order with ecigmafia requesting…",
          "Contenu": "Placed order with ecigmafia requesting order go usps, I guess they didn’t read request or didn’t care but it went ups which refuses delivery. Seems I had to explain situation via email as customer service doesn’t follow previous thread and in end they said will just refund me without any type of resolution. I’ve used company several times and never had issues and I usually buy 10+ bottles at a time but this time I guess they don’t want the business and customer service seems non existent. Good luck"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Georgie",
          "Nb_Reviews": 5,
          "Date": "2023-06-04T21:28:33.000Z",
          "Titre": "Your customer service response to me…",
          "Contenu": "Your customer service response to me does not respond to emailsI've gotten a tracking number but my package still has not been shipped nor can I get a response from the companyPlease fix this issue or I will never order from this company again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nicholas kaplan",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T15:53:34.000Z",
          "Titre": "They marketed me on BOGO for elf bars…",
          "Contenu": "They marketed me on BOGO for elf bars and did not compensate me for the order mess up. I was suppose to get 16 devices and they only sent 8. On the receipt it’s clearly listed as BOGO yet they refuse to honor what they marketed . I emailed customer service who used AI to respond and they refused to give me a name of the representative after asking 3 times . I said I would call in today via email and an individual named Chris called (obviously from India had an accent) and left a brief message . I specifically said I would call Tuesday at this point it’s obvious they do not care about customer service only profits so I do not recommend this spot. If you look at the one star reviews others have said similar things ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Mendoza",
          "Nb_Reviews": 2,
          "Date": "2023-09-10T20:57:26.000Z",
          "Titre": "Ordered 5 3mg Kings Crest Blueberry…",
          "Contenu": "Ordered 5 3mg Kings Crest Blueberry Duchess and I got which look and taste like 0mg. EcigMafia accepted my return so I ordered a new one and guess what? I got the same batch from my previous order. Will be looking for a new seller as they seem to miss quality check."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T09:24:57.000Z",
          "Titre": "There has beee a data breach scammers…",
          "Contenu": "There has beee a data breach scammers email customers pretending to be ecigmafia. The scammers know my name and addres. Ecigmafia has not been open or honest about the data breach. How did the scammers get my name and addres"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2023-07-26T20:49:46.000Z",
          "Titre": "Website not clear and horrible return policy",
          "Contenu": "Firstly their site is not very clear on all products, with not enough description. Their return policy says 30 days on their site, but the 2 times I've had to deal with customer service, they have denied a return request because the first time the agent told me they don't accept returns after 3 days, and the second agent told me they don't accept opened products in a return. Well I wouldn't have opened the second product if their website was clear in the first place and I would have ordered the correct part!! Instead of listing pods and atomizers separately, there's a selection menu on many pods and atomizers, and very little description about each one, so it's easy to get the wrong product if you're not very careful and know exactly what you need. Just a horrible experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill Bradberry",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T20:09:54.000Z",
          "Titre": "Asked for review before ever shipping…",
          "Contenu": "Asked for review before ever shipping the items"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dean Marcurella",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T00:19:47.000Z",
          "Titre": "Supposed to receive shipment today",
          "Contenu": "Supposed to receive shipment today, tracked it and its listed as leaving Fla. (why it went from Ga to Fla and now heading to SC I have NO idea). All I do know is its 6:15 pm on the delivery date and still no package. So along with the money I paid for your products I had to go spend more money on a bottle of juice to due until yours gets here (whenever that may be) Really think if you can't get it to where it needs to be on time you should find a way to compensate your customers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharon Kolupski",
          "Nb_Reviews": 3,
          "Date": "2023-01-12T20:03:18.000Z",
          "Titre": "The order I received this week is fine",
          "Contenu": "The order I received this week is fine.  However, a while ago I emailed you and called you 3 times leaving you a message regarding my last order.  An e cig I purchased was defective.  My messages were never returned.  Very disappointing!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Undead Fangirl",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T19:21:15.000Z",
          "Titre": "Huge order, ripoff, no customer service",
          "Contenu": "Placed a huge order of 15 disposable vapes, MANY of them were defective and straight up didn't work, at least 5 of them dont work at all. Customer service wasn't sympathetic at all and don't care that they just basically stole my money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex Olsen",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T22:56:45.000Z",
          "Titre": "My shipment has still NOT been…",
          "Contenu": "My shipment has still NOT been delivered, I’m upset and this is frustrating. Why would I do a review on a product I have not received yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna Mainard",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T09:12:55.000Z",
          "Titre": "No customer support for sales placed. Not even acknowledgement.",
          "Contenu": "I placed an order for two different vapes and one of them wasn’t able to be charged passed 2% so essentially that vape has never worked yet the other worked fine. I contacted the sales/customer service department via email and have yet to receive a response back to my issue..I also contacted the sigelei company warranty department and am hoping to get a reply from them if I don’t hear back from E-Cig-Mafia.It would be nice if they would at least acknowledge my email and give me some type of reassurance that they would even consider fixing my problem.Not sure if I will re-order from them if my problem isn’t rectified.Which sucks because they have good deals and cheap shipping and I’ve been ordering and referring them for years.(#146269) Order number"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kaptain krunch",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T22:42:22.000Z",
          "Titre": "lost package?",
          "Contenu": "ordered fri night, monday nothing but automated bs that something happened to my order, Tuesday no change! still waiting, youd think a real human would take the 30 seconds to fire off an email with some info! nothing!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T00:41:57.000Z",
          "Titre": "Unbelievable service",
          "Contenu": "Informed them few of the disposable ecigs are faulty and broke and leak.  Even offered to do a video call to prove I'm not lying.   They basically told me since the last 2 orders I requested refunds for broken or defective products they sell they emailed me to basically take a hike do business elsewhere.   Mind you the whole order isn't bad just a couple here there that aren't defective won't charge or work or leaked.   What can I say I'm shocked that there response was the way it was when I'm just trying to be fair in business.   But I'm guessing when they sell you products that don't work your suppose to shut the hell up lol.  I don't know I'm at a lost."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dr.doodylittle",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T23:04:26.000Z",
          "Titre": "horrible experience",
          "Contenu": "horrible experience . they never shipped my order. took them two weeks to make up an excuse saying \"it must have gotten lost or something in the mail idk\" (MIND YOU THERE IS TRACKING ON LIKE 3 DIFFERENT APPS!!!) then just casually told me not to worry they'll send it again. no incentive to make things right and give me a little store credit maybe, or at bare minimum a f*$&ng eta. it took a month for me to get two vapes. so long I ended up smoking cigarettes again cause where I am they can't sell vapes in store anymore. so yea, thanks (:"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Hock",
          "Nb_Reviews": 3,
          "Date": "2023-06-09T23:59:16.000Z",
          "Titre": "Have been ordering from Ecigmafia for…",
          "Contenu": "Have been ordering from Ecigmafia for about 2 years.  I never had a problem, until my latest order.  One of the disposables they gave me had a defect.  The charging color was still on even though it wasn't plugged in, also hissed and finally put it under water to kill it.  Forbid it exploded.  Anyway called them to notify of the incident.  They really did not care and said there is no warranty on the products they sell.  Last time I order with them.  Too bad they were priced way below others and were good."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T18:14:19.000Z",
          "Titre": "My order is showing shipped but the…",
          "Contenu": "My order is showing shipped but the carrier keeps saying they did not receive it. It has been over 3 days and this company refuses to reship the package. They just keep telling me it is on the way. If it was in fact on the way it would have been delivered today. Very frustrating experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 2,
          "Date": "2023-04-17T13:34:18.000Z",
          "Titre": "7 days and no shipment yet???",
          "Contenu": "I placed my order on 4/10/23. The funds were taken from my bank account immediately. The shipping label was created, but the order hasn't even reached the post office yet!!! It's 4/17/23. Why hasn't my order been filled yet and shipped out? This is crazy! I'm so unsatisfied with this order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry B",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T16:47:15.000Z",
          "Titre": "Fulfillment Failure",
          "Contenu": "Any savings from my purchase of 2 kits and 10 Q-pod refills evaporated when only 7 of the Q-pod refills were included. Seems to fill the order they packed 3 incompatible M1 cartridges to fill out the 10."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cliff Bibeau",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T19:51:11.000Z",
          "Titre": "I had purchased a geekvape aegis legend…",
          "Contenu": "I had purchased a geekvape aegis legend and what I thought I ordered the new version but you guys sent me a box mod that was entirely to big. It was like a brick! I had emailed you guys for a return label to return it or change the product.  They had responded with an address. Not a return label. He explained it would be my responsibility to ship it back to you.  Normally I have no issues with all of my orders. But this experience makes me want to order from the 1000 other vape ordering websites. Please help or lose a good customer!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T03:42:31.000Z",
          "Titre": "Sent Kodo Pro with no package, banged up",
          "Contenu": "I purchased a Kodo Pro and it was shipped loose in a postal envelope banging around with no packaging, no owners manual, no warranty info. This could be a used product for all I know…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ida Savage",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T04:25:54.000Z",
          "Titre": "Great company bad customer support",
          "Contenu": "I love this company. I have been a loyal member, but I did have one hiccup and I do not agree with it. I got a vape for my husband when it was all said, and done before any and after all coupons and codes I spent on that particular item $44 or something along them lines. I also bought two bottles of juice And the protection plan I used a promo code so I had 20% off I do believe after shipping I’m a sales mana. So they credited money back to my account and it was not even enough money. If I wanted to turn around and buy the same viper from that website, the exact same date I wouldn’t had enough money to do that. I’m not sure what went wrong, but that’s why I left at review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kim Luera",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T20:46:45.000Z",
          "Titre": "I ordered a buy one get one free mint…",
          "Contenu": "I ordered a buy one get one free mint pod and only received one. I contacted support and was told there's nothing I can be helped with even though I supplied a screenshot of the order placed. I'm better off visiting my local vape store!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trenton Harder",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T04:15:14.000Z",
          "Titre": "We ordered a voopoo thru that is semi…",
          "Contenu": "We ordered a voopoo thru that is semi defective. Randomly stops hitting and then continues firing after done hitting, ruining pod"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T23:17:51.000Z",
          "Titre": "Slow shipping, lost package, and poor support.",
          "Contenu": "Placed a order. Ecigmafia said they shipped my +$100 order. I waited a few days and noticed that USPS said they never received it. Went back and forth over email with support for a week. They made me wait 8 days before they would reship anything. Finally they shipped it and I got it 16 days later. Never received any compensation or discount for the waste of my time or for the rude and slow support. Will never purchase here again. Order #164414\"In this case, we usually wait for 8 days from the day of shipping and in between if no movement shows in tracking then we issue a refund or we can resend the package\"If you don't want to wait 16 days or even potentially more don't order here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greggory Gibbs",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T07:46:32.000Z",
          "Titre": "Get what you pay for",
          "Contenu": "Bought the POD 5500, Tried 7 flavors! Didn’t like most of the flavors and so far 1 didn’t work. Get what you pay for. Won’t buy this brand again. Still love the company. Delivery was fast and two days early. 1 star for the product review though."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pistol Pete",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T03:23:32.000Z",
          "Titre": "Have an issue each time I order",
          "Contenu": "Have an issue each time I order. Received my order with buy ones only. Y’all forgot the get one frees.Very disappointing. Got ripped off"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Titan",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T01:01:52.000Z",
          "Titre": "Canceled order",
          "Contenu": "Canceled my order just because my billing and shipping address was different just moved to different area and I'm charged a fee if I need to make changes to my card before the expiration date. Take your business to TBD liquids, didn't have any problems with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Krystal G",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T00:48:34.000Z",
          "Titre": "I gave one star only because i spent…",
          "Contenu": "I gave one star only because i spent kets just say $30 for 2 disposables and one was trash ...it was burnt up when i got it or thats what it rasted like anyways ...was horribleneither u or i could smoke it even if it were the last bit of nicotene on earth...and thats bad....i let them know and all they could tell me was sorry they couldnt help me ....like really are u kiddn me ...some way of showing apprection to your customers.I couldnt believe it i just knew forsure they would have replace the one but nah not even an i apologize nit nothing but we cant help you there nit under warrenty ....smh....customer satisfaction goes a long lomg ways and id have been more then happy with a replacement disposable ...Or actually any disposable for that matter at least ut would have let me/showed me that you all cared and appreciated the customers.But Faild BigTime...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tara Rowe",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T23:44:47.000Z",
          "Titre": "I purchased the BOGO dragbar disposable…",
          "Contenu": "I purchased the BOGO dragbar disposable vapes. Only 2 of them work. One you can't smoke at all due to no flavor or airflow the other one is dead. No lights come on at all, even when charging it. I have purchased many of this brand over the months and I'm very disappointed that this order was a flop."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Billie Breniak",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T22:40:40.000Z",
          "Titre": "Not happy",
          "Contenu": "Delivery time was great but I only received 3 boxes , was supposed to be 4 boxes & all 3 boxes are opened. Not a satisfied customer"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tammy Hannon",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T20:46:37.000Z",
          "Titre": "Horrible customer service.",
          "Contenu": "I ordered 3 packs of pods for my NOVO 2X. I ordered them in 0.9 MTL. When I got them, I did see my mistake but the item sent was not even what I originally ordered. I tried to inform them of the mistake on my side and their side and figure out a solution. I feel like I was being given the run around and then my request was cancelled with no solution. I won't order from them again. Like I said, it was partially my fault, but they were at fault too. Now I am stuck with 9 pods that only last 1 day in my device."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "leo place",
          "Nb_Reviews": 2,
          "Date": "2023-01-22T02:09:59.000Z",
          "Titre": "I ordered stuff on the Jan.5th and I …",
          "Contenu": "I ordered stuff on the Jan.5th and I  haven’t received it yet it has been almost two and a half’weeks I have been along time customer and it has never been this late before and a really need"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jen DeS",
          "Nb_Reviews": 7,
          "Date": "2023-04-18T18:53:44.000Z",
          "Titre": "Never received package",
          "Contenu": "My package states it was delivered but I do not have the package. I am working with Customer Service to see if they can help me with this problem. I can’t give a good rating because I never received anything."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Ramsey",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T00:31:32.000Z",
          "Titre": "I purchased the buy one get one free…",
          "Contenu": "I purchased the buy one get one free and I did not receive the free one called and customer service and they would not mail out the free merchandise I spent over 100.00 was owed five vapes"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T21:49:21.000Z",
          "Titre": "Shipping took way too long…",
          "Contenu": "The 1st 2 i ordered were both junk..liquid coming out of the bottom..on BOTH..so i decided to give you one more try..if my package comes tomorrow it will be 8 days since i placed my order..if these new ones are broke..ill never do business with E cig Mafia again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James  Davis",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T23:01:58.000Z",
          "Titre": "Your header says buy one get one",
          "Contenu": "Your header says buy one get one,  haven't gotten my free ones as yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Lee",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T02:27:23.000Z",
          "Titre": "one of the juice bottle cracked up…",
          "Contenu": "one of the juice bottle cracked up during delivery. Entire package was soaked."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tiara Kaufman",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T23:18:54.000Z",
          "Titre": "Well",
          "Contenu": "Well, for starters, you guys delayed by package because the bank and everything and I still haven’t received it and I spent three days"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 4,
          "Date": "2023-11-16T13:17:42.000Z",
          "Titre": "Shipping time...it takes so long to get…",
          "Contenu": "Shipping time...it takes so long to get my order.  It used to be lightening fast....now a week or more."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T21:50:35.000Z",
          "Titre": "Shipping fiasco",
          "Contenu": "I don't know what kind of shipping method you guys use. I ordered in California in the past and it is faster to get here than you guys. You are only 1 state away but the package goes to a farther state then gets near then go to another farther state. I should of receive my order in 2 days and not over a week."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jared Tingler",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T00:38:19.000Z",
          "Titre": "Frustration every single of my last 3…",
          "Contenu": "Frustration every single of my last 3 orders always are menthol. It says NO WHERE in description they are menthol! Very frustrated!!! I order several at a time also and every single one is a menthol variant."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sue Spang",
          "Nb_Reviews": 7,
          "Date": "2023-09-21T20:25:25.000Z",
          "Titre": "Have not received my purchase.  Unable to track it.  Getting message \"shipping exception\" with no explanation.",
          "Contenu": "Have not received or an unable to track order.  Getting message. \"shipping exception\" with no explanation.   Received my order and someone else's order!  Spoke to a very helpful representative who gave me specific information & instructions how to return the extra order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gabriel True",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T17:02:33.000Z",
          "Titre": "Tiny return window. Unhelpful.",
          "Contenu": "If you order the Smok novo al6000 root beer flavor a majority of them will be completely empty on arrival. BOGO seems like a good deal but it’s more like buy 5 get one. And they weren’t helpful at all about returning them as it wasn’t in the first 72 hours.Test ALL your vapes that you get from these people as they have a very tiny and impossible return window. I might try one more time, but I feel like I might as well just pay regular smoke shop prices in real life if this happens again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Artem Palaguta",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:19:13.000Z",
          "Titre": "Never replied to my email / delayed shipping",
          "Contenu": "Never replied to my email about my reward points. I accidentally clicked on redeem my points and never used the code. Email the customer support about that but nobody elver responded. Shipping takes longer than it stated. For my last order had to wait for 6 business days. Was expecting it to be faster when spending over $100 on the order"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kindra Thornhill",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T02:24:45.000Z",
          "Titre": "I have ordered several times and have…",
          "Contenu": "I have ordered several times and have been happy with my previous orders, but I had several of the Innobar vapes not work properly. One would not draw properly or charge another one would not stop running after I would inhale. I contacted customer service right away with my complaint and they wanted a video of the vapes. How do you make a video of something not working? I think that it just the brand of Innobar not worth buying. I have ordered other brands with no problem. I just wish they had them been more proactive of trying to rectify the problem. They have not contacted me since I sent the video.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Monette  Clair",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T21:09:04.000Z",
          "Titre": "I still haven't gotten my order it's…",
          "Contenu": "I still haven't gotten my order it's almost been a week and it's still in Florida I order these alot and never have waited this long"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Core",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T21:21:07.000Z",
          "Titre": "Terrible terrible SMH P.O. And EcigMafia",
          "Contenu": "Now. A two star.  Only reason I gave “3” n now 2 is bc price n stock abundance.  Knocked 3 starts off now bc of order executions are terrible.  And shipping is just as bad.  PO can’t send packages to the right place.  How hard is it?!  Seriously.  Ppl are soo ignorant and dumb smh"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Core",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T23:16:39.000Z",
          "Titre": "Every other time I order something it…",
          "Contenu": "Every other time I order something it gets cancelled.  It’s already terrible you have to wait a week to get your stuff.  Might as well just go to the local vape shop.  I’m alright with waiting for the shipping.  But when my orders keep getting cancelled it’s sooooooooooo inconvenient.  Prices are right but not order executions.  Ridiculous reasons."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Martin Doerr",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T01:04:54.000Z",
          "Titre": "Unable to receive an order as a gift, paid by someone else",
          "Contenu": "I was unable to be gifted this by someone. I was told to have diff billing than shipping address i would have to use a company called sezzle? I or the person who wanted to gift me should not have to FINANCE the charge to do so, b/c that is what sezzle is. My uncle purchases this for me monthly, on other ecig websites with no issue. Very upsetting, especially around the holiday's."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "M D",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T19:27:08.000Z",
          "Titre": "The vape I was sent leaks like crazy, good juice though",
          "Contenu": "The vape I was sent leaks like crazy, to the point where I basically need to have a damp paper towel next to me at all times so I can clean up any spillage that comes from the button, the air flow dial, and the air vents. On several occasions the vape has been sitting on the table, standing upright, away from anything and it will randomly turn on. I'm talking it's running as if I'm vaping from it. The first time I was able to get it to stop the last 4 times it's happened I just had to let it time out because the button interference wasn't working as an option anymore."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Krystal P",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T22:37:42.000Z",
          "Titre": "First off your asking me to review…",
          "Contenu": "First off your asking me to review something I haven't received yet. Literally just got the tracking number yesterday. So can't give an answer on that. Second thing is you all stopped carrying the brands that I love had try something different. We'll see how they are and if I continue to purchase from ecigmafia."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BStew",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T15:17:44.000Z",
          "Titre": "Shipping?",
          "Contenu": "This is my first time ordering from E-Cig Mafia. I received a shipping notice on the afternoon of 10/27. It is now 10/30 and the tracking number is showing USPS is still waiting to receive the package for shipment. Will update this review if my order ever arrives."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 3,
          "Date": "2023-10-20T22:26:48.000Z",
          "Titre": "What went wrong with my order",
          "Contenu": "What went wrong, I have now opened yet another package of Pod Juice Salts and the security portion was not intact. This is the second juice that has been opened prior to delivery, this in addition to a set of LP1 coils that the package was opened and although all in the box, they were still opened.  What is going on?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kathy Kirkland",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T05:20:18.000Z",
          "Titre": "Arrived much quicker than expected, BUT...",
          "Contenu": "I actually was impressed on how quickly they arrived. I sent a couple of emails to maybe get something done but one vape went I went to pull out of the bag it was in the rubber piece on bottom pulled off the pen and juice was leaking out the bottom. I put it back in the bag and it wasn't until later that I opened the other one took 1 hit and it wouldn't stop firing. It fired until it completely ran out I assume. Was scared it would blow up as hot as it got so I set it outdoors just in case. About an hr or so later it was dead. I'm an understanding person so I know things happen and as cheap as they were I can't really expect them to handle very much. Little disappointed because I may have to go to a town and pay 2-3 times as much as my whole order because neither will work. I am anxious to see how this is going to be handled because I always like to give 5stars if the overall experience turns out good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bea Sams",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T02:31:31.000Z",
          "Titre": "Poor Customer Service Reaponce",
          "Contenu": "The first time I had something go wrong, they sent me the wrong item from what I had ordered. I sent them pics of what I had received and still did not get a response of how to get my money back, the second time something went wrong was on a Tyson vape I ordered, when I hit it it wont shut off afterwards, it just keeps coming out, and the third time, I ordered a propod gt and it lasted a cpl of weeks and now it turns on but it won’t hit at all. I feel no need in complaining bc like the first time I won’t get my money back so I’m writing a review so others know"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elisha White",
          "Nb_Reviews": 3,
          "Date": "2023-09-28T03:45:39.000Z",
          "Titre": "The vapes I received weren't anything…",
          "Contenu": "The vapes I received weren't anything like I expected they tasted like air hardly any flavor so I asked for a refund but I didn't get one. If I would have known buying the extra protection wouldn't be useful I never would have paid for it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marcheta Voll",
          "Nb_Reviews": 6,
          "Date": "2023-10-16T00:31:39.000Z",
          "Titre": "This time! THIS TIME! JERKS!",
          "Contenu": "This time?THIS TIME!!! I'LL tell you!!!I bought buy one get one free mind you,you'd think they'd both work but,no,No they both didn't! Only one works correctly. I submitted for a replacement and got rejected and I just bought these damned things! The only thing I wanted was a replacement that works correctly and I was rejected that's a crock of BS! I'LL STOP MAKING PURCHASES WITH YOUR COMPANY and I'LL BE TELLING MY FAMILY and FRIENDS ABOUT HOW I WAS REJECTED DURING MY TIME WHILE GOING THROUGH MY MOM'S DEATH and MY GRIEVING! WHAT A crock and I'LL NEVER WANT ANYTHING FROM YOU AGAIN AFTER THIS!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 4,
          "Date": "2023-07-19T19:56:15.000Z",
          "Titre": "This time/ every time",
          "Contenu": "This time? No. I have bought lots and lots of ecig stuff from this store but it seems that the people that fulfill and ship online orders take their sweet time fulfilling then shipping out. I totally understand that if I place an order on Saturday it probably wont be shipped untill Monday.But when I consistently see on the tracking information that the order I made still hasn't shipped on Tuesday."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lisa Lacy",
          "Nb_Reviews": 2,
          "Date": "2023-01-15T18:58:14.000Z",
          "Titre": "Defective product",
          "Contenu": "I love the product. I have ordered alot of vapes and the last order there was a problem with the whole box. When I sent an email about it they said I have to let them know within so many hours. I had ordered 30 or 40 vapes and there was no way to go through all of them in a few hours to see if they were defective. So I was just out of a box of 10 vapes. They need a more realistic defective return policy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melinda Jones",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T00:55:45.000Z",
          "Titre": "I’ve had excellent transactions…",
          "Contenu": "I’ve had excellent transactions previous to this one, but this order 2 of the disposable vapes crashed on the first puff and drained all the juice while the battery flashed until it died. I have sent a message and I’m just waiting for a response it’s been less than a day and on a Saturday so I’m not worried too much. I just hope to get them replaced.    On a previous order I had to contact the company to clarify something with my order and the customer service was very fast. I do really love ECIGMAFIA but everything can’t always be perfect the company can’t help that. I do highly recommend them for any and all vape related products they have the best prices and lots of selection. ✅"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Hart",
          "Nb_Reviews": 2,
          "Date": "2023-01-05T14:17:17.000Z",
          "Titre": "Considering I have not received any…",
          "Contenu": "Considering I have not received any shipment updates whatsoever and order to shows awaiting fulfillment, 2 star is being generous and about to cancel my order and go elsewhere.  Order was placed Jan 2nd.  This is now the 3rd business day and item have not been shipped and received no communication."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T16:58:05.000Z",
          "Titre": "Orders after 4pm Friday are not…",
          "Contenu": "Orders after 4pm Friday are not processed until Monday Flat rate shipping 8.99 and the delivery is expected Friday.  Yet emails are answered?    There is really no savings (bogo)or convenience (time saving) when all considered the local smoke shop adds up to the same .     Now to wait for the items to arrive and hope for a quality product"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T03:43:58.000Z",
          "Titre": "Either Funky Republic or the store are garbage",
          "Contenu": "half the devices would not work from arrival - battery was dead and would not charge the other half were good, but the coil would keep burning after you've inhaled for extended periods of time, not detecting the abscense of suctionI am not satisfied with my purchase is putting it mildly"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RC",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T01:38:45.000Z",
          "Titre": "I purchased Vaporesso Zero 2 Limited…",
          "Contenu": "I purchased Vaporesso Zero 2 Limited Bundle Kit (Buy 1 Get 2 Kits). Unfortunately one of Zero 2 pod is defective. Contacted the customer support, instead of sending me a replacement, I got a 1/2 refund. I had to make a new order instead of getting a replacement, which means I had to pay for a new shipment fee."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T20:57:43.000Z",
          "Titre": "didn't get what I ordered",
          "Contenu": "I ordered 1 box of black evod clearimizers and 1 box of silver and you only shipped me the black ones, without any explanation. Thankfully you only charged me for one but I would have liked to know why and if I could have gotten 2 boxes of the black if the silver were sold out. I think you should let people know when you are going to change their order and give them options. Other than that is was fine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ashish Pannu",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T00:07:20.000Z",
          "Titre": "1 or 2 items in every shipments have…",
          "Contenu": "1 or 2 items in every shipments have either fluid leaking problem or fluid doesn't even last half the expected time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric Hayes",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T20:30:13.000Z",
          "Titre": "I waited for my new vape for quite a…",
          "Contenu": "I waited for my new vape for quite a while, when it got it here it was defective... I now have to ship it back and wait longer.  I've also bought a few bottles of ejuice, my favorite flavor and it's different from the stuff I use to buy from the shop.  It's a dark amber color which it's always clear, it's harsh to hit no matter if I have a new coil wattage settings or charged battery... I was told I can't get a refund on the bottle I opened even though I just use one tank full that I dumped because it wasn't normal for that brand and flavor.  Frustrating because now I'm leery to buy anything else from this site and I was just offered credit ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "joe Adcock",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T21:15:19.000Z",
          "Titre": "I've not received my order yet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Teresa Saunders",
          "Nb_Reviews": 3,
          "Date": "2023-03-06T06:49:31.000Z",
          "Titre": "I have not yet received the order",
          "Contenu": "I have not yet received the order, but I did order some coils before this order and I'm not impressed, they burned out three days of using them, but so far the juice is awesome. I did order a new juice (key lime cookie) and waiting for it now but super excited to try it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "El Jallah",
          "Nb_Reviews": 4,
          "Date": "2023-08-06T04:29:09.000Z",
          "Titre": "I got a BOGO on two Vapes they both…",
          "Contenu": "I got a BOGO on two Vapes they both were horrible gave me headaches and lasted all but two days apiece and now I can't get any more promos because I took this first promo now I understand why that was why I wouldn't get one free"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christine Lopresti",
          "Nb_Reviews": 2,
          "Date": "2023-06-11T18:46:12.000Z",
          "Titre": "I received items again that don't work…",
          "Contenu": "I received items again that don't work or seals are broken and some completely out of the box. Returned items with broken seals and not in a sealed package shouldn't be given to other people. I shouldn't have to pay return shipping on defective or opened products. This has happened in my last 2-3 orders. This isn't right. We're paying for products that work and are new. Your customer service needs to change."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JORDAN YANG",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T22:07:24.000Z",
          "Titre": "Requested for a box but received a bag.",
          "Contenu": "I requested for a box when done picking orders. I didn’t want my items to be in a bag due to purchasing a pod. The plastic to insert to my pod broke and now I have to buy another one. Bags are just being thrown when in transit. Please do a better job."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Driver",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T14:40:59.000Z",
          "Titre": "I ordered a mini USB charger for my new…",
          "Contenu": "I ordered a mini USB charger for my new vape pens.  Instead I received a 10 pack of chargers, none of which were Mini USB chargers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dave Bishop",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T23:54:58.000Z",
          "Titre": "The delivery was fine, BUT",
          "Contenu": "The delivery was fine, but 2 of the 5 coils I bought were bad fresh out of the package.  What sort of credit am I going to be given for the 2 bad coils and the juice I had to pour out so the tank would be empty per the instructions when I put the coil in."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kyle Douglas",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T09:32:49.000Z",
          "Titre": "I don't understand why my packagegoes from Atlanta to Florida…",
          "Contenu": "My package goes from Atlanta to Florida and then all the way up back to Indiana it takes 7 days to get a shipment and other than that it's not bad."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jesus Valdez",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:57:46.000Z",
          "Titre": "Battery arrived fine",
          "Contenu": "Battery arrived fine, pod was broken. I was lucky a friend had an extra but the product shouldn’t have an arrived this way."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kimberly Reigenborn",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T23:22:53.000Z",
          "Titre": "No BOGO",
          "Contenu": "This is my second time ordering form ECigMafia. Both times I purchased BOGO items but did not receive two items. Please do not advertise BOGO and not follow through on the offer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "T.MCFarlin",
          "Nb_Reviews": 4,
          "Date": "2023-02-23T07:05:09.000Z",
          "Titre": "I still haven’t received my actual…",
          "Contenu": "I still haven’t received my actual order. I was sent a bunch of items that I didn’t order. I had to get a return label to send back the items that were not purchased by me. I had a difficult time finding a place that would print the label . I’m still waiting for my merchandise"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James  Davis",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T23:52:35.000Z",
          "Titre": "You did not send my 5 free bottles of…",
          "Contenu": "You did not send my 5 free bottles of vape juice your header says buy 1 get 1 free I bought 5 I should have gotten 5 free"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "keescha hauge",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T23:44:11.000Z",
          "Titre": "I ordered 5 days ago",
          "Contenu": "I ordered 5 days ago. Says it shipped but no ETA. For how much shipping is, it should be faster."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ida Ablia",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T02:26:29.000Z",
          "Titre": "the routing system is  ridiculous",
          "Contenu": "the routing system. left Mobile Alabama went right pass me to Tallahassee, then went all the way down to Miami now has to make its way back up to me. A lot of wasted time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maria Depner",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T22:23:25.000Z",
          "Titre": "The package is taking too long to…",
          "Contenu": "The package is taking too long to arrive. Options for expedited shipping should be offered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Harn",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T18:30:01.000Z",
          "Titre": "Had a couple that didn't work",
          "Contenu": "Had a couple that didn't work. 1 of them was 6000 puffs non rechargeable got about 25 puffs and empty. Other 1 kept hitting after I would take a hit. I order a lot this is 1st time I have been disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica Britton",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T22:41:08.000Z",
          "Titre": "I messaged about products I got that…",
          "Contenu": "I messaged about products I got that burnt second day of having it and I never heard back from anyone"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "theo levee",
          "Nb_Reviews": 2,
          "Date": "2023-06-18T23:46:35.000Z",
          "Titre": "Two \"lighter\" vaps arrived dead",
          "Contenu": "Two \"lighter\" vaps arrived dead - I asked to return - they asked for pic - I sent pic - they asked for video I sent video - they wanted video of them not working????? I am not sending my face on video to them so they cancled my refund even when i offered to mail return at my expense  - the response and quality of interaction left me dissapointed after the \"world class customer service         '           - btw the duo flavor is a complete bust - no way near the life advertised"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shelby Cahill",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T21:43:19.000Z",
          "Titre": "Usually I would rate this 5 stars never…",
          "Contenu": "Usually I would rate this 5 stars never had a problem. This time I only received 2 of the 3 vapes ordered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roshelle",
          "Nb_Reviews": 3,
          "Date": "2023-04-27T18:00:41.000Z",
          "Titre": "😮‍💨",
          "Contenu": "I've ordered 100 vapes or more and was perfect everytime. This time I ordered 7 horizon tech 10,000 hiter vanilla ice cream. All but 1 had a salad taste nothing like it usually is. This one is my favorite and order every month.  I reached out to support and they said since it was after 72hrs they couldn't do anything about it. I thought who in the hell goes thru 7 vapes in 72 hrs.? So make sure u check every one of them when they come in the mail. . So this doesnt happened to u."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles Hawkins",
          "Nb_Reviews": 2,
          "Date": "2023-03-06T17:44:00.000Z",
          "Titre": "Seems like took a few days to get it…",
          "Contenu": "Seems like took a few days to get it out which isn't too bad got here very quick. I give their company five stars. The product is crap. I buy these for veterans and guys down on their luck. And they are the nastiest tasting Vapes I've ever bought. But I can't afford to buy the expensive ones all the time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dana Case",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T22:39:55.000Z",
          "Titre": "My order has been stuck in ready to…",
          "Contenu": "My order has been stuck in ready to ship for a week"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hassan Brister",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:31:33.000Z",
          "Titre": "good prices but bad shipping"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Monette  Clair",
          "Nb_Reviews": 4,
          "Date": "2023-05-19T16:23:49.000Z",
          "Titre": "I was under the impression I would get…",
          "Contenu": "I was under the impression I would get my ecigs in two or three days but it's been five days and they have only just made a shipping label so not sure when I will even get them if I would have known it would take so long I would have bought them somewhere else"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robin Vandevander",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T23:45:43.000Z",
          "Titre": "One of my vapes lasted five puffs",
          "Contenu": "One of the babes only lasted about five puffs maybe eight. I tried to charge it and it won't charge. The flight just flashes blue. I'm not sure if the other one's going to last much longe"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer Stahl",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T03:28:13.000Z",
          "Titre": "Order was missing items and customer…",
          "Contenu": "Order was missing items and customer service was terrible. Was told the best they could do was give me a refund rather then shipping a replacement."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Bales",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T15:32:36.000Z",
          "Titre": "The shipment shipped to Florida …",
          "Contenu": "The shipment shipped to Florida from Atlanta and is now back in Atlanta when it should be arriving today to me in Tennessee"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T02:20:02.000Z",
          "Titre": "Ordered ten vapes",
          "Contenu": "Ordered ten vapes, two leak, first time buying that brand. One is dead, ordered that bee and before. Never any problems before."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Catherine Ann Krueger",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T19:22:24.000Z",
          "Titre": "The shipping isn't great",
          "Contenu": "The shipping isn't great. My first order got lost"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kristie Marklin",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T04:00:24.000Z",
          "Titre": "Well",
          "Contenu": "Well, I found a vape that I liked. You discontinued it. I ordered 2 that I thought was comparable. They did not work. I had to throw them in the trash. I have ordered 2 more of something that I may like. In the mean time, I have found a company that has the one that I want. See ya!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elizabeth Shaw",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T17:51:59.000Z",
          "Titre": "Five of the disposables didn't work",
          "Contenu": "Five of the disposables didn't work. None of the glamee lighters have power and won't charge, one of them had also leaked. One vapperk also dead and won't charge. The boxes were smashed, torn and open."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jonny",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T11:05:23.000Z",
          "Titre": "No Return for DOA",
          "Contenu": "Bought Disposables and 1 was DOA. Tried Return/Exchange and was Denied. Part of a large order,I thought that was crummy. Shipping is fast, which is cool."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cathey Lenz",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T16:55:14.000Z",
          "Titre": "My last order was received timely…",
          "Contenu": "My last order was received timely however one of them ceasedCompletely leaked out and I saw nowhere to contact you to send it back"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Johnny Henson",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T04:50:49.000Z",
          "Titre": "Shipping is slow",
          "Contenu": "Ordered the 12th shipping label was created but items have yet to be shipped out"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donna D",
          "Nb_Reviews": 3,
          "Date": "2023-07-20T00:12:59.000Z",
          "Titre": "Very disappointed in the length of time…",
          "Contenu": "Very disappointed in the length of time it took them to ship my package"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "james buchanan",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T06:15:33.000Z",
          "Titre": "Ordered the BOGO quantity 10 only…",
          "Contenu": "Ordered the BOGO quantity 10 only received 10"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laurine       Guzzi",
          "Nb_Reviews": 4,
          "Date": "2023-05-04T16:21:03.000Z",
          "Titre": "This is the third time I got a leaky…",
          "Contenu": "This is the third time I got a leaky vape pan. Can't use it. Never reported the last one and now I got another"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacqueline Vaughan",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T22:47:56.000Z",
          "Titre": "My e cigs either leaked didn’t work…",
          "Contenu": "My e cigs either leaked didn’t work after the second day or they kept buzzing like I was pushing the button"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "M.H.",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T20:47:11.000Z",
          "Titre": "Half of the ZooVoo Dragbars that I’ve…",
          "Contenu": "Half of the ZooVoo Dragbars that I’ve ordered do not work. They will not charge, and they have no output."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy Runyon",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T17:18:35.000Z",
          "Titre": "I ordered five Jubi Bars",
          "Contenu": "I ordered five Jubi Bars.  Three arrived broken.  It's highly unlikely that I will ever use the service again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T03:33:22.000Z",
          "Titre": "The order is delayed and I’m running…",
          "Contenu": "The order is delayed and I’m running out! The last batch of tanks are only lasting a day :-("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremy Swoverland",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T00:52:12.000Z",
          "Titre": "Bogo sale never received any get ones.",
          "Contenu": "Bogo sale never received any get ones.. contacting customer service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Oliver Lynn",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T10:24:22.000Z",
          "Titre": "VERY SLOW DELIVERY"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James  Nolte",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T21:30:53.000Z",
          "Titre": "Good price, BUT!!!!",
          "Contenu": "Prices were fair enough, however they did not last as long as the ones I buy locally."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David  Layman",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T12:36:35.000Z",
          "Titre": "Shipping cost to much and it took 6…",
          "Contenu": "Shipping cost to much and it took 6 days to get here."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Priscilla Macias",
          "Nb_Reviews": 3,
          "Date": "2022-12-21T07:00:38.000Z",
          "Titre": "One of the vapes didn’t work nothing…",
          "Contenu": "One of the vapes didn’t work nothing comes out and i already charged it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Megan Hacker",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T13:15:29.000Z",
          "Titre": "You never sent my order!",
          "Contenu": "You never sent my order!! Had to give me a partial refund like dang"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tyler B.",
          "Nb_Reviews": 3,
          "Date": "2022-12-11T23:27:50.000Z",
          "Titre": "I haven't received my last package and…",
          "Contenu": "I haven't received my last package and I'm getting irritated!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cathy Starvish",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T23:12:56.000Z",
          "Titre": "I do not have the packing slips",
          "Contenu": "I do not have the packing slips. I bought some BOGO. Price looks a little high"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fy",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T15:54:44.000Z",
          "Titre": "Slow shipping"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "tanya hendrix",
          "Nb_Reviews": 1,
          "Date": "2022-06-30T18:34:31.000Z",
          "Titre": "I ordered my regular brands from this…",
          "Contenu": "I ordered my regular brands from this site and they all tase wrong. I don't know if they all expired or if they are filling them with their own juice. NONE tasted right!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Changsuk Choi",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T03:23:52.000Z",
          "Titre": "One of the vapes came damaged",
          "Contenu": "One of the vapes came damaged. Can't use it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rachel Pan",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T16:39:17.000Z",
          "Titre": "2 Stars because there were only 2 working Clearomizers",
          "Contenu": "I plugged in all 5 Clearomizers and only 2 of them worked (defined by the coils heating up and burning the vape juice). The other three were completely inert and did not heat up at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2020-09-07T18:26:54.000Z",
          "Titre": "They had some good deals, but",
          "Contenu": "They had some good deals, but I didn't buy from them because shipping was more than $16 for a $60 order. That's more than I've ever seen for any other vape shop. A waste of my time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lynn",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T03:25:01.000Z",
          "Titre": "I ordered 2 vapes called Vapetasia",
          "Contenu": "I ordered 2 vapes called Vapetasia.Shipping was almost as much as the vape. Came quickly i must admit. They were bogo and when I received them the flavor was horrible. Was described as a fruit flavor but more like medicine. Will attempt to order again definitely a brand I've had before. Will re review when I get them. Don't try the energy vapetasia unless u like robutussin flavor."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin Price",
          "Nb_Reviews": 2,
          "Date": "2023-02-05T18:10:21.000Z",
          "Titre": "First 2 I opened had no flavor and…",
          "Contenu": "First 2 I opened had no flavor and tasted burnt, 2 other are iffy. The smok works great however."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Gerrits",
          "Nb_Reviews": 7,
          "Date": "2023-02-04T23:11:15.000Z",
          "Titre": "still has not shipped says label…",
          "Contenu": "still has not shipped says label created 1st 2 orders I received in like 3 days its been 6 days and just lable created."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sean Norton",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T00:58:37.000Z",
          "Titre": "I’m only giving this order two stars…",
          "Contenu": "I’m only giving this order two stars because one of my smok nouvou lemonade chill don’t work at all and when it’s plugged in to charge it starts vaping uncomfortable amounts of vapor. Kinda scary. I’ve tried to reach out but no answer yet. I’m hoping for a reply soon"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LB",
          "Nb_Reviews": 2,
          "Date": "2020-08-03T06:43:24.000Z",
          "Titre": "Ghosting me after purchase",
          "Contenu": "Had great communication before purchase. But when order came in with a damaged product, that is when they started ghosting me and ignoring all my messages."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kristi Mitchell",
          "Nb_Reviews": 1,
          "Date": "2021-01-06T23:07:44.000Z",
          "Titre": "Prompt Delivery but Customer Service is a No for me",
          "Contenu": "Products were delivered promptly, but I had issues with one order. The glass was broken, so I requested a return or exchange. The return was canceled on their end, and I was not given any notice or feedback as to why. I would not have known it was canceled had I not logged in to check the status. So I initiated another return (within a week or 2 of receiving the order), and that refund status stayed open. Fast forward to today (months after last order) when I placed another order, I left a note saying I never received an update for that return and asked them to check on the return. I checked the status and it says canceled- granted this refund was requested months ago. The very least customer service could do was send an email telling me why they could not refund it- because they have communicated nothing to me regarding the refund or exchange I requested. So the customer service blows. It was only $13 but still..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mr. Jon Doe",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T04:22:46.000Z",
          "Titre": "Complete garbage…",
          "Contenu": "Over half of the disposable vapes I purchased have leaking inside the original packaging. What a waste of money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andres  Logrono",
          "Nb_Reviews": 4,
          "Date": "2022-05-29T18:32:03.000Z",
          "Titre": "Poor customer service paid for shipping…",
          "Contenu": "Poor customer service paid for shipping and after 12 days still don’t have my items"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "christina Quatrone",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T20:13:19.000Z",
          "Titre": "4 of my air stick were leaking"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Byron Tyler",
          "Nb_Reviews": 3,
          "Date": "2020-08-25T12:14:43.000Z",
          "Titre": "Very Slow Shipping",
          "Contenu": "They have the slowest shipping in the U.S.  You can get items faster from China."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Henry Young",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T03:58:46.000Z",
          "Titre": "You good",
          "Contenu": "They're very good"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa Rank",
          "Nb_Reviews": 2,
          "Date": "2022-12-11T19:34:24.000Z",
          "Titre": "Horrible shipping time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph Glenn",
          "Nb_Reviews": 1,
          "Date": "2020-02-25T12:47:12.000Z",
          "Titre": "I thought ecigmafia was a great store…",
          "Contenu": "I thought ecigmafia was a great store but they sent me the wrong stuff. They also didn't give me my discount at checkout after I paid. I called them on it and all they did was give me a store credit meaning I had to buy even more stuff. So, finally I do and they send me not 1 but 4 packages of the wrong coils. I sent them photos and the receipt immediately when I got the order. I called after two business days of hearing nothing. They apologized and said they wanted to make things right. They knew of the mistake on my black Friday order which was a large order. They made several promises then as well. It took till the New Year to come in before even a quarter of that was set right. My brother and some other friends had ordered from them for several years and my brother called and talked to someone about everything and sent him pictures from black Friday and this last order as well. We have voicemail and countless emails about all of the mistakes. He said he was going to send the correct Freemax Mesh Coils. Great here we go again.  We were supposed to receive what we ordered 4 three coil packages of Freemax Double Mesh Coils 0.2ohm.. Instead we got three packages of0. 15 quad coils. None of us use that kind of wattage. Bottom line we were out well over $100.00 from black Friday and now instead of getting our 4 packages of 3 coils we got three of the wrong style and ohms and one completely empty. To make up for the Black Friday nightmare we were promised either 2 VooPoo Drag 2 Mod starter kits or two Vaporesso Gen Mod Devices. We haven't gotten our correct coils and since Black Friday No VooPoo Drag 2 kits both Ink or the Vaporesso Gen Mod Devices in Gold, black or silver. Not Kool, not professional and lied to over and over again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Whitney Bolles",
          "Nb_Reviews": 2,
          "Date": "2020-12-12T18:34:31.000Z",
          "Titre": "No order tracking number",
          "Contenu": "No order tracking number, way sketchy!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter Ski",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T19:42:17.000Z",
          "Titre": "Shipping times are bad",
          "Contenu": "Shipping times are bad, ordered something on Monday got notification that it shipped on Wed.  When i check the tracking on Wed all it shows is that a label has been created not shipped.  Basically it takes almost a week just to ship.  Not good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristi Bowling",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:50:04.000Z",
          "Titre": "Arrived fast,but upon opening and using…",
          "Contenu": "Arrived fast,but upon opening and using they continue to burn even after completing the pull. I have used this product and none of my others that have been purchased through other companies makes a hissing sound after completing your pull."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Annette  Hyder",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T22:35:16.000Z",
          "Titre": "Too much out of stock... ALWAYS",
          "Contenu": "All the rba coils have been discontinued except the geekvape variety pack which is too expensive and always out of stock...as are most items. Cudos on the shipping price tho."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy Millman",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:20:54.000Z",
          "Titre": "The product is just like what I buy at…",
          "Contenu": "The product is just like what I buy at the local vape store for less than half the cost. The package shipped within a matter of days from purchase!!Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Weir",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T15:00:14.000Z",
          "Titre": "Important info not available",
          "Contenu": "Didn't tell me a battery must be bought separately... Had to wait an additional week to use my product"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Km",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:56:43.000Z",
          "Titre": "Shipping needs to be better. Amazing deals love the prices love the…",
          "Contenu": "Amazing deals love the prices love the products! Shipping is the only reason for 3 stars. I always get alerted that my items get sent but then they sit in preshipment for two or three days before they are actually shipped. Besides that everything is pretty awesome!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Teresa latini",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T23:27:43.000Z",
          "Titre": "Vapes doesn't work half the time",
          "Contenu": "I used to order all the time and would have gave them 5 stars but, my last order was horrible and I had no way to prove it to return them. Several only gave me two or three puffs. Some didn't work at all. One had the protective plastic pouch in the box ALREADY OPEN!!! I only gave them 3 stars instead of 1 is because their delivery service is on point."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Core",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T07:44:58.000Z",
          "Titre": "Order execution isn’t user friendly",
          "Contenu": "Order execution isn’t user friendly.  Seems to be ongoing issues.  International CCs, different addresses, etc.  only reason for 3 stars is prices and product vastness."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T01:40:03.000Z",
          "Titre": "Not happy with one vape",
          "Contenu": "I received my order, and just like any time I receive my vapes, I check to make sure they work. One of them, Sugarbar brand, will not stop running. Battery started at 100 and in 5 mins dropped to 50 and still going. Need to have this one replaced"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chet",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T20:53:52.000Z",
          "Titre": "I have mixed feelings",
          "Contenu": "I have mixed feelings. I placed a large order and they just cancelled it with no explanation. I had to send them 2 emails before they finally respond that they won’t ship to any address different from my credit card billing address. Why? I’m a travel nurse and my billing address is just a mailbox. I order online from many different sites all the time and have things shipped to wherever I happen to be at the moment. It’s not a problem with any other online merchant. They tell me I have to sign up and use Sezzle to ship somewhere else. How does using Sezzle change anything? So stupid and not great customer service. That being said, the prices seemed decent and my order arrived safe and sound finally."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew  Duncan",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T08:32:04.000Z",
          "Titre": "I love the prices and the variety but…",
          "Contenu": "I love the prices and the variety but twice now every time I've ordered it's gone from Atlanta to Florida and then back and I live a hour minutes north east of Atlanta in Gainesville Georgia. I don't understand it because our mail from Atlanta comes straight here other than that everything has been top notch."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia Cline",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T20:10:20.000Z",
          "Titre": "Great on  fast delivery…",
          "Contenu": "Great on shipping fast delivery coupon's don’t work they say not active would be nice to use one"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shannon Barber",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T04:35:37.000Z",
          "Titre": "Multiple vapes ordered",
          "Contenu": "I ordered several vapes the other day. As i only use them 1 at a time, i opened 1, it worked just fine...gave 1 to my daughter..it worked fine.  I decided to change up flavors about 5 days later. Open another one hit it and it would not stop firing. Finally got it to stop by blowing in it. Opened another one...it to would not stop firing...opened the 3rd one it too would not stop firing...finally opened the 4th one...it was working well...the 3 that arent working properly are Orion brand Lost Vapes...i contacted Ecigmafia...they emailed back and said because it was outside the 72 hour timeframe. There was nothing they could do about it.  I guess if you buy multiple vapes you should open them all as soon as you get them to make sure they work...to stay within the guidlines of the rules...my bad..i just expected to get a better quality and service from a big store like Ecigmafia...but i guess i shouldnt trust that either..wont happen again..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charlotte Ward",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T21:33:56.000Z",
          "Titre": "Honestly terrible shipping",
          "Contenu": "I've ordered from ecigmafia 4 or 5 times now, and I think only once did I get my order in a timely manner. Once I asked where my package was, and I was told that they don't work on weekends. From what I've seen, that means that Monday-Wednesday they are backed up on orders trying to fulfill them, and won't send your order from Friday-Monday out until at least Tuesday. Then, I live in Maryland, they are in Georgia, but for some reason every single time they ship my order to a Florida distribution center first, which is almost further away from Atlanta than my address. They basically send it in the exact opposite direction first, where I watch it sit for days sometimes. In general, it takes about 6-7 days to get my order, after being charged $9 to ship a $25 order. It's outrageous, I did not find the support helpful when I sent a ticket, and I think that this company needs to fix its shipping methods because they charge too much to give me too little and by the time my nicotine comes it's 3-4 days over the expected arrival time. Not okay considering the proximity of this company and how much they charge to ship."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sateva Henderson",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T05:40:48.000Z",
          "Titre": "Good price. Long delivery.",
          "Contenu": "I like the price of the battery mod. But the shipping process was rediculous. It went from GA to FL and now it’s been stuck in Alaska for two days. But I live in Washington. So idk why they sent it past me. But other than that not much else to say."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Renter",
          "Nb_Reviews": 5,
          "Date": "2023-11-16T23:48:54.000Z",
          "Titre": "It has taken 3 days",
          "Contenu": "It has taken 3 days, from notification of order shipped, until the USPS acknowledged receipt of order. Delivery is expected in 3 additional days. Ecig is based in Atlanta which is 20 miles west of my location. They might want to rethink their shipping options."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nikki  Durham",
          "Nb_Reviews": 3,
          "Date": "2023-10-23T13:58:18.000Z",
          "Titre": "First order was a bust.",
          "Contenu": "Company just cancelled my first order bc billing and shipping address didn't match. I saw the email 3 days later, and was super upset. Why even have the option to put a seperate shipping address if they HAVE to match? I won't use them again after this because I send packages to my husband's work to avoid theft of packages bc someone is always there. I just didn't want to spend another hour ordering from somewhere else when it was already 3 days past when I needed to order something. 3 stars, only because of the prices on products."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Sheehan",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T06:39:34.000Z",
          "Titre": "1st time I had a shipping problem",
          "Contenu": "1st time I had a shipping problem not ecigmafia fault. I order ever month I usually have my delivery in 3 days this time I got a shipping notice on Friday and as of Monday afternoon it still didn't ship."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer Faloon",
          "Nb_Reviews": 8,
          "Date": "2023-09-24T07:43:36.000Z",
          "Titre": "Why ECM only gets 3 star's now",
          "Contenu": "Companies should tell their customers when they make changes that effect their customers. They made changes to their shipping policy and it's not for the better. Shipping was always 3-5 day's now shipping is taking 5-7 days for people like me I rely on getting my vapes prior to running out I ran out and had to go to a local vape shop and cost twice as much 👎👎👎"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christine Lopresti",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T17:54:14.000Z",
          "Titre": "I'm still waiting on a refund/return on…",
          "Contenu": "I'm still waiting on a refund/return on items that safety seals were broken on and other vapes I realized I bought before and didn't like. I requested this 2 orders ago. I thought I'd got a credit I could a used on my next order. Still waiting. I contacted them and sent order# again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jon F",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T00:54:59.000Z",
          "Titre": "VooPoo Drag Q and customer Service review",
          "Contenu": "First off, I really like the VooPoo Drag Q. Works as advertised and a great product once you get the hang of its unique abilities for an MTL. Holds a charge well and taste is good. Makes a funny \"buzzing\" sound right after a full charge for a little while, a sound I have not heard with my other vapes, but I don't believe it is a malfunction since it went away as the charge lowered over time.As far as the customer service, not happy. While I made the mistake of being in a hurry purchasing the vape, what caught my eye was the \"Buy one get one free\" so I purchased with coils and another pod but missed the little note stating, \"Add 2 To Your Cart & One Will Be Free at Checkout\". Long story short, only one arrived and when I contacted ECigMafia, I was basically told too bad since it shipped and all they could do was half refund or credit?! Seems to me as a repeat customer the customer service could have worked with me and sent the other even if I paid the shipping. Saving a couple bucks instead of making good on an advertisement to your customers would seem to be a smarter move as opposed to losing a customer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gerald Prather",
          "Nb_Reviews": 7,
          "Date": "2023-01-16T23:54:44.000Z",
          "Titre": "Prices at ECM are always great but...",
          "Contenu": "Prices at ECM are always great and site is easy to navigate. The only comaint I have is the length of shipping time. $10 for shipping is a bit high when the product ships just south of me (same state) yet it still takes a week to receive. While USPS is slow, I think for the price of shipping i feel ot should not take a week to receive! Items landed my town Fri or Sat and still not delivered!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tonjia Horsley",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T00:27:56.000Z",
          "Titre": "The prices are great but customer…",
          "Contenu": "The prices are great but customer support is horrible. Placed an order on Dec. 5th here it is Dec.13th and still don’t have it. Called customer service never got a call back sent email and got a very I mean very short response but didn’t get my issue resolved just got a respond of just wait it’s in transit. The post office was better off helping me when it came to finding out what was going on with my order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cesar Herrera",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T08:36:21.000Z",
          "Titre": "Fast shipping but they missed a item that i got replaced",
          "Contenu": "I got my oder fast in days i had my order in but on this order 1iteam was missing and the waiting process is to long also i was never received no email from ecig with a new tracking number for my replacement one day im checking the mail and my replacement was there i do recomend too purchase the route insurance they help alot in getting my replacement"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathon Floyd",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T20:48:10.000Z",
          "Titre": "The products and shipping costs are…",
          "Contenu": "The products and shipping costs are reasonably priced. Preparing the product for shipping is a bit slow. I've also had delays while preparing the product for shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barbara Guzman",
          "Nb_Reviews": 3,
          "Date": "2023-10-06T23:27:01.000Z",
          "Titre": "One of the vapes came defective and it…",
          "Contenu": "One of the vapes came defective and it taste burn. I've never had an issue everything always comes in great condition good taste. But this recent purchase did have an issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brizzle",
          "Nb_Reviews": 5,
          "Date": "2023-12-02T01:18:04.000Z",
          "Titre": "This order was quick my next order is…",
          "Contenu": "This order was quick my next order is taking a lot longer"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Coriana Pennington",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T07:11:52.000Z",
          "Titre": "If there was a little bit more…",
          "Contenu": "If there was a little bit more communication that would have been wonderful. But aside from that it was exceptional service. The vapes I received were great!! Amazing flavor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T00:49:18.000Z",
          "Titre": "The price of the product I bought was…good, accept....",
          "Contenu": "The price of the product I bought was very good.......accept, buy the time I added the shipping cost, my savings was minimal, if not even a little more expensive than buying local.The delivery time of 4 days was not bad at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Katie Champlin",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T08:12:10.000Z",
          "Titre": "No estimate date.",
          "Contenu": "Didn't give me an estimate date when my package should have arrived."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Colleen Linville",
          "Nb_Reviews": 27,
          "Date": "2022-12-14T07:16:06.000Z",
          "Titre": "Great prices",
          "Contenu": "Great prices on products I ordered the FIEGIS Mod, I don’t like the battery door. The pieces that locks in, is already wearing down. I don’t know how long it will last. Plus it’s on the difficult side to lock it. Unfortunately they don’t carry my brands of e-juice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cayla Cole",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T23:44:37.000Z",
          "Titre": "I've ordered about 20 of the innevape…",
          "Contenu": "I've ordered about 20 of the innevape 6000 recently.  Grape is my favorite by far!.  Although they haven't lasted as long as other brands so far ( ex elfbar 5000 last 2 weeks for me). I've had 1 grape last 2 days, 1 berg Berry lasted 2 days ( which was fine because the flavor just wasn't for me anyways) , and today another grape ran out in 4 days.  I've never had that issue when buying from a store in the area.  I ordered alot online due to sales and better price, but not sure I'm really saving any $ with them not lasting. Will say shipping is fast and beats the vape store anxiety!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Gee",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T08:33:29.000Z",
          "Titre": "Prices are good",
          "Contenu": "Prices are good. 2nd time ordering same story label created for like 3-4 days but no movement. Don’t send customers tracking information so ahead of time. Easy fix."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ashley Sandusky",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T04:17:28.000Z",
          "Titre": "Replacement order didn't replace everything....",
          "Contenu": "My first order had ended up being stolen and then when I recieved my replacement order I did get it pretty quickly, however I didn't receive the correct items that I was supposed to. 3 out of the 4 were correct however I didn't recieve the one most important item which was my SMOK SOLUS kit in Cyan Pink. Which I thought ok maybe it's because they were out of stock but when I checked they still have them in stocks so idk what the issue was but I'm pretty irritated that now all I can do is sit here and look at my vape Juices without any vape to smoke them out of.... Which is a bit of a disappointment..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 3,
          "Date": "2023-08-04T18:32:27.000Z",
          "Titre": "I ordered 2 of the BOGO brands",
          "Contenu": "I ordered 2 of the BOGO brands, which I asked for 2 different flavors from each brand (total of 4 different flavors) got 1 flavor from each brand (2 flavors total). I'm not sure if something was missed on the order or I missed something. There needs to be an easier way to do the orders on BOGO so you can choose flavors for each brand so this doesnt happen. What if I don't care to much for a flavor? I'm stuck with 2 of them. Thanks for listening"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael M.",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T02:30:12.000Z",
          "Titre": "Sent a defective device.",
          "Contenu": "Processing was fast, shipping was fast. Products came within only two days of ordering, which is pretty insane, as I was expecting about a week. Plenty of sales and offers on the website, such as a buy-one-get-one deal that I took advantage of. Last time I ordered from here, customer service got to my message pretty fast, and they were happy to answer my questions. It looks like one of the devices they sent this time, however, is damaged and unusable out of the box. A shame, since everything else about this site is pretty great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jimmy chin",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T04:16:50.000Z",
          "Titre": "Prices are cheap but your shipping is…",
          "Contenu": "Prices are cheap but your shipping is expensive.  $11 everytime I order and it still takes a week to receive my stuff.  However, I always got my stuff and you never messed up any orders.  This is like the 7th time or more I’ve placed an order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Weiland",
          "Nb_Reviews": 3,
          "Date": "2023-06-14T01:15:25.000Z",
          "Titre": "I do almost all my vape buying from…",
          "Contenu": "I do almost all my vape buying from these guy’s, when they use usps for shipping , I usually get it within 3 days buy UPS sucks. Almost like they don’t care about their customers. Today is the 13th and the order was shipped on the 5th and still no delivery and no update on their website. They stink… Ecigmafia rocks great deals and customer service. Thank you for that. Stop using ups…"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mathew",
          "Nb_Reviews": 4,
          "Date": "2022-12-10T20:13:24.000Z",
          "Titre": "Best prices",
          "Contenu": "Cheaper than anywhere else. Takes a bit to ship tho...coming from Atlanta but goes to Florida then back to Tennessee. Doesn't make any sense....Atlanta is close to Tennessee and should come fast...especially since we pay 10 bucks to ship...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melissa Mack",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T22:26:27.000Z",
          "Titre": "I give the company in general 5 stars",
          "Contenu": "I give the company in general 5 stars. But not the products i purchased, hence 3 stars. I purchased three Funky Republic Disposable Vapes, two of them were defective. When ever you hit it, they keep burning for a good 15 seconds. I can still use them, but the battery runs down quick. I understand that can happen sometimes. Just wanted to point it out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mason  Hashemi",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T23:18:04.000Z",
          "Titre": "I like to have a description of the…",
          "Contenu": "I like to have a description of the correct e liquid to buy with mod kits so i dont waste money and time on the wrong type of e liquid like nic salt vs freebase or 70/30 pg vg vs 50/50 pg vg. Dont want to also get sick feeling from using nic salt in this mod kit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dawn E",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T06:15:47.000Z",
          "Titre": "Best prices and deals but lacking in restock of popular items",
          "Contenu": "Your prices and promotions can’t be beat! The biggest issue I’ve encountered is that several items I need have been out of stock for awhile. I keep checking back for them but they’re still not available. Please please work on restocking popular items!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 4,
          "Date": "2023-06-07T12:00:20.000Z",
          "Titre": "Generally great",
          "Contenu": "Generally a great place to purchase with easy to use website and fair pricing and delivery mechanisms.  However and recently, ordered an in-stock product and after 5 days and in spite of a shipping label being produced, it's still not shipped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Macconnell",
          "Nb_Reviews": 4,
          "Date": "2023-07-06T00:16:02.000Z",
          "Titre": "Some new product descriptions can be confusing.",
          "Contenu": "For those unfamiliar with the many new choices of vaping hardware, like ourselves, it would be a help to make clear the differences between the SMOK Novo models, and the replacement tanks available to each type.   I intended to order more NOVO 4's, and replacement tanks, but it was too easy to mistake them with the NOVO Mini's."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Miles",
          "Nb_Reviews": 6,
          "Date": "2023-08-18T18:41:18.000Z",
          "Titre": "Might not be you directly maybe usps…",
          "Contenu": "Might not be you directly maybe usps ordered 4 days ago, an looked to be ready to ship 3 days ago but still hasn't shipped so don't know how to rate you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darwen Halsell",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T20:53:20.000Z",
          "Titre": "Shipping is too expensive",
          "Contenu": "Shipping is too expensive. And reviews from the product specially e liquid is not true.. i bought different juice that ended up in the trash waste money and time. You already have account. And you still need to verify your age."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tanya Deel",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T12:51:07.000Z",
          "Titre": "The service was pretty fast but…",
          "Contenu": "The service was pretty fast but unfortunately I never received my discount from my friend referral link that I used to make my first purchase with you guys and into of that 3 out of the 6 items that were sent to me spread to be burnt(?) Or rather foul tasting. On the other hand the 3 that are not gross AF are amazing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Danielle  Yost",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T01:22:53.000Z",
          "Titre": "Out of stock",
          "Contenu": "Wasn't able to get a refill on the pots for the particular device that I own which was disappointing and they haven't been in stock for some time. Nothing like buying a device and then not being able to buy any of the refill pots for it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keith  Schmidt",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T17:25:19.000Z",
          "Titre": "Pretty disappointed on the shipping…",
          "Contenu": "Pretty disappointed on the shipping speed on the ordered almost a week ago. Ive bought a few different orders the past month to test the shipping speeds and havent been impressed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dr. David Faris, PhD",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T08:53:16.000Z",
          "Titre": "Your average Online Vape Shop..",
          "Contenu": "Good prices on most items. Not much custom service. No one was available when I tried to chat with them. Discount codes don't seem to ever work. Cost of Shipping is too high. Altogether, another average online vape shop."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Asturino",
          "Nb_Reviews": 2,
          "Date": "2023-01-07T21:39:23.000Z",
          "Titre": "I have made many orders in the past and…",
          "Contenu": "I have made many orders in the past and  always gave 5 stars, but one order sticks out I bought some E-Juice for $9.95 and was charged $10.70 for shipping on an item that weighs less than 1/4lb that is not right."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Les Anderson",
          "Nb_Reviews": 4,
          "Date": "2023-01-21T22:58:50.000Z",
          "Titre": "Order canceled no reason given",
          "Contenu": "Order canceled no reason. Contacted customer support and they said my billing and shipping address didn't match. I just moved from AZ to MN. So what ever I'll just buy local."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wendy Vaughn",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T02:09:18.000Z",
          "Titre": "Waited two days before I received any…",
          "Contenu": "Waited two days before I received any sort of confirmation.  Had to email customer service to find out when it would be processed/shipped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charlotte Ward",
          "Nb_Reviews": 3,
          "Date": "2023-03-13T04:22:25.000Z",
          "Titre": "1 of 4 didn't work",
          "Contenu": "I bought 4 disposable vapes from the same company in the same flavor. Only 3 worked properly. Unfortunately, one tasted like it had no flavor and had a harsh taste. 3/4 ain't bad I guess and the ones that work are great. Fast but expensive delivery, good deal on the vapes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T05:22:06.000Z",
          "Titre": "Geekvape E100",
          "Contenu": "As always, this company delivered in lightning quick time. However, this time the product showed up missing parts. Still waiting to hear back from customer service.  To be continued............"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Babs Clark",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T21:49:35.000Z",
          "Titre": "Better packing for shipping needed",
          "Contenu": "Order needs to be shipped in a box not put in a envelope. Boxes become smashed and the product may be damaged. This could be avoided by just putting them in a box with correct packing material."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kammi  Cummings",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T00:39:30.000Z",
          "Titre": "Almost expired",
          "Contenu": "There’s a couple of vapes that I received that are close to expiring. They taste terrible. Do you do returns or at least exchange?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-04-27T21:00:52.000Z",
          "Titre": "The last order I received the Vapes…",
          "Contenu": "The last order I received the Vapes were not very flavorful and some would not charge. Most lasted half of a day before becoming empty and no longer charging."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Billie S",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T18:25:51.000Z",
          "Titre": "The refillable pod that I ordered leaks…",
          "Contenu": "The refillable pod that I ordered leaks from the bottom and the vapetasia that I order shoots out puffs of smoke and makes a crackling noise when not in use ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey Willebrand",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T14:11:31.000Z",
          "Titre": "I’m still waiting on my delivery",
          "Contenu": "I’m still waiting on my delivery. I ordered on Thursday and it’s still sitting at point of origin. Communication is lacking about updates or status"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elizabeth  Delong",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T01:23:42.000Z",
          "Titre": "Shipping time took longer than usual…",
          "Contenu": "Shipping time took longer than usual and it was not processed until 2 days after I ordered"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melyssa",
          "Nb_Reviews": 11,
          "Date": "2022-12-13T01:17:22.000Z",
          "Titre": "Awesome site",
          "Contenu": "ECigMafia is great  but this time I have to give them 3stars only because my order took exactly 7 days for priority shipping SMH! This is not the usual here but this order was."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Mims",
          "Nb_Reviews": 3,
          "Date": "2023-03-23T02:46:34.000Z",
          "Titre": "This is the second review I've made",
          "Contenu": "This is the second review I've made. I have ordered multiple times from ecigmafia. My first four or five went well. Quickly filled and shipped. The last few, not so much. It's been outside of 48hrs before I get confirmation of fulfillment and day 4 or 5before it ships. The prices and products are still superb, but they need to step back up in their warehouses."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Connie Rousseau",
          "Nb_Reviews": 4,
          "Date": "2023-01-20T20:47:52.000Z",
          "Titre": "Extra order charged to my account..",
          "Contenu": "Well as stated in a message I was charged for another order after the one I really did make . Somehow another order was put in, not by me, and I live alone one charge it says well in my bank it says both charges are $31 and some odd cents but in here in the app it says $31.21 I would not be stupid enough to make two orders and pay two shipping fees when I could put it all together and have only one shipping fee so I see that it's already been shipped nothing we can do about it I guess but I really upsets me because I don't have enough money as it is I'm on Social Security and that kind of hurt me taking that extra money from me so that's why I am only putting up three stars I've been a good customer and I don't know what happened I hate to think that somebody in your store did it but I don't know how else to explain it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim J",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T20:16:18.000Z",
          "Titre": "The ordering was easy",
          "Contenu": "The ordering was easy. The shipping seems to be having an issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Lolos",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T22:03:26.000Z",
          "Titre": "I wish your search was better also…",
          "Contenu": "I wish your search was better also being able to search by mix ratio and more results to pop up when searching for 0mg"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christabol  Felix",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T19:01:03.000Z",
          "Titre": "One of the disposable vapes I bought…",
          "Contenu": "One of the disposable vapes I bought didn't work but I also got a double that I didn't want so there was a flavor missing and I bought 7 and only got 6 in my package."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy Graveline",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T16:53:27.000Z",
          "Titre": "I buy things from them because I like…",
          "Contenu": "I buy things from them because I like the products. Then the product goes out of stock. Forever. So I have to keep switching and searching for something similar (vapes) and it becomes a crapshoot as to what I get. It's annoying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rossana Martinez",
          "Nb_Reviews": 2,
          "Date": "2023-05-28T17:12:39.000Z",
          "Titre": "7 daze products were great but!!",
          "Contenu": "7 daze products were great, fresh & crisp. Excellent flavors. The other products were obviously old, dark very thick and stale. Those ended up clogging my pods up after a couple of fillings."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon  Minks",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T00:20:16.000Z",
          "Titre": "My package was supposed to have been…",
          "Contenu": "My package was supposed to have been delivered but it was nowhere including my neighbors I told them about that they said they would send it as they say awwagain"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George Hada",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T19:31:57.000Z",
          "Titre": "The device was ok mouth piece is short…",
          "Contenu": "The device was ok mouth piece is short the cap fill locking can be improved for a1500 mah I wished itwas 19mm. Shipping was a bit expensive for light product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Priscilla Macias",
          "Nb_Reviews": 3,
          "Date": "2023-03-30T03:57:39.000Z",
          "Titre": "2 of the vapes did not work dragonbar…",
          "Contenu": "2 of the vapes did not work dragonbar and lostmary citrus sunrise something like that and it was one that had no bogo"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa Woolsey",
          "Nb_Reviews": 3,
          "Date": "2023-10-12T02:48:54.000Z",
          "Titre": "I tried to cancel my order like half an…",
          "Contenu": "I tried to cancel my order like half an hour after I made the order no one got back to me. And my order is on the way here."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Hayes",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T19:52:15.000Z",
          "Titre": "Need to stock Candy King Hard Apple on Ice",
          "Contenu": "I love ordering from your site but, it's hit and miss on my flavor being in stock...  Candy King Hard Apple on Ice!  I probably go through three bottles a month. 🏴‍☠️🏴‍☠️🏴‍☠️"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard  Wiggins",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T03:44:00.000Z",
          "Titre": "Didn't like the BOGO on Orion 7500 for…",
          "Contenu": "Didn't like the BOGO on Orion 7500 for like 16. When I purchased the same thing a month Ago and they was like ten each. Love the flavors but shouldn't spike the price and say BOGO. More like buy one and a half and get half free"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CHASE",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T03:48:09.000Z",
          "Titre": "Everything was great",
          "Contenu": "Everything was great, I did not care for 72 business hours to even start processing. If you could start processing right away and have stuff in the mail the next business day, would be 5 stars all the way!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicole Soper",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T02:41:17.000Z",
          "Titre": "I am not satisfied with the order…",
          "Contenu": "I am not satisfied with the order because I ordered a specific juice and I received the wrong kind"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barbara Guzman",
          "Nb_Reviews": 3,
          "Date": "2023-06-22T19:59:55.000Z",
          "Titre": "Shipping and delivery were on spot…",
          "Contenu": "Shipping and delivery were on spot super fast. But I did not receive what I was supposed to. Bummer!! 😒"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "cornbred",
          "Nb_Reviews": 5,
          "Date": "2023-03-10T08:04:57.000Z",
          "Titre": "Great prices and shipping is fast for Florida",
          "Contenu": "Great prices and it's one state state away so shipping is fast. Things do go out stock quickly but the prices are fair. I but allot from here and wish the shipping wouldn't b so much. But overall it is a good place to get your vape and dabbing needs"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 4,
          "Date": "2023-08-17T21:23:26.000Z",
          "Titre": "Item shortage…",
          "Contenu": "Although there were several options to choose from, none of my preferred options were available."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Annette Duran",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T00:06:07.000Z",
          "Titre": "I bought these because of the lanyard…",
          "Contenu": "I bought these because of the lanyard and these don't have them anymore.So very disappointed"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna Mascio",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T02:00:36.000Z",
          "Titre": "Waiting for juice",
          "Contenu": "I ordered juice on the 7th and it's still waiting to be picked up? Usually get my stuff already by now so I'll add 2 stars if this is resolved! Other than that I love Ecigmafia.com"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia Dumars",
          "Nb_Reviews": 8,
          "Date": "2023-07-16T00:16:05.000Z",
          "Titre": "You guys were very late getting my…",
          "Contenu": "You guys were very late getting my juice here this month Like, 15 days or more  late. Customers would like to know why they're products or late."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Knessa  Ady",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T15:30:53.000Z",
          "Titre": "Missing item but other then that…",
          "Contenu": "Missing item but other then that shipping was fast taxes were more then expected"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Celeste  Sigley",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T23:14:38.000Z",
          "Titre": "Well I received a Nova bar 6000 that…",
          "Contenu": "Well I received a Nova bar 6000 that lasted 24 emailed I received  a email back unfortunately  they dont warrant  the disposable   but it's ok will continue  to order till I decide if I want to buy a regular  vape"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MJ",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T11:43:43.000Z",
          "Titre": "One of the three I ordered arrived…",
          "Contenu": "One of the three I ordered arrived non-functional. It doesn’t charge or produce any vape smoke."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anita Jeffress",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T00:30:26.000Z",
          "Titre": "The company did a fine job shipping the…",
          "Contenu": "The company did a fine job shipping the product quickly. However the products that I purchased were not good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M D",
          "Nb_Reviews": 2,
          "Date": "2023-08-26T02:05:55.000Z",
          "Titre": "Easy Ordering Needs Better Packaging",
          "Contenu": "The ordering process is effortless and great, however I would like to see a little better packaging as far as shipping goes because I did get a damaged package (thankfully nothing appears damaged, but a bubble mailer isn't sufficient with how the mail is handled)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Toro",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T06:26:47.000Z",
          "Titre": "You did good on the delivery but the…",
          "Contenu": "You did good on the delivery but the honor promo code never worked thx"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Gerdine",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T15:46:01.000Z",
          "Titre": "They had a wrong price on the…",
          "Contenu": "They had a wrong price on the disposable vapes I wanted..then Removed them together"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer Kennedy",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T22:44:07.000Z",
          "Titre": "Very reasonable prices product came very quickly",
          "Contenu": "I found that the prices for the things that I bought were very reasonable, and the product came very very quickly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brenda Rains",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T22:36:41.000Z",
          "Titre": "Took 2 days to fill the order an its…",
          "Contenu": "Took 2 days to fill the order an its been 3 days of shipping N I'm still waiting"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luke",
          "Nb_Reviews": 4,
          "Date": "2023-06-05T16:44:14.000Z",
          "Titre": "I'm happy with the new reduced cost of…",
          "Contenu": "I'm happy with the new reduced cost of shipping, but upset at the change to tracking with Route. Before you could check the progress of your delivery on the Route website though it was very heavily trying to get you to use their app. Now they only have the option to to see where my package is at by downloading the app. It claims that it'll track all sorts of other companies packages but I order stuff online all the time from many different places and I've never came across any other company that uses it. I refuse to download yet another app that will most definitely gather all the information it can to sell to the highest bidder and make a profit that I'll only use a few times at most in a year, and I already had to pay a nominal fee to have it in the first place. Delivery of packages bought from a company already have federal guidelines that the onus is on the company that the goods be delivered to the purchaser in the United States so the added \"insurance\" is absolutely unnecessary and loosing the tracking feature without downloading the app is just 100% a free money grab that offers nothing of value to me anymore so I won't be purchasing the Route package insurance anymore. Other than that, ECigMafia has always provided great service and awesome prices, especially with the discount codes that they almost always have going, so I'll definitely continue to order from them in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nancy  Hausman",
          "Nb_Reviews": 3,
          "Date": "2023-05-11T15:11:25.000Z",
          "Titre": "I dropped my new vape in the pool",
          "Contenu": "I dropped my new vape in the pool. My fault. I asked for help in finding out if I could save it. I didn’t get any. It would have been a gracious offer to replace it. But they didn’t. That’s fine. They asked me to take a picture of it. I did. End of story."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T04:45:37.000Z",
          "Titre": "Prices are good but product isn't…",
          "Contenu": "Prices are good but product isn't regularly available"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward Johnson",
          "Nb_Reviews": 3,
          "Date": "2023-06-24T23:05:14.000Z",
          "Titre": "Prices are great customer service could…",
          "Contenu": "Prices are great customer service could use some work"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anne  Williams",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T20:49:36.000Z",
          "Titre": "Package tracking number was generated…",
          "Contenu": "Package tracking number was generated last week, still hasn't shipped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles  Davis",
          "Nb_Reviews": 6,
          "Date": "2023-06-16T20:29:00.000Z",
          "Titre": "This is first time it has taken this…",
          "Contenu": "This is first time it has taken this long to get my vapes. Product and price good, just delivery taken a good while to get here"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-06-13T12:57:32.000Z",
          "Titre": "ProDucts didn't last more than a week and…",
          "Contenu": "ProDucts didn't last more than a week and won't charge or have lost flavor"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah Henning",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T00:48:37.000Z",
          "Titre": "2 of the disposables just dont work",
          "Contenu": "2 of the disposables just dont work. They sputter and stay burning when you let go of the drawl."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jackie",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T10:06:58.000Z",
          "Titre": "Best pricing without the BS fees",
          "Contenu": "One of the disposables that I got crapped out on me way faster than it was supposed to. Prices are good though and shipping didnt take forever."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MAD",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T08:46:55.000Z",
          "Titre": "Ordering experience",
          "Contenu": "Ordering was easy lots of selection to choose from but there was a bogo offer for a vape I had selected it was only a few dollars that I would have saved, But I didn't see the bogo till the next day when I was browsing again. Other then that I still will be ordering from you guys again. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim LaCosse",
          "Nb_Reviews": 6,
          "Date": "2023-12-16T18:09:55.000Z",
          "Titre": "Great.. as usual",
          "Contenu": "As usual, good prices and quick shipping. I do wish you guys would go back to carrying 0mg juices again. I do have to go elsewhere for juice. But for hardware, ECM is always one of my first choices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gunther",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T23:20:40.000Z",
          "Titre": "Good overall, could be better. Will use again.",
          "Contenu": "Website product filters could be better but overall good ordering experience. Decent prices. Quick shipping, but seems to only have a single standard shipping option. Correct products shipped. Nothing broken or missing. Will order from here again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Macconnell",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T19:29:31.000Z",
          "Titre": "Your offerings are quite comprehensive, but specifications missing.",
          "Contenu": "Your offerings are quite comprehensive, and pricing is competitive, (5*) BUT:We've found the website (4*) could be organized to make choices easier; for example, we are using the SMOK NOVO 4's and the NOVO 4 Mini's, and finding the replacement parts is difficult.  It may help if the pods were described clearly as \"For Novo 4 only\", or \"For NOVO 4 Mini only\", and the same notations for the coils , e.g., \"For NOVO 4 and NOVO 4 Mini\"). Even better, like Amazon, show parts offerings together with main item (\"buyers also purchased... \").  SMOK offers SO many similar products that choosing replacement parts is confusing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dakoyta Rumsey",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T03:04:33.000Z",
          "Titre": "Great selection",
          "Contenu": "Great selection, better prices and there's always something on sale. Use them every time I need something whether it be a new mod, coils, or a disposable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica  Pride",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T00:51:46.000Z",
          "Titre": "Happy Customer",
          "Contenu": "Item was exactly what I ordered. Shipping wasn't to long of a wait. All for reasonable price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:06:54.000Z",
          "Titre": "Happy to find them",
          "Contenu": "Very helpful & kind in the emails but the slow shipping is a bummerBut I will be back!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deanna Drake",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:59:12.000Z",
          "Titre": "Affordable items no warranty though",
          "Contenu": "Affordable items no warranty though Have purchased numerous times. Few should of replaced but price so good just look past it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T02:02:14.000Z",
          "Titre": "You only really need to shop here",
          "Contenu": "Fastest shipping time, ordered on the weekend, they got it Monday, I had it Thursday!  Yeah!  They have great prices and there are always additional deal codes.  Very nice on the wallet.  They have the best deals on liquids and my favorite devices and parts.  Almost one stop shopping.  Batteries were out of stock at the time.  But they were a great price so I see why they were out of stock. Hassle free so far!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cody Presnell",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:30:52.000Z",
          "Titre": "Great products and prices",
          "Contenu": "Great products but shipping could be a little better. Took 2 days after placing order just to make a label and then another day after that to ship. Still got items in 5 days but feel like it could have been 3. Great products and prices make up for it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Drew M.",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T01:19:07.000Z",
          "Titre": "Initially I gave E-CigMafia a 1-star…",
          "Contenu": "Initially I gave E-CigMafia a 1-star review because their delivery took much longer than expected. It's possible it was a one time occurrence and I will order from them again to see if that was the case. As far as the products received, website, and overall experience (pricing, products, etc.) I would give it 4-stars. My only reason for not giving it 5-stars is because while their pricing is great on disposables, majority of the time on the best deals they're either completely sold out or have 1 or 2 flavors that most people don't want. So a lot of times the really great deals are unavailable. But comparison pricing with BOGO specials on high end products is still very good and I'm happy with the products. I will definitely warn anyone about buying the cheap disposables that are -$5-10 and have a BOGO deal....they are trash 🗑. Like anything else you get what you pay for. I bought almost 40 cheap disposables foe the same price as 11 high end ones and I ended up tossing most of the cheap ones because of taste and the next day they gave you a sore throat....most likely I was paying money to allow China to slowly poison me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T14:05:55.000Z",
          "Titre": "Very quick to ship",
          "Contenu": "Very quick to ship, availability can be hit or miss. Have also had some vapes not function. But for the price you can't beat them!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jesse Whitacker",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T05:15:40.000Z",
          "Titre": "Every time I get a product from your…",
          "Contenu": "Every time I get a product from your website everything is very satisfactory thank you very much I can tell you to use your product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harry King",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T13:53:08.000Z",
          "Titre": "On time no bull and no problem…",
          "Contenu": "On time no bullshot  and no problem getting my order right"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 6,
          "Date": "2023-11-16T21:04:47.000Z",
          "Titre": "Still great online vape seller. Wasn't processed as fast as the first…",
          "Contenu": "Wasn't processed as fast as the first order but they still beat almost all online vape stores.  It's sitting in Georgia rn but will be delivered before Saturday I bet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Walter",
          "Nb_Reviews": 4,
          "Date": "2023-11-12T16:44:26.000Z",
          "Titre": "Normally I have no issues",
          "Contenu": "Normally I have no issues. This time on two separate orders my package was waiting to be picked up by USPS for 3 days. Labels were already generated, took me 8 days to get both my orders. Normally it's three to four. But a very good company to do business with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristin Voigt",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T03:05:15.000Z",
          "Titre": "Prices unbeatable",
          "Contenu": "Prices unbeatable Usps wasn’t as punctual as they could have been Two flavors from one brand were awful 🤢 One item leaked or was covered in some sort of ooey gooey yuck 🤷‍♀️ But other than that it was overall a decent experience unfortunate for the accidental leakage that reflects upon this decision when it’s more than likely manufacturing company’s error not yours 🤔"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronica Engel",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T01:58:51.000Z",
          "Titre": "Good & Bad",
          "Contenu": "Fast delivery. Easy checkout. Nice options. Only issue I have has is a few times the disposables continue firing even taking a drag. So I'm out the money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-11-17T23:04:16.000Z",
          "Titre": "I like the fact that shipping is always…",
          "Contenu": "I like the fact that shipping is always fast,and that I receive the correct order,and the quality is great.,and also the notifications updating me of what's going on with my order is nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roxann",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T20:34:17.000Z",
          "Titre": "I really like the reasonable prices of…",
          "Contenu": "I really like the reasonable prices of the different products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia Dumars",
          "Nb_Reviews": 8,
          "Date": "2023-10-18T18:45:43.000Z",
          "Titre": "I ordered batteries",
          "Contenu": "I ordered batteries, I have only ever ordered one size. So when you see a customer, order, a batteries they've never ordered, you might ask them. Are you sure these are the ones you want? Because on the website, they all look like the same size. You guys never responded to me, about replacing them with the right ones. Other than that, I've had a great experience with E cig mafia. I've been shopping with yo,  for the last 4 or  years 5 years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Siouxsie Monroe",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T00:49:34.000Z",
          "Titre": "The shipping time was great",
          "Contenu": "The shipping time was great, less than estimated by 2 whole days and delivered on a holiday! Sadly, 2 of the 4 vapes I purchased were virtually flavorless but that's probably a brand issue and not that of the vendor. Overall a good experience but I won't be making any repeat purchases of the Pod brand"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angeline Weaver",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T22:42:46.000Z",
          "Titre": "The only reason I gave 4 stars instead…",
          "Contenu": "The only reason I gave 4 stars instead of 5 is because I had ordered a disposable, waited two days for shipping and then I get a message from them saying my order was canceled because they ran out of the disposable I ordered. Would have liked to know sooner than 2 days but then I ordered a different disposable and it shipped and arrived in 3 days! Super quick shipping and I didn’t even have to sign for it usps just left it in my mailbox"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Curtis Presley",
          "Nb_Reviews": 5,
          "Date": "2023-10-08T00:37:43.000Z",
          "Titre": "Mafia Dudes Do It Again!",
          "Contenu": "Products and price are awesome! My first order took two days for me to get(USPS Priority). This order was shipped UPS Ground and took 6 days for shipping. (Perhaps because I spent $100+ so I qualified for free shipping). But I will definitely be shopping with the Mafia Dudes again!! :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina G.",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T12:51:23.000Z",
          "Titre": "They're fantastic",
          "Contenu": "I really love all of the great prices that they have. Also, their shipping is super fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AH",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T09:36:04.000Z",
          "Titre": "Great service but some juices sold too soon",
          "Contenu": "I’ve been shopping ECigMafia for over a year now, placing 1-2 orders a week. They always arrive timely. So, service is great. BUT my last 4 bottles of a certain ejuice have been way too new to enjoy, some even arriving less than 2 weeks after creation day. It’s been a bummer watching 4 bottles of my favorite juice, sitting here unable to vape because they haven’t steeped enough to produce full flavor. I’m not sure if that’s something they can control or not. Luckily they are less than $6/bottle"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christina C.",
          "Nb_Reviews": 6,
          "Date": "2023-09-14T18:28:54.000Z",
          "Titre": "Huge array of brand and flavor vapes...",
          "Contenu": "I love most all the vapes I get. Out of an order of about 10 I do receive about 2 or 3 that don't work properly. They taste like there's no juice in them and I'm straight puffing burnt cotton. I throw the boxes away immediately so I don't have the chance to return the items. That being said, I recommend this website to everyone I know since it saves me so much money than buying vapes in the local stores. I love the brand and flavor variey."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Parker",
          "Nb_Reviews": 2,
          "Date": "2023-04-29T01:51:30.000Z",
          "Titre": "Pros & Cons",
          "Contenu": "Pros - ease of product access, pricing, web designCons - needing to catch a discount promo, cant use mafia bucks with a promo, push ROUTE tracker fees  when you do NOT need it (tracking and insurance is provided through carrier USPS for no addtl charge)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica G",
          "Nb_Reviews": 3,
          "Date": "2023-05-07T02:12:19.000Z",
          "Titre": "Another excellent order",
          "Contenu": "Everything I ordered came lightening fast, accurate & my cart didn't go up $20 at checkout with random fees. Unfortunately the BB date on the juice was a few months ago, but they typically are these days (from everyone). SUPER fast, free shipping & great prices, Ecig Mafia for the win!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NickieJay",
          "Nb_Reviews": 5,
          "Date": "2023-06-05T21:58:02.000Z",
          "Titre": "Love ecm only site I use now",
          "Contenu": "Love ecm only site I use now. My only complaint If I had one would be the search engine. It often doesn't produce the things I'm searching for with just general searches off of your own headings, but then if I search specifically for each one they mostly are available. It's not a big deal because I understand how to navigate it, but I imagine there are individuals that don't and it could possibly benefit you if it worked a little bit better."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Woolsey",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T05:50:02.000Z",
          "Titre": "Received quickly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "nichole Buckman",
          "Nb_Reviews": 8,
          "Date": "2023-08-12T07:45:17.000Z",
          "Titre": "bogo",
          "Contenu": "the deal with buy one get one is amazing. however it wasn't very  clear one must put 2 vapes in the cart to receive free one. one might believe by purchasing one, another one is then added directly to your order automatically. but I still stand by my purchase(s)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah Winters",
          "Nb_Reviews": 3,
          "Date": "2023-07-24T08:56:31.000Z",
          "Titre": "I just wish packaging was better since…",
          "Contenu": "I just wish packaging was better since the bubble packaging gets thrown around so much during shipping that's why I think 4 of my vapes malfunctioned and they don't work at all so I'm stuck with 4 that are no good. Was upset about it but I think it happened during shipping because the oil leaked out and they wouldn't charge.  They were the ones that looked like a lighter,  where the top flips open.  I don't even see that you sell them anymore"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 12,
          "Date": "2023-06-14T15:56:47.000Z",
          "Titre": "The deals that they offer along with…",
          "Contenu": "The deals that they offer along with already low prices, they can't be beat for all my vape needs. I've been dealing with these guys EXCLUSIVELY for several years now and the shipping is also very fast compared to anyone else I've ever dealt with. If you're looking for the very best in the country for online vape supplies, in 15 years of vaping the is no better then ecigmafia.com!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pamela M Wright",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T02:45:27.000Z",
          "Titre": "My order was delivered quickly",
          "Contenu": "My order was delivered quickly. I've never had any issues with Ecigmafia. The only  thing is that your shipping and billing addresses have to be the same. If I'm purchasing as a gift  this can be a problem 😥That's why I gave 4 🌟 Otherwise 😊"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PNut",
          "Nb_Reviews": 4,
          "Date": "2023-09-13T01:34:00.000Z",
          "Titre": "Desire to exchange nasty flavors…",
          "Contenu": "My issue with my order is the simple fact that one of the flavors i got is absolutely disgusting! And i cant exchange it which is a total waste n i hate wasting things!. Another issue would be not knowing how to use my mafia bucks! I cant seem to find the option anywhere...?!? Other than that i love this site!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "donna ludwig",
          "Nb_Reviews": 7,
          "Date": "2023-11-11T10:36:53.000Z",
          "Titre": "Candy King E-juice",
          "Contenu": "This is the second time this has happened. I let the first one slide because I have never had a problem. Any kind of fruit e juice is supposed to be clear. The juice I just got is yellow and it tastes stale. I'm willing to let this one slide too in hopes it don't happen again. And some how they rerouted the mail now it takes a extra day to get it. It still comes pretty quick. Keep up the good work guys and or gals."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheri Smith",
          "Nb_Reviews": 7,
          "Date": "2023-11-30T06:43:38.000Z",
          "Titre": "Company-Good/product-not so much",
          "Contenu": "The ordering was great. The shipping went well. However, two of the products didn’t work:-( sad news."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheri Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T02:56:53.000Z",
          "Titre": "Was several days after ordering before…",
          "Contenu": "Was several days after ordering before shipment went out.Email received showed a tracking number that was incorrect.Emailed again asking when shipment would go out and it was to be delivered the next day through a different carrier that I was unaware of.Other orders have been fantastic and no complaints."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicholas Tannler",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T05:34:49.000Z",
          "Titre": "Shipping is unusually slow, but they’re great",
          "Contenu": "Shipping is super slow this time, I know I ordered on a Saturday I believe but wasn’t shipped til Tuesday and now it’s the next Monday…should be here tomorrow. Just a little pissed usually these guys get it to me faster than predicted. They are always having good deals on disposables nicotine vapes with Buy One Get One Free, cost of smoking went from $15/day to $10/week or less, and I definitely notice an improvement in my lungs! Time shall tell….P.S. I live in CA where they have ridiculous prices for tobacco sticks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T00:04:44.000Z",
          "Titre": "Excellent pricing, speed and customer service!",
          "Contenu": "Great pricing on the brands that I love. Amazing shipping and handling speed as well!  The only constructive criticism is the shipping packaging.  This is my second purchase and both times boxes of e/juice, and this time vape, cartridges and juice were packaged in an envelope offering no protection which caused the boxes that the juice vape etc to arrive crushed and crumpled. The product is fine, but the presentation is not."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 7,
          "Date": "2023-11-11T18:45:08.000Z",
          "Titre": "love the variety and the great prices",
          "Contenu": "love the variety and the great prices. reason for only 4 stars ... is I had 4 of the disposables that were bad , I wrote an email to them and never heard back. Again other then that love what I have gotten."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise H.",
          "Nb_Reviews": 2,
          "Date": "2023-07-22T23:16:02.000Z",
          "Titre": "Prices are good in comparison just 4…",
          "Contenu": "Prices are good in comparison just 4 stars because choice of flavors have been few - supply & demand right? Quick delivery & Excellent customer service   even received a phone call to correct MY ERROR  lots of vendors don't do that  thank ecig"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brendan  Demeny",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T01:29:47.000Z",
          "Titre": "Very easy to order and fast delivery",
          "Contenu": "Very easy to order and fast delivery. Wish you had Mr. Fog disposable vapes or the Bingo brand that look like slushies and drinks. Love all the deals you have and love the prices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angie Jaso",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T22:24:33.000Z",
          "Titre": "Love the product so far the only thing…",
          "Contenu": "Love the product so far the only thing I wish was the bogo sale was made more clear. I ordered a vape and thought I was getting a second one and only one came in mail so when I went to website to double check I then noticed I had to add two to the cart in order to get my free one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 7,
          "Date": "2023-07-25T08:00:46.000Z",
          "Titre": "Awesome service as always however ALL",
          "Contenu": "Awesome service as always however ALL of my regular salt nic juices were out of stock for almost a week, and I had to try to find another brand of the same flavors...HUGE mistake! The \"Salt Bae\" Strawberry-Lemon and Watermelon are HORRIBLE! They have a chemical taste and I like sweet. The Strawberry-Watermelon is the only one I can tolerate for the rest of the month. I normally get the same flavors in the salt nic \"Fruit Monster\" brand as well as the \"Milk\" Cinnamon and Jax. I order all of my months worth of products and supplies on the 3rd if each month and time it so everything we ill last and was very disappointed that none of my normal juices were in stock!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TeaLeevz",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T20:54:00.000Z",
          "Titre": "Everything is cool with one exception",
          "Contenu": "Everything is cool with one exception, you don't have replacement glass for the Geekvape Z Nano 2. I actually thought I'd ordered them a few months ago but I got replacement glass for a tank I don't even have. Maybe that's on me, I'll have to review the order to see. It's the only time I ever ordered replacement glass from you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jaime Reinsch",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T19:07:33.000Z",
          "Titre": "Service is great, customer service lacks some",
          "Contenu": "This was my second order with them.  My first was great!  This one was \"ok\"  the shipping was great! But when an issue arose with delivery I felt customer service was lacking. They responded to my messages in a timely manner, but they seemed to not really care there was an issue.Overall I am happy with the service and will order from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabriel True",
          "Nb_Reviews": 4,
          "Date": "2023-06-20T18:45:32.000Z",
          "Titre": "Usually a 5 star experience.",
          "Contenu": "Usually a 5 star experience.I placed my order on Wednesday. I just now (on Monday night of the next week) got a notification that it’s been dropped off at the postal drop off.Usually it takes ~3 days to get my order from these guys and they’re super prompt but this time it will be over a week by the time I receive it.Ppl are addicted to these things, literally. So prompt shipping is pretty important guys!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samuel  Moreno",
          "Nb_Reviews": 3,
          "Date": "2023-09-09T23:39:03.000Z",
          "Titre": "The beat quality",
          "Contenu": "Every single products was originals and the best price but I’m giving y’all guy’s 4.5 stars just because sometimes the package taking little longer but it’s the best company I’ve ever had online! Thank you guy’s! You have a new customer!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela L",
          "Nb_Reviews": 4,
          "Date": "2023-07-13T21:33:23.000Z",
          "Titre": "I was happy I could find what I needed",
          "Contenu": "I was happy I could find what I needed. I fortunately received a special, BOGO. I placed 1 in cart and got 2nd free. I then chose another flavor and assumed I would get the same free under the BOGO special. It did not. I was being charged full price for each of the additional. I did not see any exclusions under the special. I ended up just purchasing the 1 and 1I got free.   So that was a dissappointed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chrystal  Hameau",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T20:40:42.000Z",
          "Titre": "The service and speed of delivery…",
          "Contenu": "The service and speed of delivery through ecig is always awesome. The only reason it is 4 stars is because my one flavor disposable does not work. The Pineapple Mango does not function at all. Otherwise great, I don't shop anywhere else.Chrystal Hameau"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Britaney B",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T00:13:38.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, great products and deals! Only negative thing I can say is some of the elf bar flavors I wanted to order were out of stock which was a bummer because when I make a purchase from this website, I usually order a couple of months worth of vapes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tammy  Hellyer",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T19:51:04.000Z",
          "Titre": "Overall Great Experience",
          "Contenu": "Love this company so far. I purchased 2 items which came relatively fast. The reason for 4 stars instead of 5 is because of the condition of the Boxes, they were crushed and the vapes were both outside the box. They’re well protected in the pouch. Love the flavor selection."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JA",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T00:29:36.000Z",
          "Titre": "Good job ECIG",
          "Contenu": "Great job on shipping. Was super fast ordered sun night got thursday afternoon. In my honest opinion could offer more brands or bigger selection on eliquid. Thats the only con I see that could be improved on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "keescha hauge",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T19:24:58.000Z",
          "Titre": "Takes awhile to ship",
          "Contenu": "I gave a 4 because of the shipping. I understand your products are competitively priced, which results in a higher shipping fee. What I don't like is that it took 3 days to get my order shipped. That is frustrating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon Stimpson",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T23:43:38.000Z",
          "Titre": "Great site!",
          "Contenu": "Great site to get anything you need!  The shipping to my area is pretty slow, but not enough to make me go somewhere else.  Definitely reccomend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy Nicholson",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T23:29:48.000Z",
          "Titre": "Great prices for juices",
          "Contenu": "Everything priced extremely reasonable, better than vape shops. Shipping was very fast, especially ordering on a Friday. I ended up getting my package a day early. I'm very happy with the prices, even have a mod and rda in my cart to purchase later. ONLY reason I took off a star, is because there isn't alot of devices to pick from. I was able to find a mod and rda on this website, but will have to purchase purchase cotton, tool kit, and coils somewhere else. I'm sure there's a reason why, but that's the only reason why I gave it 4 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 4,
          "Date": "2023-03-17T17:59:51.000Z",
          "Titre": "Most of the products are great and low…",
          "Contenu": "Most of the products are great and low prices, every now and then you get a DOA. But for the price it's still better then most. Customer service  was quick respond offered a exchange that they don't usually do but I tossed the item before taking a video of it not working. Over all experience was better then most online stores"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 6,
          "Date": "2023-07-06T02:35:35.000Z",
          "Titre": "90%of the time I'm blown away at how…",
          "Contenu": "90%of the time I'm blown away at how fast I receive my delivery from you.10%, when I need it most, it's gonna take 5 days in your defense many things occur in shipping, so it's not your fault. I give100 stars to your cost! Incredible savings. I talk about your website free. I have a channel on you tube @The-Vape-Man. I never asked anything in exchange, I preach your website. I'm monetized on Facebook, TikTok, Instagram... I mention you and SMOK free that's how great you are. Keep up the great work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vickie Bragg",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T01:19:16.000Z",
          "Titre": "ECigMafia ROCKS 💯",
          "Contenu": "Easy to navigate website , alone with fast fulfillment and shipping , customer service is awesome. All around one of the best online shops I have shopped at in a very long time .. Thank you ECigMafia for making my shopping experience very stress free"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greggory Gibbs",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T04:32:41.000Z",
          "Titre": "Came a few days late",
          "Contenu": "Great selection and best prices I’ve been able to find. Came a few days late but other than that no issues. Will use this company again for my next purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "G Heinemann",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T20:13:10.000Z",
          "Titre": "Great Company!",
          "Contenu": "Great company! Awesome prices and amazing products!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PAUL",
          "Nb_Reviews": 11,
          "Date": "2023-07-05T00:17:11.000Z",
          "Titre": "Can’t use my mafia bucks????",
          "Contenu": "Doing well: great products and prices fast shipping. Doing not well: I can never use my mafia bucks that I have earned for being a loyal customer. I have only bought from Ecigmafia for probably about a year now but I can’t use my mafia bucks when I checkout. What’s up with that?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane Cranker",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T12:35:16.000Z",
          "Titre": "Pricing and customer service.",
          "Contenu": "The prices keep me coming back time after time.  Sometimes customer service isn't the greatest. But I am over all pleased with egigmafia."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Therese Rochon",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T21:50:19.000Z",
          "Titre": "Vapes are very affordable and customer…",
          "Contenu": "Vapes are very affordable and customer service calls you back in a timely manner to help with any issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T03:27:02.000Z",
          "Titre": "Fantastic price",
          "Contenu": "Fantastic price! Fast shipping! Great Binaries Cabin product! The only thing that could have earned a higher rating was it should have been in a box or a box inside the bubble envelope. A few of my product boxes were  damaged . Thank you! I will order again! ❤️"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JUDITH MILLS",
          "Nb_Reviews": 6,
          "Date": "2023-08-25T18:49:55.000Z",
          "Titre": "The shipping is really quick",
          "Contenu": "The shipping is really quick! I was a little surprised that I couldn't order any juices at all, including tobacco,  living in New Jersey."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Mims",
          "Nb_Reviews": 3,
          "Date": "2023-03-06T00:45:25.000Z",
          "Titre": "I've made several orders from…",
          "Contenu": "I've made several orders from ecigmafia. Every time I've been well pleased by the quality of the product and promptness it has been filled. The points program could use some revamping in my opinion. It is the only reason I didn't give five stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roxann",
          "Nb_Reviews": 4,
          "Date": "2023-03-08T23:48:38.000Z",
          "Titre": "Good service",
          "Contenu": "I love being able to have my orders delivered to my house, I live in the middle of nowhere so no close shops around here, it's also great that the cost of shipping has gone down."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracy C",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T17:33:26.000Z",
          "Titre": "Great company",
          "Contenu": "I've been using ecigmafia for a while now. The products are a great price with a wide selection.They are very efficient at getting the order shipped quickly.The only downside is that the shipping provider has changed recently and my order takes twice as long to arrive (about a week) be it I will still use them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peggy Roberts",
          "Nb_Reviews": 9,
          "Date": "2023-10-17T03:19:29.000Z",
          "Titre": "Great products and prices",
          "Contenu": "Very good products and service when you buy. Of course I was sent the wrong part again and it’s really a hassle returning product. That’s why I gave four stars because I know it’s going to be an issue…."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Stoddard",
          "Nb_Reviews": 2,
          "Date": "2023-07-09T19:54:50.000Z",
          "Titre": "Love Ecig Mafia’s selection",
          "Contenu": "Love Ecig Mafia’s selection. Very wide choice of good products. Prices are competitive. Great communication on my orders. One thing I did not like was I spent over a week looking at products adding them to my cart. Then one day they were all removed. Was not too happy with that. I originally had will over $300 in items in my cart. Plus a free give for a free charger. So I could not remember everything I had put in my cart. So I spent less then half of my original order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie  S.",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T21:13:08.000Z",
          "Titre": "ECigMafia offers great products at…",
          "Contenu": "ECigMafia offers great products at great prices. Although I did not like the shipping price I would definitely order again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Beck",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T17:02:21.000Z",
          "Titre": "All the boxes the products came in were…",
          "Contenu": "All the boxes the products came in were damaged in shipping although the bottles were fine and the wait time was just a bit too long. I kept getting emails that were too repetitive. Love the price and products I just feel the shipping costs was a bit too expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia Dumars",
          "Nb_Reviews": 8,
          "Date": "2023-08-16T13:52:36.000Z",
          "Titre": "Hello there",
          "Contenu": "Hello there, So I'll get straight to the point. Generally, my order is filled in a timely manner. The last couple times it took a little bit longer. Also,  I purchased batteries, for my vap mod that, unfortunately were not the right ones, that I use.. Don't know why it wasn't suggested to me before the purchase, as the smaller vab batteriesare all I have ever purchased from you.  However, I did reach out to try to trade them out, with the right ones. I just purchased the right ones, this month.  I tried to trade back to you for the right ones, in June I believe and no one responded. That's what made me mad.. I did do this before you guys switched the batteries out. You could see that they never came out of the package.  Not trying to scam you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ernest Teal",
          "Nb_Reviews": 3,
          "Date": "2023-07-16T03:23:09.000Z",
          "Titre": "Amazing products",
          "Contenu": "Amazing products, normally super fast shipping but this time it took forever to arrive. Otherwise would have been 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "barbara",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T01:19:33.000Z",
          "Titre": "The ordering process could be more…",
          "Contenu": "The ordering process could be more smooth.And I don't want things that I \"left in my cart\" added to my new order. It's so irritating to receive things I didn't want!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alyssa Chance",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T22:48:59.000Z",
          "Titre": "Great service promo needs fixed",
          "Contenu": "Service was great, but it said my product was buy one get one free and when I checked out it didn't automatically discount my 2nd vape and I couldn't find a promotion code for it so I just got one vape."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah harris",
          "Nb_Reviews": 4,
          "Date": "2023-06-09T22:59:17.000Z",
          "Titre": "Easy online shopping",
          "Contenu": "Easy online shopping.  Better buy than in retail.   The only reason I give a 4 is usually have a few that leak .  Probably manufacturing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Q Consumer",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T15:55:13.000Z",
          "Titre": "My main online vape store that I shop",
          "Contenu": "I have bought vape supplies from three different companies and this is my main online vape store that I shop. I have bought from them seven times over the last year. Have not had any issues with shipping times or products. I like that they have a rewards program and coupon codes. Shipping is probably the cheapest around. The only reason I do not give 5 stars, and this is NOT just Ecigmafia, it goes for all three of the online shops that I have ordered from...they will only post positive reviews on items. If you leave a bad review on an item it will not go up on the website. Not sure if this is the company or they are outsourcing their reviews to someone else but it's a very shady practice and should be illegal. I quit leaving reviews on products because what's the point? Customers are being mislead."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mollie Murphy",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T03:36:13.000Z",
          "Titre": "I have no complaints",
          "Contenu": "I have no complaints, the only thing I would change… I wish there was an option for faster shipping. Otherwise I LOVE ECIGMAFIA!!!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emily Cowart",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T16:13:43.000Z",
          "Titre": "Read the details",
          "Contenu": "Very fast got here with no issues. Absoluuy a better mod than I even thought I love i! I will absolutely rise ECMafia again for coils, batteries, juice etc"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Marley",
          "Nb_Reviews": 4,
          "Date": "2023-09-23T13:11:50.000Z",
          "Titre": "This is my go to vape store",
          "Contenu": "This is my go to vape store, however I received a vape that had a leak and I called but still haven't heard anything back 😞Otherwise would be 5 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mandy",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T22:47:50.000Z",
          "Titre": "The products were good quality",
          "Contenu": "The products were good quality, great priced, and quickly shipped. My only complaint is, I didn't receive one of my, \"bogo\" products. I've now come back as a returning customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim Finn",
          "Nb_Reviews": 5,
          "Date": "2023-03-30T00:50:23.000Z",
          "Titre": "My flavor was sold out!",
          "Contenu": "All has been well with all of my orders, with the exception of my last order, a flavor that I had picked was sold out. My issue was taken care of immediately. Thank you ECIGMAFIA!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lauren Stone",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T14:40:48.000Z",
          "Titre": "Great prices",
          "Contenu": "Great prices. Good quality products. Shipping could be faster. Overall, quite satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cnote3030",
          "Nb_Reviews": 4,
          "Date": "2023-06-18T23:50:10.000Z",
          "Titre": "My order was hijacked by the USPS and…",
          "Contenu": "My order was hijacked by the USPS and flown to Hawaii then came to me in CA and was missing half of the items. The USPS said sorry for the broken package, but we tried hard to not break it.  Not Ecigmafias fault I guess. They are making it all right after a bunch of emails. Back and forth. I think it could have been a little easier with customer support but in the end they are making it right."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina Vasquez",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T15:15:45.000Z",
          "Titre": "I like the prices of the vape but it…",
          "Contenu": "I like the prices of the vape but it took over a week of having a tracking number they said a date that you track didn’t show updates.. will order from them agagin.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lisa jefferson",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T08:39:18.000Z",
          "Titre": "Would have been a five but I got an…",
          "Contenu": "Would have been a five but I got an email alert that the part I was waiting for was back in stock and I tried to add it to my waiting cart and it still said out of stock.  Boo."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 3,
          "Date": "2023-06-08T23:09:40.000Z",
          "Titre": "Great price, easy ordering",
          "Contenu": "The price point is excellent, the selection was amazing. The checkout, and purchasing was extremely easy to navigate. The products arrived in a timely manner, and well packaged/protected. Will definitely be a return customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Jones jr",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T00:22:25.000Z",
          "Titre": "The 6k binaries taste soooooo good but…",
          "Contenu": "The 6k binaries taste soooooo good but runs out faster then the 6k but for the price, it's a def recommend. The Mosmo diamond 4k puffs was trash. One didn't work at all the other only every now and again it worked and tasted bad. No go!!! Fast shipping and pretty good prices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T14:08:59.000Z",
          "Titre": "Overall, recommended",
          "Contenu": "Prices are reasonable. Selection is better than average.  Order fulfillment could be faster, but shipping is faster than average to the West coast. Customer service is above average. Overall, I recommend ECM."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phaiphana Phraphilom",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T22:01:57.000Z",
          "Titre": "July 10th",
          "Contenu": "Just arrivedeverything looks great. It arrived really fast than I expected. But I'm missing one item, though. :("
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Woolsey",
          "Nb_Reviews": 3,
          "Date": "2023-10-07T05:40:22.000Z",
          "Titre": "Good service",
          "Contenu": "I had good efficient service with this company.Received my order very quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim LaCosse",
          "Nb_Reviews": 6,
          "Date": "2023-12-01T06:44:04.000Z",
          "Titre": "Good prices and quick shipping",
          "Contenu": "Good prices and quick shipping. Pretty good variety of products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Travis",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T22:21:48.000Z",
          "Titre": "It would have been nice to be informed…",
          "Contenu": "It would have been nice to be informed that you shipped my order incomplete. No coils in my order was not a nice surprise. Other than that, no complaints!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James P",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T19:06:41.000Z",
          "Titre": "I feel like the prices are decent but…",
          "Contenu": "I feel like the prices are decent but the item I like just happened to go up in price after my first order. I get it though...everything is going up. Will order again soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Anderson",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T16:22:39.000Z",
          "Titre": "The last few times I've ordered it has…",
          "Contenu": "The last few times I've ordered it has arrived within 3 days for at most this time it's taking a little over a week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leon",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:39:29.000Z",
          "Titre": "Thank you for selling RDA/RTAs!!!",
          "Contenu": "Absolutely loved ordering from ECigMafia.com! Literally the only place I could find that actually sells mesh RDAs that where available and I hope they never get rid of their stock in mesh RDAs because I know many people online and in my area that have been looking for them specifically. I'm a little bummed that the coils where out of stock but luckily the RTA had a few in the box. Fast shipping, great quality, and is my new official online site that I will be ordering from for now on. Thank you so much for actually having the rebuildable mesh set up. I hate that times are changing to sub ohm tanks so I appreciate companies that sell RDAs/RTAs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Savannah Tygart",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:54:48.000Z",
          "Titre": "Always quality products and the fastest…",
          "Contenu": "Always quality products and the fastest shipping online. Really helps me ordering from there since I'm immobile and terminal. Thank you guys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Tilley",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:07:23.000Z",
          "Titre": "I messed up my order and didn’t add the…",
          "Contenu": "I messed up my order and didn’t add the right BOGO product and they helped me get my order right within minutes and shipped it out within hours of ordering. I ordered on Friday and already got a notification it will be delivered tomorrow which is Monday. Thank you so much Ecig Mafia⭐️⭐️⭐️⭐️⭐️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Priscilla Ulloa",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:25:14.000Z",
          "Titre": "You really can't go wrong",
          "Contenu": "I was able to score a great deal with their Black Friday/cyber Monday sale. They shipped very quickly, none of the disposable vapes were damaged (different unrelated site had issues with this) so that was a relief. Products were as advertised!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spicy lamb nipple chops",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:55:18.000Z",
          "Titre": "Many different kinds too choose from",
          "Contenu": "Their selection of disposable vapes was pretty impressive, page was fairly easy to navigate, and they actually had the brand I use. Will use again for sure"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Team Extreme",
          "Nb_Reviews": 23,
          "Date": "2023-12-18T23:38:10.000Z",
          "Titre": "Quality Service.",
          "Contenu": "Quality Service.If you’re looking for a new store you can not go wrong.Excellent service, dependable shipping and good products to choose from."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathaniel Harris",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:41:21.000Z",
          "Titre": "Easy and Reliable",
          "Contenu": "Website is informative and products on sale and kinds of products are easy to order. So is making checkout."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 21,
          "Date": "2023-12-19T00:22:07.000Z",
          "Titre": "Very reliable company",
          "Contenu": "All my experiences with this company have been outstanding.  Have used them for years. Recommend for every vaper out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Mayfield",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T04:51:35.000Z",
          "Titre": "Perfect!",
          "Contenu": "Perfect!It always is, and any little problem, is always above and beyond made right.There is no better service than your team provides, consistently. Much appreciation for all that you do, and for another pleasant transaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer  Heath",
          "Nb_Reviews": 11,
          "Date": "2023-12-18T17:47:24.000Z",
          "Titre": "Fast and reliable service~",
          "Contenu": "Ecigmafia is so quick at putting your order together and getting it shipped. Everything I order from them is quality products. Thanks ECM!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JR",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T04:31:56.000Z",
          "Titre": "First Order Was Odd. But...",
          "Contenu": "The first experience was a little off, but I don't think it was on ECigMafia's part, but USPS, but I decided to place a second order with them, and the service is just fantastic. It's very fast and reliable, and customer support is top notch! They have unbeatable deals, I think I have found my new online vape shop!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Parnell",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T17:34:34.000Z",
          "Titre": "I love the prices and the buy one get…",
          "Contenu": "I love the prices and the buy one get one free selection is great. I don't think I would have bought as many of my devices as I have if it weren't for the buy one get one free. Every time I get a buy one get one free I give one to my mom. This is a great place to get your e-cigarette supplies?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Flaw'd",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T03:09:52.000Z",
          "Titre": "Great Place for Vape Products",
          "Contenu": "Prices are good.  Shipping is good.  Options for juice and coils are good.  My recommendation to buy anything vape-related."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stetty Cass",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T08:46:47.000Z",
          "Titre": "Swift shipping great deals almost…",
          "Contenu": "Swift shipping great deals almost sketchy they are so cheap compared to other places all other places but I’m happy with my vape a little nervous about if it’s legit but I used the scan qr and seemed legit"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denice Brown",
          "Nb_Reviews": 7,
          "Date": "2023-12-19T06:15:30.000Z",
          "Titre": "Always really good!",
          "Contenu": "Out of all my purchases, I can honestly say that I have never had any problems... Shipping is fast, the products are right on point....and the prices are great! Keep up the awesome job you are doing!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T01:39:19.000Z",
          "Titre": "Great Place Best Deals",
          "Contenu": "Your response is always so fast. The product is always good quality. I don't order from anyone else anymore plus your prices are always fair."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kat Tastrophe",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T00:57:07.000Z",
          "Titre": "I'll definitely be ordering again.",
          "Contenu": "This order was also a buy for someone else, the site is easy to navigate within, ordering is super easy and great deals. I'll be back for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Martin",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:24:57.000Z",
          "Titre": "Only place I order from anymore",
          "Contenu": "Only place I order from anymore. Great prices, fast shipping, frequent sales, and the stuff I like is always in stock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Breanna Arrowsmith",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:12:11.000Z",
          "Titre": "Can't beat the prices",
          "Contenu": "First of all the great prices and wide variety caught my eye and I had a smooth experience as a first time buyer.  I plan to make this my go-to store for my vape essentials and highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer K.",
          "Nb_Reviews": 17,
          "Date": "2023-12-11T19:26:32.000Z",
          "Titre": "ECM really cares about their customers",
          "Contenu": "ECM really cares about their customers, and I trust them.  They go over and above for customer satisfaction and value the people they serve.  They strive to keep prices as low as possible and do not practice price gouging.  Consistently, 100% of the time, my orders have arrived with the correct products and have arrived quickly.  I am thankful that they are such good people and value their customers so much.  As another reviewer mentioned, I have also found that where ECM shines the most is their customer service and the value they place on customer satisfaction.  I have had nothing but great experiences when ordering from ECM.  They are simply the best in the business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candace Whitaker",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T20:28:49.000Z",
          "Titre": "The ONLY place I will order from",
          "Contenu": "The ONLY place I will order from. Fast shipping, great prices, excellent CS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christy Biersteker",
          "Nb_Reviews": 8,
          "Date": "2023-12-17T12:39:09.000Z",
          "Titre": "Another great review",
          "Contenu": "As always my order arrived on time and so far there has been no issues with anything ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theodore May",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T19:40:30.000Z",
          "Titre": "I tried 3 other sites before I found…",
          "Contenu": "I tried 3 other sites before I found you....One site took 35 days to deliver ..ughYou are Far and Away the Best siteGreat selection, prices, delivery and Customer Service !!I have told my Friends..I look forward to continuing doing Business with you..Happy Holidays !!!!Theodore"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:52:58.000Z",
          "Titre": "Ordering was easy",
          "Contenu": "Ordering was easy, great products at great prices and shipment was very fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith  Schmidt",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T19:48:48.000Z",
          "Titre": "My preferred online provider!",
          "Contenu": "Guys are always awesome and have the best prices! However unfortunately I had to place my monthly order from a different site because you were out of stock :-( The other site fortunately had BOGO so the price was almost the same. However the other site's shipping is terrible ordered over a week ago and still not here. Mafia's shipment would have been here Thursday. Also the other site's tracking is all through \"Route\" which I hate because I have no idea where my package is even at. Hopefully next month you have more stock!Thank you for all you do you guys are awesome!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Broken Bricks",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:11:25.000Z",
          "Titre": "Shipping time was as expected",
          "Contenu": "Shipping time was as expected. I ordered 3 tobacco disposable vapes to see what I liked best and all 3 were buy one get one free."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kat Tastrophe",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T00:53:52.000Z",
          "Titre": "This purchase was a gift for my son.",
          "Contenu": "This purchase was a gift for my son, he was so excited, the delivery was fast and ordering was easy, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Ford",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T20:01:37.000Z",
          "Titre": "My first time ordering from this…",
          "Contenu": "My first time ordering from this company. 5 stars plus all of the way. I will be ordering again. Perfect transaction from start to finish"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ricky starcher",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T19:40:04.000Z",
          "Titre": "The delivery was fast....",
          "Contenu": "The delivery was fast especially because it is around Christmas time and the mail is messed up. But it came within 2 days. And that is why this is my 3rd order from Ecig Mafia. I will continue to get my products from here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kintz",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:04:24.000Z",
          "Titre": "3rd order from ecigmafia",
          "Contenu": "3rd order from ecigmafia. Not one issue. Price unmatched. Fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherri Pearson",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:35:33.000Z",
          "Titre": "Great company... ECigMafia",
          "Contenu": "Love ordering from ECigMafia! The prices are great, the orders are shipped promptly and they come packaged securely!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gorgoro",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:56:18.000Z",
          "Titre": "Great for the most part",
          "Contenu": "I have to admit I have gotten one bad delivery but it wasn't that bad because it was the buy one, Get one free so technically I didn't pay for it. But everything else that I've ever gotten from wax vaporizers to actual nicotine vapes all have been great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie Benjamin",
          "Nb_Reviews": 12,
          "Date": "2023-12-14T03:44:05.000Z",
          "Titre": "Always has been a good experience!",
          "Contenu": "Always has been a good experience for me with Ecig Mafia. Can’t beat their great prices and quick shipping time. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kerri Gorman",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T07:17:41.000Z",
          "Titre": "I absolutely love this place!",
          "Contenu": "I absolutely love this place!! You have an amazingly huge selection, and you always have great deals! My favorite being bogo... I can get 2 vapes for cheaper than I can get one at the corner store. And the quality is always top shelf, the very best!! Thank you for offering such a good deal I'd be a fool to pass it up!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yvonne",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:17:46.000Z",
          "Titre": "Simple to order",
          "Contenu": "Simple to order. Product is good, just wish there were more flavors. I will make future purchases. A couple of the boxes appeared to have juice spilled on them that caused them to be torn on the bottoms, but that won’t stop me from purchasing again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Klein",
          "Nb_Reviews": 8,
          "Date": "2023-12-13T06:03:08.000Z",
          "Titre": "The Milk Line is so incredibly",
          "Contenu": "The Milk Line is so incredibly. Especially the strawberry. It definitely reminds me of that strawberry nesquik. You gotta try it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MB",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:03:40.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping. A rare experience with products like this these days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:28:22.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! Their black Friday sales were awesome! They only ship to the address associated with your payment card but if that works for you, I recommend EcigMafia. Quick shipping. One juice item leaked in the package."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "fred Wolfstar-Lenhart",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T06:15:05.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Excellent Service, Always. Now, while I will not allow it to deter my overall rating; many a time(s), a given product(s) are out of stock, but... oh well, and I am not always happy with your no return policy beyond 30 days, i.e. when a product leaks, but... again, oh well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessi House",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T03:15:43.000Z",
          "Titre": "Great products… super quick shipping! This will be the only place I shop now",
          "Contenu": "Great products!! SUPER quick shipping. Accurate!! Will be shipping here from now on!! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bigboyzback",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T02:17:20.000Z",
          "Titre": "well the order filling and the shipping…",
          "Contenu": "well the order filling and the shipping were super fast and correct...I will keep buying from them most certainly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shandi",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T06:26:50.000Z",
          "Titre": "I always get my orders quickly",
          "Contenu": "I always get my orders quickly, and have never had a problem with my orders."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ştēphēຖ ຟithคr໐Şē",
          "Nb_Reviews": 10,
          "Date": "2023-12-07T05:47:50.000Z",
          "Titre": "BEST IN THE JUICE BUSINESS HANDS DOWN",
          "Contenu": "I am a veteran as far as ordering vape juice online is concerned. Been around since it first became a thing. This is currently thee best juice store online. And the have some good hardware stuff too. If you buy a lot of juice from here it just makes sense to get some hardware too because they will have the coils and other gear you will need for your particular setup if you bought the setup here. NOBODY has cheaper shipping or prices. Their selection could always use more but who's couldn't? One thing I notice is because of this their juice is almost always fresh which is another real big problem of many juice stores. A lot of stores sold out to the gov pressures that came with the Priority Mail price hikes and passed the tax onto the vapers but honestly these guys are one of the only ones who didn't. BEST IN THE BUSINESS HANDS DOWN."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "austin",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:04:55.000Z",
          "Titre": "Return",
          "Contenu": "They were quick to respond and very understanding of my situation!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trina Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T02:10:25.000Z",
          "Titre": "ECigMafia is LITTT",
          "Contenu": "ECigMafia is LITTT! I always have great experiences, consistently. I order multiple disposables from them on a regular. No one can compete with the Buy 1, Get 1 deal. Period. Not to mention, the shipping is easy. I don't always like paying the $7.99 for it, but I can depend on my purchases getting to me, intact and in a timely manner. And if it doesn't, no worries, that's what the insurance is for. I put so many people on to them, and they all love me for it. 5 beautiful stars. Yee!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pattiann Lins",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T23:30:24.000Z",
          "Titre": "I received the wrong package",
          "Contenu": "I received the wrong package. But the company came through and remedied the situation in one day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jess Longfellow",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T12:59:35.000Z",
          "Titre": "Best place to buy vaping equipment and juice!",
          "Contenu": "Always had the best experience when I use ECigMafia. Super fast, always the correct items and great quality items. As long as they are around, I won't use any other site!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Lynn",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T20:55:11.000Z",
          "Titre": "First Order",
          "Contenu": "Always a bit nervous to order from somehere online for the first time...Amazingly the shipping was SUPER fast and they have great prices! What's not to love? So glad I stumbled upon this site. It'll be my new go to, since the last site I was ordering from took over a week to even start the shipping process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ralph Mullins",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T22:49:36.000Z",
          "Titre": "I always get my order within a few days…",
          "Contenu": "I always get my order within a few days of ordering. and usually get discounts as well..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian  Reno",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T12:02:05.000Z",
          "Titre": "I am absolutely thrilled with my…",
          "Contenu": "I am absolutely thrilled with my experience with this company. From start to finish, their professionalism and attention to detail were outstanding. The team went above and beyond to ensure my satisfaction, and the end result exceeded my expectations. I highly recommend them and happily give them 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 8,
          "Date": "2023-12-09T16:17:12.000Z",
          "Titre": "ECigMafia is my go to for juice and everything else",
          "Contenu": "ECigMafia is my go to for juice, and hardware.  Great prices, fast shipping, and excellent customer service.  One stop shopping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:03:48.000Z",
          "Titre": "First time ordering",
          "Contenu": "First time ordering. Ordered a lot, everything looks good. Will order from again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:49:49.000Z",
          "Titre": "I like how they carry the products me…",
          "Contenu": "I like how they carry the products me and my wife enjoy. I appreciate the low prices they offer with  free shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Althea F.",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T11:14:53.000Z",
          "Titre": "Very quick shipping and delivery",
          "Contenu": "Very quick shipping and delivery. Products in perfect condition upon arrival."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Wells",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T01:39:37.000Z",
          "Titre": "Fast, no hassle delivery",
          "Contenu": "Four days after placing my order, it arrived via USPS. It's easy and not expensive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanna",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T02:35:09.000Z",
          "Titre": "The company was great to work with even…",
          "Contenu": "The company was great to work with even when I made a mistake on my order. They were quick to fix it and got me my order fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shell",
          "Nb_Reviews": 5,
          "Date": "2023-12-10T03:29:21.000Z",
          "Titre": "Great selection, great prices!",
          "Contenu": "Great selection, super great prices!!! Have been ordering from them for quite awhile now & will continue to!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia  Johnson",
          "Nb_Reviews": 6,
          "Date": "2023-12-06T19:03:45.000Z",
          "Titre": "Their service is fast and reliable they…",
          "Contenu": "Their service is fast and reliable they always have a huge selection of products and they have great coupon deals ALWAYS! It is definitely my only choice to buy all my products from."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T05:22:28.000Z",
          "Titre": "EcigMafia is The Best!",
          "Contenu": "EcigMafia is the best out there. THE BEST! I've been buying from them for a few years now, probably longer. Best prices, best shipping method, best product, best selection. Remember when the USPS started that ruckus about shipping e-cig products? Some other shops were sending your order by courier, requiring signature. Yes, requiring signature! What? Honestly, who stays home and waits for a package these days?I started out buying e-juices and coils. I pretty much buy everything here now. My e-juice was out of stock for a long, long, time. But in all fairness, everyone else was out of it too. But it's back now! No! I will not share it with you! Then everyone will buy it and it will go out of stock again!! Just kidding 😂 Vapetasia Killer Kustard. It's like a dessert, but not too overwhelmingly sweet. (I don't get out much!)Oh, and coupons! We love the coupons!Keep on doing what you're doing EcigMafia. You're like a well oiled machine. And very, very, appreciated. Thank you!Wishing You & Yours a Beautiful and Blessed Holiday Season ❤️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy Gil",
          "Nb_Reviews": 8,
          "Date": "2023-12-09T22:36:42.000Z",
          "Titre": "Fast delivery!",
          "Contenu": "I've been ordering through ECigMafia for about a year now. Every order is perfect and gets to me FAST!  This time in 2 days. I love this company and would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Veronica Christner",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T14:42:05.000Z",
          "Titre": "I like the fact that I don’t have to…",
          "Contenu": "I like the fact that I don’t have to wait weeks before I receive my product. It only takes a few days.?I love the fact that so far I’m receiving excellent quality also"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Team Extreme",
          "Nb_Reviews": 23,
          "Date": "2023-12-05T02:48:55.000Z",
          "Titre": "Quality service.",
          "Contenu": "Quality service.Always receive my order in a timely fashion.Within the same week of ordering.Great prices and always have specials going on. My go to store on the east coast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "nichole Buckman",
          "Nb_Reviews": 8,
          "Date": "2023-12-10T06:06:14.000Z",
          "Titre": "as always I got a great deal on horizon…",
          "Contenu": "as always I got a great deal on horizon binaries 6k vapes, and they came exactly when the email said."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Ebeling",
          "Nb_Reviews": 8,
          "Date": "2023-12-08T13:15:28.000Z",
          "Titre": "Ecigmafia Is great !!",
          "Contenu": "Always buy my vapes every month from Ecigmafia over the past 5 years . Spend between $70-$120 and they deliver in 3-4 days almost every time They have best prices and good service. Nice I havnt had a problem yet. Merry Christmas"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Halsne",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T20:52:12.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery, that is why Ecig Mafia is my first and only choice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "braindebugg",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T16:35:25.000Z",
          "Titre": "Quickest Shipping",
          "Contenu": "This is my go-to company for my vaping needs. They have the quickest handling/shipping time in the industry!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:32:25.000Z",
          "Titre": "Overall good",
          "Contenu": "Ordered Monday, got it Friday. Affordable, legit, and safe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy  Roach",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T00:00:52.000Z",
          "Titre": "Vapes taste great delivery got here…",
          "Contenu": "Vapes taste great delivery got here thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MaryAnn  Denning",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:25:19.000Z",
          "Titre": "Delivered in a reasonable time",
          "Contenu": "Delivered in a reasonable time, happy with the  products. I would definitely give it  5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Hartigan",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T19:37:06.000Z",
          "Titre": "My order was accurate",
          "Contenu": "My order was accurate, shipping was prompt and items were of great quality. Very happy with ecigs products & service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda shaw",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T21:48:02.000Z",
          "Titre": "Love the flavors I have tried and the…",
          "Contenu": "Love the flavors I have tried and the prices are amazing can't beat it for the price . I order a lot n I'm very pleased"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanessa J.",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T21:56:45.000Z",
          "Titre": "Prices are great and delivery is just…",
          "Contenu": "Prices are great and delivery is just as promised.  I have ordered a few time now and each time didn't disappoint."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura ogary",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:29:11.000Z",
          "Titre": "Super fast shipping and awesome…",
          "Contenu": "Super fast shipping and awesome products!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Mathis",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:58:43.000Z",
          "Titre": "Everything I'm looking for great prices…",
          "Contenu": "Everything I'm looking for great prices fast shipping will keep doing business with ecigMafia"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T04:38:28.000Z",
          "Titre": "Best online vape store.",
          "Contenu": "This is like a toy store and candy shop for grown ups. Best vape store online. Great prices and fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanna",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T05:19:24.000Z",
          "Titre": "Great prices and selection",
          "Contenu": "Great prices and selection.  Easy ordering process with delivery within a week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "roxanne king",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:41:49.000Z",
          "Titre": "Love ecigmafia shopping on line !!!!!!!!!!!!!!!",
          "Contenu": "Love ecigmafia shopping on line. A lot to choose from great sales and delivery is quick and easy !!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SUSAN",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T20:40:28.000Z",
          "Titre": "Great company",
          "Contenu": "Great company. Fast shipping. I will definitely order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "nichole Buckman",
          "Nb_Reviews": 8,
          "Date": "2023-12-10T06:04:52.000Z",
          "Titre": "the order was a great deal with horizon…",
          "Contenu": "the order was a great deal with horizon binaries 6k BOGO, they arrived quickly, and I was informed the entire time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom A. Pritchard",
          "Nb_Reviews": 9,
          "Date": "2023-12-21T17:23:01.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, extra fast. Great prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T12:20:37.000Z",
          "Titre": "Love my disposable VAPES",
          "Contenu": "Love my disposable VAPES. I'm on my second order of the CoolPlay juicy peach (my fave) and will be ordering a couple more very soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jayne  Granlund",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T19:40:59.000Z",
          "Titre": "They are prompt with customer service…",
          "Contenu": "They are prompt with customer service issues, easy to get ahold off, and fair in their resolution. I appreciated it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:04:59.000Z",
          "Titre": "Fast AF Shipping!",
          "Contenu": "Fast AF Shipping!Used to online ecig retailers taking weeks and weeks, had my order within a week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Lundin",
          "Nb_Reviews": 13,
          "Date": "2023-12-15T17:17:34.000Z",
          "Titre": "Always have a great selection",
          "Contenu": "Always have a great selection, great price and fast shipping!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Courtney R",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:05:35.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer service. Quick to send a replacement for a lost package. Will definitely be a returning customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa Westbrook",
          "Nb_Reviews": 22,
          "Date": "2023-12-09T06:14:50.000Z",
          "Titre": "As always easy to find…",
          "Contenu": "As always easy to find categories as to what I want. Plenty of sales and a good variety of flavors and vapes. The awesome prices are a big plus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mrlof",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T22:41:24.000Z",
          "Titre": "Great service and super fast shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Matthews",
          "Nb_Reviews": 8,
          "Date": "2023-12-13T09:33:00.000Z",
          "Titre": "Best online store",
          "Contenu": "Lowest prices on liquid anywhere.  Easy to navigate website.  Fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Prince",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:14:34.000Z",
          "Titre": "The prices and BOGO offers r the best",
          "Contenu": "The prices and BOGO offers r the best! Here n town they charge $19.99 for 1 and $37.99 for 2. After I've bought my vapes 4 the month thru u, my average per vape is between $6.50-$8.50 each...4 the same ones they sell locally!! I've told many people about this company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cara Primeaux",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:09:29.000Z",
          "Titre": "Quality Assurance",
          "Contenu": "I order on a tuesday and it was here by saturday!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mildred Simmons",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T03:05:21.000Z",
          "Titre": "You’re the best!!",
          "Contenu": "Customer service, quality products, awesome prices!! You can’t be beat!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gilbert Longoria",
          "Nb_Reviews": 17,
          "Date": "2023-12-10T21:58:49.000Z",
          "Titre": "Very easy website to navigate",
          "Contenu": "Very easy website to navigate. Good pricing. Fast shipping. Great selection."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Mumm",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:54:31.000Z",
          "Titre": "I feel like I've tried every online…",
          "Contenu": "I feel like I've tried every online vape store known to man, and ECigMafia is by far the best. Great products at great prices, and fast shipping. What's not to love?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kellie  Walsh",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:09:52.000Z",
          "Titre": "They were very fast at helping me with…",
          "Contenu": "They were very fast at helping me with any questions I had.  The product was package very well and shipped very promptly.   It took USPS a few days to get it to me but no fault of your business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawna Padgett",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T18:30:53.000Z",
          "Titre": "Fast service and good selection of…",
          "Contenu": "Fast service and good selection of products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A.",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T13:23:56.000Z",
          "Titre": "Fast shipping and great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica DeSilva",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:21:33.000Z",
          "Titre": "Products came quickly and are exactly…",
          "Contenu": "Products came quickly and are exactly what was described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T03:05:27.000Z",
          "Titre": "Disposable Vape",
          "Contenu": "Awesome flavor.  Awesome price Fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelly",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T21:47:48.000Z",
          "Titre": "Everything I ordered arrived right on…",
          "Contenu": "Everything I ordered arrived right on time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly Everhart",
          "Nb_Reviews": 9,
          "Date": "2023-12-11T16:07:00.000Z",
          "Titre": "Thank You",
          "Contenu": "Easy to maneuver through site. Love the flavors offering."
        }
      ]
    }
  ]
}