{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "elreydelsoftware.com",
      "Review": [
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sebastian Pino",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:42:40.000Z",
          "Titre": "The team was more than helpful!!",
          "Contenu": "The team was more than helpful! Will never go directly with Microsoft. El Rey Del Software was very transparent, supportive and responded to my questions in no time. Very pleased with the service and products! See you next time and will definitely recommend you guys to my partners and clients."
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Matias Denti",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T21:33:50.000Z",
          "Titre": "I recently purchased a Windows license…",
          "Contenu": "I recently purchased a Windows license from \"El Rey del Software,\" and I couldn't be more satisfied with the experience. From start to finish, this has been an exceptional purchase.The license was not only affordable but also incredibly easy to obtain. The ordering process was straightforward, and I received the license key promptly. The installation was seamless, and I had my Windows operating system up and running in no time.What truly sets El Rey del Software apart is their excellent customer service. I had a few questions during the purchase process, and their support team was quick to respond and very helpful. This level of support made the entire experience stress-free.Furthermore, the license key itself has been working flawlessly, and I've had no issues with activation or updates. It's clear that El Rey del Software provides legitimate, reliable licenses.I highly recommend \"El Rey del Software\" to anyone in need of Windows licenses. They offer quality products, exceptional service, and a hassle-free experience. I couldn't be happier with my purchase, and I will definitely return for any future software needs.Thank you, El Rey del Software, for a top-notch experience!"
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Guido Bessi",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T18:05:24.000Z",
          "Titre": "\"Compre una licencia de Windows 10 PRO…",
          "Contenu": "\"Compre una licencia de Windows 10 PRO para activar mi computadora que lo trajo instalado. Recibi la licencia al instante por mail y con ella active Windows. Todo facil y en menos de 5 minutos\""
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Sergio Torres",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T01:38:04.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience downloading the SW I needed, the cost was excellent."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Juan Perez",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T21:45:55.000Z",
          "Titre": "Best price in the market and great…",
          "Contenu": "Best price in the market and great service, the licenses are 100% original and recived them immediately after my purchase"
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Mariano",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T23:46:35.000Z",
          "Titre": "Compre Windows 10 pro para activar mi…",
          "Contenu": "Compre Windows 10 pro para activar mi maquina todo Perfecto"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Ivan Alberto Camporredondo Val",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T18:30:17.000Z",
          "Titre": "Facil Compra y manual de instalacion…",
          "Contenu": "Facil Compra y manual de instalacion facil de entender"
        }
      ]
    }
  ]
}