{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "encoredataproducts.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Judith Gotcher",
          "Nb_Reviews": 2,
          "Date": "2022-07-16T14:49:13.000Z",
          "Titre": "This is the fourth year I have ordered…",
          "Contenu": "This is the fourth year I have ordered from Encore. The items arrive fast and their products are good."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nathan Fraser",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T23:35:39.000Z",
          "Titre": "Long Order Delay",
          "Contenu": "I ordered a headset microphone which said it would take five to six days to arrive, it has since been 10 days of waiting with no word or heads-up of any delay or change."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deneen Hughes",
          "Nb_Reviews": 2,
          "Date": "2021-06-29T14:52:36.000Z",
          "Titre": "I received the headsets with mic within…",
          "Contenu": "Update: Within 30 minutes of writing my original review, I received a call from the company letting me know that I should receive my refund shortly. I never asked for a refund but it hit my bank account this morning, less than 24-hours from the time they sent it! I asked if they wanted me to return the defective product, was told no need to return it. I am TRULY IMPRESSED with the level of customer service and  effort to make my customer experience better. I will buy from Encore Data in the future. Hopefully this was a one off. Everyone deserves a second chance, especially when they do right by you!I received the headsets with mic within the time that was promised but after only a few days, they stopped working. People can not hear me when I speak into the mic. VERY DISSATISFIED with this product. I knew because of the price point that they were bottom of the line in quality. However, I did expect more than a week out them!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Family YMCA of Lancaster & Fairfield Coun",
          "Nb_Reviews": 1,
          "Date": "2018-03-05T20:05:25.000Z",
          "Titre": "Was told product was in stock and…",
          "Contenu": "Was told product was in stock and shipped then received another email later stating that product was not in stock.  Asked for what they had to be shipped and still didn't arrive in a timely matter.  In fact I received 3 different UPS shipments on 3 different days.  I ordered 6 rolls on antibacterial wipes and 6 dispensing plastic buckets."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-26T16:39:30.000Z",
          "Titre": "They sound terrible",
          "Contenu": "They sound terrible. Thank goodness they're inexpensive. Sorry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Smov, Ashley",
          "Nb_Reviews": 1,
          "Date": "2018-12-18T23:22:45.000Z",
          "Titre": "I ordered headphones and it took 2…",
          "Contenu": "I ordered headphones and it took 2 weeks to get them in the mail"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "james hepfer",
          "Nb_Reviews": 1,
          "Date": "2022-04-02T20:40:57.000Z",
          "Titre": "i am repairing a headset",
          "Contenu": "i am repairing a headset that has probably been used 10 to 15 times,  the plug end has an intermittent connection and the earpiece end has the outside casing broke at the strain relief that is too short   (model ha-2 )"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jackie",
          "Nb_Reviews": 1,
          "Date": "2017-04-19T14:13:41.000Z",
          "Titre": "Not quite what I expected",
          "Contenu": "I understand that what I purchased were disposable earbuds, but the wiring is so thin.  Some of my students went to put them in and one side of the earbuds just came apart.  It is pulled right out of the plastic and the wire was hard to see.  So far my classroom of 27 students has encountered three pairs that have broken or pulled apart just as we were getting ready to use them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "WYCLIFFE ASSOCIATES",
          "Nb_Reviews": 1,
          "Date": "2019-03-19T22:57:18.000Z",
          "Titre": "Poor customer service / poor products",
          "Contenu": "Poor customer service, Poor Shipping, They shipped the wrong product and stuck me with the shipping charges. Provided no Return order or return shipping label to return the wrong product I was shipped. They did cover the cost of the replacement product I was shipped. But then it did not perform as expected. The mic on the headset picked up the background noise better than the voice of the person speaking into the mic. It was supposed to be a directional mic. I have Omnidirectional mics that pick up less background noise."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valley Springs School District",
          "Nb_Reviews": 1,
          "Date": "2018-01-12T16:00:30.000Z",
          "Titre": "Quality of the product was poor and …",
          "Contenu": "Quality of the product was poor and when I needed to send them back for replacement I was responsible for the return shipping.  The replacement products were not sent in a timely manner either."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Studerus, Theodore",
          "Nb_Reviews": 1,
          "Date": "2017-04-05T01:58:49.000Z",
          "Titre": "I ordered 5 mono earplugs last year and …",
          "Contenu": "I ordered 5 mono earplugs last year and the sound was good.  I ordered 5 more this year but the sound is terrible!  It sounds like I'm listening to sounds in a tunnel."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zach Carie",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T20:54:14.000Z",
          "Titre": "Overnight shipping is a $79.99…",
          "Contenu": "Overnight shipping is a $79.99 \"estimate\", I was contacted after purchase to pay another 20.00 because Saturday delivery wasn't a thing--- I'm still confused by this, and I've never had it happen with any other company. Other than that, it was a decent experience, prices were amazing-- customer service was nice."
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "Ameer Hamza",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T21:35:03.000Z",
          "Titre": "All is well",
          "Contenu": "Leave out links and personal  info like names"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-25T20:14:54.000Z",
          "Titre": "There should not be a restocking fee…",
          "Contenu": "There should not be a restocking fee nor should the customer be charged for shipping for items being exchanged. We'd be more inclined to purchase from the company if there wasn't a hassle for exchanges.To update my review, we had to pay our return shipping costs when other companies are happy to cover it, especially for exchanges."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WH",
          "Nb_Reviews": 1,
          "Date": "2019-10-31T18:35:26.000Z",
          "Titre": "Cheapest headphones",
          "Contenu": "I bought a lot of the cheapest headphones for our new hire training classes. I expected low quality and for some not to work. But about half only work on one side. I get the same or better results from buying the cheapest earbuds at a dollar tree. You get what you pay for. Service was fine, but this particular brand of headphones will not be purchased again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elementary Teacher in Indianapolis",
          "Nb_Reviews": 3,
          "Date": "2018-05-09T12:37:35.000Z",
          "Titre": "better experience with first purchase",
          "Contenu": "I am a first grade teacher who needed to provide headphones for my class. I bought headphones that were $2.99 each. These lasted about half the year. I then bought more expensive ones that were $4.99 each. These were worse! Some did not work right out of the package! I am debating on the time I have to send them back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joanna",
          "Nb_Reviews": 1,
          "Date": "2017-02-20T18:35:31.000Z",
          "Titre": "Paid extra for shipping......shouldnt have.",
          "Contenu": "I paid extra to get my product in 2-3 days.  I needed it for a work function.  I got my product on day 5.  I literally hit 'send' on my email inquiry as the delivery person was coming into my office.  I think I should get that extra fee reimbursed back.  Now I see I have to go through a bit a paper work.  That simply isn't right.  I am going to guess that most busy people, like myself, might not pursue this but I sure will.  That is poor customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Garrison, Gary",
          "Nb_Reviews": 1,
          "Date": "2017-02-08T04:49:42.000Z",
          "Titre": "Decent Headphones for the Price",
          "Contenu": "I wanted to replace a set of RadioShack lightweight headphones that were easy to store in a wide plastic bag in my backpack and most of all was one-sided (only 1 wire). RadioShack doesn't sell this model anymore and I couldn't find a set that fit this description in stores. The sound quality is good but I do hear a little noise when the plug turns in the jack. I would also rather have a thinner cable that is more flexible and is easier to place inside the bag."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "2nd Grade Teacher",
          "Nb_Reviews": 1,
          "Date": "2018-03-02T22:02:19.000Z",
          "Titre": "We use these headphones in the…",
          "Contenu": "We use these headphones in the classroom with our Chromebooks. The wire near the jack is a little weak and a few have shown wear after a few days of use. Thee earpads are also not as secure as necessary for constant use with children. The quality is very good and for the price, this was a good purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "San Jose State University",
          "Nb_Reviews": 1,
          "Date": "2016-11-24T02:43:11.000Z",
          "Titre": "Good products but shipping issues",
          "Contenu": "The headphones arrived quickly which was great. However, at my organization, they were sent to the wrong department or person and not to me, which led to a lot of trouble with me trying to find the package in time for me to run my experiments.One of the headphones broke after being used for two days..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pinewood Elementary",
          "Nb_Reviews": 1,
          "Date": "2017-11-02T19:22:41.000Z",
          "Titre": "I only order the items",
          "Contenu": "I only order the items, so I can't rate them. I haven't had any complaints so that is a good thing. Working with Encore was good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2016-09-01T00:39:11.000Z",
          "Titre": "Not the greatest quality",
          "Contenu": "I ordered 100 pairs and received them on time with no complications. After only 2 weeks a couple pairs have broken already."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "New Castle Public Library-PA",
          "Nb_Reviews": 4,
          "Date": "2019-12-04T13:11:20.000Z",
          "Titre": "I had always had a good relationship…",
          "Contenu": "I had always had a good relationship with Jules and that has seemed to evaporate with the new sales department."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jung, Jason",
          "Nb_Reviews": 1,
          "Date": "2016-09-01T21:51:10.000Z",
          "Titre": "Headphones",
          "Contenu": "The products are cheap and look okay.The sponge contacting ears feels like coarse.The wire is not strong."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Redding Elementary School Dist.",
          "Nb_Reviews": 2,
          "Date": "2017-04-18T23:11:03.000Z",
          "Titre": "The headphones were a bit cheaper …",
          "Contenu": "The headphones were a bit cheaper quality than I was hoping for.  A few of them did not work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "City of Salinas Library",
          "Nb_Reviews": 1,
          "Date": "2017-01-23T19:07:11.000Z",
          "Titre": "Earbuds",
          "Contenu": "Good wholesale price. But the shipment was delayed several times."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "mike jhonson",
          "Nb_Reviews": 1,
          "Date": "2021-01-26T12:01:16.000Z",
          "Titre": "they are providing good products but…",
          "Contenu": "they are providing good products but they too expensive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AGG",
          "Nb_Reviews": 1,
          "Date": "2018-10-18T00:13:09.000Z",
          "Titre": "Headphone bag",
          "Contenu": "Baggies are very sturdy but alittle too small."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elias Ruelas",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T23:43:00.000Z",
          "Titre": "the cord of the headphones is too short"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward Espinoza",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T22:49:29.000Z",
          "Titre": "Caitlyn's help",
          "Contenu": "Caitlyn's help with our tax exempt status."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LaShawndria White",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T17:20:49.000Z",
          "Titre": "Problem solved",
          "Contenu": "I absolutely love my headset!! At first I couldn’t get my mic and headset to work together but a quick response from Caitlyn about an adapter for my headset solved everything!!! I am ready to work in my home office privately and professionally thanks to Encore Data Products😁thanks guys!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benedita Lourenço",
          "Nb_Reviews": 29,
          "Date": "2021-10-28T03:36:41.000Z",
          "Titre": "The customer service is accommodating",
          "Contenu": "The customer service is accommodating. Products are of nice quality and delivered in very good shape. Shipped quickly than I anticipated. Thank you. I will order again soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christy White",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T19:54:10.000Z",
          "Titre": "Headphone Order",
          "Contenu": "Helpful, fast, easy.  The only issue is that only 25 have arrived so far.  It is just weird that they didn't arrive all together."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee Amon",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T09:42:38.000Z",
          "Titre": "The headsets are OK",
          "Contenu": "The headsets are OK -  would like a longer pin, does not work with my phone when case is on, have to take case off to use headphones"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-23T22:59:46.000Z",
          "Titre": "First day of use some irration top of…",
          "Contenu": "First day of use some irration top of ear because I wear glasses"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-03T14:37:52.000Z",
          "Titre": "Great customer service and I received…",
          "Contenu": "Great customer service and I received my products quickly!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T11:26:03.000Z",
          "Titre": "order was correct and delivered on time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul H.",
          "Nb_Reviews": 1,
          "Date": "2020-07-07T23:07:24.000Z",
          "Titre": "Satisfied with quality as they appear",
          "Contenu": "Satisfied with quality as they appear. Only time will tell if the 2 year warranty is worth its weight. Volume control is nice but maximum seems quieter than my existing HP 3100 that has no volume control. Price was right. Overall pretty satisfied initially and hope that once I really start using them they'll do the job for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sue",
          "Nb_Reviews": 1,
          "Date": "2020-05-20T14:24:58.000Z",
          "Titre": "Great Product",
          "Contenu": "The people here were amazing and very accommodating. I had ordered the antimicrobial wipes which most places have been out of and they made sure I could get them for our business. So glad I ordered these. Good sized sheets and you can wipes down a pretty big area before it starts to dry out on you. The smell is pleasant as well. Not hard like chemicals but no so lemony that you instantly pucker. Very happy with this product, especially during these strange times. Will definitely order again. Thank You."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brakefield, Rosemary",
          "Nb_Reviews": 3,
          "Date": "2018-06-07T18:43:41.000Z",
          "Titre": "I buy these Headphones for my Brother…",
          "Contenu": "I buy these Headphones for my Brother in law who is blind and handicap he loves the fit and the sound from this particular brand. They do not last long with him because he ends up running over them with his wheel chair and doesn't understand what is wrong with them. They seem to last much longer than any other brand, and  I will continue to buy them from now on.He Loves them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lucansky, Juliann",
          "Nb_Reviews": 1,
          "Date": "2018-11-05T19:38:56.000Z",
          "Titre": "I like these headphones for many my first graders",
          "Contenu": "I really like these headphones for my first graders.  The one thing I would like to see a change is placement of the microphone.  It is on the cord which is very long and the microphone is far away from the students mouth.  I have worked on helping them understand to hold it closer, but it is hard for the little guys to remember.  We are working on recording our reading.  Thanks for a product that fits their heads and is comfortable for my students."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maureen E",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T20:29:48.000Z",
          "Titre": "Cyber-Acoustics AC-204",
          "Contenu": "The headset mic combo that I first ordered was out of stock. Caitlyn in Customer Service sent me a list of comparable units! Wonderful, friendly service. Delivery was really quick. Product has worked well. I definitely recommend Encore Data Products as well as the Cyber-Acoustics mic/headset."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Red Oak PTA",
          "Nb_Reviews": 1,
          "Date": "2017-09-20T21:55:45.000Z",
          "Titre": "Affordable Headphones",
          "Contenu": "The headphones we ordered seem t be much sturdier than those we have ordered from other companies. They were affordable and a great way to outfit our whole school with a product that will hold up but also not break our budget. The only suggestion I have is that I would love it if this product came in a bag that we could write the children’s names on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacoby, Kathryn",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T22:48:23.000Z",
          "Titre": "Their customer service was fantastic",
          "Contenu": "Their customer service was fantastic! We ordered the cheapest headphones for school use. Only about half of them worked out of the package. When I contacted the company, they replaced all 100 and with a higher quality. The next step up in headphones have been working very well. I will reorder them when needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bernick, Jason",
          "Nb_Reviews": 1,
          "Date": "2018-09-05T17:33:17.000Z",
          "Titre": "Great uality, specs need updating…",
          "Contenu": "The quality of the ThinkWrite 10 port USB Charger is the best I've seen out there.The unfortunate part is that I was expecting it to run on 12 volts DC. The specs on it showed that it was a 12volt DC input and it actually is a household AC input.Both ThinkWrite and Encore Data Products' websites show that it is supplied by 12 Volts DC.It turns out I want to keep the units because they are very well built and I can use them for other areas.I'm still looking for a 12 Volt USB multi-port charger."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heidi L. Mello",
          "Nb_Reviews": 1,
          "Date": "2018-05-23T19:29:01.000Z",
          "Titre": "The new headsets so far have been…",
          "Contenu": "The new headsets so far have been working very well..Only three so far that we can not use ..but I did call the company and they did a quick response.Will test them better when Memorial Day Weekend arrives.Heidi L MelloEquipment Manager at the Preservation Society of Newport County"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Middle School Computer Teacher",
          "Nb_Reviews": 1,
          "Date": "2017-03-15T09:22:29.000Z",
          "Titre": "computer headsets",
          "Contenu": "I received the headsets within a few days after ordering. I need to order a higher quality headset in the future because the low end ones were quickly destroyed by the middle school students. You get what you pay for. I intend to order from this company in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lidia Han",
          "Nb_Reviews": 2,
          "Date": "2018-01-11T22:19:24.000Z",
          "Titre": "Great service 😊",
          "Contenu": "One headphone arrived broken.  They replaced it without question!  Great service.  The only reason I gave 4 stars is because the kids complain that it hurts their ears/head sometimes.  May be too tight for their head, not sure.  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bay Springs Middle School",
          "Nb_Reviews": 1,
          "Date": "2018-01-12T15:16:30.000Z",
          "Titre": "Cheap Product/Excellent Customer Service",
          "Contenu": "The product I ordered was a cheaply made product which I think encore needs to stop selling. However, customer service is everything to me so I gave 4 stars solely due to excellent communication and willingness to correct any issues!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emily Rich",
          "Nb_Reviews": 1,
          "Date": "2017-03-29T12:26:36.000Z",
          "Titre": "I had a great experience with every …",
          "Contenu": "I had a great experience with every step.  They were very quick with their responses.  The only problem came when I received my order.  The label did not have my name on it, so it took some time to track my package once it arrived."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ILSC New York - Saima Ahmed",
          "Nb_Reviews": 1,
          "Date": "2016-11-16T19:44:54.000Z",
          "Titre": "Wireless Headphones",
          "Contenu": "I ordered and used headphones from this company. They work very well, service was prompt and up to the mark. I am very with the product. The consultant Jules - is very active and responsive. Great customer services skills!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "United Supermarkets #551",
          "Nb_Reviews": 1,
          "Date": "2017-07-26T03:28:35.000Z",
          "Titre": "I have spent lots of money each year on …",
          "Contenu": "I have spent lots of money each year on headphones always trying to get a possible coupon or discount for loyal shopping ... these are donated to elementary kids and would like to see one of the codes work for once"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 5,
          "Date": "2016-09-05T12:12:16.000Z",
          "Titre": "The company is good.",
          "Contenu": "The company is good with the order and shipping. I wish the headphones were a little more durable as far at the plug ends go. The wires rip out very easily. But I guess that is why they are so inexpensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Celina City Schools",
          "Nb_Reviews": 1,
          "Date": "2016-09-21T13:58:26.000Z",
          "Titre": "Customer service is speedy and helpful.",
          "Contenu": "The headphones that we received had some issues, but Julie was quick on a resolution. The communication before, during, and after is the number one reason why I will keep Encore as a vendor. Thanks. kg"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "University Hill Elementary",
          "Nb_Reviews": 1,
          "Date": "2017-02-08T15:18:50.000Z",
          "Titre": "Headphones",
          "Contenu": "I haven't used the headphones in our computer lab yet because I just received them but liked the idea that the cords were \"chew-proof\" because I have to replace them every year."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim McDonald",
          "Nb_Reviews": 1,
          "Date": "2020-08-25T18:23:22.000Z",
          "Titre": "UV Scanner",
          "Contenu": "Product arrived on time and does what it is supposed to do, I guess.  It is hard to tell if the UV scanner is actually killing germs and the coronavirus, but we are using it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elementary Teacher in Indianapolis",
          "Nb_Reviews": 3,
          "Date": "2017-12-01T01:22:38.000Z",
          "Titre": "Rocking the Headphones",
          "Contenu": "I've had the headphones for about a month. They seem to be doing well. I'm hoping they last the whole school year! The headphones were $2.99 each. So far so good!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra Adams",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T18:28:03.000Z",
          "Titre": "I received the wrong product and it…",
          "Contenu": "I received the wrong product and it took several phone calls to get the return label.  I still haven't received the correct product or a refund."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Universal Pressure Pumping, Inc.",
          "Nb_Reviews": 1,
          "Date": "2018-09-20T17:45:15.000Z",
          "Titre": "Fantastic Customer Service!",
          "Contenu": "I ordered a gross of headphones and the customer service was great, professional. friendly, and very prompt; I will use them again on my next order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alcorn School District",
          "Nb_Reviews": 1,
          "Date": "2017-12-08T14:15:58.000Z",
          "Titre": "A little better description would be …",
          "Contenu": "A little better description would be helpful. I did not realize there was foam on the inside of the headphones. That makes them difficult to clean."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Weaver, Jenny",
          "Nb_Reviews": 2,
          "Date": "2017-02-06T01:12:56.000Z",
          "Titre": "Binders!",
          "Contenu": "I purchased 60 2\" binders back at the beginning of the school year/end of summer.  I needed a way for my 2nd and 3rd graders to contain their \"stuff\" while moving from desk to desk (I have flexible seating in my classroom).  These binders arrived quickly and in good shape.  There were a couple that were a bit smashed on the corner, but still usable.  There was one that the rings did not close properly and I had to return it for a new one.  Customer service took a little time to figure out how to exchange the item (I think the issue was that it was a single binder and not a whole case), but did so without fuss.  Although these are decent binders, they are not holding up as well as I had hoped they would - probably because they are being dragged around by 7-9 year olds!  Overall, I am happy enough since they were a great price.  However, I may have to find something new next year - or spend a little more for a higher grade binder.  Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "CR",
          "Pseudo": "Renée",
          "Nb_Reviews": 2,
          "Date": "2018-12-18T23:15:44.000Z",
          "Titre": "Grest website and fastness of service",
          "Contenu": "Grest qebsite and fastness of service, would’ve appreciated to receibe a tracking number of my order to know the estimated date of arrival"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clayton County Public Schools",
          "Nb_Reviews": 1,
          "Date": "2016-09-20T15:26:33.000Z",
          "Titre": "Great Company to work with.",
          "Contenu": "It was a pleasure working with Encore Data Products.  The representative was very knowledgeable and eager to assist us with placing our order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Butcher",
          "Nb_Reviews": 1,
          "Date": "2019-11-02T21:38:12.000Z",
          "Titre": "Order was complete",
          "Contenu": "Order was complete.  Product is working partially as expected (monaural not stereo headsets).  Head band is losing strength rapidly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Search Queen",
          "Nb_Reviews": 2,
          "Date": "2018-04-03T04:26:52.000Z",
          "Titre": "The product is great",
          "Contenu": "The product is great, only downside is for some smaller children they're too large and won't sit on their heads.Love the cords."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Junction City Public Schools",
          "Nb_Reviews": 1,
          "Date": "2017-08-24T19:31:21.000Z",
          "Titre": "Headsets",
          "Contenu": "We have been using the headsets for about a week now and they are working great.  I love that the cord is fabric and not plastic."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lincoln Elem. School - NY (Rotarian Lon Penna)",
          "Nb_Reviews": 5,
          "Date": "2018-10-21T01:07:44.000Z",
          "Titre": "I still like them, but I used to love them.",
          "Contenu": "I still like them, but I used to love them.  The quality seems to have been downgraded since the last time I purchased them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "school principal",
          "Nb_Reviews": 2,
          "Date": "2021-03-29T16:42:56.000Z",
          "Titre": "Very easy to work with",
          "Contenu": "Very easy to work with.  Has fairly good quality products.  Slightly more expensive than other vendors."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-31T18:27:18.000Z",
          "Titre": "They were as expected and arrived…",
          "Contenu": "They were as expected and arrived timely.  No problems with ordering, delivery or product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beulah Elementary School",
          "Nb_Reviews": 1,
          "Date": "2017-03-28T19:27:02.000Z",
          "Titre": "Headphones",
          "Contenu": "I received the products I ordered promptly.  It was very easy to order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Talbot County Education Center",
          "Nb_Reviews": 2,
          "Date": "2019-10-24T18:07:53.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service - Friendly Fast order turnaround"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C. L. Howard",
          "Nb_Reviews": 1,
          "Date": "2019-10-24T20:10:06.000Z",
          "Titre": "Good price",
          "Contenu": "Good price.  Fast delivery.  Good product as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Church in the Son",
          "Nb_Reviews": 1,
          "Date": "2017-04-19T20:49:44.000Z",
          "Titre": "Good",
          "Contenu": "It was a pleasure dealing with the reps of Encore"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Russ Juillerat",
          "Nb_Reviews": 1,
          "Date": "2020-06-20T17:15:10.000Z",
          "Titre": "Easy to navigate website and lots of…",
          "Contenu": "Easy to navigate website and lots of choices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sorensen, Holly",
          "Nb_Reviews": 2,
          "Date": "2016-09-10T04:26:04.000Z",
          "Titre": "As advertised.",
          "Contenu": "Item received in timely fashion as advertised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alana Forsythe",
          "Nb_Reviews": 4,
          "Date": "2019-10-25T11:33:29.000Z",
          "Titre": "My students are happy with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gurung, Angat",
          "Nb_Reviews": 1,
          "Date": "2018-12-19T18:06:17.000Z",
          "Titre": "Very first and good experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lincoln County School District",
          "Nb_Reviews": 1,
          "Date": "2019-04-16T23:04:54.000Z",
          "Titre": "Simple to use",
          "Contenu": "Simple to use. Easy to learn."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "School District of Beloit",
          "Nb_Reviews": 1,
          "Date": "2017-12-01T20:05:05.000Z",
          "Titre": "Great product and service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dirollo",
          "Nb_Reviews": 1,
          "Date": "2018-03-09T02:25:04.000Z",
          "Titre": "Very quick and affordable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 3,
          "Date": "2018-04-11T17:37:59.000Z",
          "Titre": "Thank You so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammi D",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:19:11.000Z",
          "Titre": "Happy Encore customer..",
          "Contenu": "You can find everything you need on their easy-to-navigate website. I have purchased from Encore Data Products for our school district for many years. Encore is my go-to source for quality products, the lowest prices, and quick shipping. And on occasion when I've had to call customer service, they've always been friendly and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pta customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:21:14.000Z",
          "Titre": "Jeff is so amazing",
          "Contenu": "Jeff is so amazing. He helped alot and recommended a great product! He helped so many people. Everything was quick and he made the process so east"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Javier Aguilar",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T05:41:30.000Z",
          "Titre": "Great customer service to answer all my…",
          "Contenu": "Great customer service to answer all my questions and recommendation for products for ALL of my students.Thank you, with gratitudeMr. JA @efwmaschool"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "McCord Elementary, Vernon, Tex",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:13:52.000Z",
          "Titre": "We needed quality headphones",
          "Contenu": "We needed quality headphones that would survive 1st graders and so far these are great!! The single cord is a big plus!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annmarie Dalessio",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T00:34:50.000Z",
          "Titre": "AWESOME, THOUGHTFUL, GENEROUS COMPANY",
          "Contenu": "Many things made my experience excellent with Encore Products.  From start to finish they have been a blessing.  I first called and left a message and that morning I received a return call from Katlyn.  She was so kind and receptive to the purpose of my call and without hesitation she passed me along Jeff.  Jeff also without hesitation helped our fundraising cause.  They have no idea how wonderful they are and how thankful I am ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Z Jenson",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T00:32:50.000Z",
          "Titre": "THE BEST COMPANY",
          "Contenu": "This company has the best customer service I have ever experienced! I am a teacher who needed headphones for her class and they gave me an incredible quote and shipped them to me incredibly fast. I would recommend this company a million times!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb E",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T18:02:43.000Z",
          "Titre": "Awesome price and very fast shipping",
          "Contenu": "Awesome price and very fast shipping.  Unable to review product itself because we haven't used them yet but anticipating that they will meet our needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shirley D",
          "Nb_Reviews": 3,
          "Date": "2023-08-07T16:37:25.000Z",
          "Titre": "Helpful and fast delivery",
          "Contenu": "Ten days before the back-to-school event, I received a donation to spend on additional supplies. The school system suggested durable headphones, something I had no experience purchasing. Plus, I wanted to stretch the donation to cover as many children as possible. The customer service representative was quite helpful. When I placed the order, I paid extra for faster shipping. She called me immediately and said she was refunding that fee since the order would arrive on time with regular shipping service. As I handed out the headphones, many parents commented on how nice they were."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T17:15:43.000Z",
          "Titre": "damaged headphone bags",
          "Contenu": "Updated review: Encore just called and is sending replacement bags (I've already received the tracking number) for any that were damaged due to the tape.  They're also going to notify their distribution warehouse to make sure it doesn't happen again.  Great Customer Service!Boxes of headphones arrived promptly, however tape used to seal boxes was also attached to several headphone bags in each box we opened.  This tore the headphone bags - which students used to store their headphones.  Also, the headphone bags are really really thin, which resulted in them tearing easily when attached to the tape used to seal the boxes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "School Purchaser",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T22:13:13.000Z",
          "Titre": "We are a charter school that has half…",
          "Contenu": "We are a charter school that has half our classes online and go through a lot of headphones. We can't buy too many at once because we are limited on space, but I reached out for a quote and we were still given a bulk price. I really appreciate this and we will continue to do business with Encore Data Products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy G.",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T23:20:40.000Z",
          "Titre": "Sales person was easy to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T21:38:57.000Z",
          "Titre": "Called on the phone",
          "Contenu": "Called on the phone, and the person was knowledgeable and was able to direct me to a quote on the website.  The quote came quickly and was able to place the order and have P.O. within a day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Holdaway",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T20:36:26.000Z",
          "Titre": "These headphones are great for my elementary computer lab!",
          "Contenu": "These headphones are great for my elementary computer lab. I bought several sets a few years ago and they are still going strong, despite being used by six classes a day.  I just bought more to replace the older non AVIS brand headphones in my lab so now I have 38 matching headphones. I like that there is volume control, the headphones fit a variety of head shapes and sizes from kindergarten to sixth grade, they are durable, the sound quality is great for the computer lab, and the cord is fabric-y so that it deters children from chewing on the cord. I recommend these headphones for a classroom!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2022-07-07T21:48:36.000Z",
          "Titre": "I love working with Tarin and her…",
          "Contenu": "I love working with Tarin and her coworkers. They are always polite, helpful and very professional.ThanksBill McCarthyLyme Technology SolutionsCertified HUBZone Small BusinessISO 9001:2015 Certified“Proud Navy Dad” \"There's no substitute for the personal touch.\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T16:43:15.000Z",
          "Titre": "Fast friendly service..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Grannis",
          "Nb_Reviews": 7,
          "Date": "2022-02-10T12:35:12.000Z",
          "Titre": "This is the second time I have…another wonderful experience",
          "Contenu": "This is the second time I have purchased this item from this company. I made my purchase and I’m not kidding……in less than an hour I received an email that my order had already shipped! I was sent tracking information and my order will arrive on Saturday. That was just normal delivery too! What FAST service! When unordered previously I needed some help with choosing my product and the customer service was amazing. I highly recommend this company. Extremely pleased!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T22:23:01.000Z",
          "Titre": "Thank you to Encore Data Products!",
          "Contenu": "Thank you to Encore Data Products!Grateful for their community support and their amazing customer service! From ordering to picking up, wonderful people to work with each time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-19T00:36:46.000Z",
          "Titre": "Helpful customer service",
          "Contenu": "I ordered headphones, which arrived quickly.  But I realized right away that I'd ordered the wrong ones - I needed headphones with a mic.  When I contacted Encore Data Products, they were personable and helpful.  They recommended I order the headphones I need, and return the headphones I ordered by mistake for a refund."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Dublin Historical Society",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T13:02:27.000Z",
          "Titre": "The Dublin (Ohio) Historical Society…",
          "Contenu": "The Dublin (Ohio) Historical Society offers walking tours through our historic district.  The units we purchased provide us the ability to take a group of 20+ through that district while being heard over the traffic, while allowing our group to be socially distanced.  It was the perfect addition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Miraldi",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T20:59:39.000Z",
          "Titre": "My order was fullfilled and confirmed…",
          "Contenu": "My order was fullfilled and confirmed as shipping in less than 1 hour.  Tracking info was received shortly thereafter and delivery was right on time.  It doesn't get any better than that, and I'm not a large customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cautious in Chicago...",
          "Nb_Reviews": 10,
          "Date": "2022-03-15T13:19:39.000Z",
          "Titre": "I purchase several products for use in…",
          "Contenu": "I purchase several products for use in special needs schools.  The products I order are always good quality at a very reasonable price. My Rep. is wonderful!  She is always very responsive and I get my deliveries in a very timely manner.  Overall, I could not be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cautious in Chicago...",
          "Nb_Reviews": 10,
          "Date": "2022-07-12T23:40:14.000Z",
          "Titre": "I have been ordering various products…",
          "Contenu": "I have been ordering various products from Encore Data for many years and have never been disappointed.  My rep. Holly, is amazing.  She is always responsive and knowledgeable. I couldn't be happier with a vendor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oldsmar Public Library",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T22:54:16.000Z",
          "Titre": "Best source for low cost headphones for…",
          "Contenu": "Best source for low cost headphones for libraries & schools! Orders are always correct & arrive quickly. Have ordered for years, never an issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn N.",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T14:49:56.000Z",
          "Titre": "Caitlyn is very responsive and helpful",
          "Contenu": "Caitlyn is very responsive and helpful.  She has always been great to work with as well as everyone else I've dealt with at Encore!  Easy company to work with and their customer service is well above par!  Great job Encore!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T14:00:34.000Z",
          "Titre": "Excellent!",
          "Contenu": "The prices are great. My rep Holly even got us a better price. The communication is spot on and professional in every way.  We have not received our product yet, but I anticipate quality.  First time I used this company but it won't be our last if we place an order like this again. Recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-02-11T20:09:24.000Z",
          "Titre": "Encore's customer service is excellent",
          "Contenu": "Encore's customer service is excellent.  They are always very friendly and quick with responses, as well as getting products delivered.  Our school has been very pleased with the quality of the products we have received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DONALD",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T01:57:44.000Z",
          "Titre": "The right headsets for me.",
          "Contenu": "The right headsets for me.easy site to work through.Product delivered in good time.With different headsets out there, I figured a school supply would have quality product at proper price.They work just fine.Glad I bought them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherrie Sitton",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T16:59:28.000Z",
          "Titre": "Wonderful company",
          "Contenu": "Wonderful company. I have been ordering from the for my granddaughter with special needs for 4 plus years. Always a good price and quick to ship. I would recommend others to order your headphone needs from Encore!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Faulkner",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T16:46:12.000Z",
          "Titre": "Easy",
          "Contenu": "It was very easy to upload my PO and submit the order online. Very quick also. I received my order, rather quickly after submitting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah R",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T17:44:37.000Z",
          "Titre": "Complete Satisfaction",
          "Contenu": "Complete SatisfactionI have been purchasing the AE-36 headphones from Encore for years. They are fairly priced, great quality and I always receive them promptly. Two thumbs up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T21:57:01.000Z",
          "Titre": "this is my second order from encore",
          "Contenu": "this is my second order from encore.  i am assuming that the product will be as satisfying as the first order.  customer service is just what the name implies.  thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cautious in Chicago...",
          "Nb_Reviews": 10,
          "Date": "2021-12-13T14:32:53.000Z",
          "Titre": "One of the best companies I work with...",
          "Contenu": "I use Encore exclusively for our classroom/student headphones and headsets.  The quality is excellent and they have proven to be very durable and cost friendly.  The representative I work with is always extremely responsive and I have never had issues with timely delivery.  I highly recommend Encore."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Bloom",
          "Nb_Reviews": 2,
          "Date": "2022-01-28T22:37:55.000Z",
          "Titre": "Tarin was extremely quick to respond…",
          "Contenu": "Tarin was extremely quick to respond and reached out to me with any questions.  I appreciate her ability to process my complex rush order with such efficiency.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T01:06:06.000Z",
          "Titre": "Easy to work with",
          "Contenu": "Encore has always been easy to work with, quick with responses, and ships their products incredibly fast!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HollandK",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T15:47:47.000Z",
          "Titre": "Quick and Easy",
          "Contenu": "I went to the website to order the headphones my supervisor requested.  Because of Amazon pay, I spend less time on the site then expected; and to my surprise, it was quick and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FCS",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T22:46:01.000Z",
          "Titre": "Great response time",
          "Contenu": "Great response time. Quick delivery. Headphones seem to be good quality. I am hoping they hold up to Elementary School students."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy Randolph",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T17:41:40.000Z",
          "Titre": "Thank you Ms. Paige",
          "Contenu": "Thank you Ms. Paige for your excellent customer service. In a time where customer service is seriously lacking, you went above and beyond to make sure my order was complete."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Pearson",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T20:19:24.000Z",
          "Titre": "You gave us a discount for buying in…",
          "Contenu": "You gave us a discount for buying in bulk,We apprecitae every penny saved in the school district as our budgets are slim.Thank you again,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Lloyd Wright Foundation",
          "Nb_Reviews": 5,
          "Date": "2023-11-14T00:24:27.000Z",
          "Titre": "Excellent!",
          "Contenu": "Always gives us very courteous and speedy service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Endeavor Elementary",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T16:05:11.000Z",
          "Titre": "Appreciate the headphones....",
          "Contenu": "Appreciate the headphones giveaway drawing, with choice of headphone models. Our community school will use the heavier duty models for our special education students. Quick delivery, too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MB Colorado",
          "Nb_Reviews": 3,
          "Date": "2022-02-23T18:20:53.000Z",
          "Titre": "Excellent service, fast shipping. ;)",
          "Contenu": "I just a few low priced items, but the order was treated as if I was making a big purchase.  They communicated back to me about a shipping question and the order was filled promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Remy",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T02:22:00.000Z",
          "Titre": "Fantastic Customer Service",
          "Contenu": "Caitlyn was a fantastic customer service rep. I had many questions throughout the process and was always answered quickly and positively.Thanks again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T16:15:16.000Z",
          "Titre": "I won a trial to use!",
          "Contenu": "My great experience was that I won a set of free ear phones! They came in a well packed box and I am thrilled to give them a try next school year to see how they withstand the use in our classrooms."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich Reilley",
          "Nb_Reviews": 2,
          "Date": "2022-07-13T13:31:10.000Z",
          "Titre": "Headphones",
          "Contenu": "Wonderful people to work with. Met my needs for headphones to accommodate our district for state testing. Shipping and delivery was very quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jodi Lenkel",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T16:00:26.000Z",
          "Titre": "Salesperson was so helpful",
          "Contenu": "Salesperson was so helpful. Knowing I was working with a resticted budget he found a similar but less expensive product that let me maximize the quantity I could order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T03:47:47.000Z",
          "Titre": "The help was prompt and friendly",
          "Contenu": "The help was prompt and friendly, and I was able to get all of my questions answered right away.  I wish it were this easy to do business everywhere!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G Bevis",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T18:11:56.000Z",
          "Titre": "A+++ Customer care",
          "Contenu": "Items have not been received but I can not say enough positive things about the help with this order. Thanks for making this happen for all my kiddos."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Orchard Park Academy",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T21:03:35.000Z",
          "Titre": "Caitlyn M",
          "Contenu": "Caitlyn M. is amazing!  She is so kind and efficient! We get our order within day without delivery charge!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T16:35:45.000Z",
          "Titre": "The Encore team is always pleasant to…",
          "Contenu": "The Encore team is always pleasant to work with. They make me feel like I am their most important customer and my orders are process promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Junghans",
          "Nb_Reviews": 3,
          "Date": "2022-01-03T21:27:48.000Z",
          "Titre": "Easy return for a larger headset",
          "Contenu": "I had ordered a headset that seemed to small for me, so it was easily returned and exchanged for a larger one.  Very friendly customer service.  Karen was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Matus",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T00:03:24.000Z",
          "Titre": "Excellent customer support",
          "Contenu": "I placed an order and the sales representative was very responsive and communicated well.The order was invoiced and shipped the same day.Easy to work with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Farwell ISD",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T21:09:45.000Z",
          "Titre": "Fast turnaround",
          "Contenu": "Fast turnaround! I submitted my order at 9:30 in the morning, at 12:30 noon I had a copy of my invoice and a tracking number for the order. Excellent customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T19:12:30.000Z",
          "Titre": "Always great turn-around -- from quote…",
          "Contenu": "Always great turn-around -- from quote to delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marianna B",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T01:50:01.000Z",
          "Titre": "Excellent Customer Service!",
          "Contenu": "I submitted a request for a quote and received it within minutes. The sales department communication was top notch and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chelsea",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T19:04:39.000Z",
          "Titre": "Loved the service",
          "Contenu": "Loved the service! The customer service team has been very helpful and very quick at responding. Excited to use headphones from them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T18:47:37.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I called to order an item and the rep was very kind and helpful. The order was processed super fast. Literally, within hours, I had a tracking number for my order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mila Rowe/Adena Middle School",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T17:37:03.000Z",
          "Titre": "Desperately Needed!",
          "Contenu": "We were in desperate need of headphones! What a thrill to win. We will definitely use Encore for all our headphone needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charleston High School Band",
          "Nb_Reviews": 6,
          "Date": "2022-01-25T18:40:22.000Z",
          "Titre": "Fast, Friendly, and Efficient",
          "Contenu": "I made my order and it shipped immediately. The price was very reasonable and the customer service was friendly and efficient when I had a question for which I called."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheri",
          "Nb_Reviews": 4,
          "Date": "2022-11-10T20:26:04.000Z",
          "Titre": "quick response to my request for ear…",
          "Contenu": "quick response to my request for ear buds order, quick quote, quick order was placed and i have a tracking number within a couple days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EILEEN.KORDIC",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T19:01:26.000Z",
          "Titre": "This is one of the easiest websites to…",
          "Contenu": "This is one of the easiest websites to order from.  Took me five minutes from search to checkout."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judith Gotcher",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T00:37:45.000Z",
          "Titre": "School use",
          "Contenu": "I have bought earphones from this company for a few years now. They hold up good, are reasonable, and serve the purpose for students in school."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T18:23:51.877Z",
          "Titre": "I was referred by a bigger company that…",
          "Contenu": "I was referred by a bigger company that said Encore Data was a lot better to deal with than a Chinese company. I called and found a product I wanted to try and Encore Data sent it without delay. it worked good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Ziebarth",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T17:39:47.000Z",
          "Titre": "Meeting Customer Expectations",
          "Contenu": "We ordered the items and they came as described.  Delivery was fast and efficient.  Everything went as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chambers Prairie Elem",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T22:12:38.000Z",
          "Titre": "I called in to order",
          "Contenu": "I called in to order. My School's credit card wasn't working for my online order. The person I spoke to was kind and well informed. She made the process easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vicky Connell",
          "Nb_Reviews": 3,
          "Date": "2022-11-29T01:55:49.000Z",
          "Titre": "Fantastic Customer Service",
          "Contenu": "I place an order about every 3 months.  Every time the customer service is superb.  Delivery is very fast!!  Takes me less than five  minutes when I call in.  Keep up the great work!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T14:18:24.000Z",
          "Titre": "This experience was great",
          "Contenu": "This experience was great!  I called for information and was answered quickly and friendly by a real person."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T15:07:36.000Z",
          "Titre": "Called for a quote and place the order…",
          "Contenu": "Called for a quote and place the order that day.Wonderful experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Remy",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T02:18:54.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Caitlyn was a fantastic customer service representative. Always quick to answer my questions and help me with anything I needed.Thanks again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daryl Bellis",
          "Nb_Reviews": 3,
          "Date": "2023-01-21T22:38:21.000Z",
          "Titre": "Great Price",
          "Contenu": "Great price and good quality sound from these mini headphones.Super fast shipping. From ordering to my door in Ohio in 3 days!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T21:51:45.000Z",
          "Titre": "Holly did a great job",
          "Contenu": "Holly did a great job of contacting me and staying in touch through the whole order process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T12:43:45.000Z",
          "Titre": "I placed an order",
          "Contenu": "I placed an order, received a phone call from Kaitlyn informing me the product was out of stock. Helped with the replacement."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Steavens",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:16:25.000Z",
          "Titre": "Very helpful and easy to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Miraldi",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T19:43:02.000Z",
          "Titre": "Disposable Ear Buds",
          "Contenu": "We are a repeat customer of Encore.  They offer an extensive product line, competitively priced, a prompt, uncomplicated order process, and ship quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-29T22:25:34.000Z",
          "Titre": "Holly was very helpful and had great…",
          "Contenu": "Holly was very helpful and had great communication. The delivery came very fast and was well packaged. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "andrea morgan",
          "Nb_Reviews": 2,
          "Date": "2022-04-18T18:56:08.000Z",
          "Titre": "The Customer Service is amazing!",
          "Contenu": "The customer service is amazing! Whenever I have a question or action item required, they respond within minutes. So impressive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan Kunzler",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T20:52:16.000Z",
          "Titre": "Holly Armstrong was so helpful and…",
          "Contenu": "Holly Armstrong was so helpful and prompt. It made ordering very easy and a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cautious in Chicago...",
          "Nb_Reviews": 10,
          "Date": "2022-08-19T15:15:13.000Z",
          "Titre": "I just placed another order with…",
          "Contenu": "I just placed another order with Encore.  As always, perfection!  The product is excellent, delivery is fast and customer support could not be better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristina",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T00:09:28.000Z",
          "Titre": "Encore Data Products always has a wide…",
          "Contenu": "Encore Data Products always has a wide variety of products, and great prices.  Especially when you buy in bulk!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele Knotts BCSD",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T15:11:38.000Z",
          "Titre": "Easy ordering",
          "Contenu": "Easy ordering, great customer service. All items received in the time expected and all items were accounted for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T18:28:36.000Z",
          "Titre": "The description of products is…",
          "Contenu": "The description of products is extremely helpful. The responsiveness of their team is top tear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T15:03:46.000Z",
          "Titre": "I instantly received help and my order…",
          "Contenu": "I instantly received help and my order was placed instantly once I had my payment in for our school. Thank you Encore! I'd give 5+ stars if I could!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda K Balek",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T18:52:20.000Z",
          "Titre": "Great attituded and very helpful!!",
          "Contenu": "We received our products in great time.I did call to talk with so one on our invoice and she was wonderful and very pleasant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Champion",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T13:45:13.000Z",
          "Titre": "fast delivery easy to order great…",
          "Contenu": "fast delivery easy to order great product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2022-03-01T21:44:31.000Z",
          "Titre": "I love working with the reps at Encore…",
          "Contenu": "I love working with the reps at Encore Data! They are always quick to respond and accurate with what they provide."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Brown",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T19:30:58.000Z",
          "Titre": "Ease in ordering",
          "Contenu": "Ease in ordering, quality , price, and timely delivery.  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 6,
          "Date": "2022-06-15T20:08:15.000Z",
          "Titre": "Always easy.",
          "Contenu": "Always easy with you people!  I regret it later when I expect your great service from other places."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich Reilley",
          "Nb_Reviews": 2,
          "Date": "2023-04-21T21:30:32.000Z",
          "Titre": "Such great service...",
          "Contenu": "Thank you so much for the quick service. Encore Data has such a wide variety. I value our partnership."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Tropia",
          "Nb_Reviews": 4,
          "Date": "2022-04-07T01:29:42.000Z",
          "Titre": "Wide selection of products",
          "Contenu": "Wide selection of products, fast delivery, great return policy.  Best customer serviceOn the internet.  Would highly recommend doing business with Encore.  Very satisfied customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcia Bhola",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T04:39:07.000Z",
          "Titre": "The wholesale price was excellent and…",
          "Contenu": "The wholesale price was excellent and the delivery time was very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol M.",
          "Nb_Reviews": 4,
          "Date": "2023-06-16T16:16:04.000Z",
          "Titre": "Ordering is easy and they always come…",
          "Contenu": "Ordering is easy and they always come faster than I expect them to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T14:01:38.000Z",
          "Titre": "Encore Products is one of the best…",
          "Contenu": "Encore Products is one of the best companies that I have ever dealt with! they are fast courteous and caring! Well Done Encore!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Studio",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T04:21:28.000Z",
          "Titre": "Very fair price on the drawer unit",
          "Contenu": "Very fair price on the drawer unit, easy order, email confirmations, updated tracking info and SUPER FAST delivery. Appreciate the hassle free experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Medina",
          "Nb_Reviews": 4,
          "Date": "2021-12-23T18:11:00.000Z",
          "Titre": "Easy to find what your looking for and…",
          "Contenu": "Easy to find what your looking for and closing out making payment is a breezes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia  Body",
          "Nb_Reviews": 3,
          "Date": "2022-09-16T20:17:39.000Z",
          "Titre": "I just order the head phones for my…",
          "Contenu": "I just order the head phones for my granddaughter.When I received my order I will give a feedback.Thank You."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Haley Randall",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T20:19:44.000Z",
          "Titre": "I was very pleased with the product",
          "Contenu": "I was very pleased with the product, I ordered headphones and they were so much nicer then i thought they would be, Thank you so much and it was shipped very quickly. i am impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miss W",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T19:14:27.000Z",
          "Titre": "This is the first time I've ordered…",
          "Contenu": "This is the first time I've ordered from this company.  I needed a large quantity of headphones for my students at school."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T20:12:23.000Z",
          "Titre": "Delivery was fast",
          "Contenu": "Delivery was fast.  No delays.  Representative was great to work with.  Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teri Friend",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T16:20:36.000Z",
          "Titre": "Great product at value pricing",
          "Contenu": "Great product at value pricing. Love the quantity discount opportunities.  SUPER fast shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Nelson",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T19:47:59.000Z",
          "Titre": "Great product for the price",
          "Contenu": "I have used Encore products for many years.  I get low end headphones which are great for our purposes.  The need is to listen to someone speaking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T12:07:45.000Z",
          "Titre": "Very easy to work with",
          "Contenu": "Very easy to work with  - quick with responses for my quote as well as sending out my order."
        }
      ]
    }
  ]
}