{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "endlessmining.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arlene Parker",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:02:31.000Z",
          "Titre": "It is advisable",
          "Contenu": "It is advisable to stay off this company especially, when I witnessed how ineffective and unhelpful they have been. “EASY•BE” still remain the only broker I can trust."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johan",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T03:14:03.000Z",
          "Titre": "Had a good experience buying from Endless",
          "Contenu": "I had a great experience shopping at Endless Mining.Augustine was a great person to work with. Very informative, gave me valuable info about a product I was considering buying. Based on his recommendation I wound up buying a different product.My only complaints were with UPS. They were Horrible.If you buy from Endless, make sure to ask them to ship with DHL."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stefan",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:37:12.000Z",
          "Titre": "US Based and Takes Credit Cards",
          "Contenu": "Love the fact that I can use a credit card. Besides getting the points on my card, it gave me security knowing that I could always get my money back. Also the fact that they are US based (I also live in the US) I didn't have to deal with tariffs. That is a huge plus on a 10K purchase. Once it shipped I had it 2 days later. Would definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel Morris",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:16:09.000Z",
          "Titre": "endless mining was amazing along the…",
          "Contenu": "endless mining was amazing along the way get reseller!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Erickson",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:29:35.000Z",
          "Titre": "Great prices",
          "Contenu": "Great prices, great service. I bought a D9 at a very competitive price and had it hosted. They had it up and mining within 2 days of it being delivered to their facility. It's been 10 days and so far I've had 100% uptime. They were in communication with me through WhatsApp the entire process. Will recommend and possibly purchase through them again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FABminers",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T01:23:26.000Z",
          "Titre": "Endless Mining!!!",
          "Contenu": "Purchasing from Endless Mining was easy process. Received my product with no issues. No hidden fees upon payment. It takes an extra day to clear customs. Will purchase again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T04:49:57.000Z",
          "Titre": "The best and easiest asic purchase I…",
          "Contenu": "The best and easiest asic purchase I have ever made. The prices are super competitive and the speed of processing and shipping is faster than most asic sellers. In an industry where one can easily be scammed by fake websites and companies, Endless Mining can be trusted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodrigo Santamarina",
          "Nb_Reviews": 5,
          "Date": "2023-12-05T16:23:26.000Z",
          "Titre": "Happy repeat customer",
          "Contenu": "Have placed multiple orders with them. All delivered as promised and with excellent communication along the way!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodrigo Santamarina",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T16:34:34.000Z",
          "Titre": "Customer Service Excellence Through Action (and words)",
          "Contenu": "My experiences with Endless Mining have consistently been exceptional, with completely smooth transactions until a recent product failure, which was unequivocally not their fault.Electronics, by their nature, can encounter unpredictable issues, and despite numerous problem-free orders, I finally ran out of my good luck and naturally encountered a faulty product from the manufacturer. However, it's essential to stress that this was entirely beyond the control of Endless Mining.What was in their control and truly distinguishes Endless Mining is their remarkable response to the situation. Throughout the entire process, their communication was prompt, considerate, and exceptionally diligent. Their troubleshooting efforts were thorough, inventive, and they provided an unprecedented level of personal attention. The team, especially Agustin, made me feel genuinely valued as a customer, surpassing typical service standards. It's imperative to emphasize that the fault did not lie with Endless Mining. Instead, they saw this as an opportunity to display an unparalleled commitment to their customers. They didn't merely acknowledge the issue; they took proactive measures, demonstrating their dedication to rectifying every aspect under their control.In circumstances where electronic failures occur (inevitably), the pivotal factor in my opinion is the company's response. Endless Mining exhibited unwavering support, care, and dedication, setting an extraordinary standard for customer service. I wholeheartedly applaud Endless Mining for their exceptional efforts. For those in search of similar products, you need someone who will help you navigate the bumps along the road, so I strongly recommend experiencing their exceptional commitment firsthand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodrigo Santamarina",
          "Nb_Reviews": 5,
          "Date": "2023-11-30T06:42:07.000Z",
          "Titre": "Remarkable Experience and Customer Service!",
          "Contenu": "I had an exceptional experience with EndlessMining that surpassed all expectations. Their communication throughout the entire process was exemplary, ensuring that every detail was clear and well-addressed. I was impressed by their prompt responses and willingness to provide assistance whenever needed.Moreover, the speed at which they processed my request was remarkable. Not only did they deliver on time, their efficiency was truly commendable.What stood out the most was their unwavering trustworthiness. They demonstrated integrity and reliability, earning my complete trust in their services. I felt confident and secure throughout the entire transaction.Overall, I highly recommend them for their outstanding communication, lightning-fast processing, and unwavering trustworthiness. Agustin and Zain - thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FABminers",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T18:59:54.000Z",
          "Titre": "Quick Service and Easy process",
          "Contenu": "Easy process. No Hidden fees. Working product. Accepts many forms of payment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tj Jones",
          "Nb_Reviews": 6,
          "Date": "2023-12-07T13:32:58.000Z",
          "Titre": "They are always great to work with and…",
          "Contenu": "They are always great to work with and take care of their customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sean helgeson",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T13:03:53.000Z",
          "Titre": "great customer service",
          "Contenu": "items ship fairly quickly and if you have any questions they respond quickly to emails and answer the phone and quickly answer any questions if called during business hours"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "D.Atlas",
          "Nb_Reviews": 5,
          "Date": "2023-02-22T23:37:03.000Z",
          "Titre": "I purchased the S19 Pro 110th",
          "Contenu": "I purchased the open box unit about a week ago, and endless mining has been very helpful with the process of what the unit was, all serial numbers associated with the unit, and ensuring the unit arrived at the hosting facility. The gentleman whom I spoke to was kind and understanding about my lack of knowledge with these machines, and explained how the process works. Now I am happily mining away, and plan to buy another unit in the future! -Walhart."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "GREEN ENERGY CRYPTO",
          "Nb_Reviews": 3,
          "Date": "2023-03-16T06:16:50.000Z",
          "Titre": "Genuinely enjoyable experience",
          "Contenu": "Purchasing through this company is a breeze multiple payment method for peace of mind.Excellent communication with before and after salesWould recommend to anyone in the crypto space.Thanks for making things so easy.GREEN ENERGY CRYPTO"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T14:34:41.000Z",
          "Titre": "Agustin has been amazing with top notch…",
          "Contenu": "Agustin has been amazing with top notch service and delivery with our miners. His expertise and knowledge in the field has driven us to purchase more hardware. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rey Ock",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T19:00:01.000Z",
          "Titre": "Highly recommended",
          "Contenu": "Augustin was very helpful from beginning to the end . All my questions were answered .Super friendly and fast service. I’m very satisfied with the entire experience. I highly them to use any of their services."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael Hofer",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T19:13:13.000Z",
          "Titre": "My new go to for ASICS",
          "Contenu": "Excellent communication, can chat with seller on WhatsApp which is really nice. Was delivered within a week and duty only cost $40CAD. Defiantly my new go to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott B.",
          "Nb_Reviews": 4,
          "Date": "2023-03-25T15:34:50.000Z",
          "Titre": "I have purchased two ASIC's from…",
          "Contenu": "I have purchased two ASIC's from Endlessmining and my experience has been very positive.  I particularly like the extensive communications about my order status and the outreach from them to make sure things are to my satisfaction at every step of the order/delivery process.  I have already ordered two more ASIC's and things are looking great so far!  I highly recommend them and will continue to buy ASIC's from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JPM",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T01:40:57.000Z",
          "Titre": "Better than the competition!",
          "Contenu": "Agustin was very proactive and responsive about my order.  You typically do not get this type of service from other companies.  I plan on working with them more in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "stick shark",
          "Nb_Reviews": 4,
          "Date": "2023-03-05T04:50:59.000Z",
          "Titre": "Seamless",
          "Contenu": "Purchase and checkout process was flawless. I quickly received an email from their team to make sure I knew how to set it up once I receive it. They also been keeping me updated with the processing and shipping. I should receive it next week and can’t wait!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "GREEN ENERGY CRYPTO",
          "Nb_Reviews": 3,
          "Date": "2023-07-07T12:29:18.000Z",
          "Titre": "Yet again another easy seamless…",
          "Contenu": "Yet again another easy seamless transaction which is dangerous because its just to easy to buy moreThanks GREENENERGYCRYPTO"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Dragon Flick",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T04:33:01.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service! Always happy with the support provided during the whole process from placing the order, while product is in transit and till it is delivered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodrigo Santamarina",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T07:54:43.000Z",
          "Titre": "Another terrific order experience and…",
          "Contenu": "Another terrific order experience and great followups from Zain, Andres and Agustin!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth C.",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T22:26:35.000Z",
          "Titre": "This was the second time ordering with…",
          "Contenu": "This was the second time ordering with Endless Mining. We are happy with the product and don't think the customer service could get any better! Very pleased (again)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tj Jones",
          "Nb_Reviews": 6,
          "Date": "2023-11-28T06:02:06.000Z",
          "Titre": "They are great to work with",
          "Contenu": "They are great to work with. They go out of their way to take care of their customers!"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Abdulhaleem",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T19:16:48.000Z",
          "Titre": "Endless happy experience ✅",
          "Contenu": "Great experienceDude went Above and beyond before and after the purchase and even gave me lots of tips that helped me since it was my first ever Asic Thank you and i wish you all the best"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth C.",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T00:01:53.000Z",
          "Titre": "We received such personal service from…",
          "Contenu": "We received such personal service from Agustin. And are very happy with the product! Definitely will do business with again ~"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David S Zambron",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T13:39:57.000Z",
          "Titre": "Very simple and reliable order",
          "Contenu": "Very simple and reliable order.  ASIC was packed well, shipped in quick manner.  No complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat G",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T18:23:00.000Z",
          "Titre": "From start to finish my relationship…",
          "Contenu": "From start to finish my relationship with Agustin at Endless Mining is spot on! A++ Thanks my man!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "stick shark",
          "Nb_Reviews": 4,
          "Date": "2023-03-25T02:04:19.000Z",
          "Titre": "Received the L7 8800gh about two weeks…",
          "Contenu": "Received the L7 8800gh about two weeks ago! It’s been running like a champ! The purchase process was smooth and delivery was fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Kraus",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T15:57:14.000Z",
          "Titre": "My go miner source",
          "Contenu": "I've purchased 6 miners from EndlessMining now and consider them my first go to source for miners."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "島小卡",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T13:38:38.000Z",
          "Titre": "Good seller,Delievery is Fast and…",
          "Contenu": "Good seller,Delievery is Fast and superior goods~I will shop again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dirk Greulich",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T17:02:03.000Z",
          "Titre": "Fantastic experience",
          "Contenu": "Fantastic experience.  Agustin has been on it from the first moment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Youngbar",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T01:14:17.000Z",
          "Titre": "Great company",
          "Contenu": "The owner is a great guy. I have bought numerous things from him to include asics."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "AWise",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T08:56:39.000Z",
          "Titre": "These guys are great",
          "Contenu": "Great experience! On point, great guys - just wow!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "GREEN ENERGY CRYPTO",
          "Nb_Reviews": 3,
          "Date": "2023-05-03T02:07:22.000Z",
          "Titre": "Endless mining awesome",
          "Contenu": "Endless mining maintained contact throughout the whole experience made it a pleasant purchaseWould recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond Flores",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T22:25:50.000Z",
          "Titre": "Great communication and fast shipping",
          "Contenu": "Great communication and fast shipping! Definitely will be ordering another miner again… Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Casper shima",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T12:47:00.000Z",
          "Titre": "premium goods ,light speed delivery,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David DiBenedetto",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T00:09:04.000Z",
          "Titre": "Quick setup time for hosted E9 Pro"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gonzo Miner",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T04:32:34.000Z",
          "Titre": "Great customer service & fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Django",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T22:25:14.000Z",
          "Titre": "Competitive Pricing",
          "Contenu": "Competitive Pricing, Fast Shipping and Amazing Customer Service!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T05:12:20.000Z",
          "Titre": "Communicated well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Wolter",
          "Nb_Reviews": 5,
          "Date": "2023-04-08T17:49:27.000Z",
          "Titre": "Great experience!"
        }
      ]
    }
  ]
}