{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "etopuponline.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Gary M",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T17:55:22.000Z",
          "Titre": "eTopUpOnline overcharged my account",
          "Contenu": "I did a top-up for $40TT and my bank account was charged $90TT for that transaction.I contacted customer support and they said that RBC (Royal Bank) charges $50TT for all online transactions.I normally use my RBC (Royal Bank) debit card to pay other bills online, internet, electric, etc. RBC (Royal Bank) DO NOT charge any additional fees for those online transactions.eTopUpOnline refuses to issue a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ramos",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T15:53:22.000Z",
          "Titre": "This is a 3rd transaction we do in a…",
          "Contenu": "This is a 3rd transaction we do in a week where the 2 previous transaction failed and we are waiting to dispute it. Just triying to send a single top to the same number. Very frustrating. You always say that was the bank rejecting the transaction and we know is just a technical failure on your side."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rene7",
          "Nb_Reviews": 6,
          "Date": "2023-11-16T16:37:53.000Z",
          "Titre": "Software Bug Combined with Bad Tech Support",
          "Contenu": "The software has an obvious bug when saving credit cards.  I submitted the problem to your tech support and asked a simple question.  But instead of answering the question, Matthew (who answers support questions) argues that the software has worked several times, blames the credit card company for the refusal problem, but he then refuses multiple times to answer the simple question which is \"Should credit card expiry dates be entered with the year in 4-digit format, or simply the last 2 digits of the year.\"  Matthew should not be working in software customer support"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:58:21.000Z",
          "Titre": "Taking out extra cash when using online…",
          "Contenu": "Taking out extra cash when using online payment"
        },
        {
          "Note": 1,
          "Lieu": "CW",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T20:07:08.000Z",
          "Titre": "Wanted to do a simple pay pal top up…",
          "Contenu": "Wanted to do a simple pay pal top up ended up having to use my credit card for something so small an minute"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RonH",
          "Nb_Reviews": 5,
          "Date": "2023-11-01T17:53:37.000Z",
          "Titre": "I lost my balance trusting auto-topup.",
          "Contenu": "I lost my balance because your auto topup didn't even attempt this month.  I worried about it initially, but it has been consistently working for months.  Not anymore!I got no fail msg, no nothing until Digi sent me a msg saying I was at $0.  How many others did you screw up?  Fix your crap!"
        },
        {
          "Note": 1,
          "Lieu": "BS",
          "Pseudo": "Angella",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T18:36:16.000Z",
          "Titre": "I was not able to make my refund even…",
          "Contenu": "I was not able to make my refund even though I called before any credit was download."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Vani",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T15:53:07.000Z",
          "Titre": "Additional CC charges",
          "Contenu": "The top up itself is smooth... However at NO point in time do you indicate that there's an additional charge attached to the transaction, over $250 it's $6, over $300 it's over $7. The only time I knew a charge was being made/applied was when it showed up on my credit card and unfortunately now I'm so used to the convenience of the app that I won't switch back to buying phone cards. Please add a disclaimer regarding additional charges prior to engaging in a transaction, especially when it fluctuates with top up amount. Be transparent!!"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Once loyal customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T15:33:35.000Z",
          "Titre": "DO NOT USE.…",
          "Contenu": "Do not trust this method of applying credit to your phone. Your identity is often compromised and the operators steal your credit points. All queries concerning lost credit points go unanswered with a very heavy handed approach. There is no method of resolve when things go awry. It is unsafe and unreliable.Use at your own discretion!!!"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T03:52:48.000Z",
          "Titre": "Do not use PayPal due to conversation! Extra Charge",
          "Contenu": "Do not use PayPal due to conversation! I ended up paying an additional $3.42 on a $50 card. If I had known I would have direct pay. Stay away from using PayPal!"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T19:13:39.000Z",
          "Titre": "The Apk doesn't accept my email to get…",
          "Contenu": "The Apk doesn't accept my email to get balance...I have been trying many time on different way without any good notice"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "jaishree",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T06:36:12.000Z",
          "Titre": "Bmobile stole my money!",
          "Contenu": "The net top up amount credited to my account was $44.44. However, when I checked my balance, it showed $40.87. How did my balance reduce if my data was off and I made no calls? Bmobile stole my money!"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer Eric",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T17:36:30.000Z",
          "Titre": "I topped up my phone online $100…",
          "Contenu": "I topped up my phone online $100 because l do not have a plan. The following day after topping up l am being sent several alerts that l don’t have enough money to use data. Bmobile computers have been down for 9 days now, no one to help. This is causing major inconvenience Not at all happy with BMOBILE services"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "ROBERT JOSEPH",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T14:51:54.000Z",
          "Titre": "ON SEPTEMBER29TH",
          "Contenu": "ON SEPTEMBER29TH, 2023, I TOPPED UP $50 TTD TO +18684853658 WITH TRANSACTIION #378934890. $50 -$5.56 = $44.44.THIS CREDIT WAS NOT RECEIVED.PHONE +18684853658WOULD YOU PLEASE INVESTIGATE AND ADJUST ACCORDINLY. I HAVE BEEN USING THIS TOP UP FACILITY FOR A LONG TIME AND NEVER EXPERIENCED ANYTHING LIKE THIS BEFORE.MANY THANKS IN ADVANCE"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Sally Ann Hughes",
          "Nb_Reviews": 4,
          "Date": "2023-10-18T05:13:37.000Z",
          "Titre": "I topped my modem up nearly 30 minutes…",
          "Contenu": "I topped my modem up nearly 30 minutes ago and it is still offline. This service should be instant and it usually is. Disappointed but hopeful it will start working again soon."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:07:17.000Z",
          "Titre": "The top up of Ames too long to become…",
          "Contenu": "The top up of Ames too long to become active. I paid $392 but cannot purchase a data and text plan immediately!"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T20:16:58.000Z",
          "Titre": "I Never got my money",
          "Contenu": "I Never got my money. I got the confirmation text that I received $266 from the top up but the money never hit my account"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Stephen",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T07:00:38.000Z",
          "Titre": "You have a glitch in entering credit…",
          "Contenu": "You have a glitch in entering credit card addresses that causes them to be rejected.  I tried 5 different cards, all came back with an \"oops\" and rejection, but all work for online purchases with other vendors."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T03:18:09.000Z",
          "Titre": "Terrible experience",
          "Contenu": "What a terrible experience. Online transactions are suppose to be make life easier. Bmobile’s website is set in USD prices (please tell me why when obviously it is local persons topping up) therefore when you use your debit card to top up, you are charged an addition $50. From the bank ( at least with RBC) because that’s their “policy” when conducting a USD transaction. 0/10"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "br",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T15:38:21.000Z",
          "Titre": "My transaction failed twice to a number which I have top up several times in the past. Please see my 2 failed transactions today Oct 25, 2023"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Tekada John",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T21:29:35.000Z",
          "Titre": "I bought a online card fo $50 and was…",
          "Contenu": "I bought a online card fo $50 and was charged $100 on my bank card. I reported the matter, they responded promptly and said i got the credit and closed the case. I have been message 3 days now with no answer. Request 154829 has not been solved. it is showing as solved.UPDATE:  ABSOLUTELY NO RESPONSE TO TO MY NEW QUERY. THESE PEOPLE ARE THE MOST UNPROFESSIONAL EVER!My bank confirmed that they do not charge any extra fees for the transaction and it was taken out your end. I bank with The Royal Bank of Canada."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T03:10:57.000Z",
          "Titre": "Bmobile charged me $150 for a $100 top…",
          "Contenu": "Bmobile charged me $150 for a $100 top up and credited me $88.88. Robbing customersReally? I'm switching my sim o Digicel."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T20:58:36.000Z",
          "Titre": "I was charged for my transaction in…",
          "Contenu": "I was charged for my transaction in United States Dollars instead of Trinidad and Tobago currency, after notifying Bmobile i was given the run around for more than a week. It was hard after day two to even get in contact with someone to find out if the situation was rectified. I had to have a lawyer contact bmobile. When i eventually got the refund no one contacted me with letting me know that it was processed. I am now very skeptical about online transactions."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T17:33:26.000Z",
          "Titre": "You etop up was fine but the cost for…",
          "Contenu": "You etop up was fine but the cost for data usage was terrible $133 finished in less than 2hrs because there was an app opened in the background so the girl from bmoblie said. I never even opened my phone"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Florence Sahai",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T21:02:49.000Z",
          "Titre": "Suddenly bmobile bills me in US currency",
          "Contenu": "I usually use this service. I was billed in US$ currency! I specifically went on chat saying I did not want to be billed in US$, yet I was, plus an additional US$.80. Bmobile says it is because I signed in as guest. (Which I have several times before and I paid in TT) so exactly where am I informed of this? So why was I not informed that in signing in as Guest this would happen during my online chat? Mind you, only after the transaction is completed only then I can see I was billed in US. Plus only then my credit card transaction showed the additional charges!!! I requested that my transaction be reversed which is normally adhered to by US companies. Of course I was told that cannot be done! If you want to bill us in US...u also need to look at how the US does it! Your service lacked customer service and once again local companies have miserably failed us!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shantie Ramoutar",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T07:59:36.000Z",
          "Titre": "I paid 50 US to get a monthly plan i…",
          "Contenu": "I paid 50 US to get a monthly plan i did it before but they only put the money on the phone which I think is a top up and that's not what I wanted.I want the monthly plan."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T14:06:52.000Z",
          "Titre": "Email Address Field Size is too small",
          "Contenu": "Email Address Field Size is too small. The android app only accepts email addresses which are 30 characters or less. My email is 31 characters. In order to use this app, I had to create a new email account. What an inconvenience!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gilbert",
          "Nb_Reviews": 4,
          "Date": "2023-08-29T16:40:32.000Z",
          "Titre": "they failed yet again",
          "Contenu": "This week marked the 2nd time that this company failed to process an auto top on and almost caused us to lose the balance because of their failure.  The first time this happened, they apologized for the error and made good by crediting us back with the lost balance and said everything was now fixed.  Well, this week they again missed a top up date and if we did not personally check it, and manually do a top up we would have lost the balance again.  They apologized and said the error was fixed to please cancel current auto top up and reenter a new one, but we cannot trust this company any longer.  There are other, more reliable companies to use.  I would definitely NOT recommend them for topping up cell phone numbers."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer - Julia Harrison",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T13:34:01.000Z",
          "Titre": "This is my first time using the online…Topup",
          "Contenu": "This is my first time using the online topup. I purchased a 40 TTD topup and upon receiving same it reduce an amount. before topping up I had try getting a bligh which didn't work saying I owe them. Which I didn't I had top up the day before plus had left over credit. So how come I owe bmobile for a bligh. So when I try the online topup it took my money."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Ms Bobb",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T16:53:48.000Z",
          "Titre": "I am being robbed of  minutes and data",
          "Contenu": "I am being robbed, because if I purchase a service and pay why should it have an expire date because you call your price I agree and pay for minutes or data then you take it back and tell me it expire. That is modern day robbery the minutes or data should roll over until i spent my monies worth."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Judith B",
          "Nb_Reviews": 5,
          "Date": "2023-10-28T23:18:30.000Z",
          "Titre": "I paid but no top up on my account",
          "Contenu": "Thought I was topping up my Philippine Globe card- money has been bank but there is no top up"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T12:27:44.000Z",
          "Titre": "Lost credits",
          "Contenu": "A few months ago you caused me to lose hundreds of accumulated credits because you did not process my auto top up on time. I filed a complaint, but nothing ever came from it."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T19:01:30.000Z",
          "Titre": "Bmobile Users in T&T Check Your Bank Charges",
          "Contenu": "Wanted to give  ETopUpOnline 5 stars, but I do believe that they should instruct their operators (BMobile) to put an \"additional bank charges may apply\" disclaimer up for their customers so they are well informed about this transaction.Your email receipt from etopuponline will reflect the amount selected to top up your phone, however, your bank statement may show more. For example, it seems RBC in T&T charges $50 TTD for using their debit cards because they consider the transaction an international purchase. This means if you purchase a top up of $50 TTD, your bank statement will reflect $100 TTD. Basically, you could have gotten 2 top ups if purchased offline.Check in with your respective banks to ensure their bank charges aren't the same cost as the top up amount or more, it may be cheaper to purchase offline for some.Update: Upon review of other T&T nationals ratings on Trustpilot, it seems that eTopUponline and Bmobile have ignored the concerns and are well aware of the $50 TTD that debit card holders (RBC) are having to pay for some time now and yet still chose not to disclose to customers that though you pay in TTD some banks view it as USD transaction and charge accordingly. Keep the customers in the know, please, its only courtesy. It's quite simple, let customer's know what they are getting into and they won't feel bamboozled."
        },
        {
          "Note": 1,
          "Lieu": "SX",
          "Pseudo": "Rijkman",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T01:46:10.000Z",
          "Titre": "Because this is the second time I…",
          "Contenu": "Because this is the second time I purchased a top up and never got it"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T17:30:59.000Z",
          "Titre": "Suddenly I am being charged on my…",
          "Contenu": "Suddenly I am being charged on my credit card to use this service without any alert. I am very disappointed. This fee was not disclosed to me and I didn't authorize that payment."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Ann Ruiz-James",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T02:46:57.000Z",
          "Titre": "Payment for the etopUponline.Com It is with great disgust that I found…",
          "Contenu": "It is with great disgust that I found out that your company is using a foreign company that has to be paid in US but the amount is paid in TT on my Card. The bank that I have my  credit card with is now charging an OPT issuer fee. However, it was unknown to me until this month when I saw it on my statement"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer ife temu",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T21:02:37.000Z",
          "Titre": "I needed to get customer servicet help to top up instead…",
          "Contenu": "I needed to get help to top up instead I got an automated system which assumed  what I wanted then I do not get help.  Toped up 10$  not sure where it topped up to because the only number I have is written quite legible on my book so nothing. For this service....no phone service. It gets 0 stars no customer service in this new age...everyone gives  poor service yet they get paid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T01:52:09.000Z",
          "Titre": "promotional codes don’t work ever!",
          "Contenu": "Every time I get sent a promotional code to enter online for a discount, it never works. I double check the code to make sure it is correct and reread the email to make sure I’m using it in the day or days allowed and the code never works. This has happened multiple time but especially today with the 4th of July 10% off and I bought today on the 4th of July like the email says to do but no discount. It just a ploy to get you to get on the website and top up."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T01:53:47.000Z",
          "Titre": "Did not receive my topup after 1 hour…",
          "Contenu": "Did not receive my topup after 1 hour of having done the transaction and still waiting"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T15:37:54.000Z",
          "Titre": "Customer Experience",
          "Contenu": "There should be a feature to remember my log in information. Additionally, months ago you accumulated points from using the app which could be used toward a future purchase however this seems to be no more."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JD Marc",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T15:21:36.000Z",
          "Titre": "I have been trying to stop the process…",
          "Contenu": "I have been trying to stop the process because the number was incorrect and it still submitted and there is no customer service"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T21:23:55.000Z",
          "Titre": "I purchased the 7-day unlimited talk…",
          "Contenu": "I purchased the 7-day unlimited talk and text plan from your online portal and although it said purchase was successful, after 2 days, the plan discontinued on my mobile device. I then had to call bmobile to have the issue resolved and was on the line for close to 30 mins. I am extremely dissatisfied."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T04:56:57.000Z",
          "Titre": "Not Customer Oriented",
          "Contenu": "There us no option for buying a Top Up for the $49 3 Day Unlimited pre paid package. You either buy two $40 or one $100 since the $50 Top Up is $44.44. Not only is this needlessly inconvenient, it’s also very mercenary. I wouldn’t recommend this at all."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Rhonda joseph",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T21:50:21.000Z",
          "Titre": "Good day I never read anything about a…",
          "Contenu": "Good day I never read anything about a charge of 50$ coming out of my account plus the cost of the phone card 40$ so they took 90$ in all off my account that is to much to just top up 35$ on my phone to much money not worth it could walk up the road and spend less."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Adesh Maraj",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T17:40:22.000Z",
          "Titre": "It did not work",
          "Contenu": "It did not work. Do not use this service. Update 20th June 2023: sent an email to support with my email receipt. No response. The $300 dollar payment was removed from my credit card but still not added to my account.Update 2: had to call TSTT call center to get it resolved. No one ever reached out to resolve this issue. Would still not recommend this due to the support incase of error. It’s safer to buy a top up in person."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T15:57:46.000Z",
          "Titre": "You said the payment didn’t go through…",
          "Contenu": "You said the payment didn’t go through and to contact my bank. So I did it over and again said it didn’t go through. When I contact the bank it did go through twice and still no data received."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Navin",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T18:51:27.000Z",
          "Titre": "Terrible",
          "Contenu": "The option to use a credit card is well and truly a mess. The amount of tapping around is ridiculous to try to select the box to enter the cvc. I ended up choosing PayPal, but the conversion rates from US to TT are atrocious and I ended up paying more than 50 dollars more to top up."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Jesell",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T02:16:08.000Z",
          "Titre": "Query of Transaction",
          "Contenu": "On the aforementioned date, two transactions simultaneously pulled from my Bank Account unknowingly to me. It was an inadvertent act on my behalf,  which cost $161.38 extra for your service. Sadly, I was informed by customer support, that it was my fault (unknowing to me) for the mistake and I must be more careful in the future. Whilst I applied for your service I didn't see a disclaimer for your course of action to my problem so I will look forward to the solution."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T18:55:46.000Z",
          "Titre": "Delayed top up",
          "Contenu": "After credit was deducted from my card, it took over an hour for the monies to be applied to my phone. unacceptable"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Shivana James",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T17:14:21.000Z",
          "Titre": "Tell me why I purchased a $50 phone…",
          "Contenu": "Tell me why I purchased a $50 phone card but $100 was deducted from my account??????????"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Elisa Morden",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T12:29:39.000Z",
          "Titre": "Bought the package twice and it didn’t…",
          "Contenu": "Bought the package twice and it didn’t work. The assistant in Canaan couldn’t figure out why I was charged and the 3 day pkg was not working."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Paula Thomas Mark",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T20:56:40.000Z",
          "Titre": "I bought a $300 topup and my VISA card…",
          "Contenu": "I bought a $300 topup and my VISA card was charged $350. Apparently the charge by RBC bank for “foreign “ transactions was applied.That’s unacceptable.I should have been advised of the fee before the payment was processed"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Kevin mollineau",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T13:44:15.000Z",
          "Titre": "I made a purchase twice by mistake…",
          "Contenu": "I made a purchase twice by mistake because the page is very confusing with all the pop ups. The page is also crowded with things that are either hiding or covering the items being used at the time. Not clear and concise at all"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Raveena",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T00:48:47.000Z",
          "Titre": "Purchase Options",
          "Contenu": "Give the option to purchase whatever amount a customer requires."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Arian",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T00:02:05.000Z",
          "Titre": "Did not receive credit",
          "Contenu": "I paid for a top up online- $400 and did not receive the credit despite the email confirmation stating I did. I then I had to buy another top up for $150 just to get through the day which was successful and I received. I am requesting my $400 back please"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "KR",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T00:07:20.000Z",
          "Titre": "Not enough top up options",
          "Contenu": "The required top up amounts were not there...the denominations are either too much or too little...whilst it is convenient to do this over the phone, more options are necessary. I have lost money because of the incorrect top up amounts"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T18:53:51.000Z",
          "Titre": "I selected to top up with a 1wk plan…",
          "Contenu": "I selected to top up with a 1wk plan and credit was sent to the phone instead. The owner of the phone was hospitalized and didn't realize that he was using credit as opposed to a bundle and ran out of credit leaving him unable to make urgent calls re his health."
        },
        {
          "Note": 1,
          "Lieu": "SX",
          "Pseudo": "PM",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T11:14:43.000Z",
          "Titre": "Everything went wrong",
          "Contenu": "Everything went wrong!   I am tired of contacting you and trying to correct an ice with adding a new credit card this is in date. The card you have on file expires 8-23!    I have anew card that I need to add!You will not give me a phone number to call and speak to someone!  You are located in Exton, Pa. I live in West Chester, Pa.  I went to your chat line asked a question and get the same regurgitated pre printed answers that have nothing to do with my issues!"
        },
        {
          "Note": 1,
          "Lieu": "GY",
          "Pseudo": "customerkwisha",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T03:11:39.000Z",
          "Titre": "Everybody saying something different",
          "Contenu": "Everybody saying something different, no one ones whats going on and the can’t even check up on the history of the account."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T16:37:13.000Z",
          "Titre": "There was a glitch",
          "Contenu": "There was a glitch. I renewed my month subscription a few days ago using the Topup app. And it sent me a text last night saying that my subscription/account had dropped too low. Frustrating experience."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "McG",
          "Nb_Reviews": 3,
          "Date": "2023-07-02T03:59:15.000Z",
          "Titre": "Etopup Credit to another phone not received",
          "Contenu": "This is the 2nd time I have used the etopup to credit another person's phone number and the credit was not received.I will not be using this service again to top up someone else's account."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "NJ",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T14:32:32.000Z",
          "Titre": "Chatbot icon needs to be moved",
          "Contenu": "The little chatbot icon is annoyingly over & blocking the space for selection to continue. It needs to be moved to another place on the page which is not obstructive to the user."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T01:27:58.000Z",
          "Titre": "I resent that Bmobile wants access to…",
          "Contenu": "I resent that Bmobile wants access to my email account and or my Facebook activity when I use the app to purchase data. This is inherently wrong and manipulative. I am strongly recommending that this practice be stopped immediately."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T01:24:21.000Z",
          "Titre": "Cannot access my points …",
          "Contenu": "I have ove 8000 points on my account and can not access it to benefit from discounts when topping up.. Who can help . I am a loyal customer and use this app often."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T22:15:34.000Z",
          "Titre": "I sent a top up for # 509 3506 1451 the…",
          "Contenu": "I sent a top up for # 509 3506 1451 the other for $12 which was a diamond plan at the time for a whole month, but you guys took my money and didn't put the credit on the count. I believe that was stealing, because people work to hard for their money"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T00:04:47.000Z",
          "Titre": "The customer didn’t receive de 14.99…",
          "Contenu": "The customer didn’t receive de 14.99 plan I paid for. He received nothing, only the text message .You just steal my money."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Mendel",
          "Nb_Reviews": 3,
          "Date": "2023-10-15T08:57:36.000Z",
          "Titre": "The transaction did not go through and…",
          "Contenu": "The transaction did not go through and I tried two different credit cards."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T21:20:37.000Z",
          "Titre": "I’m very disappointed with the way…",
          "Contenu": "I’m very disappointed with the way money just disappears when I was topped up .. got 222 on sept 6 and by sept 13 I lost 168…just so!! I had to top up again… I did not use any data on that day and 168 just disappeared!! Please I’d like to get it back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T04:53:20.000Z",
          "Titre": "My screen said \"transaction failed\"  my…",
          "Contenu": "My screen said \"transaction failed\"  my bank accout transaction said \"Processed\".. Submitted a request for a refund..... No response.... You expect a good report."
        },
        {
          "Note": 1,
          "Lieu": "PR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T13:33:59.000Z",
          "Titre": "What happen with the rewards"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T02:07:54.000Z",
          "Titre": "I tried to use my First Citizens Debit…",
          "Contenu": "I tried to use my First Citizens Debit Card and i forgot to put in the address, and when I did, because it had an error because of the address the first time, my card got blocked."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "richard",
          "Nb_Reviews": 9,
          "Date": "2023-04-17T22:16:08.000Z",
          "Titre": "Failed top up a few days ago",
          "Contenu": "I've been using etopup for over a year now.... But recently system went down and I couldn't top up my daughter's phone. She had to go out the road and get a phone card. It was very inconvenient...I had four failed attempts and had to send emails to the phone company to make sure I wasn't charged four times. Very inconvenient🤨"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T04:45:12.000Z",
          "Titre": "Doubled charge didn’t give me my money…",
          "Contenu": "Doubled charge didn’t give me my money or rollover the money for another week and charge me again and didn’t give me service"
        },
        {
          "Note": 1,
          "Lieu": "GY",
          "Pseudo": "BW",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T23:38:40.000Z",
          "Titre": "On 14/06/2023 purchased a 14days…",
          "Contenu": "On 14/06/2023 purchased a 14days outgoing & Incoming roaming calls package for my IPhone to use in Guyana where I work at present, only to realize when I arrived in Guyana I couldn’t make outgoing roaming calls. It was only after I contacted a Bmobile Rep in Trinidad I was told that I had to take my Iphone to one of your Bmobile outlets before I left Trinidad to have something done to the SIM card before I could use it to make roaming calls in Guyana. Why wasn’t this information posted on your online Bmobile web page where I purchase the online package. I spent approx $178.00 for a package that I can’t use because I am in Guyana for the next couple of weeks and by the time I return to Trinidad for whatever adjustment to done to my SIM card, the package will be expired and I would have lost my $178.00 that I paid for the package. It’s unfair to me and I think that I should be give some kind of credit to my account for not being provided with the relevant information when I was purchasing the package online.***Thank you bmobile for the quick reply I received to my review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T06:40:54.000Z",
          "Titre": "Roaming plan did not activate",
          "Contenu": "Bought a roaming plan for my prepaid SIM that did not activate. Complete waste of $400. Will not be using service again."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T14:20:19.000Z",
          "Titre": "Worst experience",
          "Contenu": "Worst experience. I paid for data top up but the amount got credited to the mobile service."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Unimpressed customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T14:11:57.000Z",
          "Titre": "Too complicated! Limited bundle options 😠",
          "Contenu": "1. There are not enough bundle options.2. The top-up options are not sufficient to pay for a bundle after VAT is deducted.I had to buy 3 separate top-up amounts to buy the bundle I needed.If it was not raining, I would have gone to a Bmobile location to save my time and reduce the stress!"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T16:36:58.000Z",
          "Titre": "Bad Experience",
          "Contenu": "I got the prepaid $40 top up but was charged $90. This is the second time that it has happened. I don't think I'll use this app again. It seems to be a scam."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Stefan",
          "Nb_Reviews": 5,
          "Date": "2023-07-20T13:52:09.000Z",
          "Titre": "I understand the need for fees but…",
          "Contenu": "I understand the need for fees but Digicel does not charge such a high fee to top up using my linx card. $50!!!!! With a card issued by a local bank. That's ridiculous."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Sabita",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T10:55:28.000Z",
          "Titre": "Tried to do to etopuponline one after…",
          "Contenu": "Tried to do to etopuponline one after the other. For some reason didn't get through. I don't know if I was charged. Still checking on that. I did the same information so why didn't it go through"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T02:32:05.000Z",
          "Titre": "Hi good day I now checking my account…",
          "Contenu": "Hi good day I now checking my account and you all charge me 90$ for 40$ bmobile card what nonsense is this never me again"
        },
        {
          "Note": 1,
          "Lieu": "FJ",
          "Pseudo": "JB Fiji",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T10:40:55.000Z",
          "Titre": "I topped up using my  Aussie credit…",
          "Contenu": "I topped up using my  Aussie credit card. I purchased $50 for both our Voda and Digi numbers, your payment cost A$6.91 more for the same transaction.Rip off!"
        },
        {
          "Note": 1,
          "Lieu": "LC",
          "Pseudo": "Nicola Dauvergne",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T12:19:49.000Z",
          "Titre": "I tried to put topup with etopup and…",
          "Contenu": "I tried to put topup with etopup and both times the topup never went through. Both times i was charged when the site stated i will not be charged. Luckily i took screenshots. I have been in a back and forth with support to no avail. ETOPUP YALL ARE CROOKS AND THIS IS THEIVERY WHEN YALL STATED MONIES WONT BE DEDUCTED AND YOUR STAFF CONFIRMED IT DIDNT GO THROUGH. I NEED MY MONEY REFLECTED ON MY ACCOUNT OR I WILL TAKE IT TO SOCIAL MEDIA WITH ALL MY SCREENSHOTS. PLEASE FIX IT WE ARE ON DAY 5. I WISH TO NEVER USE THIS SITE AGAIN! IT IS UNSAFE!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Rainer",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T18:12:59.000Z",
          "Titre": "It is unacceptable that for a service…",
          "Contenu": "It is unacceptable that for a service rendered in T&T by a local company (bMobile) using their app that a TT$ amount which is charged to my credit card for a top up is actually processed by a foreign company in US$ currency and therefore takes away from my monthly  allowance I have available on my credit card for US$ purchases. The top up should be only charged in TT$ to my local credit card!"
        },
        {
          "Note": 1,
          "Lieu": "SX",
          "Pseudo": "VapeClouds",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T16:03:26.000Z",
          "Titre": "It charged my credit card without receiving credit.",
          "Contenu": "It charged my credit card. Charge currently pending but no credit received. It happens every time."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T16:33:12.000Z",
          "Titre": "I loss 250.00 tt Dollars  with in 45…",
          "Contenu": "I loss 250.00 tt Dollars  with in 45 mins of topping up, the system did not generate a prompt to advised that the top up amount was not sufficient ."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T03:25:21.000Z",
          "Titre": "Charged my card but received no money…",
          "Contenu": "Charged my card but received no money to top-up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kifa",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T16:36:55.000Z",
          "Titre": "Regret using this app send money to the…",
          "Contenu": "Regret using this app send money to the wrong account and tell me it final and u could go to and other cell phone companies and reverse the payment to the right account number f**king app"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alexis E Smith",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T14:05:14.000Z",
          "Titre": "Good morning all I am having a…",
          "Contenu": "Good morning all I am having a challenge getting access to service purchase no service can't text make calls no service"
        },
        {
          "Note": 1,
          "Lieu": "AS",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T22:18:00.000Z",
          "Titre": "made a purchase of $10",
          "Contenu": "made a purchase of $10. after an whole hour, still havent received my topup."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CHRISTANIEL FLAMAN",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T13:18:03.000Z",
          "Titre": "I top up a wrong number I called…",
          "Contenu": "I top up a wrong number I called customer service at the same time they told me they cant give me a refund or a credit"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "NJ",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T04:04:19.000Z",
          "Titre": "I haven't been getting any reward…",
          "Contenu": "I haven't been getting any reward points with my recent purchases."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "No Howard",
          "Nb_Reviews": 4,
          "Date": "2023-05-10T02:38:14.000Z",
          "Titre": "Rubbish options and a total rip off to…",
          "Contenu": "Rubbish options and a total rip off to the people of Guyana. Paying through the nose for sad data plans GTT get into the 21centry and stop bleeding the people dry."
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T19:58:12.000Z",
          "Titre": "Lack of refund/alteration to order",
          "Contenu": "Lack of refund/alteration to order. Ordered a plan instead of topup inadvertently and there’s no way to alter same"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T14:35:24.000Z",
          "Titre": "Increase Amounts",
          "Contenu": "Only 1 problem......you should allow for a higher top up amount. Otherwise, flawless app."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T22:50:07.000Z",
          "Titre": "i normally use my yahoo email and this…",
          "Contenu": "i normally use my yahoo email and this time i couldnt use it as a guest account via my tablet."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Greg L",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T00:44:20.000Z",
          "Titre": "Service purchased was not delivered",
          "Contenu": "eTopUpOnline is a reseller for Natcom in Haiti. I made multiple  purchases for 15-day prepaid Internet plans for 2 different mobile numbers in Haiti. In all cases the mobile numbers did not receive the promised Internet plans... they received much lower-valued prepaid minutes instead.No satisfaction from eTopUpOnline... they say they processed the transaction. If the service they sold was not received, take it up with the  mobile operator... it's not their problem.This occurred on multiple occasions with multiple transactions. I am a very unsatisfied customer.Updated on 2023-04-24:I received an email from eTopUpOnline today claiming they resolved the problem, but they did NOT.In fact, they did absolutely nothing, except to repeat the same thing as they have on previous occurrences:  that the transaction was processed.The transactions were indeed processed, but NOT for the services purchased. This was made PERFECTLY CLEAR in my original complaint.In both cases I purchased Natcom 15-day Internet plans for 2 mobile numbers. But the those numbers did NOT receive the purchased services. Instead they received a much lower credit value for minutes only... no Internet... and worth only a fraction of the purchased value.If I could rate eTopUpOnline lower than one star, I would. Absolutely terrible value, terrible to do business with, terrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T06:28:26.000Z",
          "Titre": "I had 146 dollars remaining on my…",
          "Contenu": "I had 146 dollars remaining on my balance and when I topped up all the existing balce was gone."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T01:08:18.000Z",
          "Titre": "I did not receive my top up",
          "Contenu": "I did not receive my top up. No customer service."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T16:31:32.000Z",
          "Titre": "Glitches in the system",
          "Contenu": "Glitches in the system - it was not allowing me to sign in nor change my password. This is not the first time this has happened"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rony Charles",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T14:21:57.000Z",
          "Titre": "Fix your website",
          "Contenu": "Fix your website, don’t wast people’s timeFrom November 1 -4 I couldn’t even login to my account, it keeps saying invalid password or login ID .Now it let you in, it takes like 2or 3 hrs ti receive the top up after you purchased it."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "B. Richards",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T05:25:39.000Z",
          "Titre": "There should be an option to pay in…",
          "Contenu": "There should be an option to pay in local currency"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Melissa Singh",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T15:15:51.000Z",
          "Titre": "Error code but transaction was processed",
          "Contenu": "This service is quick and easy to use. Simple user interface. However, when I attempt to purchase a top-up the app said that there was an error, so I assumed the transaction did not go through. So I did it again and got the same pop up. However, according to my email message from the bank the payment occurred twice and the money was sent. Please rectify this issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T23:03:01.000Z",
          "Titre": "This is the 2nd times amongs all the…",
          "Contenu": "This is the 2nd times amongs all the time I sent minutes you or the other party did not share my minutes.Last time it was a $36 lost. Last night, it seems your successful sent was not successful at all."
        },
        {
          "Note": 2,
          "Lieu": "SX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T18:01:13.000Z",
          "Titre": "Outdated System",
          "Contenu": "It's just not a very good system. Also, it doesn't show anywhere online or in the app what my current balance is. I feel like the 1990s was poorly translated into a webpage/app."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T10:20:40.000Z",
          "Titre": "Vodafone PNG online top up has been…",
          "Contenu": "Vodafone PNG online top up has been down for 3 months. Are you serious? Had to go through a 3rd party online payment system to get enough data. Really terrible service."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T17:39:17.000Z",
          "Titre": "Needs lower top up amounts as well as…",
          "Contenu": "Needs lower top up amounts as well as why don't we pay the vat up front and get the amount you pay for."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 5,
          "Date": "2023-10-02T01:49:51.000Z",
          "Titre": "It declined all of my credit cards and…",
          "Contenu": "It declined all of my credit cards and debit card. I’ve tried about all of five of them and none of them never work with your company is not in my bank is your company"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T00:43:08.000Z",
          "Titre": "I used e top to activate my account…",
          "Contenu": "I used e top to activate my account because its expired but I'm still locked out and can't make calls"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T00:21:03.000Z",
          "Titre": "I have topped up on line for years",
          "Contenu": "I have topped up on line for years . Now it keeps saying my email isn't registered even though all my credit cards are saved . I am in the states and it has taken me a week to top up one phone and the other phone still hasn't went through"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Samella",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T15:50:40.000Z",
          "Titre": "Hey a suggestion",
          "Contenu": "Hey, the only issue I have is putting in the top ups and the prices they give you includes the tax, so I usually buy $100 phone cards but this is actually $88 and then I have to get the$150 phone cards which is a little over my budget. Is it possible to have that option?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "james perkins",
          "Nb_Reviews": 4,
          "Date": "2023-06-01T23:10:34.000Z",
          "Titre": "your site was not working right,i tried…",
          "Contenu": "your site was not working right,i tried for several times transaction didn't go through...finally i tried again and it finally went through,  was very discouraging,even called my bank,there was no problem with my bank...i hope it will work better from now on"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "SAL",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T01:29:56.000Z",
          "Titre": "No details of Special Promotion visible to me..",
          "Contenu": "I was not able to see any details of the special promotion which you are running between July 12 and July 16. I need a confirmation that the extra bonus minutes and unlimited internet data was added to the mobile number I topped up. Thanks"
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T13:27:12.000Z",
          "Titre": "Software needs work",
          "Contenu": "Information on how to add another viewer through the internet VERY difficult to find.Also. software did not identify  5mhz network connection mistake. I would not buy another Tapo device."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Roseanne",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T15:31:30.000Z",
          "Titre": "I would like to be able to choose my…",
          "Contenu": "I would like to be able to choose my top up value please"
        },
        {
          "Note": 2,
          "Lieu": "PG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T23:29:53.000Z",
          "Titre": "Gave me less credit than indicated",
          "Contenu": "It worked, but the website said that I would be receiving K64.00, but I only received K63.00. It felt like I was getting yet another service fee, but not one that I consented to."
        },
        {
          "Note": 2,
          "Lieu": "SX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T03:19:34.000Z",
          "Titre": "Too much of a long process to do an…",
          "Contenu": "Too much of a long process to do an online top up. Info should be saved from previous transactions. Or create a password word method for continuing customers to make top up process easier"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T05:48:45.000Z",
          "Titre": "When topping up online from another…",
          "Contenu": "When topping up online from another country, bmobile doesn't use the current exchange rate. So I ended up paying more, for less TT dollars worth of phone credit."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "SM",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T17:36:30.000Z",
          "Titre": "Simple changes needed to improve customer experience",
          "Contenu": "There are only two plans in the menu 7 day 99TTD and 30day 349TTD. How hard is it to include other plans (e.g. bproductive 149TTD or 30day 239TTD etc).There are limited denominations to choose from when paying, fair enough, but logically they should be varied enough that you can combine them to match the plan offerings. Otherwise you pay more than you need and can then potentially lose the extra amount to obscure charges.This app charges USD for less TTD i.e. 6.5TTD meaning a 4.4% extra cost for customer who pays the bank 6.8TTD for USD."
        },
        {
          "Note": 2,
          "Lieu": "TH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T22:55:16.000Z",
          "Titre": "Poor",
          "Contenu": "When you top-up the confirmation doesn't tell you when it expires. When you try to do auto top up, it only gives you up to 30-day interval... which is illogical since some top-ups expire in 60/120days...."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Kaminie Ellie",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T20:59:21.000Z",
          "Titre": "Dishonesty",
          "Contenu": "The wait time to receive a feedback was lengthy. And the customer service agent presented in accurate information. And only corrected it when I requested more information. They said the funds were used up by the incorrect number, when the incorrect number was mine. So on the receiving end it came across as a dishonesty."
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T00:07:05.000Z",
          "Titre": "Charged for failed orders",
          "Contenu": "I tried an order and it failed twice, I was still charged twice. On top, it sends a lot of emails about promos and then always says invalid when you try to use them."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T16:45:00.000Z",
          "Titre": "Service is efficient",
          "Contenu": "Service is efficient. They should charge the tax added to the total. For example I want to put $100 on my phone. Show that the charge for $100 is $1**.00 instead of 100 minus tax amount"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T15:20:03.000Z",
          "Titre": "Costs more than a regular top up",
          "Contenu": "I bought a $200.00 card and was charged $213, then after that the VAT exclusive amount added to my account was 177.77, meaning $22.23 was taken as VAT.I still don't understand why an extra $13 was charged. I believe they should advertise the amount you'll get on your card, along with the actual price you would pay."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roger Edghill",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T14:42:56.000Z",
          "Titre": "Untrustworthy app",
          "Contenu": "Untrustworthy app. Transaction appears suspicious. I will not be using this again.Already deleted from phone."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Mandy",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T16:45:26.000Z",
          "Titre": "More than 1 hr wait for Top Up",
          "Contenu": "I bought the card and had to wait 1 hour 30 mins for the money to be credited to the phone. Supposed it was an emergency?? This service usually applies the credit instantly. This time is was a complete failure."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T14:36:23.000Z",
          "Titre": "I’d like the option to use visa debit…",
          "Contenu": "I’d like the option to use visa debit cards on the topup app because I’d rather not have to use my credit card to topup."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Michael Dookhoo",
          "Nb_Reviews": 3,
          "Date": "2023-09-25T19:12:42.000Z",
          "Titre": "charged for a top up that did not go…",
          "Contenu": "charged for a top up that did not go through even though your website said it won’t be charged."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Ronald heera/petra heera",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T15:48:14.000Z",
          "Titre": "Lost all my $290 on an auto renew plan",
          "Contenu": "Lost all my $290 on an auto renew plan! Never win with queries!!! Something that I have been using all along but this time a different story"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Coz",
          "Nb_Reviews": 4,
          "Date": "2023-04-07T03:14:26.000Z",
          "Titre": "They Limit The Amount to Charge Extra…",
          "Contenu": "The app is good but why they limit the amount one can send.If you try to send a $40 or $50 the transaction failed then when break it and send it twice they charge a bigger fees than once. I think it's intentional."
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "Angie",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T17:10:07.000Z",
          "Titre": "Loading finally worked after many…",
          "Contenu": "Loading finally worked after many attempts over many days. Doesn’t work through app no matter what. Now my “free promo” for loading is not showing up."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Elle",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T20:08:21.000Z",
          "Titre": "I had three sets of error messages",
          "Contenu": "I had three sets of error messages. I had to Top-up another phone that I had instead before it went through."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T21:56:48.000Z",
          "Titre": "There should be a method to reimburse…",
          "Contenu": "There should be a method to reimburse customers who made an error within a certain time frame instead of being told there is nothing we can do."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T02:32:33.000Z",
          "Titre": "Takes long to receive and transaction…",
          "Contenu": "Takes long to receive and transaction failed twice"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ray",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T23:28:47.000Z",
          "Titre": "Customer was unable to receive the…",
          "Contenu": "Customer was unable to receive the credit until they turned their phone off and on about 6 times. They also had to turn their data on and off about 6 times .  They had to turn wifi on and off about 6 times.   Digicel just credits better than bmobile. Y’all need to fix that."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T18:17:19.000Z",
          "Titre": "I am being charged a fee to use this…",
          "Contenu": "I am being charged a fee to use this service now and that wasn't so before"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Loulouse Macajoux",
          "Nb_Reviews": 3,
          "Date": "2023-04-28T20:32:26.000Z",
          "Titre": "I sent 3 credits plan data to 3…",
          "Contenu": "I sent 3 credits plan data to 3 different numbers, the persons didn't get them.I don't know where to get my money back. I wrote no answer.You did bad and I am afraid to buy from you."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T03:20:18.000Z",
          "Titre": "Purchase of plan",
          "Contenu": "I believe we should be able to purchase any data/call plan, that we want."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Wendy",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T01:40:13.000Z",
          "Titre": "I paid for a data plan and although the…",
          "Contenu": "I paid for a data plan and although the recipient was able to use the phone right away, he is not able use the data???????  He sees that I am calling on Messenger but when he tries to answer the call doesn't connect.  Also, with WhatsApp, the call doesn't go through."
        },
        {
          "Note": 2,
          "Lieu": "SX",
          "Pseudo": "Maria Casale",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T18:28:31.000Z",
          "Titre": "Topp up never received",
          "Contenu": "I have topped up on June  11th for the amount of $30.00 and never recieved the credit.The amount has been charged to my credit card.Transaction no. 378597656."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T16:49:18.000Z",
          "Titre": "Can’t update credit card Same number…",
          "Contenu": "Can’t update credit card Same number New expiration Date. New Cv"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T02:59:55.000Z",
          "Titre": "Yall need an app",
          "Contenu": "Nothing went wrong. Yall just need an app where I can do everything in one place. I was with digicel befote, and now it feels like im back in 2010. Get an app"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Vanessa",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T20:36:17.000Z",
          "Titre": "More plan options needed…",
          "Contenu": "There should be more plan options available for monthly subscription"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Parnel Beauport",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T17:06:34.000Z",
          "Titre": "For $20 you give out 2200 gourdes",
          "Contenu": "For $20 you give out 2200 gourdes& Digicel give 2856 gourdes to me that's a rip off, that's not fair at all to do that."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T14:41:40.000Z",
          "Titre": "The next button for each page is…",
          "Contenu": "The next button for each page is covered by the chat icon. Difficult to access the button to go to the next page."
        },
        {
          "Note": 2,
          "Lieu": "VE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T12:52:00.000Z",
          "Titre": "The second transaction is still…",
          "Contenu": "The second transaction is still processing. This is unacceptable during an emergency."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Stephanie Looknanan",
          "Nb_Reviews": 1,
          "Date": "2022-11-06T01:04:17.000Z",
          "Titre": "E top up overcharge.",
          "Contenu": "On 20/10/22 I downloaded the app and did my first top-up of $60 which was billed $67.50. On checking my bank transactions today, I observe $117.50 was deducted. What's the readon for the additional $40?"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T01:43:16.000Z",
          "Titre": "I had to pay via PayPal which is much…",
          "Contenu": "I had to pay via PayPal which is much more expensive. Your website denied adding my credit card."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T12:53:25.000Z",
          "Titre": "- Smaller top up amounts",
          "Contenu": "- Smaller top up amounts. - Confirm/send button was mostly covered by the live chat button."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T11:58:37.000Z",
          "Titre": "Got a 40 and it finished in less than a…",
          "Contenu": "Got a 40 and it finished in less than a day only made 3 short phone calls"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T01:18:00.000Z",
          "Titre": "Your dialog box is covering the next…",
          "Contenu": "Your dialog box is covering the next button!!!!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Keron Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T20:30:16.000Z",
          "Titre": "Overcharged",
          "Contenu": "I bought a $100.  However $150. was deducted from my debit card. Phone number 678 0071."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Reno",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T12:40:39.000Z",
          "Titre": "Watch out they'll get you",
          "Contenu": "Put in a 1 wrong number cost me 10 dollars I noticed right away you couldn't reverse or fix enjoy the 10 dollars I'll find another way to load"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T02:04:02.000Z",
          "Titre": "Couldn't use my visa debit card",
          "Contenu": "Couldn't use my visa debit card.  Had to rely on my credit card."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T20:44:19.000Z",
          "Titre": "mobile app needs some work",
          "Contenu": "It’s generally okay but The mobile app needs some work. The button to continue clashes with the chat button. It’s also not clear when the transaction is completed."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Modern User",
          "Nb_Reviews": 2,
          "Date": "2022-11-06T19:33:34.000Z",
          "Titre": "Custom $ amounts are a thing",
          "Contenu": "Custom $ amounts are a thing. Either your programmer is crap or your business strategy is. A simple tax calculation will suffice."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rene7",
          "Nb_Reviews": 6,
          "Date": "2022-09-15T04:13:36.000Z",
          "Titre": "Your website is really poorly thought…",
          "Contenu": "Your website is really poorly thought through!  There are far too many clicks, and simple requirements such as updating the date of a saved credit card are hidden very far elsewhere on your site, instead of where you actually are give the choice of which one to use.Moreover, your CC processing fails as often as it succeeds, all with the same card(s)!Finally, your little chat box is more frustrating than usefull."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T04:17:42.000Z",
          "Titre": "I use this site because you offered…",
          "Contenu": "I use this site because you offered reward points. Now that has been canceled so it is no different from any other site"
        },
        {
          "Note": 2,
          "Lieu": "BQ",
          "Pseudo": "Bahati",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T18:40:17.000Z",
          "Titre": "I would prefer to use a mobile app for…",
          "Contenu": "I would prefer to use a mobile app for this.  Thanks,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Batch",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T19:19:30.000Z",
          "Titre": "Charge too much",
          "Contenu": "Charge too much . Exchange rate went up but they still keep the same old rate"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T20:14:19.000Z",
          "Titre": "updating of expired credit card…",
          "Contenu": "updating my expired credit card information was unnecessarily tedious and time consuming."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T19:00:35.000Z",
          "Titre": "Couldn’t use debit card"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T09:13:32.000Z",
          "Titre": "Stupid fee coming out the top up."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T02:20:14.000Z",
          "Titre": "The promo said\"$80 FREE Credit is…",
          "Contenu": "The promo said\"$80 FREE Credit is yours. Simply Top up $40 or more TODAY..... Bonus credit for 72hrs...\"I went to the online TopUp. There were options for Topup: $40, $50, etc.I topped up with the $40. According to the promo I should have received the $80 Free Credit.This did not happen. Instead I got 1GB.This Promo is totally misleading and probably illegal."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T16:20:46.000Z",
          "Titre": "Too expensive to use!!"
        },
        {
          "Note": 2,
          "Lieu": "CL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T04:10:48.000Z",
          "Titre": "I give You 2 atars.",
          "Contenu": "I give You 2 atars..  if after 180 Day s dispute of  paypal the source of my transaction.. if Natcom Haïti..does not steal recharges on my Phone.. next time.. I will give you 5 stars.. thk's"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mytinis",
          "Nb_Reviews": 2,
          "Date": "2022-05-03T15:06:10.000Z",
          "Titre": "The only thing about this company is…",
          "Contenu": "The only thing about this company is that it gets the top up credit to the recipient fairly quick but as for value for money it’s definitely not as Rebtel for just £10 to Sierra Leone you get 152.000 leones as to this company that I spent £13 plus and only 120.000 leones.Now only a complete fool would waste their time to use this company"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T16:43:52.000Z",
          "Titre": "It rejected my credit card so I had to…",
          "Contenu": "It rejected my credit card so I had to use PayPal and pay in USD"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T19:25:20.000Z",
          "Titre": "Ding was temporarily down so used this app",
          "Contenu": "Ding was temporarily down. Had to use this app to send credit. Noticed that not only I had to manually add the phone (had to tripple check the numbers enter when Ding seamlessly sync with contacts so there is no need to do this) but confirm the Carrier (Ding also finds the Carrier without having to do anything) . Either way it was still easy to send credit although it might have been costly if made any mistakes"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T14:28:00.000Z",
          "Titre": "I do not like that you all constantly…",
          "Contenu": "I do not like that you all constantly change the top up amount"
        },
        {
          "Note": 2,
          "Lieu": "GY",
          "Pseudo": "IAG",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T17:44:03.000Z",
          "Titre": "Hate the fact that there are extra…",
          "Contenu": "Hate the fact that there are extra charges. I selected the option to pay in GYD, yet still I was charged $168 extra.Added to that I still had to pay an additional $200 in a service charge. So essentially I paid $3,368 for $3000 credit. Definitley will not be using this form of service to recharge my account again."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Lisa A",
          "Nb_Reviews": 2,
          "Date": "2022-07-14T00:07:09.000Z",
          "Titre": "Slow online top up",
          "Contenu": "It took rather sometime(say 30 minutes) for my top up to get to my account. I thought when you requested online top up it will be quick. I was disappointed so most likely will not use this service often."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-15T01:59:33.000Z",
          "Titre": "I get a normal 'top-up' when I pay for a 'month plan'",
          "Contenu": "I have been requesting a 'month plan' when I top up, but instead have been receiving a normal 'top-up'. The receipt sent to my email also says 'top-up' although the receipt shown on the phone after the purchase says 'month plan'. These top-ups are being sent to 868-493-3422."
        },
        {
          "Note": 2,
          "Lieu": "KY",
          "Pseudo": "Denver Douglas",
          "Nb_Reviews": 1,
          "Date": "2021-09-29T23:04:11.000Z",
          "Titre": "Every time  I top up with $10.00 it is…",
          "Contenu": "Every time  I top up with $10.00 it is used up in a couple days.$20.00 will last me 4-5 weeks.Editing my review will not justify basically loosing $10.00This is third time this has happened to me.There is always the response that my data used it up, I have no data plan, my data is always on OFF. How can you justify this happening three times.A credit for half the amount $ 15.00  certainly would be justified in my mind as a Business Man."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2021-09-24T12:09:02.000Z",
          "Titre": "Bmobile removed the option to pay for…",
          "Contenu": "Bmobile removed the option to pay for VAT separately on checkout which was a needed feature. And there was one time I paid to send a data plan to another phone and it never went through. And there was another time I paid to top up my phone and it never went through. And I never got a reason from bmobile technical support.  Horrible platform"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "vernon yarde",
          "Nb_Reviews": 3,
          "Date": "2023-04-29T01:58:35.000Z",
          "Titre": "You charged me 90$ instead of 40$…",
          "Contenu": "You charged me 90$ instead of 40$ that’s what wrong"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Persad Bhagailoo",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T12:37:48.000Z",
          "Titre": "Credit Card Info Update",
          "Contenu": "I couldn't update my credit card info, with respect to the expiry date and CVV number. When I tried to input a new card, a blocked transaction kept recurring. I had to then use my paypal account, which I did not want to, since the $US conversion rate is higher, but was forced to do so as I had no choice"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "sunil lalloo",
          "Nb_Reviews": 2,
          "Date": "2021-11-09T23:09:49.000Z",
          "Titre": "Convenient but needs upgrading.",
          "Contenu": "The system is easy and convenient, but there are a few features I wish it had. You should have the option to pay the taxes in advance instead of it being deducted. Also, the auto top-up feature should allow you to select lengthier intervals - such as 3-4 month periods when your balance would expire. Instead of getting stupid messages from Bmobile, how about a reminder just before my balance expires? Apart from repeating transactions, the system should allow you to save numbers that you can easily select them for sending top-ups."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lin-Jay Harry-Voglezon",
          "Nb_Reviews": 3,
          "Date": "2022-01-10T13:51:38.000Z",
          "Titre": "Unacceptable system",
          "Contenu": "A company should not have a system whereby neither the customer nor the company could correct a transactional error. That's my experience here; totally unacceptable. It is even more disappointing since the number that was mistakenly credited seems to be inactive."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T14:46:01.000Z",
          "Titre": "Did not receive the topup."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-23T04:37:22.000Z",
          "Titre": "More versatile top-up amounts needed",
          "Contenu": "The top up amounts should be more versatile. Persons should be allowed to type in the amount they would like to top up upwards of a fixed minumum and then the addition of the VAT. Too many times I’ve had to top up excessive amounts because of the ridiculous figures you have stated on this website as the only options. Please do better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marge",
          "Nb_Reviews": 2,
          "Date": "2022-04-04T19:22:52.000Z",
          "Titre": "Won’t accept my Belize Bank debit card",
          "Contenu": "It would be nice if a Belize company would honor a Belize debit card. I tried to use my Belize Bank debit card and it would not accept. I had no problems using my Bank of America US credit card, which I am lucky to have in this case."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Gregoz",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T07:53:30.000Z",
          "Titre": "eTopuponline only works in a few countries",
          "Contenu": "There are so many countries and carriers where etopuponline does not work and you have to use other providers who seem to have no problem making it work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A CUSTOMER",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T00:49:59.000Z",
          "Titre": "This is the first time I am using this.",
          "Contenu": "This is the first time I am using this.Firstly I used a tnt credit card and USD was used taking away my limited USD resources.If I am using a local phone I should of been charged TTD. (I await your response on this matter. Secondly all the money was used for data no mention or option was given to me on where I would like the monies to be used. (Again I wonder if I would get any response especially now that I am out of the country)If no response I will certainly contact your company on my return.All the same thanks much."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T05:11:20.000Z",
          "Titre": "CUSTOMERS SHOULD BE ABLE TO UNDO A TOP…",
          "Contenu": "CUSTOMERS SHOULD BE ABLE TO UNDO A TOP UP TO WRONG NUMBER THIS IS VERY POOR SERVICE AS AN ERROR IN CONDUCTING  A TRANSACTIONS SHOULD BE ABLE TO FIX OR UNDO HENCE WHY I DON'T TOP UP OFTEN"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Anderson Chester",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T05:03:33.000Z",
          "Titre": "230 instead of $250",
          "Contenu": "Y can’t you have a 230 amount instead on a $250"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-07-22T10:29:27.000Z",
          "Titre": "Tried to top up a digicel phone by…",
          "Contenu": "Tried to top up a digicel phone by mistake and received a message that the transaction went through. Then got another message that there was an issue. However, the bank sent me a notification that the money was deducted and I never received another notification saying that the money was reimbursed."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Soul",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T11:29:24.000Z",
          "Titre": "Subtracting tax",
          "Contenu": "I wanted a $50 card and got $44.. bmobile should add the tax to the amount chosen, not subtract it. Furthermore, bmoblie always texting with promotions but would not text to say something important like your account is expiring and just take all your money off your phone... that's bad customer service"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T21:58:40.000Z",
          "Titre": "I wanted a $40 top up",
          "Contenu": "I wanted a $40 top up,  the top up indicated that I was receiving $231.11 VAT exclusive.  It did not indicate that this was a promotional value and the time period for which it would be valid. Within 2 days my balance was in the teens and I did not make numerous or long phone calls. My balance should have been in the thirties. I would like to see a call log to identify how my money was used because I was robbed. I did not see an option to not receive the promotional value, if so, I would have taken it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-04-27T22:08:51.991Z",
          "Titre": "Processor issues",
          "Contenu": "Use this service a lot; but half the time my debit card gets declined by their processor and I have to use PayPal to pay... Also important to tell your recipient to turn off their data before sending load."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T15:07:19.000Z",
          "Titre": "Rediculous top up options",
          "Contenu": "Hi, I think bmobile should allow customers to choose their desire amount to top up, instead of Giving those rediculous top up options. Allow customers to choose their desired amount, stop forcing people to purchase expensive limited options. That's wicked!"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T03:08:37.000Z",
          "Titre": "Full 100 card",
          "Contenu": "I would have purchased a 100 card, however in doing the purchase. The person got $88. $11 was tax. This could be $111 for the $100 card."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-19T14:24:28.000Z",
          "Titre": "I started a top up",
          "Contenu": "I started a top up - and transaction kept processing after putting in all relevant info, taking long -I was left unsure of if it would charge my credit card or not - I came off the site never getting the top up that I wanted to send to my relative."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "bmobile customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T19:47:36.000Z",
          "Titre": "Forced options",
          "Contenu": "In the past I have been able to top-up a custom amount, not I am limited to predetermined amounts.  This is not preferred because I am not being forced to top-up an amount that I was not prepared to spend.   I hope you change this policy in the future."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T11:58:33.000Z",
          "Titre": "POOR PAYMENT OPTIONS",
          "Contenu": "Your site only allows you to purchase preset amounts, so you are always forced to purchase in excess of what you require for a plan, rather than what you actually need. This is taking advantage of the customer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-05-26T13:07:01.000Z",
          "Titre": "Need togive out faster rewards",
          "Contenu": "Need togive out faster rewards. Sending top ups isn't always easy and you have to reach 500 points before you can even redeem. You all need to offer coupons or something"
        },
        {
          "Note": 2,
          "Lieu": "SX",
          "Pseudo": "John Miller",
          "Nb_Reviews": 4,
          "Date": "2022-04-27T04:25:11.136Z",
          "Titre": "It would be beneficial to receive an…",
          "Contenu": "It would be beneficial to receive an email or message indicating the etopup was successful.  Other than a credit card statement, there is no automatic indication the top up occured."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-24T16:18:40.000Z",
          "Titre": "WASN'T VERY HELPFUL.",
          "Contenu": "WASN'T VERY HELPFUL.MY ISSUE STILL ISN'T RESOLVED.IN THESE MODERN TIMES IF I TRAVEL ABROAD I SHOULD BE ABLE TO LOG INTO YOUR SYSTEM AND BE ABLE TO GET MINUTES TO CALL ANYWHERE IN US OR THE WORLD AND ANY 800 NUMBER"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Lydia Villaruel",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T02:33:39.000Z",
          "Titre": "I don't like the fact that you need to…",
          "Contenu": "I don't like the fact that you need to give access to your location in order to purchase a phone card. That's unnecessary and frankly an invasion of privacy."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Jen",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T16:25:49.000Z",
          "Titre": "Unable to use debit card as advertised",
          "Contenu": "I tried using my debit card but it was declined. Had to use my credit card instead which I didn't want to use for the purchase for personal reasons."
        },
        {
          "Note": 3,
          "Lieu": "VG",
          "Pseudo": "Corey Findlay u",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T04:13:47.000Z",
          "Titre": "Recently I notice that the transaction…",
          "Contenu": "Recently I notice that the transaction failed a lot with a note basically saying check number but I top up directly from the contacts page to the same contacts where I have top up before."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T13:29:15.000Z",
          "Titre": "top up anytime and from anywhere",
          "Contenu": "While you can top up anytime and from anywhere......my issue is the start up amount of $40.00 which to me is too high.  Also, i can be mistaken..but why can you not also use a debit card?  Not everyone has a credit card."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Nicole Bissoon",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T16:41:38.000Z",
          "Titre": "When customers top or purchase a plan",
          "Contenu": "When customers top up or purchase a plan, there should NOT BE the additional step of having to dial to *363# to confirm the purchase does not need to be renewed.  This to me is unnecessary as this option can be selected before.  It is bad ethics on the part of Bmobile as customers loose money is that option is not selected.  Very disappointing experience."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "McG",
          "Nb_Reviews": 3,
          "Date": "2023-10-29T11:34:59.000Z",
          "Titre": "Delays to credit other's phone using my credit card",
          "Contenu": "I can confidently top up my phone with my credit card. However every time I have attempted topping up my husband's phone using my card there has been a delay of several days of his phone being credited. This, only after I called customer care to investigate why his phone had not been credited. So I trust this app to credit my phone with my card but not to credit someone else's phone using my card."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer Lourdes",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T00:54:47.000Z",
          "Titre": "It’s a good app but my brother in Me I I has to call a number before they can activate his card every time.",
          "Contenu": "I like this app but it doesn’t automatically charge the gift card when I send money. My brother and other people I have topped up money won’t receive the reload until they call a number. It used to be they would get it directly and would get a notification of the transaction right away but not anymore."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T15:45:46.000Z",
          "Titre": "More top up options and data plans",
          "Contenu": "I’m glad to be able to top up online however I think there should be more option available for purchase starting from  $25. I would also like to add that all data plans should be available for purchase online. I don’t see why they aren’t. Please consider convenience for your customers"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Aleem",
          "Nb_Reviews": 5,
          "Date": "2023-10-18T05:27:00.000Z",
          "Titre": "Security for the account and financial…",
          "Contenu": "Security for the account and financial information should be stronger. Also, it would be nice if they actually gave you coupons to use when buying top ups."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ashneel Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T07:35:26.000Z",
          "Titre": "There should be a notification sent…",
          "Contenu": "There should be a notification sent once the recipient gets the top up"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Confused costumer",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T10:22:50.000Z",
          "Titre": "Instant top up, mystery fees.",
          "Contenu": "The top up was instantly sent to my number, the site was also insanely easy to navigate which deserves 5 stars. However, the total came up to $40.00 but $90.00 was deducted from my account. No idea where the extra $50.00 came from which is why I deducted 2 stars. I’d love some insight on that."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customerLeon George",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T16:00:46.000Z",
          "Titre": "ACCESSIBILITY ISSUES.",
          "Contenu": "I had some accessibility issues. I will like TSTT be mobile to make all of there websites more accessible for blind persons, who use screen readers with there computers and smart phones.  There is about 400 such individuals in Trinidad and Tobago, this number include students also. Thanking you in advance, Leon George. I don't presently have a photo email"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T00:20:43.000Z",
          "Titre": "I don't like that it was rejecting my…",
          "Contenu": "I don't like that it was rejecting my email address when I tried to purchase as a temporary customer. It is dishonest that I was forced to sign in with a goggle account."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-05-28T17:05:11.000Z",
          "Titre": "Convenient but the pricing should be marked up to ensure",
          "Contenu": "Convenient but the pricing should be marked up to ensure that the right amount of credit is purchased and credited. What could improve is the proper pricing for the denominations. e.g if someone wants $40 credit on their phone, the transaction fee and VAT comes out of the payment and credits less than the requested amount to their phone. Instead, add the respective fees so that $40 credit means that $40 would be placed on the account"
        },
        {
          "Note": 3,
          "Lieu": "DO",
          "Pseudo": "Gabriel Mieses",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T09:59:48.000Z",
          "Titre": "It was fast and easy",
          "Contenu": "It was fast and easy, however I'd like to get a better ratio for the foreign exchange rates as it is way different and the  discrepancy to the FX rates compared to the real ones are considerably high. So please make some adjustments to it so we can get a more accurate and acceptable conversion in fx rates. Thank you for the service!"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-10-04T02:21:16.000Z",
          "Titre": "I like that I could top up so quickly",
          "Contenu": "I like that I could top up so quickly, however, I have a problem with how much I am able to top up. The top up plans are limited and the amount to top up are either low or high,there's no in between and that's a problem for me."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Chris Medine",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T15:25:06.000Z",
          "Titre": "Helpful in a bind, but not complete",
          "Contenu": "It's a simple and necessary tool for topping up and paying bills, especially in a situation where all the stores have closed for the day. However in using this site, i did notice that not all available plans, as seen on the bmobile website, are not listed. I was looking to apply a particular 30 day plan, but it was not there for me to choose, hence i had to choose a little less convenient option. Having the full list of plans to choose from, should have been standard procedure and readily accessible."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Jonathan P",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T21:20:17.000Z",
          "Titre": "It's convenient and fast but lack options…",
          "Contenu": "It's convenient and fast but the simple drawbacks I've experienced using it were the fact that I didn't have the option of choosing a lower value for top up than $40.00 and also the fact that I didn't have the option of paying the taxes upfront, rather than transferring the cost to the recipient..."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-01-09T13:12:24.000Z",
          "Titre": "After the top up which was a net amount…",
          "Contenu": "After the top up which was a net amount of $ 35.55, my previous balance was wiped out and when I check balance wit *120# , the only balance showing was this 35.55. Secondly after a day or so, the balance showing was $ 15.55 even thouhg I didnt make a single call or use any mobile data!!!"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Den",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T14:24:10.000Z",
          "Titre": "After adding an additional data plan…",
          "Contenu": "After adding an additional data plan for 7 days and receiving confirmation of same, I continue to receive text messages saying the plan was about to expire. Either the messaging or communication is not clear to the user, especially someone visiting the country."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Ricardo Mitchell OF",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T17:09:02.000Z",
          "Titre": "4 days since top up and 3 days since…",
          "Contenu": "4 days since top up and 3 days since raising my issue and receiving a ticket number I haven’t gotten any feedback as to why my plan wasn't applied or when it will be. I had to apply a plan from another source to get anything done, including the query. Only reason it wasn't one star is because this is the first but most inopportune time for it to happen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T04:46:47.000Z",
          "Titre": "transaction took too long"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "jaishree",
          "Nb_Reviews": 3,
          "Date": "2023-05-05T03:51:39.000Z",
          "Titre": "Top Ups",
          "Contenu": "The checkout process is quick once the payment information is saved. I dislike that the bonus points were discontinued. I would also prefer that ALL denominations be available when choosing top ups. e.g, $10, $20, $30.00 etc."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin N",
          "Nb_Reviews": 9,
          "Date": "2023-11-05T05:47:54.000Z",
          "Titre": "Delays in Top-Up",
          "Contenu": "Delays in credit being applied to mobile phone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-01-05T17:00:11.000Z",
          "Titre": "I like the ease of being able to send…",
          "Contenu": "I like the ease of being able to send my love one funds for data but you all need to have discounts or promo codes because this can get expensive and customers are what keeps your business moving forward so giving a little back is rewarding"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T02:31:34.000Z",
          "Titre": "Top up verses Plan",
          "Contenu": "I like the online experience. I like that there are several choices to choose from. I hate that they have clumped Plans and Top Up next to each other without asking again if you are purchasing a Plan or a topup. Reaching customer support is takes too long to respond to issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mo B.",
          "Nb_Reviews": 3,
          "Date": "2023-02-25T20:46:57.000Z",
          "Titre": "Web Portal do not work at times that…",
          "Contenu": "Web Portal do not work at times that can be critical for transactions. No advisories of offline or announcements to indicant downtime or maintenance.  Just wouldn't work until today....two days later."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Chandru Chatlani",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T20:55:51.000Z",
          "Titre": "I did four (4) top ups and one was…",
          "Contenu": "I did four (4) top ups and one was inconsistent - it did not extend the expiration date as it did for the other three (3) and the Customer service Reps indicate that a VOUCHER can only do this. Appears to be deceptive marketing by BMobile. Why is one not extended whilst the other three (3) have been extended."
        },
        {
          "Note": 3,
          "Lieu": "GY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T21:02:30.000Z",
          "Titre": "I do not like that the app keeps…",
          "Contenu": "I do not like that the app keeps logging me out and that the feature of earning points was taken away. I have always logged a dispute for a transaction processed and my bank account was debited but no funds top up was not received. Besides that I like the convenience of the app."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Curtis Isaac",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T15:06:16.000Z",
          "Titre": "Debit card payment",
          "Contenu": "When I have to input my payment credentials it states credit/debit card or payPal. However, when I input my debit card credentials it was rejected and I tried two different bank cards. This needs to fix, not very one has a credit card."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-07-24T00:27:38.000Z",
          "Titre": "The TTD option is not easily accessible",
          "Contenu": "I like the option to pay online, however, each time I log in I am direct to the US$ denomination options which I am not interested in. I have tried several iterations of the web page URLs unsuccessfully. My workaround is to go to my history and repeat the TTD  transaction."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Debra",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T00:44:08.000Z",
          "Titre": "I liked The expediency of the…",
          "Contenu": "I liked The expediency of the transaction.  But i disliked using my Visa Debit card as I was charged $50 TT for using this method of payment ."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T09:45:35.000Z",
          "Titre": "there should be an option to pay…",
          "Contenu": "there should be an option to pay separately for VAT so that when i purchase a $100 topup, i should receive $100 and not eighty something dollars"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-12-26T01:03:47.000Z",
          "Titre": "I like the ease of processing my…",
          "Contenu": "I like the ease of processing my transactions, however, 95% of the time that I log in I only get the USD option. As a local of Trinidad I want the ease of quickly choosing the right currency for amounts under USD $10"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T16:37:55.000Z",
          "Titre": "There was a delay in the top up of my…",
          "Contenu": "There was a delay in the top up of my phone, I got it a few hours later. I had to call Bmobile who redirected me to the etopup email to report my issue."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "calvin",
          "Nb_Reviews": 2,
          "Date": "2023-03-19T11:01:59.000Z",
          "Titre": "The min top up is $40 while there are…",
          "Contenu": "The min top up is $40 while there are cheaper options, also the only two data plans available are one weekly and one monthly, not even the monthly plan i have been purchasing for the past 5+ years"
        },
        {
          "Note": 3,
          "Lieu": "KY",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T12:26:57.000Z",
          "Titre": "Make a purchase of top-up and it never…",
          "Contenu": "Make a purchase of top-up and it never went through and no reason was given. I had to contact customer service to be told I would be refunded."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T13:14:49.000Z",
          "Titre": "Why am I being charged more when I use my credit card",
          "Contenu": "I have no problem with the service, it is very convenient. But why am I always charged more money when I use my credit card to purchase. I always purchase the unlimited monthly plan and the charge to my credit card is always more than what the app states."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer Ruby",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T20:11:08.000Z",
          "Titre": "No other option for auto top up or not",
          "Contenu": "When a signal said auto top up there was no other option so I cancelled and tried to top up again as i did not think that it went through. The person Luckily got twice top up as a gift"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T19:23:53.000Z",
          "Titre": "Transaction is ok. Processing time is ridiculous",
          "Contenu": "Transaction is flawless, time to activate and apply credit is ridiculous, several minutes over 5 minutes is unacceptable. Nowhere I have travelled does this at such a snail pace. For this reason I am changing carriers."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Gi",
          "Nb_Reviews": 2,
          "Date": "2023-04-30T03:27:12.000Z",
          "Titre": "The platform still does not accept the…",
          "Contenu": "The platform still does not accept the Republic Debit chip cards for payment. Will this ever be added as a payment method? Or Endcash?"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Lystra",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T03:52:05.000Z",
          "Titre": "High charge fees",
          "Contenu": "Online topup is very convenient BUT the charge fees are definitely too high, it's a struggle to continue."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T00:10:08.000Z",
          "Titre": "Good app but would be better if there…",
          "Contenu": "Good app but would be better if there were more options for data plans."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T17:35:01.000Z",
          "Titre": "Use Paypal not credit card directly",
          "Contenu": "Three attempts to pay via credit card. Only realise it only goes through paypal"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T10:37:59.000Z",
          "Titre": "you are too expensive and you never…",
          "Contenu": "you are too expensive and you never provide clients with coupon even if I m constantly sending recharge to family with you. I shall change soon"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T17:29:54.000Z",
          "Titre": "Need more plans",
          "Contenu": "Would appreciate a wider variety of day plans , for example, one day and 3 day plans"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T18:41:36.000Z",
          "Titre": "Easy to set up and use but options…",
          "Contenu": "Easy to set up and use but options limited. Want to set up smaller auto top up amount ($5 CAD) at longer frequency (every 90 days) but these options are not available"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T12:53:44.000Z",
          "Titre": "Nonsense",
          "Contenu": "It is nonsense, especially if you are on the go, to have to remember your password to top up your phone."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T16:12:38.000Z",
          "Titre": "Problems toping up",
          "Contenu": "A lot of times you get an error message when trying to top-up."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T23:20:17.000Z",
          "Titre": "I am only giving three stars because…",
          "Contenu": "I am only giving three stars because there was not many options with reference to the monthly plan top up, other than that the experience wasn't bad."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T12:29:44.000Z",
          "Titre": "I liked it generally however",
          "Contenu": "I liked it generally however, there were limited options to purchase data plans online, would like to see more of the plans available to purchase online versus using the handset as I am usually remote from the device when using the service."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Hailey M",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T08:06:21.000Z",
          "Titre": "I tried to enter a mastercard and it…",
          "Contenu": "I tried to enter a MasterCard and it was refused"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "KEVIN",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T17:32:29.000Z",
          "Titre": "Everything was straight forward",
          "Contenu": "Everything was straight forward, almost easy to perfect, except, the bottom right corner there is a, what I think is a link to be able to message with someone,  is over the continue button, which is very F#$KING ANNOYING."
        },
        {
          "Note": 3,
          "Lieu": "SX",
          "Pseudo": "Janine M",
          "Nb_Reviews": 3,
          "Date": "2023-07-26T15:32:12.000Z",
          "Titre": "more than one topup",
          "Contenu": "Good day, If I do one topup for my husband I cannot do another topup after that for my daughter."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "ac",
          "Nb_Reviews": 3,
          "Date": "2022-12-24T14:02:57.000Z",
          "Titre": "Multiple Top Ups/One Payment",
          "Contenu": "It would be great if I can add multiple items to a \"cart\" and make one payment transaction if, for example, I have multiple top ups that I would like to do."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "calvin",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T17:22:22.000Z",
          "Titre": "The transaction itself was smoot…",
          "Contenu": "The transaction itself was smoot without any issues but there are limited plan options and not all the available plan i purchase so i have to top up extra"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-02-20T17:42:12.000Z",
          "Titre": "Easy for Foreigners to top up",
          "Contenu": "The process was quick and easy to perform however I would like to make the purchase only 10.00 and should have been given an option to include tax or not."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "CAG",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T00:29:04.000Z",
          "Titre": "Poor reception",
          "Contenu": "Service and reception was slow and poor. Oftentimes did not get connection or moved extremely slow. Other devices in the same area did not move as slowly."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T17:56:14.000Z",
          "Titre": "I dislike the fact that there is no…",
          "Contenu": "I dislike the fact that there is no option to add or not add taxesThere is no discount code for existing customers either Y'all plans are too costly"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T21:09:44.000Z",
          "Titre": "Data plan options",
          "Contenu": "Lacking options for data plan purchase. Only two are available when bmobile offers additional plans."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Susan Otway-Charles",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T17:12:56.000Z",
          "Titre": "Make life simpler",
          "Contenu": "Too much hassle to change accounts because the other one would not accept my new credit card"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Bankester",
          "Nb_Reviews": 2,
          "Date": "2023-08-19T21:25:01.000Z",
          "Titre": "Only 1 of 2 transactions have gone…",
          "Contenu": "Only 1 of 2 transactions have gone through on your side. Both have gone through my PayPal account though"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Aderinola",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T17:01:10.000Z",
          "Titre": "Issue accepting payment",
          "Contenu": "Got a number of error messages and needed to retry until I got through"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-20T12:09:32.000Z",
          "Titre": "The value of the top ups are…",
          "Contenu": "The value of the top ups are inconsistent. Sometimes I cannot get TT dollars, only USD"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T04:53:35.000Z",
          "Titre": "While the experience of being able to…",
          "Contenu": "While the experience of being able to use this medium was a good one, I'd like to suggest that I would like to be able to choose my preferred method of payment (either directly from my bank account or my credit card"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T13:14:19.000Z",
          "Titre": "Dislike the fact that the reward points…",
          "Contenu": "Dislike the fact that the reward points system is no longer a benefit"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T04:50:08.000Z",
          "Titre": "This company can show local currency as…",
          "Contenu": "This company can show local currency as well not only having the USD Option."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-12-16T18:32:57.000Z",
          "Titre": "Cannot check balance before & after top…",
          "Contenu": "Cannot check balance before & after top up. Started happening earlier this year, which has been and still is a huge disappointment."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customerian",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T23:53:36.000Z",
          "Titre": "Top up was easy and straightforward",
          "Contenu": "Top up was easy and straightforward. However, changing plan from postpaid to prepaid was not. I was lead to believe that I would receive a text/ phone call advising that the migration had been completed. This did not happen, but my phone stopped working and after seeking advise from a Bmobile agent I topped up to activate my phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Franklin",
          "Nb_Reviews": 4,
          "Date": "2023-09-11T17:04:54.000Z",
          "Titre": "Doesn't remember me and the people I…",
          "Contenu": "Doesn't remember me and the people I send to, no biometric login"
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T10:47:40.000Z",
          "Titre": "Credit card payment didn't work",
          "Contenu": "Credit card payment didn't work, had to use paypal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 8,
          "Date": "2023-06-15T13:47:30.000Z",
          "Titre": "Had to try multiple times to add a new…",
          "Contenu": "Had to try multiple times to add a new card, then multiple times to get a reload of minutes."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Varoon",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T18:16:17.000Z",
          "Titre": "app layout needs tweaking",
          "Contenu": "app layout needs tweaking. the chat symbol blocks the ok button"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Joan",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T19:33:01.000Z",
          "Titre": "Convenience",
          "Contenu": "This is a very convenient method for topping up your mobile. It's quick and your account is loaded almost immediately pending confirmation of payment.It would be helpful for persons who do not have a credit card to be able to pay with a Debit card.."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Renata Ramadar",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T00:21:27.000Z",
          "Titre": "The charges ar taken upfront so I don’t…",
          "Contenu": "The charges ar taken upfront so I don’t get my full credit"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T19:12:37.000Z",
          "Titre": "It gets the job done.",
          "Contenu": "It is convenient and gets the job done but the menu and navigation is horrendous."
        },
        {
          "Note": 3,
          "Lieu": "SX",
          "Pseudo": "Shakeria",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T22:50:17.000Z",
          "Titre": "All the steps when there is a card…",
          "Contenu": "All the steps when there is a card already connected. It was better before the update"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T22:41:26.000Z",
          "Titre": "Top up choice",
          "Contenu": "Need to have an option to allow how much money to top up. If I want $100 on my phone I should be able to pay the $113 amount. Not pay $100 and receive $88."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Malika",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T14:28:10.000Z",
          "Titre": "More top up value options",
          "Contenu": "The needs to be more flexibility with the top up amounts offered for online purchase. Didn't see a $100.00 top up"
        },
        {
          "Note": 3,
          "Lieu": "HT",
          "Pseudo": "Troje",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T02:24:48.000Z",
          "Titre": "The fact that you cannot edit your card…",
          "Contenu": "The fact that you cannot edit your card information"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T10:02:33.000Z",
          "Titre": "Fees too high",
          "Contenu": "I really disliked the fees that I had to pay. If I  buying a $200 card I expect to get $200 on my phone."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T13:56:46.000Z",
          "Titre": "Having issues setting up recurring top…",
          "Contenu": "Having issues setting up recurring top up on my kids phones."
        },
        {
          "Note": 3,
          "Lieu": "BQ",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T20:37:30.000Z",
          "Titre": "It was relatively quick and easy to…",
          "Contenu": "It was relatively quick and easy to top-up. The last time I had some issues, but this time it was seamless"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T13:36:28.000Z",
          "Titre": "Not getting the option to cover the…",
          "Contenu": "Not getting the option to cover the taxes on topup. Please review."
        },
        {
          "Note": 3,
          "Lieu": "BZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T22:57:48.000Z",
          "Titre": "On a cell phone the chat icon is…",
          "Contenu": "On a cell phone the chat icon is blocking the send button. Not great."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T01:16:17.000Z",
          "Titre": "Usually good but since when is an extra…",
          "Contenu": "Usually good but since when is an extra fee charged?"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T19:38:40.000Z",
          "Titre": "Gateway refuse to allow me to make a…",
          "Contenu": "Gateway refuse to allow me to make a second purchase after the first resulting in more additional cost"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "DarinGR",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T01:59:10.000Z",
          "Titre": "Credit voucher taken without notice",
          "Contenu": "The app works great. What I didn't appreciate, my credit voucher was gone and I was not informed. I lost around 15US. No information or date was given of this service being discontinued. 👎🏽"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "richard",
          "Nb_Reviews": 9,
          "Date": "2023-07-22T18:09:21.000Z",
          "Titre": "No discounts 🤔…",
          "Contenu": "No discounts after using you'll top up for so long."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Keston",
          "Nb_Reviews": 4,
          "Date": "2023-04-12T14:11:03.000Z",
          "Titre": "Site need improvement",
          "Contenu": "Site need improvement. Can't add to items to cart before check out"
        },
        {
          "Note": 3,
          "Lieu": "KY",
          "Pseudo": "Mark Ebanks",
          "Nb_Reviews": 9,
          "Date": "2022-10-09T21:48:01.000Z",
          "Titre": "Much much too slow!",
          "Contenu": "The cost was fine but the time between purchase and when the credit was applied was approximately 1 hour.  This is unacceptable.  I've used the service before and it was almost instantaneous.  I didn't deduct any more stars because of past experiences.  Another factor was that the service providers top-up service was broken at the time so even though eTopUp was slow, at least it worked!"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T18:16:35.000Z",
          "Titre": "Tax option",
          "Contenu": "I like everything except the option to pay the tax or not. I have to take the 200.00 top up for the 149.00 plan because if I take the 150.00 I won't have enough funds."
        },
        {
          "Note": 3,
          "Lieu": "DO",
          "Pseudo": "Carlos Rafael Heredia",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T22:39:24.000Z",
          "Titre": "chat boton",
          "Contenu": "chat boton over the payment boton many people leave the page"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T19:51:13.000Z",
          "Titre": "The option button to past was hidden",
          "Contenu": "The option button to past was hidden . I had to go back and forth before I could pay"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T01:46:26.000Z",
          "Titre": "Dislike that the lowest top up is $40",
          "Contenu": "Dislike that the lowest top up is $40. Why not $25?"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "ARKEEMMA  THOMAS",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T21:31:22.000Z",
          "Titre": "Because I can't use my visa debit card…",
          "Contenu": "Because I can't use my visa debit card which makes no sense"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T19:56:32.000Z",
          "Titre": "Had to try a few times till eventually…",
          "Contenu": "Had to try a few times till eventually I got tru."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T15:31:09.000Z",
          "Titre": "The feature of paying with a debit is…",
          "Contenu": "The feature of paying with a debit is needed"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Susan Leotaud",
          "Nb_Reviews": 2,
          "Date": "2023-08-15T20:07:56.000Z",
          "Titre": "it wasn’t difficult",
          "Contenu": "I liked that it wasn’t difficult"
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T22:57:23.000Z",
          "Titre": "There aren't the options for the day…",
          "Contenu": "There aren't the options for the day plan, 3- day plan and the $215 plan."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T01:09:08.000Z",
          "Titre": "only received about 90% of what I paid."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "kenrick alexis",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T21:51:42.000Z",
          "Titre": "Additional charges for online Topup",
          "Contenu": "I have been having an extra $50 deducted from my Bank account when I do an online topup.  The bank says it's because TSTT is using a foreign carrier account.  I have been speaking with a TSTT representative (John) who cannot seem to comprehend and keeps giving me the same response every time. So far I have been charged $150.00 from three transactions and I want to recover my money.  I have also asked to be referred to a supervisor with whom I can escalate my request, but was not provided with a contact person.  Hoping this review will get me some helpMy cell number is 759-6906  Kenrick Alexis"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T14:19:09.000Z",
          "Titre": "Easy to use and very convenient",
          "Contenu": "Easy to use and very convenient. However do not use a Republic Bank Credit Card because they are charging an Opt Issuer Fee (for $50 I paid $1.29, the more you pay the more the fee would be) because they said the app is a foreign app. Use ANY other credit card!"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Candice",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T14:03:39.000Z",
          "Titre": "Simple and Easy",
          "Contenu": "This is my first time using this online facility. The information page was simple and easy to navigate.I will definitely use the facility/option for purchasing my phone careds again."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T18:59:37.000Z",
          "Titre": "Frustrating experience",
          "Contenu": "It was a time consuming and some what frustrating. When I logged on from Google Chrome I could only sign in with Facebook (which I don't ever use or Google). I always prefer to sign in as a guest.   I had to go to another platform to get on to E Top online.  It became frustrating.  The old way was easiest. It's a good thing I know how to move around on the Internet."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T11:05:14.000Z",
          "Titre": "The Lowest value available was 40TT",
          "Contenu": "The Lowest value available was 40TT. It should be lower. Customers topup for various reasons and they have various budgets as well."
        },
        {
          "Note": 4,
          "Lieu": "BQ",
          "Pseudo": "Skeeter Lopes",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T21:39:43.000Z",
          "Titre": "automatic top ups could not be charged",
          "Contenu": "when your account could not be charge when using automatic top ups  because card expired"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Ken M.",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T05:37:11.000Z",
          "Titre": "User  - friendly for the most part",
          "Contenu": "To my mind the page is accessible and easy to follow. However, there is a lack of clarity between how the etop up works with the prepaid packages. This would help customers, so they don't have to call the help-desk.  For instance, the customer receiving the topup must have their data turned off or must check to make sure data received.Also why can't the top up amounts be customized instead of presets.Otherwise, a positive consistent experience - keep improving."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Nae",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T19:32:34.000Z",
          "Titre": "Fee to use",
          "Contenu": "Quick and easy. Fee attached."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T17:33:56.000Z",
          "Titre": "I did not get the usual email…",
          "Contenu": "I did not get the usual email notification for one of my two purchases."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T11:51:55.000Z",
          "Titre": "Very user friendly",
          "Contenu": "Credit was quickly applied to the accounts. Very user friendly application."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "DF",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T16:20:54.000Z",
          "Titre": "Price options were nicely laid out",
          "Contenu": "Price options were nicely laid out, process was smooth and simple"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Sheldon",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T02:02:54.000Z",
          "Titre": "Quick and easy",
          "Contenu": "The process was quick as the site was user friendly and easy to navigate. The only thing I found that could be more helpful is having a cart where you can place your purchases before checkout. I had to make two separate transactions since there was no cart."
        },
        {
          "Note": 4,
          "Lieu": "SX",
          "Pseudo": "Personal",
          "Nb_Reviews": 4,
          "Date": "2023-09-04T17:22:00.000Z",
          "Titre": "For me is very convenient I don't have…",
          "Contenu": "For me is very convenient I don't have to worry to go to a supermarket to top up my phone or my kids for I'm very satisfied with the service I didn't give the 5 stars because some times the service to top up takes to long to process the payment Have a bless day further"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Odessa Elcock",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T13:26:40.000Z",
          "Titre": "Being able to top up fast was great.",
          "Contenu": "Being able to top up fast was great.You'll need to add a cart so when doing multiple transactions we can pay only once, instead of multiple payments on our cards."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Hayden Wallen",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T17:07:12.000Z",
          "Titre": "User friendly interface n fast response…",
          "Contenu": "User friendly interface n fast response msgs.Only that the chat box was partially blocking the next/entry box"
        },
        {
          "Note": 4,
          "Lieu": "BZ",
          "Pseudo": "Jose",
          "Nb_Reviews": 3,
          "Date": "2023-09-03T05:04:46.000Z",
          "Titre": "Is good service",
          "Contenu": "Is good service, but a few days ago I purchased a top up and made a mistake in the number and sent a claim and the operator said nothing to do. The company has to fixed it's rules in case if someone makes a mistake in write the phone number. Cause the costumer loos the money."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Chis",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T12:13:07.000Z",
          "Titre": "Was quick an easy..however the $20 and…",
          "Contenu": "Was quick an easy..however the $20 and $30 dollar option should be avsilable as well for those who cannot afford to put alot"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Anointed Marisa",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T11:57:14.000Z",
          "Titre": "I liked being able to choose affordable…",
          "Contenu": "I liked being able to choose affordable monetary values... I purchased $50. My one observation would be I used my phone to purchase a top up but the message chat box in blue was blocking the options to move forward with the next step. I did not see an option to close the chat box so I had to maneuver between hopefully pressing the right next step. This took much longer to top up than usual.Otherwise a great resource for toppling up."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Cips_tee",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T14:28:19.000Z",
          "Titre": "Top ups are not immediate but good service",
          "Contenu": "The top ups take a while to reach to the phone. This is not ideal in an emergency situation. I waited about 10 minutes for one. The platform is easy to use though and quite convenient especially when you're not in a position to physically buy top up."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T22:49:53.000Z",
          "Titre": "Feedback",
          "Contenu": "I like the convenience of the app and it is user friendly. The only bad thing is that app is not accepting the new visa debt card only credit card. Therefore, it should be on par as the digicel app which accepts the visa debt cards."
        },
        {
          "Note": 4,
          "Lieu": "AF",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T18:52:36.000Z",
          "Titre": "I would have give it 5 stars but for…",
          "Contenu": "I would have give it 5 stars but for the reason of other network of my country is not included in top up system. Their is only Roshan,Etisalt and AWCC in system we neded MTN,Salaam and other network tobe include in top up system Thanks"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T20:10:47.000Z",
          "Titre": "Easy to use",
          "Contenu": "It was easy to use and offered an option to not save my credit card data, which is my preference."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Shyda Sankar",
          "Nb_Reviews": 7,
          "Date": "2023-06-03T22:46:38.000Z",
          "Titre": "Slight change to page but still straightforward and simple",
          "Contenu": "Had to refill my info including remembering my password Format of page change slightly with the lowest top up being US$10=$65 which was more than the $50 I usually purchase to send for my son. Other that it was pretty much straight forward and simple"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Comfort,safety and cashless.",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T02:42:20.000Z",
          "Titre": "Customer safety",
          "Contenu": "I was estatic and elated to do such transaction in the privacy of my home.It just shows that the company is bringing ease and comfort to their customers.I hope this will transfer to all as we aim to be a striving nation."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Bruce",
          "Nb_Reviews": 3,
          "Date": "2023-10-21T13:37:02.000Z",
          "Titre": "The app was easy to navigate",
          "Contenu": "The app was easy to navigate, charges were not exorbitant and the top up was real time/immediate."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Ricki",
          "Nb_Reviews": 7,
          "Date": "2023-09-16T02:55:46.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy. I use this app all the time for topup.Only one suggestion give us the option to pay tax on addition to amt instead of reducing from topup amt."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-07-31T03:22:48.000Z",
          "Titre": "2 simple modifications",
          "Contenu": "Fasy efficient and easy only issue is thta you all don't have all of the monthly data plans online like the one for $239 also don't really like that you guys removed the option of adding taxes to the value of the card at check out like before"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-27T18:16:51.000Z",
          "Titre": "Convenience",
          "Contenu": "I like the online convenience. It's a quick easy process and you are credited instantly after which you get a nice email notification."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T22:23:21.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy to make my transaction... Would like some lower priced options however."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "KM",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T14:26:31.000Z",
          "Titre": "Easy process",
          "Contenu": "Easy process to topup.One issue experienced was while topping up on the phone l, the chat button kept popping up over the \"next\" button."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Miichael",
          "Nb_Reviews": 3,
          "Date": "2023-07-01T01:09:19.000Z",
          "Titre": "Two minor issues",
          "Contenu": "Two minor issues, you must type your email and not autofill and the icon on lower right hand corner was partially coveted and not identified."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T19:34:37.000Z",
          "Titre": "Toping up is easy",
          "Contenu": "Toping up is easy. Unfortunately when I tried to do another top up I wanted to use another card and I couldn't because I couldn't find the option to change payment method"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Patricia-Anne",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T06:51:44.000Z",
          "Titre": "The site is simple and user friendly.",
          "Contenu": "The site is simple and user friendly. Topping up was quick and easy. Four stars because I've been waiting on the link to reset my password for more than an hour. That's an inconvenience. I also need to remove a visa card as it's inactive, but I have no idea how that is done."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T14:27:03.000Z",
          "Titre": "Worked as it should but.......",
          "Contenu": "Worked as it should but I knocked a star off cause I'm not able to use my local visa debit card. Had to use my credit card which I didn't want to which is an inconvenience."
        },
        {
          "Note": 4,
          "Lieu": "SX",
          "Pseudo": "Nordee",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T04:56:11.000Z",
          "Titre": "Very easy to do",
          "Contenu": "Very easy to do! I can top up anywhere and anytime and it goes through pretty quickly. Very convenient!"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Deslys Donawa George",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T03:30:02.000Z",
          "Titre": "Smooth & Easy Transaction",
          "Contenu": "Everything went smoothly with the transaction. Did not get 5 stars for one reason, I wish I had the option for debit card as well. My POV: nothing else needs to change!"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Clarence",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T09:57:49.000Z",
          "Titre": "Prompt and user friendly",
          "Contenu": "The credit was promptly applied."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Aleem",
          "Nb_Reviews": 5,
          "Date": "2023-06-07T17:29:43.000Z",
          "Titre": "Top ups work fine but there are never…",
          "Contenu": "Top ups work fine but there are never any discount/coupon code offers so I only buy the minimum top up that I require."
        },
        {
          "Note": 4,
          "Lieu": "VG",
          "Pseudo": "customer coollady",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T11:07:27.000Z",
          "Titre": "Good day am so happy knowing I can top…",
          "Contenu": "Good day am so happy knowing I can top up my family home if you go to the machine or store cleck they cannot top up Trinidad am happy with this online system you provided all the best to the company love the service"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "verne c sampath customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T05:31:40.000Z",
          "Titre": "7679950",
          "Contenu": "The cell number that is being topped up is always visible so as to confirm that it is the correct cell being topped up.Also, each step is very easy to follow."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T21:32:25.000Z",
          "Titre": "Online top up was quick and easy",
          "Contenu": "Online top up was quick and easy. I topped up a friend. If this company had more reasonable data plans and better roaming, I would use them again. Unfortunately, they don't."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Cooloo",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T15:34:51.000Z",
          "Titre": "Confirming Payment Tip",
          "Contenu": "Customers have to be extremely careful not to accidentally activate the \"automatic top-up\" button, which pops up when confirming payment. I would like to humbly suggest that this option be inserted after the payment has been made and confirmed. Additionally an alert should be sent (probably 3 days before the due date) to the customer, indicating that the top-up facility will be activated."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T18:20:08.000Z",
          "Titre": "Quick But More Opts",
          "Contenu": "Easy to use & EfficientWould prefer an option to enter specified amounts that are not preset amounts."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Trini Abi",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T17:51:35.000Z",
          "Titre": "Fast and easy but was unable to…",
          "Contenu": "Fast and easy but was unable to complete the transaction via my mobile. I had to access the site via my laptop to successfully complete."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Collymore.",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T02:34:58.000Z",
          "Titre": "The app is simple",
          "Contenu": "The app is simple, and straightforward... Easy to follow, and fast."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Julia",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T12:35:00.000Z",
          "Titre": "It was the first time using this…",
          "Contenu": "It was the first time using this service and it was user friendly. The only issue was the fact that the chat bubble at the bottom right blocked the instructions to move forward."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T21:32:44.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to useInterface easy to use and get to what you need. It’s cost effective. My only comment is that I should be able to set the exact amount I wish to send and not have only predetermined amounts."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Roy Ramjitsingh",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T17:32:03.000Z",
          "Titre": "Very user friendly.74 yrs old and had…",
          "Contenu": "Very user friendly.74 yrs old and had absolutely ÑO difficulty"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "RHODA DANIEL",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T05:01:42.000Z",
          "Titre": "Top up online",
          "Contenu": "It was not difficult to top up online. The facility was user-friendly."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T01:22:35.000Z",
          "Titre": "I love using this service as my mom…",
          "Contenu": "I love using this service as my mom usually forgets to buy a card for her phone. It's quick processing and safe to use."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T01:27:33.000Z",
          "Titre": "Convenient",
          "Contenu": "Very convenient and no convenient charges👌 I think that the option of topping up $10 should still be available to customers using the online services."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Bertram Telemaque MPhil",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T12:15:51.000Z",
          "Titre": "Transaction was quick and troble freeuble free",
          "Contenu": "Transaction was quick and trouble free. No unnecessary hassle."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T17:38:35.000Z",
          "Titre": "Simple enough",
          "Contenu": "Simple enough. Would have preferred the app instead of sites but I presume the company can back the security of the site."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T01:38:08.000Z",
          "Titre": "Simple and easy to use",
          "Contenu": "Simple and easy to use. Would be nice to allow both the Vat Inclusive and Vat Exclusive transfer amounts..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T14:31:21.000Z",
          "Titre": "The interface is kinda clunky",
          "Contenu": "The interface is kinda clunky. The question box covers the next box on Android"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T18:02:18.000Z",
          "Titre": "More $ value top up options",
          "Contenu": "More $ value top up options , including smaller dollar value like $25"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Boyd",
          "Nb_Reviews": 8,
          "Date": "2023-06-14T18:33:25.000Z",
          "Titre": "Your site is user friendly and fast and…",
          "Contenu": "Your site is user friendly and fast and I would not hesitate to recommend some friends to use your service."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Jacqueline John",
          "Nb_Reviews": 3,
          "Date": "2023-06-05T05:19:57.000Z",
          "Titre": "User Friendly and Efficient",
          "Contenu": "The system used to top up was user friendly, quick and efficient.  the suggested top up amounts helped me to decide which was best for me."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T16:04:46.000Z",
          "Titre": "The chat icon is blocking the \"next\"…",
          "Contenu": "The chat icon is blocking the \"next\" button on the mobile site. Relocate it. And what is the purpose of logging in with Google or fb?"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Ea",
          "Nb_Reviews": 3,
          "Date": "2023-06-20T12:26:47.000Z",
          "Titre": "Very Convenient",
          "Contenu": "Well I was in a tight spot and needed a call. It was convenient for me to top up on the go, but the only downfall is if I didn't have data on my phone it wouldn't have been possible. Also it cost more to top up this way.  So 4 stars instead of 5."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T18:59:47.000Z",
          "Titre": "Most of the time works ok",
          "Contenu": "Most of the time works ok, but I had experienced the server was down, at least that is the message."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Tendo",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T04:05:45.000Z",
          "Titre": "It's convenient to use especially when…",
          "Contenu": "It's convenient to use especially when I travel to other countries, and it is by the most affordable site for prepaid"
        },
        {
          "Note": 4,
          "Lieu": "KN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T04:49:32.000Z",
          "Titre": "I’ve been using etopup for years now…",
          "Contenu": "I’ve been using etopup for years now and have never been disappointed by the service. It’s always on point. Keep it up"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "michelle",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T14:52:20.000Z",
          "Titre": "very simple to manage.",
          "Contenu": "very simple to manage.the process was easy, not difficult to understand and very quick in terms of the results."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T16:47:19.000Z",
          "Titre": "More data plan options on the website…",
          "Contenu": "More data plan options on the website eg. one day or 3 days data plans or pre-paid customers"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T14:05:40.000Z",
          "Titre": "Easy use but where did rewards go??",
          "Contenu": "Easy to use but ever happened to the rewards program? I know it never made it to the app but you use to be able to do it via webpage now you no longer can."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T14:23:18.000Z",
          "Titre": "quick and easy",
          "Contenu": "the process was relatively easy and everything was done very quickly"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T19:48:17.000Z",
          "Titre": "It was an overall good experience",
          "Contenu": "It was an overall good experience, however more options with regards to prepaid plans should be made available for online purchases."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Kitty",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T23:18:10.000Z",
          "Titre": "Cc not update",
          "Contenu": "The options are easy and the process is swift except my new card details is never saving although I've been selecting to save it for future transactions."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Anando Cross",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T20:10:57.000Z",
          "Titre": "The procedure was fast and clear"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Kim Govia",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T09:40:06.000Z",
          "Titre": "Easy to use and efficient",
          "Contenu": "Easy to use and efficient! Felt safe to use my cards!"
        },
        {
          "Note": 4,
          "Lieu": "BS",
          "Pseudo": "Yolanda",
          "Nb_Reviews": 3,
          "Date": "2023-10-01T19:20:45.000Z",
          "Titre": "Easy and quick",
          "Contenu": "The process was easy and top up is immediate."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T19:58:47.000Z",
          "Titre": "This service is great just needs a…",
          "Contenu": "This service is great just needs a smaller sum to choose from at least include $30 cards also"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 8,
          "Date": "2023-10-30T23:58:43.000Z",
          "Titre": "Quick job inspite of system problems.",
          "Contenu": "Although the system was experiencing problems, it was quickly rectified and the transaction was completed almost immediately."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T01:59:38.000Z",
          "Titre": "It is very convenient to topup online",
          "Contenu": "It is very convenient to topup online. Quick and simple."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Randy",
          "Nb_Reviews": 10,
          "Date": "2023-07-24T20:26:02.000Z",
          "Titre": "Simple process,convenient to use",
          "Contenu": "Simple process,convenient to use, does exactly what I needed"
        },
        {
          "Note": 4,
          "Lieu": "SX",
          "Pseudo": "customerkevin",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T23:31:29.000Z",
          "Titre": "Service within minutes",
          "Contenu": "Gets money on my pre paid mobile within minutes and for that I’m truly grateful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jean",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T01:29:25.000Z",
          "Titre": "Fast service."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-08-09T21:43:16.000Z",
          "Titre": "There should be more data options…",
          "Contenu": "There should be more data options available for purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T15:43:10.000Z",
          "Titre": "Easy to access and accomplish changes"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Vanessa",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T04:19:23.000Z",
          "Titre": "Easy to use!",
          "Contenu": "The platform is easy to use and is very convenient."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Tricia",
          "Nb_Reviews": 2,
          "Date": "2023-10-15T15:13:34.000Z",
          "Titre": "very convenient",
          "Contenu": "it fast and easy  very convenient"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T12:11:22.000Z",
          "Titre": "Fast",
          "Contenu": "The transaction was quick."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Nikkisha",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T17:22:04.000Z",
          "Titre": "I had an emergency .",
          "Contenu": "I had an emergency .. could not have reached to a place that sells phone card . Having the topup online made it easier ."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sheila Harrison",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T13:55:24.000Z",
          "Titre": "I had a problem got assistance online…",
          "Contenu": "I had a problem got assistance online successful outcom r thanks"
        },
        {
          "Note": 4,
          "Lieu": "ZM",
          "Pseudo": "Nsamba",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T12:44:50.000Z",
          "Titre": "Fantastic very hard app",
          "Contenu": "Fantastic very hard app . I like it . Give it a try u will never regret"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-08-07T23:21:23.000Z",
          "Titre": "Clear Information",
          "Contenu": "Top up information was clear and easy to follow."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-07-18T17:07:45.000Z",
          "Titre": "it was good but I would've preferred a…",
          "Contenu": "it was good but I would've preferred a 30.00 option as the smallest option"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T22:02:05.000Z",
          "Titre": "Quick and easy to top up online",
          "Contenu": "Quick and easy to top up online. Could give you the option to customize top up amount."
        },
        {
          "Note": 4,
          "Lieu": "SX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T05:00:29.000Z",
          "Titre": "Was quick and easy",
          "Contenu": "Was quick and easy. Only did not accept the email address that I always used"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T13:18:57.000Z",
          "Titre": "Phone did not receive the credit",
          "Contenu": "Received the credit"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Trudy",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T20:17:38.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use.  Top up was credited to my phone immediately after."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Trini Samba",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T14:51:23.000Z",
          "Titre": "Convenience at my fingertips",
          "Contenu": "I like that I can do my top ups without leaving home and at any time of the day."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Chandradaye Singh",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T16:53:38.000Z",
          "Titre": "The chat icon blocks the icon to…",
          "Contenu": "The chat icon blocks the icon to proceed to the next stage. If this can be dealt with, I have no other issue."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T19:28:48.000Z",
          "Titre": "Easy etopup.",
          "Contenu": "Easy etopup but I wish I could put in my own value to purchase"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Win kyi",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T18:24:31.000Z",
          "Titre": "Great orange",
          "Contenu": "Honestly useful this sim card is better."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T17:16:36.000Z",
          "Titre": "The user interface is very nice",
          "Contenu": "The user interface is very nice. Easy to use and understand"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-05-18T15:19:38.000Z",
          "Titre": "Would like to pay give the person the…",
          "Contenu": "Would like to pay/give the person the whole amount stated in the Top Up amount plus give you the VAT"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T00:47:18.000Z",
          "Titre": "Ease of doing qn online top up"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T12:38:42.000Z",
          "Titre": "It was a great experience"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T01:59:24.000Z",
          "Titre": "Quick topup",
          "Contenu": "It was helpful to get the lunk via text prior to topup."
        },
        {
          "Note": 5,
          "Lieu": "VG",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T15:31:11.000Z",
          "Titre": "Convenience",
          "Contenu": "I don’t reside in Trinidad but I can keep my number active with this app so when I do visit home I don’t have to worry about getting a temporary number. It is as simple as just switching over my sim"
        },
        {
          "Note": 5,
          "Lieu": "KN",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T00:31:05.000Z",
          "Titre": "I was able to reactivate my number just…",
          "Contenu": "I was able to reactivate my number just by sending a couple of emails from a different island.Very good."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customermargaret",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:49:21.000Z",
          "Titre": "clearly set out pages",
          "Contenu": "clearly set out pages; easy to read and follow guidelines so no searching or reading between the lines; no surprise costs added on at the end= Best Part!"
        },
        {
          "Note": 5,
          "Lieu": "BB",
          "Pseudo": "customer Carmen",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T11:20:40.000Z",
          "Titre": "The experience was good",
          "Contenu": "The experience was good. The wait time was minimal..Keep up the good work.."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T15:38:14.000Z",
          "Titre": "Ease of use and its simplicity."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-10-24T11:48:25.000Z",
          "Titre": "Good standard of operation",
          "Contenu": "Good standard of operation , easy to use ,decent UI . A small suggestion would be the addition of a \"topup another\" button in the post top up screen for persons topping up multiple devices in one session ,either way .good service ."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "TM",
          "Nb_Reviews": 11,
          "Date": "2023-11-12T08:18:44.000Z",
          "Titre": "Quick and easy to use",
          "Contenu": "It’s so quick and easy to top up your account! The instructions are simple to follow and very convenient!"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "SL",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T14:44:08.000Z",
          "Titre": "Very satisfied",
          "Contenu": "Quick, efficient and convenient! Love this about the service!"
        },
        {
          "Note": 5,
          "Lieu": "BZ",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T00:54:21.000Z",
          "Titre": "Your surcharge is a little excessive!",
          "Contenu": "Using your service is generally convenient  and easy.Wish you could also accept Discovercard for payment."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-12T01:44:05.000Z",
          "Titre": "Eezie peezie!",
          "Contenu": "Simple instructions. Easy to follow. Accepting debit cards is a huge plus!"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Stacy",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T23:02:03.000Z",
          "Titre": "It is quick and convenient",
          "Contenu": "It is quick and convenient, there is no need to leave wherever you are"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T12:32:18.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Immediately went onto my phone"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Customer",
          "Nb_Reviews": 7,
          "Date": "2023-11-01T00:01:07.000Z",
          "Titre": "I have been using this top up procedure…",
          "Contenu": "I have been using this top up procedure for many years now and never really had any problems that I can recall."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-11-20T16:43:02.000Z",
          "Titre": "Service is prompt !!!",
          "Contenu": "Always effective fast n ready !!!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T05:04:59.000Z",
          "Titre": "It is really convenient loading online…",
          "Contenu": "It is really convenient loading online while Working offshore."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Michael Dial",
          "Nb_Reviews": 10,
          "Date": "2023-10-28T20:53:39.000Z",
          "Titre": "would been 5/5 but rated it 4/5 because…",
          "Contenu": "would been 5/5 but rated it 4/5 because i have issues using the bmobile app to top up so had to use the website online topup"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-11-20T13:26:50.000Z",
          "Titre": "quick and easy",
          "Contenu": "quick and easy. fast confirmation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine Aquino",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T23:05:31.000Z",
          "Titre": "Great for US Customers",
          "Contenu": "This is probably the most convenient way to add load from the US. The application provides ease and a sense of security US customers are accustomed to."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Glen",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T23:01:22.000Z",
          "Titre": "Topping up was simple and very fast",
          "Contenu": "Topping up was simple and very fast. For the recipient, it was instant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "edd hazell",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T19:31:12.000Z",
          "Titre": "The simplicity of use is what i love…",
          "Contenu": "The simplicity of use is what i love about the App. i tried two other app but soon find out i was being charged on the back end and that what lead me to eTopUp."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-21T11:58:22.000Z",
          "Titre": "Top up Experience",
          "Contenu": "Top up ExperienceThe transaction progressed smoothly in a timely manner, i.e. very efficient, so it was successfully completed in a few minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nalini",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T18:13:17.000Z",
          "Titre": "The app is easy to use and understand.",
          "Contenu": "The app is easy to use and understand.Thanks ."
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Sherlie",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T04:17:38.000Z",
          "Titre": "It was a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jcustomer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T15:32:45.000Z",
          "Titre": "It's easy to navigate",
          "Contenu": "It helps to share and stay in connection to family member ."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Barbados Customer",
          "Nb_Reviews": 3,
          "Date": "2023-10-21T20:40:34.000Z",
          "Titre": "Been using them for a long time",
          "Contenu": "Been using them for a long time. Very fast and easy to use. You know exactly how much you're paying, and how much the recipient will receive. Top up was received right away."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Mr. T",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T12:14:09.000Z",
          "Titre": "Quick and easy payment transaction."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Raquel C",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T16:57:32.000Z",
          "Titre": "Ease of use and convenience",
          "Contenu": "Ease of use and convenience of the service itself"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cherrie.",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T20:23:31.000Z",
          "Titre": "The transaction instructions are clear",
          "Contenu": "The transaction instructions are clear, so it could be followed easily."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Narendra Balgobin",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T20:28:28.000Z",
          "Titre": "The process was simple and the top-up…",
          "Contenu": "The process was simple and the top-up was immediate so there was nothing more that I could want."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Nigel",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T23:26:37.000Z",
          "Titre": "It was quick and easy",
          "Contenu": "It was quick and easy. The process was not ambiguous or repetitive."
        },
        {
          "Note": 5,
          "Lieu": "BZ",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T18:10:54.000Z",
          "Titre": "Good fast and reliable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T15:24:50.000Z",
          "Titre": "Smooth and quick",
          "Contenu": "Smooth and quick. No problems."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "r gonzalez",
          "Nb_Reviews": 6,
          "Date": "2023-11-16T21:44:32.000Z",
          "Titre": "Very trusting place and",
          "Contenu": "Very trusting place and Very fast service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T04:36:15.000Z",
          "Titre": "Good experience",
          "Contenu": "Good experience, I'm surprised and very satisfied for my first transaction on eTopUpOnline"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle D",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T21:42:48.000Z",
          "Titre": "The quick response to the situation"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Germaine  Nelson",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T12:04:50.000Z",
          "Titre": "Very quick and easily accessible"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Deja",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T23:25:50.000Z",
          "Titre": "Effective",
          "Contenu": "That topping up or putting on the plan was easy and that I can also use my debit card to make the purchase"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Charmaine",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T20:35:53.000Z",
          "Titre": "Customer friendly",
          "Contenu": "It was an easy and straight forward process. I like how the additional charges are already in the amount of top up you want"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T20:54:43.000Z",
          "Titre": "Thanks",
          "Contenu": "Easy to purchase and no additional fees"
        },
        {
          "Note": 5,
          "Lieu": "SX",
          "Pseudo": "Jermaine  anderson",
          "Nb_Reviews": 3,
          "Date": "2023-11-09T05:10:55.000Z",
          "Titre": "Service was very efficient and fast.",
          "Contenu": "Service was  efficient and fast. App is very user friendly"
        },
        {
          "Note": 5,
          "Lieu": "BZ",
          "Pseudo": "Richard Kreis",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T21:13:33.000Z",
          "Titre": "Using the app was quick and easy",
          "Contenu": "Using the app was quick and easy. Step by step instructions made it simple."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T18:13:47.000Z",
          "Titre": "It was fast and efficient."
        },
        {
          "Note": 5,
          "Lieu": "BZ",
          "Pseudo": "Noel",
          "Nb_Reviews": 3,
          "Date": "2023-10-29T13:07:01.000Z",
          "Titre": "Made top up before landing so I can use…",
          "Contenu": "Made top up before landing so I can use immediately. Great"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T09:39:04.000Z",
          "Titre": "It was simple",
          "Contenu": "It was simple, quick and easy to navigate through the site. Also the response time was impressive!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-10-15T16:15:24.000Z",
          "Titre": "The last time i tryed it was 3 times…",
          "Contenu": "The last time i tryed it was 3 times and all fail and way refunded .This time every connection was Great thank you for the easy way to go no problem"
        },
        {
          "Note": 5,
          "Lieu": "GY",
          "Pseudo": "Safona knox",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T11:59:39.000Z",
          "Titre": "Good job",
          "Contenu": "Yall need to put 1000 top up at the up and 10000 below  last time I put 10000 in my phone by mistake...painnnnn!!!, but other than that yall doing good 👍"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Thomas Cheng",
          "Nb_Reviews": 5,
          "Date": "2023-10-19T18:11:46.000Z",
          "Titre": "Topup made seamlessly via PayPal",
          "Contenu": "Topup made seamlessly via PayPal.  Then went to PH and service desk helped me opt in a package with a great deal!"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T01:12:52.000Z",
          "Titre": "Quick processing",
          "Contenu": "Quick processingEasy menu of optionsImmediate email receipt"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marsha Paul-Bull",
          "Nb_Reviews": 6,
          "Date": "2023-11-07T00:27:28.000Z",
          "Titre": "It is easy to use.",
          "Contenu": "It is easy to use and I have been using the system for a while. The reward points is a plus."
        },
        {
          "Note": 5,
          "Lieu": "VC",
          "Pseudo": "KayB",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T00:55:46.000Z",
          "Titre": "I don't have to leave my house to go to…",
          "Contenu": "I don't have to leave my house to go to purchase a top up! In less than a minute I received my top up"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T01:36:54.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Sent this top up to my son.  It was received almost instantly."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T13:02:45.000Z",
          "Titre": "Quick Performance",
          "Contenu": "It was quick and easy due to the system remembering my details"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Glynda Palmer",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T04:49:45.000Z",
          "Titre": "It was very easy to navigate",
          "Contenu": "It was very easy to navigate. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T03:57:22.000Z",
          "Titre": "This service is very fast and reliable",
          "Contenu": "This service is very fast and reliable. I am using this service every month."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T01:40:11.000Z",
          "Titre": "Easy to send credit"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "OhSusanna",
          "Nb_Reviews": 5,
          "Date": "2023-11-01T14:41:24.000Z",
          "Titre": "Quick and always correct",
          "Contenu": "Excellent service from eTopUpOnline, every time with every refill."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "K. Bholasingh",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T20:12:53.000Z",
          "Titre": "Easy to use and convenient"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Hazel",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T02:46:09.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, easy and efficient"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T18:55:06.000Z",
          "Titre": "It worked smoothly as it is supposed to."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jamiyat ullah Samimi",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T12:09:40.000Z",
          "Titre": "Excellent",
          "Contenu": "Unbelievable, The eTop up was quick and easy."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nino",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T03:16:04.000Z",
          "Titre": "Highly recommend because very easy to…",
          "Contenu": "Highly recommend because very easy to use and fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Princetta",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T04:07:53.000Z",
          "Titre": "The site was easy to navigate"
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T00:49:07.000Z",
          "Titre": "quick and easy process"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Rene O'Ben",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T13:40:17.000Z",
          "Titre": "It is a very convenient system"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "ZANIM MOHAMMED",
          "Nb_Reviews": 5,
          "Date": "2023-11-07T19:47:24.000Z",
          "Titre": "Ease of use",
          "Contenu": "Ease of use, convenience of the topup and no hassle."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "No name please",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T20:26:07.000Z",
          "Titre": "It was easy to use the app",
          "Contenu": "It was easy to use the app. I did not experience any difficulties."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samira",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T05:51:05.000Z",
          "Titre": "It could not have been easier."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Ray-Keisha",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T14:54:11.000Z",
          "Titre": "Great platform!",
          "Contenu": "I love using your service and do so  a few times each month. Great platform! No complaints."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Neil",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T19:30:53.000Z",
          "Titre": "Speed",
          "Contenu": "Great app, speedy delivery."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Alana",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T20:43:43.000Z",
          "Titre": "Transaction was fast and easy."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Waldon",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T23:17:01.000Z",
          "Titre": "Very fast and efficient,this is my…",
          "Contenu": "Very fast and efficient,this is my first order and I love it 😀"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sid",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T02:05:33.000Z",
          "Titre": "Everything was smooth and done…",
          "Contenu": "Everything was smooth and done efficiently"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Sarah Chin",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T22:29:33.000Z",
          "Titre": "Convenient",
          "Contenu": "Easy to top up online with credit card."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Sabita Bally-Biersay",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:54:32.000Z",
          "Titre": "It was actually effective and fast."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T02:02:11.000Z",
          "Titre": "Very simple and direct top up procedure."
        },
        {
          "Note": 5,
          "Lieu": "SX",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-10-13T17:07:38.000Z",
          "Titre": "Love it!",
          "Contenu": "Can top up at anytime and top up goes on immediately."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Shirley George",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T22:51:47.000Z",
          "Titre": "You are just doing the job with \"heart\"…",
          "Contenu": "You are just doing the job with \"heart\" and precision."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T06:12:59.000Z",
          "Titre": "quick and reliable !"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Rell",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T20:18:01.000Z",
          "Titre": "Quick transaction"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T13:56:34.000Z",
          "Titre": "What mad either great is how quick that…",
          "Contenu": "What mad either great is how quick that app is in receiving the top up"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Joan Esareesingh customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T01:45:36.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use and  it was very convenient for me."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Donnell",
          "Nb_Reviews": 6,
          "Date": "2023-10-21T15:08:49.000Z",
          "Titre": "The customer service is great",
          "Contenu": "The customer service is great! The online service is Terrible."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T17:13:28.000Z",
          "Titre": "easy as 123",
          "Contenu": "It was convenient and easy steps to follow."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Thabiso",
          "Nb_Reviews": 5,
          "Date": "2023-10-25T23:13:04.000Z",
          "Titre": "Fast, easy and convenient",
          "Contenu": "Fast, easy and convenient to use. Always reliable and affordable."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "sherma",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T19:05:17.000Z",
          "Titre": "Very accessible and easy site to…",
          "Contenu": "Very accessible and easy site to navigate"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jamie-Lee Phillips",
          "Nb_Reviews": 12,
          "Date": "2023-11-11T11:31:40.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Instant top up"
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T02:24:47.000Z",
          "Titre": "Easy to use",
          "Contenu": "It was quick and easy to use!! I received my top up in minutes."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T21:31:52.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, straight forward."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T17:09:13.000Z",
          "Titre": "Simple experience",
          "Contenu": "Fast, easy and convenient"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Louise",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T23:39:45.000Z",
          "Titre": "My experience was awesome!!!!!",
          "Contenu": "My experience was quick, easy and effective"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Khizar",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T21:57:31.000Z",
          "Titre": "Best app",
          "Contenu": "Easy, quick and safe transaction and top up"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Helen",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T21:14:52.000Z",
          "Titre": "So easy and convenient"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:27:59.000Z",
          "Titre": "Quick service",
          "Contenu": "Easy to follow"
        },
        {
          "Note": 5,
          "Lieu": "SX",
          "Pseudo": "Dudley Larocque",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T17:26:43.000Z",
          "Titre": "Great topup service",
          "Contenu": "Great topup serviceGreat customer service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Janet  Reyes",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T20:05:24.000Z",
          "Titre": "Easy top up online experience",
          "Contenu": "It was quick and easy to top up online. Love it. Will use this again definitely."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Nicole",
          "Nb_Reviews": 3,
          "Date": "2023-10-20T22:40:20.000Z",
          "Titre": "It was quick and I was not locked from…",
          "Contenu": "It was quick and I was not locked from the card when I made a small error"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Ashraf",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T19:00:20.000Z",
          "Titre": "Very quick service",
          "Contenu": "Very quick service. Overwhelmed."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T12:47:03.000Z",
          "Titre": "Qucik services and I don't get over…",
          "Contenu": "Qucik services and I don't get over charged."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HONORATO FIGUEROA",
          "Nb_Reviews": 4,
          "Date": "2023-11-08T03:40:50.000Z",
          "Titre": "It helps me with my purchase easy."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "geoffery a",
          "Nb_Reviews": 8,
          "Date": "2023-11-03T05:00:09.000Z",
          "Titre": "Extremely user friendly",
          "Contenu": "Extremely user friendly, quick, easy top ups"
        }
      ]
    }
  ]
}