{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "eufylife.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Craig",
          "Nb_Reviews": 22,
          "Date": "2023-12-21T12:43:20.000Z",
          "Titre": "Bought a system from Eufy",
          "Contenu": "Bought a system from Eufy, which included a video doorbell, two external cameras and a HomeBase 3 unit to record and control the cameras. My main complaint is the battery life is nothing like the 6 months advertised. For example if my video doorbell is set to 'Balance Surveillance' the battery life is about 7 days. The video shows an example of the home owner using the doorbell and app to confront a shady person looking at their home. This could not happen if the doorbell is set to 'Optimal Battery Life'. Therefore if you need your doorbell for surveillance the only option is to hard wire the doorbell."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "John Bodsworth",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:37:04.000Z",
          "Titre": "No product no communication",
          "Contenu": "Ordered single product 28 Nov 2023 and the tracking app provided in purchase email says status still to be shipped. Emailed support twice both times getting chatbot generic response where it asked me to provide my order number which I did both times in subject line and content.  Zero customer service so far."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Barazanji",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:15:48.000Z",
          "Titre": "I have send many emails to customer…",
          "Contenu": "I have send many emails to customer services and support and over two weeks no reply. 30 days money back guarantee is a scam from Anker or Eufy product There phone number don’t even work!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:14:41.000Z",
          "Titre": "Detection is not working correctly",
          "Contenu": "Detection is not working correctly. Records content in privacy area.Phone service is busy most of the time. 1st line support does nothing and 2nd line support doesn’t respond when they say they will."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Items",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T11:12:22.000Z",
          "Titre": "I have not received my order",
          "Contenu": "I have not received my order. The order was reported damage by ups courier  i have notify i will receive new order in 10  working day. despite number of phone call and email  i still dont have any delivery information or when i will receive my order."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "B B",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T03:18:54.000Z",
          "Titre": "I have send many emails to customer…",
          "Contenu": "I have send many emails to customer services and support and over two weeks no reply. 30 days money back guarantee is a scam from Anker"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ehsen",
          "Nb_Reviews": 8,
          "Date": "2023-12-13T20:57:08.000Z",
          "Titre": "Not happy with the overall experience…",
          "Contenu": "Not happy with the overall experience product is not the best tried the robovac LR35 HYBRID and tried different debris which didn't really pick up. Called customer service on hold for over 35 mins opted for callback still haven't received a call back. Emailed support and not the most helpful so have returned the product and now I'm disputing delivery charges. Will go for another brand now."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Henry",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:54:59.000Z",
          "Titre": "Rubbish",
          "Contenu": "Left delivery outside, no notice of delivery until 2 hours before, ignored most of the email I sent only answered the bit there wanted!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "shaun",
          "Nb_Reviews": 16,
          "Date": "2023-12-14T13:14:03.000Z",
          "Titre": "Not delivered...ACTION FRAUD TO INVESTIGATE!",
          "Contenu": "Eufy failed to deliver two orders but took money. Refuse to refund, lie on chats, don't respond to emails and close phone line so i cannot complain. Credit chargeback and Action Fraud/Police to be notified."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Clive Rayleigh",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T00:39:19.000Z",
          "Titre": "DON,T BUY HERE",
          "Contenu": "I ordered a security light from Eufy/ANKER TECHNOLOGY (UK) Ltd.  Supposedly, it was delivered to my home address on 21 November. No light was delivered.Since then, I have received a series of misleading and delaying  e-mails from Eufy; culminating in a message yesterday stating that a replacement light was delivered to my address yesterday (Mon 11 Dec). NO LIGHT WAS RECEIVED.There is no proof that any light was ever sent.I would advise anyone thinking of buying from Eufy/ANKER TECHNOLOGY (UK) LTD to buy somewhere else."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nikhil",
          "Nb_Reviews": 10,
          "Date": "2023-12-14T14:06:32.000Z",
          "Titre": "I am terribly sorry to give the…",
          "Contenu": "I am terribly sorry to give the customer service so poor rating... I am eufy customer for past three years. I have got some of my friends brought eufy products via the referral links but all the instance I was told by customer care that the product was not brought via referral link and i never got the referral vouchers. This is not a very good gesture to keep customers loyal for this company. I think most have this issues and now I am trying to switch to other company - my friends will all return the orders recently purchased."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sridhar",
          "Nb_Reviews": 6,
          "Date": "2023-12-19T21:08:38.000Z",
          "Titre": "I did not receive the product I…",
          "Contenu": "I did not receive the product I ordered. Customer service is horrible, took few weeks to respond. Worst customer service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Elliott",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T18:37:34.000Z",
          "Titre": "I ordered a Homebase 3 on the 27/11/23",
          "Contenu": "I ordered a Homebase 3 on the 27/11/23, Shipping was meant to be 3-5 working days. It is now 3 weeks later and I still haven't received any shipping information despite me reaching out to Eufy customer service via email. I am extremely disappointed with this service, and would just like a refund at this point as it doesn't seem like my order is ever coming."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Patrizio",
          "Nb_Reviews": 11,
          "Date": "2023-12-15T22:08:04.000Z",
          "Titre": "They ship everywhere except Ireland",
          "Contenu": "They still don't ship to Ireland and I had to resort to Addresspal to order from them, which forced me to pay import duties and additional VAT. It's ridiculous."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Neil williams",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T20:31:24.000Z",
          "Titre": "Disappointed. Products brilliant, service not so",
          "Contenu": "Put in an order. Took nearly a week to arrive. Packaged very poorly, Product was only put in a postal bag. Retail boxes damaged and missing items. (Big rip in the plastic bag) Firstly poor packaging protection from Eufy. And UPS total lack of care with delivery. Sent back, still not resolved 3 weeks in to this shambles. Products are great. I ordered from Amazon instead. Would never order direct again. (Especially if they use UPS)  it a shame love the cameras. Take more care with delivery and use a courier that cares."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Shoncee",
          "Nb_Reviews": 14,
          "Date": "2023-12-12T06:43:44.000Z",
          "Titre": "Door bell won’t connect to WiFi no…",
          "Contenu": "Door bell won’t connect to WiFi no fault of mine well looked after speaking for week via email to eufy to be told basically due to it being out of warranty it’s tough and they don’t want to know! Very disappointing, do not use unless your happy to pay hundreds every 2 years because it will randomly not connect nd then the kit is absolutely pointless and doesn’t do anything!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sara",
          "Nb_Reviews": 7,
          "Date": "2023-12-11T21:51:51.000Z",
          "Titre": "Con Artists",
          "Contenu": "Company failed to deliver £700 vacuum and then told me that they couldn’t do anything except a 10% discount if I reordered and to claim with courier. Currently pursuing my consumer rights and a chargeback via payment provider. Avoid"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Deney W",
          "Nb_Reviews": 13,
          "Date": "2023-12-14T10:49:09.000Z",
          "Titre": "On my second 2k doorbell",
          "Contenu": "On my second 2k doorbell, first one lense delamination water Ingress, this was after 6 months, and the replacement lasted 3 months and stopped connecting to homebase, Eufy said the will send me a third one but no confidence in the brand anymore, especially with my solar camera suffering the same fate. Items not robust enough for all uk weather."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "H Cass",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T20:58:06.000Z",
          "Titre": "Hopeless company",
          "Contenu": "Hopeless company. Ordered from Eufy website on Black Friday. Product hadn't arrived 10 days later - supposed to be 3-7 working days. Customer service just said 'we can't say when this might arrive'. Asked for refund. Still not had that confirmed by email, so can't order another product from a more reliable company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bigwilf",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T21:04:40.000Z",
          "Titre": "Still waiting…",
          "Contenu": "Still waiting for my purchase to arrive having ordered it 2 weeks ago and being told it was out of stock due to high demand and have been unable to speak to anyone since!Extremely poor service and will not be recommending Eufy to anyone ekse"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Roland Parrott",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T21:13:55.000Z",
          "Titre": "Never dispatched",
          "Contenu": "Ordered several items. Those which arrived were good. Unfortunately some did not! For the missing items they never even sent a dispatch note, just took my money, confirmed the order and never heard any more. Customer service never got back to my many calls and emails. Using bank to get my money back. You're better off buying via Amazon than directly from Eufy!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ayesha  Begum",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T11:27:53.000Z",
          "Titre": "Customer service is shocking",
          "Contenu": "Customer service is shocking. No support whatsoever. Bought the latest floodlight camera they have and the camera quality it bad. Ring there customer service and it is very hard to get through to them. When you do they always say i need to pass on the information and never get back to you."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Daniel Muresan",
          "Nb_Reviews": 13,
          "Date": "2023-12-08T14:54:16.000Z",
          "Titre": "ANKER?  = same s**t different smell",
          "Contenu": "I didn't buy eufy products BUT they are made by ANKER which owns and makes same eufy products quality!  (Anker is a plain S**T COMPANY AND SUPPORT SELLING ABSOLUTELY DREAMS not reality. Product performance claims are FALSE AND THEY TRY EVERYTHING THEY CAN TO MAKE YOU KEEP THEM .... ! PAY ATTENTION and don't waste your money and time to deal with these cowboys!"
        },
        {
          "Note": 1,
          "Lieu": "LT",
          "Pseudo": "Gytis",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:02:02.000Z",
          "Titre": "Items are sold even though they are out of stock",
          "Contenu": "On November 17th, during the BF sale, I purchased a mach V1 steam version vacuum cleaner. It wasn't until December 6th that they responded to my emails, and only after I had escalated the ticket. Essentially, they are out of stock and not planning to restock, but they have not bothered to inform their clients about the situation. I hope they will issue a refund."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Caroline Esty-Akporokah",
          "Nb_Reviews": 5,
          "Date": "2023-12-11T16:56:31.000Z",
          "Titre": "The qr code isnt working to set up my…",
          "Contenu": "The qr code isnt working to set up my video doorbell and unable to speak to anyone. The office is constantly closed yet states open until 2 pm on the website. Im not happy after i spent alot of money to purchase and then fit it!!"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Tjobo",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T22:10:25.000Z",
          "Titre": "Return label free of charge",
          "Contenu": "I ordered a robot vacuum cleaner and i am not satisfied with the quality and workmanship. For this reason, I would like to return it within 30 days. However, I am asked to pay the postage costs.  These amount are approx. 20 € with DHL. I actually wanted to order the camera systems from eufy. But I'm not going to do that under these circumstances. I would have expected a return label to be sent free of charge!Furthermore, the process takes very long time. I registered the return on Monday morning and i received a reply today. Please send me a return label."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "RAY",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T12:30:52.000Z",
          "Titre": "Item never received …",
          "Contenu": "I bought one of you products 29/11/2023 it has not been delivered and I have had no notifications since I received my receipt. I wrote an email to explain the same, but again I’ve heard nothing. What is going on Mr Eufy please sort my order out."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T21:37:25.000Z",
          "Titre": "Not hapy because need hard drive very…",
          "Contenu": "Not hapy because need hard drive very expensive"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Sandra Teichmann",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:38:57.000Z",
          "Titre": "doesn't do what it promises",
          "Contenu": "I have described my problem several times. Unfortunately I always only receive automatic replies and my problem is not solved. Employees cannot be reached and you only ever get automated answers. One problem is still not solved. The customer service is really not good. The product also does not work as described and is not compatible with Alexa"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Adam",
          "Nb_Reviews": 8,
          "Date": "2023-12-12T01:24:06.000Z",
          "Titre": "More transparency on the compatibility…",
          "Contenu": "More transparency on the compatibility of its products. Tbh they are rubbish. Buy a ring instead. Overpriced and glitchy! Ring is 100 times better"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sridhar",
          "Nb_Reviews": 6,
          "Date": "2023-12-07T15:48:51.000Z",
          "Titre": "Don’t buy from eufy on their website",
          "Contenu": "Don’t buy from eufy on their website. Part of the order was shipped and they don’t have a call center helpline. When written over email, they just sent the tracking link to check the product delivered without checking what was delivered, how big the item in the picture is etc. it’s been 10 days now and still struggling to get a proper response."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "J.Jones",
          "Nb_Reviews": 12,
          "Date": "2023-12-07T17:41:19.000Z",
          "Titre": "Ordered 2 items during the Black Friday…",
          "Contenu": "Ordered 2 items during the Black Friday deals on 26th November and Evri delivered them to a completely different address which showed up on their tracking map. Another street..... 15 mins away and left outside a house by their wall on the main road. Yes you guessed it, it got stolen!Evri useless. So many emails sent but no one seems to be listening. Eufy are just as bad and very poor, unprofessional communication. They asked for an alternate address, which I have now given... a friends address who has better luck with Evri. However Eufy have gone silent and not responding to my emails with regards to the redelivery.Eufy, you shouldn't do black friday if you do not have the staff or equipment to sell. I feel absolutely let down as a new customer to Eufy. I will now be looking elsewhere for my other cameras that I am needing. This whole experience is too stressful and frustrating.I will be contacting Trading Standards are asking for their advice."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alexander",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T22:08:11.000Z",
          "Titre": "Eufy use Evri drivers. Simply avoid as you will never get your item",
          "Contenu": "They used Evri as a delivery courier. I still don’t have the item. Evri are worse than awful, and Eufy must take responsibility for using a woeful courier who employs drivers who simply lie and don’t do their job."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mike",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T22:00:53.000Z",
          "Titre": "I have not received my goods and the…",
          "Contenu": "I have not received my goods and the support provided by eufy support to resolve the situation is poor. In fact so poor it seems like it is a scam. I am yet to be convinced that it isn't."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alekhya Bhavana",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:38:12.000Z",
          "Titre": "Doorbell let down",
          "Contenu": "While we were at home, my doorbell got stolen. The cheap plastic made it easy for the thief to break by twisting, and, disappointingly, nothing was recorded during the theft. Unimpressed with both the security and customer support, I'm convinced this product is overrated. Won't be making the same purchase again."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stuart Bold",
          "Nb_Reviews": 7,
          "Date": "2023-11-30T19:59:35.000Z",
          "Titre": "EUFY doorbell...don't do it.",
          "Contenu": "These look after support for eufy doorbells. A plastic cover fell off mine but they dont offer this as a spare. Its pennies at most. Apparently though I can but a new one with a discount. Worst product support I've encountered. Buy a different manufacturer. I have friends with cheap copies that have lasted longer.Wish I could give zero stars."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "s j hallett",
          "Nb_Reviews": 9,
          "Date": "2023-12-07T21:20:09.000Z",
          "Titre": "AVOID AVOID AVOID",
          "Contenu": "Still haven't received my order, it has been sat in the Evri sorting depo since 24th  November, I've emailed eufy 3 times, first one asked me to wait until 10 days had passed and now eufy are not responding to emails. AVOID THIS COMPANY, order stated it would be sent via AMAZON delivery, not Evri and would be delivered within 7-10 business days, I placed the order on 20th November and it's still not been delivered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "The Yankee Drivers Hard Drivin' Bluegrass",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T05:12:28.000Z",
          "Titre": "Terrible experience with Eufy…",
          "Contenu": "I had a terrible experience with Eufy trying to order a security cam.  They say they can't deliver it because the address is a PO Box - but the address on the order clearly shows my physical address.  Customer support is worse than worthless, never looking into the problem, apparently unable to read the address, and promising that they will deal with the issue but never actually doing anything except sending me the same email, probably a bot.  I sure won't deal with them again."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Scott Welsby",
          "Nb_Reviews": 8,
          "Date": "2023-11-30T11:53:18.000Z",
          "Titre": "I bought an early bird token for the…",
          "Contenu": "I bought an early bird token for the black friday deal, so far I've heard nothing, contacted support 3 dsys ago... Still nothing dispite claims they respond in 24hrs, very poor overall. I wonder how many others have had money taken in this way."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Yolanda Pedro",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T20:48:20.000Z",
          "Titre": "I want to return the robot cleaner and…",
          "Contenu": "I want to return the robot cleaner and they sent me the address to return it in Canada while I ordered in UK on this site   Eufy UK. I refuse to send the robot at my cost in Canada.This is what they wrote:We are glad to assist you with a return and refund within the 30-day no-reason return frame. • Kindly note, if the RoboVac is not defective, the return shipping fee should be covered by the customer.• Please ensure to return all the accessories which came with the item back as well.• If the package was damaged or accessories are missing when it arrives at our warehouse, an appropriate fee to cover the loss will be deducted from the refund.This is our return address (please include the ticket# in the address):Ticket#TNT969031358AnkerDirect5350 Ontario Mills Pkwy Ste 100Ontario, CA 91764-5137I hope they will solve this issue quickly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carmen Mollica",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T20:40:16.000Z",
          "Titre": "Disappointing",
          "Contenu": "Disappointing. The camera completely fogs up when it is wet outside and with the morning dew. You can't see anything. ALSO, THEY KEPT SENDING ME BLACK FRIDAY ADDS ALL DAY THRU MY CAMERA ALERT!!! 7 times in 2 days i kept receiving solicitation thinking it was an alert! Really upsetting as i kept thinking someone was in my driveway or at front door."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "clayton davenport",
          "Nb_Reviews": 8,
          "Date": "2023-12-02T22:19:45.000Z",
          "Titre": "Took the money and ....NOTHING",
          "Contenu": "I purchased a E340 floodlight cam, was then told after 2 days there was a problem with delivery, waited 9 days, nothing, messaged Eufy got a ticket no. then nothing messaged again 2 days later still nothing......"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Carly Murray",
          "Nb_Reviews": 11,
          "Date": "2023-11-25T23:41:49.000Z",
          "Titre": "Warranty isn't upheld",
          "Contenu": "Initially this seemed like a good purchase. But soon the problems emerged. The map rotates which means that the robot isn't going around the room properly, leading to it getting stuck or missing areas. After a while the suction becomes poor. As time went on (less than 6 months) the vacuum became more and more confused. I contacted Eufy so many times and it seems like I am talking to an AI as I get the same reply over and over again. I am now trying to claim under the warranty process but again the responses from Eufy have led me to jump through repetitive hoops and I'm still no closer to a solution."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Suren",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:09:48.000Z",
          "Titre": "Still not received purchased products",
          "Contenu": "Still not received purchased products. Made a purchase on the 16th Nov, and I still haven't received the product, I have escalated the issue through the chat and it mentioned I will get a response within 24h. It has been more than 48h and still haven't heard back.For a company that that says they give great customer service, I'm certainly not getting it. Quite disappointed."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Adrian England",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T17:32:35.000Z",
          "Titre": "DIDNT WORK",
          "Contenu": "DIDNT WORK, WOULD NOT CONNECT, WHEN ASKED FOR A REFUND I WAS SENT ENDLESS MESSAGES WITH DIFFERENT SETS OF INSTRUCTIONS AND SUGGESTIONS AS TO HOW IT WAS MY FAULT OR I WAS INCOMPETANT. BUT NO REFUND"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul McCarthy",
          "Nb_Reviews": 31,
          "Date": "2023-12-08T11:34:34.000Z",
          "Titre": "Camera never arrived",
          "Contenu": "Camera never arrived, and after a month they say I have to just keep waiting. No way to contact support other than email, which they don't respond to."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Adam Hudson",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T00:30:24.000Z",
          "Titre": "They promised delivery within 3-7 business days, but I ended up receiving it after 25 days.",
          "Contenu": "«Over the course of one and a half years, I used the Ring 4 doorbell and decided to switch to the Eufy e340 because it was advertised everywhere and recommended as better than all other doorbells. However, in the end, it turned out that the Ring 4 loads faster when someone rings, unlike the Eufy, and the Ring 4 records video more quickly. The image quality on the Eufy is much worse than on the Ring 4. I had to go back to using the Ring 4»."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Julie Foster",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T21:42:07.000Z",
          "Titre": "Poor customer service",
          "Contenu": "I have been on the phone for over an hour and had to give up and ask for a call back. This has never happened! I bought a camera door bell and additional doorbell chime on the 9th November, the door bell arrived but not the additional chime. After lots of emails and weeks later the chime has arrived only to find out it doesn’t seem compatible. But trying to speak to a human is impossible, your customer care lets you down. Very disappointed customer."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Scott",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T10:02:17.000Z",
          "Titre": "Their referral programme is a SCAM",
          "Contenu": "I am a eufy camera owner. I referred a friend as per the offer which is advertised on the app. I followed all the instructions, the correct link was sent and used, the discount applied, and my friend got their new camera at a discount. I am now supposed to receive a £80 Amazon voucher from eufy. However, they just point blank refuse to honour the offer. They claim they can’t find the purchase or evidence the referral link was used, even though I have sent them all of the evidence and supporting emails and screenshots. The customer service is hopeless and consists of generic emails saying they still can’t find the referral on their system and wishing me a great day!!! They are con artists and only out to make money.  AVOID."
        },
        {
          "Note": 1,
          "Lieu": "MM",
          "Pseudo": "Tin  Cho",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T05:54:43.000Z",
          "Titre": "Eyfy security Soli cam was not…",
          "Contenu": "Eyfy security Soli cam was not delivered . I am struggling to claim my money back. Keep away from this scammer."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Billie Meichan",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T22:02:02.000Z",
          "Titre": "Black friday awaiting delivery",
          "Contenu": "Placed an order as an existing customer. Still waiting for my order 10 days later. This is such a bad way to treat customers. Ran out of stock. No emails or messages to tell me this. Bad to go to live chat 3 times to find out where my order is"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "jackie mitchell",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T13:49:42.000Z",
          "Titre": "Dreadful",
          "Contenu": "Dreadful. Problem with H30 vac not charging. Seems impossible to address having tried telephone, email and chat. Buy at your peril"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nikki J",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T13:47:55.000Z",
          "Titre": "The worst security system on the…",
          "Contenu": "The worst security system on the market. Purchased the system 2 years ago. Doorbell never got round to install it and won’t connect with the hub, sync button now gone into the device and device is flashing. Outdoor camera never used, got round to installing it and it won’t connect to the hub it’s a eufy 2 cam and by search online it seems a common problem with this camera. The security alarm is aload of crap and pointless device. Sound comes from the hub st a low sound. Security alarm is pointless. Overall waste of money and would never buy from eufy again."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Aaron Bramer-Doy",
          "Nb_Reviews": 19,
          "Date": "2023-12-03T16:40:09.000Z",
          "Titre": "Item missing, no customer support",
          "Contenu": "Order was received inadequately packaged, several loose boxes in a plastic bag. The bag had torn open in transit and one of the items was missing. I immediately informed Eufy including the UPS delivery photo showing the torn open bag but they are doing nothing about it. E-mails are not replied to and no one answers the customer support phone line. With customer support this poor I will not be purchasing any further Eufy products.*********UPDATE*********Eufy Customer Support have finally replied to one of my e-mails, they are \"sorry to learn that\". They then went on to inform my that their policy required that I return the missing item so that they can send a replacement, or I could use the missing item and receive a 5% discount for the inconvenience.  They clearly have no idea what \"missing\" means!!! What exactly are they expecting me to return, an empty box?!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "tony hutchinson",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T15:07:48.000Z",
          "Titre": "Still haven’t received my order after…",
          "Contenu": "Still haven’t received my order after 22 days when 3 to 5 were quoted. Send 3 emails without reply"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Phil of Leeds",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T11:07:34.000Z",
          "Titre": "£640 order",
          "Contenu": "£640 order, only 50% arrived, sent 4 pictures of clearly too small packaging for the whole order a week ago, no response from Eufy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "susansul",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T01:20:57.000Z",
          "Titre": "Not an effective security camera",
          "Contenu": "The Eufy  camera doesn’t capture the motion events effectively. I had RING for my parents house and was very happy with the frequency of motion events captured.For our house, we decided to try Eufy because it offered no annual subscription fee. (Vs. RING that has annual fee) . In the first year of having Eufy cameras,  came across a few incidents that we needs to see when/who. But when checked the Camera’s , painfully, found out that the camera had not captured the events. After a few similar experiences, I can say that Eufy cameras seem to not capture the motions consistently. It’s motion capturing is a hit and miss by a lot. More like capture one then miss the next 5  or 6 which makes it a not good security camera.I’m going to cut my loss and replace the Eufy with RING"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Aj",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T03:28:02.000Z",
          "Titre": "Worst customer service",
          "Contenu": "Product didn’t arrive within the agreed 3-7 working days. I tried to contact customer service but didn’t have a response."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nosferatu",
          "Nb_Reviews": 44,
          "Date": "2023-11-18T14:18:15.000Z",
          "Titre": "BLACK FRIDAY SHAM!!!!",
          "Contenu": "BLACK FRIDAY SHAM!!!!Whats the point in offering a early bird discount copoun that can ONLY be redeemedd on the Eufy WEBSITE shop...BUT...If you buy the Black Friday Gift Card, It can only be redeemed in the Eufy APP phone shop!!!?!?This makes the whole process absoutely pointless!! If you offer the deals to be purchased on BOTH platforms. THEN MAKE IT REDEEMABLE on BOTH platforms!! MORONS!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Angela Murphy",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T10:39:14.000Z",
          "Titre": "Ordered on the 20th November",
          "Contenu": "Ordered on the 20th November, still not heard anything. Will not be buying from you again. Shocking customer service. Just want my money back now. Rubbish."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T08:15:32.000Z",
          "Titre": "Good product, Terrible seller",
          "Contenu": "The products are really good so far. Just don't purchase from them. They are awful.Don't ship to committed dates, and the after care is simply terrible. You will waste hours of your life with them chasing up orders and returns.More often than not you get better deals at resellers with trusted after sales."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Morgan J Collins",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T23:32:20.000Z",
          "Titre": "Have 2 x S40 solocams. Expensive paper weights.",
          "Contenu": "Have 2 x S40 solocams.These worked fine for over 1 year and no issues.  Now have 2 expensive paper weights.One day, logging into app, no events recorded.  Followed help guide to.  Reset, reconnect etx.1st camera does not enter pairing mode.  Advised, out of warranty.  Sorry.  2nd camera connects.  Can stream live video.  Will not detect or record events.Eufy support very ineffective. Complete rubbish."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Brian Moreton",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T16:41:54.000Z",
          "Titre": "I cannot register my Account",
          "Contenu": "I cannot register my Account! I am 87 & very slow at typing - not to mention correcting mistakes. By the time I have filled in the information correctly, the time allowed has expired. So please think about your your elderly customer base and provide us with us with enough time to respond."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T00:09:21.000Z",
          "Titre": "Very bad experience",
          "Contenu": "Very bad experience! Ordered 3 weeks ago still no product! Tried a number of time to email and call but no reply! Went on live chat told I would be sent a replacement but again no word on when."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T15:07:06.000Z",
          "Titre": "BEWARE!! IF EUFY OFFER A REFUND DISCOUNT!!",
          "Contenu": "Scales stopped working at 18 months…conveniently the warranty is 15 months.After much wasted time with customer services they offered me a 20% refund if I bought another set from the Amazon Eufy store, it didn’t feel right at the time you had to buy it first to get the refund. New scales bought off the Eufy Amazon Store…needless to say the refund was not honoured. Disgusting…behaviour."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "TC",
          "Nb_Reviews": 31,
          "Date": "2023-11-19T01:07:07.000Z",
          "Titre": "Dissapointing battery life and high maintenance cost",
          "Contenu": "Dissapointing battery life of only 15 months and out of the one year guarantee which cost £60 to replace.This combined with the need for a maintenance kit for brushes, filters,brush tetainer etc involves an annual cost of £110 which is over one third of the purchase price.This I find disappointing and unacceptable for a cleaner, hence only one star.. Although I cannot fault its performance and would consider it to be the best on the market, as is their support service which is first class."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark - Ashton , Manchester.",
          "Nb_Reviews": 17,
          "Date": "2023-12-04T07:06:16.000Z",
          "Titre": "Absolute tat",
          "Contenu": "Absolute tat! Off line permanently now after sending a replacement doorbell.Save your money ! Go elsewhere"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Maggie",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T22:01:07.000Z",
          "Titre": "Not cleaning the edges",
          "Contenu": "Not cleaning the edges, moves dirt around not sucking all the dirt up. When it cleans it runs back to the home to clean the mops up and then forgets where it cleaned, it then says it's finished cleaning but it shows on the app that it's missed out whole sections and have not gone to clean that area. Told the customer services that it's not working I've put it on high to clean and mop. So there it's a problem with this machine and they said that they not paying for it to be sent back. Very bad customer service and very bad machine don't buy from them. Paid £800 for a rubbish machine"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Károly Stadtrucker",
          "Nb_Reviews": 24,
          "Date": "2023-11-16T22:38:48.000Z",
          "Titre": "I bought a 2k wired video doorbell…",
          "Contenu": "I bought a 2k wired video doorbell recently. First it was ok, then all of a sudden it started acting strange. Not sensing motions, not recording only live view. I contacted them they said to check the battery. The battery on the hard wired device. Then to send them evidence of the purchase. I really tried to like this company but it is a nightmare. Wouldn't recommend it to anyone"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Adil Ali",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T11:35:42.000Z",
          "Titre": "Don’t buy item from them because if you…",
          "Contenu": "Don’t buy item from them because if you order then you will not get item might be 1 year. Because they said when order item that 5 to 7 days start from shipment. After you order item might take 6 months or year no time frame for shipment. Once shipped then 5 to 7 days count."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "klant",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T10:41:01.000Z",
          "Titre": "Dont use the eufy webshop, Items received damaged",
          "Contenu": "Packages arrived heavily damaged, solution was €10 refund. Instead of sending a new item. Ordered 3 items, the homebase was send first  and 2 weeks later the doorbell and camera? I had no use for the homebase without the other 2 items. Decided to order the homebase 3 + 2 cameras elsewhere, which was cheaper and shipped quicker. When I finally received all the packages the doorbell worked but the camera did not. Was quite a hassle to send it back. Would not recommend to order again via eufy webshop, instead use ANY other reseller for better service and quicker shipping."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Carmel O'Dwyer",
          "Nb_Reviews": 3,
          "Date": "2023-11-02T21:37:21.000Z",
          "Titre": "Got a wireless Eufy doorbell",
          "Contenu": "Got a wireless Eufy doorbell. The microphone and speaker never worked properly and when I moved home it stopped working completely. Customer service were unable to help and then the warranty ran out. I wouldn’t take one if it was offered for free. Avoid and go with another company. It’s a very common problem according to online threads I found after the problem."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jan Baynham",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T21:52:51.000Z",
          "Titre": "eufy support unable to deal with the problem",
          "Contenu": "I have written to eufy support at length.  They have failed to deal with the problems"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Shoncee",
          "Nb_Reviews": 14,
          "Date": "2023-11-13T09:47:26.000Z",
          "Titre": "Very disappointing",
          "Contenu": "Very disappointing! Only had doorbell two years. Recently changed WiFi and now doorbell won’t re connect or work at all. On speaking to eufy after a week of waiting for a response they say sorry can’t help cos you have had longer than 12 months but pls just buy another one from us!! Disgraceful. Won’t buy from here again!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "J.Jones",
          "Nb_Reviews": 12,
          "Date": "2023-11-30T20:50:06.000Z",
          "Titre": "Awful customer service and poor…",
          "Contenu": "Awful customer service and poor response to my cameras that were delivered by Evri to a different address on another street.3 days ago logged this with Eufy on their chat and received automated reply (# TNV696357892). Next day spoke to a customer service agent, Alice in China who was not helpful at all. Just said I'll let our warehouse know and for me to chase it up in 48 hours!Yesterday and today as still no response from Eufy, I sent an email.Still no reply, even though I kindly requested to receive a response today and to redeliver urgently using Royal Mail, Not Evri who are useless where I live. I have an electrician booked next Monday who is putting security lights and these cameras up for me and I have stressed to Eufy redelivery is urgent.I am new to Eufy, paid alot of money for my camera's and if this is a sign to come of Eufy as a company with poor response time and slow at resolving lost cameras efficiently and with a lack of respect to it's customers, I will not feel like ordering anymore cameras with them again.You're happy to take the customers money but you are not there when things go wrong, like items lost in the post!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sam I",
          "Nb_Reviews": 7,
          "Date": "2023-11-18T06:58:28.000Z",
          "Titre": "Really disappointed with our doorbells",
          "Contenu": "Really disappointed with our doorbells, we’ve gone through two in two years. The first doorbell at the start of this year, the sound just stopped working so we would play videos and instead of sounds it was just  a kind of white noise. Eufy weren’t helpful and offered only for us to purchase a new one which after how much we spent on the first two (not to mention family and friends we’d recommended to) wasn’t something we were prepared to do so we moved the second doorbell we were using elsewhere to the front, now this one has the same issue rendering it completely useless as we can’t hear anything people say. They might be easier to set up than other brands but they definitely aren’t designed to last and there are no fixes to these issues either."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Bilton",
          "Nb_Reviews": 17,
          "Date": "2023-12-08T17:23:49.000Z",
          "Titre": "LR30 HYBRID has stopped dispensing…",
          "Contenu": "LR30 HYBRID has stopped dispensing water and trying to get hold of Eufy is impossible"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rich B",
          "Nb_Reviews": 57,
          "Date": "2023-10-28T13:18:39.000Z",
          "Titre": "Very poor non existent customer support",
          "Contenu": "Very bad quality, non existent customer service and back up support if (and they will) go wrong. Me E220 froze and would go up or down, Eufy 'customer support' did NOTHING to try and help and were more concerned about whether I'd be buying a new one !Cheap, poor quality!!Never again will I buy from Eufy/Anker"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 29,
          "Date": "2023-12-14T21:22:16.000Z",
          "Titre": "Shambles",
          "Contenu": "Difficult to set up and the customer service is non existent for help or anything related to the Eufy E340,very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Maureen Piff",
          "Nb_Reviews": 5,
          "Date": "2023-10-24T21:36:45.000Z",
          "Titre": "Don’t trust their offers or promises…email address is not correct",
          "Contenu": "Don’t trust their offers or promises email address on site and invoice is useless and when we managed to actually do a chat told that email isn’t correct. The site said  if you recommend someone and they purchase something the person recommending them gets a free camera. But they then say you have to prove they ordered it through their link but send no paperwork supporting that. My daughter was sitting next to be when she sent referral and watched me order through the link, three months later say that they need proof. Beware you end up paying more and getting less. Obviously with the wrong email address it means you don’t get anywhere."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tim",
          "Nb_Reviews": 6,
          "Date": "2023-11-15T09:18:25.000Z",
          "Titre": "Don’t buy eufy!",
          "Contenu": "Absolutely do not purchase their outdoor cameras. After less than 2 years outside one of the eufy 2C cameras has water ingress and the camera is completely fogged up. When I raised it with eufy they said “Thanks for the feedback, tough for you though as it’s out of warranty”. I tried to claim consumer law as purchased directly from them and they followed up with “If you buy the same exact camera you can have 30% off”. Why would I want the same camera that is clearly not fit for purpose. Why should I pay anything. IP67 should not fail in less than two years, especially as I’ve got a second one that’s been used for the same period of time in the same garden. This is not the first issue I’ve had with their product, they had a feature that allowed recording based on your location and it took months of emailing to no resolve, before I gave up. As soon as the few cameras I have remaining break I’ll 100% be going elsewhere and actively telling people to avoid this brand."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lucy",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:34:04.000Z",
          "Titre": "Terrible service - do not buy!",
          "Contenu": "Terrible service!  I ordered 3 weeks ago and the product that was meant to shop within 3-7 working days still hasn’t shipped - I have had no contact or update from Eufy and have tried to contact them several times to query where the order is and they are not responsive.  Fraudulent company - do not buy!"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Alp Günalp",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:36:57.000Z",
          "Titre": "very bad",
          "Contenu": "very bad, I am very sad and furious fir the AI answers i got to my mails. and my problem is not yet solved"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alakea Kiani",
          "Nb_Reviews": 10,
          "Date": "2023-11-20T06:39:30.000Z",
          "Titre": "I bought a robot vac through their…",
          "Contenu": "I bought a robot vac through their website for their Black Friday sale. I also always refund policies before I buy products because I do not want to get stuck with something that doesn’t work with what I need it for. I received the unit, charged it, and ran it. It didn’t pick up some things no matter what suction I had it on, and the brush kept popping off. I contacted Eufy for a return and they are telling me that if it’s not a defect, I have to pay to return it. I don’t remember reading that in the return policy. I also saw that robot vac that I bought was way cheaper on Amazon with prime and free returns. I went to reread their refund policy on their website in which that under “30-Day Money-Back Guarantee for Any Reason” it never mentions anything about paying for returns. Only more paragraphs down under “Warranty Claims for Quality-Related Issues” is it found. As a consumer, if I’m not looking for warranty related things, why would I read that? Why would you hide paying shipping for a refund under there?It honestly seems predatory and I’m not surprised by finding out the company is based out of china."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T11:17:22.000Z",
          "Titre": "The products do NOT work after a very…",
          "Contenu": "The products do NOT work after a very short space of time. Conveniently always straight after warranty. Even when they do work they only pick up 50% of motion on their cameras and pick up areas you set it to ignore."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "JANE WILKINSON",
          "Nb_Reviews": 14,
          "Date": "2023-11-01T10:28:39.000Z",
          "Titre": "Eufy robot vacuum",
          "Contenu": "Eufy robot vacuum - battery died after 8 months and needed replacing. After 15 months the fan went and as out of warranty and no repair service in UK it was now unusable. For an expensive product, lasting 15 months is not fit for purpose."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Unhappy",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T14:56:54.000Z",
          "Titre": "Do Not Buy Doorbell -",
          "Contenu": "Never worked properly from the start - Customer support is in Asia and open 6am to 2pm and in pigeon English - no use if you are in the UK. Said they fixed problem remotely but within days recurs and renders the whole system useless- have to power down and reboot every time, not possible unless you bare present. Now they admit it is faulty - want me to dismantle and return AFTER which they will replace. So I will have no doorbell in the meantime?? How long will it take? Go elsewhere"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alex",
          "Nb_Reviews": 6,
          "Date": "2023-11-16T09:14:28.000Z",
          "Titre": "Awful product and terrible customer…",
          "Contenu": "Awful product and terrible customer services!All my cameras have failed after 18 months and no effort made at all to help me or resolve my issues!Avoid at all cost. You have been warned"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Joanna Goodwin",
          "Nb_Reviews": 10,
          "Date": "2023-09-19T14:01:44.000Z",
          "Titre": "AVOID",
          "Contenu": "The picture quality is shocking. Suppose to have face recognition but cant save the faces. Night vision isn't clear enough. Lense coverage isnt as wide as states. Delay on responses. Delay when speaking to people. No difference between 1080 and 2K cams. Says no monthly fees yet cloud storage chargeable feature. Local storage on 128gb don't even get a full 24hours. Doesn't record live view. Only records for 12 sec yet settings 120sec. Battery isn't removable so have to charge the whole device - either have to purchase 2 or not have security during charging."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Clemas",
          "Nb_Reviews": 8,
          "Date": "2023-09-29T20:44:31.000Z",
          "Titre": "We are still  awaiting delivery as…",
          "Contenu": "We are still  awaiting delivery as Evri, despite having a collection point in our village shop, a little along the road from us, could not find our address. They then said that they had after all, delivered our order, without of course having any proof of where they were claiming that it had been delivered.We are thoroughly dissatisfied, as we paid for our order nearly a month ago"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Amanda McCalmont",
          "Nb_Reviews": 20,
          "Date": "2023-11-01T23:23:55.000Z",
          "Titre": "I wouldn’t this again if I had the chance",
          "Contenu": "Purchased the light which was simple. Delivery took ages. At night I am having to switch the power supply off to the light as it’s constantly picking up people, animals and more when people walk or drive over 20 feet away from the front of my house. The light is far too bright. I have it on the lowest setting and it still illuminates the houses on the other side of the road. Customer service is atrocious to resolve the sensor issue and blaming me for not responding in a timely manner when it takes them 2 days to reply to an email. If the light worked as advertised I’d be happy with it but as it doesn’t it’s costing me a fortune in electricity and time wasting."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jordan",
          "Nb_Reviews": 4,
          "Date": "2023-10-26T17:05:55.000Z",
          "Titre": "Non-existent Aftersales Support",
          "Contenu": "Unfortunately I cannot review the product as I never received it. Parcel was supposedly delivered yesterday according to Evri tracking provided. No parcel from Eufy received.Despite providing them evidence that none of the parcels in the delivery could possibly have contained the camera due to the size of the parcels, they are adamant that I am at fault and therefore will not proceed with a replacement or refund.Having to raise a chargeback claim via PayPal to attempt to recoup my lost funds.If you are going to buy a product, never buy from eufy.com directly"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "R M",
          "Nb_Reviews": 4,
          "Date": "2023-11-15T09:54:22.000Z",
          "Titre": "Products don’t last",
          "Contenu": "Robot hoover stopped working within first year. As it was a gift customer services would not help. Would not buy from this company or recommend"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T11:53:04.000Z",
          "Titre": "No customer service at all...",
          "Contenu": "Customer service is absolutely shocking! To be fair I don't think there is any after care or customer service, I ordered 2 items and only received one, no update on my missing item, have tried to contact them and still waiting for response."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris Andrews",
          "Nb_Reviews": 35,
          "Date": "2023-12-01T23:01:13.000Z",
          "Titre": "Purchased an early bird voucher for…",
          "Contenu": "Purchased an early bird voucher for Black Friday on the understanding that it assured a lower price... Paid and received an invoice.  All good so far.  But, No voucher/code arrived.Tried Eufy online help - but just got an automated response system that was useless, irrelevant, unhelpful, circular and extremely irritating.  Gave up for a while. Tried various other angles for getting through to a (dare i suggest) person. Not much use from the Eufy website.  However, Google came up with a contact number... but not before I was assailed by Eufy automated sales calls and emails.  Yuk!The person i spoke to sounded like they through i was a thief!  the underlying feeling presented was, 'we are right, you must be wrong'.    I get the feeling that this is a technology company with little or no understanding of people!After repeating the facts several times I was told 'we'll investigate,... and get back to you.  Sub text, 'we'll get back to you if we can't prove you're wrong'.  I asked and was told it would take 1 to 2 days to investigate... and and email arrived promsing, 'A specialist from our support team will contact you within 1-2 business days to help you resolve the issue.'  That was 9 days ago and .... and I'm still waiting to hear from Eufy But an email voucher has arrived with no explanation as to how it can be used.. Click the link and it takes you to a page showing the camera system I planned to buy... but now they have increased the price by £200 above than the previous price. ... And, there is no click-through to purchase the item.  HOPELESS.  Incompetent.However, this email was only sent to me after the Eufy marketing system sent an email with USD prices.. which are 40% lower than the UK Black Friday prices... and 80% lower than the price they are now showing for UK buyers.Are Eufy incompetent, confused or dishonest?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T05:43:51.000Z",
          "Titre": "Two floodlight cameras malfunctioned",
          "Contenu": "Two floodlight cameras malfunctioned. Eufy will not stand over their products. Really disappointed and really advise against purchase of their products."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Thomas Hage",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T22:49:51.000Z",
          "Titre": "NO DELIVERY & NO REFUND",
          "Contenu": "Eufy did promote with an timing offer. I purchased in the night - uninformed. The next day the offer was repeated. So i declined the package.I AM STILL WAITING FOR RESPONSE AND MY MONEY. DO NIT ENGAGE FOR BUSINESS HERE!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Matz Leung",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T21:32:50.000Z",
          "Titre": "Delivery failed",
          "Contenu": "I have three orders placed since 28-Aug-2023, until today 12-Sept-23 and I just got one order delivered over 14 days. My orders and tracking numbers showed below:1/eufyCam S220 (eufyCam 2C Pro)Carrier: EVRi2/Video Doorbell S330 Add-onCarrier: EVRiPlease help with the delivery arrival ASAP.Y.W.L"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Theresa Storr",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T01:04:56.000Z",
          "Titre": "I have not received my recent order……",
          "Contenu": "I have not received my recent order… and will put this bad service all over social media in the next 48hrs if it’s not addressed"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Sean Nolan",
          "Nb_Reviews": 4,
          "Date": "2023-10-18T10:55:11.000Z",
          "Titre": "👎 Trying to purchase 4 S330 cameras",
          "Contenu": "👎 Trying to purchase 4 S330 cameras, an E340 video doorbell & the latest homebase. Don't deliver to Ireland on their EU site!!! Support tells me to order off the German site. Same story. Don't deliver to Ireland. 🤬"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Krzysztof",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T09:27:46.000Z",
          "Titre": "I bought a security camera",
          "Contenu": "I bought a security camera, and then it turned out that you also need a home base, otherwise it is useless.  In the past, I bought various types of cameras many times and it worked without any additional devices.  Minus for phishing all data in the mobile application."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Matt Peet",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T17:57:00.000Z",
          "Titre": "Still waiting for my order over 3 weeks.",
          "Contenu": "Still waiting for my vacuum cleaner I ordered over 3 weeks ago. Customer support have no information about where my order is. And eventually after multiple emails they ask me to wait 1 more week. Now I get an automated email asking for a review before I even received my product....so here it is. I give them an extra star for atempting to automate some administration."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Greg Tebb",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T16:30:28.000Z",
          "Titre": "Let down by poor customer services",
          "Contenu": "I have 3 spotlight cameras, a door sensor, a hub plus a doorbell. Overall they work well….but….and here’s the but. After 24 days my doorbell had issues with charging and fast battery discharge. I’ve been trying to get a resolve with customer services for 6 days now without progress. They now want me to send the bell back for examination before they send me a replacement…they never answer the phone, emails take ages to get a reply. My advice is to buy through Amazon not direct with Eufy."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Carso",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:08:12.000Z",
          "Titre": "I just my package is shipping but no…",
          "Contenu": "I just my package is shipping but no way to tracings or checking anymore. I can’t sure if I will refer yours to my friends."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Fiona McDavid",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T22:53:06.000Z",
          "Titre": "So far unhappy purchase",
          "Contenu": "I have an old house with thick walls and have 2 routers so that the signal remains strong. I cannot see any way of linking my cameras at the back of my house to one router and the cameras at the front of the house to the other router.The clock on the various cameras is not in sync with the actual time- the 3 cameras which are not near the router are an hour out of sync whereas the front camera which is near the router is at the right time. Unfortunately when I tried to view the front of house there was an initial glitch with a notice to say that camera wasn't working. Thankfully when I re-tried the camera started to work. That is a bit worrying - does it mean it would have remained inactive until I updated it? I was under the impression I would have been able to access the hard drive but there seems to be no easy way to do that. I'm not that techy so we're I to remove the 1tb hard drive how would I go about viewing it?"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Sean",
          "Nb_Reviews": 26,
          "Date": "2023-12-15T08:30:24.000Z",
          "Titre": "video doorbell without a view☹️",
          "Contenu": "bought eufy video doorbell it seems to work but i cant get it to connect to my network which is seriously bad not very impressed as cant use it if it wont connect so just waisted another £160 ☹️😡 this is why it gets 2 stars"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jerold paet",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T01:14:16.000Z",
          "Titre": "Shipping delays and no updates",
          "Contenu": "To be honest I haven't even received my security camera with home base which I've ordered online from their site. I didn't receive an update about my product until, I call them myself on December 8, 2023. You can tell how a business is run just by how much they  update their customers about my shipment. I wouldn't recommend this company as for the products still waiting since November 30, 2023."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Robert Shale",
          "Nb_Reviews": 41,
          "Date": "2023-12-19T10:50:07.000Z",
          "Titre": "back plate that holds bell faulty…",
          "Contenu": "back plate that holds bell faulty contacted and sending new back plate still waiting"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "B B",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T14:23:00.000Z",
          "Titre": "Not great at all",
          "Contenu": "Not great at all, doesn’t really do what I saw on YouTube or description x9 pro robovac can not be used as a main floor cleaner for any space! Can’t get hold of custmer service despite the many calls I’ve had tried"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr BC",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T18:37:35.000Z",
          "Titre": "All round disappointing",
          "Contenu": "Not thrilled with eufy and it's a shame as we have a few devices. Having inherited a security system and therefore needing the eufy app, we chose eufy products as we were already in the ecosystem. It's just all been quite disappointing. While the security system is OK, just OK (slow alerts, clunky app and regular false alarms), the robot vacuum has been a big disappointment, it simply doesn't work properly. Fine, these things happen. What's really disappointing is the support. After a ludicrous back and forth over email and a barrage of questions, it's now been a week of silence since the case was referred to the technical team. It's a surprisingly poor customer service and just an all round frustrating experience for an expensive product. Disappointing, I really wanted to like eufy."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 6,
          "Date": "2023-12-06T10:38:31.000Z",
          "Titre": "Randomly won’t pick up motion",
          "Contenu": "The idea of these cameras seems to be good however for some reason they randomly won’t pick up motion which as a security camera is not ideal. Customer support are of no help"
        },
        {
          "Note": 2,
          "Lieu": "PT",
          "Pseudo": "Filipe",
          "Nb_Reviews": 210,
          "Date": "2023-12-15T21:59:57.000Z",
          "Titre": "Dishonest business with shady business practices and good support",
          "Contenu": "Fake offers and deceptive/false/misleading advertising. They advertise \"€300 OFF\" and \"Hurry! Offer Ends Soon!\" for Black Friday, but the offer remains for weeks and they still offer €250 off afterwards. Turns out they apparently have these fake \"sales\" all year round.I refused delivery of the item after noticing the \"scam\" and got a full refund."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Cafer Kurt",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T10:04:29.000Z",
          "Titre": "I write the Support and no answer",
          "Contenu": "I write the Support and no answer. You make so much advertising, you want that the people buy your products. but you have to have a aftersales. If there is a problem, you have to help to solve this problem."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Peter",
          "Nb_Reviews": 6,
          "Date": "2023-12-04T17:12:33.000Z",
          "Titre": "Not an alarm",
          "Contenu": "Worked well when bought. More and more bugs less user friendly app. Useless as alarm, the alarm or sound is as high as your mobile phone. Will not scare anyone! Buy something else if alarm is what you looking for.The app gets more and more unfriendly.-As alarm app you want to activate and de activate quick in main menu. -Also reach your cameras. Remove Edge and Explore tab in the app. This does not make any sense since it is not direct connected the products I bought."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "DRH",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T09:29:13.000Z",
          "Titre": "Battery prematurely failed in my X8…",
          "Contenu": "Battery prematurely failed in my X8 Hybrid Vac. This unit hadn't even been operated daily, and was un-used for a period of time, so I was disappointed on the longevity of the Lithium pack compared to other products I have owned. I did get a small discount because Eufy agreed it hadn't lasted long so will be interesting to see how long this next pack lasts."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T05:23:11.000Z",
          "Titre": "These devices are great for the first…",
          "Contenu": "These devices are great for the first few weeks, then you are required to buy more filters, replacements etc. the waste bin size does not suffice for one couple, we need to empty it twice daily, we are waiting until eufy has run its course and will not replace."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Christian",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T22:05:47.000Z",
          "Titre": "worst custumer service since this year",
          "Contenu": "To reach the german customer hotline is a catastrophe! Via email you receive automatic answers, and if you complain, the customer service still doesn’t work customer friendly.not supportive at all"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Mary Mitchell Chambers",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T06:56:53.000Z",
          "Titre": "This company discriminates against Military…",
          "Contenu": "This company discriminates against Military members serving the U.S.!I really (I mean REALLY) liked my Eufy and when I wanted to upgrade, I tried to order directly from the company (skip lining the pockets of bulk business). Come to find out, they will not ship to a US address used by military members.Please! No matter how much you might enjoy a product from a company, help support the military members and their families that sacrifice every day to protect you. Having the ability to still get the same items we would buy if we were stateside is such a huge deal, and that may not make sense if you have never lived outside the US, but it is!This is a discriminatory practice. Mailing a package to my US address costs exactly the same as mailing it to someone's street address in the US."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Gary Sik",
          "Nb_Reviews": 4,
          "Date": "2023-10-26T12:33:10.000Z",
          "Titre": "A very complicated referral scheme",
          "Contenu": "We have purchased 3 products, but via different channels as their prices flucatuate a lot and have material differences.  So far. the products are operating with no major issues.  However, there are confusions as how we can use the discounts for friends' referrals and it seems not easy to utilise the scheme and my friend who referred me to Eufy ended up not getting any referral bonus nor gift coupons."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T09:30:18.000Z",
          "Titre": "Poor order handling",
          "Contenu": "(1) I ordered the latest doorbell and the latest homebase from Eufy in one order. When the shipment was done, only the doorbell was sent. There was no indication that only one of the products will be sent, neither in the order status page nor in the notification email . When I received only one product I was confused so I called up the customer care then informed me that my order was split into two deliveries. I was also given a date by when the second item from my order will be shipped.(2) Even after the promised date had passed, there was no notification about a shipment. So I had to again call up the customer car, who confirmed that the second product was in stock and took an action to ship it to meI wouldn’t have expected to call up customer care, even once, for getting the products I ordered online. But the order handling process at Eufy forced me to call up twice before I got the products I ordered online."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Jan Z.",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T21:46:02.000Z",
          "Titre": "Bad homebase 3 connection, support not easy to reach",
          "Contenu": "The connection between homebase 3 and cameras is extremely bad. I bought 4 cameras and it's impossible to find a location for the Homebase 3 to connect all of the cameras. Also, the support is not easy to reach. You have to upload a copy of your receipt in order to ask a simple question and get help. So annoying, I think I'm gonna return everything."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "James Brind",
          "Nb_Reviews": 10,
          "Date": "2023-11-30T21:13:36.000Z",
          "Titre": "Stopped working within a couple of…",
          "Contenu": "Stopped working within a couple of weeks so I returned it for a full refund within the 30 days."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Al",
          "Nb_Reviews": 3,
          "Date": "2023-10-17T21:06:40.000Z",
          "Titre": "Not very helpful, deliveries made by Evri..",
          "Contenu": "Customer support was helpful and fast at first but then I made a purchase. Delivered (sort of) by Evri. They claim to have delivered the parcel and sent a photo but it was not at the right address, I had a look around but the parcel was nowhere to be found until a kind neighbour brought it back. In the meantime, I tried calling and emailing their customer support. On the phone, I was told I should hear back within 24 hours, still waiting nearly 2 weeks later.."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Markus-A. Manns",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T20:07:02.000Z",
          "Titre": "Geofencing not usable; big time lags",
          "Contenu": "Geofencing works only sometimes randomly. This problem of the eufy App has not been solved for over two years now. Using \"foreground services\" does not really help but drains the phone's battery rapidly. Additionally recent updates have slowed down the start and overall performance of the devices (base and cams) and apps, so bidirectional communication offen falls due to massive time lags."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Emory Cunnington",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T11:44:41.000Z",
          "Titre": "Website hard to navigate",
          "Contenu": "Very very difficult to find replacement accessories on the website, and the app won't let you order more than one part at once, which is very frustrating.Delivery speed of the order was fine, and getting free shipping is appreciated.Having replaceable parts that allow me to extend the life of my machine is very appreciated, I just wish the website wasn't so awful to navigate and use!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andrew Braid",
          "Nb_Reviews": 6,
          "Date": "2023-01-10T13:35:45.000Z",
          "Titre": "I want to throw it out of the window most days",
          "Contenu": "Good if you want the same room cleaned over and over and the rest of the floor ignored. Drives me up the wall. It cleans well where it goes but the random nature of its movement means it might go into the same area literally 10+ times and it runs out of battery before it even gets into other rooms. I'm going to have to get rid of it as it's not fit for purpose and makes me physically angry every day. Hate it."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "John Mclaren",
          "Nb_Reviews": 6,
          "Date": "2023-10-30T12:03:45.000Z",
          "Titre": "no after service",
          "Contenu": "no after service still waiting on a delivery to be made no email t say it is delayed still waiting on referal awards after 1 week of buying"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "terry yeomans",
          "Nb_Reviews": 3,
          "Date": "2023-03-31T11:55:31.000Z",
          "Titre": "14 months lifespan of the eufyCam solo",
          "Contenu": "Purchased a eufyCam solo at the end of 2021, worked really well until last month, but buyer beware, it appears to have the same life span as a pet gerbil. Didn't expect to have to throw the unit away after 14 months use. Very disappointed with eufy's response to the reported failure, it had worked well until then. Looking for something to replace it that won't be landfill just out of warranty."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mick",
          "Nb_Reviews": 7,
          "Date": "2023-10-29T12:19:11.000Z",
          "Titre": "Nightmare.We have had these cameras installed a…",
          "Contenu": "We have had these cameras installed a couple of years now, but they have made it impossible to add another phone to it, their app is impossible to understand and categorically refuses to allow me to join. Absolutely not to be recommended to anybody."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andrew L",
          "Nb_Reviews": 9,
          "Date": "2023-10-11T01:20:22.000Z",
          "Titre": "All was well when I first set up the…",
          "Contenu": "All was well when I first set up the system ( Homebase2 with door bell and one camera ).Then it got a bit temperamental, freezing up and not playing alerts.I added 2 more cameras... Oh dear!Seems the base unit cannot cope. I get alerts, go to watch them and only see something that happened 2 days ago!Not happy as I suspect only cure is to buy an upgraded Homebase."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Rachel Doughty",
          "Nb_Reviews": 13,
          "Date": "2023-09-18T19:34:36.000Z",
          "Titre": "Eufy 2k doorbell - the battery works for a year",
          "Contenu": "I bought a rechargeable doorbell - Video Doorbell 2K. The operation of the doorbell was ok, but I did have to recharge it many times over the year. I bought it in May 2022 and I haven't been able to recharge it in August 2023. It will not hold a charge. It has a warranty of a year and given the environmental considerations it is not possible to swap out the battery. I like that there is no contract - that us why I bought it, but if I knew it was going to have such a short life costing over £200. I don't think I would have bought it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T23:56:15.000Z",
          "Titre": "bad customer service",
          "Contenu": "They have probably the worst customer service I have ever experienced. I was asking live chat a question regarding security and they kept giving me copy and paste, unhelpful responses. Please beware when buying this brand. There may be security flaws that customer service cannot help you fix or answer."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Peter Schwab",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T12:21:15.000Z",
          "Titre": "Side Rotors keep running",
          "Contenu": "The Accu has been delivered promptly. Now after installing I discovered that the Rotors don't stop when Eufi is in the station. I have to switch it of manually. Therefor I'm frustrated because I choose the original space part which is more expensive."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "James Foster",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T08:38:24.000Z",
          "Titre": "New orders prioritised over existing orders",
          "Contenu": "Product was out of stock when ordered, which was fine. Product then became available to buy on Amazon a month before item was actually dispatched. I can understand running out of stock, but cannot understand how it is acceptable to prioritise new orders over existing orders that have already been delayed months."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Siscanu Serghei",
          "Nb_Reviews": 8,
          "Date": "2023-08-06T07:36:20.000Z",
          "Titre": "Bought Eufy cam 3 with 2 cameras",
          "Contenu": "Bought Eufy cam 3 with 2 cameras in March 23. System collapsed after less then 5 months, lost all registered data and had to reinstall all system again. Disappointed. I guess a £500 system should be better than that. Also referral is not working with them. After 5 months of waiting and contacted customer service 2 times still received nothing…"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank Spearman",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T23:35:43.000Z",
          "Titre": "Eufy update fried my security system",
          "Contenu": "Eufy just did a major update to its security equipment. It ruined both of my 2K cameras and my base unit. They will not reset anymore. Eufy help line instructed me what to do to reset them to no avail.They admit they are dead. The cameras are 1 year and a month old and the base unit slightly older. They are out or warranty but have worked flawlessly until this major update. For those of you considering a security system do not pick Eufy as their units will die just after the warranty expires. Look to someone else"
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Stephan",
          "Nb_Reviews": 98,
          "Date": "2023-09-25T12:09:42.000Z",
          "Titre": "Overpriced and poor quality security…",
          "Contenu": "Overpriced and poor quality security cameras, they work fine for some time and then their lenses crack and fog up. Just not up for the job, not waterproof as claimed!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jonny Greenwood",
          "Nb_Reviews": 4,
          "Date": "2022-12-20T09:43:09.000Z",
          "Titre": "Item still not received!",
          "Contenu": "I'd love to leave a 5* review, unfortunately it's been 18 days and I still haven't received my order and I've no idea what's going on. Ordered on the 2nd December with 5 day delivery, tracking information has been the same since the 7th (13 days) with no updates."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tsvetozar Kamenov",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T18:53:57.000Z",
          "Titre": "Delivery was delayed with 2 months",
          "Contenu": "Delivery was delayed with 2 months. I was told mid April which than change to end of April and again changed to early May and received my product mid May, I have purchased and paid for the product in early March. Poor communication and inventory.Item has been received now, but the above still stands as to poor service and costumer support.If you would like to contact me please do not hesitate, I don’t see why you asking me to contact your support department this is just proof the point of the poor customer support."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Eva",
          "Nb_Reviews": 6,
          "Date": "2023-04-03T19:32:25.000Z",
          "Titre": "I have the g40 hybrid and it's annoying…",
          "Contenu": "I have the g40 hybrid and it's the most annoying gadget I've ever bought, it's constantly knocking my skirting and kickboard. And I every single time it's on it has an error 64, I've removed and reinserted the waste unit. I've reset it multiple times and it still has the same error."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Kevin Jackson",
          "Nb_Reviews": 4,
          "Date": "2023-03-29T06:08:24.000Z",
          "Titre": "Ordered a S100 wall light camera on the…",
          "Contenu": "Ordered a S100 wall light camera on the 8th it is now the 18th and the order status is still unfulfilled! Update 1 - I received an email saying that the order should be shipped by end of March. Update 2 - I received an email saying that order should be shipped by end of April. I contacted Eufy saying Amazon had the items in stock and got no response, I eventually cancelled the order."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "J Nicholson",
          "Nb_Reviews": 27,
          "Date": "2023-06-05T00:31:49.000Z",
          "Titre": "Wouldn’t buy this a second time",
          "Contenu": "Thought this was a really good system but a few things have changed my mind. The doorbell detects non human things quite often which is annoying, it also picks up animals so you get pointless alerts for cats, foxes etc. the firmware updates often leave the cameras with a white noise feedback which means you have to clear the system and basically reboot and re connect the cameras to the Homebase again. Perhaps one of the most annoying things is that after 2 years the glass camera lens cover on the doorbell just drops out - after googling this I found that lots of people have had the same issue generally after 2 years of ownership - for an external item which purports to be weather proof, it’s not fit for purpose. Avoid."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Highlander",
          "Nb_Reviews": 50,
          "Date": "2023-09-08T11:13:44.000Z",
          "Titre": "Poor quality product with inflated marketing claims and refusal to support",
          "Contenu": "We bought two Eufy IP cameras on the basis of decent video quality, motion detection and battery life - they advertised a year between charges for the last of these. Video quality is decent, and exterior build quality is good, but the rest is far below both billing and reasonable expectation:1. We're in a quiet rural area, with optimal battery life enabled. We get - at best - a month between charges on each camera2. Motion detection is arbitrary - works when it feels like it and sulks the rest of the time.3. Homekit integration is incredibly slow4. Range is shockingly poor - both of our cameras are within 7m of the base station, yet frequently drop out of coverage5. Support is poor: we raised the issue of one of the cameras not taking a charge properly when we'd had them less than two months - Eufy support did not offer a solution. It's now got to the stage where that camera is unusable, but now of course they just say that it's beyond the warranty period, shrug their shoulders and ignore the issue.On the basis of our experience, we will not be buying any more Eufy products and - even if our experience with the actual cameras was atypical, their failure to support their product is probably universal. Definitely not recommended."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "COLIN",
          "Nb_Reviews": 9,
          "Date": "2023-03-07T19:03:07.000Z",
          "Titre": "Suggestions were given but none worked…",
          "Contenu": "Suggestions were given but none worked - I have a 2 year old product on which I have replaced the parts stated by service at cost to me and the Robovac still gets hopelessly lost. I guess this is software designed to be obsolete after warranty expires as impacted hardware is brand new."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Halil İbrahim ASLAN",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T08:50:56.000Z",
          "Titre": "I bought eufy cam 2C 16 April 2023",
          "Contenu": "I bought eufy cam 2C 16 April 2023, they say the battery life of the camera is 180 days but untill now i charged 3 times, I talked with costumer service for upgrade solar charger camera but they said you passed our return policy I can understand this but they told me we can give money back %70 I didint accept this offer, now I am waiting fixing my Cam Battery. I will let you know any update."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Giovanni",
          "Nb_Reviews": 13,
          "Date": "2023-02-05T13:57:29.000Z",
          "Titre": "Bad quality assurance",
          "Contenu": "Good for the cameras, but terrible doorbell.I got a set of cameras and a homebase which worked perfectly (in spite of the battery life below advertised values), which then encouraged me to get the doorbell.The doorbell and its base never worked flawlessly for more than a week. The remote keeps disconnecting and the base keeps freezing and not responding to the app. Sometimes a reset will fix it, sometimes it won't, but it never works consistently for more than 5 days.I've been in contact with Eufy support for the last year, and got sent a broken, refurbished replacement, which is now piling up as paperweight at home. Now they keep asking for proof of the faults (and I keep sending), but no actions are taken. Almost deciding to give up and buy a different brand, and keeping Eufy as an expensive paperweight."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Rhi",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T19:49:48.000Z",
          "Titre": "Ordered end of November with a 5-7…",
          "Contenu": "Ordered end of November with a 5-7 working day delivery.  Emailed on the 8th December (after 9 working days) as not arrived to be told it would be shipped mid December even though we weren't told this.  Emailed again on the 22nd December (19 working days) with a reply on the 23rd to be told it would ship in 3 working days which puts it a total of 23 working days without a clue of when it will actually be delivered, if they even stick to this!  Zero updates from them unless we email asking where it is. All in all, so far not a good experience at all.Update: 6th January. Our security system has still not been delivered and the package has apparently been lost. Final update!: After having to prove the package was lost even though we received an automated email from them saying it was. They did in fact send out a new one which was delivered. We also ordered a video doorbell but through Amazon where the delivery was much more reliable. I’ve seen some comments about the battery life of the doorbell but ours has been fantastic so far. All in all the system is good and we are pleased but the delivery ordeal I’m not sure was really worth it. I would suggest ordering through Amazon."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "MM",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T06:23:08.000Z",
          "Titre": "L70 without any SW Updates to improve…",
          "Contenu": "L70 without any SW Updates to improve performance. Accu not durable compaired to competitors, at least replacement worked quick.Overall It seems that Eufy's focus is directed on producing many different products in a very short timeframe, but support of existing products and product quality are lacking."
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Anthony King",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T19:22:57.000Z",
          "Titre": "Disappointed",
          "Contenu": "Unfortunately our home security system did not arrive after full payment. It has proved extremely difficult and frustrating to deal with you to resolve this issue. Is it an eufy or Evri (delivery company) issue? An answer from either side would be appreciated to finally resolve things"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Kevin Mccarthy",
          "Nb_Reviews": 3,
          "Date": "2023-10-10T09:24:27.000Z",
          "Titre": "Cameras work great during the day does…",
          "Contenu": "Cameras work great during the day does not work at night. Picks up now and again and you’re lucky if you can see a shadow poor quality product"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Strobes",
          "Nb_Reviews": 28,
          "Date": "2023-02-23T12:58:31.000Z",
          "Titre": "Great product line let down by delivery ....",
          "Contenu": "I was so pleased with the cameras and doorbell that I decided to order a Homebase 3 upgrade for 3-5 days delivery. A week later I contacted Eufy to query the non-delivery and was advised \"shipping is estimated to be around early March due to the high demand ....\" Not impressed with delivery and communications otherwise I would have given another 2 or 3 stars. Shame!"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Annoyed customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T09:32:26.000Z",
          "Titre": "Bad Service!",
          "Contenu": "Bad Service!It took five calls to get the requested help. Our doorbell had the same failure again. A new one bought at AND delivered with Amazon could have been delivered in one day. Eufy said they deliver with Amazon, but it will last 5 weeks with their replacement. With every mail and call it got less. And that’s what I call bad service. Why did they not ensure a short delivery time directly? In each mail and call I had to repeat, that I could have a new doorbell within two days, if I buy it at Amazon."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Pat M",
          "Nb_Reviews": 10,
          "Date": "2023-02-02T14:13:13.000Z",
          "Titre": "I'm disappointed with my eufy robo vac…",
          "Contenu": "I'm disappointed with my eufy robo vac G20.It took 5 days to arrive. It was difficult to connect to it via the app.It seems to clean the same area over and over again and ignore some easily accessible areas. It gets stuck under the sofa so I can't leave it unattended without moving a lot of furniture to block access. It doesn't always follow the pattern it is supposed to of going up and down the room, it spins round and seems confused. It loses power when left switched on on the charger. The brushes look as if they would need replacing frequently.  And the dog doesn't like it. I am sorry I bought it. It might be suutable for a house with small rooms, not much furniture and no pets."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Richard Helmut Knobloch",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:14:46.000Z",
          "Titre": "No more FTP transfer to my NAS",
          "Contenu": "No more FTP transfer to my NAS. With the previous cams, Eufy Pan Tilt in 2022, FTP transfer was still possible. Perhaps I switch to Reolink. Thx"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "BART D",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T08:17:44.000Z",
          "Titre": "4K quality is not that great",
          "Contenu": "4K quality is not that great.  Have a problem to recognize persons en often mix team up. Battery last under for weeks . Not many function in the menu"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "kerso",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T22:23:10.000Z",
          "Titre": "make it possible to display more than 1…",
          "Contenu": "make it possible to display more than 1 cam at the same time. all of them should always and persistent be visible in the app or the web or a dedicated device."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "MR G SCOTTN",
          "Nb_Reviews": 9,
          "Date": "2023-10-17T21:05:23.000Z",
          "Titre": "Doorbell camera failed after one year…",
          "Contenu": "Doorbell camera failed after one year £91 for a new by one.   Help desk of little help     Disappointed"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Mathew Wainwright",
          "Nb_Reviews": 6,
          "Date": "2023-05-13T14:37:55.000Z",
          "Titre": "Faulty EufyCam2Pro camera",
          "Contenu": "Purchased the EufyCam2Pro camera bundle and initially very pleased with the product. Then 1.5 years later one of the cameras becomes defective. Attempted all the suggested troubleshooting ideas, but the device wouldn’t switch on at all. Completely dead. Approached Eufy to seek replacement but told as outside 12 month warranty by 5-6 months, they couldn’t do anything for me. I had paid for the more expensive product to reduce recharge amounts. The camera had only been charged twice from new. Kept getting rebuffed by Eufy for a repair or replacement camera and escalated complaint explaining rights under Consumer Rights Act 2015, that products require to last a reasonable amount of time regardless of warranty. Eufy admitted the product was defective and hadn’t lasted a reasonable time, however still wouldn’t repair or replace the camera as out of warranty. After many emails Eufy finally offered a 30% off voucher for me to purchase a new add-on camera. Overall I’ve been very disappointed in Eufy’s customer service regarding their defective product, and they have blankly rejected consumer rights legislation. Products are only good as long as they don’t break or fail. The company on the other hand have left a very poor experience."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Luca",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:33:18.000Z",
          "Titre": "delivery time and return",
          "Contenu": "Unfortunately long delivery time and no free returns"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ashfaq Sharif",
          "Nb_Reviews": 9,
          "Date": "2022-12-25T14:54:30.000Z",
          "Titre": "Not for high traffic area. Poor battery life",
          "Contenu": "Ok for backgarden but the one on the road side I have to charge every 2 weeks. If you planning to install somewhere in high traffic area then avoid it as it will be waste of money."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Monika Scullion",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T21:46:00.000Z",
          "Titre": "Replacement battery not available",
          "Contenu": "Ordered a replacement battery and it was put of stock. Was promised a 5 percent discount towards another purchase, never received it."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Trinny",
          "Nb_Reviews": 9,
          "Date": "2023-06-22T23:34:49.000Z",
          "Titre": "The whole buying process is awful",
          "Contenu": "The whole buying process is awful. Make sure you read all descriptions fully. Don’t be fooled like me. What started out as a £129 purchase cost me over £215 to get up and running. Con artists the whole company."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "DILIPKUMAR",
          "Nb_Reviews": 4,
          "Date": "2023-06-19T12:26:43.000Z",
          "Titre": "You do not include packing slip with…",
          "Contenu": "You do not include packing slip with parcel. So its difficult to get redirect address, email id, or telephone contact number."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Marco",
          "Nb_Reviews": 4,
          "Date": "2023-02-22T22:29:53.000Z",
          "Titre": "The package has not arrived after 7…",
          "Contenu": "The package has not arrived after 7 days. It was sent again after request. Not arrived until today.  Hope that it arrives tomorrow! In this day and age, such delivery times are no longer good!"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Thorsten",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T18:24:21.000Z",
          "Titre": "features / measures missing fpo GDPR",
          "Contenu": "There are some features / measures missing to comply with the GDPR, so the cameras are not usable in Germany / EU for very many purposes if you want to comply with the law."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "John Collins",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:25:29.000Z",
          "Titre": "Answer phone calls quicker."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Srood Maruf",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T00:02:49.000Z",
          "Titre": "The item was sent to me with out…",
          "Contenu": "The item was sent to me with out battery and  asked me to send it back myself  they will replace it after one month"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "MB",
          "Nb_Reviews": 10,
          "Date": "2023-06-22T16:46:06.000Z",
          "Titre": "Eufy Video Doorbell won't recharge...No full refund",
          "Contenu": "I purchased the Eufy Video doorbell over other known brands considering they provide local video storage.  Initial installation went through Ok without major issues. However the battery of the video doorbell went dried within 3 months.  When I put the doorbell on recharge, the battery won't charge at all.  I tried multiple troubleshooting guidelines but without any success.  I contacted the customer support a couple of times during this period.  They asked me to perform a few steps.  However later on I was told that they will need to replace the doorbell as nothing was working.  They offered me either a replacement or a 70% refund of the original cost.  I requested for a full refund which was declined as my purchase was just over 90 days before the equipment failed to work.  Obviously this was a manufacturing defect, and I had purchased this product only a couple months ago I asked for a full refund which the agent said they will try.  I returned the equipment in its original condition as per instructions by Eufy.  However after a couple of days of returning the product I was informed that they will be unable to provide me with full refund and only 70% amount will be returned.   This is particularly annoying after their initial commitment on 15/06 that I will be provided with a FULL REFUND once I returned the parcel.  I am very unhappy with this service as I would have expected Eufy to give me a full refund considering its a mfg defect.  I am left with a bit of disappointment due to this experience."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "IHBG",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T23:49:24.000Z",
          "Titre": "It does not work in conjunction with my…",
          "Contenu": "It does not work in conjunction with my home system"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Victoria Shaup",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T18:34:18.000Z",
          "Titre": "I have bought 3 eufy robo vacs",
          "Contenu": "I have bought 3 eufy robo vacs -  the first lasted for a about a year.  I really liked it but didn’t expect it break after only a year .  For the 2nd I was told that I needed to replace the side motors. They made me purchase them and replaced the old ones- the vacuum won’t even turn on now .    The 3rd one only holds a charge for about 20 minutes .  I am done with this company ."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 11,
          "Date": "2022-11-22T14:33:35.000Z",
          "Titre": "Lack features for the price",
          "Contenu": "Camera are ok but lack a number of basic features for the premium price that they cost.  Wouldn't recommend them, your better buying something else for a lot cheaper with better features."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "FA",
          "Nb_Reviews": 5,
          "Date": "2023-08-04T08:24:23.000Z",
          "Titre": "I purchased a charger in June it is now…",
          "Contenu": "I purchased a charger in June it is now not working I always use Anker for my chargers but this one gave up the ghost very quick"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 7,
          "Date": "2023-08-20T18:18:24.000Z",
          "Titre": "the camera gives a good picture but the…",
          "Contenu": "the camera gives a good picture but the voice has a very long delay, this ringtone makes no sense"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Michaela Keilhofer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T10:42:20.000Z",
          "Titre": "I can’t finde the Installation Code"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vmce Ygjki",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T09:20:49.000Z",
          "Titre": "Power of power bank down too fast",
          "Contenu": "It's only been 3 months since I bought Anker's power bank, and I obviously feel that I can't charge it for such a long time."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 8,
          "Date": "2023-08-15T00:03:56.000Z",
          "Titre": "Customer service is not great",
          "Contenu": "Customer service is not great! Would not buy again. iRobot products and service much better. You get what you pay for!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Charles Knight",
          "Nb_Reviews": 6,
          "Date": "2023-09-23T12:54:24.000Z",
          "Titre": "very difficult to actualy get a…",
          "Contenu": "very difficult to actualy get a response to emails I wanted to return my doorbell cam under the 30 day free return as it would not cover the area I needed so after a while I was eventually sent a returns label as requested that done now I am still waiting for my refund"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Greg",
          "Nb_Reviews": 6,
          "Date": "2023-06-02T14:13:36.000Z",
          "Titre": "Eufy Floodlight Camera 2K fails to perform as advertised!",
          "Contenu": "Eufy say the Floodlight Camera 2K is “built to withstand freezing cold winters” but if the temperature falls below -20c (-4f) the camera will activate constantly and fill up your storage with useless recordings. So this product is not much use in most parts of Canada and some colder US states.Eufy say the Floodlight Camera 2K has “powerful built-in AI” but it can’t distinguish the difference between a real moving object and shadows caused by sunlight - this causes near-constant alerts, which also fills up your storage with useless recordings (even when set to the lowest sensitivity). So not much use if you have trees on your property and it’s a sunny day with a light wind.I reached out to Eufy to express my disappointment and this is what they suggested…Eufy say: Set the detection type to “Human Only” instead of “All Motion”Problem this creates is that we are no longer alerted to vehicles entering our property, or bears rummaging through our bins, or other wildlife that could pose a danger I.e. wolves/coyotes. Also, it doesn’t always identify a human as a human, which is troubling. It also does not fix the problem.Eufy say: change the defined “Activity Zone”This would largely defeat the intended purpose of buying the Floodlight Camera 2K.I tried submitting a review of my experience on the Eufy website (twice) but neither were published. There are currently 71 reviews for this product and curiously every review is rated 5 stars, my review was less than 5 stars and I suspect dark forces are preventing you from hearing about the experience of real life customers. I asked Eufy why it was that my review was not published and this is what their customer support manager said… “For the review, you could check if you have set the filter to 5 stars only, change it to all review will be ok, we would not have any operation on that” Clear as mud right?In summary then… for a premium $300 Floodlight Camera it fails to deliver on the most important features and the customer support provided to date has been underwhelming. I would recommend that you avoid this product until they refine the firmware or consider other options."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Hariharan Gunasekar",
          "Nb_Reviews": 2,
          "Date": "2022-12-16T19:19:34.000Z",
          "Titre": "The service was poor",
          "Contenu": "The service was poor. The delivery was handled badly. I had to call after 2 weeks for them to acknowledge my order and send it."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 3,
          "Date": "2023-05-30T08:36:08.000Z",
          "Titre": "Very good product for now",
          "Contenu": "Both the wall cameras seem to be really good at the moment but the customer service is absolutely rubbish."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "GLEN",
          "Nb_Reviews": 79,
          "Date": "2023-02-06T19:21:48.000Z",
          "Titre": "Misleading support / possible misrepresentation.",
          "Contenu": "Honebasex2 and Homebase 3 purchase.  Be cautious and check functioning and suitability of need.Not happy with the erroneous support received.Have Homebase 2 camera system installed.  Works well, though the inability of Eufy to allow easy backups of data is unacceptable.  You have to slowly from the App download each and every picture.  Poor and delibetate.  Their promise to allow bulk backup NOT honoured.Like a fool I  have just  bought a Homebase 3 unit, fitted SSD to allow IN THEORY years of footage to be stored.  I question everything at the moment, so contacted customer care.Customer support today advised that irrespective of what I did ALL recordings are deleted after 30 days....and \"sorry that our technology does not meet your needs\".  What a farce.  Misinformation and misselling concerns officially raised.The agent could not explain HOW data is automatically deleted from an unconnected Homebase 2 when NOT connected to the Internet.  I was just going to store and leave Homebase 2 with it's data.  With Homebase 3, stated same.  ALL date after 30 days will be deleted off the SSD.    How?  Why?  I sent this email and voice recordings.  Will update as I progress.  I believe the agent did not know what he was talking about.   If he is correct, then Eufy will have major issues to contend with.Email content sent today:HelloTotally unacceptable response following my call to your customer helpline today.Your agent specifically told me that on Homebase 2 that ALL RECORDINGS will be deleted AFTER 30 fay's irrespective of the SSD space availability.    Additionally I explained that it WOULD NOT BE CONNECTED, just retained should I meed to access recorded data.  He advised that after 30 days ALL DATA would be deleted.This cannot be the case.On HOMEBASE 3 I was advised that even though I have a hard drive fitted, that AFTER 30 days, data would be deleted automatically.  This must be incorrect.I understand that on both systems, that once the SDD OR HD is full, then the EARLIEST recordings will ne deleted....but NOT ALL just because it is the 30th day I have tried to reason with your agent, but he says I am wrong and SORRY the technology does not meet my needs.Please investigate and provide written documentation of technical details to support.  I am concerned your marketing information misrepresents.  Your agent says one cannot SAVE years of data if required.I am reserving my right to return Homebase 3 on the basis of misselling, UNLESS your agent is as I expect providing erroneous advice."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Adrian B.",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T22:21:46.000Z",
          "Titre": "Bad WiFi connection",
          "Contenu": "Unfortunately, the WiFi connection keeps getting interrupted, even though the camera is only installed 5 m away from the router..."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T18:29:07.000Z",
          "Titre": "I ordered the wrong product and the…",
          "Contenu": "I ordered the wrong product and the return policy is unnecessarily convoluted and deliberately difficult, which is surprising since I could have ordered the same unit from amazon and the return would have been simple."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andrew Markham",
          "Nb_Reviews": 20,
          "Date": "2022-12-11T15:27:42.000Z",
          "Titre": "OK Products - Warranty & Aftercare Stink!",
          "Contenu": "I had 4 cameras and bought a wireless doorbell specifically to work with Alexa as we have 5 echo's and wanted to use them to ring all throughout the house. I bought the unit in June but didn't install/use until Oct, as had new door fitted and did the doorbell at the same time. This worked for 9 months and then stopped! I do not know exactly when, now only homebase rings (and isn't heard throughout the house). Having spent months trying to get some sense out of Cust Support even to get them to understand what the problem was (simple Alexa doesn't ring any more!). After months of explaining and re-explaining (and escalation) I talked to a specific support manager. Who tried to understand the problem - SIMPLE ALEXA DOESN'T RING! He finally told me (about 5 months after I first raised a ticket) that there had been a bug introduced by EUFY that stopped the homebase talking to Alexa, and it may/not ever be fixed. As soon as he knew I had bought the unit over 12 months ago. He simply stated tough! So I paid well over £120 for a doorbell that worked for 9 months - and EUUFY don't give a monkeys!Thanks a lot"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Torsten Neumann",
          "Nb_Reviews": 4,
          "Date": "2023-06-14T07:28:06.000Z",
          "Titre": "FloodCam - HomeBase Support",
          "Contenu": "Subject: Complaint Regarding Delayed Support for FloodCam on Homebase3 and Homebase2Dear [Customer Service],I hope this message finds you well. I am writing to express my dissatisfaction and disappointment with the delayed support for the FloodCam feature on both the Homebase3 and Homebase2 devices I have purchased.In early February, I made the decision to purchase a Homebase3 based on the information provided that it would support the FloodCam feature by the end of March. However, to my dismay, the release date was continuously pushed back, leaving me waiting for this promised functionality. Now, I am eagerly hoping that the FloodCam support will indeed be available by the end of August, as initially announced.To provide some context, I encountered a similar situation with the Homebase2 in the past. I was informed by your support team that the FloodCam support was expected to be implemented by the end of 2022. Unfortunately, this support never materialized, leaving me without the features I had been eagerly anticipating.As a customer, it is disheartening to experience these repeated delays and unfulfilled promises. I invested in these products based on the assurances provided by your company, and it is frustrating to see these commitments not being met. This situation has caused inconvenience and has led me to question the reliability of your product development and release schedules.I kindly request that you provide me with an update on the status of the FloodCam support for both the Homebase3 and Homebase2 devices. Additionally, I would appreciate a transparent explanation as to why these features have been consistently delayed or not delivered as promised.Moreover, I would like to express my hope that this situation will be resolved promptly and that the announced support for the FloodCam on the Homebase3 by the end of August will be honored. It is crucial for customers like myself to have confidence in the products we purchase and the reliability of the information provided by your company.Thank you for your attention to this matter. I look forward to your response and a satisfactory resolution.Yours sincerely,T. Neumann"
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "David Floss",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T10:54:29.000Z",
          "Titre": "No knowledge about own products",
          "Contenu": "No knowledge about own products. Ask for adapters for switzerland and didnt know"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 8,
          "Date": "2023-06-23T16:23:28.000Z",
          "Titre": "Unpredictable",
          "Contenu": "Tried everything it picks up motions when it feels like it. Sometimes none then bang bang bang everything and anything"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "John edkins",
          "Nb_Reviews": 2,
          "Date": "2023-01-31T08:07:41.000Z",
          "Titre": "My cameras are just not working well at…",
          "Contenu": "My cameras are just not working well at all no happy!!!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Matt Day",
          "Nb_Reviews": 2,
          "Date": "2022-10-13T13:51:43.000Z",
          "Titre": "Eufy 2K Doorbell good, customer support is no good. Can't recommend",
          "Contenu": "Product was a 2K Doorbell which was fine up until a just over a year of use it stopped recording sound and then after removing from Homebase it refused to re-join. It is now a 140+ pound door stop. Support refused to do anything even after citing consumers rights under UK law. Wouldn't recommend this company as they do not want to help consumers beyond the basic limited warranty. Even with proof of faulty product."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "David H",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T09:50:44.000Z",
          "Titre": "Poor communication"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "namtab",
          "Nb_Reviews": 11,
          "Date": "2023-08-30T19:49:21.000Z",
          "Titre": "Buying s220 streight forut…",
          "Contenu": "Buying s220 streight forward but product not that great , poor performance unreliable detection wouldn't recommend 👎👎👎"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason Rives",
          "Nb_Reviews": 3,
          "Date": "2022-09-30T15:58:55.000Z",
          "Titre": "Eufy's downward spiral in support",
          "Contenu": "I have always used Eufy, even after their security breech which someone moved remotely one of my indoor cameras.  They just released new homebase 3 and their customer support is just plain terrible.  I received an early bird discount code that was invalid, called support which the woman hung up on me, then received a new discount code that is also invalid, and still no one is answering their phone lines.  Eufy has gone downhill compared to what they use to be."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Christoph Schlag",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T15:59:25.000Z",
          "Titre": "S300 4 cam kit not received after 7 weeks after order",
          "Contenu": "I ordered on May 22th a S300 4 cam kit, but I have not received it yet!"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Nobby",
          "Nb_Reviews": 10,
          "Date": "2022-10-25T23:18:23.000Z",
          "Titre": "Eufy Cam 2C- good picture, very poor AI",
          "Contenu": "Eufy Cam 2C- good picture quality and night vision, but AI/Human detection doesn't work!Also the 2way talk is very poor- sound quality is rubbish.Eufy support were no help."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T20:09:20.000Z",
          "Titre": "The system is so slow to pick up alerts…",
          "Contenu": "The system is so slow to pick up alerts and send to the phone and watch"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "sipukka",
          "Nb_Reviews": 12,
          "Date": "2022-06-16T20:55:19.000Z",
          "Titre": "Useless product.",
          "Contenu": "Look, i try to be honest. The eufy 2k doorbell is useless. I have 600mbps broadband and very fast WiFi  and even with my nose against the doorbell it gives NO ALERTS. Now, i will say the helpline is good,  comprehensive and thorough,  but I may as well had my p3n1s hanging out to detect intruders  it would have probably been better. Would I recommend? Would I 5h1te!!!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "CD",
          "Nb_Reviews": 12,
          "Date": "2022-06-16T11:12:00.000Z",
          "Titre": "Bad product longevity",
          "Contenu": "I got a eufy cam 2 set and after 13 months the charging dock is acting up. I had another set before where one of the cameras started fogging up. There is a reason why eufy is only offering 12 months warranty. The are built to last around 12 months and can then be thrown in the trash. Designed to be obsolete."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Jenkins",
          "Nb_Reviews": 3,
          "Date": "2022-07-17T14:18:48.000Z",
          "Titre": "Returns are a huge hassle",
          "Contenu": "The products are okay. Security flaws make them highly susceptible to tempering without any notifications given, especially the cameras. Do not purchase anything from eufy directly as returning products to Germany is time-consuming and expensive. Just use Amazon."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Michel",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T11:08:05.000Z",
          "Titre": "Delivery took pretty long",
          "Contenu": "Delivery took pretty long. Without notification."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "michael bird",
          "Nb_Reviews": 29,
          "Date": "2022-01-21T15:34:12.000Z",
          "Titre": "Poor quality product",
          "Contenu": "Purchased eufy cameras and door bell 10 months  ago it all worked reasonably well apart from the battery life on the door bell is poor 3 months if you are lucky the home base alarm is useless as an alarm box  not loud enough . The home base as now pact up I have reported this to eufy under the warranty but I am still waiting for a replacement . I WIULD NOT RECOMEND EUFY TO ANY ONE ."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dainius",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T02:55:21.000Z",
          "Titre": "Would be better if battery could be…",
          "Contenu": "Would be better if battery could be replaceable, and respond time very slow compare to other company's. Only good think it has local storage, so don't need to pay subscription."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Customer",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T01:25:00.000Z",
          "Titre": "It is good for pet hair, but…",
          "Contenu": "It is good for pet hair, but the navigation system could be improved. Other brands have more features to avoid that the robot gets stuck."
        },
        {
          "Note": 3,
          "Lieu": "MV",
          "Pseudo": "Brian Glover",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T10:32:02.000Z",
          "Titre": "Alert not working properly",
          "Contenu": "The response from someone pressing the door bell and it alerting my phone takes to long and more often doesn't alert my phone at all even though I have a good Internet connection, and when it does alert my phone the alert on the top of my phone only stays for a couple of seconds ,please help."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "ramen mauree",
          "Nb_Reviews": 7,
          "Date": "2023-12-13T23:24:36.000Z",
          "Titre": "A great Product overall with few improvement needed",
          "Contenu": "A great Product overall, works rather spontaneously and very clear during the day. Good Value in terms of Price.Just a few things I noted that could improve, the night vision is slightly blurry and when its rain, its rather useless. I couldn't even get a hood for it on the website.finally, the camera would not catch number plate and at night, number plate would shine bright which makes it impossible to read any number plates."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Vicki Barrett",
          "Nb_Reviews": 9,
          "Date": "2023-12-08T23:55:56.000Z",
          "Titre": "Robot cleaners are bril, cameta would not connect",
          "Contenu": "Robot cleaners are bril. Outdoor camera would not connect to wifi. Never had this and have scores of devices from them and different suppliers. This is SO basic. Support gave me all the usual rubbish 'advice' like reset the router andcreinstall the device. When its their software which just doesnt work. Er no.  Returning the product."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nick",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T19:12:52.000Z",
          "Titre": "The wall light is simple to install but…",
          "Contenu": "The wall light is simple to install but doesn't have a facility to run power supply through the side of the housing. I would benefit from having a separate mounting bracket (pattress) for power cable, to maintain IP rating."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 9,
          "Date": "2023-12-19T20:54:21.000Z",
          "Titre": "I have got used to the existing app and…",
          "Contenu": "I have got used to the existing app and find it easy to control my heating system"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Cornrace View guy",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T23:32:31.000Z",
          "Titre": "Change your delivery company",
          "Contenu": "The vacuum does what it meant to do... clean so far there are no obstructions, it took almost 2 weeks to get my delivery and that's because you guys are using the cheapest delivery company who are known for not delivering or getting your parcels lost. Your CSO wasn't helpful too. What is the point of giving me an option to contact Eufy if there is nothing that can be done?"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Cip L",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T23:27:59.000Z",
          "Titre": "Good but not good enough",
          "Contenu": "The system is easy to install and use. The entry sensors works very well. Regarding the security cameras, not so well. Missing a lot of movement, specially in the night. The image is not the best for a 4k camera in my opinion, specially when you zoom in. Overall, they system is pretty good, with instant notifications, and the fact that you don’t need to pay a subscription fee is a bonus , but the security cameras need to be improved regarding the motion detection."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Tom Jackson",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T21:33:06.000Z",
          "Titre": "Decent equipment with no subscriptions",
          "Contenu": "Decent equipment with no subscriptions. Doorbell isn't great quality. Also software needs some changes like timer and geofencing mode together."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "MacD",
          "Nb_Reviews": 5,
          "Date": "2023-12-11T21:48:38.000Z",
          "Titre": "Good App, better products, awesome support, except …",
          "Contenu": "Recently I bought the eufy SmartTrack to replace my AirTag in my wallet.It was easy to set up: With eupy and with apple. And it works as it should.But the battery can not be replaced. Ok it’s supposed to run up to two years. But after that? Trash! Hazardous waste!That is how eufy wants to help to save the planet?I rated 3 Stars because of the rest being very good but please replace that product by something more sustainable."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "MRS DEIRDRE MCKEE",
          "Nb_Reviews": 8,
          "Date": "2023-12-11T22:00:00.000Z",
          "Titre": "Hi I had to purchase  new wireless …",
          "Contenu": "Hi I had to purchase  new wireless  plug for my doorbell  but when I got it up  and running  I lost all my videos  that was on it and I can't retrieve  them is there anything  I can do I have tried everything"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "George",
          "Nb_Reviews": 20,
          "Date": "2023-12-15T21:03:59.000Z",
          "Titre": "Customer service slow",
          "Contenu": "Customer service after purchase was slow and information from them was incorrect.  Item ordered eventually came and was fitted quickly and easily."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Marian Condurache",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T10:13:54.000Z",
          "Titre": "The app connection setup to the robot…",
          "Contenu": "The app connection setup to the robot is really bad after 5 times and numerous errors it worked 1 time."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David Sexton",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:44:24.000Z",
          "Titre": "Good, but no local control or security.",
          "Contenu": "Picture quality and features are good.MASSIVE disappointment that the local storage and no running costs did not mean that there is a local interface. Everything must run through the cloud service, rendering the implied security of local storage worthless and will mean that the device will be useless when eufy decide to stop supporting it on their cloud service."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Nishanth Reddy Musirika",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T11:29:40.000Z",
          "Titre": "Slow Shipping",
          "Contenu": "I felt that the shipping was slow. It is not very easy to cancel your order."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Werner Büttner",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:48:34.000Z",
          "Titre": "S340 cam have only 5 mtr",
          "Contenu": "S340 cam have only 5 mtr, detection area not the expected 11 mtr"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dennis Foreman",
          "Nb_Reviews": 7,
          "Date": "2023-11-24T14:12:54.000Z",
          "Titre": "UK support team fail",
          "Contenu": "I contacted your UK support team recently as I had concern that the battery on my doorbell could be faulty and didn't appear to be charging. I was told that the problem would be passed on to the tech team and I would receive an E mail within 2 hours. Never happened. The charging issue has been solved, but, monitoring the rapid discharge."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Manfred",
          "Nb_Reviews": 4,
          "Date": "2023-11-23T23:43:57.000Z",
          "Titre": "The purchase of a motion sensor has…",
          "Contenu": "The purchase of a motion sensor has been to replace a camera which died right after warranty. Eufy did decline anything else than a discount if 20%. Definitely not a way to attract customers to enlarge the installed base, more the first step to wind down the installation."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "gillian smith",
          "Nb_Reviews": 4,
          "Date": "2023-11-21T23:33:01.000Z",
          "Titre": "It doesn't clean my very low cut rug…",
          "Contenu": "It doesn't clean my very low cut rug even on turbo/ max . I even put it on spot clean but it doesn't pick up.   I have made sure it is empty and the filter is clear. It is also a bit ' wandery ' despite supposedly following a grid pattern, one day it decided it would only clean on the diagonal I put sent it ' home ' twice but it was determined.  The plus side is that it cleans under low furniture much further back than an ordinary vacuum."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "CollectPlus Customer Brian",
          "Nb_Reviews": 8,
          "Date": "2023-12-06T21:27:00.000Z",
          "Titre": "Delivery nightmare",
          "Contenu": "Having had these products before I have no problems with the products. This order has been a nightmare with parcel being delivered to the wrong address the couriers have accepted responsibility but getting eufy to replace the item is still ongoing .so contacting customer services has been a major issue."
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Gordon Miller",
          "Nb_Reviews": 11,
          "Date": "2023-11-09T23:41:50.000Z",
          "Titre": "Image quality is not great",
          "Contenu": "Image quality is not great. Images from moving vehicles is very blurry. Events are not automatically recorded on the base hard drive. Events must be archived onto the hard drive or are lost. The system is very expensive and add-ons such as the video doorbell are offered with another base unit, these should be offered at a discounted price with the chime to users that have already purchased the base unit and camera system."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ken",
          "Nb_Reviews": 23,
          "Date": "2023-12-19T16:59:30.000Z",
          "Titre": "No instructions fpr complex IT",
          "Contenu": "Instructions for installing camera were fine. But, no instructions on complex operational IT."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Martin hiscock",
          "Nb_Reviews": 7,
          "Date": "2023-11-23T10:38:09.000Z",
          "Titre": "Our battery suddenly came up with a…",
          "Contenu": "Our battery suddenly came up with a code 5 error. Before that it was absolutely fine. I phone customer support and funny enough it was one month out of warranty. I’m guessing there’s a chip in the battery so you have to buy one after a year. I’ve checked the voltage and it’s fine, it just won’t work in the hover"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Sven  Maier",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T22:09:14.000Z",
          "Titre": "The Camera is good, no warm light at all",
          "Contenu": "The light is easy to install, the Camera works very well, however the light does really not provide warm light. The white light is still cold light according to my understanding."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-10-20T08:39:52.000Z",
          "Titre": "Unsafe delivery methods",
          "Contenu": "Haven't yet used the product so this rating is purely for delivery method. The items (worth just under £500) were left outside my door in a communal space where it was easily accessible to the whole building. When people are paying this company chunks of money at a time, they should really invest in a safer delivery method. This has definitely soured my experience and makes me question a re-order."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Barry Wheeler",
          "Nb_Reviews": 6,
          "Date": "2023-10-07T09:04:57.000Z",
          "Titre": "Networking issues",
          "Contenu": "Set up was easy at home but had troubles with connection issues outside of my home network, it's not really made clear that lots of other networks will block you from being able to access the system. Just something to be aware of. Probably not an issue if you always use mobile data."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "John Green",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T21:21:32.000Z",
          "Titre": "I have a number of Eufy cameras and…",
          "Contenu": "I have a number of Eufy cameras and unfortunately have experienced similar issues with 'Fogging' and being unable to extinguish the spot light which has resulted in battery drain.After attempting to raise this issue with Eufy, I politely received no response (draw your own conclusions).They recently promoted Gift Cards, however when the appointed time arrived for the chance to buy, when I clicked on the card I was seeking, the process of purchasing started and then froze. After a while the process restarted and I was duly informed they had sold out. It seems like a con to me to get you on there site, but the best deal was either not available or saved for their own kind.I would advise you based on my own experience to shop around as there are other manufacturers who offer similar products but with undoubtedly better customer service. it's a pity as they have the potential to do things a whole lot better!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Kevin",
          "Nb_Reviews": 32,
          "Date": "2023-10-26T23:04:29.000Z",
          "Titre": "Slow delivery.",
          "Contenu": "I'm surprised by how slow it takes to deliver a product, in this age of internet shopping.  I've been waiting over 2 weeks now for a camera and still no sign of it even being despatched."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T23:49:48.000Z",
          "Titre": "Cameras are okay, quality is poor, retrieving video is very slow",
          "Contenu": "Cameras are okay. I spent more money on 4k camera. But the quality of video is poor. Retrieving videos from homebase is not working properly, need to try multiple times to see at the event. It's frustrating to watch what happened in the event."
        },
        {
          "Note": 3,
          "Lieu": "JE",
          "Pseudo": "Diane Porritt",
          "Nb_Reviews": 13,
          "Date": "2023-11-14T14:57:06.000Z",
          "Titre": "I find the hand held EUFY does not pick…",
          "Contenu": "I find the hand held EUFY does not pick up hairs from linoleum nor from the sofa which has a hard wearing twill material."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "CustomerMr Wessell",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T22:23:18.000Z",
          "Titre": "Long term, maybe not the best…",
          "Contenu": "Always thought they were good products, and they were for a while. Very disappointing to see the security equipment I purchased from them, start to fail in just 18 months."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Darren",
          "Nb_Reviews": 23,
          "Date": "2023-08-22T17:03:48.000Z",
          "Titre": "S120 solar light…",
          "Contenu": "Bought the new s120 solar light camera..does not integrate with homebase 3 so no ai integration although the add is misleading saying it has ai but it does not. Also since adding this my devices the homebase has also stopped recognising people and alexa notifications have stopped despite.me.rebooting everything and even removing the new light."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Daniel Steinke",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T09:07:25.000Z",
          "Titre": "Improving settings!",
          "Contenu": "Hello, you can switch to German, but it is still close in different settings levels! Different information about voltage supply is provided with the Doorbell Dual (12 V or 24 V). My bell does not work with 12V as it is in the description! Greetings DSAs here in the survey, you can't fill it out in German!"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Jan",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T22:30:37.000Z",
          "Titre": "Security products are ok",
          "Contenu": "Security products are ok, but the description and find compatibility is low. For me the webside is very bad, low information. Shipping took unexpected long time, not days but weeks.Many sales options could save money."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Allen Armstrong",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T12:03:35.000Z",
          "Titre": "My previous eufy packed in after only…",
          "Contenu": "My previous eufy packed in after only 14 months - just beyond the 12 month warranty which is hard to swallow (built-in obsolescence).  This after purchasing replacement battery - turns out it must have been a motherboard failure.   i swore not to use the produce again tho happy enough when working.  Since I was offered a significant discount on a  new purchase, I relented"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Oliver Berthold",
          "Nb_Reviews": 5,
          "Date": "2023-08-21T22:24:24.000Z",
          "Titre": "Eufy is promising HomeKit, but it never comes",
          "Contenu": "I really love the way the first setup with the Eufy-App is working - but I bought the 4K Cams, because Eufy is telling future buyers, that they work on the HomeKit-Support. After buying the product, I feel cheated, because they tell this now for more than a year - and they never delivered. Now in some marketing materials, this promise vanished - No Home-Kit-Support"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T11:16:32.000Z",
          "Titre": "Check your orders before confirming",
          "Contenu": "Product and app works well however the aftercare is something to be desired. Firstly the ‘value add’ of free brushes and filters doesn’t match my robovac which get lost in the post. Secondly, I spoke to a person with very broken English on Eufy call line and they can’t send me the filters that fit my robovac as replacements, only the ones that don’t fit. Check you orders - even the free gifts."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nigel Lofthouse",
          "Nb_Reviews": 25,
          "Date": "2023-08-22T11:29:07.000Z",
          "Titre": "Lack of external storage",
          "Contenu": "I bought the T8200 mains doorbell and was disappointed by the lack of off device storage. They sell the hub but only when you go digging you find that it's not compatible. It connects exactly the same as the battery powered version to the network so why can you not use external storage?"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Max Harris",
          "Nb_Reviews": 35,
          "Date": "2023-06-14T11:04:20.000Z",
          "Titre": "This is my third doorbell camera from eufy",
          "Contenu": "This is my third doorbell camera from eufy, replacing the second one which died without warning (and eufy refused to do anything about). The plus side is that these cameras are quite good when they work. Impossible to speak with someone at the door due to latency, but at least captures events from a security perspective. For this specific purchase, delivery was horribly slow - about 4 days, when other companies manage reliable next day delivery time after time.Anyway, let's see how long this one lasts. Incidentally, the first one is now around 2 years old and apart from the lens glass randomly falling out and needing super glueing back in, is still going strong and performing OK.Famous last words!!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dr Syed Shumon",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T22:26:57.000Z",
          "Titre": "The X8 cleans well but the battery lets it down.",
          "Contenu": "The X8 looks good and cleans carpet and hard floor well. However the battery lasted an hour and cleaned 57 sqM (stated time is 180mins) before the X8 had to return to base to charge. It takes 4-6 hours to fully charge. So can’t get even clean a full floor a day. Spoke to customer service who said it was a faulty battery and would send a replacement out. I had to contact them again after 2 weeks as still hadn’t received the battery. Finally have new battery but not tested it yet.Secondly the clean room function is not great. The X8 consistently states cannot get to location when there are no obstacles.In summary, cleans well but the battery lets it down. Clean room function could be better."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jackie Moir",
          "Nb_Reviews": 10,
          "Date": "2023-09-15T19:08:19.000Z",
          "Titre": "I don’t aspects of this item",
          "Contenu": "I don’t like the fact that every time I go out of my back door I get pinged on my phone. I didn’t appreciate this was going to happen. Also I don’t get a notification if someone rings my doorbell so - basically it’s not working as I expected."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Alison",
          "Nb_Reviews": 6,
          "Date": "2023-07-20T13:24:55.000Z",
          "Titre": "It’s ok overall",
          "Contenu": "Delivery was quite slow. Easy enough to set up. Looks quite stylish and the camera is good quality. The main issue I have is the terrible battery life of the product. Eufy claims the wireless doorbell (220) battery lasts upto 6 months but mine has been up for 2 weeks exactly and the battery is on 40% so It’ll need charging nearly monthly which isn’t upto expectations."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nneka Akwaeze",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T17:23:19.000Z",
          "Titre": "Lack of customer service and help to…",
          "Contenu": "Lack of customer service and help to install products. Also lack of appreciation of your customers' time: Your voicemail gave a different time to the times you actually answer phones. So customers like me were wasting their time calling you when you were not available.Lack of understanding / alignment with business expectations in the uk: customer services are open 9-5 roughly. You have decided to open at the crack of dawn and close at 1pm. Just ridiculous.So on the whole, Eufy's attitude towards their UK customers shows it does not care about them. Your customers have to fit into your schedule, not you into theirs. Who is paying whom? This is not good business practice.Once we find a similar product, we will jump ship."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andy T",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T09:15:30.000Z",
          "Titre": "Great quality but 2 shortfalls",
          "Contenu": "Great quality but 2 shortfalls. The base has to connect by ethernet to your router and then each camera has to connect to the base. If you have a 200 year old house and your router is at one end, it's almost impossible to mount a camera covering ghe other end. The signal can't get through the distance and the walls. Plus there is no booster available. So being able to connect 16 cameras is great but if you have a house big enough to need 16 cameras, ots too big for the signal to reach.Second, the camera quality is excellent, but the pir only triggers for close movement. So being able to see the boundary clearly is one thing, but an intruder can hop over and wander around without triggering a camera. More range on the pir please."
        },
        {
          "Note": 3,
          "Lieu": "MN",
          "Pseudo": ". user",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T18:31:59.000Z",
          "Titre": "The product is super and I am really…",
          "Contenu": "The product is super and I am really happy with it.Support team is unfortunately not proffessional. Its covered with friendly emails and words but it doesnt help you with your problem, rather says „you are dumb“ just politely"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "neil",
          "Nb_Reviews": 12,
          "Date": "2023-06-16T06:22:07.000Z",
          "Titre": "I really like the bell BUT!!!!!",
          "Contenu": "I really like the bell, it’s simplicity of set up and the quality of picture but the battery life is nowhere near what is advertised. Our bell averages about 10 activations a day , is sited within 3 foot of the router and our Homebase but despite this, if I am lucky it gets two weeks use before needing charging"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Bryan Davies",
          "Nb_Reviews": 15,
          "Date": "2023-08-16T09:04:04.000Z",
          "Titre": "Customer Services were very good but I…",
          "Contenu": "Customer Services were very good but I just could not get the S40 to work - all three of them despite getting a charging plug recommended by Eufy. Thought the S40 was potentially a great product but not if it does not work."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jon Langley",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T10:49:36.000Z",
          "Titre": "Just hope you don't need to change your e-mail address",
          "Contenu": "The actual products are good and effective, however having had a home system in place for the last couple of years I needed to change my e-mail address on the account. Try the help section and Eufy is more concerned about which product would you like to buy.Call the helpline and guess what, for a tech company they don't have the capability to change an e-mail address either online or via customer services. The only solution is to remove all of the devices from the original account, create a new account and start all over again. That's progress for you ...."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Patrick Blender",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T07:38:24.000Z",
          "Titre": "Good cleaning but...",
          "Contenu": "Good cleaning but......the robot sturggles with dog hair. Also it is a bit loud and because the route of cleaning is sometimes a bit confused, the cleaning it's self takes quite long. At the beginning, i had some issues with the bumper and had invest quite a lot of work in \"repairing\" (guided by eufy) but now it seems to work properly."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T23:55:49.000Z",
          "Titre": "Helpful and speedy support",
          "Contenu": "Helpful and speedy support, but my experience with 3 Robovacs so far, is that something tends to break in or around a year to 18 months. I use downstairs generally where we have wooden/tiled/hemp floors, so they don’t work hard on thick pile carpet. My newest issue was just a new wheel assembly c.£15, but I’ve got an old vax upright that was half the price that I’ve had for ten years without issue."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "DAVID SELBY",
          "Nb_Reviews": 3,
          "Date": "2023-08-23T21:12:32.000Z",
          "Titre": "Selling Electrical Items without any means to power it !@",
          "Contenu": "Be aware that Eufy do not supply a Power Supply with their Homebase, which only works on Electric.What company does that other than to fleece their Customers."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Gary Burge",
          "Nb_Reviews": 4,
          "Date": "2023-06-04T23:04:09.000Z",
          "Titre": "Cam pro 2 & homebase 2.",
          "Contenu": "Cam pro 2 & homebase 2.small capacity 16gb local storage card supplied is insufficient. All past 3 security incidents occured while we were at home, so we know from experience the system must be on at all times. Camera s/ware settings very misleading for inexperienced.Otherwise cams are clear and work as described, with only recoding humans which decreases overall recordings on small capacity card."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Deborah Codd",
          "Nb_Reviews": 16,
          "Date": "2023-03-09T18:08:27.000Z",
          "Titre": "Good product. Needs better guidance on use of the camera.",
          "Contenu": "I found it very difficult to get the settings right. After contacting the company they offered various suggestions and on the whole were helpful.There seems to be lots of information on how to install the camera but unfortunately it doesn’t give information for the set up and how to get the settings right.Perhaps they should include some guidance with regard to this, especially for people who don’t have great technology experience.I would, however, still recommend their products."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr Malcolm Oliver",
          "Nb_Reviews": 8,
          "Date": "2023-05-31T11:31:16.000Z",
          "Titre": "s200 limitations",
          "Contenu": "We purchased the S200 video doorbell only to find that the chime wasn't audible throughout our home exacerbated by the fact that the chime seemed to have limited range from doorbell to work despite being Wi-Fi connected.  Attempt to purchase additional add-on Chime fell foul of fact that, at that time, the description didn't say clearly that it wasn't compatible with the S200 so it had to be returned at our expense.  Not ideal for a not cheap product but if we had known detail we probably would have chosen an upgraded version with multiple chimes."
        },
        {
          "Note": 3,
          "Lieu": "MN",
          "Pseudo": ". user",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T18:50:12.000Z",
          "Titre": "The product is good BUT!",
          "Contenu": "The product is good. It does what it supposed to do. But really bad experience with the Customer Service and Delivery. First of all the delivery got delayed because it was SUDDENLY not in stock, even though it said it is in stock as I bought it. Then it has got delayed like 2 Months. It is ok, well sometimes things got like complicated. But I contacted the customer service just in a case to know what is going on. The Customer Service responded with an really friendly email with tons of frienfly words just to say, “I the Customer, an idiot who cannot read a sentence“. My problem was, why the product is not getting delivered, even though it said „one week“ as I purchased it. The Customer Service sent me a Screenshot what „now“ under the product description on the website says, which is „this product is currently not available“ (its not the exact sentence). And so many other things just to show me how dumb I am. Such an A*hole Customer Service I have never experienced!!!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ray Osborne",
          "Nb_Reviews": 3,
          "Date": "2023-03-13T22:45:19.000Z",
          "Titre": "Eufy good, camera doorbell not good",
          "Contenu": "I rated 3 stars because the service was very good but the product I bought was poor.The service was excellent, prompt delivery, telephone help line was good.The product, a camera doorbell, is very disappointing, performance is poor, notifications are several minutes late, review the history and some dont load. I wish we had never have bought it. We bought from Eufy because we have a robotic vacuum cleaner that is brilliant, unfortunately the same cannot be said about the doorbell."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen James",
          "Nb_Reviews": 3,
          "Date": "2023-02-16T11:47:12.000Z",
          "Titre": "I have multiple exterior cameras",
          "Contenu": "I have multiple exterior cameras, and 2 doorbells. All are wired. My wifi is performing well. The brand is declining in performance.  I wouldn't buy again, and now expect to find I have wasted a few thousand dollars on cameras that I will have to replace because Eufy technology seems to be tanking."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Stuart  Ladbrooke",
          "Nb_Reviews": 9,
          "Date": "2023-10-24T21:36:50.000Z",
          "Titre": "Works great but battery only lasts…",
          "Contenu": "Works great but battery only lasts around two years which cannot be replaced so have to buy a new unit"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Andreas M.",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T15:27:58.000Z",
          "Titre": "After exactly 2 years the battery was…",
          "Contenu": "After exactly 2 years the battery was down. Support team offered me a 15% discount for a new battery, fine, but a battery should work longer than 2 years. Out of warranty with my L70hybrid.The device resets the map each time and dies not keep it saved. No updates since several months...."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "les James",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T18:18:14.000Z",
          "Titre": "Great system only thing letting it down…",
          "Contenu": "Great system only thing letting it down is in away mode alarm sounds immediately movement is detected even though alarm delays are set"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Stephen FoK",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T07:42:22.000Z",
          "Titre": "5 star company great customer service…",
          "Contenu": "5 star company great customer service but let down by the courier they use. The item was sent to an address few miles away. The delivery GPS tracking proves this."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David Baglietto",
          "Nb_Reviews": 8,
          "Date": "2023-06-19T22:30:12.000Z",
          "Titre": "Great CCTV and alarm",
          "Contenu": "Great products with great 2k picture quality on CCTV (6 cameras) and great alarm with let detection that really works. However have experienced very poor customer service and very long delivery times."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "S Russell",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T08:22:50.000Z",
          "Titre": "Cleans well",
          "Contenu": "Cleans well,  however when starting from the app it comes out and then returns to charging port without cleaning the room.   Very frustrating."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ashley",
          "Nb_Reviews": 3,
          "Date": "2023-06-18T23:40:22.000Z",
          "Titre": "The door bell and camera work fine",
          "Contenu": "The door bell and camera work fine, however the battery doesn't last anyway near what was stated in your information, it only last 2weeks which is a real pain"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andrew Diggins",
          "Nb_Reviews": 15,
          "Date": "2023-10-24T23:37:25.000Z",
          "Titre": "Products are OK but currently don’t…",
          "Contenu": "Products are OK but currently don’t quite do what there say on tin….image is good but the AI is not quite there as get lot of fails triggers"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Robert Thompson",
          "Nb_Reviews": 4,
          "Date": "2023-08-11T16:11:52.000Z",
          "Titre": "Eufy C24 & S220 Security Cameras",
          "Contenu": "Ordered 1/7/23 Saturday via Eufy UK Web Page 5 items, 4 x C24s & 1 x S220 cameras the C24s arrived 4/7/23 Tuesday with Amazon the S220 on 6/7/23 with EVRi. C24's in a paper A4 envelope (not padded type, just as well not out in any rain) and their own boxes not surrounded by any protective packaging in their boxes or included in the papers envelope. I thought this strange as rattling around wouldn't be the safest for their longevity I thought. The S220 was at least in a padded envelope but again no protective packing included. The buying process was standard and payment along with updates on progress occurred. Overall pleased just wait and see if the cameras stand up after the shipping process.Update 11/8/23 The camera have been working perfectly  with picture quality of streaming, captured events and notifications really excellent. Was on holiday for a week and felt content leaving the house unattended as had been broken into some years back. I have recommend to others with a brother in law purchasing a number of C24s (hadn't seen the loyalty scheme but never mind) and he has similar praise as much better than an outdoor system he had professionally installed 5 years ago. Really happy and would use Eufy by Anker products again!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Keith",
          "Nb_Reviews": 6,
          "Date": "2023-08-02T09:55:28.000Z",
          "Titre": "On the whole doorbell is ok",
          "Contenu": "On the whole doorbell is ok. The alerts let it down just a few not very good short tones I keep missing them. At moment getting a lot of false alerts through the night (17 last night) trying to get it sorted but as to yet no luck. Easy to install and get working but as above not yet set up."
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "Eric Lawrenz",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T10:44:53.000Z",
          "Titre": "Cool Vacuum Roboter but also a few negative Aspekts",
          "Contenu": "I have purchased the Robovac X8 hybrid using a discount. Therefore the price/performance ratio was quite good. The Robovac X8 hybrid works well as vacuum cleaner with hard floor. The creation of the map via App was also easy and the room cleaning function or spot cleaning and scheduled cleanings are perfect. But we experienced also a lot of negative aspects. The navigation has sometimes a problem with our doorstep between kitchen and floor. We‘ve got the same doorstep to all our rooms, but somehow the combination of the doorstep and a corner leads to confusion for the Robovac. Then he gives out an error, that he is blocked. After pressing play a few times (and a few errors) he then manages to get out of the doorway and continues cleaning. Unfortunately the mob function is quite useless, since the mob drys out and only two spots (where the water comes out of the water tank) are further mobbed. This leaves stripes on the floor. Therefore we no longer use the mob.Further, after a week one wheel broke. The support has then send us a spare part, which I installed. Since the first wheel did last only one week, I am curious to see how long the replacement will last."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Can kaya",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T20:47:47.000Z",
          "Titre": "- costumer Support is not good.",
          "Contenu": "- costumer Support is not good.- not fair solution- cam quality is good- outdoor cams cant use with base or intern storage, only with storagecard"
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Matija Ceh",
          "Nb_Reviews": 3,
          "Date": "2023-07-27T21:14:17.000Z",
          "Titre": "The cameras are fine",
          "Contenu": "The cameras are fine, but if you order something wrong, you have to pay for the package yourself to return it.  That's not right at all"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Adrian T",
          "Nb_Reviews": 5,
          "Date": "2023-02-21T18:36:27.000Z",
          "Titre": "OK for what it cost",
          "Contenu": "Wasn't too easy to set up.  Works quite well but doesn't seem to catch all visitors and it's sometimes difficult to get my phone to find the camera or events stored on the chime.  Also only seems to work if the phone is switched on.  Maybe this is the phone's fault?"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2023-06-06T19:28:22.000Z",
          "Titre": "The wall mounts aren't adjustable…",
          "Contenu": "The wall mounts aren't adjustable enough the cameras are too heavy. Too many features that are in the app that take a while to find, not that intuitive."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Scuba",
          "Nb_Reviews": 34,
          "Date": "2023-02-28T09:41:55.000Z",
          "Titre": "Experienced damaged units twice which…",
          "Contenu": "Experienced damaged units twice which is not good these have been exchanged after alot of phone calls Don't think I will ever use eufy again ."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Rich Ting",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T20:33:36.000Z",
          "Titre": "The response speed is so so",
          "Contenu": "The response speed is good, but knowledge and support are not very helpful. I didn't receive the any suggestion when I asked about the product choices"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Canute Donald",
          "Nb_Reviews": 18,
          "Date": "2023-10-06T19:33:57.000Z",
          "Titre": "So far so good still getting used to…",
          "Contenu": "So far so good still getting used to the product could do with a few more features to make it perfect for my liking. but just ok so far."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andrejs",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T22:05:53.000Z",
          "Titre": "Bad customer service",
          "Contenu": "Video quality is good,but motion detector was bad I didn’t like it.customer service was rude and unprofessional."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Keith",
          "Nb_Reviews": 3,
          "Date": "2023-06-26T11:55:45.000Z",
          "Titre": "Great products let down by the Customer Service",
          "Contenu": "The Eufy security camera kit really is top notch. I switched to it from the Blink System as I wanted something that was TRULY subscription free AND function-rich. All of the products I have tick these boxes and feel quality; I have no complaints about how well they work.So, why only three stars then? The last few months have been plagued with a saga getting hold of the S100 light. When I ordered in March, delivery was scheduled for ‘end of March’, which was perfectly ok. This then slipped to the end of April. To early May. To end of May. To early June. Throughout this period I spoke to a variety of customer service agents who were either unable to help or simply seemed disinterested. A ‘Stock issue due to high demand’ was quoted as the reason for the delays. Given the ‘stock issue and high demand’, you can probably imagine my surprise when in early May I, waiting for my existing order, was presented with the S100 being sold on Eufy's Amazon store with next day delivery available. I again raised this with customer service and I was told ‘it’s a different warehouse’ - which coming from the main supplier felt like a poor excuse. No further assistance, or recompense for the ever-extending delay, offered.On the 1st of June my S100 finally arrived, six days after stock suddenly reappeared on the Eufy site with a £30 off price reduction, which having paid the original amount and been made to wait months, somewhat grated. Again, a lovely product. But come on Eufy… don’t add insult to injury to existing customers you have kept waiting for months! It lets your products down and earns you poor reviews."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Suzanne Lyse",
          "Nb_Reviews": 10,
          "Date": "2023-11-29T13:51:44.000Z",
          "Titre": "It’s hugely complicated to set up."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Rocchi",
          "Nb_Reviews": 3,
          "Date": "2023-07-06T21:14:01.000Z",
          "Titre": "The spare wheel assembly arrived…",
          "Contenu": "The spare wheel assembly arrived quickly and repaired the broken down floor cleaner. It's a shame that wheel motor broke down after 15 months of use."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jerry Malcolm",
          "Nb_Reviews": 4,
          "Date": "2023-02-02T18:31:19.000Z",
          "Titre": "H30 hand held vac",
          "Contenu": "I really like the product it works very well. my disappointment is i cannot buy the accessories because they have been out of stock for over a month.. It would be nice to know when the tools will be available in the UK."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Sebastian",
          "Nb_Reviews": 4,
          "Date": "2023-09-26T21:09:45.000Z",
          "Titre": "Home base wifi range",
          "Contenu": "Like: easy installationDislike: wifi from home box really poor in range."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Christian Rausch",
          "Nb_Reviews": 21,
          "Date": "2023-07-19T17:57:13.000Z",
          "Titre": "Good camera",
          "Contenu": "Good camera, but only 2 black areas. The black areas cant place diagonal and with only two of them its not possible to hide enough."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Alan Waltho",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T15:48:32.000Z",
          "Titre": "Seems slow",
          "Contenu": "Seems slow to get to see screen when detection alerted or door bell rings"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mitch",
          "Nb_Reviews": 3,
          "Date": "2023-05-16T04:51:01.000Z",
          "Titre": "Delivery time.was.rediculous..",
          "Contenu": "Delivery time.was.rediculous... next timendont get people to buy before yiu actually have the stock"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Daniela  Hartmann",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T19:12:46.000Z",
          "Titre": "It worked very well and I likes it…",
          "Contenu": "It worked very well and I likes it ....but VERY soon it did not wok at all. I bought a new Akku...still didn't work. And I did not use it very often.... I have a good vacuum cleaner.... so I am disappointed at least."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Josh",
          "Nb_Reviews": 4,
          "Date": "2023-05-25T17:34:14.000Z",
          "Titre": "Sometimes it works really well but…",
          "Contenu": "Sometimes it works really well but other times i come home and it doesn’t even pick up the fact I’m standing in front of it. Could be better"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Agata Lisowska",
          "Nb_Reviews": 6,
          "Date": "2023-02-27T22:05:27.000Z",
          "Titre": "Filters didn't fit",
          "Contenu": "Well.I bought a set of spare filters and brushes. Brushes were good for my robót cleaner but filters didn't fit at all. I am sure i checked twice model of my vaccum. Not sure what goes wrong"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "William",
          "Nb_Reviews": 4,
          "Date": "2023-06-01T10:23:16.000Z",
          "Titre": "Not all events are noted/recorded",
          "Contenu": "Not all events are noted/recorded, and there's significant time elapses quite often between the device being triggered and notifications on the receiving device"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Tobias",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T18:30:46.000Z",
          "Titre": "Not bad, but...",
          "Contenu": "Activation Area doesn't work for Light - just for Camera.The Eufy Security App doesn't support Huawei Devices."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andrew Mawson",
          "Nb_Reviews": 11,
          "Date": "2023-09-12T11:05:25.000Z",
          "Titre": "Delivery took for ever and I had to…",
          "Contenu": "Delivery took for ever and I had to chase for updates so not so good."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mrs J Lovegrove",
          "Nb_Reviews": 7,
          "Date": "2023-08-07T20:46:16.000Z",
          "Titre": "I like the clean but it cant find its…",
          "Contenu": "I like the clean but it cant find its way home from the dining room and it's only a small house"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mrs Marzieh Zamani",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T16:57:31.000Z",
          "Titre": "eyfy vacuum cleaner doesn't have a good…",
          "Contenu": "eyfy vacuum cleaner doesn't have a good suction like the other vacum cleaners."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "r k toomey",
          "Nb_Reviews": 6,
          "Date": "2023-10-04T07:52:18.000Z",
          "Titre": "Notifications often come long after…",
          "Contenu": "Notifications often come long after someone has gone"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Marc",
          "Nb_Reviews": 3,
          "Date": "2023-06-03T10:24:42.000Z",
          "Titre": "Connect all Camera with home base and…",
          "Contenu": "Connect all Camera with home base and google nest hub doesn`t work really"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Chelsea",
          "Nb_Reviews": 12,
          "Date": "2022-12-13T17:05:12.000Z",
          "Titre": "Good service, product could be better",
          "Contenu": "Good service for delivery times and clear and easy set up. A little disappointed with the product."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Rosily",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T22:49:39.000Z",
          "Titre": "Good purchase",
          "Contenu": "Good purchase. It is doing a good job even though he gets stuck in the corner."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Wayne Orwin",
          "Nb_Reviews": 5,
          "Date": "2023-11-17T19:13:00.000Z",
          "Titre": "Took too long to decide to help me"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "DAVE MORRISON",
          "Nb_Reviews": 11,
          "Date": "2023-08-21T21:10:54.000Z",
          "Titre": "System works well",
          "Contenu": "System works well,  but not easy to set-up and use on the app"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nikhil Chopra",
          "Nb_Reviews": 10,
          "Date": "2021-12-13T19:54:49.000Z",
          "Titre": "Great innovative product but lacks 2 basic items",
          "Contenu": "Great innovative product, bought the floodlight pro and cameras and the sensors. Very easy to install and get it up and running.Missings:-An external visible alarm unit.-vibration sensors for doors/windows-low audible internal alarm- not sure how to manage mobile notifications of alarm going offI hope the first two are added quickly as they are quite necessary for a deterant."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "NotHappyWLMG",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T09:08:08.000Z",
          "Titre": "Joy in simplicity",
          "Contenu": "All products I’ve had from anker/eufy have been brilliant. They’ve been straight forward to understand, purchase, setup and use.I like that to a large extent your packaging is minimal, and sustainable, with even many of the plastic bags being compostable.Whenever I have had issues, or queries, your support team has always been helpful, proactive and with good communication.I appreciate it can lead to compromise, but as a smart home enthusiast, I would like to see more integrations opened up for smart home users."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "chris newbold",
          "Nb_Reviews": 29,
          "Date": "2023-12-15T00:53:34.000Z",
          "Titre": "Hardware good, software needs refining",
          "Contenu": "The robot appears to be decent quality so far, and the navigation works well, meaning the clean time is not long. I do think the app needs tidying up - hence losing a star. The issue is that it is not consistent, as navigation progresses from clicking multiple places and icons, some that you discover by accident.  This results in a bit of trial and error, but in the end is not a deal breaker. However support is quick, friendly and helpful if you do get stuck."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Stephen",
          "Nb_Reviews": 18,
          "Date": "2023-12-13T09:41:08.000Z",
          "Titre": "Eufy security cameras",
          "Contenu": "Door bell camera lag is a bit long. Catches postman walking away.Also only b/w at night.Good clear 2k picture.Solar cameras excellent 4k picture and colour day and night ."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kent",
          "Nb_Reviews": 15,
          "Date": "2023-12-07T12:44:55.000Z",
          "Titre": "Apart from ordering cancellations, everything else went well",
          "Contenu": "Taken off a star as when I was ordering products on Black Friday deals, a number of my orders were cancelled afterwards with Eufy sighting website security as the reason. So I continued my ordering on Amazon. Amazon delivered the items quicker than those ordered from Eufy direct. I am pleased with all the products received, all installed and working without issue. Pleased with my purchases."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mike Harries",
          "Nb_Reviews": 8,
          "Date": "2023-12-11T09:08:45.000Z",
          "Titre": "Robovac",
          "Contenu": "Faultless customer service that dealt with an issue I had on ordering. Vacuum itself is pretty good. Not as good as a proper vacuum, but didn’t expect it to be, but for what we want it for it’s great."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Atanas Christev",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T23:03:45.000Z",
          "Titre": "Overall pretty good but could be better",
          "Contenu": "Overall pretty good (after the X8 Hybrid I bought an X8 Pro SES), but some things are annoying.Firstly, the mapping. You cannot add a room (or, for that matter, delete one), you have to re-do the entire floor for this. Then, when mapping, the software registers areas which are not part of the room, e.g. space the other side of a glass patio door. Of course the robot is not going there but the map looks silly. It should be pobbible to delete areas from the map. The self-emptying has been capricious. It thinks there is a blockage and refuses to self-empty. I assume it was becasue after the first cleaning there was indeed a lot of pet hair. Hopefully with self-emptying set after each clean, this will not be a problem, but the testing should have highlighted this and probablu the robot should be sent back to self-empty in the same way as it goes back to re-charge mid-job if necessary. The ability to climb over thresholds could be a lot better. On the X8 Hybrid at least it's poor, it cannot negotiate a 3/4 inch (20mm) threshold in the doorway. On the positive side, multi-mapping is good, connection with the app robust, handles stairs well (anti-drop), and the virtual boundary and no-mop area are useful. The X8 Pro does not have \"no-mop\", so one hopes it's clever enough to not mop carpets..."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Adrian Forbes",
          "Nb_Reviews": 13,
          "Date": "2023-12-15T22:20:42.000Z",
          "Titre": "Speedy Eufy",
          "Contenu": "Quick delivery which is good once your order has been placed it's out the door following day."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "BennoKollmann",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T09:52:05.000Z",
          "Titre": "IT does what ist expected.",
          "Contenu": "IT does what ist expected.Some error messages are poping up without any meaning.Installation brackets are Not fulfilling all needs."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Stephen Gittins",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T21:22:25.000Z",
          "Titre": "It took a little while longer than…",
          "Contenu": "It took a little while longer than suggested to set it up. An instruction book might be useful although it is on the website. Overall , very happy!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Pete Myring",
          "Nb_Reviews": 12,
          "Date": "2023-12-06T10:07:25.000Z",
          "Titre": "Eufy S330 CCTV System",
          "Contenu": "Comprising:- EufyCam 3 cameras- Homebase 3- E340 Video doorbellThis is a fantastic product that is so easy to set up and configure. The solar panels keep the camera charged, even on my north-facing wall in the UK in December. The wifi connection is solid and makes the cameras easy to install. I would give it 5 stars, but for a few omissions:1) E340 Wireless doorbell - you can't configure a smartphone to open up automatically when the door bell is rung (I'm told this might be solved in the future)2) You cannot connect non-Eufy cameras to the system, so I cannot connect my nestbox cameras.3) E340 wireless doorbell - the angle of the lower camera (for watching the doorstep) is fixed, so it can miss part of the doorstep.But, all-in-all it looks like the best on the market."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "parjeshwar sood",
          "Nb_Reviews": 4,
          "Date": "2023-12-03T21:29:27.000Z",
          "Titre": "Good product but few updates required",
          "Contenu": "The product is good but few improvements required.1) after detection the video starts a bit late. If i increase the sensitivity then it starts picking neighbours. 2) Include geofencing into schedule option. This will make a good addition to system and it will make the system use hassle free."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Williams",
          "Nb_Reviews": 6,
          "Date": "2023-12-14T10:13:09.000Z",
          "Titre": "Ding dong!",
          "Contenu": "A good system let down by the doorbell ring. Our modem is upstairs so can't be heard in our lounge. We can sometimes hear a ring on our mobile phone but it's hit and miss."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Glenn Lloyd",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T18:29:36.000Z",
          "Titre": "Overall very pleased with the products…",
          "Contenu": "Overall very pleased with the products and the features of the items I have bought.Some slight problems with the app/settings that needed figuring out though.So far I have won/earnt 3 discount codes but none of them have worked with a future possible purchase!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Roger Lui",
          "Nb_Reviews": 8,
          "Date": "2023-12-02T22:39:34.000Z",
          "Titre": "Good video doorbell",
          "Contenu": "There is not much difference in use from the previous two generations. Of course, it is good to have an extra lens. I replaced this latest generation because the lens of the previous two generations of doorbells had moisture in it when the temperature was below zero, and every time there was a temperature difference or rain. There is moisture in the rear lens. This latest generation has just experienced the temperature of minus 2 degrees and there is no moisture for the time being. I hope it can be used for a longer time because the price is relatively high."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Richard Crofton",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T00:36:46.000Z",
          "Titre": "Treat their returning customers properly",
          "Contenu": "Their AI bot gave me wrong information about a camera’s compatibility with Homebase2 during the sales process. Eufy put this right quickly by offering me a full refund or a 32GB microSD card to achieve similar functionality. Poor chatbot but fantastic products and great aftersales service (props to Shane). I will use Eufy again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:55:35.000Z",
          "Titre": "No yearly contract",
          "Contenu": "Simple to fit, longer battery life and better playback pictures and no yearly contract."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "S Smith",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T15:35:35.000Z",
          "Titre": "I had to unfortunately send my x9 pro…",
          "Contenu": "I had to unfortunately send my x9 pro back the product is amazing but for us the mops dragged on our carpets as we have very thick carpets this was our only issue and for the price we wanted to be fully satisfied. The customer service were very supportive and after returning a full refund was given."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kyle Flanagan",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T14:26:47.000Z",
          "Titre": "Just a great company with a great…",
          "Contenu": "Just a great company with a great product range, I love evertything I've pruchased to date - from the tile competitor to the earphones by Anker, what a winner company"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Harris",
          "Nb_Reviews": 4,
          "Date": "2023-12-03T07:19:58.000Z",
          "Titre": "A brain teaser",
          "Contenu": "Hi, overall I’m pleased with the cameras I purchased. I did find the set up difficult but think I worked it out by trial and error"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Peter Morley",
          "Nb_Reviews": 12,
          "Date": "2023-12-12T10:13:45.000Z",
          "Titre": "Excellent product poor instructions and information",
          "Contenu": "Excellent product and easy to set up, although the instructions are not good. Also information on compatibility is poor."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "lee thomas",
          "Nb_Reviews": 8,
          "Date": "2023-11-30T00:14:21.000Z",
          "Titre": "No subscription required.",
          "Contenu": "Free to use , no subscription lots of different ways to keep a check on your home or to check on deliveries ."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Nick Rawet",
          "Nb_Reviews": 16,
          "Date": "2023-11-16T13:33:11.000Z",
          "Titre": "It's easy to fit",
          "Contenu": "It's easy to fit. The picture is great quality, even at night it's pretty good. No monthly subscription, part of the reason I bought it. Neighbour has one too. A little slow to respond, but quicker than most others. S/W was a little cranky when trying to connect to my system. Took quite a while to get it going, but very stable once it's up and running."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jon Evans",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T10:18:55.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, delivered fairly quickly"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr miles",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T08:22:11.000Z",
          "Titre": "Wall light cameras",
          "Contenu": "Really good quality product. But still cannot view live feeds from 2 cameras at the same time."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Richard B",
          "Nb_Reviews": 12,
          "Date": "2023-09-15T19:43:16.000Z",
          "Titre": "Good functionality, awkward set up and use.",
          "Contenu": "Good functionality. Querky and confusing website when choosing what to buy. Easy to set up but hardware not designed for easy fitting and removal for charging by older (physically /visually challenged). Good product so far, could be better by thinking of long term user."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Andrew Rosevear",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T21:23:14.000Z",
          "Titre": "Arrived quickly easy to fit",
          "Contenu": "Arrived quickly easy to fit, worked perfectly 👍"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Figo Fago",
          "Nb_Reviews": 4,
          "Date": "2023-09-05T09:44:39.000Z",
          "Titre": "Good security system,but...",
          "Contenu": "Good security system,very small,compact cameras,easy to install ,but remember, you will need good Wi-Fi outdoor too.The big minus of this system is,not good quality of motion.The captured pictures are too early or too late ,shows back or side of the captured persons ,not the face.Here is space for improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mark",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T21:13:30.000Z",
          "Titre": "I bought my 2c system about a year ago",
          "Contenu": "I bought my 2c system about a year ago. The techs tried and tried but could not get it to work. I was refunded by Eufy. I bought the same system again as follows: Great budget system, no cloud fees, ability to remotely assess events, live view of cameras, set up base directly to camera. Some minor flaws but for what you get it works great! I would suggest getting extended poicy if you can. Eufy support did me no wrong quite pleased as a customer."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sean",
          "Nb_Reviews": 16,
          "Date": "2023-10-23T12:32:48.000Z",
          "Titre": "Great products, easy to set up and use, just one issue regarding anti-theft of external cameras...",
          "Contenu": "Excellent quality products that don't need you to sign up to a monthly cloud service subscription, all stored locally which was a mandatory requirement for me. A good/fair price point and very easy to set up also with a intuitive app, several configuration settings and AI recognition. My only critique at this time (using their cameras for a just a couple of weeks) is that outdoor cameras could easily be stolen, from what I can see, no anti-theft device I can see on Eufy site. That said, I guess any external device can be fairly easily ripped off the wall? A related challenge is if stolen cameras could be sold and re-used and I my understanding is that they could be. This is my reason for 4* instead of 5*."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sean",
          "Nb_Reviews": 7,
          "Date": "2023-10-12T10:18:09.000Z",
          "Titre": "Good survalance system",
          "Contenu": "Deciding exactly what I needed was difficult as the Eufy website is confusing. Setting the equipment up was quick and simple to do. Finding the correct settings can be a bit fiddly , if you want to fine tune your system."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kinki Tang",
          "Nb_Reviews": 10,
          "Date": "2023-09-26T07:03:12.000Z",
          "Titre": "This robovac is a life changer",
          "Contenu": "This robovac is a life changer, very good for busy life however this will need to be mapping / programming properly as it will only vacuum where it is in the map and need to remove everything before mapping the house. It took over a month to be deliverdelivered because it was high demand."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Andrew Miles",
          "Nb_Reviews": 18,
          "Date": "2023-11-20T21:53:14.000Z",
          "Titre": "The cameras all work perfectly",
          "Contenu": "The cameras all work perfectly. The only negative - delivery information.No information provided when the equipment would be delivered. I received a notice on the day of the actual delivery. Other than this pleased with the overall experience."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul London",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T20:54:59.000Z",
          "Titre": "Brilliant value for money",
          "Contenu": "I was torn between Eufy & Ring but I did my research and although they both had great reviews and performed equally well, I decided to go with Eufy because there was no need to subscribe to a monthly subscription. I bought a 128g Micro sd card, which allows me to store and view any past events free of charge. I opted for the 1080 HD option, and although I was concerned about the picture quality, my concerns were unnecessary. The picture quality perfectly adequate."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Mehrdad Roshandel",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T21:40:52.000Z",
          "Titre": "Very friendly and supportive customer…",
          "Contenu": "Very friendly and supportive customer support.I bought doorbell and also some other security cameras ans motion detectors. The doorbell HW was defect. They replaced it still have some issues with the doorbell buttery which is empty within short time but I hope to get the issue solved with help of support team."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Beetlespark",
          "Nb_Reviews": 29,
          "Date": "2023-10-03T21:25:56.000Z",
          "Titre": "Trouble Free Purchase",
          "Contenu": "Great communication from initial order to the item arriving at my house. Well packaged and the price was very competitive. Door Camera was very easy to set up and was in full operation within 20 mins as I replaced it for a single camera version that has the same fixing dimensions to a brick wall. The only interruption was attempting to scan the QR code given on your mobile phone with the door camera. After several attempts to get the distance right it eventually scanned successfully. This was the only slight issue i encountered. All in all, excellent and I am even considering adding another device."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Hariharan Chandrasekaran",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:28:42.000Z",
          "Titre": "The purchase and completion of order…",
          "Contenu": "The purchase and completion of order was fast and transparent."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "M.G.",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T14:35:44.000Z",
          "Titre": "Great Service, Great Product but flaws",
          "Contenu": "Customer Service is great. The products are great. However, I think AI is not yet as sophisticated as it should be. Many false alarms. I also wish there would be a loud siren available to be installed outside the house. The included alarms are not really loud enough to draw attention from neighbors or law enforcers. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Joe Hoskins",
          "Nb_Reviews": 28,
          "Date": "2023-09-15T10:58:08.000Z",
          "Titre": "S220 with solar power…",
          "Contenu": "I purchased my S220 with solar power after talking to some friends who already have them. I did find it a little difficult to set up as I don't think that the instructions are as good as they could be, hence the 4 stars. However, the camera performs very well with good clear images. The offer at the time price wise was exceptional, saving me quite a lot of money. I am glad I have it and may well extend my system to another camera later on."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jerry",
          "Nb_Reviews": 6,
          "Date": "2023-11-24T16:00:45.000Z",
          "Titre": "I have a Eufy door cam for nearly two…",
          "Contenu": "I have a Eufy door cam for nearly two years, it's worked well with no problems, even when I moved house."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Armenag",
          "Nb_Reviews": 11,
          "Date": "2023-08-07T08:39:14.000Z",
          "Titre": "Good product that needs careful placement.",
          "Contenu": "This is a lovely product that present itself as good as the way Apple does their own and does the job. It needs careful placement to receive a decent signal to work.  I would have wanted more sensitivity and flexibility to choose a wider camera range away from the hub, perhaps future models will achieve this."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul James",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T09:30:12.000Z",
          "Titre": "Generally good, a few small issues",
          "Contenu": "The unit doorbell and base station look good and appear well made.  Set up was easy, I do wish you sold an official adapter to power the battery bell as an option as it looks like it is going to need charging much more frequently than expected.  The only real negative is it does not always Register people coming to the door, I am still working it out but if you approach the door quick enough it seems to not activate?"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mudimo Okondo",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T15:37:24.000Z",
          "Titre": "A great range of security products",
          "Contenu": "A great range of quality security products that work well together, and with no subscription requirement! The usage guides could be a little more in-depth, but once you've got through the setup, everything just works."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "nicholas wood",
          "Nb_Reviews": 12,
          "Date": "2023-10-02T21:13:18.000Z",
          "Titre": "The equipment is great",
          "Contenu": "The equipment is great, but the battery door camera/ bell needs a comprehensive user manual. Still not worked out how to get a bell ring without a claxon type very loud alarm."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Paul Lysons",
          "Nb_Reviews": 21,
          "Date": "2023-10-25T21:24:14.000Z",
          "Titre": "Difficulty setting it all up",
          "Contenu": "Difficulty setting it all up, but now seems to be working well, certainly doing what its supposed to do. The solar panel is definitely a great addative"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mack K",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T15:07:27.000Z",
          "Titre": "In my experience great camera few…",
          "Contenu": "In my experience great camera few things to be improved - anti theft system doesn’t work - missing some notifications & movement on my alerts for some strange reason to be sorted urgently--  additional safety key locks on the camera to be placed to easy to remove - camera horizontal view could be larger Good customer service though."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "FritzKunde",
          "Nb_Reviews": 4,
          "Date": "2023-10-04T22:06:15.000Z",
          "Titre": "Spare parts and repair Great is the possibility to repair eufy…",
          "Contenu": "Great is the possibility to repair eufy and to buy the necessary parts. The side brushes of eufy vacuum cleaners seem to be week - I have replaced at least three times the tooth gears of different eufys"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Martin Clayden",
          "Nb_Reviews": 4,
          "Date": "2023-08-01T07:23:04.000Z",
          "Titre": "EufyCam, great product, but...",
          "Contenu": "This is a great product overall (EufyCam 3 and BaseStation 3). Image quality, functionality and the control app in particular are excellent.The app is packed with features and seems quite stable.I'd have given 5 stars, except that the Google Assistant integration does not work - streaming to Google Home is not functional, despite what you may read in the documentation. Eufy say they are working on it, but can give no timescale.Eufy support is also excellent."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kenneth Elliott",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T12:15:23.000Z",
          "Titre": "Easy to fit and get working in our…",
          "Contenu": "Easy to fit and get working in our charity office, small problem to get the camera programmed to not operate during office hours but soon sorted by a person who has installed your system in his house"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Michael Morris",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T22:59:38.000Z",
          "Titre": "Cindy the CSR was great, Eufy the company waskinda disappointing",
          "Contenu": "Cindy was very helpful and did the best she could to assist. I would give her 5 stars and Eufy 3 stars so overall 4. Eufy is a big company and if I am complaining about a product that is JUST beyond the warranty period and it is clear that I am not trying to scam you, then Eufy could replace the device from a purely PR perspective. The cost is not prohibitive to the company but it is everything to the customer and would show how much you stand behind your product. Disappointed in the company as a whole that they would hide behind an exact warranty period."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Bernard Bedford",
          "Nb_Reviews": 5,
          "Date": "2023-09-23T17:38:26.000Z",
          "Titre": "Good picture with solar powered camera",
          "Contenu": "Overall I’m very happy with the Eufy S330 Eufycam setup I purchased recently. The app is generally easy to use for setting up the system, the recordings are reasonable by night and very good by day.They recommend extending the inbuilt memory but it’s a devil of a job finding the link in the software that formats the hard drive you have inserted. A proper manual would be useful. It gets a laborious deleting yesterdays videos, I haven’t found a way of deleting a days supply in one go. Customer service gets you in contact with a chatbot that was no help for my problem but I got a human email the next day. The camera seems a bit slow in picking up people approaching the house, possibly due to a restricted range of movement detection. The postman is halfway to the front door before it picks him up. The AI for people recognition is very hit and miss, recognising me and my wife about half the time. It works better with our pet dog. My iPhone has just bleeped that someone is outside but on checking the camera it’s a pigeon!"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "caroline griffin",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T08:51:27.000Z",
          "Titre": "Communication prompt and useful but the…",
          "Contenu": "Communication prompt and useful but the advisor declined to warn me how technical changing the main motor would be! (Star lost for that) We made it but it’s intricate!!The motor was inexpensive and eufy is super happy with the new power so all’s well that ends well"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "George Hendey",
          "Nb_Reviews": 64,
          "Date": "2023-08-23T18:04:02.000Z",
          "Titre": "Excellent product with superb camera",
          "Contenu": "Excellent product with superb camera. Only let down by lack of instruction for setting visual parameters. Luckily my son had one and could explain how to do it. Now great and the battery is lasting great. First of all it ran out in a few days. Lots of people walking past."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Franz Saller",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T19:24:53.000Z",
          "Titre": "Great robot except for the little…",
          "Contenu": "Great robot except for the little things!I had a problem with the eufy X9 pro on Monday (09/04/2023). So I wrote an email to eufy. The help/email came promptly/today on Tuesday. The service is good. The device is of high quality.However, the following points that make the device perfect are missing!- In the station a dust discharge- low design (1 cm about too high)- a container in the cleaning station with cleaning agent"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Richard H",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T12:04:13.000Z",
          "Titre": "Products and Service are ok to good",
          "Contenu": "Products and Service are ok to good, but the range is too low and there is no easy way to range extend from home base 3 to cameras. And there is no Apple HomeKit support yet nor can the new SoloCam be integrated in Home Base 3 yet. These topics are essential."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Michael Threlfall",
          "Nb_Reviews": 23,
          "Date": "2023-09-05T22:44:22.000Z",
          "Titre": "The camera is a well engineered piece…",
          "Contenu": "The camera is a well engineered piece of equipment. The instructions relatively easy to follow and the installation was straight forwards. Then operation of the camera is also very easy to perform via the Eufy App. This all good news except for: There was, unfortunately, a part missing from the pack, this is the white coloured central screw cap, and I e mailed and also telephoned Eufy’s Customer Services. This was not a good experience and after the exchange of several e mails I have come to the conclusion that it is unlikely the missing part will be replaced. The customer service staff was polite but was not able to action my very simple request - please may I have a central screw cap?"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Mark Tayler",
          "Nb_Reviews": 6,
          "Date": "2023-01-29T22:49:12.000Z",
          "Titre": "Good product",
          "Contenu": "Over all a good video doorbell at a reasonable price, and no recurring fee. Two things to note, on this the wired option there is no installation instructions regarding the wiring,  not in the manual or the app setup guidance. That said you can get pretty good info online.The other issue I have, it doesn’t always detect a person at the door, seems 50-50, but does always when the doorbell is rang, so still does the job."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "SG",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T21:12:38.000Z",
          "Titre": "Really good camera minor flaws",
          "Contenu": "Really good camera. Quality amazing, app and instructions brill.Only tiny drawbacks so far imo is even with face recognition setup it still records myself and sends notification which is pointless. Also the record function is only motion activated and unable to be left on permanent and set to overwrite Daily"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr MORTEL",
          "Nb_Reviews": 51,
          "Date": "2023-02-16T15:14:53.000Z",
          "Titre": "So far so good",
          "Contenu": "Decided to install a home security system, and wanted to avoid ongoing storage charges. After purchasing a 4 camera set, and installing them in reasonably tamperproof positions, we realised that the camera doorbell would be needed to give the best all-round coverage. I then used the online chat to find out which battery version would save to the homebase3.After a short wait had the required feedback and ordered online too. System fully up and running now, although some of the APP + AI features still need to be understood. Only question at present is how long the battery charge will hold, as not all cameras get full sunlight.It would help if there was an initial set up guidance to ensure that the wifi signal is strong enough in all chosen locations?"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Konstantina",
          "Nb_Reviews": 2,
          "Date": "2023-05-11T07:35:13.000Z",
          "Titre": "Easy setup, great handling!",
          "Contenu": "Easy setup, great handling!Only two minor negative points:1. The person-alert is somewhat inconsistent. Sometimes, I receive an alert when my rabbits move through the picture, sometimes I don't. But up to now it hasn't missed a person, yet.2. I can't access the camera via my smartphone when I'm not connected to WLAN. Doesn't matter whose WLAN it is but as soon as I try to access the camera somewhere on my way, e.g. in the grocery store, I can't connect with the camera. It's a bit annoying but for me it's fine since the longest time of the day I am connected to some WLAN."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "J Cradick",
          "Nb_Reviews": 16,
          "Date": "2023-05-30T10:16:21.000Z",
          "Titre": "Very pleased with the vacuum cleaner…",
          "Contenu": "Very pleased with the vacuum cleaner but could not get the app to recognize it. Using the remote control is easy though, just press A for automatic mode and off it goes. You can also select suction power level on the remote. I have two cats and let my robo vacuum do an auto clean once a day until battery runs out and it returns to charge. The cleaner collects a lot of dust, small pieces of grit and cat hair, my floors have never looked so clean. Would have rated it 5* had it worked with the app."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Pelham Balcombe",
          "Nb_Reviews": 3,
          "Date": "2023-05-12T18:29:42.000Z",
          "Titre": "Nearly 100% but not quite",
          "Contenu": "Easy ordering process and quick delivery. 4 stars because the cashback offer via TopCashback failed to work and has generated the need to raise a query, which can take months to resolve. Disappointing lack of cake icing."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Roland Norton",
          "Nb_Reviews": 5,
          "Date": "2023-07-04T20:07:14.000Z",
          "Titre": "Good Eufy Support",
          "Contenu": "Good Eufy Support. My G30 Robotic Vacuum had a failing brush motor. I was pretty sure it wasn't under warranty, so asked for links on how to order parts, and how to do it. I was sent links to instructions and where to buy the part, and once it arrived I fitted it and all is ok again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ayo A.",
          "Nb_Reviews": 10,
          "Date": "2023-08-31T22:06:43.000Z",
          "Titre": "Device is good - 4k quality in doubt.",
          "Contenu": "Device is good - 4k quality in doubt. Some unexpleianed behaviour - like the hard disk suddenly reformatting itself. And customer service having no idea about the product they support."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Christine",
          "Nb_Reviews": 29,
          "Date": "2023-08-21T11:29:22.000Z",
          "Titre": "My home is more secure",
          "Contenu": "My home is more secure. Although this is not a burglar alarm system, it certainly helps as a deterrent. Instructions are clear and it works well. The option of cloud storage is excellent."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "colin",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T08:58:08.000Z",
          "Titre": "Easy setup and use",
          "Contenu": "Easy to setup, App is easy to use,Pictures very clear.One thing I can’t seem to do is get the scheduling into geofencing mode to run the schedule when at home.Would definitely recommend these cameras. I’ve also used the black covers to help hide them in some places, again easy n quick to put on."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "MR D CORBETT",
          "Nb_Reviews": 5,
          "Date": "2023-02-06T10:51:14.000Z",
          "Titre": "Excellent piece of kit, BUT",
          "Contenu": "The doorbell video unit works a treat … crisp pictures, great notifications, excellent piece of kit. SO useful.However .. the setting up was a nightmare. I was using an Android phone and all was going well until I was asked to ‘give home a name’ , or something similar. The app refused to accept anything. I went online and discovered others had had a similar experience, which was quite depressing.Fortunately I have an iPad, downloaded the Apple version of the app and was able to complete the setup. Had I not had an iPad, or indeed not thought of using it, the app would have been useless.It now works fine on the iPad AND Android phone, but that software needs looking at.(Also remember to set ‘roaming data’ if you intend to view away from your home)."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Johannes",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T08:12:33.000Z",
          "Titre": "Good communcation",
          "Contenu": "The product didnt meet my expectation. The product and construction is not made for househelds with a dog. The communication with eufy was excellent. Return of the Cleaner was without discussions."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jim Tunstall",
          "Nb_Reviews": 7,
          "Date": "2023-05-18T13:11:12.000Z",
          "Titre": "Good fast delivery and competitive…",
          "Contenu": "Good fast delivery and competitive pricing. Easy to set up..did two bells in less than an hour including app setup and installation. Slight problem with balancing getting enough notifications and getting too many but that’s solvable"
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "heimo",
          "Nb_Reviews": 2,
          "Date": "2023-02-12T23:01:37.000Z",
          "Titre": "Very good other and this now used delivery service",
          "Contenu": "This time I appreciate to use a discount voucher. The last sending was done more convenient for me via Austrian \"Post\" which is putting it into special box in my house with tag in mailbox to open later when I am in office at delivery time. At this sending I had to meet the UPS delivery man."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "AR",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T06:49:00.000Z",
          "Titre": "Good Quality with charming prices",
          "Contenu": "Received the entry level eufy 1080P with the 2C camera. Setting up the app and mounting the cameras was easy. Provides very good image quality. However, it would be good to have an additional face detection."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tricks",
          "Nb_Reviews": 20,
          "Date": "2023-08-16T10:00:54.000Z",
          "Titre": "Very easy to set up and clear pictures",
          "Contenu": "Very easy to set up and clear pictures. Ours is set to human only but seems to alert the bbq as a human quite regularly and also keeps alerting when the washing blows. Overall pleased and would recommend."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mark Holt",
          "Nb_Reviews": 25,
          "Date": "2023-05-09T23:25:24.000Z",
          "Titre": "I was a little disappointed that the…",
          "Contenu": "I was a little disappointed that the dual camera doorbell developed a fault, Eufy support was very good. The fault could not be rectified by software updates so they sent out a replacement doorbell before I returned the faulty unit. Great customer service."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Laszlo Szeplaki",
          "Nb_Reviews": 10,
          "Date": "2023-07-13T07:12:13.000Z",
          "Titre": "Excellent product range",
          "Contenu": "Excellent product range and overall outstanding service. The only thing that puzzles me is that my purchase account on the web and in the eufy Security app doesn’t seem to link up."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Ralph",
          "Nb_Reviews": 6,
          "Date": "2023-08-31T06:24:35.000Z",
          "Titre": "Nicht für kleine Badezimmer",
          "Contenu": "In smal rooms with stuff he have problem, He only turn. The rest is good. He clean verry Well. In kleinen Räumen mit Möbel dreht er nur Kreise. In normalen Räumen reinigt er sehr gut."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sinead Thomas",
          "Nb_Reviews": 3,
          "Date": "2023-11-02T01:24:43.000Z",
          "Titre": "Very pleased with our purchase",
          "Contenu": "Very pleased with our purchase. Is very convenient having 2 young kids and a dog. Highly recommend"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "CFJ",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T20:17:10.000Z",
          "Titre": "Easy to set up",
          "Contenu": "Easy to set up, adding products later was simple. Reliable connections over a full 4 bedroomed detached property."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chi Wing Chung",
          "Nb_Reviews": 30,
          "Date": "2023-07-26T12:01:25.000Z",
          "Titre": "slow 2nd delivery",
          "Contenu": "slow 2nd delivery. Placed order for doorbell plus solar 2k camera. Camera took 10 days but doorbell took another 7 - 8 days, Working well though."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Bilquis malik",
          "Nb_Reviews": 11,
          "Date": "2023-01-27T10:07:53.000Z",
          "Titre": "Excellent product , excellent price and superior Home Security peace of mind.",
          "Contenu": "Products are very reasonably priced , good quality. They are one of the few companies who don’t charge you a monthly fee to use the security products. You just need your own hood I cloud subscription. The cameras and the bell works just fine. Quick to instal and relatively easy to use , set up and download. Peace of mind for us now."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jim Leung",
          "Nb_Reviews": 16,
          "Date": "2023-05-04T19:31:38.000Z",
          "Titre": "Good product but...",
          "Contenu": "Good App and product range but the wireless products are lacking a bit in battery life - definitely not the 180 day life that they advertise. Also occasionally misses events."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David S",
          "Nb_Reviews": 28,
          "Date": "2023-05-03T22:28:54.000Z",
          "Titre": "Quality equipment, easy set-up.",
          "Contenu": "Quality equipment, delivered quickly, easy to set up and great picture quality. Four stars awarded as only time will tell if the equipment is durable and the batteries last."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "A.H.",
          "Nb_Reviews": 5,
          "Date": "2023-09-05T16:21:55.000Z",
          "Titre": "The product itself is perfect",
          "Contenu": "The product itself is perfect, but the order process was not really transparent. After i asked the support I got the information that my order was a preorder and the product not available"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David  Lockley",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T20:56:53.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, works well. Easy to setup, install and reliable at motion/people detection. Good value for money. Sometimes software is temperamental in connecting/updating from camera footage."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "PHILLIP ANTHONYJONES",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T09:49:01.000Z",
          "Titre": "Only had the door for a short time but…",
          "Contenu": "Only had the door for a short time but am really pleased with it and when my teenage daughter is at home on her own she find safer when she can see who at the door"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "peter",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T11:26:00.000Z",
          "Titre": "I really like it the only comment I…",
          "Contenu": "I really like it the only comment I would make is I had difficulty in connecting to blue tooth but it seems to be working ok without"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kelly mouland",
          "Nb_Reviews": 6,
          "Date": "2023-02-20T09:59:19.000Z",
          "Titre": "Really wasy to set up and install",
          "Contenu": "Really wasy to set up and install, camera image very clear both during day and night. I like that when using app you can zoom in from recordings to see a more detailed image."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "C Peters",
          "Nb_Reviews": 8,
          "Date": "2023-06-06T00:26:15.000Z",
          "Titre": "Eufy 1080 video doorcam used it for 2…",
          "Contenu": "Eufy 1080 video doorcam used it for 2 weeks now apart from the battery life which in no way would you get 180 days, video pics is very clear, but set it to human only otherwise you’ll be picking all kinds up from moving cars to cats, but it does the job. The app is very good also, changing settings is easy and the setting up was no problem whatsoever it was on my door in 20 mins after fully charging it up. Had the battery life been better l would have given it 5 *’s, but the best you’ll do with it without charging the battery which is easy enough is about 2-3 weeks if your lucky.Still it does the job l wanted it for and charging it is not particularly hard, l don’t know wether this model as the Ai included with it l’m presuming it doesn’t because it pings everytime l go near the door. It also has a setting in which you can turn it off which is handy for when  the kids are running around in the street, and it’s constantly going off but it’s a nosy bleeder and picks almost everything up.All in all a good purchase"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Michael  B.",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T12:51:48.000Z",
          "Titre": "Pros and con",
          "Contenu": "Pro: connection base/cameras/mobile phone very easy and fast, great picture quality also at night time, design of the camerasCon: the cameras do not start the recording immediately when a person is detected, they start three to four seconds later, so the person is just out of sight sometimes"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jason Young",
          "Nb_Reviews": 12,
          "Date": "2023-06-22T04:20:16.000Z",
          "Titre": "Eufy order",
          "Contenu": "Item was delayed with stock issues but when I complained as I wanted before I went on holiday and it said 3-5 business days when I ordered they did knock a bit off the price and refunded that tbf And received item after about 3 weeks"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Den Neville",
          "Nb_Reviews": 10,
          "Date": "2023-01-29T19:51:08.000Z",
          "Titre": "Good product.",
          "Contenu": "Good product so far, very clear images and recordings.Slight delay before showing on phone,but not a major issue.Bought the video doorbell from  Eufy after Christmas in their sale. Great price, very pleased."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "JUDITH ROOM",
          "Nb_Reviews": 10,
          "Date": "2023-10-25T06:26:56.000Z",
          "Titre": "Robovac",
          "Contenu": "It took a little time but they replaced our broken robovac with an updated model"
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Ramona M.",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T22:14:54.000Z",
          "Titre": "The product is perfect - shipping time a bit long",
          "Contenu": "The product is perfect, video quality really great, had quite problems to handle the small screws, after 1 hour trying, we could figure it out, shipping time was a bit long, customer support is great!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 15,
          "Date": "2023-02-22T23:31:34.000Z",
          "Titre": "Good customer service",
          "Contenu": "Had an issue but the company sorted it as soon as they could. Customer service was friendly and helpful. Delivery service that was used was not great but Eufy themselves can not be faulted"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Russ Prince-Wright",
          "Nb_Reviews": 15,
          "Date": "2023-09-20T16:48:29.000Z",
          "Titre": "Support service is very good",
          "Contenu": "Tech support service has been very responsive and helpful (although a few product shortcomings are yet to be resolved) - Overall, it seems to be a good purchase so far."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ISB_12",
          "Nb_Reviews": 13,
          "Date": "2023-08-07T10:24:23.000Z",
          "Titre": "Expandable Storage..?",
          "Contenu": "Would have been better if the Hub had expanadable storage, especially when it already has the USB connection at the back of it...?"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "J Allen",
          "Nb_Reviews": 8,
          "Date": "2023-05-11T15:09:14.000Z",
          "Titre": "Great Video doorbell",
          "Contenu": "Being as honest as possible believe me I am no IT expert. I found initially the size of the bell larger than expected but that's ok.  Setting it up was way more difficult than I imagined. Connecting to the router and the bell and the phone did almost get me throwing it across the room but once I got there it was fine. The sensor is quite fine and setting the area of coverage has to be quite good so as not to activate on people simply walking past and cars passing on the street. I set it up on 1 phone and when i tried to share it with the second phone it deleted off the first phone so I will have to try again. I definitely think I will have to buy an extension chime as the ringer is very quiet. The recording quality is great and the fact there is no monthly fee is the reason I chose this bell. Once I am used to it I'm sure I will get better. Would I recommend it ? Yes and already have to family and friends"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ted",
          "Nb_Reviews": 3,
          "Date": "2023-06-22T04:07:11.000Z",
          "Titre": "Advanced, reliable and cost effective ip cams and surveillance app",
          "Contenu": "I have installed 10 eufy ip cameras across 3 residences (a mix of indoor / outdoor & battery cams, including one homebase 2). All components and apps work really well, except for 1) Flood Cam 2 Pro - intermittently delivers sound only (I.e. “black” video) or goes totally offline and needs to be hard booted to recover (rarely remote soft restart will work)2) the Cam 2 pro battery charge does not last a full year (more like 8 months, but that’s still very good!)3) streaming to web browser is spotty and unreliable (not important for us as the App works well on iPhone and iPad)Considering the complexity of our set-up and requirements the (multiple residences across two continents), the eufy products and solution are actually quite advanced, reliable and cost effective. It’s also helpful that the cloud storage (not a “must” to order, as local storage only is optionally available) covers up to 10 cameras, which we fully utilize.Set-up and installation is guided via the app - very straight forward and takes just minutes… impressive!Technical  support is also very responsive and worked through the issue 1) above with the result they will swap the Flood Cam … once I can finally get to it at its remote location to dismount and return.Overall I can definitely  recommend eufy ip cams and the surveillance app (except the Flood Cam 2 pro). Nifty package and range of solutions."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jerry",
          "Nb_Reviews": 9,
          "Date": "2023-06-06T15:52:18.000Z",
          "Titre": "Good vslue",
          "Contenu": "It arrived three weeks later than expected but is is well packaged and good instructions. I made my own additional back plate to make it stand out from the wall it is fixed to. Works well and looks good."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Catriona Copeland",
          "Nb_Reviews": 21,
          "Date": "2023-01-28T18:11:12.000Z",
          "Titre": "The bell now installed is great",
          "Contenu": "The bell now installed is great! The reason for 4 stars is because installation instructions are so basic and searching in line not much help - luckily a neighbour had recently put one up so helped otherwise heaven knows how I would have managed. Make installation instructions easier to understand"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Woody",
          "Nb_Reviews": 7,
          "Date": "2023-06-20T08:48:35.000Z",
          "Titre": "Great little cameras picture quality is…",
          "Contenu": "Great little cameras picture quality is very good. Fast delivery arrived in 2 days Very easy to set up & install Great purchase"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Andy G",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T23:08:04.000Z",
          "Titre": "Eufycam 2 C",
          "Contenu": "Prompt delivery . Reasonable price . App easy to install & user friendly ( I am 66 ) .Homebase 2 and two cameras functioned as described."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T19:02:26.000Z",
          "Titre": "Fast installation - perfect quality on remote location",
          "Contenu": "I needed some security equipment for my grandparent's house, since they were absent for a while for medical reasons. So I decided to buy a wireless and local battery powered solution. I found Eufy security camera sets with homebase very suitable for that task. So i ordered it, charged the batteries, paired the cameras to homebase and all went smooth incl. a firmware update. I mounted the cameras at a suitable heigth and was happy jiust in time. This solution runs for nearly 2 weeks and I can recommend it due to its quick installation and high quality of video recordings. The intercom feature is also perfect to response to the postman etc. when ringing the doorbell."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lynne",
          "Nb_Reviews": 20,
          "Date": "2023-12-18T22:38:06.000Z",
          "Titre": "First delivery was didn’t arrive",
          "Contenu": "First delivery was didn’t arrive, not the fault of Eufy but the fault of Evri losing the parcel. Contacted Eufy who were very helpful. Waited a couple of days and then contacted Eufy again who said they would send another one out within three days. I received my replacement.Can’t thank them enough for all their help would recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Guido Bellotti",
          "Nb_Reviews": 10,
          "Date": "2023-12-18T00:09:34.000Z",
          "Titre": "Eufy Robovac LR30 Hybrid+",
          "Contenu": "Eufy does something right if I managed to choose the perfect Robot Vacuum with Auto Clean Station at the price I could afford. After months of use my Robovac is still going strong, working its way through the dust and cats’ hair on my floors. Very good software and the battery lasts a long time, enough to finish the house. Customer service is easy to reach and is very helpful."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Mariana",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:13:39.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. The product (a second battery) took a bit longer to arrive but otherwise the whole service was good"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Anirudh Kannibele Srinivas",
          "Nb_Reviews": 5,
          "Date": "2023-12-19T21:47:30.000Z",
          "Titre": "The cameras are easy to integrate and…",
          "Contenu": "The cameras are easy to integrate and configure. most of it is out of the box config and joining to an existing setup is super easy"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Summersall",
          "Nb_Reviews": 35,
          "Date": "2023-12-12T22:23:05.000Z",
          "Titre": "Company we can trust for Quality",
          "Contenu": "We went with Eufy for our new video doorbell. We had actually bought some weighing scales from them previously and on both occasions we thought they were great to deal with. Website was informative and easy to navigate, product was delivered quickly and safely and it looked and performed exactly as described. A company we can trust for quality."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr David Dennison",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T00:33:23.000Z",
          "Titre": "I have been looking for a reliable CCTV…",
          "Contenu": "I have been looking for a reliable CCTV camera system for quite a while, this is the best and reasonably priced system I have found advertised so far."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert",
          "Nb_Reviews": 7,
          "Date": "2023-12-20T19:54:03.000Z",
          "Titre": "Ordered a new battery on the website",
          "Contenu": "Ordered a new battery on the website. Sent straight away delivered no problem. Just a pity the battery went after 1 year."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bindiya Bhor",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T22:50:53.000Z",
          "Titre": "We are very happy with the customer…",
          "Contenu": "We are very happy with the customer service. They handled our complaint about battery very effectively."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Douglas Turner",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T21:19:34.000Z",
          "Titre": "Does what it says on the tin",
          "Contenu": "Does what it says on the tin, effective, easy to install and provides excellent video."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Colin",
          "Nb_Reviews": 12,
          "Date": "2023-12-18T20:07:03.000Z",
          "Titre": "Well, that was easy.",
          "Contenu": "Shopping online was easy purchasing was easy. The delivery was quick and efficient. The product was easy to set up and works well and it was very good value I thought."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Vera",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:25:36.000Z",
          "Titre": "2nd Set 2c PRO fantastic",
          "Contenu": "Ordered another Set outdoor cameras Pro for home base 2. Quick delivery, good price, quality of picture really nice day and night. Plug and play, easy to install. Recommend"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Terry Bromberg",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T12:55:03.000Z",
          "Titre": "All round good quality product",
          "Contenu": "Good quality product, well packaged.  Easy to set up with the app and mobile phone.  I bought the wired video doorbell which was supplied with a variety of mains power adaptors, US, UK and others. The instructions book easy to follow, though left with some additional parts not knowing where or how they fitted.  Not clear in the instructions."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Elizabeth Coultas",
          "Nb_Reviews": 39,
          "Date": "2023-12-17T16:25:33.000Z",
          "Titre": "These security lights are easy to…",
          "Contenu": "These security lights are easy to install on your phone and to your property. The camera footage is excellent with sound too."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Dom",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:48:24.000Z",
          "Titre": "I just love my new eufy",
          "Contenu": "I just love my new eufy. Previously i owned a room a, but this Thing was by far not that awesome than my beloved eufy (i even like the name, sounds so neat to me)It cleans perfectly, is silent even on maximum speed, very intelligent, gives me a map, routes efficiently... What Else can i say? Im impressed and in love :)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Brian Harrington",
          "Nb_Reviews": 11,
          "Date": "2023-12-17T00:38:45.000Z",
          "Titre": "Excellent product after initial problems. Well recommended",
          "Contenu": "Initial problems were soon overcome and everything is now working perfectly.Now considering a digital doorbell to add. What are your recommendations?Many thanks,B Harrington.Excellent"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Daniela",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T17:06:34.000Z",
          "Titre": "We had ordered there for the first time…",
          "Contenu": "We had ordered there for the first time and a few problems with ordering vouchers. Something was also missing from the delivery. Since everything can't always work 100%, there are still full points because we were helped here immediately. We are very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tracey J Foster",
          "Nb_Reviews": 46,
          "Date": "2023-12-13T21:58:08.000Z",
          "Titre": "I'm really impressed with my new eufy",
          "Contenu": "I'm really impressed with my new eufy, I just didn't expect the house to be quite so clean and my favourite thing ever is switching the vacuum on via the app while I'm at work, it's great!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Gatehouse",
          "Nb_Reviews": 33,
          "Date": "2023-12-19T20:43:36.000Z",
          "Titre": "Helpful",
          "Contenu": "They were very helpful when I unfortunately ordered the wrong item"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dr Creed",
          "Nb_Reviews": 54,
          "Date": "2023-12-13T11:53:21.000Z",
          "Titre": "Clever security devices",
          "Contenu": "Clever security devices providing remarkably good quality videos. Took a little bit to fully master the options and a more comprehensive instruction manual would have made things a little easier with less \"trial and error\""
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 42,
          "Date": "2023-12-14T22:20:19.000Z",
          "Titre": "Eufy 2K door bell and home Base.",
          "Contenu": "Got the video door bell with the Home base and it was a good Black Friday deal. The whole buying experience was nice and easy. I was kept aware of the delivery date and it was delivered on time."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Derek Colgan",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T00:31:53.000Z",
          "Titre": "Bill's eufy review",
          "Contenu": "I rated eufy so highly as l believe their products are of top quality and installation is quite easy so long as you follow the instructions which are explained in great detail."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Philip Kingman",
          "Nb_Reviews": 25,
          "Date": "2023-12-13T10:16:13.000Z",
          "Titre": "peace of mind when away from home",
          "Contenu": "Easy to set up, good value  for money, sharp video images, adds a great big level of security to protecting my home."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 7,
          "Date": "2023-12-15T02:51:24.000Z",
          "Titre": "Brilliant for the money!",
          "Contenu": "Brilliant surveillance for the money. Decent picture. Easy to install and set up. Great app and features. So happy with my purchase!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "One Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:48:26.000Z",
          "Titre": "Great products",
          "Contenu": "Great productsClear descriptions of products on website.Keeping customer informed on new products and sales without bombarding with messages. So just a good balanceValue for money as well as opportunities to save on items in sales.Speedy delivery.Keeping customer informed as to delivery Excellent customer service and after sales care, friendly and professional staff which makes for a happy customer!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Agata",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T21:16:22.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Easy to install. No subscription fees. Highly recommended. Very helpful to divert parcels when you are not at home as you can speak via the app."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Liddle",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T22:51:03.000Z",
          "Titre": "Probably the easiest wireless device…",
          "Contenu": "Probably the easiest wireless device I’ve ever setup. Really impressed with picture quality and sound. 10/10. Well done Eufy"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "George Muir",
          "Nb_Reviews": 15,
          "Date": "2023-12-14T23:08:39.000Z",
          "Titre": "Fitted system to catch any trespassing. Good clear and simplecsetnup",
          "Contenu": "Fitted our own system very easily and pic quality is good. Bought a second unit as a gift for another."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Happy customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T11:22:14.000Z",
          "Titre": "Good product",
          "Contenu": "Very quick delivery. Straightforward to setup. Performs as expected. Was recommended to me and would recommend it to other people."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Scott Holliday",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T21:19:40.000Z",
          "Titre": "The eufy mop and vacuum wash a long…",
          "Contenu": "The eufy mop and vacuum wash a long hard think as it’s not a cheap purchase. We have dogs so when they are in and out lots the floor gets dirty quickly and at times it’s hard to keep on top of. Last time I cleaned it with a mop was over a week ago and it took ages to get clean. Now we turn Tony (our eufy) on vac mop as we go to bed 3 x a week. Love it absolutely love it. Time will tel if it’s got the longevity of a well made product."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Hudson",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:35:17.000Z",
          "Titre": "EUFY Robovac L60",
          "Contenu": "We purchased an Robovac L60. This is an excellent product, great price and quick delivery. Using this daily has made a huge difference in a short time. The app is really easy to use and the mapping process simple to set up. Highly recommend to anyone looking for this type of product."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Michael Jerez",
          "Nb_Reviews": 5,
          "Date": "2023-12-05T11:27:02.000Z",
          "Titre": "Excellent products",
          "Contenu": "Excellent products, easy to set up, clear instructions.  Well packed.  No unnecessary subscription charges.Good price range of cameras etc for all budgets."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Severin Johann Erler",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:14:34.000Z",
          "Titre": "Solid and fair company",
          "Contenu": "Good communication, fair prices and good quality. I enjoy that you can easily buy and replace worn parts yourself."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Mike W. GER",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:40:08.000Z",
          "Titre": "Fully satisfied",
          "Contenu": "Lamp provides everything I need for a wall light with cam and has replaced another challenging product.I can't say anything about reliability yet - time will tell.Especially I want to mention the movable camera to look sideways from the mounting direction of the wall light and the possibility of colored illumination."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "simon slatford",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T16:59:00.000Z",
          "Titre": "I’ve purchased the battery operated…",
          "Contenu": "I’ve purchased the battery operated doorbell. It was all set up and running within 30 minutes. I have now had my parcel delivered and notified without none of them going. Missing reason why we purchased a camera so I give this product five out of five due to the cost of £99 is give me 100% peace of mind, I hope this review helps"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Kynaston",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T09:46:10.000Z",
          "Titre": "THEY'RE REALLY GOOD",
          "Contenu": "THIS REALLY DOES ACTUALLY, 'DO WHAT IT SAYS ON THE TIN'."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T21:24:59.000Z",
          "Titre": "Burglary prevented",
          "Contenu": "We were in France , 1100km away from Home and received an alarm from our house in Germany. We saw two potential burglars entering our garden through the cameras and told them via the cameras that the police were already on their way. We called the police, who arrived shortly afterwards. We were lucky and the burglars fled. No burglary.General Impression: Easy to install an use, Good quality"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "A. Butler",
          "Nb_Reviews": 7,
          "Date": "2023-11-28T08:38:46.000Z",
          "Titre": "Great quality cameras with all the features",
          "Contenu": "The Eufy products are great quality and so easy to install. I have a number of cameras and doorbell with all being solar and as long as they are positioned to charge well enough then you’re sorted. I have only had to move one of mine to catch the sun better in winter but sport from that they function perfectly. The Ai tracking on this latest version is a decent function as it tracks any movement, records,alerts and the picture quality is great."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 16,
          "Date": "2023-12-06T13:45:23.000Z",
          "Titre": "Can't praise customer service highly enough",
          "Contenu": "I have also left this review under Eufy as I am not sure of the relationship between Eufy and Anker. Suffice it to say that I received fantastic customer service when I had a problem with a Eufy camera. Fast response, extremely polite communication and the problem was resolved with absolutely no fuss. If only all companies behaved like this"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Slavomir Slavomir",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T08:36:52.000Z",
          "Titre": "Wonderful products and service",
          "Contenu": "Wonderful products and service. Thank you very much"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Wolfgang",
          "Nb_Reviews": 4,
          "Date": "2023-11-30T22:57:12.000Z",
          "Titre": "Top products and outstanding customer service !",
          "Contenu": "I purchased appr. 40 devices of Eufy Security, and all worked great for 2 years now ! Just one device failed after 2 years, and the customer service replaced it without discussion ... I wish all companies would be like Eufy !"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 34,
          "Date": "2023-11-28T15:01:59.000Z",
          "Titre": "Security floodlight cam.",
          "Contenu": "Purchased 2 floodlight cams which were delivered very quickly 2 days after ordering. Easy to install and connect to the app, really pleased with the alerts and recording quality.The app is easy to use and the floodlights are bright enough to illuminate a large area of both my rear garden and driveway.Only time will tell."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Christian Greil",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T09:25:15.000Z",
          "Titre": "I use the cams with my homeautomatisation",
          "Contenu": "I use the cams with my homeautomatisation (homey) as well as stand alone with the app.All was easy and intuitiv to install. I am very satisfied.Now i hope they will do the job also at cold winter conditions in the same way."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "L&C",
          "Nb_Reviews": 6,
          "Date": "2023-12-05T22:20:15.000Z",
          "Titre": "Excellent products and delivery…",
          "Contenu": "Excellent products and delivery service.I have several products now from eufy, as really good quality, easy to use and set up, easy app and no subscriptions."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "PR",
          "Nb_Reviews": 12,
          "Date": "2023-11-24T22:14:51.000Z",
          "Titre": "Eufy system",
          "Contenu": "After being advised by a friend, I recently purchased 2 x eufycam 3c cameras,  1 x e340 doorbell, and 1 x homebase 3 with1Tb  hard drive. Put the eufy app on my mobile, found the system fairly straightforward to set up, including to format the HD. Following the instructions, the installation of cameras and doorbell was also fine. Next, used the feed from the cameras on my mobile, to get the best mounting position. Very pleased with the wide camera angles. Did what I wanted. Overall, I was impressed with the eufy system and notifications with visitors/people passing by. From my experience so far, certainly recommend eufy"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "E Ofori",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T18:45:45.000Z",
          "Titre": "Able to see clear on my phone when soon…",
          "Contenu": "Able to see clear on my phone when soon one is at the door.The sound of the bell should be louder."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "zahra",
          "Nb_Reviews": 5,
          "Date": "2023-11-29T23:12:37.000Z",
          "Titre": "eufy are a very good company",
          "Contenu": "eufy are a very good company. very good customer service. i bought a eufy robovac 10 the first one. it was unfortunately discontinued so couldn't buy any original replacement parts. it lasted 5 years. but they counldn't fix it. they offered me a discount on a new one. a robovac g30. it was very good and smart. but i didn't like it as you had to use an app and it had wifi. i have now bought a robovac 11s Max. if doesn't have wifi and can use the remote and no app. it is definitely better than the robovac 10. also the 11s max is compatible with the newer models so even if it is discontinued i will still be able to buy original replacement parts."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Customer Roger Miller",
          "Nb_Reviews": 35,
          "Date": "2023-12-08T16:43:23.000Z",
          "Titre": "eufy doorbell",
          "Contenu": "After a problem with a new doorbell I emailed eufy and they promptly replied and made suggestions to try which successfuly cured the problem."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MR G & MRS M EDGERTON",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T20:06:48.000Z",
          "Titre": "If only all companies were like EUFY!",
          "Contenu": "The EUFY customer services are amazing! Prompt replies to emails and very pleasant to talk to with refunds (where applicable) very promptly paid.EUFY camera products are extremely well made and easy to setup/use via the excellent app. I’m so impressed with EUFY products I’ve ordered some more!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Van",
          "Nb_Reviews": 10,
          "Date": "2023-12-05T21:36:38.000Z",
          "Titre": "I bought the cheapest Eufy I could…",
          "Contenu": "I bought the cheapest Eufy I could afford and it works a wonder. I could see why everyone is raving about it now. It does both tile floor and carpet. Tell my photoshop when it got stuck so I know to come and rescue it. The dust container is quite small so I do one room 15-20 minutes at a time. Save me so much work so it’s really worth it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jon Harris",
          "Nb_Reviews": 10,
          "Date": "2023-12-06T21:24:18.000Z",
          "Titre": "Great",
          "Contenu": "Great. Better than expected although it did start by itself in the middle of the night so need to check instructions"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Andre Tews",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T14:52:01.000Z",
          "Titre": "Quick reaction and smart things",
          "Contenu": "Quick reaction and smart things. Shelly is great player in home automation. The support ist very smart, I forgot a part of my address and they contacted me rapidly.Very good service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Emily Smythe",
          "Nb_Reviews": 9,
          "Date": "2023-12-01T08:29:15.000Z",
          "Titre": "Amazing technology",
          "Contenu": "Amazing technology! I love eufy as you don’t need to pay a subscription fee. It’s reliable and very high quality. Much better than other competitors on the market!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Christine",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T08:28:50.000Z",
          "Titre": "Eufy door bell",
          "Contenu": "Fab product fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "S Hurst",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T19:39:23.000Z",
          "Titre": "Brilliant Product and Service",
          "Contenu": "Brilliant Product and Service, gave me a partial refund because the item went into the sale the week after I bought it, no quibble and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gordon",
          "Nb_Reviews": 13,
          "Date": "2023-12-02T21:09:27.000Z",
          "Titre": "Put my first camera up and the process…",
          "Contenu": "Put my first camera up and the process has been easy and problem-free, I have a another camera to put up and can see no issues. Problem-free self-install whats not to like."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 25,
          "Date": "2023-12-12T18:45:06.000Z",
          "Titre": "Thoroughly recommend",
          "Contenu": "Easy to order, Excellent price, arrived swiftly, easy to fit, does the job it’s meant to."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stuart McFarlane",
          "Nb_Reviews": 40,
          "Date": "2023-11-24T22:16:42.000Z",
          "Titre": "Great customer service",
          "Contenu": "I bought a replacement battery from Eufy / Anker to resolve an issue with my X8 Robovac.  It turns out that it wasn't the battery that was the problem (error message suggested it was) - now resolved.  The Eufy Customer Support Engineer, Marion, said if the new battery didn't solve the problem to return it for a refund, which was promptly paid.  Marion's assistance was superb she was a credit to herself and Eufy/Anker throughout.  Great customer service and products."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gary Carmichael",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T09:09:56.000Z",
          "Titre": "Now have the wall light and high level…",
          "Contenu": "Now have the wall light and high level security light and both working a treat with fantastic quality and so easy to use."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:10:30.000Z",
          "Titre": "Great Product, fast delivery",
          "Contenu": "Purchased the x8 Pro. Does what he should. Our apartment is clean."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Rafa",
          "Nb_Reviews": 6,
          "Date": "2023-11-29T09:17:54.000Z",
          "Titre": "Really good cameras",
          "Contenu": "Really good camera quality and movements sensor detection are working properly.Easy to install and easy to use.I have some issues with the detection of the smartphone’s location for the geofencing."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Julian",
          "Nb_Reviews": 11,
          "Date": "2023-11-28T11:09:16.000Z",
          "Titre": "Easy to understand website with good…",
          "Contenu": "Easy to understand website with good product details.Not fitted the camera yet, as waiting for the new door, but if it is as good as the service and website, it should not be a problem. Good swift delivery too."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Charlotte",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T21:26:45.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, couldn’t live without my Efy.Customer service was great when I had a problem and was resolved quickly.Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gordon Townhill",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:56:47.000Z",
          "Titre": "Brilliant",
          "Contenu": "Packaged well, delivered promptly, easy to set up and the picture quality brilliant. Will purchase more ad on products."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Pascal",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T21:06:31.000Z",
          "Titre": "No Cloud needed Perfect",
          "Contenu": "Good Cameras no Cloud needed, all your footage is private. Easy to install. Very good Price at Black Friday."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Briony Stilliard",
          "Nb_Reviews": 12,
          "Date": "2023-11-29T12:11:32.000Z",
          "Titre": "LiveChat excellent service from Support Engineer",
          "Contenu": "The battery life for one of my cameras was really poor. I was told the battery couldn't be replaced and the warranty on the camera had expired. I was advised to let the Customer Support Engineer know the order number of the replacement camera and they would apply a 15% discount to that one item to recompense me for the inconvenience. Excellent customer service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jacky Gooda",
          "Nb_Reviews": 6,
          "Date": "2023-12-05T22:29:36.000Z",
          "Titre": "For me it small and very compact and…",
          "Contenu": "For me it small and very compact and quality is excellent and able me to keep constant control over my property"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "CosgroveAU",
          "Nb_Reviews": 6,
          "Date": "2023-11-22T14:33:59.000Z",
          "Titre": "Affordable and Quality.",
          "Contenu": "Great cameras and growing product range. App always expanding and still needs some tweaks here and there but for most part and affordable home security company."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MR PETER BRACKLEY",
          "Nb_Reviews": 11,
          "Date": "2023-11-22T21:15:34.000Z",
          "Titre": "Bell/camera was easy to install and…",
          "Contenu": "Bell/camera was easy to install and setting it up wasn’t too difficult. The facility to see who is at your door and all visits in your absence is extremely useful."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Peter Finch",
          "Nb_Reviews": 10,
          "Date": "2023-12-16T22:08:39.000Z",
          "Titre": "Quick delivery easy to order on line"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Elizabeth Greenough",
          "Nb_Reviews": 5,
          "Date": "2023-11-23T10:07:09.000Z",
          "Titre": "Returning customer - pet cam",
          "Contenu": "I bought the doorbell system about a year ago because of the subscription free option and was so pleased with it that I recently bought the pet cam. The price is brilliant for the quality and it's so easy to set up. I'm really impressed with eufy all round."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "William Cross",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T09:31:19.000Z",
          "Titre": "eufy security camera - exterior solar powered  - easy to install and use",
          "Contenu": "Very easy to install and use. Most helpful not to have to use a subscription service to store security footage."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Peter",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T23:43:36.000Z",
          "Titre": "Works",
          "Contenu": "Does what is expected"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "brian pilsworth",
          "Nb_Reviews": 7,
          "Date": "2023-12-04T21:18:48.000Z",
          "Titre": "So easy to set up and great picture…",
          "Contenu": "So easy to set up and great picture quality compared to our previous cheap one off eBay."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gary",
          "Nb_Reviews": 8,
          "Date": "2023-11-21T18:08:14.000Z",
          "Titre": "Battery camera and chime…",
          "Contenu": "I bought a battery camera and chime doorbell. After 4 months I had a problem with the video going black and after contacting eufyy through their chat system  and trying all their suggestions I then couldn't get the camera to reconnect. It was frustrating so I clicked on the e warranty on the app and requested a replacement.  I had a quick reply and was asked to post the camera and chime back to them and they would then send me a new one and refund my postage.  I was a bit apprehensive about this but I emailed photo of package and the return receipt from the post office. I postage it all back on a Saturday and by the following Friday I had a new replacement camera and chime and my postage had been refunded. I dealt with April from Anker throughout the returns process and her customer service was excellent.  The new one is working fine."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "NICULINA ALEXIEVICI",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T05:24:09.000Z",
          "Titre": "Battery replacement",
          "Contenu": "I received a new battery wich which works well."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Herbert Almus",
          "Nb_Reviews": 6,
          "Date": "2023-12-20T18:39:37.000Z",
          "Titre": "Good quality and fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Frank Heckers",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T22:07:07.000Z",
          "Titre": "Everything as expected!",
          "Contenu": "Everything as expected!Like always, a great brand!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Byron Gallagher",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T10:50:40.000Z",
          "Titre": "Didn’t get my recommendation gift…",
          "Contenu": "Didn’t get my recommendation gift Amazon probably my fault did something wrong but not blaming you"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kevin Glasspool",
          "Nb_Reviews": 18,
          "Date": "2023-11-18T21:42:59.000Z",
          "Titre": "I ordered some new filters for my…",
          "Contenu": "I ordered some new filters for my robovac, on the eufy web site. The web site was easy to navigate and the orďer process very simple. The best thing though was the speed  my order was delivered, web site stated 3 to 4 days ,item arrived within 36 hrs."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "micko",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T12:54:23.000Z",
          "Titre": "Great stuff",
          "Contenu": "I needed some replacement filters for my  robo-vac I was expecting they would be expensive with the added postage as well on top. I was delighted to find that the filters were only £12 for two and free postage. Great stuff. (Dyson take note)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nick",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T11:09:05.000Z",
          "Titre": "Swift expedition, easy setup",
          "Contenu": "Swift expedition, easy installation and setup. Good image quality even in adverse conditions. I m happy with that investment."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Athanasios Kalaitzidis",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T18:55:26.000Z",
          "Titre": "Quick response",
          "Contenu": "Quick response, very helpfull, honest and generous."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "GA",
          "Nb_Reviews": 23,
          "Date": "2023-11-24T00:31:26.000Z",
          "Titre": "eufy doorbell system is great",
          "Contenu": "I opted for the eufy doorbell system and have been delighted with the product. Easy to install, great functionality and robust and reliable. No subscription charges either. Would recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 29,
          "Date": "2023-11-23T09:15:06.000Z",
          "Titre": "Questions answered very quickly.",
          "Contenu": "I have had several questions on the eufy doorbell I had purchased as well as the 8 pro Robovac. Queries were answered quickly and answered all my questions."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "JH",
          "Nb_Reviews": 5,
          "Date": "2023-12-16T13:00:52.000Z",
          "Titre": "Excellent",
          "Contenu": "Very good views and therefore security"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Glen Robinson",
          "Nb_Reviews": 13,
          "Date": "2023-12-21T07:41:59.000Z",
          "Titre": "Great camera"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bruce Kerr",
          "Nb_Reviews": 7,
          "Date": "2023-12-06T18:13:24.000Z",
          "Titre": "Easy website to use",
          "Contenu": "Easy website to use. Good value on robovac and quick delivery. Machine works really well."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark john crowley",
          "Nb_Reviews": 6,
          "Date": "2023-12-06T21:52:43.000Z",
          "Titre": "Fantastic camera door bell",
          "Contenu": "Great product and was delivered quick.Very easy to set up and is working how it should.Highly recommend to anyone."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Binal Patel",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T22:27:57.000Z",
          "Titre": "Impressive",
          "Contenu": "Impressive! Fast delivery. Arrived next day."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Jessica Hughes",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T15:58:11.000Z",
          "Titre": "Good cleaning",
          "Contenu": "Good cleaning, mapping works fine. Easy app use. Happy with purchase"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Thomas B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:53:44.000Z",
          "Titre": "Great Product",
          "Contenu": "Great Product, easy to install and quick delivery. At its best, not the first and presumably not the last time."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Eddie",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T02:25:59.000Z",
          "Titre": "Great company with great products and…",
          "Contenu": "Great company with great products and an outstanding support and customer service."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Jane",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:40:28.000Z",
          "Titre": "looking forward to shopping at eufy again",
          "Contenu": "comfortable checkout, fast shipping, high quality products. I can absolutely recommend eufy"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Atila",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T13:04:59.000Z",
          "Titre": "Perfect",
          "Contenu": "Great products in single use and also in system together. Amazing. Good service too. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Darren Meehan",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T11:34:48.000Z",
          "Titre": "Great door bell",
          "Contenu": "Great product , very easy to install and get up running"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Helen Macintyre",
          "Nb_Reviews": 5,
          "Date": "2023-11-24T11:00:22.000Z",
          "Titre": "My son has one and I thought it great",
          "Contenu": "My son has one and I thought it great.  He suggested we get one as my husband is 85  and I am in my 70's so quite vulnerable.Also extremely quick delivery from when we ordered.   2days.CheersHelen Macintyre"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mrs Jaya Malhotra",
          "Nb_Reviews": 4,
          "Date": "2023-12-07T09:54:30.000Z",
          "Titre": "The addition to our family has made…",
          "Contenu": "The addition to our family has made life so easy.. why didn’t I get this before ??"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T09:07:13.000Z",
          "Titre": "Good service",
          "Contenu": "Good contact with CS team."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Julia",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T13:18:43.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Had a problem with the batter very shortly after warranty ended. Customer Service sent us a replacement anyway."
        }
      ]
    }
  ]
}