{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "extrememeters.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Babak Memari",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T19:21:07.000Z",
          "Titre": "UPS wants to charge me extra 63CAD .",
          "Contenu": "UPS wants to charge me extra 63CAD .Why?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BobbyLee",
          "Nb_Reviews": 2,
          "Date": "2021-06-17T10:27:56.000Z",
          "Titre": "Order canceled because inventory was wrong.",
          "Contenu": "I ordered a Gerber Shard Tool without any problems and received the confirmation soon after.  Right after I received the confirmation I received a message that my order had been canceled and a refund was issued because they were wrong about the inventory (said seven were left upon ordering) and they were completely out.  No offer to keep the order as a backorder just a flat out order cancelation.  Not happy with my experience but at least I saved 95 cents in the end ordering it direct from Gerber with their free shipping and 20% discount."
        },
        {
          "Note": 1,
          "Lieu": "BS",
          "Pseudo": "Robert Meister",
          "Nb_Reviews": 1,
          "Date": "2021-06-06T23:34:12.000Z",
          "Titre": "I PAID A PREMIUM PRICE TO RECEIVE THE…",
          "Contenu": "I PAID A PREMIUM PRICE TO RECEIVE THE SHIPMENT VIA UPS IN ONE BUSINESS DAY. AFTER 3 BUSINESS DAYS, THE SHIPMENT HAD STILL NOT ARRIVED."
        },
        {
          "Note": 1,
          "Lieu": "TN",
          "Pseudo": "Lotfi Bennani",
          "Nb_Reviews": 2,
          "Date": "2021-06-18T17:57:20.000Z",
          "Titre": "I didn't receive my order since March…",
          "Contenu": "I didn't receive my order since March 17th I am not satisfied by your services"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Wise",
          "Nb_Reviews": 1,
          "Date": "2021-08-08T19:25:51.000Z",
          "Titre": "Package did not arrive",
          "Contenu": "Package did not arrive, it was ordered last Sunday and paid extra for 2 day shipping. It’s been a week."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danny Masters",
          "Nb_Reviews": 1,
          "Date": "2020-04-11T01:02:18.000Z",
          "Titre": "Can’t get the dam thing to log onto…",
          "Contenu": "Can’t get the dam thing to log onto Bluetooth and your tech support doesn’t return calls"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "ChrisW",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T00:05:47.000Z",
          "Titre": "Too many bloody emails asking for…",
          "Contenu": "Too many bloody emails asking for reviews. Calm downThe meter is fine. Kestrel equipment is good"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Marius Olivier",
          "Nb_Reviews": 1,
          "Date": "2020-12-25T10:10:11.000Z",
          "Titre": "Good day ,",
          "Contenu": "Good day ,As of know I still have not received my items.Marius Olivier"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "WK",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T08:13:43.000Z",
          "Titre": "Kestrel 3550 “FW” didn’t come with chart.",
          "Contenu": "I ordered a Kestrel 3550 FW and what came in the box was an orange 3550 AG without the waterproof PIG and FDFM chart which was supposed to be included. The device is good but I am very disappointed as it is difficult to do calculations calculations with an IRPG and I was looking forward to seeing how the Kestrel chart would be. We’ll see if this company follows through with customer service and sends me one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Esmeralda  Velazquez",
          "Nb_Reviews": 1,
          "Date": "2021-07-19T18:25:41.000Z",
          "Titre": "Was not delivered when it said it would."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Miss nancy aldred",
          "Nb_Reviews": 8,
          "Date": "2023-12-19T01:22:51.000Z",
          "Titre": "Import tax, need to factor …",
          "Contenu": "Hadn't realised there would be import tax to pay, should be clear notice on converted currency.Thought as in £, was despatched from UK!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kaveh Ruhi",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T01:58:48.000Z",
          "Titre": "Everything was great until……",
          "Contenu": "Everything was great! But then afterwards I reviewed excessive Emil’s about submitting a review. What is it with these companies harassing us after the sale?"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Gunter E",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T15:19:51.000Z",
          "Titre": "Steep additional costs on shipments to…",
          "Contenu": "Steep additional costs on shipments to Europe.Eventhough the value of my Parcel containing 1 Drop D3, is below 150€, I'll have to pay an extra €50 to receive the Parcel because Extreme Meters did not mention in the order that VAT is included."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T14:38:11.000Z",
          "Titre": "Part was exactly as describe and the…",
          "Contenu": "Part was exactly as describe and the one I need, only reason not getting a higher score is due to the fact that the estimated delivery date was off by 2 days. To be fair I also didn't expedite the order"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick Beckham",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T18:48:46.000Z",
          "Titre": "Shipping was decent but left out part…",
          "Contenu": "Shipping was decent but left out part of my order"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Victor",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T02:05:07.000Z",
          "Titre": "I still need info after the purchase of…",
          "Contenu": "I still need info after the purchase of the emf meter so that I can use the meter as it is intended to be used. I am able to get emf and magnetic readings with the meter, but also need guidance as to how to interpret the readings related to the devices and appliances that i am scanning using the units of measure of this meter."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob Anderson",
          "Nb_Reviews": 4,
          "Date": "2021-09-16T17:07:24.000Z",
          "Titre": "Delivery TIme was an Issue",
          "Contenu": "The ordering process went very smoothly and my meter was shipped the same day as ordered. I paid the small charge to upgrade shipping to USPS First Class. According to the chart on the Extreme Meters web site, I should expect delivery in two days. However, the meter took eight days(!) to be delivered. I realize the delay was with USPS but Extreme Meters should be more realistic with their delivery estimate."
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Oleksandra Andriievska",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T20:26:42.000Z",
          "Titre": "Import fees",
          "Contenu": "All was perfect except of there is no info on purchase steps, about that you will need to pay import fees...For me this was unexpected and unpleasant surprise.It will be good to have this info on your purchase steps, maybe after you enter delivery details, and system understands that this product will be imported. As maximum to show the sum of money that you will need to pay  (import fee), as minimum to show just like a notification that:\" you will need to pay import fees later\" and maybe approximate sum.Because I received this info from UPS, when status of my shipment was \"on the way\".Thank you!KR, Oleksandra"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Haydn",
          "Nb_Reviews": 5,
          "Date": "2022-04-16T18:04:15.000Z",
          "Titre": "Extreme meters kestrel 5700 elite vane mount",
          "Contenu": "Ordered the wind vane attachment for my Kestrel 5700 elite. It was shipped quickly and arrived withour issueIt is plastic vane, rod and holder for the kestrel. I expect this was done to save weight.There is a needle attachement that allows the vane to easily move about in the wind.Comnection to both the kestrel app and strelok pro is easy and provides the necessary features for the app.There are some improvements that could be recommended for the vane attachement to the rod to slot so the vane is vertical to the meter. All slotted connections were a little tight causing some disassembly issues. Be careful as you may over exert and damage the vane."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Cole",
          "Nb_Reviews": 2,
          "Date": "2021-04-13T14:47:57.000Z",
          "Titre": "Exactly what I expected.",
          "Contenu": "Exactly what I expected.Fast shipment, the equipment received was clean and worked perfectly. Any questions I had where quickly answered in the provided instructions"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Graham Lorch",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T23:32:36.000Z",
          "Titre": "Great Product, Bad Shipping Choice",
          "Contenu": "Hello. I recently ordered and received a Kestrel 3500 Weather Meter from you. The item was a gift for my grandson so I have not had an opportunity to use it myself. I'm sure it will be well received.I appreciate you following through and asking for my input. My only criticism concerning this order was the shipping. The item was sent via USPS and I was not happy with the result. It did not arrive on time or when USPS reported that it had arrived. When I checked their website, it said the item was waiting for pickup at a local post office. After driving there and waiting in line for 30 minutes, I was told by an impolite postal worker that the item had been sent out for delivery. No apology from her for me having to waste more than an hour of my time due to incorrect information on their tracking site. She was correct, when I returned home, the meter was in my mailbox. Fortunately, it arrived just in time for me to deliver it to my grandson over Thanksgiving. Otherwise, I would have had to ship it again.In the future, I will request another option for mailing. I have had similar problems with other USPS deliveries. If I may make a suggestion, you might want to consider another option for your basic delivery service. I have never had the problems with UPS or FedEx that I have had with USPS. They really don't seem to care whether they deliver on time or how inconvenient they make it for their customers. I suspect that a basic lack of accountability within USPS is a main reason for their bad service.Thanks for the opportunity to give feedback. I hope to purchase products from ExtremeMeters again.Graham Lorch"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave Bell",
          "Nb_Reviews": 1,
          "Date": "2020-08-17T15:09:57.000Z",
          "Titre": "Thank you",
          "Contenu": "Thank you for the quick delivery of the meter. I have had three of these and have been happy with all of them. I especially liked the battery compartment changes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "todd eiken",
          "Nb_Reviews": 1,
          "Date": "2020-03-16T12:22:39.000Z",
          "Titre": "The option poles are annoying"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Rhodes",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T19:16:05.000Z",
          "Titre": "Cabling In",
          "Contenu": "Works as advertised. There are some challenges in the actual connection process. Keep at it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Rhodes",
          "Nb_Reviews": 1,
          "Date": "2019-12-06T15:48:53.000Z",
          "Titre": "Quick response with correct item",
          "Contenu": "Quick response with correct item.   Item arrived when promised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George Morrissey",
          "Nb_Reviews": 1,
          "Date": "2020-12-29T00:27:59.000Z",
          "Titre": "Arrived as advertised"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "craig Farthing",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:41:23.000Z",
          "Titre": "Received what was ordered",
          "Contenu": "Received what was ordered.  But I had to email to get order status and to get the tracking number.  Never did receive a email notification of my shipment notification other then answering my email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne M",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T03:54:31.000Z",
          "Titre": "Fast response to get a battery cover…",
          "Contenu": "Fast response to get a battery cover replacement for my Kestrel 2500"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sam",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T08:13:09.000Z",
          "Titre": "Quick delivery to Australia",
          "Contenu": "I'd been looking at one of the Kestrel meters for a while. The pricing at Extreme Meters was very competitive and even once USPS postage to Australia was included, it was still $100 cheaper than I could buy the same item in Australia. I received the meter in a little over a week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T21:07:48.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service!  They promptly responded to my email to change an order on a Saturday that was my error.  They promptly shipped it out on Monday and I received it on Wednesday."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Dennis Ast",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T17:59:43.000Z",
          "Titre": "Absolutely perfect!",
          "Contenu": "Absolutely perfect!Ordered a SIG KILO6K rangefinder.At first I had some concerns regarding delivery and customs, because I was ordering from Germany.But everything went well! Ordered Friday night, delivered the next Thursday morning. Not even six full days incl. customs control.You guys did a very good job!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T13:46:26.000Z",
          "Titre": "9 red battery covers for Kestrel 3000",
          "Contenu": "Professionalism of the seller and of US Postal in shipments to Spain, although it was not possible for the seller to send me the invoice by email. With Correos in Spain, great waste of time, bad service and very poor attention.The caps are original from the manufacturer, so they fit perfectly."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "MC Lissy",
          "Nb_Reviews": 3,
          "Date": "2023-07-11T21:44:25.000Z",
          "Titre": "Brilliant service",
          "Contenu": "The ordering process and speed of delivery were exceptional for an order from the US to Germany. Also the customs formality with UPS was easy and fast. I would have liked that the calculation of the tax and thus the transparent final price are already clear at the time of purchase. But I am aware of the cultural differences in point of view on taxes between the US and Europe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 3,
          "Date": "2022-02-06T16:25:09.000Z",
          "Titre": "The Kestrel 2500NV exceeded my…",
          "Contenu": "The Kestrel 2500NV exceeded my expectations in every way. It is light, compact, robust and extremely simple and efficient to use. Temp, baro and altitude readings are dead accurate. I have taken it from Boulder CO to over 10k feet and compared its alt readings to USGS topo maps. The correspondence is impressive. Calibrating baro pressure and initial altitude is easy and fast. Could not be happier with the instrument."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T17:47:29.000Z",
          "Titre": "Fast shipping and item worked exactly…",
          "Contenu": "Fast shipping and item worked exactly as described! Instead of having to toss my kestrel due to breaking the battery cover I was able to save it with an inexpensive replacement part.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris M.",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T03:36:10.000Z",
          "Titre": "In a world dominated by Amazon",
          "Contenu": "In a world dominated by Amazon, buying directly from ExtremeMeters was a better value and a great experience. Like other vendors, Kestrel has locked the market with MAP prices. It makes sense to find a good dealer that answers yoirr questions and has a few other perks. Shop around, you will find it is worth the investment buying from ExtremeMeters."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Vaden",
          "Nb_Reviews": 4,
          "Date": "2020-09-17T01:13:33.000Z",
          "Titre": "The instrument is excellent and exactly…",
          "Contenu": "The instrument is excellent and exactly as described.The shipping took 4 days longer than on the ordering page.   I was hoping to receive this on our anniversary.  However, I realize, ExtremeMeters is not responsible for the delivery after depositing the order in the U.S. Mail.  I also am aware that the post office may not be able to meet their current obligations due to Covid."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Philip  Harvey",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T04:24:37.000Z",
          "Titre": "Kestrel 3550FW",
          "Contenu": "I purchased the Fire Weather Meter to use In my role as a Ground Observer and Fire Cause Investigator in the Fire Service.It is very easy to use and gathers all the information required. I also purchased the Kestrel Wind Vane. Definitely needed to get correct 10 minute weather obsevations.Delivery time to Australia was very prompt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy camper",
          "Nb_Reviews": 1,
          "Date": "2021-09-20T17:35:53.000Z",
          "Titre": "Great replacement product",
          "Contenu": "Extremely easy to order and at a very reasonable price. I had complete confidence that I was ordering the correct part. (not always the case when ordering parts without photos) The part arrived when expected. The part fit the weather station perfectly.  The only surprise was just how easy it was to order!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristin & Nina",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T16:05:55.000Z",
          "Titre": "Found the part, shipped quickly!",
          "Contenu": "Didn’t think I’d find a replacement battery cover for my Kestrel anemometer — but here it is. Great price, quick shipping! Thanks Extreme Meters!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue Miller",
          "Nb_Reviews": 1,
          "Date": "2021-12-26T10:44:35.000Z",
          "Titre": "This handheld anemometer is better than…",
          "Contenu": "This handheld anemometer is better than the older one my husband had. He was extremely happy with all of the features, lanyard and case. Seller shipped quickly and it arrived faster than I had expected since I waited til a week before Christmas to order. Very happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Larkins",
          "Nb_Reviews": 1,
          "Date": "2021-03-04T13:33:45.000Z",
          "Titre": "Extrememeters answered ALL my…",
          "Contenu": "Extrememeters answered ALL my questions,- were totally professional - were EXTREMELY respectful to me- were a REAL pleasure to chat withALL BEFORE I PURCHASED THEIR PRODUCTS MOST SINCERE THANK YOU ANS APPRECIATED"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Taylor",
          "Nb_Reviews": 1,
          "Date": "2020-05-20T01:27:51.000Z",
          "Titre": "I purchased the Kestrel 2700",
          "Contenu": "I purchased the Kestrel 2700. The unit had a small issue and I contacted ExtremeMeters around 6pm my time. I had a response from Mitch (General Manager) not soon after. I explained the issue and that I had planned on using the 2700 for a match the upcoming weekend. Mitch sent out a new unit that night via UPS to make sure I would receive the new unit before the weekend.Great people and amazing service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PAUL",
          "Nb_Reviews": 12,
          "Date": "2021-06-06T18:48:46.000Z",
          "Titre": "Prompt shipping of excellent products",
          "Contenu": "My Kestrel 5000 Weather Station will be used crossing the Amazon River (Peru, Colombia, Brazil). On long hikes, especially, I need to know temp and humidity. Thank you to ExtremeMeters.com.KingCobra"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew",
          "Nb_Reviews": 4,
          "Date": "2021-09-23T16:42:20.000Z",
          "Titre": "Really great service & fast shipping",
          "Contenu": "Really great service & fast shipping! I placed my order on a Wednesday afternoon and the package arrived via UPS the following Monday morning (I chose the free shipping option). The Kestrel unit is brand new with all documents & certification. I really appreciate the excellent service and will 100% shop with you again for my next weather equipment purchase!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Juerg Mumprecht",
          "Nb_Reviews": 1,
          "Date": "2021-08-23T09:47:13.000Z",
          "Titre": "part for a 10years+ anemometer",
          "Contenu": "Found spare part for a 10years old anemometer. I am still under way sailing but am confident to find the part after return home in my postbox... Glad to see companies like yours."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "KBM",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T10:44:13.000Z",
          "Titre": "Quickly and efficiently",
          "Contenu": "Both the purchase and delivery went smoothly.Vendor worth recommending. Everything quickly and efficiently. The shipment arrived after a week from the USA to Poland."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David G - Mercer Island WA",
          "Nb_Reviews": 2,
          "Date": "2020-12-27T03:57:24.000Z",
          "Titre": "Remarkably small and easy to use",
          "Contenu": "Remarkably small and easy to use.  Low startup friction, and once started seems to be responsive to 0.4ft/sec.  Not overwhelmed by high winds that overwhelm me.  Useful for my boating, & lab lab use too!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Gino",
          "Nb_Reviews": 1,
          "Date": "2022-05-28T08:13:17.000Z",
          "Titre": "Great customer service !",
          "Contenu": "Great customer service !Quick response on questions and fast shipment to Europe !These materials are the best !A very satisfied Belgian customer.. I'll be shopping with you again..Thanks !"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2020-05-14T18:01:27.000Z",
          "Titre": "Very Happy Customer",
          "Contenu": "I ordered my Hornady 5700 and weather vane meter and four days later it arrived. I opened it and found everything packed with with utmost care. I have yet to try it out as I am still learning how to calibrate and use the meter and set it up for my rifle and bullet loads that I will be using. Extreme Meters sent me a follow email asking if I was satisfied with my purchase and offered help if I needed it. I will not hesitate to order from here again!! Thank you Extreme Meters!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reginald Blackwell",
          "Nb_Reviews": 1,
          "Date": "2021-12-18T13:59:41.000Z",
          "Titre": "MikeM",
          "Contenu": "MikeM: at extreme meters gave me professional service. I had UPS lose my shipment. Mike shipped my replacement early to Ups. Customer service is alive at extreme meters."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B.A.",
          "Nb_Reviews": 1,
          "Date": "2020-06-06T16:41:41.000Z",
          "Titre": "Awesome Service!",
          "Contenu": "These guys went above and beyond to help me quickly when Kestrel (not Extrememeters) made a mistake.  Truly an excellent experience.  Shipping was quick too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heidi",
          "Nb_Reviews": 2,
          "Date": "2022-05-04T03:13:19.000Z",
          "Titre": "Excellent product and service",
          "Contenu": "I ordered the Kestrel 3550FW meter. Received email notifications reporting the progression of my order up to delivery, which was much quicker than I'd expected. Couldn't be more pleased with the product and service."
        },
        {
          "Note": 5,
          "Lieu": "IS",
          "Pseudo": "John snorri Sigurjonsson",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T05:55:16.000Z",
          "Titre": "I needed urgent for my K2 winter…",
          "Contenu": "I needed urgent for my K2 winter expedition. I was on the last min and needed the goods to be sent in Iceland. There chat online worked 100% and I was able to add on one extra peace even after I checkout. They send with UPS same day and I had the package 3 days later here in Iceland.ExtremeMeters works and has good service I recommend them Sincerely John Snorri"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John U.",
          "Nb_Reviews": 1,
          "Date": "2020-05-30T13:46:21.000Z",
          "Titre": "Excellence",
          "Contenu": "These people are amazing! The order was processed accurately and shipped lightning fast!  They are very responsive and deliver high quality products. I will definitely order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 5,
          "Date": "2020-10-25T23:37:47.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I was very pleased with the customer service received from ExtremeMeters.com.  They were very good at communicating with me about the product I purchased for my son.  Product was delivered as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-04-17T23:41:57.000Z",
          "Titre": "Perfectometer anemometer!",
          "Contenu": "Quick service and the PO police liked the address and didn't send it back, unlike two other packages from other vendors!Love the anemometer, just perfect, and a great price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L Vann",
          "Nb_Reviews": 7,
          "Date": "2021-01-31T22:45:17.000Z",
          "Titre": "Great Product and Website",
          "Contenu": "The website was easy to navigate and placing an order was effortless.  Shipping was extremely quick.  My order was in my mailbox before I knew it. I started to use the meter immediately; it is excellent for my needs."
        },
        {
          "Note": 5,
          "Lieu": "IS",
          "Pseudo": "Böðvar B Þorsteinsson",
          "Nb_Reviews": 2,
          "Date": "2021-07-26T16:27:09.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, quick postage without any problems, received my kestrel much sooner than expected. Works flawlessly, very satisfied with doong business with you, thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G$",
          "Nb_Reviews": 1,
          "Date": "2021-04-06T20:52:01.000Z",
          "Titre": "Satisfied Pilot",
          "Contenu": "Excellent from start to finish. Very involved with the customers and attentive to their needs. You can tell they work hard and take pride in what they do and truly value their customers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Perpall",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T21:19:18.000Z",
          "Titre": "What a Great way to run a Company",
          "Contenu": "Extreme Meters was the easiest of companies to work with. I went to their website and found exactly what part I needed and to my surprise the prices were extremely reasonable and they shipped it free. Not only that but the part showed up three days after ordering. What a great way to run a company. Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Scalf",
          "Nb_Reviews": 1,
          "Date": "2020-05-09T23:39:49.000Z",
          "Titre": "Exceeded expectations on a small…",
          "Contenu": "Exceeded expectations on a small purchase- seems to have a very high standard on customer service. The quality of the case for my kestrel 5700 which I purchased is very good as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JERRY INTERVAL",
          "Nb_Reviews": 5,
          "Date": "2021-02-03T01:33:40.000Z",
          "Titre": "PERFECT",
          "Contenu": "Everything went very smoothly during ordering.  Shipping was quick, love the wind gauge . I got the Kestrel model 1000 handheld used it the second I unpacked it. Seems to work perfectly very happy with the whole process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "charles m",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T20:06:13.000Z",
          "Titre": "Extreme Meters was very quick",
          "Contenu": "Extreme Meters was very quick in processing and shipping my order and they had the best price on the internet. My Kestrel weather meter is every bit as good as I had hoped for."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Michele",
          "Nb_Reviews": 7,
          "Date": "2021-12-12T20:42:12.000Z",
          "Titre": "Fast delivery to Switzerland",
          "Contenu": "I order from Switzerland and my good just arrived few days later... I recommend highly this site. Top prices and delivery time. thank you ExtremeMeters."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam N.",
          "Nb_Reviews": 1,
          "Date": "2021-03-17T21:58:57.000Z",
          "Titre": "Perfect!",
          "Contenu": "Quality pouch, fits both Kestrel and Sig Kilo 2400 BDX comfortably inside, as well as space for dope card and batteries."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bart Mcclellan",
          "Nb_Reviews": 4,
          "Date": "2020-04-26T07:45:13.000Z",
          "Titre": "2500 for long range shooting",
          "Contenu": "Shipping was very fast the meter seems to be a very accurate I am going to use it for long range shooting here in Wyoming were the wind blows from 10 to 40 mph on any given day hopefully the 2500 will help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tenderfoot",
          "Nb_Reviews": 1,
          "Date": "2021-03-06T23:47:16.000Z",
          "Titre": "Extreme meters provided fast shipping and quality product",
          "Contenu": "Extreme meters provided fast shipping and honored my veterans discount which was a bonus. I would recommend this company for anyone looking for quality products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Tillman",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T20:41:20.000Z",
          "Titre": "Good Price - Fast Shipping",
          "Contenu": "Good price on an item I couldn't find at other places!  Fast shipping with good communication about delivery ETA."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAMES A SCHULTE",
          "Nb_Reviews": 4,
          "Date": "2020-10-30T21:24:39.000Z",
          "Titre": "I bought a used Kestrel 2000 from an…",
          "Contenu": "I bought a used Kestrel 2000 from an eBay seller. It looks new and works great but the battery cover tabs were broken. I found ExtremeMeters when I searched for Kestrel battery covers. I purchased two for a great price and they arrived quickly. Thank you, ExtremeMeters!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Beech",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T20:52:21.000Z",
          "Titre": "My order arrived quickly and in perfect…",
          "Contenu": "My order arrived quickly and in perfect condition. Documents and the requested part were professionally packed. The part was a perfect replacement. Wish I had ordered sooner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T16:43:28.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Mike was very quick to respond to my phone message and went out of his way to make sure I could make my purchase of our wet bulbs.  We haven't used them yet, however, they were delivered quickly and look to be in all in order and ready to use!!  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nephi Richardson",
          "Nb_Reviews": 2,
          "Date": "2020-04-23T23:12:57.000Z",
          "Titre": "Great meter…",
          "Contenu": "I love being able to get my wind data right there in the field. Like today, I wanted to do reverse launches on my Paramotor wing with my handy meter I was able to get a wind speed and change my flight plans on the ground"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robby Walth",
          "Nb_Reviews": 1,
          "Date": "2021-05-02T04:12:57.000Z",
          "Titre": "This kestrel works great",
          "Contenu": "This kestrel works great.  The shipping was very fast.  If I need another one I will definitely be coming back to extreme meters to purchase one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Old retired guy",
          "Nb_Reviews": 1,
          "Date": "2021-05-07T15:14:45.000Z",
          "Titre": "Firefighter model",
          "Contenu": "If you’re a firefighter this is the model you want. It provides all the info to make informed decisions on current fire weather."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TX Biker",
          "Nb_Reviews": 1,
          "Date": "2020-05-17T19:44:45.000Z",
          "Titre": "Excellent vendor",
          "Contenu": "Quick and efficient shipping.  Good job packing and getting it out the door. This is my first purchase, and I’m favorably impressed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D T",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T23:32:59.000Z",
          "Titre": "I was surprised I found the Kestrel…",
          "Contenu": "I was surprised I found the Kestrel part I needed and that it was somewhat reasonably priced."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JENNELLE",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T15:15:18.000Z",
          "Titre": "Received my item super fast and the…",
          "Contenu": "Received my item super fast and the light is perfect for what I needed and it was even better that Extreme offered a military discount"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RALPH RIGG",
          "Nb_Reviews": 1,
          "Date": "2020-03-19T21:17:09.000Z",
          "Titre": "GREAT SMALL HAND HELD METER FOR THE…",
          "Contenu": "GREAT SMALL HAND HELD METER FOR THE FIELD!!Works GREAT and easy to use and store.I am a RC pilot and use it at the flying field for accurate wind condition for flying.Would highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arlyn Midtgaard",
          "Nb_Reviews": 1,
          "Date": "2020-06-29T14:08:48.000Z",
          "Titre": "Kestrel 3000",
          "Contenu": "The service was prompt and cordial.  The Kestrel is used to measure wind velocity and temperature when applying pesticides for agriculture crop production.  It is also used to measure weather conditions for livestock comfort."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neal Bushnell",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T03:18:45.000Z",
          "Titre": "Easy to understand available products…",
          "Contenu": "Easy to understand available products (model and color) to get what I wanted. Good price. Fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Lance",
          "Nb_Reviews": 5,
          "Date": "2020-06-22T19:13:22.000Z",
          "Titre": "Kestrel pouch",
          "Contenu": "Very well made product, delivery a bit slow probably due to Covid but still arrived worth the wait👍👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Hendren",
          "Nb_Reviews": 1,
          "Date": "2022-02-12T19:22:17.000Z",
          "Titre": "Works great!",
          "Contenu": "Works great!Just as advertised … easy to setup.  In very cold weather, keep extra batteries on hand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David D.",
          "Nb_Reviews": 1,
          "Date": "2020-10-01T02:48:46.000Z",
          "Titre": "Quick service - Fair price",
          "Contenu": "Quick service, free shipping, and the item was exactly as described.  I really appreciated being able to purchase a replacement battery cover for my meter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Bock",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T18:59:27.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service! Replied almost instantly to a change i requested to my order via email. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David Sommerville",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T18:50:19.000Z",
          "Titre": "Prompt and courteous service by…",
          "Contenu": "Prompt and courteous service by technician Dave. Delivered on time. Product performance meets and exceeds expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry Vance",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T03:42:46.000Z",
          "Titre": "Received item a day before the promised…",
          "Contenu": "Received item a day before the promised date. All items were packed perfectly and arrived in perfect shape.  when needed i  will order from you again. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Martin",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T18:50:26.000Z",
          "Titre": "Quick delivery",
          "Contenu": "Quick delivery, good price and way cheaper than other vendors I found selling the same product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Munis",
          "Nb_Reviews": 4,
          "Date": "2021-07-31T11:19:12.000Z",
          "Titre": "Great experience!",
          "Contenu": "Very pleasant to work with. Will gladly do future business with Extreme Meters. Highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Miles",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T20:52:12.000Z",
          "Titre": "Very light weight instrument.",
          "Contenu": "Very light weight, handy instrument. Great source for potentially life saving information in the field!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-02-14T20:20:13.000Z",
          "Titre": "kestrel 5500 great product and a great…",
          "Contenu": "kestrel 5500 great product and a great price, along with fast shipping and the Shop app didn’t hurt…outstanding!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROBERT HIGGINSON",
          "Nb_Reviews": 3,
          "Date": "2021-08-12T19:10:39.000Z",
          "Titre": "Happy to find this!",
          "Contenu": "Bought more Petzl. (They're awesome!) Service as promised. Good Website! Fair pricing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Barnabee",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T19:36:37.000Z",
          "Titre": "The professionalism that made this…",
          "Contenu": "The professionalism that made this purchase easy for me and the speed of delivery were things to behold given the hurdles one must leap to make an on-line purchase"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Juan",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T07:47:28.000Z",
          "Titre": "You can trust them.",
          "Contenu": "The product arrived in perfect condition, It works great. The shipment to Spain was really fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Sproule",
          "Nb_Reviews": 4,
          "Date": "2022-11-22T03:08:58.000Z",
          "Titre": "Item was as described",
          "Contenu": "Item was as described.  Fit like OEM.  Original battery cover wings broke and could not be glued back on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitch Mahana",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T17:24:38.000Z",
          "Titre": "You were quick to get the order…",
          "Contenu": "You were quick to get the order processed and on its way to me. The description was thorough and easy to understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Butler",
          "Nb_Reviews": 8,
          "Date": "2020-05-15T22:09:22.000Z",
          "Titre": "Extreme Meters great all around experience",
          "Contenu": "Extreme Meters had great prices, super efficient service and my purchase shipped without delay."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Hawkins",
          "Nb_Reviews": 1,
          "Date": "2021-02-06T21:29:07.000Z",
          "Titre": "Weather back east delayed shipment but…",
          "Contenu": "Weather back east delayed shipment but arrived in good condition and put to use.Everything as ordered"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Schwarz",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T03:41:23.000Z",
          "Titre": "Impressed!",
          "Contenu": "Pleased with the battery cover, extremely happy with the shipping time. I figured it would take a week or more. Ordered on Friday, got it Monday."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Higgerson",
          "Nb_Reviews": 2,
          "Date": "2021-01-16T03:58:24.000Z",
          "Titre": "Extreme Meters is very professional.",
          "Contenu": "Extreme Meters is very professional.. they’re service really shines, tracking # and quick service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dave Merritt",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T03:24:49.000Z",
          "Titre": "Great products and service thanks a ton…",
          "Contenu": "Great products and service thanks a ton got my weather station working again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank  Whitbeck",
          "Nb_Reviews": 4,
          "Date": "2021-03-14T18:04:52.000Z",
          "Titre": "Should be 10 stars...",
          "Contenu": "Wish I could give ExtremeMeters.com 10 stars. The discount code from GovX saved me 10% on the meter, and I will save later on other purchases. I would not have known about GovX had it not been for EM...So, thanks, guys"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jeff  Hemming",
          "Nb_Reviews": 1,
          "Date": "2021-04-08T16:06:48.000Z",
          "Titre": "Smooth, easy and effective!",
          "Contenu": "Super easy ordering process, had the part that I needed, good price and quick shipping.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Browne",
          "Nb_Reviews": 2,
          "Date": "2020-12-15T12:50:04.000Z",
          "Titre": "Great service and communication",
          "Contenu": "Great service and communication!  Shipped fast!  Will do business with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 3,
          "Date": "2022-06-19T22:23:13.000Z",
          "Titre": "Prompt shipping, great price",
          "Contenu": "Prompt shipping at a very competitive price… will certainly consider this company in future needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Bailey",
          "Nb_Reviews": 1,
          "Date": "2021-04-19T02:33:13.000Z",
          "Titre": "I have had a Kestrel 4000 for a long…",
          "Contenu": "I have had a Kestrel 4000 for a long time.  Looking at your web site found the Kestrel 5500 would suit me much better.It works great and is with me all the time.I also use them fishing.  Knowing what the wind speed is very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GENE SNYDER",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T19:52:52.000Z",
          "Titre": "Very easy to find the replacement part…",
          "Contenu": "Very easy to find the replacement part that i needed.Price was very good and free shipping an added bonus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 9,
          "Date": "2021-01-16T23:50:21.000Z",
          "Titre": "My item arrived in great condition and…",
          "Contenu": "My item arrived in great condition and I love it! It works well- I am looking forward to using it. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LonestarR",
          "Nb_Reviews": 2,
          "Date": "2021-09-01T17:32:56.000Z",
          "Titre": "Perfect fit and excellent price",
          "Contenu": "Perfect fit and excellent price. Shipping was faster than expected. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TBenefiel",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T17:22:36.000Z",
          "Titre": "Fast and excellent service",
          "Contenu": "Fast and excellent service. Received our order within five days. Highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Margaret",
          "Nb_Reviews": 2,
          "Date": "2022-05-06T22:05:26.000Z",
          "Titre": "Great product - thanks for carrying it!",
          "Contenu": "Great product, unique find that I had not seen anywhere else. Shipping was prompt and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Coakley",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T00:41:42.000Z",
          "Titre": "Super service",
          "Contenu": "Super service! Received exactly what I ordered and got it when promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cristopher Morrow",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T22:50:40.000Z",
          "Titre": "Great!",
          "Contenu": "Fast shipping, super easy! Product was as described"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dayna",
          "Nb_Reviews": 1,
          "Date": "2020-06-20T20:16:14.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, easy exchange with quick response to emails.  Awesome product."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Salvatore Arena",
          "Nb_Reviews": 2,
          "Date": "2022-05-22T19:34:27.000Z",
          "Titre": "Great Service",
          "Contenu": "Great Service, also when ordering from Europe! Delivery in time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billy Cocheran",
          "Nb_Reviews": 2,
          "Date": "2023-04-27T16:41:16.000Z",
          "Titre": "order was easy to place",
          "Contenu": "order was easy to place, recieved order in a timely manner"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nicolas Pedneault",
          "Nb_Reviews": 2,
          "Date": "2022-10-01T15:12:03.000Z",
          "Titre": "I ordered a battery for my Petzl",
          "Contenu": "I ordered a battery for my Petzl. It was the right product and it worked. Mission accomplished!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily S",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T03:24:30.000Z",
          "Titre": "Got exactly the part I needed",
          "Contenu": "Got exactly the part I needed! The part was packaged well and shipped quickly, and for a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sanctuary Forest",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T18:17:47.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, fair price and meter is user-friendly and accurate!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Matt Alderuccio",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T00:16:25.000Z",
          "Titre": "great prices & super fast shipping.",
          "Contenu": "great prices & super fast shipping.7 days to Australia. fantastic 👌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susie",
          "Nb_Reviews": 2,
          "Date": "2023-02-02T01:20:40.000Z",
          "Titre": "The real deal no fuss no muss",
          "Contenu": "Easy to order, just what I needed, arrived early, no problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy Rounsavall",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T00:12:05.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, got our order shipped right away!"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Horst Pichlmüller",
          "Nb_Reviews": 1,
          "Date": "2020-06-21T18:26:34.000Z",
          "Titre": "first shipment did not arrive",
          "Contenu": "first shipment did not arrive, second shipment worked perfect-thank you!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse Lang",
          "Nb_Reviews": 2,
          "Date": "2020-07-06T19:27:06.000Z",
          "Titre": "Had items in stock with quick shipping",
          "Contenu": "Had items in stock with quick shipping.  Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 1,
          "Date": "2021-02-06T17:18:27.000Z",
          "Titre": "Great Service & fast shipping",
          "Contenu": "Very happy with my order. Good pricing, fast shipping no problems. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert M",
          "Nb_Reviews": 1,
          "Date": "2020-04-23T19:27:49.000Z",
          "Titre": "Very happy with Extrememeter",
          "Contenu": "Very happy with Extrememeter. Fast delivery, what I wanted in stock."
        }
      ]
    }
  ]
}