{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "facilitron.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jorge Machado not me",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T19:04:53.000Z",
          "Titre": "Executive Director",
          "Contenu": "Well, so many things that I cannot list them all.  Notably, zero starts was not an option.  Additionally, I am not Jorge Machado.  A software company that cannot manage a simple mail merge is emblematic of how bad this software is."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick Amoroso",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T22:19:10.000Z",
          "Titre": "This site is the worst they do not refund when reservation is declined",
          "Contenu": "This site is the worst. calendars are not up to day and to request to book you are charged 25%. When the reservation is declined because field is already in use you do no receive a refund at all.  You have to fill out a special request form for the refund and then wait for it to be approved. DO NOT USE THIS SITE I HAVE $1000 in deposits being held for all reservtion request that were declined do to location already being booked"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracy Preslar",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T01:47:13.000Z",
          "Titre": "Date showed as available when unavailable. Charged for services I never received.",
          "Contenu": "I tried to make a reservation for renting a space. The software was fine. The UI was a bit confusing, but I was able to navigate it in the end. My request went through, and was rejected by the facility manager almost within 30 minutes, because it was being used for an internal event. My card was still charged for > $200, even though the space wasn't available in the first place. How can your design of your service be so unintuitive that you charge for services that the customer never receives? Why is that even a possibility in the software? Shouldn't the customer be charged AFTER the reservation request is approved? I want my money back, and I don't want to use Facilitron again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy Sylvester",
          "Nb_Reviews": 1,
          "Date": "2019-10-07T03:14:52.000Z",
          "Titre": "it showed the date available on your…",
          "Contenu": "it showed the date available on your calendar. I answered many, many questions which for a layperson were very confusing. It would be nice for there to be more explanation as to what some of the terms meant. The whole process took me more than 30 minutes to complete the application. Imagine my surprise to receive a message that it was declined because the facility is unavailable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dolma Cat",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T23:58:50.000Z",
          "Titre": "Really kind of garbage unless you…",
          "Contenu": "Really kind of garbage unless you already know the exact space you are renting. I was looking for a certain sized space and they don't list that, just \"capacity\" which really depends on what you are using it for. The \"capacities\" were wrong. There is only a small photo to go by. If the space is in a school, forget about getting any kind of answers or help. An absolute waste of time and money for us."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stan Chase",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T05:44:57.000Z",
          "Titre": "This is a joke",
          "Contenu": "This is a joke. We spent so much time trying to get a venue and we're told that they had previous arrangements.  How did you not know that facilitron? They are the worst!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela McDougall",
          "Nb_Reviews": 1,
          "Date": "2019-10-07T15:08:31.000Z",
          "Titre": "Showed facility as available",
          "Contenu": "Showed facility as available, then made deposit and not available. Then took 3 weeks for refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Troy DeVincentis",
          "Nb_Reviews": 1,
          "Date": "2019-08-02T18:04:17.000Z",
          "Titre": "This is a great money making scam!",
          "Contenu": "You rent field and they are not playable. Have to pay a fee just to see if a field is rent-able,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marissa Duque",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T19:28:46.000Z",
          "Titre": "Facilitron freezes",
          "Contenu": "Facilitron freezes; constantly. It's extremely frustrating when I am trying to enter a reservation, and it freezes. I am unable to cancel, close out, or refresh. It can freeze for several minutes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "School District User",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T19:05:37.000Z",
          "Titre": "This system does not allow our district…",
          "Contenu": "This system does not allow our district autonomy. We can't change the name of a facility or change the capacity without getting approval from our Facilitron rep. We cannot modify our fee schedule easily or adjust permissions in a more dynamic way. This is a terribly inefficient way for us to run business. Facilitron is rigid and not user-friendly. I do like that it is web-based and allows everyone to be on the same page (so to speak) when it comes to scheduling. I would like to see a text option to push text messages to renters, because sometimes people are hard to reach via e-mail or by calling."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Kier",
          "Nb_Reviews": 1,
          "Date": "2019-10-08T00:46:27.000Z",
          "Titre": "Not ready for schools or organizations..",
          "Contenu": "It was easy to fill out reservation, but it has been an absolute beast getting approvals and feedback from the schools.  Because it was not ready when promised, the school we had agreed with double booked 2 clubs.  We had to then find a new school, plus schools that did not approve never stated comments. When schools were contacted directly, they voiced problems on their end also."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelly Martin",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T20:37:49.000Z",
          "Titre": "you got my name wrong!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fruitville",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T19:18:06.000Z",
          "Titre": "The ability to add events to calendar…",
          "Contenu": "The ability to add events to calendar is easy however to make changes is impossible and there really isn't an easy way to make sure \"Work Orders\" have been received. Would really not prefer to us Facilitron...not user friendly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Iris Ataee",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T07:55:41.000Z",
          "Titre": "Unclear policies, one district has non-refundable fees for request/cancellation",
          "Contenu": "No success.  No guarantees.Sat March 4 placed request for school cafeteria (paid 25% deposit). Sun March 5, cancel 1st request to place request on an alternate school location (paid 30% deposit).  Facilitron did not fully refund the first deposit. Kept $50 for facility and $11.70 for processing fee!!! Really?  Not like I wasted their time considering/approving.  Very unfair. Chat person says it’s the renter’s policy.After 11 days, 2nd facility has not responded. We went in person 3/13 and spoke to principal and called and emailed the school’s chief business officer 3/15 who was good to reply same day they will decline.  No reason given.  Principal did mention needing to hire custodian. But they haven’t yet decline on Facilitron.This was for 1) FUHSD 2) MVWSD in Bayarea. We are still scrambling to find an affordable venue after waiting 10+ days.Update 3/16/23:Facilitron said FUHSD's policy is that every transaction has non-refundable $50.MVWSD will issue full-refund if I cancel.Refund is not automatic and must be submitted manually.  This is not apparent either.  So even though I cancelled 3/5, I was supposed to request refund manually.But the chat person was helpful and processed the 2 cancellations for me for refund.  She also cancelled the 2nd request because by now I am a little distrustful.So I'm increasing the 1 star to 2 stars.The price for rental is good, if it worked, but there is no certainty.  School reserves the right to cancel anytime.3/30 update. Facilitron refunded full amount which I’m grateful. We ended up going with a private venue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim Singer",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T17:57:52.000Z",
          "Titre": "New entries need to be flaged somehow…",
          "Contenu": "New entries need to be flaged somehow so I don't need to look at the whole list to give my thumbs up or down."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sid Ward",
          "Nb_Reviews": 1,
          "Date": "2020-03-03T00:21:38.000Z",
          "Titre": "Change is impossible.",
          "Contenu": "I tried to make a change and could not. Then when I talked with the chat line, they couldn’t make the change either."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy Yu",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T22:19:29.000Z",
          "Titre": "I would like a time commitment…",
          "Contenu": "I would like a time commitment guarantee of a response from a site. If the site does not respond to a request and the requested permit passes, then the cost to submit that request should be waived. Also, if a refund is given by Facilitron, I would like Facilitron to ask me where to refund the money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tommy Maloney",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T18:59:43.000Z",
          "Titre": "I works",
          "Contenu": "I find the proram fairly easy to use.  But my school staff always struggles to create reservations. The programming isn't the most intuative.  Staff has to find the dashboard, then the calendar, click events, and remember to set the date (It defaults to whatever the current first calendar date is).  I also recently learned that internal comments can be seen by any internal user (all 250 users at my site) and that all internal users can view and comment on any internal request.  I was always under the impression that internal comments were for facilitron and site administrators.  I also figured users only had access to their own reservations.  Overall it works, but its not the easiest platform to use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda  Garcia",
          "Nb_Reviews": 1,
          "Date": "2020-03-02T22:29:08.000Z",
          "Titre": "As a frequent user (I use facilitron…",
          "Contenu": "As a frequent user (I use facilitron every week day), I would rate the website as average. I have been using the site for the last six months and I understand there may be more I need to learn with regard to its features.  I also understand that my settings may be limited to my authorizations.  It would be very helpful if reservations could be located by a search (reservation number, reservation holder, event title, specific date, etc...).  That would make my job so much easier.  On the other hand, I like the calendar vs. agenda feature."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nancy Philbrick",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T17:54:21.000Z",
          "Titre": "Good reservation software with some issues.",
          "Contenu": "I like how requests for different rooms can be in a different color. I also like that the renter or sponsor initiates the request. Unfortunately, I've had some issues with the agenda view dropping off some information and dropping a whole event when unchecking view details. It would be nice if internal users could see the conflicts on the reservation home page as an approver does, so they can't ignore that there are conflicts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Josie",
          "Nb_Reviews": 1,
          "Date": "2019-10-01T19:28:24.000Z",
          "Titre": "I would like we can change colors for…",
          "Contenu": "I would like we can change colors for the meetings. Everything is so gray/dark gray and it's so hard to differentiate each meeting when you are in a hurry. For example if we have a red color for business conference room meetings, blue for superintendents conference room meetings, green for the board room conference room meeting, etc. it will be easier when you are in a hurry looking for what is scheduled on the calendar for the day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SP",
          "Nb_Reviews": 1,
          "Date": "2019-09-23T16:22:25.000Z",
          "Titre": "Reserving a room",
          "Contenu": "I would prefer to initially select the facilities I want to view rather than unselect all of them, the select the ones I want to see. Also, often-times when a room is reserved, let's say from 1:00PM-2:00PM, the system will not allow the same room to be booked from 12:30PM-1:00PM. It has to be booked from 12:30PM-12:55PM."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carmen Allen",
          "Nb_Reviews": 1,
          "Date": "2019-08-02T19:20:44.000Z",
          "Titre": "The technology is awesome but...",
          "Contenu": "The technology is awesome but!  it is the response when you are denied that is frustrating. We try to put in several dates and times and do not know why we are denied. if there is a better date and time. What is available? I asked and got a response that the staff and children was the focus of the staff as resources in this building  I UNDERSTAND, But why show the building as available on Facilitron. Go through the process of application and they will never approve an event?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Napa Toastmasters",
          "Nb_Reviews": 1,
          "Date": "2019-09-30T15:55:22.000Z",
          "Titre": "I do like the service",
          "Contenu": "I do like the service.  It is generally east to navigate the website.  I found in searching for a particular type of venue it would bring me back to the main page and start the search process from the beginning."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rosita Bagheri",
          "Nb_Reviews": 1,
          "Date": "2019-08-02T22:42:31.000Z",
          "Titre": "The comments placed on your site by the…",
          "Contenu": "The comments placed on your site by the facility or the renting group is not always monitored or responded to. Your automated invoice reminder bypasses any comments or changes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mara Clauson",
          "Nb_Reviews": 1,
          "Date": "2019-10-01T16:11:13.000Z",
          "Titre": "Program does primary function but needs integration update",
          "Contenu": "Program does primary function, and that is to schedule events and the facility needs request associated with the event.  Being in athletics, each event involves more than one room/space.  For example, game night not only includes gymnasium, but locker rooms, coaches' offices and Training rooms.  Inputting for such an event is cumbersome when involving multiple rooms especially if a day or time needs to be modify.  Also, the calendar does not integrate with our building calendar or staff outlook calendars, therefore, I have to input same information in multiple places in order for the event information from facilitron to be available for coaches, parents and public viewing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim Giordano",
          "Nb_Reviews": 1,
          "Date": "2020-03-04T21:25:51.000Z",
          "Titre": "Really disappointed that we can no…",
          "Contenu": "Really disappointed that we can no longer fully manage our users and workers accounts ever since the transition took place!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jevie Buck",
          "Nb_Reviews": 1,
          "Date": "2020-03-02T22:46:57.000Z",
          "Titre": "Santa Maria High School Plant Manager…",
          "Contenu": "Santa Maria High School Plant Manager Secretary's Review:The website has helped lessen physical paperwork and approval process time. I don't mind the 1,939 Faciltron generated emails so far as I've set them to archive after 3 months. Many first and second time Internal users seem to need assistance with the website interface when creating reservations and often need a step by step walk-thru via email, phone, or in person to place their requests. I don't mind walking them through but I thought I'd mention it at this opportunity.I do not have that option to cancel a whole reservation so if an approved reservation user asks to cancel, I ask the user to make the cancellation themselves or have them or myself create a comment to have my Manager or Sophie and the Facilitron Team do so. The key is keeping the conversation in the Facilitron comments section and not in my emails or voicemails.We use the iCal on our interactive display panel instead of the HTML so that we can click on the daily view. It isn't as detailed as the Google Calendar view, the Google Calendar has a nice way of scrolling through events as they happen and have coordinating icons for the type of facility such as soccer balls for the Stadium and basketballs for Gym reservations."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2019-10-01T15:09:17.000Z",
          "Titre": "Not bad, needs some work",
          "Contenu": "Overall, the experience and convenience were nice; however, not all facilities are available to reserve i.e. Professional Development Center and once the alternate reservation was confirmed, the school didn't actually know where the meeting would take place so we scrambled around to find an appropriate room."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denese Vandervoort",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T19:08:17.000Z",
          "Titre": "There are multiple detail issues that…",
          "Contenu": "There are multiple detail issues that have caused me more work than I had before Facilitron, but Facilitron has not been forthcoming with a resolution that works for my District."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fred McDonald",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T20:34:36.000Z",
          "Titre": "To maney times events show up 1 day…",
          "Contenu": "To maney times events show up 1 day before we need to work. Or we have groups that even show up. Overall it's good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yovi Murrillo",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T16:29:35.000Z",
          "Titre": "Facilitron does nothing to make my job…",
          "Contenu": "Facilitron does nothing to make my job easier."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kyle Kegley",
          "Nb_Reviews": 1,
          "Date": "2019-08-10T18:38:47.000Z",
          "Titre": "Transfer to Google.",
          "Contenu": "That's the thing, it doesn't transfer over to Google either."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grant Steunenberg",
          "Nb_Reviews": 1,
          "Date": "2019-07-08T17:20:45.000Z",
          "Titre": "Facilitron review",
          "Contenu": "Facilitron has helped our site better manage our facility rentals."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barbara Turner",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T16:17:20.000Z",
          "Titre": "System is acceptable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Sinnachcharige",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:45:47.000Z",
          "Titre": "I appreciate the support of my two…",
          "Contenu": "I appreciate the support of my two account reps.  They are very responsive to all my requests."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jolene Miller",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T20:38:55.000Z",
          "Titre": "Facilitron has really helped our District",
          "Contenu": "Facilitron has really helped our District out in regards to keeping track of events on our campuses. There are issues, however, that arise from time to time. Insurance is the main issue. Sometimes renters upload insurance docs in the Document section and the certificates go unnoticed. Sometimes vendors need to acquire \"day of\" insurance from Facilitron, and to do so becomes problematic. Insurance verifiers vary in consistency, sometimes verifying a certificate and sometimes not."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laura Hernandez",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T20:48:38.000Z",
          "Titre": "I believe it was a step in the right…",
          "Contenu": "I believe it was a step in the right direction for our particular district. We just need a little more hand-holding in the right direction in order to get the full benefits Facilitron can offer us.I also believe there are some things that Fcailitron can do to make the program a little more user-friendly and less clicking to help with the user's wear and tear."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jannie Vickers",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T14:08:59.000Z",
          "Titre": "I never feel alone",
          "Contenu": "I never feel aloneIt sometimes becomes overwhelming with the amount of rentals and teacher schedules that we have and it's nice to know I can send an email and I get a quick response,  help and or even suggestions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deb Conner",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T16:58:30.000Z",
          "Titre": "Needs to be more user friendly",
          "Contenu": "Facilitron is great but could be a little bit more user friendly, at least from the standpoint of an approver like myself.  Also I have to enter reservations for school functions so that we are sure to have adequate climate control (A/C or Heat) in the classrooms or other areas that we might be using.  It would be nice it this process was easier and clearer to use.  Other than that Facilitron has been easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Notmeyer",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T16:40:00.000Z",
          "Titre": "So far it has been pretty good",
          "Contenu": "So far it has been pretty good.  There are a few items we want to update but we have already spoken with our Facilitron Account Rep and he is working on them.Our Account Rep is awesome in getting back to me in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat Yu",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T16:34:57.000Z",
          "Titre": "The request forms are not complete…",
          "Contenu": "The request forms are not complete enough.  There should be an area that tells renters what they can and cannot do/use on our campuses.  I am constantly having to tell the renters that something is not allowed and/or unavailable for use.  Maybe there is but I don't see it so I don't know what they know and don't know.  Maybe a check box would help that they have seen the rules and acknowldge them.  Otherwise the program works very well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Penny M.",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T15:38:03.000Z",
          "Titre": "Easy to Navigate!",
          "Contenu": "So much is easy to navigate with Facilitron! I enter a LOT of things on a consistent basis and it has made my job much easier!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victoria Daniels",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T15:59:18.000Z",
          "Titre": "The system is easy to use",
          "Contenu": "The system is easy to use, and I like the commuunication format, it seems to work pretty well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Ayres",
          "Nb_Reviews": 1,
          "Date": "2019-10-02T14:09:25.000Z",
          "Titre": "works great",
          "Contenu": "works great. Needs easier access for changing room numbers tho"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Thome",
          "Nb_Reviews": 2,
          "Date": "2019-08-02T18:06:16.000Z",
          "Titre": "Excellent support",
          "Contenu": "Excellent support. Easy to use. Would like them to stretch for a few more features."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Casey Duffey",
          "Nb_Reviews": 1,
          "Date": "2019-07-16T14:25:38.000Z",
          "Titre": "Facilitron has worked well for us."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RB",
          "Nb_Reviews": 1,
          "Date": "2019-10-10T15:56:26.000Z",
          "Titre": "Very easy to use!",
          "Contenu": "Very easy to use. Message feature works great as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Addaire Faulk",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T17:12:03.000Z",
          "Titre": "It is easy to navigate",
          "Contenu": "It is easy to navigate.  Easy to read."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Cervantes",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T15:36:40.000Z",
          "Titre": "Brittany our Facilitron rep is so…",
          "Contenu": "Brittany our Facilitron rep is so awesome, helpful and knowledgeable.  The features in Facilitron are also very helpful for managing school district work orders, from inception to completion, and everything in between."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Los Alamitos USD Facilities",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T19:56:58.000Z",
          "Titre": "The Facilitron Team is always helpful!",
          "Contenu": "The Facilitron Team is always extremely helpful, and they are always very prompt with their responses and resolution of conflicts or issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Hernandez",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T19:35:14.000Z",
          "Titre": "Cheryl is a star in my book!",
          "Contenu": "Cheryl has made my job so much easier. She has taught me so much in the Facilitron program. She is very helpful and answers her phone regularly as well as answers emails efficiently. The team has been great but Cherly always goes the extra mile and makes sure I'm understanding without making me feel dumb. Our district has benefited from our move to Facilitron and having people like Cheryl and Teault on our team is icing on the cake."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole Gray",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T17:14:05.000Z",
          "Titre": "Lee Pintar is the BEST!",
          "Contenu": "I have been working with Lee Pintar on several different issues over the past two years.  I am so thankful to have someone I can email or call when I have a question or need assistance.  He makes every experience a good one and will explain everything in a way I can understand. And the response time is always quick. I am grateful to know he really cares about his customers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Genyne Vinson",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T20:23:29.000Z",
          "Titre": "Great experience!",
          "Contenu": "My experience is great because of the customer service provided and the willingness to not just be a vendor but a partner in providing real time solutions to issues or needs that come up along the way. Also not to mention the user friendliness of the tool!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paige L",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T19:00:08.000Z",
          "Titre": "The customer service is top notch",
          "Contenu": "The customer service is top notch! I get frustrated with how I find my own school facilities -- It is not as easy as it could be, but I have to remember that I may be an atypical customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T21:01:40.000Z",
          "Titre": "Your online service is VERY user friendly",
          "Contenu": "Your online service is VERY user friendly and when I need to call, I ALWAYS am able to talk to a live person who is understanding and more than helpful. Keep up the great work!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maryann M.",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T20:47:28.000Z",
          "Titre": "A very successful transition to Facilitron!",
          "Contenu": "We have been using Facilitron for just over a year now, and it helps make us so much more efficient. The customer service is top notch and always prompt. This program has shifted a lot of the work of facility use from my desk to Facilitron, freeing me up to work on other projects."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cory Scogin",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T21:22:03.000Z",
          "Titre": "High Five Facilitron",
          "Contenu": "Our Representative Teault is always so responsive and the team on the backend addresses requests quickly. Thank you and keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike K",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T17:31:22.000Z",
          "Titre": "This product is amazing",
          "Contenu": "This product is amazing - a true time saver for both renters and facility administrators.  Easy to use, keeps all info in one place - payments, communications, changes, etc.  Nothing comes close."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Los Alamitos USD Facilities",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T19:05:48.000Z",
          "Titre": "The Facilitron platform is so easy to use!",
          "Contenu": "The Facilitron platform is so easy to use. It is extremely helpful to be able to refer renters to the Facilitron website because it actually has everything they need. On the administrative side, we can easily obtain reports, maintain calendars with several sites, and correspond with renters and customer service directly on a reservation. In addition to this, the customer service team is wonderful and very responsive. Grace Vote, our account manager, has been BEYOND helpful. She has been able to give me training and tips on using the Facilitron platform to streamline my job and make it easier. I think that Facilitron is always evolving, and they are always looking for ways to make things better for renters and administrators. I would highly recommend this platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Arndt",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T22:35:24.000Z",
          "Titre": "Brittany Rocks",
          "Contenu": "Brittany Rocks!  Every question is quickly answered.  Brittany and all of the staff are always on hand to help resolve any questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra C.",
          "Nb_Reviews": 1,
          "Date": "2019-10-01T16:45:42.000Z",
          "Titre": "Far Better than School Dude",
          "Contenu": "As a renter, we appreciate the all-in-one booking and editing of Facilitron. It's really easy to request changes when needed. Billing, reservation details and communication with the school are kept organized under the actual reservation. It is must easier to use than the previous platform our school district used. We're glad they chose Facilitron."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheilah  Kimble",
          "Nb_Reviews": 2,
          "Date": "2019-09-30T14:11:03.000Z",
          "Titre": "Sharing the love.",
          "Contenu": "I have a couple of business partners who have utilized your services and have shared how pleased they were. Because of such high praises and recommendations, I too decided to utilize your services and look forward to working with you in the near future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gloria Alamir",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T18:51:40.000Z",
          "Titre": "The system is easy to navigate and the…",
          "Contenu": "The system is easy to navigate and the Facilitron team responds quickly to my requests."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delana Romero",
          "Nb_Reviews": 1,
          "Date": "2019-07-08T20:37:27.000Z",
          "Titre": "Facilitron is responsive to both our…",
          "Contenu": "Facilitron is responsive to both our needs as well as the requests of the renters. Communication is very good. Switching to Facilitron has eliminated the occasional double booking, saved time and energy on our end as they handle the billing, change requests, collecting ins requirements, etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaShawn Dickerson",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T16:26:53.000Z",
          "Titre": "I really like working on Facilitron",
          "Contenu": "I really like working on Facilitron, it's much easier than when we used the paper form.  I am able to look up stuff quickly an approve in an efficient way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Pascual",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T04:18:47.000Z",
          "Titre": "Running reports",
          "Contenu": "Facility reservation is online instead of manually done (paper). This includes billing which takes a lot of time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isha J",
          "Nb_Reviews": 1,
          "Date": "2019-11-18T19:15:01.000Z",
          "Titre": "Facilitron is a nice portal to look for…",
          "Contenu": "Facilitron is a nice portal to look for venues. The photos gives an idea how the rental space is.The support team was very helpful with the queries we had and resolved them efficiently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl Galloway GUSD",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T17:07:19.000Z",
          "Titre": "Fiscal help is on the way!",
          "Contenu": "Facilitron has enabled me to get all facilities billing, non-profit status and insurance verification, and collections off my plate. They handle everything and my accounting department and auditors are thrilled with the clear tracking and process. Renters also appreciate being able to pay with a credit card on line."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Wilson",
          "Nb_Reviews": 1,
          "Date": "2019-07-08T17:10:15.000Z",
          "Titre": "Facilitron is so helpful to our school…",
          "Contenu": "Facilitron is so helpful to our school district. They save a lot of staff time here. Their customer service is excellent. I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delaine Bender",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T02:04:05.000Z",
          "Titre": "Responsive",
          "Contenu": "Facilitron staff are very helpful and responsive to our needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hugo Castaneda",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T18:19:27.000Z",
          "Titre": "I like it",
          "Contenu": "I like it , it helps alot on all events and let's us know days and times of every event that happens on our site , Thank Facilitron"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Tedder",
          "Nb_Reviews": 1,
          "Date": "2019-09-20T17:26:52.000Z",
          "Titre": "Facilitron has transformed how we…",
          "Contenu": "Facilitron has transformed how we handle facility reservations. It gives us tools to better manage our sites and great communication between our sites and the renters. Everyone we have dealt with from the beginning to now at Facilitron has been wonderful, very communicative and supportive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Misty L. Gaines",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T16:54:00.000Z",
          "Titre": "Highly Recommend",
          "Contenu": "Facilitron has helped streamline our facilities use process tremendously.  Our account manager made the transition easy and smooth.  We highly recommend Facilitron and their support team is amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Goodwin",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T19:05:53.000Z",
          "Titre": "Great product",
          "Contenu": "Facilitron is always on top of things when we call. They offer a great product and service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Silvia Fernandez",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T21:43:17.000Z",
          "Titre": "Your Support Team is always en-point…",
          "Contenu": "Your Support Team is always en-point answering our questions, and request of help. I appreciate that 100%"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa S.",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T22:20:58.000Z",
          "Titre": "We love the support!",
          "Contenu": "We love the support provided and that the team always responds to our feedback."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Amiet",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T16:01:35.000Z",
          "Titre": "Facilitron is hands down the best software available on the market",
          "Contenu": "Facilitron is hands down the best facilities usage platform available today.  From the layout to the ease of use Facilitron has truly revolutionized the way facilities are managed.  I would not use any other program to manage my facilities."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale McCurry",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T22:44:28.000Z",
          "Titre": "We have requested many changes to the…",
          "Contenu": "We have requested many changes to the system over the last several years that have made accessing and monitoring both Facilities use and M&O work orders significantly easier to use and more user friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenna Skinner",
          "Nb_Reviews": 1,
          "Date": "2019-07-08T16:10:12.000Z",
          "Titre": "I used and relied on Facilitron when I…",
          "Contenu": "I used and relied on Facilitron when I worked at Hemlock Elementary up until October of 2018.  It was always helpful to get quick responses on emails to/from the Facilitron team.  I loved how the calendar showed different activities from different organizations in different colors and heard it easy to request use from different entities."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arron McGuire",
          "Nb_Reviews": 1,
          "Date": "2019-10-01T22:56:45.000Z",
          "Titre": "The reservation system is well…",
          "Contenu": "The reservation system is well organized and easy to use. The folks at facilitron are always responsive when you need assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeri Coulson",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T19:39:11.000Z",
          "Titre": "It's all Grace Vote that makes my…",
          "Contenu": "It's all Grace Vote that make my experience great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "V. G.",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T22:46:55.000Z",
          "Titre": "Easy to use",
          "Contenu": "This program has made so much easier to manage facilities at my site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margie Taylor",
          "Nb_Reviews": 1,
          "Date": "2019-07-08T15:59:41.000Z",
          "Titre": "It's a great program",
          "Contenu": "It's a great program.  Easy to read, clear information and approval process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Minarik",
          "Nb_Reviews": 1,
          "Date": "2019-10-07T16:33:08.000Z",
          "Titre": "Perfect automation but the respond time…",
          "Contenu": "Perfect automation but the respond time on questions and requests from a human was never."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shanthi",
          "Nb_Reviews": 1,
          "Date": "2019-10-07T19:07:26.000Z",
          "Titre": "Great platform to reserve facilities.",
          "Contenu": "Easy to book the facilities. Good customer service and school staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marion Arden",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T20:40:01.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, great was to access and view an entire month."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Harvey",
          "Nb_Reviews": 1,
          "Date": "2019-07-08T16:00:36.000Z",
          "Titre": "The customer service is outstanding",
          "Contenu": "The customer service is outstanding! It takes the work out of renting our facilities."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janette Frank",
          "Nb_Reviews": 1,
          "Date": "2020-03-10T12:09:55.000Z",
          "Titre": "Provided help and worked with a renter…",
          "Contenu": "Provided help and worked with a renter regarding a submittal of adequate insurance coverage"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rene Herrin",
          "Nb_Reviews": 1,
          "Date": "2019-07-09T16:50:47.000Z",
          "Titre": "Facilitron is wonderful",
          "Contenu": "Facilitron is wonderful!  User friendly with an excellent support team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Desare Burdick",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T20:01:38.000Z",
          "Titre": "Staff was polite and knowledgeable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica Rudolph",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T23:43:44.000Z",
          "Titre": "our Reps are so kind and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Todd",
          "Nb_Reviews": 1,
          "Date": "2019-08-05T22:02:18.000Z",
          "Titre": "System is simple to use &…",
          "Contenu": "System is simple to use & Representatives are very responsive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kerry Woods",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T16:16:21.000Z",
          "Titre": "Love this system!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Einhorn",
          "Nb_Reviews": 1,
          "Date": "2019-08-09T17:58:42.000Z",
          "Titre": "Always great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Keo",
          "Nb_Reviews": 1,
          "Date": "2019-09-30T13:59:56.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, fast, great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wanda Wood",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T18:12:30.000Z",
          "Titre": "Great process",
          "Contenu": "Great process! Very easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albert Lizarde",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T00:05:03.000Z",
          "Titre": "Great presentation!",
          "Contenu": "TONS OF RELEVANT INFORMATION, GREAT CONTENT."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angelica Flores",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T20:49:05.000Z",
          "Titre": "Easy to access information."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Wright",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T16:21:39.000Z",
          "Titre": "EXCELLENT QUALITY AND SERVICE"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "geetha rao",
          "Nb_Reviews": 2,
          "Date": "2019-09-30T19:51:38.000Z",
          "Titre": "very user friendly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Rodgers",
          "Nb_Reviews": 1,
          "Date": "2019-08-06T14:07:42.000Z",
          "Titre": "Excellent Service!"
        }
      ]
    }
  ]
}