{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "fanshield.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JL",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:44:43.000Z",
          "Titre": "They will reply quickly through…",
          "Contenu": "They will reply quickly through auto-reply. I sent numerous screenshots from the National Weather Service about flooding, just to be denied. And when you call, and wait, and wait, just to go to a voice mail."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Quinn Aldous",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T05:30:43.000Z",
          "Titre": "SCAM ALERT!!",
          "Contenu": "SCAM ALERT!!! Do Not Buy This Fake Garbage Insurance!!! They are snake oil salesman. If you miss your event because of unforeseen circumstances, they will not stand with you, or reimburse you. Even when you have 100% documentation for the reason uou missed your event, they will find some way to not pay you. I am 100% positive that the positive reviews on here, are company people who wrote the reviews."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom Border",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:23:33.000Z",
          "Titre": "I and my partner both got the flu...",
          "Contenu": "I and my partner both came down with the flu 2 days before a concert. I went to the urgent care instead of the hospital and was seen by a PA instead of a doctor. The partner was sick and stayed home. I sent in a copy of the urgent care statement but FanShield said it had to be signed by a doctor. It would cost more to see a doctor to get a signed statement after the event than the tickets cost, so learned it is not worth it to get the insurance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joyce A-M",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T06:16:27.000Z",
          "Titre": "Dispute FanShield charges you did not authorize",
          "Contenu": "I am in the process of reporting Protecht/FanShield to the FCC, FTC and BBB. The company fraudulently charged me for Refund Protection which I NEVER, EVER purchase for my travels or events. The  non-authorized charge appeared on my bank debit card along with the authorized hotel fee.My bank offered to refund the charge, eat the cost and issue me a new debit card.   Why should my bank eat the cost, albeit it a minimal amount, and I have to endure the hassle of a new card because of Protecht/FanShield’s thievery?My advice to consumers is do not use HotelPlanner.com as a liaison for booking a hotel because it allowed me to incur the fraudulent charge from Protecht/FanShield.I have emailed back and forth about this issue for one week.  No refund has been issued.  Time for talk is over. I am going all out to alert others and try to prevent FanShield and its cohorts from stealing from innocent consumers. I also want the bogus charge  along with an aggravation amount paid to myself."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:01:39.000Z",
          "Titre": "I had 2 unauthorized transactions on my…",
          "Contenu": "I had 2 unauthorized transactions on my credit card for insurance protection I didn't purchase.  I reached out via e-mail to fanshield and was told the charges were voided and refund was issued, but I am still seeing the 2 unauthorized transactions on my credit card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Monika",
          "Nb_Reviews": 5,
          "Date": "2023-10-13T00:40:57.000Z",
          "Titre": "It's an absolute joke",
          "Contenu": "It's an absolute joke. They require so much paperwork to say you can't come. Why bother paying extra for insurance when they'll basically refuse to refund you without a million extra steps. They wanted me to pay $40 copay to get a doctor's note saying I was injured for a $30 refund. It should not be this hard. Literally you pay extra for absolutely nothing because they will not refund you. I will never insure an event again because either way I'm out of the money but at least I won't be out any extra cash for paying for this useless service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kimberly N.",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T15:24:14.000Z",
          "Titre": "If I could give no stars",
          "Contenu": "If I could give no stars, I would. Don’t waste your money. The documentation requested is never sufficient enough if you can’t make an event, just forgo losing the money and don’t invest any money in this company to protect your purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bogdan Glushko",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T00:57:45.000Z",
          "Titre": "Absolutely awful experience",
          "Contenu": "Absolutely awful experience. My family wanted to go to six flags and with kids and unpredictable weather - we decided to protect ourselves by getting this horrible insurance plan. We learned quickly that the weather is going to be bad and rainy and it’s no fun at all to go to amusement park so we reached out to six flags who indicated that BECAUSE we bought this garbage insurance we cannot change our tickets or get a refund and HAVE to go through insurance. We went ahead and opened a claim and got in response “ The coverage under this peril (Unforeseen Severe Weather) would apply as such: “Severe weather conditions which result in your inability to attend the event. You must be unable to reach the event by car or travel carrier. This does not include weather such as heavy snowfall with roads open, ice on roads, or abnormally heavy rain, unless the intervention of authorities is involved.”So basically what this means is that unless ROADS ARE CLOSED we have to show up and “enjoy” ourselves and no matter that we got this insurance we are at full loss. In fact we could have easily changed the dates but because we got this insurance we are totally and royally screwed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carmen C.",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T17:07:55.000Z",
          "Titre": "DON’T use this company EVER",
          "Contenu": "I had bought tickets to Six Flags to surprise my 13 year old who had been asking me to take her for her birthday. I could not have predicted that a tropical storm would have been coming that weekend when I bought the tickets weeks before. When I went to request a refund they denied me based on not providing them with proof of road closures when I had proof of the amount of rain we had gotten in NJ that weekend including articles regarding flooding. I am appalled that the articles I had provided, which clearly stated a tropical storm was happening in NJ that weekend and even showed pictures of the flooding wasn’t enough. I would hope that everyone in the company would have the common sense to never put their family lives at risk during such a situation. It sickens me. Never will I deal with this sick company or six flags again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zack C",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T17:55:12.000Z",
          "Titre": "Denied claim of death in the family",
          "Contenu": "I had a death in the family and had the funeral a few days before the day of the event. We had a small family memorial service the day of the event that wasn't posted publicly so I was unable to attend the event. I had to submit PROOF OF DEATH which already seemed a bit invasive and insensitive. They denied my claim due to the funeral being a different day. They refused to refund no matter what I told them. They will do anything to avoid a payout. I wish I could give them 0 stars. I will never use this garbage service again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victor LaGreca",
          "Nb_Reviews": 4,
          "Date": "2023-09-27T03:12:19.000Z",
          "Titre": "Took advantage or a divorcing Veteran",
          "Contenu": "I recently purchased this insurance, I had planned to travel to great adventure and bringing my daughters with me.  I’m a 26 year Army Veteran still active and had the opportunity to spend some much needed time with children. I’m currently going through a divorce, and the judge decreed in a (COURT ORDER) that I no longer can visit with my children in person and would be limited to 15 minutes Face Time.  This court order prohibits me from bringing my children on this trip.  I submitted proof that shows the court order eliminates in person visits now They denied my refund…saying, by using the word court, order they mean jury duty. That is not advertised anywhere.  They will be hearing from my lawyer.   It was clear I paid the veterans price and instead of being more empathetic to the nature of a soldiers lifestyle, they try and find loopholes to take advantage.  Just wanted anyone who is considering using this service …don’t"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BRIAN NIX",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T07:55:28.000Z",
          "Titre": "Fansheild Policy Not Good",
          "Contenu": "Fansheild policy take advantage of people. The music ARTIST CANCELLED the show and they refuse to reimburse my insurance fee after the event reimbursed my ticket money. I called my credit card company and that was resolved quick and fast. Do the math, if they refuse to give back money to 20,000 people. They made over 50k Thousand Dollars in one night and the show was still cancelled."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "samantha geist",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T16:55:53.000Z",
          "Titre": "The refund process here is outrageous",
          "Contenu": "The refund process here is outrageous. I had planned to go to this game, but my father was recently diagnosed with liver failure and due to needing help, I can no longer leave the area. This place is requesting medical documentation from weeks ago stating he was in the hospital and I don’t have any doctors notes from them stating I help care for him and I cannot leave the area. So due to me wanting to care for a very ill family member instead of leaving the city, I now have to lose $400."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Muehlberger",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T19:04:29.000Z",
          "Titre": "I guess I’m the sucker",
          "Contenu": "My car won’t run anymore and I can’t go to a concert in 2 weeks that’s 4 hours away. I’m not going to rent a car because that is even more money to spend and I am not 25 so I couldn’t rent even if I wanted to. What is the purpose of paying for ticket protection if you can only get refunds on their terms. It’s a waste of money and it’s just another way to shake more money out of you. And what’s with the BS of denying any claim that is more than 2 days before the event?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Wycoff",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T17:45:37.000Z",
          "Titre": "I should have looked at the policy more…",
          "Contenu": "I should have looked at the policy more quickly.  We had last minute custody related ruling that made it where our grandson could not attend.  We knew this might be a possibility that might impact other ability to attend as well so I but this insurance.  This does not fit into any of the reasons listed.  Information on how to make a claim was confusing.  Could not find a phone number to call and ask a question.  I won't use them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tiffany Vandall",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T22:37:36.000Z",
          "Titre": "If I could give a 0 I would",
          "Contenu": "If I could give a 0 I would. When you try to call it says all lines are busy. They cannot be busy the entire business day! I requested a refund due to a death and was denied. I repeat....a death. When I emailed for an explanation I got no response. Do not waste your money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C K Hynds",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T05:12:00.000Z",
          "Titre": "We did not receive the PDF listing until AFTER purchase…",
          "Contenu": "We did not receive the PDF listing reasons for valid claim until AFTER purchase of the insurance. I have existing health problems that sometimes prevent me from being able to attend events. This is why I bought this “protection.”"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BigRed",
          "Nb_Reviews": 3,
          "Date": "2022-12-01T18:46:00.000Z",
          "Titre": "I need help for reimbursement for tickets",
          "Contenu": "I need reimbursement for tickets. Some folks in the group were unable to come due to broken ankle and a death in the family. I purchased insurance, but I seem unable to connect to get assistance. Your site cuts off when I try to access."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jora",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T03:35:42.000Z",
          "Titre": "Very sad and sick to my stomach that I…",
          "Contenu": "Very sad and sick to my stomach that I got caught in this trap and spent five times more for the tickets than they are locally being sold for.  :(  I purchased the insurance and it is not valid.  I paid over $500 for tickets that locally cost me less than $200, from the venue itself.  This is poor practice and I am in shock and disbelief that I was duped by it.  I just want to return my tickets and get my money back yet I am unable to do so.  How is that protection for me?   So sad, so close to Christmas and I thought I was doing a good thing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Hoe",
          "Nb_Reviews": 2,
          "Date": "2022-11-26T23:53:13.000Z",
          "Titre": "I did not order Fanshield",
          "Contenu": "I did not order Fanshield.  When I ordered my ticket to the UH Wahine basketball game I only ordered the ticket to the game BUT did I get charged for Fanshield ?  Question: Why would I purchase Fanshield for a ticket costing me $5 ????????"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Marc Littlechief",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T02:01:53.000Z",
          "Titre": "Its hard to get a same day doctors…",
          "Contenu": "Its hard to get a same day doctors appointment in Canada when you're feeling sick. Unable to attend my concert or get a refund because of it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NickyNick",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T05:14:48.000Z",
          "Titre": "Check Better Business Bureau on this company's complaints and don't give them one penny!",
          "Contenu": "Do not do business with these people. I brought a ticket to an event and the insurance promoted severe storm as a coverage in a icon snapshot only. This presents the fact that you could get a refund. The airline sent travel interruptions to us to change our flights for the 2/20-2/24 Minnesota weather because of a blizzard coming to my Minneapolis flight destination. I showed all that in my claim and all natl weather reports. They would not refund and the lady argued with me she wouldn't and expected us to fly on with the possibility of being stuck sleeping in an airport for days as flights cancelled. Then they argued that the streets would have to be closed so prove that to them. I didn't see their 72 hour cancelation or the email until she told me it was sent after. That has nothing to do with the severe weather that came the days prior to the trip right before. I saw the bad better business bureau 1 rating so if you are smart, read their reviews and don't give them a dime. I'm not providing no claim number for this company to come back with some blanket explanation to save face. They are scammers and don't give them one penny."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 4,
          "Date": "2022-12-05T00:10:49.000Z",
          "Titre": "Money Scammers",
          "Contenu": "I bought my tickets a few hours before the event and was forced to purchase the insurance or else I couldn't buy the tickets. There is no need for insurance. This was a completely unnecessary purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mehmet b bayrak",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T23:09:06.000Z",
          "Titre": "They are tryingThey should rename themself as: FanScrew to use every inch of…",
          "Contenu": "They are trying to use every inch of space not to pay.I have got a flat tire on my way to show. And had to change it with my spare.I already bought new tires 3 days prior to purchasing the tickets. But not yet have them installed.Even though I have proof of purchase of my new tires, they still didn't pay.I wish bad karma on them. Hope they will go bankrupt soon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Shirley",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T18:14:02.000Z",
          "Titre": "Paint in the butt company..",
          "Contenu": "Most pain in the butt process to cancel my tickets for the gaylord ice.. they made it seem as if I was visiting the president at the white house. Do better fansheild. Rip off of a company. 👎i still was not able to get my money back because they want to break a hippa law and get a doctors note from me that they have no right to get."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt B",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T18:13:29.000Z",
          "Titre": "Too much fine print and lawyer talk…",
          "Contenu": "Too much fine print and lawyer talk that you don't see until after purchase.  Doesn't seem worth the hassle to try and recoup ticket cost if needed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clayton",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T23:36:29.000Z",
          "Titre": "Example Of A Horrendous Business Model",
          "Contenu": "Despite the claim that you can view the policy prior to purchase, I can verify with photo evidence that this was not the case for me. I did not receive any information regarding the policy until after I purchased. Additionally, requiring that an entire form be filled out with over 15 questions that an Attending Physician would need to fill out in order for the ticket holder to receive a refund is absolutely absurd. This was a surprise date at the Gaylord Texan that I had purchased and presented to my girlfriend, which would have been her very first ICE! Experience with me. Now I’m having to send her with a friend while I stay at home. Absolutely pathetic customer service, horrible purchase portal layout, shady Terms & Conditions, and overall an incredibly sketchy, deceitful, experienced, as well as the single most ridiculous process of proving an illness I’ve ever seen in my entire life.COVID-19 regulations often had businesses simply asking for a vaccination card, proof of a negative COVID-19 test, or to get tested AT the facility. COVID-freakin-19. Not something like Pink Eye or Strep Throat. COVID. Absolute joke of a company and one of the single most horrendous experiences I’ve ever had with a company. I’d sue if this had involved a larger sum of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ZS Customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T06:12:51.000Z",
          "Titre": "Huge joke. Save your money!",
          "Contenu": "It’s a joke and I want my money back. I was pressured into purchasing because the tickets I had selected were going to expire before I could research what it actually covered. It doesn’t cover extreme snowfall which is an extreme safety threat in the area of the country where we live. They would assume I get in a life-threatening accident versus refunding the measly $56."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Suzanne McCullough",
          "Nb_Reviews": 2,
          "Date": "2022-11-26T02:38:43.000Z",
          "Titre": "I clicked the NO button on this as I do…",
          "Contenu": "I clicked the NO button on this as I do not want the protection. Why am I getting all these emails telling me I am protected, and I am being charged for it ??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kim Watson",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T20:04:25.000Z",
          "Titre": "My son passed away in October and there…",
          "Contenu": "My son passed away in October and there was a memorial planned last minute and it was scheduled for the date as my event that I had purchased tickets for and because my death did not fall in between your date time frame I can not be reimbursed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Austin Pruitt-Durant",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T01:16:20.000Z",
          "Titre": "Believe the one star reviews this…",
          "Contenu": "Believe the one star reviews this company is a class act the road conditions are absolutely terrible and continues to get worse and as I’m providing all documents they as for they continue to ask for more to the point I can’t provide if I would’ve knew any of this I would’ve saved my money instead of the insurance I advise anyone else to do the same and stay far away from their insurance scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lolita Robinson",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T03:21:01.000Z",
          "Titre": "I did not ask for coverage",
          "Contenu": "I did not ask for coverage. This company along with HPA is practicing thievery. God is watching."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Renee Manning",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T17:30:55.000Z",
          "Titre": "That you have to buy this to protect yourself",
          "Contenu": "The fact that I need to buy this is distasteful.  The fact that there are no refunds, so you have created a mode to create money for your company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ky Fran",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T17:03:11.000Z",
          "Titre": "They still reject your claim even if…",
          "Contenu": "They still reject your claim even if it's covered under their insurance"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron Aaron",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T03:24:47.000Z",
          "Titre": "Got me!!",
          "Contenu": "Got me!!! … Wouldn’t have purchased if I’d known … Should have read thoroughly … Could not return ticket because of friends work schedule … I’m able to go with my mother,but the ticket I purchased after mine as a kind gesture with insurance didn’t work out because of work,well now I’m stuck with it … Makes me not want to invite anyone in the future like I’ve always done in the past … Oh well🤷"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Anne",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T18:22:52.000Z",
          "Titre": "Well",
          "Contenu": "Well, no relevant details, like \"order will be placed only 2 (!) days before the venue\". This is quite important when you`re planning from Europe to go to a concert in the US."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ken Ayers",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T05:57:33.000Z",
          "Titre": "It kept rejecting my order but never…",
          "Contenu": "It kept rejecting my order but never told me the reason.At the end I got the tickets for the wrong show on the wrong day!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Judy Reid",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T03:12:43.000Z",
          "Titre": "When clicking on accepting the…",
          "Contenu": "When clicking on accepting the protection, it did not verify that the transaction had taken place. No confirmation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jimmy Arbogast",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T23:32:49.000Z",
          "Titre": "I had an email that said I purchased…",
          "Contenu": "I had an email that said I purchased it. But my ticket does not reflect the purchase...did I buy it or not?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pat James",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T02:44:32.000Z",
          "Titre": "Ridiculous",
          "Contenu": "Ridiculous. I assumed insurance would cover cancellation for an outdoor show cancelled because of weather. NOPE. NO THANKS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave H",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T18:51:59.000Z",
          "Titre": "DO NOT PURCHASE THIS!!!!!!",
          "Contenu": "Do not purchase this, I repeat DO NOT PURCHASE THIS!!! They will not reimburse you and assist you. Awful experience while ill trying to get refunded for an event I can't attend. Scam and will make it difficult to get your money back. Next time I will just rather be out of money for an event than pay for a service that's not in my best interest."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christie",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T13:23:24.000Z",
          "Titre": "Useless policy",
          "Contenu": "I bought Fan Shield with tickets to a festival and got sick the day of with COVID-like symptoms. The option I had according to the FS policy was to go to the doctor and get a doctor’s note. It was a Sunday so my doctor isn’t open as it normally would be. The next day I was feeling well enough that I couldn’t justify spending the money to see the doctor when I was already out my ticket cost and the cost of the FS policy. I did the responsible thing not going to the festival and was out my money because I wasn’t protected with the policy set in place. Turns out I shouldn’t have bought Fan Shield because it’s seemingly a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jean Mccauley",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T06:52:10.000Z",
          "Titre": "I didn’t choose to purchase Fan Shield",
          "Contenu": "I didn’t choose to purchase Fan Shield.  I opted not to purchase it so I was surprise to find that I had!  That was amistake.@"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Maurizio Silvestri",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T17:39:29.000Z",
          "Titre": "No explanation or details",
          "Contenu": "No explanation or details the only reason I purchase it because it was cheap"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luv St. Andre",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T04:59:34.000Z",
          "Titre": "Had to blindly select seats because…",
          "Contenu": "Had to blindly select seats because arena animation wouldn’t work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PJ Lind",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T00:35:17.000Z",
          "Titre": "Excessive!",
          "Contenu": "One, I had zero confirmation of my coverage. When I reached out with an inquiry, I received 50 emails. Yes, I am not exaggerating. I apparently received one confirmation email, for each of the fifty tickets I purchased!  Are you for real?   You can’t do better than this? Perhaps a summary of my $161. Fan Shield purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Easter",
          "Nb_Reviews": 6,
          "Date": "2023-01-27T03:23:36.000Z",
          "Titre": "I tried to get my refund and was unable…",
          "Contenu": "I tried to get my refund and was unable to get it.I was unable to go to the program because the wheels on my car were stolen."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Akiliah Richards",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T16:55:30.000Z",
          "Titre": "Angenette is horrible she gave in…",
          "Contenu": "Angenette is horrible she gave in accurate information she doesn’t know what she’s talking about. Every other word is I don’t know no complete sentences with accurate information and she didn’t make clear the actions she took to “help” me. This is a horrible first experience"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 2,
          "Date": "2022-11-27T04:51:13.000Z",
          "Titre": "Never went through as far as I could…",
          "Contenu": "Never went through as far as I could tell. No confirmation"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Patricia Nagy",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T13:59:46.000Z",
          "Titre": "awful",
          "Contenu": "called and asked for refund.  I didnt purchase any kind of tickets for any event on October 14 as charged on my credit card.  I have reported it to police as I want to know how you got my credit card number.   Fill out some refund forms you said and that was not encourging."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nicklos Biro",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T01:52:56.000Z",
          "Titre": "We just wanted to change the date as…",
          "Contenu": "We just wanted to change the date as our granddaughter was sick and we were not able to."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Hickman",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T22:41:49.000Z",
          "Titre": "I thought it was $13.00 for all 4…",
          "Contenu": "I thought it was $13.00 for all 4 tickets. Not $13 for each ticket. This is a borderline rip-off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles A. Mento",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T16:40:03.000Z",
          "Titre": "PDfs do not open",
          "Contenu": "PDfs do not open. Cannot tell what this insurance will do for me if it rains, if we get sick, etc."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R J Perez",
          "Nb_Reviews": 2,
          "Date": "2022-10-24T07:06:40.000Z",
          "Titre": "Why file a claim? vs making the event!",
          "Contenu": "Soften the requirements for submitting a claim.If my plan was to cancel/file a claim, then I wouldn't make a purchase.I had good reason to skip the event, but not due to serious illness or death!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joey N/A",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T00:47:48.000Z",
          "Titre": "They wouldn't give me my stuff this is…",
          "Contenu": "They wouldn't give me my stuff this is bull and I won't be using this again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T07:01:30.000Z",
          "Titre": "not 100%",
          "Contenu": "The processing fee was not covered so the full amount of thr tickets were not covered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tired",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T21:25:25.000Z",
          "Titre": "Unhelpful",
          "Contenu": "Not helpful. Lots of runaround with no result."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ticket holder",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T03:02:40.000Z",
          "Titre": "I wasn’t able to view the fine print…",
          "Contenu": "I wasn’t able to view the fine print and what it actually covers. The company should do a better job at this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tammy Smith",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T15:26:34.000Z",
          "Titre": "I called venue for change",
          "Contenu": "I was able to call the venue for a change of date I did not need Fanshield"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fran Powell",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T23:40:14.000Z",
          "Titre": "The link was unresponsive at least 10…",
          "Contenu": "The link was unresponsive at least 10 times."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy Lomshek",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T20:29:33.000Z",
          "Titre": "I did not want protection",
          "Contenu": "I did not want protection, but somehow ended up with it.  A little misleading, I thought"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Venise Mcward",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T16:52:42.000Z",
          "Titre": "I did not like this system",
          "Contenu": "I did not like this system. I had to find out the time of the game. The teams should have been listed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Goldberg",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T22:52:48.000Z",
          "Titre": "We did NOT choose Fanshield yet it was…",
          "Contenu": "We did NOT choose Fanshield yet it was included in our order. WE have since cancelled it. This is FALSE representation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 10,
          "Date": "2022-10-26T00:02:21.000Z",
          "Titre": "Charging the processing fee is a rip…",
          "Contenu": "Charging the processing fee is a rip off.  It will cost you a few participants who are low income and literally living paycheck to paycheck."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Liuzzi",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T18:32:13.000Z",
          "Titre": "Trying to cancel won’t let me",
          "Contenu": "Trying to cancel won’t let me! I booked 10 minutes ago with insurance and as of yet have not been able to figure how to process the refund!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Eric Biklo",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T02:47:24.000Z",
          "Titre": "I would never get insurance- you guys…",
          "Contenu": "I would never get insurance- you guys made my life like a hell, because I got injured. Insurance has different meaning to you people. Very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alejandro Benavides",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T01:29:11.000Z",
          "Titre": "Your terms of service are inadequate",
          "Contenu": "Your terms of service are inadequate. Sometimes a family emergency means it’s none of your business. And you don’t need a doctor’s note for a fever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Segura",
          "Nb_Reviews": 5,
          "Date": "2022-11-06T22:39:33.000Z",
          "Titre": "Rip off",
          "Contenu": "The online purchase woul not allow me to decline the protection. I won't use again until fixed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay Kustes",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T03:47:14.000Z",
          "Titre": "Ticket coverage false advertisement",
          "Contenu": "The protection is garbage. It said in case of sickness etc.. but I was sick and was declined a refund on tickets for Louisville Live"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Corteney Dixon",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T16:10:02.000Z",
          "Titre": "Wouldn't recommend",
          "Contenu": "Wouldn't recommend. Bought two tickets. My friend couldn't go, so I requested a refund and they refused"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arthur Jones",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T12:57:19.000Z",
          "Titre": "Martinsville night mare",
          "Contenu": "Claims site giving me the run around, Chat gives me the same run around. Not a service just a ripe off."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kingston On",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T06:31:49.000Z",
          "Titre": "I could not purchase tickets"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maureen Denner",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T13:53:00.000Z",
          "Titre": "The \"eligible\" reasons for making a…",
          "Contenu": "The \"eligible\" reasons for making a claim are unreasonable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jomoore",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T18:36:13.000Z",
          "Titre": "I would like to give zero stars",
          "Contenu": "I would like to give zero stars. My husband was just diagnosed with a horrible cancer and was very sick at the time of the concert for which we had purchased tickets and insurance.  No refund because I didn't have a doctor's note saying I was required to care for him.  No one else lives in our home.  Total SCAM!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cassandra",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T21:15:13.000Z",
          "Titre": "Are my tickets refundable or not",
          "Contenu": "Are my tickets refundable or not? I can't tell"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Bilyeu",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T22:29:28.000Z",
          "Titre": "I selected the 19.99 for ticket…",
          "Contenu": "I selected the 19.99 for ticket protection but wasn't chagred for it.  now you want 49.99"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul M",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T13:16:54.000Z",
          "Titre": "DO NOT TRUST THIS SCAM COMPANY",
          "Contenu": "I was in a car accident and was scheduled for repairs during the concert. Was unable to attend due to not having a vehicle, which was supposed to be covered. I provided proof from the service shop and everything. Of course they found a loophole rather then honoring my claim. DO NOT TRUST THIS COMPANY AND DON'T WASTE YOUR MONEY.And before ScamShield replies with their lame excuses, the accident happened before the concert but the repair shop only had their first appointment for the week of the concert. I was unable to pick a different week because I would have had to wait over a month for the next available appointment. Never again will I use ScamShield and will be letting EVERYONE I can know about this scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kwood",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T00:57:30.000Z",
          "Titre": "SCAM SCAM SCAM",
          "Contenu": "terrible company, convinced this place is a scam, we lost 875$ and had submitted letters from doctors offices to confirm why we couldn't attend event. don't waste your money with this company. Anyone who gave this company a good review is certainly working for them or paid with my money to give a good rating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 3,
          "Date": "2021-11-24T02:00:14.000Z",
          "Titre": "Fanshield they resolved the issue for two tickets still working on the third",
          "Contenu": "When I purchased the insurance for my tickets they do not tell you the only reason you can cancel My son-law had to leave the country for his job unexpected then my daughter came down with the flu so had no one to go with me which was a four hour drive so I thought no worries I have insurance so I call them what a joke when I was on there site I was told by Norton leave the site unsafe what’s that tell it’s a fraudulent scram to screw you out of your money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOSHUA LAYTON",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T22:45:55.000Z",
          "Titre": "Fan shield is an absolute scam",
          "Contenu": "Fan shield is an absolute scam. We were diagnosed with Covid-19 today and our show is scheduled for tomorrow. Filed a claim and they refuse to reimburse as Pandemics are an exclusion. Sounds like everything is an exclusion from what I’ve read about this disgusting scam. Do not waist your money of your time!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob Hudson",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T01:28:19.000Z",
          "Titre": "I don't know what this is or does for…",
          "Contenu": "I don't know what this is or does for me or my purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Beverly Zychowski",
          "Nb_Reviews": 3,
          "Date": "2021-09-29T12:55:24.000Z",
          "Titre": "Don’t waste your money!",
          "Contenu": "I purchased this for a race I was supposed to run in Oct. I ended up with a work conflict. And they won’t reimburse me because I’m self employed and somehow fall under the category of interns and volunteers. Ridiculous I’m being punished for being an entrepreneur and actually have to travel for a contracted job! I’m livid at this company!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T19:25:54.000Z",
          "Titre": "Bought tickets for a Delta boat cruise…",
          "Contenu": "Bought tickets for a Delta boat cruise at Opryland Hotel in Nashville for a mother-daughter weekend. My daughter was pulled away and had to fly to Greensboro that weekend. Provided plane receipt and ticket information. Would not refund without a letter from HER EMPLOYER. Really? AWFUL - NOT WORTH THE COST"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Leigh",
          "Nb_Reviews": 4,
          "Date": "2022-03-03T11:51:38.000Z",
          "Titre": "Disgusting service",
          "Contenu": "Disgusting service! 4 months pregnant and unable to run the Marathon I had signed up to and in good faith.  This company would not accept my reason as ‘proof’ of being unable to run including my maternity notes.And refused a refund.Would not recommend"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2021-09-24T16:41:13.000Z",
          "Titre": "Absolutely shocking service",
          "Contenu": "Absolutely shocking service. I had insurance for a half marathon and proof of a long-term ligament condition which they refused to accept unless I had a doctors not specifically saying I couldn't attend the event - which costs £25 to obtain. I won't be using this scam company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cody Gibbs",
          "Nb_Reviews": 2,
          "Date": "2022-10-03T17:50:03.000Z",
          "Titre": "This is an absolute scam",
          "Contenu": "This is an absolute scam. They will not refund your money for any reason, only on their terms. I will NEVER give these greedy scumbags money again. The pandemic is the only reason we got this BS insurance and it is NOT covered!!!!!!!!!!!!!!!And this Corey guy, who's job is damage control of negative reviews of this garbage scam company, is fake friendly passive aggressive and pushy. Think about it, they have a full time employee for \"de-escalations\" because they screw so many people over. The reason trust pilot is showing them as good reviews is because he works their system to get the negative reviews removed...To provide actual context. This guys title was escalations supervisor. But I see he worked on changing all of his reply’s now. Go scam someone else with your fake carting. You and this company is just a bunch of money stealing clowns. I blocked your email address because I got sick of your pushy harassment. And then you flag my review? You’re a sucker."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jimmy Hester",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T15:54:00.000Z",
          "Titre": "This is merely a rip off",
          "Contenu": "This is merely a rip off. I purchased this so called protection and when I could not go due to being quarantined due to COVID I applied for a refund but was told that this was not covered. Being the worst health issue in the world today one would think that would be of upmost priority. Even if you unable to go due to illness you have to provide written verification from a doctor. Not much protection and certainly not worth spending your money for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charley Adams",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T17:01:34.000Z",
          "Titre": "Didn’t get to use motel as was sent…",
          "Contenu": "Didn’t get to use motel as was sent home at last minute. Beyond difficult to get a refund"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Debby West",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T22:04:01.000Z",
          "Titre": "I tried  for  3 days  to purchase …",
          "Contenu": "I tried  for  3 days  to purchase  tickets and  finally  today I was  able to get a  ticket"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2021-07-27T17:10:01.000Z",
          "Titre": "FanShield does not honor Military Leave; classified as a Pandemic reason",
          "Contenu": "After having purchased protection for Nascar tickets, the company still refused to refund me even though it's a covered reason: Military Duty. My leave was denied due to personnel shortage and even after submitting the appropriate documentation to show that my leave was denied, they would not honor the purchase protection and provide a refund. They tried to classify it as a Pandemic issue that is not covered. Pandemic or not, this is in regards to Military Leave which IS covered. I will never do business with any company that uses FanShield."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2020-03-14T00:43:45.000Z",
          "Titre": "FanShield is a scam!!",
          "Contenu": "FanShield is a scam!!! Due to the Cornavirus & games being cancelled they refused to refund my tickets.  Even though when speaking to one of their agents they said it was an act of god, out of my control & would be refunded.  I would not recommend buy their insurance with tickets if offered.  Their few reasons to be approved are likely never to happen.  So I'd suggest saving that few dollars for a beer instead of their insurance.  Just saying!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chloe",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T22:25:24.000Z",
          "Titre": "Denied Refund",
          "Contenu": "Purchased to protect concert tickets I gifted to my boyfriend. Despite having a reason that fell under the insurance claim, customer service was awful and refused to refund. I ended up getting refunded directly from the concert venue. Will never purchase their insurance again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose Jiminez",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T23:01:00.000Z",
          "Titre": "Tried to get a refund and didn't  have…",
          "Contenu": "Tried to get a refund and didn't  have any luck. Didn't  attend  the event."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "y nm",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T17:29:01.000Z",
          "Titre": "They are a SCAM!!",
          "Contenu": "They are a SCAM!!! DO NOT buy their insurance. They will ask you to initiate a claim, and the \"magic link\" they send you will send you to the twilight zone. It just keeps spinning, and spinning without sending you the the claims page. Then, when you try to do a chat, it's a \"bot\" that says they don't have an answer, an try to send you to FAQ. If they were legit, they would make the process smoother, and easier. No way the \"magic link\" will keep spinning for nearly an hour 5 times in a row that I tried. And, I still have NOT been able to file a claim!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2020-03-18T16:19:16.000Z",
          "Titre": "I had a health emergency and had to…",
          "Contenu": "I had a health emergency and had to cancel my tickets to a festival while I was on my way there (across the country). They tried to deny my claim despite me providing all of the necessary documents. They didnt want to accept my doctors note because it didn't specifically say the festival name (it just said I had to return home immediately - days before the festival - and have further tests done). I had to threaten legal action before they honoured the claim. Disgraceful practice."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "G. Chen",
          "Nb_Reviews": 4,
          "Date": "2020-03-11T16:28:21.000Z",
          "Titre": "Lack of Empathy and common sense",
          "Contenu": "The woman who handled my case was appalling in empathising I had to appeal to a 3rd party to receive my claim, she refused half my claim and the reason was that I was the only one involved in a car accident therefore my partner should still be able to attend the fund raising night. So just asking herself for a moment if this was herself would she hurriedly get home settle the kids and watching her partner get dressed go out for a night of fun and herself recovering from the shock at home doing her chores?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lita",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T15:22:51.000Z",
          "Titre": "Very unhappy with FanShield",
          "Contenu": "Very unhappy with FanShield.  I provided a plethora of reasons why we could not attend the event, including a Doctor's note, still wasn't satisfactory to get a refund for all of my family members.  We are a family, if one or two members can't go on a family trip, we all don't go."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Kommer",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T04:44:11.000Z",
          "Titre": "I can’t even find my order"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Graham Moss",
          "Nb_Reviews": 1,
          "Date": "2020-03-20T11:15:11.000Z",
          "Titre": "Do not ever use.",
          "Contenu": "Do not ever use.. When you want to get a refund they want you to jump through hoops to PROVE you are telling the truth.. There is alot of hidden clauses and you will be made the feel like a liar.I had a operation and could not take part and it was obvious with what op I had I couldn't attend. But they wanted me to get a doctors note to say it.. Not only are the doctors not seeing anyone.. My hospital information should have been enough.. I have read other reviews and this company that I guess is in the USA is fraudulent and should be avoided."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kolin",
          "Nb_Reviews": 3,
          "Date": "2022-12-03T03:09:24.000Z",
          "Titre": "False advertising",
          "Contenu": "False advertising. Did not honor thier obligations. Complete scam."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deborah Story",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:36:02.000Z",
          "Titre": "I only rated a 2 because they did…",
          "Contenu": "I only rated a 2 because they did respond quickly.  I bought this protection because I thought it would be good to have in case we couldn't make it to the event.  When you first read about it they make it sound like it would be easy to get a refund if need be, only to find out unless you have a major, mostly unheard of reason, you will not receive a refund.  Travel plans can change all the time and with family coming from out of state I thought I would be covered if they couldn't make it.  They responded very quickly to tell me my reason did not qualify for a refund.  I will never purchase this kind of \"protection\" again.  Lesson learned."
        },
        {
          "Note": 2,
          "Lieu": "UA",
          "Pseudo": "Cyndi",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T01:04:31.000Z",
          "Titre": "One click but no details available",
          "Contenu": "Well it was one click to purchase but I coulndt find more details about how it worked or how to get a refund if needed, how soon you have to notify etc. And then after booking it clearly stated multiple times 'no refunds'. I assume that meant no refund if you havent purchased the extra fanshield. My husband is coming from Edmonton and this time of year really anything could happen."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kate Jackson",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T19:30:23.000Z",
          "Titre": "Non-Refundable???",
          "Contenu": "The day of the week didn’t show up before I purchased the tickets, and I can’t go to my concert on a Sunday. I have church and I won’t be able too :( I’m upset there wasn’t a way to cancel my tickets or even a extra purchase to allow me to cancel if I had too"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lena",
          "Nb_Reviews": 4,
          "Date": "2022-12-06T20:51:12.000Z",
          "Titre": "They don’t reimburse for when life happens",
          "Contenu": "I spent money on tickets that I didn’t use because timing and the physical condition of people in my party didn’t allow for it. It’s not covered by Fanshield. The cost of unused tickets was roughly $50, and the cost of Fanshield was also about $50, so basically all Fanshield did was double the cost of unused services. My total spend on tickets was $360 not including Fanshield. I got the plan thinking worst-case scenario we don’t get to the location, we can be reimbursed. However, it would actually require a life-threatening emergency for reimbursement. Normal events, like a toddler recovering from a cold needing to stay in bed, or a parent with a disability not being able to make her way to the event site, are not covered, and those are the very common occurrences that can mess up a schedule and cause money to be wasted. I wouldn’t recommend buying this product for tickets that cost less than $50."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Daniels",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T14:02:23.000Z",
          "Titre": "Too many details",
          "Contenu": "The description of the terms and conditions is a lengthy and detailed document.  It leaves impression that surely the company will find a way not to cover your claim.  I resigned myself to shrugging my shoulders and concluding I had probably just wasted money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Candy Errett",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T16:22:28.000Z",
          "Titre": "Need to Cancel Two of Four Tickets",
          "Contenu": "I bought four tickets for the Iowa High School Football 3A semi final game. I need to cancel two of them. How do I do that?I find no way to do that or an operating contact us link to do that, so that is why the low rating.Sent from my iPhone"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carolyn Clark Polcz",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T00:10:57.000Z",
          "Titre": "Is not specific how to get a refund of…",
          "Contenu": "Is not specific how to get a refund of tickets if unfortunately can’t attend and what’s the process"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Mayeshiro",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T04:52:41.000Z",
          "Titre": "Couldn’t add parking also I heard there…",
          "Contenu": "Couldn’t add parking also I heard there was a military discount"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe McB",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T05:25:31.000Z",
          "Titre": "Poor disclosure up front as to how…",
          "Contenu": "Poor disclosure up front as to how restrictive this ‘insurance’ is"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lora",
          "Nb_Reviews": 3,
          "Date": "2022-11-07T20:53:06.000Z",
          "Titre": "Just purchased, didn’t use …",
          "Contenu": "Not sure why I got a survey to see how experience was when I haven’t used fanshield to protect my purchase. Just purchased today. So if I need to protect my purchase I’d hope you do what you say."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Roland",
          "Nb_Reviews": 2,
          "Date": "2022-12-26T02:44:32.000Z",
          "Titre": "Looks like a long shot.",
          "Contenu": "It looks like I only have coverage if the roads are closed or I am on my death bed.  Also not clear how to file a claim."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie Kasperson",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T16:27:44.000Z",
          "Titre": "I could not find anywhere that said if…each ticekt I was charged 16.98 and now I am thinking I shouldnt have got this",
          "Contenu": "I could not find anywhere that said if it was 16.98 per ticket or is that total for all 4 tickets?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jiffy",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T20:27:04.000Z",
          "Titre": "It’s really important to have different…",
          "Contenu": "It’s really important to have different payment options such as PayPal, Afterpay or Klarna for real fans to afford this experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary Lovaglio",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T13:21:32.000Z",
          "Titre": "Your website was horrible"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael - St. Louis",
          "Nb_Reviews": 9,
          "Date": "2022-09-29T03:43:49.000Z",
          "Titre": "Updated Response",
          "Contenu": "I will update this if I get a response from FanShield.  It has been 24 hours since my initial request for a refund as of this writing.  Some important things you need to know.  Keep your documentation, if you need to go to the hospital (such as I did) for surgery FanShield will ask you for your medical records of this visit!  I think this is an obvious HIPPA violation, but I did comply.  Despite all of this I have yet to get a reply from a \"human\". Only \"We are review your documents and will get back to you shortly\".Update:Fanshield wants a signed note from your doctor, despite giving them my discharge official documents from office staff. This was not good enough. The process made me feel like I was in grade school. They also again wanted proof of purchase which I had already sent to them. Finally they wanted to know why my wife couldn't go to the same event that I obviously could not go to. At the end of jumping thru all of these hoops I did receive my refund thru PayPal. You have choices on this, your bank account, no way I am giving acct number to them, a mailed check, PayPal or Zelle. I will not use this set ice again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T15:58:10.000Z",
          "Titre": "Too many documents required to verify…",
          "Contenu": "Too many documents required to verify illness.  If there is an official diagnosis of influenza, why require a doctor's note saying not to go to public sporting events with a communicable illness. Just plain painful to gather the required documents."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Irene",
          "Nb_Reviews": 1,
          "Date": "2020-03-18T23:14:38.000Z",
          "Titre": "Non-payment",
          "Contenu": "Bought the weather insurance for a concert 2 months in advance.  Living in upstate New York, I received a do not travel by the DOT andso they paid for my ticket.  Another person living in Rochester was stopped at the thruway entrance and couldn't go - due to an accident on the road - they refused to pay for her ticket.  2 relatives were arriving from Virginia but hit an accident on the road in PA.  They wouldn't have made it in time for the concert.  Fanshield refused to pay.  READ THE WEATHER SECTION VERY CAREFULLY Before purchasing cause the only cause they accept is if the DOT states NO UNNECESSARY TRAVEL or the Roads are closed.   First time using this service.  Won't use again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Nowicki",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T03:24:35.000Z",
          "Titre": "Dont know what I Paid and for what",
          "Contenu": "Dont know what I Paid and for what. Feels like you sneaked one in."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Mayle",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T15:25:07.000Z",
          "Titre": "Seniors were not on the buying list",
          "Contenu": "Seniors were not on the buying list. So I paid regular price for a senior."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrienne",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T22:03:49.000Z",
          "Titre": "You need to make it clear that people…",
          "Contenu": "You need to make it clear that people who request refunds know they have to send all documentation online.  This can be a problem for some seniors who do not have higher level computer skills!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Uncabee",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T21:53:24.000Z",
          "Titre": "I could not access the contract from…",
          "Contenu": "I could not access the contract from the email."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Penny",
          "Nb_Reviews": 3,
          "Date": "2022-10-19T15:11:23.000Z",
          "Titre": "Difficult to navigate"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RK",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T15:27:04.000Z",
          "Titre": "Do better in situations like this...",
          "Contenu": "Honestly one of the worst customer services experiences of my life. I have worked in and been the manager of a major customer service team and never had to jump through hoops like I did for this. My wife's father had a liver transplant - 4 days before our tickets to an amusement park were supposed to be used in Ohio (we live in Oklahoma). We canceled our flights, and every other event we had scheduled to come see him the day he had the surgery. Got a refund easily from everyone else, except fan shield. We provided documents showing he was on the list, that he got his new liver on the date we said and etc... still got drug along and asked for more documents... Was only until we got ahold of Aaron that anything was done. I honestly would give this a one star if it wasn't for Aaron, he went to bat for us. Understanding how big of a headache this has been for us and for our family. We really truly appreciate him. In the future, maybe have a little more understanding when a family is going through something like a transplant. It's not a planned event, we were told he was going to be waiting a couple of months for the liver but found a perfect match much sooner. So, it was a shock to us all. We finally received our refund 3 weeks later, thanks to Aaron."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dscr",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T16:43:13.000Z",
          "Titre": "Was asked for a review before I could use the services",
          "Contenu": "I may change my review in the future, but I found it very annoying to be asked to review some thing that I haven’t even used yet. I used hand shield to protect an upcoming trip that won’t take place for another week. Don’t ask me to review this in advance because you won’t get a good review from me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vicki Howard",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T16:33:18.000Z",
          "Titre": "I have yet to receive my information on…",
          "Contenu": "I have yet to receive my information on this insurance and how it works in the event I can’t participate. I would appreciate being sent the information. My email is. Thank youVicki Howard813-857-8900"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristen Dickens",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T22:02:48.000Z",
          "Titre": "Its okay",
          "Contenu": "After leaving a not so favorable review  Fanshield did reach out to me and we did reach a reasonable solution. I will keep in there efforts in mind in the future but will proceed with caution with future events."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Iasiah Rios",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T21:15:44.000Z",
          "Titre": "I emailed for assistance and was not…",
          "Contenu": "I emailed for assistance and was not helped. Called the box office was not helped. Please contact me asap via phone 347-528-4120. I entered my phone number incorrectly when I purchased my ticket and I wanted to know if that would affect my purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-28T03:35:16.000Z",
          "Titre": "Capsha is bogus …",
          "Contenu": "Seemed crazy to have  to redo  booking two times because Capsha was unresponsive Kill the darn thing please it shields and protects nobody"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer55",
          "Nb_Reviews": 7,
          "Date": "2022-11-23T02:29:33.000Z",
          "Titre": "If I need to file a claim...",
          "Contenu": "If I need to file a claim, what are the steps?  Does it take a lot of time and detail to place a claim?  Does the process work?  That was my initial question.  Your customer service rep sent me a reply explaining the steps and the time and detail needed.  I appreciate your reply.  It answered my questions. (11-22-22)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "fxdp",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T01:33:23.000Z",
          "Titre": "Seat map was not clear (Fantasy Springs…",
          "Contenu": "Seat map was not clear (Fantasy Springs Casino).  Ordering quite murky.  I thought I ordered insurance, but it didn't happen.  All in all a bush-league experience.  You at FanShield should try it sometime."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2022-12-05T08:28:28.000Z",
          "Titre": "Reasonable Cost, Limited Coverage",
          "Contenu": "The coverage cost is reasonable, although somewhat limited.  Concerned that there will be difficulties if I have to cancel because of illness or a work-related issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "IC",
          "Nb_Reviews": 3,
          "Date": "2022-11-22T00:18:44.000Z",
          "Titre": "\"just in case\"",
          "Contenu": "purchased the insurance \"just in case\".  However, I will not know how well it works until I need to use it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Peterson",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T18:26:39.000Z",
          "Titre": "I was unable to purchase tickets…",
          "Contenu": "I was unable to purchase tickets through the feed on Facebook would not allow me to log into my account. I had to go to take a star website to do so also would not let me look at where my seat was but overall I’m OK with where I’m sitting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Jordan",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T19:40:17.000Z",
          "Titre": "Had to buy insurance",
          "Contenu": "I did not like the fact that I needed to buy the insurance. It would not let me purchase the tickets when I said I did not want the insurance"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 3,
          "Date": "2022-12-09T18:02:35.000Z",
          "Titre": "Poor communication",
          "Contenu": "It gave me no indication we had purchased it. Was waiting to see it in my total bill."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nathan Bearden",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T01:38:02.000Z",
          "Titre": "Didn’t know I accepted the insurance…",
          "Contenu": "Didn’t know I accepted the insurance through them. For all the things that aren’t covered it seems a bit pricey"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Scholl",
          "Nb_Reviews": 2,
          "Date": "2022-11-06T16:44:36.000Z",
          "Titre": "The issue I have with the service is…",
          "Contenu": "The issue I have with the service is that the email lists the policy ID, but does not list any details about the event the ticket is for.  Makes it so you can't search your emails for it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marlin",
          "Nb_Reviews": 2,
          "Date": "2022-11-03T02:42:32.000Z",
          "Titre": "Event insurance is lame",
          "Contenu": "I don't like having to pay an extra fee for the off chance that life happens and sometimes people need to cancel events and get refunds. Event insurance is an industry that needs to go away."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gerald Mathias",
          "Nb_Reviews": 4,
          "Date": "2022-11-10T22:01:27.000Z",
          "Titre": "It was recommended by the Great Aloha…",
          "Contenu": "It was recommended by the Great Aloha Run people, but there was no hint as to what I would get for it, except \"protection.\" I found out later that it is supposed to protect me from losing the fortune I paid for registration, etc., in case the event became undoable for reasons not my fault."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Alvarez",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T20:52:20.000Z",
          "Titre": "Well I’ve always purchased it and I…",
          "Contenu": "Well I’ve always purchased it and I never had to use it. I get you all need to make money but it be nice to get a small percentage of that refunded or given as credit to the next concert"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Arnel Dodson",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T20:53:30.000Z",
          "Titre": "I just ordered 4 ea sports tickets but…",
          "Contenu": "I just ordered 4 ea sports tickets but didn’t really see a total explanation of fanshield. I’m hoping that if we can’t use even one or two tickets because someone fell ill, then we can recoup the value of that ticket. I hope it doesn’t mean it’s all or none…. Or I just wasted the amount of money for the coverage"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Victoria Fernandez",
          "Nb_Reviews": 3,
          "Date": "2022-11-17T19:57:20.000Z",
          "Titre": "It was confusing to figure out which…",
          "Contenu": "It was confusing to figure out which presale group I fell into and how I could get those tickets"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sunny Clark",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T19:56:56.000Z",
          "Titre": "your website was a bit difficult to…",
          "Contenu": "your website was a bit difficult to use.  I had to try 3 or 4 times to figure out how to buy my ticket. I did not purchase the ticket protection plan but it still was charged for it so I had to challenge the purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom Tarver",
          "Nb_Reviews": 3,
          "Date": "2022-10-14T19:03:53.000Z",
          "Titre": "Process was fine",
          "Contenu": "Process was fine. The delay, the seats available, wasn't thrilled with the ultimate results. Previous experience in purchasing playoff tickets went much better because it happened all at once for the full playoff package and the seats were better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken Parker",
          "Nb_Reviews": 4,
          "Date": "2022-10-13T23:52:19.000Z",
          "Titre": "Find the exclusions before buying",
          "Contenu": "Probably would not have purchased this insurance if I had read all of the exclusions first. I didn’t see an obvious link to the details on the check out page. There was a prominent “recommended” icon next to the offer to purchase this insurance."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Gord",
          "Nb_Reviews": 3,
          "Date": "2022-09-29T14:32:13.000Z",
          "Titre": "Half Iron cancelled",
          "Contenu": "A little less anxiety would have occurred if it simply was more open regarding cancellation. During a health care crisis requesting a doctors note or with covid expecting documentation is not reasonable. They paid so I am happy but I would. like to see a more open policy if I were to use this again. When I used the insurance for a PTO event it was a no-question policy, I wrongly assumed this would be the same."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vicki A Boileau",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T18:58:31.000Z",
          "Titre": "Easy but confused?",
          "Contenu": "It was easy to do but I was confused when the final total shown didn’t include the protection plan. Will it show up later separately, later, on my  Visa?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jana",
          "Nb_Reviews": 5,
          "Date": "2022-10-14T18:23:22.000Z",
          "Titre": "Can't pick seat.",
          "Contenu": "I don't like that it says it will send mobile ticket a week before the event. I am use to being able to immediately download to the phone. Also couldn't pick seat, just price point. Don't like that at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen Hawley",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T18:41:25.000Z",
          "Titre": "The system kept kicking me out",
          "Contenu": "The system kept kicking me out. I’m not sure where my tickets are."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Natalie Wilkins",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T22:12:49.000Z",
          "Titre": "…insurance for ballet",
          "Contenu": "Did not get a receipt or anything if I need to use it."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Brent Hughes",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T00:11:09.000Z",
          "Titre": "I had to miss a race due to injury",
          "Contenu": "I had to miss a race due to injury, and my reasoning was approved very quickly, which I was happy about. Unfortunately it took over 2 months and about 20 emails to actually get my refund/claim money. Fan shield will gladly give you a transfer to a Hyperwallet account, however if you do not have one it is a nightmare. I will say that the staff was nice throughout. I’d be about 50/50 on using this service again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Katie Tosh",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T22:35:38.000Z",
          "Titre": "Mixed Experience Overall",
          "Contenu": "If I could rate the initial experience, I would give it a 1 star.  My claim was outright denied, but this is because the process of filing the claim was very confusing.However, if I could rate my experience with Ruby Prasad specifically, I would give her 5 stars.  She went above and beyond her responsibilities to help me with my claim, taking time to call and email me and help me with appealing my initial claim decision."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Vicky Sampson",
          "Nb_Reviews": 1,
          "Date": "2021-11-12T16:39:04.000Z",
          "Titre": "Got there in the end..",
          "Contenu": "Was initially very frustrated that the process was slow but it turns out hotmail was blocking a lot of Fanshield emails. I finally managed to get hold of them via Instagram/TrustPilot and a helpful lady called Ruby phoned me and stayed on the line until the payment was sorted. Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 2,
          "Date": "2022-11-10T21:30:43.000Z",
          "Titre": "I wasn't sure if I needed this but what…",
          "Contenu": "I wasn't sure if I needed this but what the heck"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "James Allchin",
          "Nb_Reviews": 3,
          "Date": "2020-03-15T17:08:11.000Z",
          "Titre": "Good, until you want your account deleted.",
          "Contenu": "The process of getting insurance was simple, and then the process of claiming was also not a problem.My problem was when I requested to have my account deleted (they hold my financial details so why wouldn't I want it removed?).  This tool a few emails and a threat to escalate before it was taken seriously and my account was eventually deleted."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Bennett",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T03:43:31.000Z",
          "Titre": "Not clear why one can cancel and how…",
          "Contenu": "Not clear why one can cancel and how much is reimbursed if requested."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 2,
          "Date": "2020-03-13T01:53:22.000Z",
          "Titre": "difficult",
          "Contenu": "Two claims where one processed smoothly and the second one required a lots of back and forth questions because my race name was slightly different from my legal name.  Annoying to have to fight on 1 of 2 similar claims."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2020-03-18T21:56:33.000Z",
          "Titre": "The process wasn’t as easy as it should…",
          "Contenu": "The process wasn’t as easy as it should have  been. I had to miss an event due to work. They needed Extra paperwork that was a hassle to get. Very inconvenient"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Bruce Brown",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T22:01:27.000Z",
          "Titre": "It was fine",
          "Contenu": "It was fine. purchase went smooth"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Kaszyski",
          "Nb_Reviews": 3,
          "Date": "2022-10-25T19:44:58.000Z",
          "Titre": "Easy but cost vs ticket price high."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trisha Reichenbach",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T21:44:53.000Z",
          "Titre": "Okay experience but could be improved",
          "Contenu": "3/5 because I feel the company could be more up front on what's required in order to get a refund. I was unable to attend an event due to a sudden illness. I was asked to provide documentation from my doctor and also explain why the other ticket holders could not attend. They were my minor children so of course they were unable to attend. I received my refund, chose venmo and the money was on there the same day I submitted the additional information needed. They did require my doctor to specifically state I am unable to attend \"event name\" due to acute illness. When you purchase the protection I think a disclaimer about documentation needed should be displayed so there are no surprises. I would purchase the protection plan again in the future and it makes sense why they need this proof or they'd be out a lot of money. I also noticed they don't cover COVID related events which is strange. You'd think they would as long as proof of a positive test from your doctor is given or some kind of note from your doctor about being exposed. I think its a bad look for the company to rule out any covid related issued all together. Fortunately, my illness wasn't COVID related, but feel for the ones who end up sick, unable to attend their event, then to be told they are out the money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer Sawyer",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T09:47:22.000Z",
          "Titre": "Made me feel bad."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RFH",
          "Nb_Reviews": 1,
          "Date": "2020-03-18T21:54:03.000Z",
          "Titre": "Okay",
          "Contenu": "It was okay. Nothing else."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jhon due",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T10:07:25.000Z",
          "Titre": "I have yet to receive my information on…",
          "Contenu": "I have yet to receive my information on this insurance and how it works in the event I can’t participate. I would appreciate being sent the information. My email is."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "L. Damon",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T19:09:33.000Z",
          "Titre": "They're Alright With Me",
          "Contenu": "I had heard a lot of negative things about FanShield in terms of customer being able to obtain a full refund for legitimate fail shows, and I thought the same thing would happen to me, when my youth group couldn't make it to the HBCU battle of the bands at Alabama State due to a charter break down. However, I had a great customer care representative Seara, who made sure we received a full refund. She helped at every step of the process which was fairly quick though not necessarily easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M. Klein",
          "Nb_Reviews": 3,
          "Date": "2022-11-22T06:46:09.000Z",
          "Titre": "Good to have, but I would like more coverage, less proof",
          "Contenu": "The insurance was easy to buy, just needed to click a box.  The disappointment was when I looked over the terms after I bought the policy:  If I get sick, I need a written note from a doctor.  Since I need to pay the doctor, that kind of defeats the purpose of the insurance (unless I need to see a doctor anyway).  Also, I'd like coverage over any unforseen conflict.  For example, I had to miss an event because the rabbi of my synagogue died and I attended the funeral.  As for proof, couldn't the insurer accept a sworn and notarized affidavit?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dorothy Seibert",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T20:19:20.000Z",
          "Titre": "Purchasing was easy with prompt email…",
          "Contenu": "Purchasing was easy with prompt email of details. Four star because won't know reliability until after assured we can attend the activity."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Billy Harrison",
          "Nb_Reviews": 2,
          "Date": "2022-11-28T18:56:00.000Z",
          "Titre": "easy to do",
          "Contenu": "The service was easy to navagate but seating chart did not show where in the section the seats where."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith Richard",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T17:41:31.000Z",
          "Titre": "The process was somewhat time consuming…",
          "Contenu": "The process was somewhat time consuming for multiple tickets. Think about making it more user friendly by allowing a single transaction for one order using a confirmation or order number. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Lizette Vaneza Chávez Cano",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T09:19:28.000Z",
          "Titre": "It was Easy yo Buy the tickets",
          "Contenu": "It was Easy yo Buy the tickets, I hope not to have troubles to get It. As fast as i bought I received this email but I think has not enough information."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GDawg",
          "Nb_Reviews": 2,
          "Date": "2022-11-24T04:53:22.000Z",
          "Titre": "Price is fair",
          "Contenu": "Price is fair, especially with all the things that could prevent you from attending"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stacey Savoy",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T23:47:13.000Z",
          "Titre": "A Little Confusing",
          "Contenu": "The part about the Country was a little confusing.  I live in the United States and the window showed outlying territories.  I figured it out tho. :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Retired Lady",
          "Nb_Reviews": 6,
          "Date": "2022-11-14T02:52:23.000Z",
          "Titre": "Had some complications between the…",
          "Contenu": "Had some complications between the ticket purchase and the protection purchase, not sure why.  Anyway did get the protection on 2nd try.  Nice to know in an emergency the ticket price is not lost."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Shari M",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T19:33:49.000Z",
          "Titre": "Peace of Mind for Canadian Winters",
          "Contenu": "Normally I wouldn’t worry about “insurance” on event tickets,  but since the pandemic and winter started I decided it was worth the small fee for peace of mind"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharon Landis",
          "Nb_Reviews": 2,
          "Date": "2022-11-08T21:20:45.000Z",
          "Titre": "It was fairly easy to buy the insurance…",
          "Contenu": "It was fairly easy to buy the insurance on these tickets, however, I wasn't aware that billing was separate, so when I saw the total cost, I thought I had done something wrong & hadn't successfully gotten the insurance."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dick R Lekei",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T20:22:40.000Z",
          "Titre": "First time user and all went well…",
          "Contenu": "First time user and all went well Thanks.   this is all I have to say. don't bug me Thanks. bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Michael Binion",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T01:55:20.000Z",
          "Titre": "The tickets were easy to purchase",
          "Contenu": "The tickets were easy to purchase. The only item I would bring up is that I was not able to get the table I wanted. I got close but not as close as I was trying to get. Maybe it was my fault for not understanding how to do that. The email confirmation came quick. That is a relief."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Goodman",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T20:14:07.000Z",
          "Titre": "Well I'm not sure yet on how well this…",
          "Contenu": "Well I'm not sure yet on how well this works? But if everything goes well and as easy as it seems! This is the best and easiest protection plan I've ever signed up for?!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T17:29:57.000Z",
          "Titre": "Good customer service",
          "Contenu": "I had a slight issue with the FanShield protection.  I contacted them, and they quickly responded and corrected the issue.  Both the initial rep I talked to and Cameron S were very understanding and resolved the issue."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Big Dawg",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T03:10:34.000Z",
          "Titre": "Excellent insurance and service",
          "Contenu": "Communication was quick, direct and to the point.Once documentation was provided, reimbursement was the very next day.Absolutely zero run around."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customerR",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T01:50:39.000Z",
          "Titre": "Good Experience",
          "Contenu": "Experience was seamless and I got my payment within a few days. The only downside is that I wasn't really sure if I was dealing with a legit company at first, since I purchased my insurance for an event without the name Fanshield really sinking in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol Carlisle",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T15:46:21.000Z",
          "Titre": "I'm honestly not sure what fanshield…",
          "Contenu": "I'm honestly not sure what fanshield really does, but it seems like if something unforeseen happens the day of our event, maybe I get a refund? anyway, it sounded like travel insurance so I bought it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wendy Migliore",
          "Nb_Reviews": 10,
          "Date": "2022-11-03T16:29:51.000Z",
          "Titre": "I hope never to have to use",
          "Contenu": "I hope never to have to use, but it's great to know my tickets are protected.  Purchased one time before-had to cancel-but was not refunded.  Hope this doesn't happen again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kirk Larsen",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T23:46:23.000Z",
          "Titre": "A bit difficult to locate seats but…",
          "Contenu": "A bit difficult to locate seats but after selection, the website worked well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Quigg Jr.",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T18:17:24.000Z",
          "Titre": "How easy it was to make the purchase…",
          "Contenu": "How easy it was to make the purchase and secure the tickets"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Quinn",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T00:51:06.000Z",
          "Titre": "It was a little hard to decipher the…",
          "Contenu": "It was a little hard to decipher the ticket I needed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Camilla Hull",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T23:47:55.000Z",
          "Titre": "It took me 1.5 hours to buy tickets……",
          "Contenu": "It took me 1.5 hours to buy tickets… very confusing. Only 10 seconds to add fanshare."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T01:56:19.000Z",
          "Titre": "Fairly easy",
          "Contenu": "It was fairly easy but I tried to reset my forgotten password and it never sent the recovery email so I had to create another account using my secondary email"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Belinda Poore",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T21:22:33.000Z",
          "Titre": "Protection of tickets",
          "Contenu": "This company has protected my ticket purchase just in case of illness or weather or cancelation of the show. When the show wouldn't."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Wolff",
          "Nb_Reviews": 2,
          "Date": "2022-09-09T00:18:09.000Z",
          "Titre": "I didn’t realize I needed a Doctors…",
          "Contenu": "I didn’t realize I needed a Doctors letter specifically saying I should not participate in the Half Marathon I signed up for with insurance. Fortunately my Physical Therapist was able to provide the documents. I needed to scan the documents because Because photos were not legible. After these issues were resolved  I received the refund within 30min. Pretty amazing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerrick Bourgeois",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T02:34:57.000Z",
          "Titre": "You have a time limit on putting all…",
          "Contenu": "You have a time limit on putting all the formation in. I had to reset my account and it timed out on me three times. Please give a bit longer for us to accomplish all of this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lorenzo",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T23:57:08.000Z",
          "Titre": "I struggled with downloading the acceptable document format",
          "Contenu": "I struggled with downloading the acceptable document format. I had to return multiple time to submit my claim with the accepted format which was extremely frustrating, confusing and timely."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Emira",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T14:23:52.000Z",
          "Titre": "Insurance",
          "Contenu": "I signed up for a charity run and was offered coverage (RegShield) which covers a reimbursement for the charity run (just in case it doesn't happen)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helen",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T23:01:47.000Z",
          "Titre": "easy to understand and completed in a time fashion",
          "Contenu": "First request. no comments at this time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Flowers",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T17:21:54.000Z",
          "Titre": "Everything was self explanatory",
          "Contenu": "Everything was self explanatory. This was for someone that is not “computer savvy !”"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sallie Wolff",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T18:35:06.000Z",
          "Titre": "Easy peasy",
          "Contenu": "Very simple to use glad that I have protection for my tickets if something happens."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cynthia Sumpter",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T04:54:10.000Z",
          "Titre": "Excited JO KOY is coming to AUGUSTA",
          "Contenu": "EXCITED JO KOY IS COMING TO AUGUSTA"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina Nenema",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T17:25:38.000Z",
          "Titre": "It had me enter my payment method and…",
          "Contenu": "It had me enter my payment method and other personal info twice. So I hope my card isn’t charged twice."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tanis Henrickson",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T11:49:26.000Z",
          "Titre": "I’m glad this was available",
          "Contenu": "I’m glad this was available. Seems resemble."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jolaine Snyder",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T02:13:17.000Z",
          "Titre": "It was really easy to navigate your…",
          "Contenu": "It was really easy to navigate your website and figure out what I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derwin Smith II",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T15:55:31.000Z",
          "Titre": "Four Star",
          "Contenu": "Not 5 star due to confusion caused by co-mingling bowl ticket and Memphis game ticket information."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T04:38:32.000Z",
          "Titre": "I was impressed with the efficiency …",
          "Contenu": "The only reason I didn’t give 5 stars is the option for an etransfer to have money refunded should be available"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cynthia Steiger",
          "Nb_Reviews": 3,
          "Date": "2022-01-21T05:22:35.000Z",
          "Titre": "Refund",
          "Contenu": "When we were not able to attend a New Year's Eve event that we purchased tickets for due to COVID, Aaron was able to assist us in getting a refund. He escalated our case due to the circumstances and followed up with us immediately. As a result, we got a full refund, which was processed within 24 hours. This was a major purchase for us, so we appreciated his help and assistance."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kim Klassen",
          "Nb_Reviews": 2,
          "Date": "2022-10-30T00:20:43.000Z",
          "Titre": "Super easy to do right when registering…",
          "Contenu": "Super easy to do right when registering for my race. Good price point."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2022-03-15T23:46:05.000Z",
          "Titre": "True to Their Word",
          "Contenu": "I was a little skeptical at first that I would get my money back from a triathlon insurance policy, but Fan Shield came through. I did have to provide proof of injury, which was no issue. I do question multisport companies claiming you can collect for any reason, which you can't."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ruben Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T06:22:23.000Z",
          "Titre": "Could of been more simple"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ted Henry",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T22:37:08.000Z",
          "Titre": "I ordered one ticket",
          "Contenu": "I ordered one ticket, and I was charged for two standing room only tickets.  What happened?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Carey",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T02:31:55.000Z",
          "Titre": "good experience.",
          "Contenu": "it was very easy to get thru."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TARJ",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T05:59:01.000Z",
          "Titre": "Quick",
          "Contenu": "I never new this was such a thing. I do now & I'm glad."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Wray Lamb",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T22:51:25.000Z",
          "Titre": "maybe?",
          "Contenu": "Trying to understand the purpose of this"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Botke",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T03:50:13.000Z",
          "Titre": "Easy to purchase tickets."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick Iadicicco",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T12:12:20.000Z",
          "Titre": "I am glad we purchased the insurance as…",
          "Contenu": "I am glad we purchased the insurance as my daughter became ill and we as a family could not attend the event that we had purchased the tickets for. Working with FanShield was easy and we received very quick response and claim settlement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Annette Ibarra",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T02:06:49.000Z",
          "Titre": "It was easy and they  made it easy to…",
          "Contenu": "It was easy and they  made it easy to pick the coverage."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Lucille Bernard",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T21:58:34.000Z",
          "Titre": "It was easy to access this",
          "Contenu": "It was easy to access this. If I have to make a claim I hope it is as easy."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ehsan D",
          "Nb_Reviews": 1,
          "Date": "2022-04-02T02:05:26.000Z",
          "Titre": "I will try this again!",
          "Contenu": "Although I was contacted by them after 10 days of cancelation claim submission, the agent was so nice and helpful. She worked with me and understood my situation very well and facilitated the refund."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "swms",
          "Nb_Reviews": 9,
          "Date": "2022-10-15T05:01:11.000Z",
          "Titre": "quick to order thanks",
          "Contenu": "quick to order thanks . yeah state fair 2022! please monday don't rain"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dulce Ochoa",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T17:13:55.000Z",
          "Titre": "Good",
          "Contenu": "Good. .. easy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Martin",
          "Nb_Reviews": 3,
          "Date": "2022-10-22T04:42:52.000Z",
          "Titre": "Easy to do and I believe it is a good…",
          "Contenu": "Easy to do and I believe it is a good idea in these crazy times."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dennis",
          "Nb_Reviews": 3,
          "Date": "2021-04-21T18:48:33.000Z",
          "Titre": "Big fan of FanShield/RegShield…",
          "Contenu": "I've purchased FanShield/RegShield products multiple times to cover me in tough situations. I like that's embedded right in the platform I'm using. 2020 was a tough year and I lost my job, FanShield was there for me!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MICHAEL",
          "Nb_Reviews": 3,
          "Date": "2020-03-12T09:44:48.000Z",
          "Titre": "What are the chances?",
          "Contenu": "I always purchase insurance for this very reason. I bought tickets, they were expensive and then my job booked me for a conference out of state the same week. I did recover the full costs of my tickets but there was a bit of hoop jumping. I realize the company needs to protect itself from folks making up reasons they can't attend an event or just maybe later realizing they'd rather keep the money. But they required company letterhead and a signed letter from my supervisor; which I was able to provide BUT my letter didn't cover both tickets, even though I bought both tickets and the insurance, so be aware."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aurolyn",
          "Nb_Reviews": 7,
          "Date": "2022-10-25T05:33:02.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use the casino site, and make my purchases."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Robert Caines",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T22:25:17.000Z",
          "Titre": "Easy to followhockey",
          "Contenu": "Easy to follow"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca Gibbs",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T06:51:42.000Z",
          "Titre": "Very easy to purchase"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Beatty",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T20:49:46.000Z",
          "Titre": "Protecting your investment",
          "Contenu": "Nothing more to add"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Pawenski",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T02:57:30.000Z",
          "Titre": "ticket purchase",
          "Contenu": "Very easy to complete purchase. Appreciate the opportunity to purchase inexpensive insurance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan Finn",
          "Nb_Reviews": 2,
          "Date": "2022-10-27T23:34:29.000Z",
          "Titre": "Straight forward",
          "Contenu": "Straight forward.  It was easy to purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roy Stotts",
          "Nb_Reviews": 3,
          "Date": "2022-10-27T06:48:56.000Z",
          "Titre": "Price was not listed.",
          "Contenu": "The cost of the protection was not visible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy N",
          "Nb_Reviews": 3,
          "Date": "2020-08-26T03:59:44.000Z",
          "Titre": "Helpful despite unsuccessful phone attempts",
          "Contenu": "My rating is based on two very separate issues.  If I were to rate FanShield's service, I would have to give them a 5 star.  We needed to take advantage of our trip insurance after missing an event due to the illness of a family member.  FanShield was quick to respond and issue a reimbursement to us via our choice of methods.  However, I am only rating them as a 4 star because it was impossible to reach them on the phone. On several attempts, I was continually told the wait time was over two hours.  Perhaps due to COVID, but who knows.  I was able to COMPLETELY resolve my issues by leaving a review on this site.  FanShield immediately reached out to me and solved my problem.  I appreciate their time and helpfulness in sending my reimbursement."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ali",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T19:43:10.000Z",
          "Titre": "Great",
          "Contenu": "Its was straight forward."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Logan White",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T08:10:49.000Z",
          "Titre": "They have help me with my refund…",
          "Contenu": "They have help me with my refund request. I never anticipated that I can not attend to the event. Thankful that they were able to help me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tammie Braun",
          "Nb_Reviews": 1,
          "Date": "2021-11-23T04:53:32.000Z",
          "Titre": "Beware...they have their fine print…",
          "Contenu": "11.21.21 UPDATE: Corey from Fanfare reached out to me to discuss the matter. He was incredible in his handling of the situation. He understood my frustration and vowed to help make some changes so that there is less confusion of coverage in the future and he got us our money back. I will use Fanfare again in the future but i will make sure that I understand the basics of the fine print first. Beware...they have their fine print worded in such a way that they can basically get out of almost any claim. They state directly in their advertising that they cover illness, however, in their terms and conditions they state that they don't cover pandemics. I took this to mean that they would not cover claims if there was a large outbreak and the event was cancelled... that is not the case. They do not cover Covid claims at all! IMO this should be CLEARLY stated on the front of their advertising."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judy Halone",
          "Nb_Reviews": 2,
          "Date": "2022-11-09T21:41:33.000Z",
          "Titre": "Easy to purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 2,
          "Date": "2020-03-26T13:37:24.000Z",
          "Titre": "Redundancy",
          "Contenu": "While in the end I did receive my refund, there was a lot of redundancy.My doctor’s note said it all but was asked multiple times over to give the same information."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug Rice",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T19:46:17.000Z",
          "Titre": "First time",
          "Contenu": "First time to use them. Price seems fair."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allena Adams",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T23:33:15.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, got the job done"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Constance Slinn",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T01:47:22.000Z",
          "Titre": "Process too complicated"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kimbrely Vickers Dunning",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T00:22:36.000Z",
          "Titre": "Very good experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Christine Tagle",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T21:25:12.000Z",
          "Titre": "Easy to buy ticket"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gina Gorga",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T16:49:19.000Z",
          "Titre": "Nice and quick"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phil Schaller",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T21:07:44.000Z",
          "Titre": "Quick and easy process"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 2,
          "Date": "2020-03-11T17:07:46.000Z",
          "Titre": "pretty easy process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy E. Hartenstein",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T04:29:22.000Z",
          "Titre": "Natasha is what made my experience…",
          "Contenu": "Natasha is what made my experience great!  Her customer service and people skills are beyond words.  On November 15th (my 37th wedding anniversary) I was in Nashville from Florida.  My husband and I had chicken for lunch and contracted food poison.  We had to cancel our anniversary dinner reservation that night and the dinner cruise we were scheduled for on the night of November 16th.  We were unable to go anywhere after eating the chicken until we checked out on the 19th.  Initially, we were denied our refund for the dinner cruise ($286.74).  Finally after numerous frustrating e-mails, Natasha reached out and resolved the issue in an extremely short amount of time.  I really don't think we would have received our refund had it not been for her and her dedicated customer-oriented approach.  Natasha certainly showed her integrity and went over and beyond to get us a positive resolution.  She is a role model for her co-workers.  You are fortunate to have her in your company.  Rick & Kathy Hartenstein"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Love this company",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T15:56:30.000Z",
          "Titre": "Quick and easy !",
          "Contenu": "They made my process of getting my money back quick and easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kahlil Herring",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T18:03:26.000Z",
          "Titre": "no fun at six flags",
          "Contenu": "At first they denied my request for a flooded out day, which my friend and I were supposed to attend six flags. I sent them the app “Waze” real time traffic updates of how things were closed and how they were multiple crashes blocking main ways to get there.I explained all this the first time, it wasn’t enough. The second time, after I was denied the first, ended up having to send articles of the day and how highways near me were flooded , was approved right away. Great communication , just send hardcore evidence first time round and you should be fine."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "S P",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T20:25:25.000Z",
          "Titre": "Fanshield has an amazing Customer Service Agent",
          "Contenu": "Natasha was the first agent I initially spoke with and was extremely helpful throughout my whole refund experience! It was so nice to actually have an agent who knew her job and was so pleasant to deal with (in this day and age it is a rarity!) I wish all the companies I contact and have to deal with were exactly like Natasha!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "E Marie Rose",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T13:06:37.000Z",
          "Titre": "Madam/Sir",
          "Contenu": "Madam/Sir,  Our experience with FanShield was greatly enhanced by Natasha P. in Customer Support.  She was professional and very helpful.  She helped me file my request and when I \"snail mailed\" the requested documents she tracked them down and submitted them. Because, in part, of her diligence we received a full refund as requested. My husband and I are very grateful.Ellen Marie Rose"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "joe vollink",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T22:48:38.000Z",
          "Titre": "promote jacob in customer service and give him a raise",
          "Contenu": "Jacob took down my problem after I discussed it with him...........fanshield involved themselves in helping me solve a problem with another company.......I do not know exactly what they did, but it played some role in me getting a refund that I otherwise would not have gotten............the problem affected their business as well as me personally, and they evidently brought up my case to bookonline.com and in communicating with them regarding fraudulent business practice,  secured for me a refund as I was originally told I would get.......Impressed with fanshield customer service and especially Jacob, a team lead...........give him both a raise and a promotion for helping me......Joe Vollink"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Two n a Tub",
          "Nb_Reviews": 3,
          "Date": "2023-04-25T21:31:06.000Z",
          "Titre": "Considered. Fair. Fantastic. Personable.",
          "Contenu": "Cameron is so kind. Extremely patient. Because our reason for filing a claim was based on Mom’s death…emotions were at there peak. He is a thoughtful listener. I was guided by him every step of the way on how to prepare the claim. The process was painless, because of the excellent consideration extended to us by Cameron and the entire team. Thank you very much. We will definitely choose your company again. The Smalls Family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darnyl",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T01:33:34.000Z",
          "Titre": "First time that I had to submit a claim",
          "Contenu": "First time that I had to submit a claim. I was very skeptical, and honestly expected a hassle.  But, FanShield made the whole process so easy!  I consider myself technology challenged, and the process was very straight forward.  Receiving a refund was also very quick.   I wouldn’t hesitate to ever use them again!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Anna Maria Drouin",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T22:49:50.000Z",
          "Titre": "Natasha was so helpfull, professional, polite, proud to work for your company, it showed in her voice she loved her job",
          "Contenu": "Natasha was so helpfull, she took matters into hands, found a solution for my problem.Natasha was polite , respectful , very professional.I had been bounced around from agent to agent, USA and Canada....Natasha knows her work, did not give excuses, took matters in hand, and found the solution to my problem. i will not need to call or write to your company again. great job Natasha your company is lucky to have hired you....."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George McKay",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T17:19:22.000Z",
          "Titre": "Great service during a tough time.",
          "Contenu": "I worked very hard to attend an important event but couldn’t due to unforeseen health issues. I had to call to get clarification about two areas in order to file a claim. The person answered the phone right away, not like other businesses that put you on hold forever. The gentleman was very professional, helpful and understanding. As a result, I filed my claim and received immediate information keeping me updated via emails. The process was simple, excellent and the matter resolved to matter satisfaction in a very short time. The entire process was handled very well and recommended anyone to use Fanshield."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T14:54:08.000Z",
          "Titre": "Quick refund when I had to withdraw from Boston Marathon",
          "Contenu": "I had an accident that left me unable to run, let alone train for and race the Boston Marathon. I sent the details and a doctor's letter confirming the injury and medical advice, and they very promptly paid out the amount of my registration fee. It worked as advertised, so 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "meaghan jennings",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T23:53:27.000Z",
          "Titre": "fast and easy process",
          "Contenu": "fast and easy process. have only had to cancel a race twice in my life for a very serious injury, and the other time was a nightmare trying to get a refund.  this was easy, allowed me to upload my doctor note and quickly followed up with my refund. would rather be doing the race but glad I purchased this policy because I definitely didn't expect to be out for 6 months.  Would use them again for peace of mind!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Shepard",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T19:57:26.000Z",
          "Titre": "Too Much Snow",
          "Contenu": "When I was filling out the online claim form, I was having difficulty uploading some support documents, so I called your customer service. The rep was very helpful, and I was able to successfully complete the form.  My claim was accepted within 3 hours, and I received my refund check in a week.  I was very pleased with your services, and will definitely recommend your company to all my friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scotty Hester",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T05:48:21.000Z",
          "Titre": "Amazing to work with",
          "Contenu": "I would like to speak about the prompt attention that the reoresenatives of Fanshield showed my family concerning a claim with their company. We spoke with Corey on the phone and he diligently collected our information and presented it to his fellow representatives. In 24 hours he was back in touch with us and refunded our money back from the tickets we were unable to use. He was very polite, respectful showing empathy about our situation. I would strongly recommend Fanshield and will be using them again in the future. Thanks again Corey, we really aporeciate you handling our claim."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald Burton",
          "Nb_Reviews": 3,
          "Date": "2022-11-28T23:45:10.000Z",
          "Titre": "Fanshield Came Through",
          "Contenu": "UPDATE: Fanshield contacted me and we were able to resolve my issue.  They honored my claim.  They misunderstood some information I sent them and once that was cleared up, all went well.  I am happy to say they have stood by their policy and would recommend them.  Just be aware that you need doctor notes or other documented proof for a claim.*******************I purchased their ticket insurance for the Opryland Oakridge Boys Christmas Show when booking the tickets on the Opryland website.   Unfortunately, I fell ill 2 days before and submitted a claim.  I then found out that there were only a limited number of reasons you could file a claim for and all required written proof. No problem, I got a note from the ER doctor. They denied my claim because my illness could be related to a pandemic! They further stated they would vigorously defend their company against any other claims..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Paez",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T14:29:42.000Z",
          "Titre": "This was very easy to use and is very…",
          "Contenu": "This was very easy to use and is very convenient. This is also a great way to protect your purchase in the result of natural disasters or just an emergency the family may have, trust me I’ve seen friends of mines buy tickets for other events and NOT buy protection and lost their money soooo don’t be that person pay extra and shield up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jed L.",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T07:41:37.000Z",
          "Titre": "As an insurance agent I know it’s…",
          "Contenu": "As an insurance agent I know it’s crucial to explain coverage in a simple manner and it was straightforward and easy to add on and felt reasonable for the cause. And no I wasn’t paid for the ad but I’m willing to accept gifts or donations?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID",
          "Nb_Reviews": 4,
          "Date": "2023-03-29T13:29:19.000Z",
          "Titre": "FanShield was there for me",
          "Contenu": "FanShield was there for me when I needed them. After suffering a severe injury that just wouldn't heal, I was unable to run the Boston Marathon. FanShield came through for me and refunded my entry fee. I highly recommend FanShield."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marquie Hembree",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T21:09:42.000Z",
          "Titre": "Natasha was absolutely amazing",
          "Contenu": "Natasha was absolutely amazing. She was very knowledgeable and tentative. She returned my calls promptly and almost with a sense of urgency, which I appreciated. She made my issue her issue and was very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bette Capelli",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T01:05:02.000Z",
          "Titre": "I spoke with customer service team…",
          "Contenu": "I spoke with customer service team members, Cameron, Jacob, Tyler and Seara. Each member was respectful and very helpful with the filing process and making sure I had all my questions answered. These four members are a true asset to your organization."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T05:15:38.000Z",
          "Titre": "Claim clarity with next day turnaround",
          "Contenu": "All information required to submit a claim for refund was well written. Information on what was required to submit was well written. Privacy was respected on medical claim. Refund was received the next day, deposited in my choice of place, i choosed PayPal, which then I transferred to my checking account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lahn Horton",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T22:47:12.000Z",
          "Titre": "First time user - Easy to Use",
          "Contenu": "I am a tech challenged elder, but easily got through the process, impressed myself.This process will give me the courage to try again. Thanks for making this novice comfortable. Lahn Horton"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D Havener",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T02:57:54.000Z",
          "Titre": "Illness forced cancellation. FanShield refunded registration.",
          "Contenu": "Purchasing the FanShield protection was an easy decision for me. I had personal experience with excellent service from FanShield last summer. I was signed up to ride the Triple Bypass in August, 2022. It was necessary for me to cancel because of a severe family illness. I submitted a claim and the process was very easy. They were responsive and compassionate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BrCr",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T22:59:01.000Z",
          "Titre": "Great Workers",
          "Contenu": "I did not consent to paying for the ticket protecting. It was just added to my payment without me clicking anything.Update: I was refunded and they went out of their way to make sure I got back my money. Thank you, Corey. I truly appreciate it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon W",
          "Nb_Reviews": 3,
          "Date": "2023-07-15T01:47:53.000Z",
          "Titre": "Pleased With Outcome",
          "Contenu": "Cameron was extremely helpful and able to get this resolved for me and took our situation into consideration. This was really important as he didn't just treat this as another transaction but took the time to listen and understand the situation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rita Schneider",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T00:37:14.000Z",
          "Titre": "Professional, Pleasant and Prompt",
          "Contenu": "Professional, Pleasant and Prompt. The communications I had with FANSHIELD's customer service were very helpful. They provided a quick return phone call and then follow-up email correspondence. Thank you FANSHIELD!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "JH",
          "Nb_Reviews": 10,
          "Date": "2023-03-23T23:25:20.000Z",
          "Titre": "Perfect efficiency- peace of mind",
          "Contenu": "Although you hope that booking a race you won’t have to withdraw I cannot fault the process and efficiency in applying for a refund.  Quick refund - would never question taking out again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T23:58:21.000Z",
          "Titre": "No hassle, fast response",
          "Contenu": "Unfortunately had to pull out of the Boston marathon due to a major injury. My claim was approved within an hour, and my money was returned the next day!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Williams",
          "Nb_Reviews": 3,
          "Date": "2022-12-03T12:52:41.000Z",
          "Titre": "Nascar Cup Series tickets -Having purchased tickets to a Nascar…",
          "Contenu": "Having purchased tickets to a Nascar event in 2023 I was unable at the time to purchase event insurance. However, I found that the insurance for the event was through Fanshield so I contacted them direct via email (This being the preferred contact method as I live in the UK and calling would have been extremely expensive). I received a prompt email detailing the method I needed to use to obtain the required insurance. However, due to personal circumstances I didn't use the link until some time later but was then informed that the link had expired. I emailed again and received a very gracious reply providing me with another link. I have now used this link and have purchased the insurance to cover all my costs associated with the event. Everything was dealt with expertly and with great support and service so keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AD",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T00:10:29.000Z",
          "Titre": "Fanshield Stands behind what they promise.",
          "Contenu": "I submitted a claim with FanShield because I got sick and was unable to attend a concert. I submitted the documentation that was required, yet my claim was declined. Fanshield contacted me directly and made the situation right by reimbursing me for my concert tickets! Highly recommend! If you need ticket insurance, use Fanshield!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carla",
          "Nb_Reviews": 3,
          "Date": "2022-12-03T10:04:20.000Z",
          "Titre": "Easy, affordable, peace of mind",
          "Contenu": "This option was available at time of purchase for my concert tickets which made it extremely easy! You never know what life is going to throw at you..I’m glad my time and money are protected!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kory",
          "Nb_Reviews": 3,
          "Date": "2023-03-12T02:01:41.000Z",
          "Titre": "My claim was settled within 24 hours",
          "Contenu": "My claim was settled within 24 hours.  Very quick and efficient service. The instructions were very clear.  I would highly recommend Fanshield for your next event."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 2,
          "Date": "2023-02-21T19:56:16.000Z",
          "Titre": "Corey provided great customer service",
          "Contenu": "Corey provided great customer service. He took his time and listened to my concerns. He was also very patient. I will use FainSheild for future ticket purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T02:03:18.000Z",
          "Titre": "After you received full information all…",
          "Contenu": "After you received full information all though , I had to send more information. Then I thought needed ,was glad I used your service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Ott",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T02:41:37.000Z",
          "Titre": "Great Insurance for Minimal Amount",
          "Contenu": "I did not have to use the insurance for this event that they wanted me to rate but I have used it in the past.  It is a great insurance policy at minimal cost to protect a large amount of money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T14:40:04.000Z",
          "Titre": "I feel that if the client pays the…",
          "Contenu": "I feel that if the client pays the extra cost for the insurance then a Dr excuse should not be required to be able to withdraw from a race."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "George Aprilov",
          "Nb_Reviews": 3,
          "Date": "2022-12-06T05:46:43.000Z",
          "Titre": "Easy to understand",
          "Contenu": "I'm buying for a running race. A reasonable price. Since COVID, you never know when an insurance would come in handy."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jane Worme",
          "Nb_Reviews": 4,
          "Date": "2022-11-23T03:45:16.000Z",
          "Titre": "Easy decision in a time of ongoing…",
          "Contenu": "Easy decision in a time of ongoing uncertainty. If I am spending over $200, I need to know I can get my money back if something goes wrong. With a family of seven, the odds of something going wrong are high!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Baum",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T17:29:09.000Z",
          "Titre": "Your \"additional fees\" would make…",
          "Contenu": "No concerns. Simple to use. Price point fair."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie",
          "Nb_Reviews": 13,
          "Date": "2022-12-01T18:55:37.000Z",
          "Titre": "Hear ye!  Hear ye!  The best Faire is about to begin!",
          "Contenu": "Very easy to place my order and get excited about going to this upcoming event!  And to know I’m protected if something unexpected happens."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roderick Williams",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T17:29:35.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy. It’s always good to have protection for life unforeseen events. I would highly recommend using FanShield"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Gay",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T20:39:39.000Z",
          "Titre": "So fast simple easy and hassel free",
          "Contenu": "I like how I can insure my tickets and it's hassel free and how easy it was to insure them and the price was set just right for my tickets purchased"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jess",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T15:48:15.000Z",
          "Titre": "It’s a no brainer….",
          "Contenu": "It’s a no brainer to have the option of protection during these crazy times we live in. Thank you for offering this as a piece of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anita Pittman",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T17:33:05.000Z",
          "Titre": "This was easy to understand",
          "Contenu": "This was easy to understand. It took no time at all to get tickets to my Grandson’s favorite musical, The Nutcracker."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "A. Helen Smith",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T20:57:12.000Z",
          "Titre": "I recommend.",
          "Contenu": "I found the staff very helpful after some challenges in recovering my expenses. I would not hesitate to use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 7,
          "Date": "2022-11-29T01:27:10.000Z",
          "Titre": "Simple to use",
          "Contenu": "Simple to use. Did not use on previous tickets that we had to cancel that sucked and we said never again so this little cost brings some peace of mind"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Graciela Pacheco",
          "Nb_Reviews": 5,
          "Date": "2022-11-29T02:05:32.000Z",
          "Titre": "The peace of mind knowing that I could…",
          "Contenu": "The peace of mind knowing that I could proceed without worrying if I couldn't make this event and lose my money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan B of Greeley Colorado",
          "Nb_Reviews": 7,
          "Date": "2022-11-30T23:33:44.000Z",
          "Titre": "Very Easy",
          "Contenu": "All I had to do is click on the protection plan area. Nothing to it. Now I feel safe in case anything comes up. We never know when we'll have a blizzard here in Colorado."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Cohen",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T21:39:34.000Z",
          "Titre": "First time I bought insurance for…",
          "Contenu": "First time I bought insurance for ticketsEasy to doAt the event I slammed the car door on my daughter’s 3 fingers Somehow…I don’t know how…I really don’t …all she needed was a bandaid and ice. It felt soooo good knowing that I wouldn’t be out $50+ but just the $10However we were able to enjoy the event"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Graham Tolley",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T14:24:24.000Z",
          "Titre": "Ticket insurance",
          "Contenu": "It was priced reasonably and it's a great way to protect yourself from losing money if you can't attend the event. I hope I don't need to use it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheila Reid",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T15:49:14.000Z",
          "Titre": "Getting early tickets of any kind is…",
          "Contenu": "Getting early tickets of any kind is always a concern in hopes all will be good to attend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Merrie Jo",
          "Nb_Reviews": 7,
          "Date": "2023-06-15T18:03:17.000Z",
          "Titre": "Agent Contact is important.",
          "Contenu": "Cameron kept in contact with me and helped me submit the papers I needed to get my refund."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samantha Bergner",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T17:05:43.000Z",
          "Titre": "Nutcracker tickets",
          "Contenu": "We had no problems at all with our tickets or understanding what the emails were saying."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amelia Aguirre",
          "Nb_Reviews": 2,
          "Date": "2023-04-26T21:31:44.000Z",
          "Titre": "Cameron S 👍🏼",
          "Contenu": "Cameron S made my experience quick and easy. He is very helpful and great at his job. Thank you Cameron!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Runner with serious injury",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T02:14:06.000Z",
          "Titre": "Timely response to claim",
          "Contenu": "Timely response to claim; easy to download supporting documents; immediate feedback re: received documents & review. Ease of reimbursement: directly deposited into bank account. Very low upfront cost for this efficient, organized, timely service for a very unfortunate runner. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T00:34:24.000Z",
          "Titre": "Fastest claim processing ever",
          "Contenu": "Fastest claim processing ever! Ten minutes after filing my claim, it had been approved and the money was in my account. Amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Michael",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T14:35:12.000Z",
          "Titre": "First time that I have purchased this",
          "Contenu": "First time that I have purchased this. Hopefully I won’t need to use it. Pretty easy to select it. Description of the service is simple and easy to understand."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T13:48:16.000Z",
          "Titre": "Very clear guidelines",
          "Contenu": "Very clear guidelines. Prompt replies to questions. Clear claims procedure. Excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Warren",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T05:38:20.000Z",
          "Titre": "Ticket protection insurance",
          "Contenu": "The protection insurance for the tickets was easy to find on the checkout page. Pricing was also good."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Aaron Justice",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T14:32:25.000Z",
          "Titre": "It was easy to purchase",
          "Contenu": "It was easy to purchase, only thing is that I wish there wasn’t a time limit when purchasing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IN customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T03:16:14.000Z",
          "Titre": "Simple claim process, FAST refund!",
          "Contenu": "The claim process was simple to understand. Approval was swift and refund was issued the next day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike C.",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T03:05:48.000Z",
          "Titre": "Thank you FanShield!",
          "Contenu": "I was very happy with FanShield.   The claim process was very organized and fair.   They delivered on their promise and that is all I could ask for.  Thank you FanShield!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth A.",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T16:51:03.000Z",
          "Titre": "It's a pleasure doing business with you!",
          "Contenu": "For unexpected medical reasons, we were unable to attend an insured event. After submitting the necessary paperwork and answering a promptly sent email, my insured event was immediately reimbursed.  This, by far, is the fastest insurance reimbursement I have received in the 45 years I've been buying insurance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis Bruno",
          "Nb_Reviews": 2,
          "Date": "2022-12-02T01:18:38.000Z",
          "Titre": "The ease of purchasing tickets was…",
          "Contenu": "The ease of purchasing tickets was simple and quick, my grandchildren will love the show."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S W",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T17:04:46.000Z",
          "Titre": "Fanshield followed up after claim was initially denied",
          "Contenu": "Update to the below initial review: I received a follow up call and email from Corey, from Fanshield Customer relations, who explained that Fanshield has been reaching out to people who are denied claims by their partnering insurance company, to cover the claims directly 'out of the pocket' of Fanshield. So, ultimately though the claim was initially denied, Corey ensured I was compensated. I greatly appreciated the kindness and thorough follow-up.Original review: I bought this insurance for an event because it was advertised as  \"covering illness\".   I noticed others on this site buying this insurance due to uncertainty of COVID related events (as did I), but you should be aware, once you get the insurance you learn that they don't cover COVID, and will deny your claim if that is the illness that prevented your ability to attend the event.  My claim was denied due to \"no coverage for a pandemic\" even though they advertise that it is insurance that will cover illness, and even though I provided the requested documentation."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Toropinky",
          "Nb_Reviews": 3,
          "Date": "2022-11-23T00:49:11.000Z",
          "Titre": "It is an insurance you feel obligated…",
          "Contenu": "It is an insurance you feel obligated to purchase in case you get sick and loose your money on your ticket."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon Sweitzer",
          "Nb_Reviews": 3,
          "Date": "2022-12-04T07:16:50.000Z",
          "Titre": "Fast and easy!",
          "Contenu": "Super fast and very easy! Always good toHave insurance for events. Especially in this day and age. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randa Erlich",
          "Nb_Reviews": 2,
          "Date": "2022-12-04T19:06:11.000Z",
          "Titre": "just my 2 cents",
          "Contenu": "easy to use cheap for what u get incase u cant make concert. foolvnot to purchase this with tickets"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cherie",
          "Nb_Reviews": 4,
          "Date": "2022-12-06T19:47:09.000Z",
          "Titre": "Loved having the seating chart",
          "Contenu": "Loved having the seating chart so I could see exactly what I was getting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Peters",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T21:34:10.000Z",
          "Titre": "Was glad this was available in today’s…",
          "Contenu": "Was glad this was available in today’s atmosphere. Never know what can cause the need to change plans"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jennifer Russell",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T21:35:31.000Z",
          "Titre": "Perfect",
          "Contenu": "Perfect! Very easy to do. Clearly laid out. Thank you for making this a simple procedure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Herbert Carter",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T01:53:03.000Z",
          "Titre": "I had questions about coverage and…",
          "Contenu": "I had questions about coverage and Sofia was able to help with my concerns"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine Green",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T05:17:23.000Z",
          "Titre": "It was very easy.",
          "Contenu": "It was very easy and directions were clear on purchasing my tickets."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Mercuro",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T15:45:57.000Z",
          "Titre": "Quick and Easy purchase",
          "Contenu": "Quick and Easy purchase. Listed as option Ticket purchase page instead of being directed to another site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Mcdiffett",
          "Nb_Reviews": 2,
          "Date": "2022-11-28T20:06:49.000Z",
          "Titre": "Comfort for protection from life!",
          "Contenu": "It is a great comfort to know that our purchase is covered when life happens!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T00:07:08.000Z",
          "Titre": "Great experience",
          "Contenu": "Had a great experience. Took awhile but with the right people everything was able to be sort out and got my money back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T22:50:54.000Z",
          "Titre": "Tyler was wonderful very pleasant and…",
          "Contenu": "Tyler was wonderful very pleasant and very eager to assist me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mekamac",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T20:58:19.000Z",
          "Titre": "Ordering my tickets were easy and I…",
          "Contenu": "Ordering my tickets were easy and I look forward to enjoying my event!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phyllis Howie",
          "Nb_Reviews": 2,
          "Date": "2022-11-25T20:39:02.000Z",
          "Titre": "It was very self explanatory in that it…",
          "Contenu": "It was very self explanatory in that it listed all legitimate reasons for cancelling if we need to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Godsey",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T21:38:28.000Z",
          "Titre": "Easy and quick to use",
          "Contenu": "The site was quick and easy to use.Victorian Country Christmas Here we come."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Breymann",
          "Nb_Reviews": 3,
          "Date": "2023-03-09T03:00:37.000Z",
          "Titre": "Extremely prompt turnaround time from…",
          "Contenu": "Extremely prompt turnaround time from submission of my claim to it being accepted and reimbursed."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mercedes L. Picot",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T17:29:49.000Z",
          "Titre": "It was easy to purchase -",
          "Contenu": "It was easy to purchase - about an hour ago - so I can’t comment any further yet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Ann",
          "Nb_Reviews": 4,
          "Date": "2022-12-06T19:05:25.000Z",
          "Titre": "Protection for your purchase in the…",
          "Contenu": "Protection for your purchase in the event you can't go."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aryanna Jessup",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T00:59:48.000Z",
          "Titre": "Because I don't want anyone to the…",
          "Contenu": "Because I don't want anyone to the ticket I paid for and get it lost"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler Jenkins",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T15:11:43.000Z",
          "Titre": "It was just seamless…",
          "Contenu": "It was just seamless and not confusing to get insurance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn M",
          "Nb_Reviews": 2,
          "Date": "2022-11-23T07:20:58.000Z",
          "Titre": "Ease",
          "Contenu": "Easy to protect myself with my purchase in just one click!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon Gallimore",
          "Nb_Reviews": 3,
          "Date": "2022-11-28T00:48:23.000Z",
          "Titre": "Excellent",
          "Contenu": "This is the best ticket experience I ever saw."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy  Strum",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T18:50:34.000Z",
          "Titre": "The site was easy to use",
          "Contenu": "The site was easy to use, prices were perfect, enough tickets to go around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly White",
          "Nb_Reviews": 2,
          "Date": "2022-11-28T07:16:16.000Z",
          "Titre": "Very easy to use and purchase tickets",
          "Contenu": "Very easy to use and purchase tickets. Receipts we're sent right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Harris",
          "Nb_Reviews": 2,
          "Date": "2022-11-25T00:52:33.000Z",
          "Titre": "Easy to do for an old guy with no…",
          "Contenu": "Easy to do for an old guy with no experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEVE",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T05:22:46.000Z",
          "Titre": "Easy purchase from the Drum Corps…",
          "Contenu": "Easy purchase from the Drum Corps International Web site on-line."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabriela Juniewicz",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T03:59:38.000Z",
          "Titre": "Very easy to buy tickets.",
          "Contenu": "It was easy to get the tickets and the checkout process was fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RFD",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T05:41:47.000Z",
          "Titre": "Really liked being able to see and pick…",
          "Contenu": "Really liked being able to see and pick open seats in seating chart.  Everything was easy and fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BEVERLY BRIMLEY",
          "Nb_Reviews": 4,
          "Date": "2022-11-27T08:44:50.000Z",
          "Titre": "Easy and Quick",
          "Contenu": "Easy and fast with prompt email confirmations"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Hanson",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T03:56:47.000Z",
          "Titre": "Easy to work with",
          "Contenu": "FanShield very responsive when I had a question"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T13:38:35.000Z",
          "Titre": "Love that this is available and…",
          "Contenu": "Love that this is available and affordable."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Peter Sullivan",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T03:22:05.000Z",
          "Titre": "Fast easy service",
          "Contenu": "Fast easy service. Well laid out and explained."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanya Dunlap",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T08:56:05.000Z",
          "Titre": "It was easy to understand how to make…",
          "Contenu": "It was easy to understand how to make the purchase"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Adam Deleebeeck",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T15:29:12.000Z",
          "Titre": "Simply laid out not complicated or…",
          "Contenu": "Simply laid out not complicated or confusing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stewart Davis",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T00:28:26.000Z",
          "Titre": "Easily to Understand and not a bad price"
        }
      ]
    }
  ]
}