{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "fastcomments.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "frajer sprayer",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T00:49:52.000Z",
          "Titre": "Absolute garbage",
          "Contenu": "Absolute garbage, I have no clue why anyone would use this for example instead of disquis which is free iirc.Main issues:90% of the time I can't login because they apparently don't believe in passwords for some reason and I have to wait a hour before I get an email where I can sign in and after that I can finally leave a comment, great.Automatical login doesn't work, it opens a pop-up window saying \"singing you in, this window will close in few seconds\" yet it doesn't actually sign you in and never closes.Also they may randomly delete your account and just make you a new one with everything reset. (yes this happened to me)If I were to make make a slogan for this service it would be something like: FastComments, making commenting a pain, and after singing in you won't even remember what you wanted to say."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T12:52:48.000Z",
          "Titre": "Unhelpful",
          "Contenu": "Despite everything being easy to follow, in practice, none of their tools worked. And the support was unhelpful and stopped responding to genuine questions about implementing the product or getting around the issues. They then had the nerve to ask for a review AFTER going radio silent.This is that review. Good product in theory, bad in execution, so average at best."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-02T12:44:36.000Z",
          "Titre": "Good",
          "Contenu": "Good but how to view replies to my comments"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Joseph George Freelance",
          "Nb_Reviews": 1,
          "Date": "2024-01-01T07:06:23.000Z",
          "Titre": "It's good",
          "Contenu": "It's good . I hope it's free service , not like trial service."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sonia K",
          "Nb_Reviews": 15,
          "Date": "2023-02-07T16:38:59.000Z",
          "Titre": "I was able to correct an issue easily",
          "Contenu": "I was able to correct an issue easily, so I could use the platform."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dr Miguel Toribio-Mateas",
          "Nb_Reviews": 1,
          "Date": "2024-01-17T06:02:02.000Z",
          "Titre": "I would leave a 10-star review if it…",
          "Contenu": "I would leave a 10-star review if it were available. From an initial pre-sales enquiry to having FastComments working on my Squarespace site and my existing Squarespace comments imported in a matter of hours. Second-to-none customer support by Devon, who was polite, incredibly helpful and FAST at replying to my emails. It felt like real-time chat! I'm delighted with the experience as a customer, and the plugin looks amazing on my site, so I couldn't be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Wakeman",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T17:36:21.000Z",
          "Titre": "Fast, friendly, outstanding service",
          "Contenu": "Some members were having a problem with setting up their account to use the comments on a gated platform. Within minutes of submitting my support request, I had a response and the developer worked with me to - well, he did ALL the work - to create a seamless experience. It's my second experience with their support and both times they've been fast, friendly and quick to implement or help me with a solution. I'm a fan! Thanks, Devon for your outstanding service!"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Sergey Kyrychenko",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T09:55:17.000Z",
          "Titre": "Best technical support and project implementation",
          "Contenu": "Faced with the problem of searching for a widget with a comment, we searched for a long time and found what we needed. In 2 days we were able to collect all the necessary look and functionality of the comments widget, the technical support is the best, they respond quickly and for nits there are no problems that they cannot solve. I recommend it to everyone, the widget is worth using all the time."
        },
        {
          "Note": 5,
          "Lieu": "EE",
          "Pseudo": "Herman Aus",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T22:37:02.000Z",
          "Titre": "I really love FastComments",
          "Contenu": "I really love FastComments. This has incredible potential to be used in online courses, live streamed challenges, etc. I love how seamlessly it integrates, and how easy it is to set up and customize. As a web designer, I also really appreciate the ability to have CSS-level control over the UI. I will for sure be coming back to FastComments for other projects still, and also recommending it to my clients. Great work!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Philip Smith",
          "Nb_Reviews": 3,
          "Date": "2022-08-23T18:17:00.000Z",
          "Titre": "This is actually the best comment…",
          "Contenu": "This is actually the best comment section integration on web pages ever. I've been using fast comments for over a year now, check out how useful they are on my following sites. aledxa.github.io philipsmith6175.github.io & Many more......"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T01:13:34.000Z",
          "Titre": "The best, and I've tried them all",
          "Contenu": "Lightening fast, totally customizable, great support. I have no idea why everyone isn't using this comments plugin."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T00:35:39.000Z",
          "Titre": "Great product with top tier support!",
          "Contenu": "We are using this product in one of our React apps and it has been exactly what we were looking for! I would highly recommend it for people to use. Their customer support is top tier as well. I've worked with a handful of third-party services and their support teams and I can say I've never seen one as responsive and knowledgeable as I've had with FastComments. Keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Balthazar Tropp",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T10:09:19.000Z",
          "Titre": "THey are just the best",
          "Contenu": "THey are just the best ! Awesome support, who took hours to install the plugin on our website, and they even took the time to fix some random issues that had nothing to do with their plugin ! I Strongly recommand fastcomments !"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Julien Watine",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T02:15:31.000Z",
          "Titre": "Best product out there for comments",
          "Contenu": "Best product out there for comments. And I also had the pleasure to ask for help whilst still being on the free trial, and I received fast and reliable service. What can you ask more?"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Thabo",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T12:25:21.000Z",
          "Titre": "This is one well thought out product",
          "Contenu": "This is one well thought out product, especially from a developer integration point. Simple, yet powerful. And you get real help when you get stuck (twice it was my code that was causing the issue, and both times it was their support that pointed it out to me)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Zanussi",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T05:29:27.000Z",
          "Titre": "I ❤️ FastComments",
          "Contenu": "When I was building my personal site/blog I spent quite some time looking for the best way to add comments, including building my own, but eventually landed on FastComments. The key aspects that won me over are that it has a ton of features, doesn't require commenters to create accounts, offers a React library, and collects as little data as possible. In addition their support is super responsive and helpful."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Konstantinos Karasantes (KarasantesCom)",
          "Nb_Reviews": 27,
          "Date": "2023-06-15T12:48:33.000Z",
          "Titre": "Best value for money shared web site hosting for Beginners",
          "Contenu": "Best value for money shared web site hosting with cpanel , good support .if you are junior web site developer with small and medium HTML 5 /CSS  and small / medium business presentation static wordpress sites, then fastcomment is best of the best company with best control panel and best price for 3 years subscripion period  !"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MARCA Admin",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T00:14:56.000Z",
          "Titre": "Support has been too notch",
          "Contenu": "Support has been too notch, really excited about the product and had a few niggles that have been ironed about Devon - can’t recommend enough"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A Hamilton",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T21:06:09.000Z",
          "Titre": "Very pleased",
          "Contenu": "Very pleased! I implemented/tested 2 other commenting systems (and thoroughly researched several) before deciding on FastComments. I am so happy with the easy installation, robust, up-to-date, and user-friendly documentation (I am not a developer), and many customization options. The UI (design/how it looks) is simple but pleasing. Privacy and security were also very important to us, as well as the option for anonymous commenting. (We use this on our Squarespace 7.1 blogsite.) Thank you, FastComments!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "God’s power Emmanuel",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T03:05:23.000Z",
          "Titre": "Fastcomments has been a wonderful and…",
          "Contenu": "Fastcomments has been a wonderful and easy training and comfortable  program for me, have learnt a lot, fastcomments have impact in me one way or the other, and I believe it has impact in others too, around the world, it’s amazing to discover much more in fastcomments training program growth and progress marketing business opportunities e.t.c."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "N. Hervey",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T07:41:59.000Z",
          "Titre": "FastComments has a clean design which I…",
          "Contenu": "FastComments has a clean design which I love. It was easy to install into my website and the widget definitely helps to engage with members. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Travis Martin",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T17:29:31.000Z",
          "Titre": "Support team is great",
          "Contenu": "Devon was really fast to respond to us and helped us code our widget so it worked with our website. So far so good, a lot cheaper than other options and it just works."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "OV",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T21:11:30.000Z",
          "Titre": "Outstanding support",
          "Contenu": "The support at FastComments is of highest quality. Reply to my question via email was fast and they even troubleshooted a widget just to get it working on my blog."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Silvia Angel",
          "Nb_Reviews": 3,
          "Date": "2023-05-19T13:34:44.000Z",
          "Titre": "Great comments system for blogs/websites, and their support is excellent!!!!",
          "Contenu": "I came across this comments system by chance.... glad I did. It is a great comments system for blogs/websites, and their support is excellent!!!!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Pedro Venancio",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T01:15:03.000Z",
          "Titre": "Amazing dont have more words",
          "Contenu": "Amazing dont have more words, just amazing fastcomments areReally amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "some username",
          "Nb_Reviews": 2,
          "Date": "2023-03-13T01:39:29.000Z",
          "Titre": "Simple UI",
          "Contenu": "Simple UI, clear and detailed documentation, have step by step tutorial helps me make stuff works."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Malik Subhan",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T09:29:24.000Z",
          "Titre": "MALIK Subhan 😘",
          "Contenu": "Jaan se mujhe 50 GB bole the vah Nahin mileAapane jaisa bola humne vaisa Kiya mujhe 50 GB kyon Nahin mile please meri mehnat ka fal to thank you"
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T06:35:33.000Z",
          "Titre": "excellent",
          "Contenu": "excellent. Thanks for every thing,"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Younes",
          "Nb_Reviews": 4,
          "Date": "2022-07-13T20:01:46.000Z",
          "Titre": "Great product, great support!",
          "Contenu": "Great product, great support!The only ones to have React components"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaeyy",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T04:01:53.000Z",
          "Titre": "I absolutely love the service!!!!"
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T18:48:09.000Z",
          "Titre": "Fast service",
          "Contenu": "Thank you for helping me fix the fast comments UI on my site."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Games and Fun Entertainment Da",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T12:12:19.000Z",
          "Titre": "Fast and very helpful service."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Suchana Hasan",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T00:19:20.000Z",
          "Titre": "Nice",
          "Contenu": "Nice and wow Beautiful"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Roman Ly",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T19:39:05.000Z",
          "Titre": "Good comments lib!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T20:36:07.000Z",
          "Titre": "Very easy to install",
          "Contenu": "Very easy to install, works great without a glitch!"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Muhammad Siddique",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T21:41:25.000Z",
          "Titre": "thank you saudi airline"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T23:55:08.000Z",
          "Titre": "Greatest experience"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Yair",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T14:01:51.000Z",
          "Titre": "great product, highly customizeable",
          "Contenu": "great product"
        }
      ]
    }
  ]
}