{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "findigs.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:42:16.000Z",
          "Titre": "Customer service is terrible",
          "Contenu": "Customer service is terrible. I was accepted to lease the property.  I wanted to pay via direct deposit and was told my acceptance was cancelled because I didn't conform to their companies policies. A cashiers check was wanted. Still in the 20th century."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:18:35.000Z",
          "Titre": "I paid $45 for an application fee",
          "Contenu": "I paid $45 for an application fee. Waited weeks and I received emails. Miss informing me I was advised I was in third place. Via email then I get an email saying I’m in first place only to call and be advised that I am in second place. This is like a joke. I insisted on a refund the life is a joke to this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Op",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T00:58:20.000Z",
          "Titre": "No matter how hard we try",
          "Contenu": "No matter how hard we try, we cannot speak with anyone about what is happening. Very frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chelle Holloway",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:27:02.000Z",
          "Titre": "I Choose to put some faith in Homerock…",
          "Contenu": "I Choose to put some faith in Homerock in that same breath this company is associated with them. Overall horrible. Very unprofessional and negligent when it comes to calls and emails. This company is like so alarming it makes you think they are professional scammers in a way. I’m sure you could get a home but with everything that comes in between your better off going with a company with horrible reviews & I’m sure they will give better customer service and services overall"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "seals",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T17:02:24.000Z",
          "Titre": "The entire procedure was difficult",
          "Contenu": "The entire procedure was difficult. The Findigs application portal was clumsy.  Often you could not get it to respond. We spent TWO weeks trying to complete an applcation with a coapplicant.  Ofcten it would say completed and sdubmiotted whern ity wasn't. We would nmot recommend this portal to anyone.Home Group was fantastic! We loved the homes. But the leases, like everyone else's, contained restrictions and clauses that we did not like. Very restrictive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "irritated cosigner",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:18:05.000Z",
          "Titre": "Dismal UX",
          "Contenu": "Dismal UXHere's an incomplete list of things that frustrated me about using Findigs to apply as a guarantor to another person's application:- Throughout the process it was unclear whether my status was actually guarantor and not tenant. It was impossible for me to specify that myself, and very little about the UI indicated it. I only proceeded when someone in the tech support chat confirmed.- Much of the form seemed like irrelevant questions for a guarantor but I couldn't proceed without answering them.- Several questions demanded information I couldn't provide (e.g. email address for a company that takes emails through an online form and doesn't expose a public email address). I had to dig around the internet to find the closest thing to correct because there was no way to say N/A or provide a note about the exception.- At the end of the form there was a prominent warning telling me I was applying to the place alone, in spite of prior assurance that my application was attached to the actual prospective tenant's. Tech support instructed me to ignore the warning and proceed, which had me quite nervous.- Charging a separate application fee to the guarantor is ridiculous. That should be covered by the main application fee."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T14:01:51.000Z",
          "Titre": "Expect days in between communication with Findig chat",
          "Contenu": "I lost the first house I chose because it took over 2 weeks for my application to be reviewed by Findigs.  Then, on the second house I chose, it took 2 days on average to get a chat response from a Findig rep.  Pretty much the worst renting experience I’ve ever had…"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "A customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:49:25.000Z",
          "Titre": "Invasive process",
          "Contenu": "I felt like this was an invasion of privacy, they don’t need my Social Security number to approve for an apartment. The application fee is BS, just additional revenue.She is a very thorough and invasive process so I can understand why landlords like it, but it starts us off in an adversarial way, and I felt like I don’t really want to rent that apartment anymore after completing it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NVR",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T20:57:10.000Z",
          "Titre": "It was so difficult to navigate the…",
          "Contenu": "It was so difficult to navigate the site and super time consuming. Might have been better for someone with more tech skills."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T02:07:47.000Z",
          "Titre": "No one is responding to me and the rent I was approved for is now increased without any communication",
          "Contenu": "No one is responding to me. The lease is not correct. I was approved for a specific rent, the lease was written for more than I was approved for. I've sent multiple emails and chats and no leasing agent has called me.  The house was relisted for the same price I was approved for but yet you all are jacking the price up on the lease. Not a good experience and who would want to do business with a company like this"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:23:14.000Z",
          "Titre": "Hiding your ludicrous $40 fee until the…",
          "Contenu": "Hiding your ludicrous $40 fee until the END of the whole half-hour process is really shady.Why am I paying $40 to make everyone else's life easier, and for you to scrape a whole phonebook's worth of my information during the process for your database?No, I'm not actually interested in your answer. All I can say it's a tidy little income for you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ex-customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:05:56.000Z",
          "Titre": "DO NOT RENT FROM THIS COMPANY",
          "Contenu": "My partner and i managed to find the perfect house right in the part of town we wanted to be in. We paid the non-refundable fees, filled out applications, even got a cosigner all while being told that we couldn't see the lease until the application was submitted. Once we were able to look at the lease, we found out that this company pushes all liability for water, mold, storm damage onto the renters, along with all utilities, yard maintenance, pretty much everything. If we were to have signed the lease and moved in. I'm very thankful we handed the lease off to my partner's uncle, who is a retired real estate lawyer, who was able to uncover the predatory actions of this rental company. to quote him \"This lease agreement is one of the most aggressive, one-sided, fraudulent documents i have seen in my entire real estate career\". Findigs' practices are shady, underhanded, full of fees to nickel and dime anyone smart enough to avoid the very likely financial ruin that would result from signing a lease with them.If i could give less than one star, i would."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T04:06:54.000Z",
          "Titre": "Customer service agent I am working…",
          "Contenu": "Customer service agent I am working with is rude."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mia",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:40:18.000Z",
          "Titre": "Poor communication hard to talk with…",
          "Contenu": "Poor communication hard to talk with who ever in charge.  Poor communication!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "recently-probed",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T10:23:32.000Z",
          "Titre": "Infernal bargain: give all your data to the cloud, now, to get a rental.",
          "Contenu": "This was the most evil longwinded scary rental application I have ever experienced. The amount of personal data I had to give away was unbelievable. I got pitched to give me data away to other people numerous times. You asked to give Stripe and you complete access to my bank account. This was hell. This was an infernal, damned experience that made me feel naked and uncared for in a harsh brutal world. I hated this experience so much."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:42:49.000Z",
          "Titre": "I have never had to submit so much…",
          "Contenu": "I have never had to submit so much personal data as I have for this application.  To obtain a simple lease on a low cost apartment a highly qualified credit score and employment check should suffice.  If Findigs is ever hacked so much of my personal data is compromised and Findigs takes no responsibility for it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T19:04:07.000Z",
          "Titre": "Feels like a total scam",
          "Contenu": "Feels like a total scam.  Took my money for application fee but I wasn’t able to see the home in person.   How do you rent a house without seeing it?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bonita Mobley",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T04:59:44.000Z",
          "Titre": "Lied to, disappointed and discussed",
          "Contenu": "I was not told that I would be staying on site. The place was up the street. I was given on unit and got a call and was told that it was not ready. They placed me in another unit and it was not ready either. It was not clean. Thick dust and spider webs on the ceiling fans and rack in laundry area. Electric sockets loose, stove not together and does not work, gap under the back door, refrigerator drawers does not put in correct, knobs missing off cabinets in kitchen and bathroom, blinds doesn't work, fire alarm missing, sink in bathroom can not be used, tub faucett held on by tape, some cabinets will not close, door stopper broken by front door, no front or back light, base board separating from wall in bathroom and a piece missing upstairs hallway, ants and roaches. I called the office to tell the I would wait on the other unit and they said no. The unit was given to someone eIse. I hope they did not get the special since it was not available on 11/30. I move in 11/30/2023 and have to wait until Monday to speak with office staff. I was not able to prepare food to eat for four days. I had to eat out those days."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Asia",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T01:39:17.000Z",
          "Titre": "The application process is a circle",
          "Contenu": "The application process takes you in circles. You do an app for a cosigner then since the cosigner obviously has to reference the tenants in their app then it sends the tenants another link to fill out an app. It's just a big circle."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nikki",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T00:47:54.000Z",
          "Titre": "It’s hard to get in touch wi the…",
          "Contenu": "It’s hard to get in touch with the anyone. The call center isn’t much help. The app doesn’t work great either!!!!!!!!!!! Our whole experience has been horrible. Hopefully it gets better overtime."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "LUCI HARE",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T03:53:33.000Z",
          "Titre": "so hard to use it didn't allow options…",
          "Contenu": "so hard to use it didn't allow options to upload certain things another way or for like us people from outside USA soooooo hard"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T02:35:36.000Z",
          "Titre": "Many glitches",
          "Contenu": "It has a very confusing wording at the beginning. Pay attention carefully. The upload had glitches. I tried 20 times. Gave up. Tried 10 more times. Gave up. This app asks for way too much info. And it took 72 hours for my approval. When other apps took 24 hours. I would never recommend this app."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zondra Gilyard",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T01:07:53.000Z",
          "Titre": "American ave can answer there calls and…",
          "Contenu": "American ave can answer there calls and emails better and faster"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew l Clark",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:20:17.000Z",
          "Titre": "Communication is my biggest concern I…",
          "Contenu": "Communication is my biggest concern I haven't talked to no one just text messages"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T14:23:00.000Z",
          "Titre": "Applying for a new apt/townhome is way…",
          "Contenu": "Applying for a new apt/townhome is way to extensive on this site. It is ridiculous of how much they require to complete the application. It took more than one 1 day to complete the application. Also, it doesn't let you know ahead of time what you will need on hand to complete the application. They don't mind wasting your precious time. And the help on here when you need it is nonexistent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T22:03:11.000Z",
          "Titre": "Unethical business practice",
          "Contenu": "Atlas rental company requires a customer to give them the rental deposit before allowing the client to view their actual lease agreement.  They also have a policy that they will not refund the clients deposit if they decide not to sign the lease.   I believe this is an unethical business practice and it’s disheartening to see this happening in my home town.  Why would a company not want to be upfront and transparent?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T01:28:29.000Z",
          "Titre": "Their response timing and whole process…",
          "Contenu": "Their response timing and whole application process takes way to long"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica Chy",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T02:18:24.000Z",
          "Titre": "Company cancelled my application with…",
          "Contenu": "Company cancelled my application with out even talking to me. Requested additional documents while I was at work. By the time I got home and was able to sit down to get them out, they sent me a message saying they had canceled my application because I was taking too long. Like, do they want people to have jobs or not!?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T02:15:24.000Z",
          "Titre": "very frustrating process",
          "Contenu": "Your website is not user friendly.  In my opinion the process to complete a 3 month short term lease on rental property should not be very complicated.  By the time I finally completed the lease I was totally frustrated and came very close to aborting the entire process."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T05:52:57.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible, I hate the mandatory application fee even though we're already on the lease, plus an additional fee we're being asked to pay to modify the lease. This was not in the contract."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer Hank",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T21:04:58.000Z",
          "Titre": "Lack of Communication and poor judgement !!!!!",
          "Contenu": "This application took me 6 days to finish because I own my own business and not the best at sending material online.  After completing my application, Abigail and Vania had me mixed up with another person with the same first name. They gave me less than 24 hours to sign my lease agreement. They didn't communicate at all!  I lost the townhome which I gave a $1,100 deposit before the other party ever did. Luckily, there was a townhome 2 doors down, that I am moving into. I should get back my $100.00 application fee from Findigs for their incompetence and lack of communication, but I probably won't. Wasn't a nice way to represent HomeRiver."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T14:36:49.000Z",
          "Titre": "Co-applicants did not link despite…",
          "Contenu": "Co-applicants did not link despite using invites. Difficult to contact help. Lengthy process. Poor communication."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:39:21.000Z",
          "Titre": "Asking for user name and password",
          "Contenu": "Asking for user name and password. Very uncomfortable with this. Providing 12 months bank statements. Too much. Pay stubs show all you need when salary take home is more than 5 times rent. Can’t pay with credit card?  Debit card has daily limits."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Toni",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T17:14:47.000Z",
          "Titre": "My experience was terrible",
          "Contenu": "My experience was terrible. After applying for a house for DECA Property, I was told that I had to go through a third party called Findigs before I would know if im approved or not. Long story short, customer service is not there. When i messaged the person on the site, she messaged me once and then stopped responding.. now after ive applied and uploaded all documents FINDIGS worker went missing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T15:30:54.000Z",
          "Titre": "Very very very invasive",
          "Contenu": "Very very very invasive. Y’all asked for a picture of my car, the Armrents company asked for a copy of my current lease and a copy of my entire rental payment history. They also wanted me to pay a deposit before telling me I was approved after all the digging done by Findigs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T09:00:55.000Z",
          "Titre": "The house above is very annoying",
          "Contenu": "The house above is very annoying, a group of young men and girls who do not think that the person living below them has young children who are sleeping. Nuisance and lack of consideration for others."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danielle Isley",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T14:45:07.000Z",
          "Titre": "Said nothing about to first months rent…",
          "Contenu": "Said nothing about to first months rent we had to have so we wasted 150 dollars plus a rabies shot for my cat 40 all to loose the house"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T19:20:47.000Z",
          "Titre": "Fraudulent Claim",
          "Contenu": "We felt deceived by Excalibur Homes and Findigs. Excalibur Homes has had their accreditation revoked on BBB and had a history of fraudulent practice. We were not aware of this prior to spending money on application fees. Now we are not getting any responses for a refund of fees that we paid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kameisha brooks",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T18:08:16.000Z",
          "Titre": "Very misleading information online…",
          "Contenu": "Very misleading information online states one thing n contract states another do not like that and then there’s no justification allThrough emails n text no one to really talk to"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T14:10:33.000Z",
          "Titre": "Nothing went right",
          "Contenu": "Nothing went right. From the technology platform to the people to work with, to the policies the Owner’s management company deployed, it was a deplorable experience. Far too many roadblocks that it’s no wonder why the Owner has not been able to rent his property."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:54:27.000Z",
          "Titre": "System is not intuitive at all",
          "Contenu": "System is not intuitive at all. Difficult to use and doesn’t retain info. Just to different screens"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T17:18:42.000Z",
          "Titre": "I hope to never have to use this company again",
          "Contenu": "The entire process to complete the application was so difficult. Each person could not move forward without adding everyone in again and completing parts that were already completed so at the end there were triple the people with triple the cars. One of the applicants was blind and had such difficulty navigating the process and didn’t have any assistance where she was we just had her removed. I hope to never have to use this company again to apply for a rental"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ambria Edwards",
          "Nb_Reviews": 4,
          "Date": "2023-11-18T18:17:58.000Z",
          "Titre": "Approval with no home",
          "Contenu": "Accepted my application and two minutes before I could log in to pay, told me they gave it to someone else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie M Mayfield",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T01:24:58.000Z",
          "Titre": "Nicole and dime me to death...spent $40…",
          "Contenu": "Nicole and dime me to death...spent $40 dollars per person for applying. The  sya pet friendly  but charged me $300 per pet THEN, A $50 one time activation fee....wth??? For a 1295/month place it was going to cos over 4000 dollars...get over yourself in a bad neighborhood and then give me  even MORE RESTRICTIONS!!!!  Nope!!! Found me a place cheaper and that are TRUE TO THEIR WORD ABOUT BEING PET FRIENDLY"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Never your tenant",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T01:06:52.000Z",
          "Titre": "Abyssmal experience -",
          "Contenu": "Abyssmal! I spent nearly an hour with one of your chat people just trying to establish an account. Out of frustration, I called the property manager agent and agreed to drive 30+ miles to meet at his office because \"I was doing something wrong!\" Not quite, The property manager couldn't get an account set up for me without contacting \"Chat\" either. Your \"Chatter\" was Xyrisse.I've already told people about my terrible experience. I'll tell more whenever I get the opportunity."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesse",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T03:28:13.000Z",
          "Titre": "Promised move in date was changed after…",
          "Contenu": "Promised move in date was changed after we paid to apply and were approved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T05:49:04.000Z",
          "Titre": "nightmare website",
          "Contenu": "awful nightmare website and FAQ section is just wrong and unhelpful. extremely difficult to use. couldn’t delete or restart an application or join anyone else’s. I chatted with an online representative and they were very helpful, but I shouldn’t have to ask someone to go in and do stuff for me on the back end to be able to do anything at all. took my partner and I 3 hours separately to fill out an application. -1/10"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T21:14:00.000Z",
          "Titre": "Filling out this application was like…",
          "Contenu": "Filling out this application was like burning in hell. Way too much crap I had to provide, and I had to do so much funky crap for my files to be recognize to be downloaded. I got drunk directly after completing this application because it was that stressful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angel Bittle",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T20:33:40.000Z",
          "Titre": "My credit is good",
          "Contenu": "My credit is good. My rental history is great. My employment earnings are high with all that being said the underwriter for this company told me I had to pay a double deposit and that I had to also pay an extra 35 a month for their benefit package which would’ve came to a total after move-in over $5000, the criteria that is being set by your company is more for a home buyer not a renter. I’ve never had evictions. My last rental deposit was $900 luxury apt"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adderly M",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T22:04:12.000Z",
          "Titre": "Communication",
          "Contenu": "Communication. A response to messages definitely when it comes to sending my money through somewhere like Walmart cash card and I am acquiring about information. I would love for someone to communicate back with me. It’s business day three now and still no response and I’m trying to make the payment but need more details first."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T18:58:06.000Z",
          "Titre": "The worst experience I have ever had…",
          "Contenu": "The worst experience I have ever had with trying to rent a  vacation property. It felt like they tried to sabotage the deal at every turn. We ended up walking away from a property we wanted in a location we wanted. Terrible,terrible experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "melissa shaughnessy",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T15:31:15.000Z",
          "Titre": "Horrible experience all around",
          "Contenu": "Horrible experience all around.  Can’t get a response from anyone. Only got a few responses at the beginning of application processes. The employees made a comment that they didn’t want to talk over the phone and instead they wanted to use Findings for all communication…red flag. Might be a good system if the Management Company using it was legit and not a total scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elysia Taniguchi",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T21:28:46.000Z",
          "Titre": "This is stupid and shouldn't exist",
          "Contenu": "This is stupid and shouldn't exist. These companies think using a service like this justifies jacking up the price, like student loans. Can we please stop with the third party everything? These fees are unnecessary, just price things reasonably."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T06:18:08.000Z",
          "Titre": "Very poor customer experience",
          "Contenu": "Very poor customer experience. There was no one live to speak to when help was needed. Everything done by email. Never spoke to a person even though I had asked several times through phone and email to be called. Slow at receiving needed documents. What could have been done in 2 days has taken over a week and it's still not done!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T22:10:44.000Z",
          "Titre": "Retraining is needed",
          "Contenu": "The individual responsible for putting together my lease needs to be re-trained.  She lacks attention to detail. She sent the document over 3 different times, each time with mis matching and wrong information.  I had an email out waiting for the information to be corrected.  While waiting 2 of her supervisors contacted me and told me that others were waiting for the property and if I didn't sign I would lose it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T20:51:49.000Z",
          "Titre": "I have had/having a horrible experience…",
          "Contenu": "I have had/having a horrible experience with Atlas homes. Nobody answers their phone, nobody will call upon request. I was approved on 10/16, they said someone would reach out to me with next steps, didn’t hear anything so I reached out. No call, email or message back. the house was rented to someone else. I moved my application to another home for a lower amount of rent and they said I needed a co-signer of someone who makes 6.5x the rent. RIDICULOUS. I found one, sent their email, never heard back a word. I spent the 55 to apply and 25.00 for the pet screening. Still trying to reach out to these people as I am approved and not getting any communication. All I need is a home for a year. DONT WASTE YOUR TIME AND MONEY. GO SOMEWHERE ELSE."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T00:51:12.000Z",
          "Titre": "Too much personal information",
          "Contenu": "This application asks for waaaaay too much unnecessary personal information about my family.  There’s no reason that this company needs my children’s social security number and copy of birth certificate for a rental house application. They also say they don’t store your information, it is held by a separate company (that may or may not be in this country) and they can’t guarantee your information is safe. At your own risk kind of thing.. In the age we are in, I’m very surprised so much information is required."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Craig L.",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T23:15:18.000Z",
          "Titre": "Military and veteran terrible experience.",
          "Contenu": "Lost the opportunity to apply for a property because the automated software doesn't recognize a valid military extension for my wife's driver's license. Spent 3 whole days working with Findigs customer service with no success. Was pointed to the customer service of Everest and they took over 2 weeks to send an initial reply and still no resolution to the issue. Please contact me if you want more details or context."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Renee Dunaway",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T16:09:34.000Z",
          "Titre": "The experience was very overwhelming",
          "Contenu": "The experience was very overwhelming. If you are working from a phone it is very difficult. The technology of capturing photos. And electrionic signatures became a challenge. The lack of support by phone is very needed.  In crawfordsville there would be a need for a navigator to help someone who can afford but doesn’t have technical expertise.  A navigator is needed to help through the process. It seems you can take the money but not truly help them understand the process."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T02:07:04.000Z",
          "Titre": "Difficult software",
          "Contenu": "Difficult software! If your data does fit exactly as asked by the software, there is no alternative options.  The help desk even indicated they could not help.  We ended up sending in a paper application to the rental agency."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T19:49:10.000Z",
          "Titre": "I'm not able to communicate thru email…",
          "Contenu": "I'm not able to communicate thru email and text.  Not sure why your reps cannot speak directly with the applicant, but I'll be sure to discourage anyone from applying with you using this process."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Smith",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T21:58:50.000Z",
          "Titre": "KISS",
          "Contenu": "The myriad of internet/webpage/email crap one has to deal with instead of going into an office, signing your name and handing them a check is overbearing and frustrating.  KISS is a common acronym for Keep is Simple, Stupid... and this process of getting an apartment is far from simple."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tammy Alexander",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T21:15:45.000Z",
          "Titre": "No timely response on getting things…",
          "Contenu": "No timely response on getting things done in the home."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Saladino",
          "Nb_Reviews": 4,
          "Date": "2023-08-12T00:24:46.000Z",
          "Titre": "Lack of full disclosure.",
          "Contenu": "Owner did not disclose that tenant is responsible for repair/replace of all appliances.  We never would have applied had that been disclosed prior to the application. We felt tricked by this. Based on the lack of full disclosure, in all fairness, our application fees should be refunded."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TE",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T23:40:30.000Z",
          "Titre": "You pay and noone calls on the App.",
          "Contenu": "I was allowed to get on and pay for an app and then the house was rented. This happened twice before I could get anyone to contact me from Atlas.  Little did I know, the last house I would even slightly consider and had my app switched to was next to a major highway.  After being disappointed and not having any other housing options from Atlas I packed all my things in storage and left back to Tx. I wish for a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Meka menifee",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T07:50:57.000Z",
          "Titre": "I don't understand how this site works",
          "Contenu": "I don't understand how this site works. Nobody is around to help assist. I saw my application was approved, but nothing else. No further information was given regarding the application. No information on next steps. I don't know if I communicate with the leasing company through findigs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T02:13:13.000Z",
          "Titre": "The wrong home address was on my…",
          "Contenu": "The wrong home address was on my account and I paid mt money. No one is ever available to assist me nor do they respond in a professional timely manner."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pamela Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T05:33:57.000Z",
          "Titre": "I was rushed and then nothing was…",
          "Contenu": "I was rushed and then nothing was ready. The fridge doesn’t work, the water to washing machine doesn’t work, no cold water in the master shower. No one has contacted me about the walk through. After I paid the security deposit I was told that the rent was going to go up every year by at least $150"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marvin",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T00:25:13.000Z",
          "Titre": "Just not for me I found my own place…",
          "Contenu": "Just not for me I found my own place and didn't have to pay all this deposit none refundable application fees"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T05:09:59.000Z",
          "Titre": "My experience is horrible",
          "Contenu": "My experience is horrible. I feel like I was catfished with the unit. I moved in on September first and to my surprise I had to find out on my own that there is no stove. The bedroom doors are missing, the walls have drawings on them, the laundry does not work, the laundry door is broken, the bathroom appliances are broken. The blinds are broken and the floor tile is lifting. I have been contacting maintenance and I have not heard back from anyone for 72 hrs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Regan Lyons",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T17:58:33.000Z",
          "Titre": "Almost couldn’t move",
          "Contenu": "We initially missed out on the unit we were applying for because this website didn’t show the property that my co-signer had submitted his application. We were extremely lucky that another unit opened up, but I was extremely frustrated with the website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jan Schroeder",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T22:31:53.000Z",
          "Titre": "Zero communication",
          "Contenu": "I have called, emailed and my daughter has called and emailed the company. No response! No one has attempted to reach regarding our approval and renting an Atlas Property.I would like our application fees refunded.Thank you!"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Upset customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T19:16:55.000Z",
          "Titre": "Deceitful application where large fees…",
          "Contenu": "Deceitful application where large fees are hidden in tiny letters somewhere that you can’t see. Can’t even accept information from foreign applicants."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Scott Posch",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T17:53:02.000Z",
          "Titre": "Very user unfriendly website.",
          "Contenu": "This is a very user-unfriendly website. Idk if it’s a security or fraud mitigation effort, but you cant do anything except enter your information in order, one time. No editing, no deleting, nothing. You put the info in and that’s it. Make a mistake, too bad. I had to delete an additional applicant and needed to contact customer service to do so. Some of the info you enter doesn’t have options you need to accurately answer the questions. Education was one of them for me (for one of my kids.) and they require full applications for minors including bank account and ID information. I kinda get it - we are in an age of insecurity and fraud, but their implementation is really unfriendly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Briana Stoll",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T19:16:29.000Z",
          "Titre": "Scam",
          "Contenu": "Scam - cannot get a hold of anyone. I applied for a property and got an email back after paying the fees stating its no longer available. The chat said I needed to contact the property management company - the property management company said I needed to contact Findigs. I work for a property management company and this is sketchy and seems like they will just take your money - even though your application was not processed and you applied for a property that showed available to apply for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T14:58:23.000Z",
          "Titre": "You should view the property you’re…",
          "Contenu": "You should view the property you’re representing and contact those in person.It felt very much like a scam and much intimidation to sign lease with no questions answered.I will be following up with individuals in regards to the impersonal and bullying tactics.Denise Little"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T22:14:39.000Z",
          "Titre": "This took ridiculously long",
          "Contenu": "This took ridiculously long. We did our applications in June and this is just being finished now (8/21). I am not sure who to blame here, and this has been one of the most unprofessional processes I’ve ever been apart of."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T22:31:57.000Z",
          "Titre": "Don't like thier business",
          "Contenu": "We got approved for a place paid our money only to get told we dont have the place someone else got it. Did the address transfer and not a word back from anyone all month. Dont like the way they do business. Why would you send multiple people an approved status for the same place. Definitely not a good look"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T12:42:21.000Z",
          "Titre": "application process was very difficult…",
          "Contenu": "Application process was very difficult it kept causing me to bid against myself. Its hard when you don't really have computer knowledge I am a senior citizen"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T00:06:01.000Z",
          "Titre": "Application took weeks to be approved",
          "Contenu": "Our messages were often ignored, especially when requesting application status. The approval process took so long that by the time we were approved for a lease modification, it was well past the date we needed to switch roommates. In fact, our application only was approved after our leasing office reached out to the company. I think having a phone number to physically speak with representatives or customer service would be helpful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric N",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T16:58:11.000Z",
          "Titre": "An absolute nightmare",
          "Contenu": "This system is fully automated, has zero human interaction, and less than zero compassion. It made error after error, charged us multiple application fees, and in the end it resulted in declining a simple lease renewal.  We had been trying to work with this system for 60 days, with nothing but complete frustration, and no resolution. Trying to contact support was even more useless.  They publish a wordy mission statement - which the completely disregard."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cheryl Buckhannon",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T22:36:49.000Z",
          "Titre": "I was asked for income and there was a…",
          "Contenu": "I was asked for income and there was a category for you to list child support and alimony, etc. but not allowed to use it as income. Then why are you asking for it and I’m sending bank statements proving I get it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Crystal S. Holt",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T18:17:07.000Z",
          "Titre": "M very unresponsive and untimely",
          "Contenu": "M very unresponsive and untimely. They do not have a sense of urgency or empathy to resolve issues"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T20:38:43.000Z",
          "Titre": "i've been talking to myself on that app…",
          "Contenu": "i've been talking to myself on that app for weeks! can't even see the house i'm approved for! horrible experience all together"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "john Zion",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T08:50:41.000Z",
          "Titre": "REDSAIL PROPERTY worst experience I've ever…",
          "Contenu": "This is the worst experience I've ever had in my 65 years on earth as for as customer service.  From REDSAIL PROPERTY. When I finally decided to use this company, I had to move because my current apartment is being renovated. I gave my deposit and other fees. The place was 1350, next thing I knew it was 1395. Next thing I knew was a 450 pet fee with $45 monthly and a 200 admin fee and a 40 a month fee fee.. After a long while I was approved. They sent me a lease via Docu sign. I did not sign it immediately because i wanted to discuss these fees. They sent the lease on the 17th of Nov. I didn't speak to a woman named Karri until the 21st of Nov. She explained to me and the coldest and unfriendly voice that I had no choice but to pay the fees. I was desperate so I agreed  and signed the lease.  A LEGAL DOCUMENT. On the 21st. I was told I had 48 hours after signing the lease. She then told me I had less that 24 hours to pay the deposits and fees by the next day on the 22nd. I informed her that I will try to be there but I normally get paid in the afternoon on a Holiday. The next day came around and I go paid at 3pm. When I called to bring the money. No one answered the phone. Then came Thanksgiving and the black friday. Then I called saturday still no answer. I kinda figured they were on vacation. So comes this monday at 10am. I brought the money to them to continue my moved and was told they cancelled my contract because I missed the one o'clock deadline. I apologize but informed them that I'm here with the money and the lease and the townhouse is available. That I already had my mail cable and electricity transferred. Because I had a signed legal lease. But they refused. I informed them I had the deposit and they closed early and went on break. Mr Karri refused to be one bit sympathetic to my situation. Some customer service. I had already given my current landlord a vacancy notice in 3 days and I have no place to live as of now. These people were callous and cut throat. No compassion and service. I'm sure that if I was a friend or relative, they would've worked with me. But I'm not. To putting and old man in the street. I might have to live and a very cheap hotel until some of rental place have enough time to approval me application. I pray I don't get robbed or hurt. I need legal help!!! And they kept my application fees. Remember their name is REDSAIL PROPERTY. Go somewhere Customer service is horrible in my opinion"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa West",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T22:35:58.000Z",
          "Titre": "It has been terrible experience",
          "Contenu": "It has been terrible experience. Bad service.  Made the move in very stressful.  Terrible customer service.  My lease has been signed paid deposited paid all forms signed. I was promised a code for the past 2 days but still no code.  I move in tomorrow and now I need to cancel my plans.  No one will answer.  Your services are the worst I have encounter."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T22:54:58.000Z",
          "Titre": "The application process is not user friendly and requires way too in-depth information.",
          "Contenu": "I felt that the application process was way too intrusive to personal information. A lot of the questions asked didn’t seem important or relevant to the rental property. I also had to log into my bank account and payroll account for verification which now you guys have access and that doesn’t sit well since my application was denied."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angie",
          "Nb_Reviews": 4,
          "Date": "2023-08-05T18:18:38.000Z",
          "Titre": "No personal feedback",
          "Contenu": "No personal feedback. Difficult to get answers. All computer generated. No phone number. I rented from someone else instead in part due to these concerns."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T12:29:21.000Z",
          "Titre": "Unfair and deceptive: The applicant should be notified if…",
          "Contenu": "The applicant should be notified if there is another applicant (s) ahead of them. We are well qualified and wasted $150 and our time and releasing sensitive confidential information to be later informed that we lost the house to an earlier applicant. They would not refund our processing fee of $150. This seems like unfair and deceptive business practices and I am considering pursuing this further."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T22:33:01.000Z",
          "Titre": "The worst rental company",
          "Contenu": "This is the worst rental company I have ever had to deal with. Horrible communication and doesn’t follow through. They seem very unorganized and unreliable. Steer clear!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T23:09:42.000Z",
          "Titre": "NEED A LOT OF UPGRADES IN THE PLACE",
          "Contenu": "NEED A LOT OF UPGRADES IN THE PLACE! I WAS TOLD THAT THE CARPET, AND THE WHOLE APARTMENT WAS BEING SPRAYED AND CLEANED OR CARPET BEING REPLACED BY A PROFESSIONAL COMPANY. WHEN I WENT TO VISIT THIS PLACE. IT TURN UP TO BE BEYOND DIRTY, AND UNSAFE. THERE WAS MOLD IN THE BATHROOMS, THE VINYL WAS COMING OFF OF THE FLOOR, CARPET HAD STAINS, THERE WAS SMALL FLYS EVERYWHERE, UNDER THE SINK WAS BROKEN, THE WALLS LOOKS LIKE THEY WERE OVER PITTED, AND THE PAINT WAS PEELING OFF. I DON'T KNOW IF IT WAS FROM THE WATER OR NOT. THE MAIN ENTIERS DOOR IT LOOKED LIKE SOMEONE WAS TRYING TO BROKEN IN INTO THE APARTMENTS. AND IT WAS NEVER FIXED. OTHER THEN THAT THE STAFF WERE VERY NICE AND FRIENDLY. HOPEFULLY THEY FIX THIS PLACE BEFORE I MOVE IN. AND THEY WILL MAKE SOME MORE SAFETY AND CHANGES."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T06:43:18.000Z",
          "Titre": "I was charged to run applications",
          "Contenu": "I was charged to run applications, paid fees in full, was denied and was also told I could not rent that I would be forced to have a one year lease minimum. Charged me money and I was not able to secure a rental. Very dissatisfied I feel my money was stolen."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "leelee Sweet",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T21:08:58.000Z",
          "Titre": "Update systems",
          "Contenu": "This company can improve by making sure all components of the application is operational. While filling out this application I could not link my information to my bank that was listed. I had to do an very inconvenient work around."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deon White",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T16:42:49.000Z",
          "Titre": "Fix it because because is broken.",
          "Contenu": "\"Hi, Deon you have a message that might be time sensitive.\" I could never open the message or I would click on the button and an error message would occur. This happened 100% of the time. It left me with no alternative and I have not seen one message to date."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Olds",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T22:01:12.000Z",
          "Titre": "Having trouble getting into portal now",
          "Contenu": "Having trouble getting into portal now. When I did, it gave me a different amount as I was told. Can't I pay somewhere in erson?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jatinder",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T02:23:38.000Z",
          "Titre": "They wasted so much time and at the end…",
          "Contenu": "They wasted so much time and at the end we decided to go with different company. Will not recommend"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "New Tenants. Or not.",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T16:43:08.000Z",
          "Titre": "We are new residents of home river…",
          "Contenu": "We are new residents of home river group, today is our move in date. We cannot even talk to any agents let alone get our keys. I’ve never seen anything like this in all my life. I’m ready to literally take it to court. This is bs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T02:45:13.000Z",
          "Titre": "Wasn’t for me",
          "Contenu": "1. Charged more than $50 for application2. Unable to speak to a live person 3. Multiple additional fees in lease4. Unsupportive maintenance response as outlined in lease."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "karmen",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T20:07:07.000Z",
          "Titre": "Very slow response time from local team…",
          "Contenu": "Very slow response time from local team and the responses were not typically during working hours."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diane Hayes Terry",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T12:30:28.000Z",
          "Titre": "Repairs Needed Sept 1 reported and no action!!",
          "Contenu": "Repair lights in the hallway, cleaning weekly of the dumpster areas (rodents everywhere) tenant is partially Blind and has stumbled, refrigerator needs to be replaced (lighting area is crumbling and can’t hold light) Roach’s are coming from the hallway underneath the door (exterminator needed) doors don’t lock and are left open (front and rear door near the unit) baseboards are missing in unit (under heating element in all rooms) hallway stinks.  NO MAILBOX KEY!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lynn Ivette Trevino Clavijo",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T22:41:55.000Z",
          "Titre": "Fee too much",
          "Contenu": "Fee too much. Ask for double security deposit. Too many questions"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T15:29:20.000Z",
          "Titre": "confusing UX choices",
          "Contenu": "There were a few confusing UX choices, but the biggest one was that options for guarantors don't show up until after the \"submit\" button. For someone who needs a guarantor, that choice produces a lot of anxiety. We opted to add the Guarantors as co-applicants (this is the section where you'd expect to see the option) to make sure the information was there somewhere. This caused a cascade of problems.Other issues: your ID verification seemed like it couldn't focus the camera. I've never had such difficulty before. \"Other ways to pay rent\" is only structured as recurring income, so there is no accurate way to report lump sums like retirement or mutual funds."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chevonne Jones",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T02:58:39.000Z",
          "Titre": "The verification process was very…",
          "Contenu": "The verification process was very uncomfortable.  The system requires all of my personal informaiton without establishing a base relationship with a real person.  it is very unsetteling that I basically put all of the information that makes me who I am in America into a black hole and not knowing anyone I can contact or deal with on the other end. Secure for you, but what about the consumer/customer/tenant/person. We want assurance as well. It's very scary and I don't want to be scammed just like the company doesn't want to be scammed! Human contact is still important!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:32:42.000Z",
          "Titre": "I feel as though u went up on the rent…",
          "Contenu": "I feel as though u went up on the rent before I even got in there and the deposit went up too, the way things has went up called inflation,u made it too high to get after all the information I had to provide and I had a responsible  co-signer,u would've been very pleased with me renting the house instead of someone that doesn't take care of ur property,I do hope u get someone in it that will take care of it,cause it is very nice,sorry I wasn't that person good luck."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T09:54:09.000Z",
          "Titre": "Very poor communication",
          "Contenu": "Very poor communication. No one answer the phone or emails. Been waiting for a response on properties and still nothing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T00:38:33.000Z",
          "Titre": "I just moved a week ago and I did…",
          "Contenu": "I just moved a week ago and I did maintenance request to send someone to check some stuffs that are no working and nobody came. I don’t recieve response.  Bad service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:26:48.000Z",
          "Titre": "When I arrived at the second property I…",
          "Contenu": "When I arrived at the second property I was not granted access and had to call the agent to get access to the lockbox. I paid for 10 showings and was scheduled for 2. The first property I had no issue gaining access but the second one told me I was unable to access. And then the system hangs up on you. No person to be transferred to or anything. Confusing and frustrating. As the two properties I was viewing were on opposite side of town."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T22:48:29.000Z",
          "Titre": "Way too long",
          "Contenu": "Way too long, even when you complete ur don't done. A lot of questions you have to answer with not applicable, should have a chose bc u dont say it but it's stared. The time is not accrate, takes longer than quoted."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T18:23:57.000Z",
          "Titre": "This experience was related to a house…",
          "Contenu": "This experience was related to a house leasing process with Excalibur Homes. While the application process was manageable with Findigs, there was a disconnect with Excalibur Homes. The process did not assure me that I was dealing with reputable companies. As a result, I declined to move forward the the lease"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T21:00:39.000Z",
          "Titre": "Unprofessional",
          "Contenu": "Slow if not, no responses back at all regarding property, very unprofessional !!Property listed for rental/leasing but they say it’s getting work done. Why would y’all list it for leading if it can’t be leased or viewed, once again, very unprofessional"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Demetrius",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:58:50.000Z",
          "Titre": "jst moved in",
          "Contenu": "made payment on time at move in point, and they have had to schedule and reschedule 4 times on an issue that should not have been an issue once payment was made for move in. I have door's in my house that I don't have keys for. hopefully maybe today I can get locks and keys to all doors in my house."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KHanna",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T14:34:19.000Z",
          "Titre": "Findigs is an easy to use software communication platform",
          "Contenu": "If this is a review on Findigs, the communication platform - then I would give it a 5 star.  The alerts worked well and it was easy to use. However, if this is a review on the company (Home River Group) that I communicated with using findigs, I give them a 2. They were truly the worst company I have ever worked with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:57:43.000Z",
          "Titre": "We not happy with the manager property…",
          "Contenu": "We not happy with the manager property assistance. We call him, send text msg, email and never get the answers about the property.The house have some problems and I don’t know when someone will come to fix…"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Al L",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T17:22:58.000Z",
          "Titre": "Intrusive beyond reason",
          "Contenu": "I appreciate the efficiency of it. If this could be used for the mortgage process. I would love it.However, I resent the amount of information it pulls from you for an 850 loan guarantee. It’s intrusive and overreaching."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keahi",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T04:45:03.000Z",
          "Titre": "FINDIGS SUCKS",
          "Contenu": "I hate dealing with AI instead of humans. This process is for the lazy and disinterested in human contact."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T14:23:36.000Z",
          "Titre": "Error - Unable to Access New Messages",
          "Contenu": "It was working well at first and then all of a sudden every new message wouldn't populate through the link provided. We could only see messages through my husband's account since of course he was the co-applicant. But I kept getting error messages under my account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A.",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T13:38:16.000Z",
          "Titre": "Communication was sketchy",
          "Contenu": "I found a great apartment,  filled out an application and was approved.  When I asked where the lease was to sign they did not reply.  On the third ask they told me the owner had made a mistake on the monthly rent and that they were asking for substantially more.  It fell through and now I have to start over with my search. Granted it was the owners who made the mistake but I felt the communication was lacking on the part of Findigs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T22:43:37.000Z",
          "Titre": "$100 for me to apply is bologna",
          "Contenu": "$100 for me to apply to rent a place is ridiculous. Additionally, after I paid first month's rent, security deposit, and a $500 \"administration fee\" I finally saw the lease that was filled with all sorts of fees and rules to screw over the renter. I know the lease is not Findigs fault. But this whole process was a huge turn off. I did not accept the terms of the lease in the end. So thats $100 to Findigs I'll never see again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tiffany Kirk",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T16:53:20.000Z",
          "Titre": "This process is very confusing",
          "Contenu": "This process is very confusing and cumbersome. After applying nobody really followed up to explain the process. I have found several homes that we liked and attached to different addresses to our application. The first time we didn’t get because it went off the market then it came back on the market. In addition to this, Excalibur homes definitely Photoshop some grass into the yards of the homes in their site. I have driven past several that have pure dirt yards but in the photos it is plush green grass. I think this company knows they have a monopoly for single-family home rentals in Atlanta, and have gotten away with quite a bit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T22:40:12.000Z",
          "Titre": "the carpet and baseboards were dirty…",
          "Contenu": "the carpet and baseboards were dirty not sure who the cleaning crew is but they did not do a good job at All refrigerator. Missing shelves showerhead is broken."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T20:29:23.000Z",
          "Titre": "Co applicant process is NOT user friendly",
          "Contenu": "Co applicant process was incredibly difficult because of the email links and group pairing of accounts. It shouldn’t be that difficult and is not user friendly what so ever. It only worked for us because we got in contact with an agent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T21:09:41.000Z",
          "Titre": "Everything",
          "Contenu": "Everything No personal enter action The application did not leave any room for explanation of answers When we tried to call someone they said everything is on computer If I can avoid it I will never have any thing to do with this company again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CAROL A FORCE",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T05:19:11.000Z",
          "Titre": "Too much trouble",
          "Contenu": "We had to deal with way too many people.   So many texts and emails from different people, different names, different \"companies\".   It got very confusing and seemed unnecessary for the most part.   It took 3 of us so long to rent this home. It was difficult to keep track of who wanted what from us.  We're thankful to have rented the home."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T18:20:47.000Z",
          "Titre": "They were pretty quick to draw up a…",
          "Contenu": "They were pretty quick to draw up a contract and take my money. However, when it came time to hand over the keys, they neglected to give me access to the property. The lockbox was located behind a gate to which I did not have access to. They failed to provide me the PIN number I needed to open the gate so I can enter the property. There is no other way to enter the property without going through the main gate. I emailed and texted numerous times without receiving a response. I was planning on taking advantage of the three-day Labor Day weekend to move, but now due to the lack of communication from this company I will have to make other plans.  Hopefully someone will read this review and make things better!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christofer Sanchez",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T23:37:40.000Z",
          "Titre": "This company is very unorganized.",
          "Contenu": "This company is just very unorganized. I just got a house through findings with some friends but it wasn’t easy at all. The first time we tried to submit an application something happened and the application wouldn’t go through. We called findings multiple times to let them know and it took them 3 weeks to finally get it resolved. By the time they fixed it, the house had been leased. We were able to transfer the application to another house, but we still had trouble with that. We called to get the application moved and they entered the wrong address. It took another week to get that fixed. Overall this process was very stressful because findings couldn't do their job."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Price",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T21:30:32.000Z",
          "Titre": "Tedious and intrusive",
          "Contenu": "We found this site to be utterly frustrating to use.  I'm sure that some frustrations we due to the requirements set forth by the property management, the intrusive information about our finances was ridiculous.  Why would we send that much information to anyone? It took us almost four hours to complete the application.  Which we, for some reason, were denied the opportunity to cosign for our daughter.  We were told that we did not qualify to be cosigners on a $2400 lease even with spotless criminal records, a credit rating of over 800 and a significant net worth.  Both my husband and myself filled out an application--with exactly the same information...why?????  We finally came to a rather unsatisfactory agreement with the property manager, but, my daughter decided to forego the property, which was fine with us...it seemed like more trouble than it was all worth."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T00:00:58.000Z",
          "Titre": "Difficult to get in touch with a…",
          "Contenu": "Difficult to get in touch with a person. Buttons don’t work half the time on the mobile version. Application process had a lot of glitches when it came to linking with co-applicants."
        },
        {
          "Note": 2,
          "Lieu": "KR",
          "Pseudo": "Atlas Real Estate Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T03:41:01.000Z",
          "Titre": "Very intrusive!",
          "Contenu": "This is the most intrusive rental process I have ever encountered. There is no reason I should have to enter personal contact information for my boss at work, certified verification of the degree program my wife is pursuing, or my bank login information. Although I was able to compromise with the property management company to bypass some of the “required” information, the app would not let me continue without entering the data it was looking for. Overall this drew out the application process to multiple weeks.Then, when managers used the app to contact me about my application, they would send multiple chats at a time (which is completely normal) and the app would send the same chats via text and email multiple times, leading to a cascade of notifications every time I received a message. Overall, I would recommend a less intrusive, less in-your-face system of communication with landlords/property managers. I don’t want renting to resemble social media, and I need to be able to make informed choices about my data privacy and information protection."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T23:36:11.000Z",
          "Titre": "Needlessly complicated",
          "Contenu": "Needlessly complicatedThe entire process had so many different parties, with zero overlapping accountability or responsibility, where each party was able to blame problems on another person without working with us to try to fix the issue. We did not get our keys on time, we did not get clear communication about the items in our lease that were vague or nonsensical, and absolutely no one involved apologized for all of the confusion."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Exasperated customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T06:06:03.000Z",
          "Titre": "Meaningless notification email harassment.",
          "Contenu": "Response time was slow (though perhaps the leasing agent just didn’t give a shart), and Findigs sent me WAY too many unsubstantive notification emails and marketing emails that I didn’t sign up for. You don’t need to harass me with emails, just leave the notifications on Findigs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fermin",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T18:56:45.000Z",
          "Titre": "House for Rent was put up for sale",
          "Contenu": "I applied for a house for rent - should have been a simple process - everyone had recent paystubs and solid credit. Every time I submitted a document it took days to review and then they would ask for another document - another 2-3 days. Finally after 3 weeks of going back and forth we finally got the approval. I emailed to ask what the process was after our approval and the woman replied that I was not approved even though I got an email that said I was the day before. I had to submit a copy of the email to prove I was indeed approved and the employee responded with \"CONGRATULATIONS. Wait for a call from us.\"I received an email saying that when presented the approved application, the home owner decided to sell the house so it is not available for rent anymore. Complete waste of time and money.They did offer a refund on the application fees but I still got a ding on my credit and of course it's been days and I have not received a response about the refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shiann B.",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T01:51:48.000Z",
          "Titre": "I just don’t like the fact that you…",
          "Contenu": "I just don’t like the fact that you wouldn’t lower the price of the 3 bedroom you price it out as a 4 bedroom unit but housing goes off the size so even if I had which I do have a 4 bedroom voucher seeing that it’s a 3 bedroom they had to go off the 3 bedroom unit size amount which is 11331"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "hcmohr",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T18:45:47.000Z",
          "Titre": "It is a work in progress",
          "Contenu": "It is a work in progress. It is impossible to add any non-US information, when you need to put non US information in the system, you can't"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "applicant",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T02:47:23.000Z",
          "Titre": "The questions and requirements were…",
          "Contenu": "The questions and requirements were inappropriately private and didn't consider good credit default risk management. I don't know if this was the fault of Findigs or the Customer parameters."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T18:05:39.000Z",
          "Titre": "Too many irrelevant questions",
          "Contenu": "Too many irrelevant questionsToo longWay to invasive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T13:14:27.000Z",
          "Titre": "Lack of professionalism",
          "Contenu": "Real good about taking your money, but they do everything on their time and don't care about yours at all. They are hardly in the office and you can't talk to anyone after 2pm. I'm sitting around now waiting on them to give me my key so I can move in, but they don't care 🤷‍♂️"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T05:45:08.000Z",
          "Titre": "This company is not very responsive",
          "Contenu": "This company is not very responsive. I was asked to sign a lease in under 24 hours and no one is allowing me to see the property. I've asked several times and that question seems to keep getting ignored."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karl Zwanziger",
          "Nb_Reviews": 2,
          "Date": "2023-09-23T07:21:36.000Z",
          "Titre": "The application process was very difficult to navigate.",
          "Contenu": "The application process was very difficult to navigate. The application itself was very thorough and detailed, which was good.  It took me about 4 hours to complete the application for myself, my wife and my dog (yes, my dog had to apply also) Requirements for pay stubs were difficult to attach.  I was notified by email on several occasions of time sensitive information on a chat that was not accessible by my phone, or on my computer.  The chat app. did not open 90% of the time.  I was never able to talk to a real person by phone.  Delayed communication between the chat operator and a third party that was responsible for my lease, resulted in cancellation of my application and loss of the opportunity for the rental. The rental management agency attempted to assist with the short fall in communication, but was unable to break the communication gap.  I would avoid any rental application that uses this app as a qualification step for rentals."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T21:14:29.000Z",
          "Titre": "The chat feature is ok followed by an…",
          "Contenu": "The chat feature is ok followed by an email. But it does get confusing as to how you want us to respond."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T16:46:55.000Z",
          "Titre": "Application process has been a headache…",
          "Contenu": "Application process has been a headache trying to figure out if I’ve been approved or not. Applications can already be in on a house and still the company is taking applications from other people which makes no sense."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T01:47:12.000Z",
          "Titre": "Could have moved to 5117 Blackem McKinney, TX",
          "Contenu": "We could have moved in to 5117 Blackelm McKinney, TX, but it took the owner a long time to respond so we had to rent another house. We had a deadline to move, and the owners took their time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T17:35:08.000Z",
          "Titre": "Poor communication and technical issues",
          "Contenu": "We submitted our applications and received the confirmation email. By two days later, we hadn't heard anything else so we reached out to the Property Management company who said none of our reports came through from Findigs. It was difficult getting in touch with anyone at Findigs since the only option is a chat. I was able to get ahold of someone when I opened the chat, but it took the individual over 25 minutes to respond, resulting in an expired chat that kicked me out. I tried a few times to get back in to a chat but it would not connect. I had to reach out to the Property Management company again and tell them I could not get ahold of anyone, so they said they would call. I was able to get back in to a chat later in the day, and was told our applications experienced a \"technical issue\" and that we could not be provided a time when it would resolve. This was very stressful since the Property Management company could not move forward with anything without our reports. A day or so later our reports finally went through and it delayed are ability to get an approval and send our deposit to the Property Management company. Findigs is a great idea, but for something as important and time sensitive as renting a home, there should be more urgency and a better avenue for communication"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Diane Bracher",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T22:57:20.000Z",
          "Titre": "The system was very inflexible and…",
          "Contenu": "The system was very inflexible and impersonal. I have never dealt with a third party system for a rental. The actual log in to add information was not user friendly. There were no options if you did not have what was requested. I was in CA and my dogs shot info was in MI. I called my vet and they never emailed it to me. I did not have it. I was emailed NON stop. I have over 18 emails DEMANDING my dogs shot records. This added to the stress of the move. I felt I was going to lose the perfect rental because of my dogs shot records. Some of the replies were not very nice. I felt harassed. I appreciate the importance of good background information but try to fill out your own form and see how easy it is. For example, it asked for my landlord's email. I have been renting for over 10 years and NEVER had a landlord's email. It would NOT allow me to skip that spot. At the time I was filling out the information in CA, my landlord was fast asleep. I was not going to wake her up for her email address. I just found it very impersonal and frustrating. I can tell you, if I have a choice between two rentals and the one I like better uses this service and the other does not, it could be a deciding factor as to which one I move forward with. Granted, my nerves could be running high, making this move from Michigan to CA. River View was great to work with and the house is lovely. The process was harrowing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "McRae",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T03:40:06.000Z",
          "Titre": "Request of information overkill",
          "Contenu": "When the requested information is sent and they continue to tell you it’s not enough when you feel like you have basically given them everything that could potentially create fraud issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T23:23:45.000Z",
          "Titre": "Double rented the apartment",
          "Contenu": "Double rented the apartment, took money from us and have not refunded. Will not use finedigs or any home river property"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T17:27:08.000Z",
          "Titre": "Too restrictive",
          "Contenu": "A lot of the questions that were asked required answers that didn’t apply."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Doodlerdave",
          "Nb_Reviews": 6,
          "Date": "2023-10-09T17:45:16.000Z",
          "Titre": "Can't go back and change stuff",
          "Contenu": "you should be able to back and correct things you didn't understand the first time around."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T13:38:03.000Z",
          "Titre": "Very hard to navigate and no help",
          "Contenu": "Very hard to navigate and no help. Chat did not work. Frustrating experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T21:54:33.000Z",
          "Titre": "Respond to your customer in a timely…",
          "Contenu": "Respond to your customer in a timely manner. Let your customers know what they qualify for. Poor customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T20:02:45.000Z",
          "Titre": "The approval process is extremely slow",
          "Contenu": "The approval process is extremely slow. I have rented other houses and had this done in a quarter of the time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T02:34:43.000Z",
          "Titre": "So far from what I’ve experienced",
          "Contenu": "So far from what I’ve experienced, the response time is very slow."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:58:00.000Z",
          "Titre": "Customer service problems"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T18:19:34.000Z",
          "Titre": "Terrible customer service, all they are worried about is getting your money and not trying to make you feel welcomed. Ask all the questions that come to mind because they will try to scam you",
          "Contenu": "They don’t care about customer service just how they could get your money. They don’t make you feel welcomed at all"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gina",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T21:09:44.000Z",
          "Titre": "The website is confusing",
          "Contenu": "The website is confusing. It’s hard to navigate. And there’s fees for payment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T19:02:02.000Z",
          "Titre": "The experience is frustrating with lack…",
          "Contenu": "The experience is frustrating with lack of personal communication between business and customer.  The app is fine - it’s the impersonal assistance and difficulty getting a real person to assist"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T19:06:14.000Z",
          "Titre": "Could not get co-applicant emails to go…",
          "Contenu": "Could not get co-applicant emails to go out or one that did would not allow pre-existing one to be attached without significant intervention by property manager."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "hankpearl777",
          "Nb_Reviews": 3,
          "Date": "2023-09-01T02:05:10.000Z",
          "Titre": "I've been approved but haven't received…",
          "Contenu": "I've been approved but haven't received a lease to sign. I've messaged multiple times."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:29:47.000Z",
          "Titre": "Had some technical difficulties."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:57:45.000Z",
          "Titre": "Asked for too much documentation and…",
          "Contenu": "Asked for too much documentation and personal information"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Agatha",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T00:31:48.000Z",
          "Titre": "Took too long to answer questions",
          "Contenu": "Took too long to answer questions. Answers very bot like."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T00:43:44.000Z",
          "Titre": "Onerous- no human contact",
          "Contenu": "Onerous- no human contact - honestly not a great experience"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T22:57:09.000Z",
          "Titre": "The communication and response is…",
          "Contenu": "The communication and response is limited and slow, unclear at times"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T01:51:06.000Z",
          "Titre": "Too long",
          "Contenu": "Too long, difficult to follow, to much personal info, cookies"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T18:13:13.000Z",
          "Titre": "Took a day for a response",
          "Contenu": "Took a day for a response.  Sent both a text and email each time (pick one please, not both)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T23:14:54.000Z",
          "Titre": "The complete transaction with On Q…",
          "Contenu": "The complete transaction with On Q property management has been the worst business interaction I have ever experienced"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jwan",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T15:38:37.000Z",
          "Titre": "Cumbersome to use",
          "Contenu": "Cumbersome to use. Not a smooth process"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T23:53:35.000Z",
          "Titre": "Not easy to use and overpricec",
          "Contenu": "Not easy to use.Fees are double priced way over expensive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:09:55.000Z",
          "Titre": "Poor communication and poor website"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amal jeilani",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T01:06:43.000Z",
          "Titre": "not getting Respond on time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff Smallwood",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T16:38:51.000Z",
          "Titre": "Process is way to lenghty"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T02:59:50.000Z",
          "Titre": "Difficult website",
          "Contenu": "Confusing and difficult website to navigate and submit"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Unsatisfied Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T03:00:18.000Z",
          "Titre": "The communication is terrible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "truthseeker pisces goddes",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T18:20:27.000Z",
          "Titre": "Not in a home yet"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:38:47.000Z",
          "Titre": "not bad",
          "Contenu": "everything was okay honestly, but i’m an adult and the person overheard my mom say oh hell no and i said i’ll make the decision and get back as soon as possible and instead i was told “im just gonna cancel your application”. it was cancelled because i “didnt have the money to move in” when i very much did and just needed to think on it being that it was 9pm and it is a huge financial decision to make instantaneously especially at 18. all i needed was a few minutes. but other than that it was ok."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:08:20.000Z",
          "Titre": "Have never done this of rental so…",
          "Contenu": "Have never done this type of rental so I had lots of hesitation. It turned out ok but I believe your system can be made more user-friendly for older less technical aware clients"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:51:53.000Z",
          "Titre": "Way too much manual input of info that…",
          "Contenu": "Way too much manual input of info that a simple credit check would have covered on it’s own"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T21:48:15.000Z",
          "Titre": "The process was simple but it took a…",
          "Contenu": "The process was simple but it took a while to here back. Not only that but the house I originally applied for was taken off market after I applied 7 days before. I had to start the house looking process completely over. Very frustrating but it work out for the best."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T17:09:28.000Z",
          "Titre": "Policies difficult to navigate",
          "Contenu": "Policies difficult to navigate. Very strict and needed same information multiple times."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John-Denver",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:00:00.000Z",
          "Titre": "The technology you use is wiz bang???",
          "Contenu": "The technology you use is wiz bang. The function of it is kludgy, redundant and disconnected between systems."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lucy Botwick & Michael O'Neal",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:46:06.000Z",
          "Titre": "Better Clarity and Communication",
          "Contenu": "The communication I believe could have been better and more clear. We believe that we lost out on the opportunity for the second house we applied for because we weren't getting the answers we needed. It became very frustrating that weren't getting the clarity we were asking for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T07:41:44.000Z",
          "Titre": "Not being able to see the property and…",
          "Contenu": "Not being able to see the property and the denial of my Esa when I gave proof of prior Esa rating"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Allen Reid",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:34:03.000Z",
          "Titre": "Client punch list",
          "Contenu": "-Clean floors-Finish PVC drain connection under kitchen sink -Connect washroom door back onto sliding bracket -Finish blinds"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T21:01:41.000Z",
          "Titre": "Personal information",
          "Contenu": "Too much personal information requested as we had to supply both social security and bank account numbers. Also, the tenants name should be referenced on the request. I only knew what this was because my daughter told me. Otherwise Findigs might be considered a fraudulent site as it’s one letter off Findings."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Blanca Kasold",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T01:07:01.000Z",
          "Titre": "Glad it’s over…",
          "Contenu": "Did not like the poor communication after funds were paid. Got thrown in to a waiting game that stretched for additional days due to you taking too long to send funds in"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T22:10:26.000Z",
          "Titre": "The process for a married couple with…",
          "Contenu": "The process for a married couple with one income was very cumbersome. Lots of redundant entry and repeated questions particularly since we are a single-income family. You might have a married check box with option to have single earner to cut down on the entry."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T01:58:49.000Z",
          "Titre": "Website kept crashing when I got to the…",
          "Contenu": "Website kept crashing when I got to the ID varification portion it took over an hour to get through it!!! What a pain !!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:18:32.000Z",
          "Titre": "Communication and response seemed…",
          "Contenu": "Communication and response seemed lacking in the whole process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shontia Ormon",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T19:14:09.000Z",
          "Titre": "Not a bad service but when I’m giving…",
          "Contenu": "Not a bad service but when I’m giving my information or monies, i would like to make sure it’s legit. With so many scams, I felt a little uneasy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ben Colorado",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T21:50:50.000Z",
          "Titre": "A little too slow",
          "Contenu": "I wish the process after application went faster, and I could have been approved faster. I took a different apartment as it took 6 days to hear anything back that I was accepted. I figured I didn't hear back after almost a week so I took the other apartment. I think it's important to remember a lot of people are probably applying for multiple apartments, so time is critical. The apartment I ended up taking had everything completed in two days. Positive things, the application process is easy and not largely time consuming. Very thorough too, which I believe would certainly remove less than desired tenants. That is solid. I have nothing bad to say, I just wish it was faster."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ashley Jackson",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T16:43:57.000Z",
          "Titre": "Difficulties if not an American",
          "Contenu": "It was relatively difficult for me to use Findigs as a Canadian international student in the US. I don’t have a SSN or an ITIN, so I cannot be credit checked. Fortunately I was connected to staff right away through a live chat and was given an override for the SSN section. Also, I could not enter any address information from Canada, as there was no “country” dropdown or selection ability, but I have a permanent residence address in Canada that my tax information is connected to. Even the US government and my university allow me to input an address from another country as my permanent residence for tax purposes. I know that I am likely in the minority of people who run into this problem on Findigs, but international students, people with work visas, etc, do exist and these issues can be really frustrating. The Findigs system is very easy to use otherwise. They have it streamlined and I was able to fill everything else out quickly. I did appreciate the ability to chat with someone if I needed help. Pretty user-friendly interface."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T01:23:17.000Z",
          "Titre": "Rental 'RULES\" not family oriented",
          "Contenu": "1st team - (rental applicants, qualifier) have done a wonderful job KUDOS for them.2nd team - (leasing contract, house rules provider NOT SO MUCH.they don't even return your phone call. Properties unless for senior renters only, must be family oriented. The reason I had to back out from my rental offer after Credit checks, Income checks, backgrond  cks., etc. Good luck !!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T14:50:45.000Z",
          "Titre": "uploading documents there should be an…",
          "Contenu": "uploading documents there should be an alternative for people up in age who are not computer savvy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T22:10:05.000Z",
          "Titre": "Had a rough start…",
          "Contenu": "Had a rough start where I applied uploaded all documents and property manager started asking for an offer letter for a home that was no longer available when I called over the phone. Long story short emails were sent and this issue was resolved,  applied for new property and everything went smooth sail… turns out I never needed an offer letter. Moving in my new home soon !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sig Buster",
          "Nb_Reviews": 2,
          "Date": "2023-08-27T02:54:48.000Z",
          "Titre": "Poor People Skills",
          "Contenu": "I would much perfer to discuss a 31 page legal doc cument with a live person. I am not part of the Gen XY orZ generation. Real Estate is still a people business and to give me this document without benefit of means to discuss or ask questions is usually a deal keller for me. I don't really expect you to view it as a people business or to change your Guidelines because you won't."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T18:32:20.000Z",
          "Titre": "Fair",
          "Contenu": "I have a somewhat smooth process. Paperwork aspect was great. House choosing was iffy. We had to change houses twice. Once because the system didn’t catch when another tenant paid before me & another when we were told AFTER agreeing upon a property that it was being remodeled. Third house is the house we finally received a lease on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kelli Kimbrough",
          "Nb_Reviews": 4,
          "Date": "2023-11-02T10:30:06.000Z",
          "Titre": "Don’t like you have to pay all that…",
          "Contenu": "Don’t like you have to pay all that money just to see inside a house. Anything can happen where the company don’t answer and you lose your money companies spam people to"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T22:36:13.000Z",
          "Titre": "Easy to Use, but Highly Invasive",
          "Contenu": "You were super easy to use…. but I felt strong armed into sharing pictures/information that I was not comfortable sharing. Unfortunately, we needed housing and the property management company forced us to use you. I felt like I had to pay for your invasion of my privacy without any clarity on your data policies.I have no idea how long you are retaining my data. What evidence do I have that my data and images are deleted from your server now that my application has been approved? How do I know that you are appropriately protected against cybersecurity hacks?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angela Blackburn",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T19:59:29.000Z",
          "Titre": "The site kept kicking me out and…",
          "Contenu": "The site kept kicking me out and restarting in random places in the application. It took me over two hours to complete and would not allow me to go back and change/correct items that had been entered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KMST",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T02:52:42.000Z",
          "Titre": "I prefer a more personal experience"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ruth Kaplan",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T19:02:14.000Z",
          "Titre": "A system needing improvements",
          "Contenu": "It took me over 2 hours to fill out the application, far more time than I had.  The application requested income sources but there was nowhere for me to add resources that I had from which I was not taking income.  I wanted to include a copy of my last tax return but there was no way to do that.  Instead of paying a month's security, I was required to pay 2 which I am not happy about."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T23:40:15.000Z",
          "Titre": "No direct live communication",
          "Contenu": "All communication was via e:mail and text.  I would prefer a direct connection with the company via a phone call with the person in charge of the review process.  Not having any idea when approval would occur was very stressful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RM",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T18:26:31.000Z",
          "Titre": "Sort of frustrating",
          "Contenu": "Having to do everything online, while living out of state from my mother whom we were applying for, was very complicated.  We had go find someone to help take pictures of her ID and the face scan."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nic",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T22:29:19.000Z",
          "Titre": "What on God's Green Earth…",
          "Contenu": "What on God's Green earth do you need to run a background check more extensive that the US Military to rent an overpriced rundown space to a poor veteran about to be homeless and barely making it as it is?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T00:19:32.000Z",
          "Titre": "I did not like the fact that I was hurried to read the lease.",
          "Contenu": "I did not like the fact that I was not sent a picture of the refrigerator put in the unit; the time frame to read the lease was hurried and harrassing.  Too much is done on line and not enough of personal communication."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T05:37:18.000Z",
          "Titre": "Easy but coapplicant problems",
          "Contenu": "The application process was easy, but adding a coapplicant was problematic. The invite email was never sent, the password reset process only worked half the time, and my coapplicant could never apply. We had to submit two different applications and merge them, which was problematic."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer rental",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T04:40:40.000Z",
          "Titre": "It's not as user-friendly as most…",
          "Contenu": "It's not as user-friendly as most portals we have come across."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T01:03:22.000Z",
          "Titre": "I love the property and the how helpful…",
          "Contenu": "I love the property and the how helpful Whitney was but the whole online process and contact less aspect was a pain this would have been easier to sit with someone and fill out"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aiyannah And Eriannah",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T23:46:52.000Z",
          "Titre": "we got approved for a house & not even…",
          "Contenu": "we got approved for a house & not even a day later they tell us it’s no longer available.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Collett",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T00:55:53.000Z",
          "Titre": "Found several properties and don’t get any response",
          "Contenu": "Thought this site would’ve provided me with many choices and alternatives, but if the owner(s) don’t get back to you in a timely manor it’s not worth the wait"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mavis Sturgis",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T15:19:26.000Z",
          "Titre": "A confusing experience on one section",
          "Contenu": "Findings seems like a good company - helpful and courteous It might be my lack of tech skills, but I had a very frustrating time on the financial section1. My bank would not come up except with - loans, & I have no loans, & that is what any questions were about - couldn’t give any information & it didn’t take my account numbers, so I don’t even think it was my bank listed with the loans.2. I could give one of my Pensions, but Social Security doesn’t list the U.S. Gov as a business.  I also give piano lessons as a part time business, but there was not a place to add that without a business name & license.*The rest of the app was fine, but I spent a LONG time trying different approaches to give my income & only had my one pension as a total income listed in the end.I guess it ended up OK, but the financial section didn’t fit my profile well.  I would have gone into the office, but I live in the Detroit area."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tiera L",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T22:22:09.000Z",
          "Titre": "A little Confusing",
          "Contenu": "It just got confusing when I had to put a different email for my spouse and for them to fill out an individual. We also had to fill out another application for an adult with disabilities. He can't fill out his own and he will just be an adult in the house. If they could have an additional adult button within the one application that would be so much easier. I understand the landlord needing to know about all the adults in the house but it was hard for me to manage 3 applications. My wife isn't good with computers especially uploading documents. It was also confusing that our information was sent to the landlord for them to approve or not approve. It took me a while to understand the chat feature to upload more information. I was lucky that their was someone I could text on the leasing officer side to tell me to upload in the chat. I think that over all it was a pretty decent way to apply and to get the documents. Thank you for asking for feedback"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T19:25:17.000Z",
          "Titre": "In general the process was ok.",
          "Contenu": "In general the process was understandable.The linkage between applications in a group was not clearly labelled.Also, after each applications was finished there were multiple emails, that was confusing.  Just one confirmatory email is enough."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T00:42:43.000Z",
          "Titre": "Kind/courteous staff but slow responses",
          "Contenu": "The application process, and status indicators on the website were really nice. Also the notifications each time an applicant finished a given portion of the application were very useful. Our main reason for 3 stars rather than 5 was a lack of communication combined with significantly delayed responses. I had to call the office multiple times, each time I was given a timeframe of 24-48hrs in which a decision would be made, and each time we waited 3-5 days. This delayed our move in significantly which is quite stressful when trying to coordinate moving out of one place and into the other, and resulted in not being able to schedule movers due to the short timeframe and proximity to the end of the month. In the timeframe between applying and our first response, we were approved for and gave up another property. This does not seem to be the norm given the other reviews we saw, so I’m not sure what the cause of this was.  That being said, everyone in the office was very helpful and courteous, and calling was never much of a hassle, also we did finally get approved and moved in."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ammie",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T00:29:32.000Z",
          "Titre": "The application was a bit wonky and at…",
          "Contenu": "The application was a bit wonky and at times frustrating. Overall, the responsiveness of the property mgmt company has been very good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T22:48:45.000Z",
          "Titre": "Make it phone friendly",
          "Contenu": "I had zero appreciation for the fact that my bank could not connect when I was using my phone. I had to switch to computer to get everything  to work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kimberly Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T03:11:15.000Z",
          "Titre": "This company could be better at…",
          "Contenu": "This company could be better at communicating with potential clients. My family and I were moving from one state to another and needed a place before arriving.  There was three weeks ( which we understand is a short period of time) between the time of our move. We got all of our information in the same day we found a place we liked, but no one responded for about 3 1/2 days later to say we needed extra info. We uploaded that information within 24 hrs and still didn't get a response for another 2 days. Once we got a response,  the house we applied for was taken, we were instructed to choose another home and it wouldn't take but about 2-3 days to hear back. We choose another home from the site, and We didn't hear anything for 4 days saying, that house we selected was taken as well.  In the meantime my family is already on the move to head to our new state in hopes we'd have something within a few days, but no message or call or any updates until the third day of our hotel stay. By then we had already signed a lease from another company with a sure move in date. We had to pay the $75 per adult,  just to get the run around for three whole weeks, it's sad that you guys are charging people this fee, knowing that you're going to drag your feet and let as many people apply, just to keep saying the house is taken. At least offer a portion of the people's application fee back, it's ridiculous."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pink Canary",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T20:16:51.000Z",
          "Titre": "Prompt response was preferred",
          "Contenu": "A real person to discuss the property is preferable to a bot. Prompt response is preferable than delayed response."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T02:41:43.000Z",
          "Titre": "The income verification returned an…",
          "Contenu": "The income verification returned an error in the property manager's system- so we still had to submit paystub documents to them. The online 'instant' income verification was a waste of time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debbie Garrett",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T19:16:07.000Z",
          "Titre": "Have not yet been contacted by anyone…",
          "Contenu": "Have not yet been contacted by anyone regarding the apartment that has been approved! Very disappointed in regards to no one to contact to answer my questions regarding the apartment unit I was approved for!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T08:36:16.000Z",
          "Titre": "my assigned help for my house takes…",
          "Contenu": "my assigned help for my house takes extremely long to respond and i can never call and get anyone to the phone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Becca",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T16:33:08.000Z",
          "Titre": "While I understand the need to be…",
          "Contenu": "While I understand the need to be selective about renters, the process was far too intrusive for my liking."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T00:11:57.000Z",
          "Titre": "It could be better if could be a good costumer services",
          "Contenu": "Not bad it could be better if we had good costumer service from real estate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Guarantor",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T12:53:17.000Z",
          "Titre": "Easy and efficient but couldn’t print",
          "Contenu": "The overall process was easy and efficient. Not being able to print the rental agreement before signing was frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Walter Heffron",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T19:20:29.000Z",
          "Titre": "Way too many hoops to jump through that…",
          "Contenu": "Way too many hoops to jump through that ultimately made my decision for me!! Thank you for you time!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sonya Ramos",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T00:59:28.000Z",
          "Titre": "It took me far too long to complete the…",
          "Contenu": "It took me far too long to complete the application process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T17:01:07.000Z",
          "Titre": "I don't like the fact that I have to…",
          "Contenu": "I don't like the fact that I have to submit full payment just to look at a unit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T00:16:59.000Z",
          "Titre": "The system wasn’t as clear in the…",
          "Contenu": "The system wasn’t as clear in the beginning, but for better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:40:40.000Z",
          "Titre": "Three stars.",
          "Contenu": "I just want to leave a rating"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T17:02:22.000Z",
          "Titre": "I had a little scare thinking I wasn’t…",
          "Contenu": "I had a little scare thinking I wasn’t gonna move in by the 27th"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T19:45:36.000Z",
          "Titre": "It’s not okay to do one application at…",
          "Contenu": "It’s not okay to do one application at a time. I needed to apply to more than one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T14:48:10.000Z",
          "Titre": "Slow notifications",
          "Contenu": "Slow response when it came to receiving messages."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T22:06:41.000Z",
          "Titre": "The application process is too long!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T23:38:10.000Z",
          "Titre": "Their slow response",
          "Contenu": "Their slow response. No sense of urgency"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T15:25:56.000Z",
          "Titre": "The app wouldn't let me finish."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T16:00:54.000Z",
          "Titre": "Sent questions and took days for…",
          "Contenu": "Sent questions and took days for someone to get back to me"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T23:55:55.000Z",
          "Titre": "Would like to actually talk to someone…",
          "Contenu": "Would like to actually talk to someone and not type."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T16:53:09.000Z",
          "Titre": "Very strict and didn’t put the fridge…",
          "Contenu": "Very strict and didn’t put the fridge and microwave out of boxes"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Unique",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T23:05:54.000Z",
          "Titre": "Be patient with gratitude",
          "Contenu": "Thank you kindly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T20:00:59.000Z",
          "Titre": "Unable to speak with a human."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T16:41:46.000Z",
          "Titre": "Had to pay 3 months rent in advance"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T20:43:19.000Z",
          "Titre": "Landlords suck and the tools of…",
          "Contenu": "Landlords suck and the tools of landlords suck too"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T14:48:28.000Z",
          "Titre": "Ok and fast using the finding s."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T02:01:22.000Z",
          "Titre": "Needs updating",
          "Contenu": "The application process and lack of communication wash very frustrating and could really be improved dramatically."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Abouttopuke",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T21:35:05.000Z",
          "Titre": "Too lengthy and drawn out",
          "Contenu": "Too lengthy and drawn out. Too many hoops to jump through."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T01:53:20.000Z",
          "Titre": "Too many websites",
          "Contenu": "Too many websites, bounced around too much."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T17:17:19.000Z",
          "Titre": "Could’ve did way better"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T18:55:14.000Z",
          "Titre": "Prefer not to say"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caleb",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T08:47:30.000Z",
          "Titre": "I got a lot of errors on the website…",
          "Contenu": "I got a lot of errors on the website while trying to apply as a co-signer/coapplicant.  They made the process take much longer than it should have.  I have a rating of 4 stars because of how helpful the customer service agent was, otherwise it would have been lower."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:04:32.000Z",
          "Titre": "Easiest application process ever",
          "Contenu": "Easiest application process ever. Rather than having to dig around looking for pay stubs and bank statements, this allowed to connect to your bank and payroll system. It made the headache of applying to places a whole lot easier!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oscar Mascooro",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T15:03:27.000Z",
          "Titre": "It was helpful.",
          "Contenu": "It was helpful but not the ultimate answer.  You still have to do your own homework and make your own decisions based on your wants and needs. The application process asks a lot of personal questions and the $50 fee for each is non refundable.  Make sure you are sincerely interested and confident you will pass the credit check before you spend the money and give out personal information that doesn't come back."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dana & Morris Russell",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:40:31.000Z",
          "Titre": "Great service, highly recommend",
          "Contenu": "The application process was very user friendly and our reps name was  Chris R.  He kept us informed of our application status, explained our options and was very responsive.  This is as close to our dream home as we imagined and were very glad we chose this company to help us move into a place we absolutely fell in love with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abrams",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:38:30.000Z",
          "Titre": "Findigs",
          "Contenu": "It was hard getting in touch with someone, but things finally worked out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:51:04.000Z",
          "Titre": "Findigs is awesome",
          "Contenu": "Findigs is awesome, but imagine homes property management company is awful. It’s not personable and calling to a call center is awful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexis",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:37:54.000Z",
          "Titre": "It was easy to set up appointment to…yes",
          "Contenu": "It was easy to set up appointment to look at properties.  Application process was easy enough to understand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oscar Mascorro",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T16:56:45.000Z",
          "Titre": "For the most part it went smooth and…",
          "Contenu": "For the most part it went smooth and quick.   The application was sometimes confusing for an old guy like me.  I ended up making 2 applications for me and my wife when it should have been 1 joint application."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T14:36:54.000Z",
          "Titre": "Very responsive and accommodating",
          "Contenu": "Very responsive and accommodating. They worked with me to get me approved. Very grateful. Unfortunately, we chose a different property."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zamara M. Reid",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T04:11:18.000Z",
          "Titre": "My Experience",
          "Contenu": "Just moved back to FL & although this is the first experience of renting a house, which was terrifying, I received step by step instructions in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rhonda Adkisson",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T00:35:57.000Z",
          "Titre": "The experience was quick and easy",
          "Contenu": "The experience was quick and easy.  Everyone I spoke with was friendly and helpful. Best rental experience I have had in applying."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rhonda nublett",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T16:42:05.000Z",
          "Titre": "response in timely fashion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KT",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T01:07:25.000Z",
          "Titre": "Not hard to use but could improve user…",
          "Contenu": "Not hard to use but could improve user experience. It’s straightforward but once you put in all your info and submit your application, you can’t see it anymore and that feels strange."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leslie S",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:43:04.000Z",
          "Titre": "Felicia",
          "Contenu": "Felicia! She jumped right to business and got me approves."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:42:59.000Z",
          "Titre": "There quick responses",
          "Contenu": "Great people to go through. They reply back in a timely manner and they’re very helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T06:52:06.000Z",
          "Titre": "Good work It was easy",
          "Contenu": "I’ve moved into my new pls e so it worked for me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carmen P Hernandez end Miguel",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:29:45.000Z",
          "Titre": "Thank u for helping us to find the…",
          "Contenu": "Thank u for helping us to find the perfect home for my family finding group is very professional"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T00:08:41.000Z",
          "Titre": "The interaction and response has been…",
          "Contenu": "The interaction and response has been top notch. We’ve had some trouble getting a response from move in specialist.  Which worries the wife.  And because this is all online, and we now have a very small window to move in. We had all utilities switched to our name within the next day. And emailed proof.  But last 2.5 days we are being contacted, saying we haven’t shown proof.   A certification of submitted proof would be nice. Or I’d give 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edna Boykins",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T15:43:41.000Z",
          "Titre": "The experience was great because",
          "Contenu": "The experience was great because, it made things like uploading documents, and linking bank accounts easy. The help tool was easy to use also."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hauwa Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T07:47:43.000Z",
          "Titre": "Good experience with Findigs",
          "Contenu": "We had a good experience using Findigs, communication with customer service was swift and they were able to help us transfer our application to another home fit our needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customerDeanna Demps",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:06:04.000Z",
          "Titre": "The continuing to help navigate and and…",
          "Contenu": "The continuing to help navigate and and assist u in a timely matter."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T20:24:05.000Z",
          "Titre": "No ability to erase a started application",
          "Contenu": "Most issues occurred when trying to add a coapplicant on the application. We both started an app without realizing we needed to send the co-signer link first and use that. When we tried to use the link an error occurred when we said we wanted to start over with a fresh application. It finally allowed us to add the coapplicant when we changed the address on one of our two applications, invited the other, and chose start new app. It never did show up that we were applying with each other though. We were told by the helpline that they were linked on his end, so we should submit even though it appeared on our end we were submitting separately."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan S.",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T19:39:38.000Z",
          "Titre": "Made a stressful process simple",
          "Contenu": "Going through the application process is stressful. However, FinDigs made it simple with their UI that walks you through the process. One area of improvement would help make it much more clear that a use can upload docs versus using only Bank Statement or Payroll processing apps."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T02:09:19.000Z",
          "Titre": "Family Reunited",
          "Contenu": "We were trying to relocate our elderly parents, so that they can be taken care of by family and Findigs made this possible without jumping through hoops. Where other companies didn't respond to us but they took our money without the courtesy or acknowledgement of our application."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carla",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T14:51:13.000Z",
          "Titre": "I love my home",
          "Contenu": "Taylor was a sweetheart. When I first started the process, I was afraid of being scammed because everything was boarded down, and the first processor was really slow about things. Once I spoke to Taylor I felt more comfortable moving forward and I'm really glad I did because my home is beautiful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Desmond Howard",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T19:59:12.000Z",
          "Titre": "THANK YOU home river!!!",
          "Contenu": "It was a mix up on the price of my original choice, but to be honest they took care of us we move in soon!! Been seeing a lot of negative reviews but I’ve seen nothing but A class treatment!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynne",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T22:14:17.000Z",
          "Titre": "Application was approved in less than a…",
          "Contenu": "Application was approved in less than a 1 day. But filing out the application was painful and very long to complete...  On top of all my financial, employment, credit, banking and legal history, why do you need the weight, the age ,a picture and color of my cat + her vaccine certificate or a picture of my vehicle after I provided all the details ? Applying for a mortgage is actually less intrusive. All in all, I do appreciate their speed and fully online process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen C",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T17:21:39.000Z",
          "Titre": "Work hard to help tenants and owners come to an agreement",
          "Contenu": "Helped us find a new place to rent in a timely manner. They also worked with us to modify the contract with the property owner to fit our needs. Felt like they really wanted to help landowners and potential tenants come to a suitable agreement and all in written contract to make it official down to the smallest detail."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan G",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T00:31:05.000Z",
          "Titre": "The instructions for getting in were…  Easy and thorough",
          "Contenu": "The instructions for getting in were easy and thorough.  The condo is very nice with enough furniture and kitchen utencils.   The view from the upstairs deck is great with ocean and sunset views.  The home needed a lot of touch up cleaning. With a $400 cleaning fee, the cleaners did a quick half hazard job with crums under the kitchen cabinets, dirty counter tops, etc...   The worst was the outside patios.   They were not swept or hosed down at all and lots of cob webs.  We did contact property management and they did send a cleaning crew out right away.  The home could use some patio furniture for the downstairs patios and additional chairs for the upstairs patio.  In a perfect world, they would have a small high top table with high chairs which would be great for enjoying the nightly sunset...    Also, there is no BBQ.  Lastly, the plants and flower beds are really bad and totally neglected.   But, once again, management came through and allowed their handy man (Warren) to come in and trim dead shrubs and lay down mulch.  Warren went over and above to make things right."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zulma",
          "Nb_Reviews": 2,
          "Date": "2023-10-15T23:18:48.000Z",
          "Titre": "We loved dealing with one person",
          "Contenu": "We loved dealing with one person, ONE- Clint, not 4!! It’s very overwhelming when receiving emails from several people during a major move like this one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T19:30:59.000Z",
          "Titre": "Great experience",
          "Contenu": "A few times the messages would turn from blue to grey and wouldn’t send messages however I do like the other features that I can send files and such! Overall a good experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T10:58:36.000Z",
          "Titre": "It was good expierence",
          "Contenu": "It was good expierence. Only recommendations I have is it would have been good to be able to skip to next section and come back to a section. For example I didn’t have my references emails but I wasn’t able to skip that part and keep filling out the information and return once I had it. I had to complete that section prior to moving forward. This would have helped me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Jockin",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T21:09:28.000Z",
          "Titre": "Everything was smooth",
          "Contenu": "Everything was smooth, but then I couldn't review my completed application, so I couldn't check for errors. I know, I should be sure before I submit, but I worried I might have filled something out wrong that would void my chances."
        },
        {
          "Note": 4,
          "Lieu": "RS",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T07:31:43.000Z",
          "Titre": "Identity verification is a bit…",
          "Contenu": "Identity verification is a bit confusing, you cannot do the selfie and ID scanning with your laptop camera, you have to shift to your smartphone and then return back to the computer. One step too much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth Roecker",
          "Nb_Reviews": 4,
          "Date": "2023-09-25T14:08:37.000Z",
          "Titre": "Online rental application made easy",
          "Contenu": "Online rental application made easy. ** Have all your information handy so that way you can enter everything without having to run around looking for info."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T04:19:50.000Z",
          "Titre": "Beware and be sure you apply to correct Realtor",
          "Contenu": "Applied to a Random address on Findigs as the chat instructed, that they could change address on their end, my Realtor stated they would refund the application fee due to a mistake Come to find out it's a whole other Realtor and was denied upon letting them know, and that other Realtor still took my application fee stating it was a 3rd party and could not refund. Beware and be sure you are applying to the correct Realtor."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Latoya",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T18:28:25.000Z",
          "Titre": "I liked that I had the chance to…",
          "Contenu": "I liked that I had the chance to communicate with the property manager but I didn't like the that it took song to reply back"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T02:00:44.000Z",
          "Titre": "The communicating with property…",
          "Contenu": "The communicating with property management was weary. It was long before you received a response if they were to chat you. I would prefer some form of verbal communication."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T17:39:43.000Z",
          "Titre": "Good customer service",
          "Contenu": "I liked the quick response the company done with reviewing my application. The staff I spoke with over the phone or by text were very helpful throughout the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S.S",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T22:54:10.000Z",
          "Titre": "They worked with my family to get us…",
          "Contenu": "They worked with my family to get us approved. As well as the communication was smooth and on time. I also appreciated when explaining a hardship, they understood and didn't just treat me as another set of dollars 💰. Hopefully, this journey with the Findings will be a long one😊"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:56:03.000Z",
          "Titre": "It was very easy to navigate…",
          "Contenu": "It was very easy to navigate and much less stressful than sitting at a desk waiting for a response."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CE",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T01:38:59.000Z",
          "Titre": "Good but one suggestion",
          "Contenu": "Although the application itself was tedious,  the format of the form was pretty easy and straightforward. One thing that I didn't like was that I couldn't skip over entering some fields of information then come back to it later when I had access to the information. I was stuck waiting on specific info that I didn't have right on hand and couldn't complete the info that I did have at hand in the meantime."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lily",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T23:46:42.000Z",
          "Titre": "It has been a pleasure finding a rental!",
          "Contenu": "I really like this company. Everything they reach out they are friendly and quick with their responses. I have found finding a place to rent to be a less stressful experience. One thing that was challenging was the application process was not always friendly. Sometimes it would not register my responses or it would not load the next page at time. Over all it has been a pleasure!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T06:24:48.000Z",
          "Titre": "I think there should be a telephone…",
          "Contenu": "I think there should be a telephone number giving at some point if there is a miscommunication via text message. Sometimes it's hard to text everything you need."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kiani Kaahaaina",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T19:59:29.000Z",
          "Titre": "Findigs has been great",
          "Contenu": "Findigs has been great! There's been a few instances where updates were made to the system and our dashboard that did not work well for our workflow, but our representative always answered questions immediately and assisted to update with our requests.I do receive some complaints from interested applicants who can't figure out how to complete the application or connect their bank account, etc. but I feel that is a case by case issue. I would also say that we receive an overall summary at the top of the application, but guarantors are not included. I then have to manually click through the guarantors to which I wish they had a summary as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T01:45:34.000Z",
          "Titre": "We found your application process…quite difficult to follow and fill out.",
          "Contenu": "We found your application process online quite difficult to fill out. Much of it was redundant and by that I mean the form made you repeat the same information on each different part of the application. It would help if somehow once you entered the personal information it would be linked to the other parts of the application."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hector R Salazar SR",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T22:21:18.000Z",
          "Titre": "Fast results"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sonja Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T16:48:18.000Z",
          "Titre": "Everything was good but the dryer was…",
          "Contenu": "Everything was good but the dryer was disconnected when I moved in so it took me a min to reconnect it And the shower knob is broken"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leola Bellazzin",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T17:58:56.000Z",
          "Titre": "Time and communication",
          "Contenu": "Not having to deal with owners directly in order to get home. The process ca be simplified if contact was done over the phone. Not everyone is computer savvy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T04:09:35.000Z",
          "Titre": "Very easy to start two applications",
          "Contenu": "Be sure to use the link your housemate sends you. If you start two separate applications you have to have someone from Findigs merge the applications."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T01:39:12.000Z",
          "Titre": "Not amenable to the unique needs of…",
          "Contenu": "Not amenable to the unique needs of seniors who are technologically challenged but the property seems like it's beautiful. Also quite expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Courtney Rosen",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T05:50:56.000Z",
          "Titre": "I love the linked bank accounts, scroll factor is dizzying",
          "Contenu": "I love the linked bank accounts, that the software keeps getting updated, the doc reading, the pet screening etc..And the scrolling and tabbing is killing me - it's also really hard to find their story - why are they moving, what's going on? etc"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Courtney",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T13:35:28.000Z",
          "Titre": "Findings has been good so far",
          "Contenu": "Findings has been good so far. I have no complaints. They reached out quickly if they needed something more from me. If I have questions they have responded in a timely manner. So far I would recommend this company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T22:46:04.000Z",
          "Titre": "The overall experience was excellent",
          "Contenu": "The overall experience was excellent. They continuously make sure to communicate with you about any questions or concerns."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T22:07:28.000Z",
          "Titre": "Findings helped me get a home.",
          "Contenu": "Findings was able to handle my application fairly seamlessly. I think having a quick video tutorial on how the process works would help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shelley",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T20:32:07.000Z",
          "Titre": "Staying on top of everything",
          "Contenu": "Worked well with you guys,on a daily basis. You all were an awesome team,with,wonderful phone edicate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T17:22:55.000Z",
          "Titre": "A pleasant experience",
          "Contenu": "From the application to the move in, every moving part and person was very helpful and had quick response time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lola customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T21:02:06.000Z",
          "Titre": "Easy move in It was a quick and easy move in process…",
          "Contenu": "It was a quick and easy move in process and Diana and staff was wonderful! Plus I won a gift card on the spin wheel 🥳. My new apartment is great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T22:31:08.000Z",
          "Titre": "Communication was good",
          "Contenu": "Communication was good. I thought the application was too intense. I felt like I was being questioned to purchase the property vs rent the property."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lachelle Manley",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T21:49:02.000Z",
          "Titre": "doing everything by the book returning…",
          "Contenu": "doing everything by the book returning phone calls keep customers updated on move in process"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M. J. Chase",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T02:28:49.000Z",
          "Titre": "My Experience Passed",
          "Contenu": "I received prompt responses, and had all of concerns addressed. When I requested to speak with my agent on findings.com, he called me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T20:02:12.000Z",
          "Titre": "Easy to use and self explanatory",
          "Contenu": "Easy to use and self explanatory! I had trouble using the “verify bank” connection and had to manually upload documents but that was easy as well!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelvin Enarinmwian",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T18:52:00.000Z",
          "Titre": "Great working with you guys ,even in…",
          "Contenu": "Great working with you guys ,even in difficult terrain y all still keep pressing till one gets results.thanks to the team"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Velazquez",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T22:37:11.000Z",
          "Titre": "Helpful team",
          "Contenu": "A Maurice went above and beyond for me and my family. I appreciate everything that was done to help us have the perfect rental"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MIDALIS",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T20:40:01.000Z",
          "Titre": "It was a little complicated because…",
          "Contenu": "It was a little complicated because there was not much communication with someone who explained how to fill out the application but acceptance was quick"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debora",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T12:22:51.000Z",
          "Titre": "It helped a lot with communication and…",
          "Contenu": "It helped a lot with communication and updates on the whole process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wale A",
          "Nb_Reviews": 3,
          "Date": "2023-10-07T16:43:32.000Z",
          "Titre": "The staff was really helpful and easy…",
          "Contenu": "The staff was really helpful and easy to reach. I had lots of associates follow-up and make sure along the way I was taken care of. Top notch service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T01:28:14.000Z",
          "Titre": "Thank you for the approval and communication.",
          "Contenu": "Once we received a property manager the process moved a little faster and was able to communication with someone about the process AJ is wonderful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T11:47:46.000Z",
          "Titre": "It’s been amazing working with this…",
          "Contenu": "It’s been amazing working with this company. I found my new home and planning to move in soon. Appreciate the experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T00:57:00.000Z",
          "Titre": "Great for communicating with PMs",
          "Contenu": "Great for communicating with Project or Property managers but it does not update the candidate or tenant's information on the account very well"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C.L.",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T02:54:04.000Z",
          "Titre": "To be honest",
          "Contenu": "To be honest, aside from being able to upload documents, the site seems only geared towards property management."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JackieK.",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T22:35:10.000Z",
          "Titre": "The process was pretty easy.",
          "Contenu": "The process was pretty easy.  Just had an issue with loading requested pictures."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T00:17:24.000Z",
          "Titre": "User friendly process without needing…",
          "Contenu": "User friendly process without needing to go to an office, process flow made sense too…"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emilee",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T19:50:04.000Z",
          "Titre": "Great resource, but long response time",
          "Contenu": "It took 6 - 12 hours to get a response in the chat. Still, a helpful resource for those trying to get approved on a home quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T18:15:57.000Z",
          "Titre": "Keeps me informed of the progress and…",
          "Contenu": "Keeps me informed of the progress and process so I don’t miss anything"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T00:33:31.000Z",
          "Titre": "I didn't hear back until Monday which…",
          "Contenu": "I didn't hear back until Monday which could have been put in the approval email."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glover",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T22:49:33.000Z",
          "Titre": "Overall great experience just wish they…",
          "Contenu": "Overall great experience just wish they would give a daily update on processes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T00:09:20.000Z",
          "Titre": "This company is very helpful and…",
          "Contenu": "This company is very helpful and dedicated to finding you a great home."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T17:11:25.000Z",
          "Titre": "Perfect Home finding place",
          "Contenu": "Perfect Home finding place Finding.com helps & guide for fulfill the requirements."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "P. Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T01:39:39.000Z",
          "Titre": "Findig Fast",
          "Contenu": "Findigs was really helpful and fast in processing our application. Love the service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Belpedio",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T03:31:08.000Z",
          "Titre": "For the Not the worst, not the bestmost part good but a lot of…",
          "Contenu": "For the most part good but a lot of repetiveness in request for documents"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T20:30:51.000Z",
          "Titre": "Efficient!",
          "Contenu": "The efficiency and the friendliness is why I give a 4 star rating !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chantal Vona",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T20:18:18.000Z",
          "Titre": "The end result was successful",
          "Contenu": "The end result was successful, the communication part is a little bit complicated. Very difficult to talk to anyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T21:50:52.000Z",
          "Titre": "Hey there the welcoming in ur office…",
          "Contenu": "Hey there the welcoming in ur office was wonderful very appreciated talking with the male and female at the reception makes me feel welcomed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T14:08:23.000Z",
          "Titre": "Lengthy but Easy",
          "Contenu": "Application platform was straightforward and easy to use. Wish it had a method of verifying the listing information"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T17:33:11.000Z",
          "Titre": "The app was glitchy at times",
          "Contenu": "The app was glitchy at times. Tech support was not accessible in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T22:26:48.000Z",
          "Titre": "Good System but kind of funky feature",
          "Contenu": "The application process was simple the only thing that was a little difficult was that we were trying to apply to another property that was owned by the same company it would not let us we had to contact findigs and nomad in order to move our application to the other house"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TitoB",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T02:55:05.000Z",
          "Titre": "good",
          "Contenu": "cool, responsive, simple to navigate"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jackie",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T18:26:09.000Z",
          "Titre": "I loved the digital experience",
          "Contenu": "I loved the updates, virtual/digital experience, and chat feature. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T23:24:23.000Z",
          "Titre": "Very easy and comfortable to work with",
          "Contenu": "Very easy and comfortable to work with! No hassles, easy process!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DJordan",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T22:22:32.000Z",
          "Titre": "Lovely little home!",
          "Contenu": "Enjoyed viewing the house within my time constraints."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T15:02:34.000Z",
          "Titre": "This time",
          "Contenu": "This time, you guys was more efficient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T16:25:42.000Z",
          "Titre": "My husband and I would have rather…",
          "Contenu": "My husband and I would have rather spoken to a live person than a portal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer. Marion Hayes",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T18:13:34.000Z",
          "Titre": "Approved for the Apartment"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T22:40:35.000Z",
          "Titre": "I really don't have an opinion on this",
          "Contenu": "I really don't have an opinion on this. It worked and now I have an apartment. So thank you for being simple and easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Benton",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T20:56:46.000Z",
          "Titre": "GREAT PROCESS",
          "Contenu": "Process was easy,fair and has given me a chance to live in my dream home! Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T04:42:48.000Z",
          "Titre": "Your app sucks",
          "Contenu": "Your app sucks. The process rocks. Smooth."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tasha",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T15:05:07.000Z",
          "Titre": "One thing I like was they will reach…",
          "Contenu": "One thing I like was they will reach back out to you with answers when they say they will"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T20:44:39.000Z",
          "Titre": "great",
          "Contenu": "everything has been smooth and things were handled in a timely fashion"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miriam Ortega",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T01:57:27.000Z",
          "Titre": "friendly platform",
          "Contenu": "friendly platform, easy to understand"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melody Morgan",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:10:09.000Z",
          "Titre": "Really streamlined property management…",
          "Contenu": "Really streamlined property management company. It was so easy to find a rental home and do all the steps necessary to move-in. The Trustmark employee, Raquel, at the Harker Heights office was super friendly and helpful for any issue that I had. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:17:13.000Z",
          "Titre": "Findigs uses a very simple and…",
          "Contenu": "Findigs uses a very simple and effective process that helps gather all the info needed to get people into their future property. It’s very confidential and they take care of their customers. I would recommend this service to anyone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerGeorgina",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T00:44:35.000Z",
          "Titre": "I love Findings",
          "Contenu": "I love Findings. Your fast, easy, and most of all I was very much pleased. I would recommend everyone to use Findings it’s worth it. You definitely won’t be disappointed ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T00:28:34.000Z",
          "Titre": "I had a terrible time with a different…",
          "Contenu": "I had a terrible time with a different management company! I’m very pleased with y’all 3 days and everything is done! Good communication"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:25:25.000Z",
          "Titre": "The BEST Agent",
          "Contenu": "Julian has been AWESOME! The absolute BEST!! He cared about our needs and future. Mr. Julian set the right expectations. He also answered all questions and concerns without hesitation. If you need any assistance please reach out to Julian! He's a rare find in a market filled with shapeshifters."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Damian",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:46:58.000Z",
          "Titre": "Helpful",
          "Contenu": "The manager I worked with was knowledgeable helpful and didn't pressure me. Answered all questions I had. Gave me time to get said documents."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karleena",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:51:40.000Z",
          "Titre": "Simple and quick",
          "Contenu": "Simple and quick. My husband and I don’t have the best credit and we went through quite the struggle finding housing for us and our kids. We were blessed to have found Excalibur homes and a residence to call home. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina Sawyer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:34:16.000Z",
          "Titre": "All customer service reps where…",
          "Contenu": "All customer service reps where friendly and well informed. Thanks to all which helped me succeed in finding my new home"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandy and Michael Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T01:59:41.000Z",
          "Titre": "Our representative Tammy was amazing",
          "Contenu": "Our representative Tammy was amazing. She helped us throughout the entire process. I had a ton of questions and she was very patient in answering and never rushed through like some other representatives from other companies. We can't thank you all enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Langdon",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:50:40.000Z",
          "Titre": "so easy!",
          "Contenu": "Our realtor and the office were great to work with and made it so fast and easy to find the perfect home!! all our questions were answered perfectly and within a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shakira",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T16:39:52.000Z",
          "Titre": "Findigs was an easy experience to apply…",
          "Contenu": "Findigs was an easy experience to apply for my new home rental. Theagent that assisted me in chat made the experience very easy and doable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T18:29:40.000Z",
          "Titre": "Team members worked with me to…",
          "Contenu": "Team members worked great with me to get approved and processed almost immediately for my out of state move into my new home!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T23:07:34.000Z",
          "Titre": "I greatly appreciate the prompt…",
          "Contenu": "I greatly appreciate the prompt responses i received from the associates and agents. You all made this a very smooth process! I only wish it were easier to get some one on the phone lol. But i was fine with the email correspondence. Thank you again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl L Hall",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T20:10:02.000Z",
          "Titre": "Gives you the opportunity to go back…",
          "Contenu": "Gives you the opportunity to go back and check on your application. You can your progress also and it gives you the opportunity to chat directly with whomever your dealing with. Edy professional in my opinion"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:57:16.000Z",
          "Titre": "We appreciated the quick answers to all…",
          "Contenu": "We appreciated the quick answers to all of our questions and the ability to send chats to communicate. The team was quick and helpful in all aspects."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shante",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:00:49.000Z",
          "Titre": "Great Experience",
          "Contenu": "Fast, Friendly Customer Service Although This Was My First Time Using This App."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mohd Hussain",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:49:30.000Z",
          "Titre": "This company is working hard and doing…",
          "Contenu": "This company is working hard and doing their best to get you a house 🏠"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:16:55.000Z",
          "Titre": "It might take a long time to get in…",
          "Contenu": "It might take a long time to get in touch with them but it’s well worth it.. nice houses. Don’t give up keep calling and email them as well .."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Morgan",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T17:52:03.000Z",
          "Titre": "great move!",
          "Contenu": "the process of finding a house was so easy with findig and i’m glad this is the company we went with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanisha Shaefer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T13:26:04.000Z",
          "Titre": "Mr Perez was awesome",
          "Contenu": "Mr. Perez customer service was phenomenal he kept me informed on the application process now I am trying to save funds for the reservation fee and hopefully I could pay it take the house off market and then in 2 weeks pay the rental amount and hopefully get keys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T00:12:13.000Z",
          "Titre": "Forms are faulty unless there if a…",
          "Contenu": "Forms are faulty unless there if a section that allows a person to explain one's life circumstances.  Only when I got to speak to live persons, I was able to get all the help I needed.  Plus, they were all very kind and understanding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:50:06.000Z",
          "Titre": "The help I got made this process so…",
          "Contenu": "The help I got made this process so much easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henisha & Ayana",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:51:18.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Beautiful homes. The whole process was easy and smooth. I love Findigs !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathaniel Terrell,jr",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T04:55:44.000Z",
          "Titre": "Nice place to call home.",
          "Contenu": "The speed and ease of the online application process. And finding a nice property that meets my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Great job Findigs",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:28:20.000Z",
          "Titre": "They was great the communication was…",
          "Contenu": "They was great the communication was awesome I give Findigs 10 star's I appreciate the help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:01:33.000Z",
          "Titre": "The agents stay in contact and keep you…",
          "Contenu": "The agents stay in contact and keep you updated. I applied for the wrong home and they were able to easily fix that for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T02:04:32.000Z",
          "Titre": "Every great about this company",
          "Contenu": "Everything great about this company. And they even work with you if you have challenging credit… your deposit may be a little high but lease you’ll have your own apartment. And that feeling is pricesless"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Bryant",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T20:48:43.000Z",
          "Titre": "They were fast thorough and great…",
          "Contenu": "They were fast thorough and great customer service!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hope J",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T11:33:19.000Z",
          "Titre": "Great experience!",
          "Contenu": "The application process was so simple and I had my approval within two days. I'm so excited to move into my new townhome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:03:23.000Z",
          "Titre": "Most convenient system I've ever used…",
          "Contenu": "Most convenient system I've ever used for renting a place. So far I'm impressed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shontia Anthony-Gill",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T20:43:56.000Z",
          "Titre": "The customer service is great friendly…",
          "Contenu": "The customer service is great friendly and straight forward. Helped me through the whole process. Everybody all around were very helpful and understanding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yawtikki Bethel",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:46:07.000Z",
          "Titre": "I need to be contact more faster.Thanks…",
          "Contenu": "I need to be contact more faster.Thanks for the approver.I need to meet the deadline with housing by Dec12,2023.The company has a lot of great houses.I don't like emailing l but it's ok"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shairoz Shine",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T17:23:17.000Z",
          "Titre": "They are very professional",
          "Contenu": "They are very professional, helped me in the rental process making sure that everything was very clear and understandable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chelsea",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T22:31:56.000Z",
          "Titre": "to work with",
          "Contenu": "to work with, and the communication from Findigs was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alessandra Reiss",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T20:41:02.000Z",
          "Titre": "Everyone should be like Kelly",
          "Contenu": "The gentleman that’s been helping me is absolutely wonderful when there was a roadblock in the beginning process he got me through it with comfort and consideration, and now everything is working out for the best, and I just adore his professionalism and I thank you so much. I know that going forward he’s going to be extremely nice to work with on my future lease coming up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonna R",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T13:38:48.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful. Responds back in a timely manner. They make sure they answer any questions that you have or may inquire about renting a home. Good customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:04:15.000Z",
          "Titre": "My experience with findigs was great",
          "Contenu": "My experience with findigs was great, smooth, and easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T18:44:22.000Z",
          "Titre": "very helpful and efficient",
          "Contenu": "very helpful and efficient. Everyone who helped us made it smooth for anything we wanted to ask."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isabel coriano",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T19:27:40.000Z",
          "Titre": "I will say if you have any questions or…",
          "Contenu": "I will say if you have any questions or concerns, always reach out yo Ms. Tina or Ms. Elly… from the start they have been so helpful… even when I was ready to give up on applying… they made sure to assist me in every step of the way and made it a smooth ride for me to handle any paper work needed. They are so friendly and obtained affective communication all the way to the end…Azure winterpark apartments is a beautiful complex… and accepts 1 1/2 the income to qualify. Anybody that is looking for an apartment, I would highly recommend you to speak to Ms. Tina or Ms Ely 🥰"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Pilling",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:06:21.000Z",
          "Titre": "Great experience",
          "Contenu": "Everything was smooth and easy to use. I'm very pleased with the service and attention to detail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Mohamed",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T18:02:09.000Z",
          "Titre": "Jessica Pena has been very helpful…",
          "Contenu": "Jessica Pena has been very helpful every step of the way.  Answered all of my questions and addressed my concerns in a timely manner.  Have not signed the lease yet but so far, her customer service has been excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Char",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T02:44:20.000Z",
          "Titre": "Apartment/homes",
          "Contenu": "Findigs! made my home search so easy! Customer service was always available to assist!!!! submitting documents was a breeze! Thank you for all you do!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:28:34.000Z",
          "Titre": "Very good company to work with made my…",
          "Contenu": "Very good company to work with made my whole process simple and easy I would most definitely refer people to use it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:29:18.000Z",
          "Titre": "Lease review for house",
          "Contenu": "Jessica has been very responsive, communicative, and great company during the lease process. It was a breeze."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle W",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T14:46:34.000Z",
          "Titre": "New Rental…",
          "Contenu": "Very helpful with knowing when we were given an important email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sydney",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T21:15:24.000Z",
          "Titre": "Nice & Easy!",
          "Contenu": "Sheila and Abigail made this the most seamless application and move in process we've ever had. We're so grateful and excited to live in our new space. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nacarra jones",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T14:50:53.000Z",
          "Titre": "I’ll give you five stars because they…",
          "Contenu": "I’ll give you five stars because they communicate very well as soon as I reach out I usually get a email back"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:24:57.000Z",
          "Titre": "Easy experience.",
          "Contenu": "Simple, responsive, and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T04:08:12.000Z",
          "Titre": "Great service",
          "Contenu": "Great service was on time to the scheduled tour house the was clean great conversation answered all questions I asked all around they were honest and made me feel comfortable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:36:27.000Z",
          "Titre": "Extremely smooth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenira Starks",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:34:49.000Z",
          "Titre": "It was very easy and quick and they…",
          "Contenu": "It was very easy and quick and they have awesome houses"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T22:27:40.000Z",
          "Titre": "Luis Perez was wonderful!",
          "Contenu": "Luiz was very patient, kind and promptly replied with assistance and information! Great personality and so helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T23:14:55.000Z",
          "Titre": "My experience",
          "Contenu": "The process took some work, but overall the experience was quick and went well. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacie Tejada",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T04:34:20.000Z",
          "Titre": "What made my experience great was the…",
          "Contenu": "What made my experience great was the overall professional attitude they had while helping and preparing for my move. Everything was done in a timely manner and good communication with the property manager and the rest of the staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Mccombs",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T21:37:45.000Z",
          "Titre": "Very easy to use and very secure when…",
          "Contenu": "Very easy to use and very secure when it comes to your personal information. Would recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T22:09:02.000Z",
          "Titre": "Great company!",
          "Contenu": "The layout for how everything works makes the paperwork process so easy to get everything done with no papers to keep track of"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Woods",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:14:00.000Z",
          "Titre": "Yes they where very good I think things…",
          "Contenu": "Yes they where very good I think things went along in good timing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T02:54:00.000Z",
          "Titre": "Company was great",
          "Contenu": "Company was great.  The progress was very simple and quick and most importantly to me was very understandable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T01:10:31.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful, thank you so much, happy holidays"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cierra Stoudemire",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T15:21:43.000Z",
          "Titre": "My experience was great it was great…",
          "Contenu": "My experience was great it was great timing responding quick move very quick found me a nice home within no time the price are great  I’m so excited I choosed American ave leasing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:15:44.000Z",
          "Titre": "It was a quick and easy process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Bynes",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T03:31:48.000Z",
          "Titre": "Exceptional work.",
          "Contenu": "The services rendered were exceptional; most importantly the trust was there from start to finish. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele Davis",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T00:55:29.000Z",
          "Titre": "Genuine",
          "Contenu": "Genuine, they really worked hard to get me approved and were quick to answer any questions I had. All and all great experience! 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Villegas",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T17:08:43.000Z",
          "Titre": "Good experience.....so far",
          "Contenu": "First time using them but no hassle so far have been really helpful and nice an accommodating"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:12:49.000Z",
          "Titre": "Fast ans easy 1 time process",
          "Contenu": "Fast ans easy 1 time process, which made finding a home easier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T00:45:06.000Z",
          "Titre": "At first I was a little concerned…",
          "Contenu": "At first I was a little concerned…. But I can say they helped me threw the process and answered all my questions. I happy to be moving in my new home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deja",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T21:45:06.000Z",
          "Titre": "Great!!",
          "Contenu": "So far so good. Everything is on track with my house. Everyone is very nice and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T17:02:20.000Z",
          "Titre": "Smooth and easy process",
          "Contenu": "Smooth and easy process, very friendly staff and fast responses, much appreciated Excalibur!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T02:34:25.000Z",
          "Titre": "Kept me updated on my application"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tairrelle King",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T19:47:01.000Z",
          "Titre": "The CarVana of Home rentals",
          "Contenu": "Came in clutch when we were looking for a place to live. Easy process, great communication with the property Manager."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T16:58:45.000Z",
          "Titre": "Easy to use",
          "Contenu": "The site was easy to use and the support team was super helpful and responsive to myself and my partner :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T04:44:03.000Z",
          "Titre": "Easy And Fast",
          "Contenu": "Easy process, that I was able to quickly access and complete. Definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian R Headecker",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:37:37.000Z",
          "Titre": "Everything was explained clearly and…",
          "Contenu": "Everything was explained clearly and executed precisely. And Luis was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T02:41:11.000Z",
          "Titre": "They was very helpful during this…",
          "Contenu": "They was very helpful during this process bc I had a hard time sending some documents and they made it easier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SHERNITA BOLDEN",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T01:29:45.000Z",
          "Titre": "It wasn't complicated at all",
          "Contenu": "It wasn't complicated at all. The communication was great. I appreciate Findigs help to was greatly appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:47:23.000Z",
          "Titre": "work and",
          "Contenu": "good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:54:44.000Z",
          "Titre": "Continue to check for updates.",
          "Contenu": "They let us know as soon as they could that they wanted to give us the house."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:23:17.000Z",
          "Titre": "I would like to express my deep…",
          "Contenu": "I would like to express my deep gratitude to Mercedez Fullard for their exceptional assistance during the application process for my new home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Torres",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:37:58.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, and reaching as best as they can!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T12:24:47.000Z",
          "Titre": "The people is not good",
          "Contenu": "These people are scammers who are taking people's money"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Octavia Reid",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T04:44:46.000Z",
          "Titre": "The agent Chris that helped me was very…",
          "Contenu": "The agent Chris that helped me was very welcoming and kind and most of all he was patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:05:03.000Z",
          "Titre": "The whole application is super easy…",
          "Contenu": "The whole application is super easy thru findings."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alicia",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T03:10:15.000Z",
          "Titre": "The application was easy to navigate",
          "Contenu": "The application was easy to navigate. They kept me informed immediately. This was the easiest application process ever. Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T18:23:59.000Z",
          "Titre": "Great with communication and…",
          "Contenu": "Great with communication and efficiency! We loved the entire process and can’t wait to move in!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T17:38:52.000Z",
          "Titre": "Rapid update and response to the…",
          "Contenu": "Rapid update and response to the applicant! Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Norcutt",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:51:13.000Z",
          "Titre": "Megan is very professional and outgoing she goes above and beyond for her clients!",
          "Contenu": "Megan was very helpful and went above and beyond to get everything done for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T01:25:33.000Z",
          "Titre": "Love the quick turnaround for an…",
          "Contenu": "Love the quick turnaround for an Approval process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "burnette",
          "Nb_Reviews": 3,
          "Date": "2023-11-19T09:10:42.000Z",
          "Titre": "My experience with findings was very…",
          "Contenu": "My experience with findings was very professional they are very helpful in all areas. Thanks findings."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:39:29.000Z",
          "Titre": "They very helpful when you need help…",
          "Contenu": "They very helpful when you need help and they guide you the way to complete your process and I love the set up"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T01:36:09.000Z",
          "Titre": "Lauren was very helpful and punctual…",
          "Contenu": "Lauren was very helpful and punctual she met my needs for appointments."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Damien C",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T15:41:25.000Z",
          "Titre": "Great for Renters",
          "Contenu": "It was a very fast and simple setup, and smooth transitioning throughout. A solid website!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexis Martin",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T20:19:55.000Z",
          "Titre": "Great Communication",
          "Contenu": "The communication is very good, and they’re always available to answer any question."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:01:34.000Z",
          "Titre": "Quick and easy application process with…",
          "Contenu": "Quick and easy application process with good communication and speedy follow up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T01:41:44.000Z",
          "Titre": "I appreciate the ease of everything",
          "Contenu": "I appreciate the ease of everything. No extensive sign on or passcode links"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Pruitt",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T14:03:18.000Z",
          "Titre": "My experience was a good experience",
          "Contenu": "My experience was a good experience. It was quick and my representative Cierra was very professional and pleasant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:57:25.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Excellent service and a straight forward process. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T16:29:44.000Z",
          "Titre": "Easy set up people the employees where…",
          "Contenu": "Easy set up people the employees where helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie C",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T10:31:44.000Z",
          "Titre": "It was simple process.",
          "Contenu": "Great company to deal with in the rental process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T05:44:44.000Z",
          "Titre": "Rebecca,Jessie and Allison made this an…",
          "Contenu": "Rebecca,Jessie and Allison made this an easy process . And  was very informative and cooperative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:35:10.000Z",
          "Titre": "The process was simple and quick."
        }
      ]
    }
  ]
}