{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "flashbackltd.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Six",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T15:40:45.000Z",
          "Titre": "Ordered a xim matrix and I shipped in 2…",
          "Contenu": "Ordered a xim matrix and I shipped in 2 days but due to it being Sunday it was supposed to deliver on Monday, and I see a message saying insufficient address which has never ever happened to me while getting stuff delivered through usps, I contacted FBL email and they are trying to charge me to reship the item that I paid my hard earned money for. Definitely not recommending this horrible site to anyone. Terrible customer service aswell. And its a scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicholas Whitman",
          "Nb_Reviews": 2,
          "Date": "2021-12-17T21:13:52.000Z",
          "Titre": "Never received product",
          "Contenu": "Never received product, company waived it off as delivery issue.  Label creation issues for order throughout.  The agent I spoke to was nice and at least tried to be as helpful as the bureaucracy would allow him to.  That being said I still did not receive a single thing, nor a refund, nor any credit for the lack of delivery."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Foqen",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T12:34:02.000Z",
          "Titre": "I want a refund.",
          "Contenu": "I reached out to Flashback to explain that I had a defected controller and was told that it was probably a setting that needed to be changed and to refer to the FAQ forum for further assistance. I went through all the forums and updated the controller and USB several times and still have the exact same problems. Gun autofires and will not stop until you have no ammo left. This is controller is trash. I want my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aj",
          "Nb_Reviews": 1,
          "Date": "2021-03-04T21:24:18.000Z",
          "Titre": "Why offer express shipping methods if…",
          "Contenu": "Why offer express shipping methods if you can't keep those promises? I spent 10$ extra on shipping for 2-day delivery but it's been 3 and it's still not anywhere close to me. I ship things all the time and they get where they need to be. If that's a problem for your company don't ship USPS, use FedEx or UPS. I just bought the same thing on Amazon for the same price and shipping won't be a problem.Just checked at it says it will arrive a week after ordering even though I chose 2 day priority."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Albillar",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T21:11:21.000Z",
          "Titre": "The nexus controller wasn’t working and…",
          "Contenu": "The nexus controller wasn’t working and the LT would just function without me pressing it down. I tried getting a refund but every time I open a link it says “server not found”. I don’t recommend this product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "megan varley",
          "Nb_Reviews": 1,
          "Date": "2019-09-18T18:40:04.000Z",
          "Titre": "If I could give it a negative I would",
          "Contenu": "If I could give it a negative I would, it would have been awesome to know or had the webpage ask about ordering the adapters instead i just spend money on a doorstop that has 5 hdmi and no power source.So thanks and I wont be recommending your site"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elijah Schimmel",
          "Nb_Reviews": 1,
          "Date": "2018-06-09T15:57:45.000Z",
          "Titre": "fake product I want refund",
          "Contenu": "Your product that you delivered to me does not work and I just got scammed from you guys I want a refund ASAP or I’m reporting this website that I bought it from. I’m really disappointed because I got it delivered fast to find out it’s a fake product plz give me my refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Toby Kasson",
          "Nb_Reviews": 1,
          "Date": "2019-03-07T18:22:20.000Z",
          "Titre": "I ordered the xim apex on 28th on a…",
          "Contenu": "I ordered the xim apex on 28th on a Thursday it was delivered on the 2 of march. My package was said to come at 2pm but never came. I was told by usps that my package was lost and can not be received. I followed up by calling usps and starting a claim. I was told my package was not covered by there insurance. Instead of flashback taking responsibility for my xim apex being missing and sending me another one. They have said and qoute \"we are doing our own investigation into what happened with usps\" ive emailed three times back and have yet to hear a response. Even tho usps has already closed my case."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lori Russom",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T22:08:53.000Z",
          "Titre": "I ordered an Xbox 360 controller and it…",
          "Contenu": "I ordered an Xbox 360 controller and it didn't work. There was not a return label.  I asked for a return label to be mailed to me but said they wouldn't.  I have know way to print a return label.  I work everyday and they are usually closed but I have to get home to my special needs son.  No reason a return label can't be mailed to me. Now I'm stuck with a controller that doesn't work. I had to buy another one.   I'm an influencer and I'm not happy about your service. Thank you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Mangione",
          "Nb_Reviews": 1,
          "Date": "2020-01-05T19:10:25.000Z",
          "Titre": "The product didn’t even work as advertised as well as being overcharged.",
          "Contenu": "The product didn’t even work as advertised, as well as flashback unlimited charging over $8 more than amazon does. Flashback Unlimited is a low budget scam that I DEFINITELY should have realized before ordering."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lightfoot",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T12:38:07.000Z",
          "Titre": "Dongle fit loosely in NES console",
          "Contenu": "Dongle fit loosely in NES console. I emailed the company and after several emails back and forth they blamed it on my console. Not the  case, my wired controllers work just fine.  The dongle holes are a different size from factory. They did offer me a refund but I have to pay for the shipping back. REALLY?  I’ll NEVER buy another product from Flashback."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Rogelio Gleason",
          "Nb_Reviews": 1,
          "Date": "2019-12-18T04:07:14.000Z",
          "Titre": "I still have not received my package",
          "Contenu": "I still have not received my package. The USPS tracking ebsite showsmy package as waiting for approval since December 3rdI look forward to an wxplanation"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay Boyd",
          "Nb_Reviews": 1,
          "Date": "2021-01-12T18:10:23.000Z",
          "Titre": "I spent $164.42 for one day shipment",
          "Contenu": "I spent $164.42 for one day shipment. ( top priority) that is different than 2-3 business days. I am aware there is a pandemic going on which is why it would be understandable if I didnt pay for one day shipping. I paid for one day shipping for I can avoid getting my product later than expected. The one day shipping did not live up to expectations (guarantee one day shipping). It Is arriving later than expected. In that case it should follow under 2-3 days shipping instead of one. Once again, I paid $164.42 and it is not a fair act of service and didnt not live up to the date arrival. I was not given any updates, change of times, it said it would arrive on January 11, 2021, it is now January 12th therefore Marks as 2+ days   shipping. As I am still tracking my order I am aware and disappointed that I continue to as of now see change of dates arrival. It is only fair I recieve a refund for the one business day. It is now on day 2. Thos is what i sent them they steal your money and lie. These people are scams."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-01-06T18:07:00.000Z",
          "Titre": "Well to be honest",
          "Contenu": "Well to be honest,  this might have been a good review if y'all wouldnt have taken so long to get my package shipped to me.  Then you have the guts to ask me for a review when I haven't recieved it yet?  This is bad.  I'm so angry and this was a Christmas gift.  Hopefully when it finally gets here,  I'll feel better but I'm angry that y'all would ask me for a review whenever I haven't received my beloved purchase yet!  I'd love to know what it's like of course but I havent recieved it yet!!  So thank you for rubbing it in.  Purchase was not on time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Coty Reeder",
          "Nb_Reviews": 1,
          "Date": "2018-08-01T14:50:55.000Z",
          "Titre": "Shipping was fast and product was…",
          "Contenu": "Shipping was fast and product was exactly what I wanted. The controllers I got on Friday of last week, both are not working anymore. Taken care of and only played a few times. This happened on the last controllers I ordered from jet. Haven't tried to email them to make it right yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T20:19:36.000Z",
          "Titre": "Merchandise doesn’t work",
          "Contenu": "Merchandise doesn’t work.   Numerous attempts made to return for refund with no reply.  Now I am out over $100.00!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Forbrs",
          "Nb_Reviews": 2,
          "Date": "2020-10-01T01:10:25.000Z",
          "Titre": "Bought a charging port for them sept 14…",
          "Contenu": "Bought a charging port for them sept 14 it is now sept 30 still no charging port. Company said it's not there fault. They dont control the mail if its lost its lost. They will not resend anything bc of covid-19 the mail is messed up. And it wasn't free shipping I paid to have it shipped. I will never buy anything from them againScanned today for the 3rd time being sent back to Atlanta. And that's not there problem  they said. A week ago I told them i was lost in Atlanta and they said i would have it in a few days here it is week and 2 day later still in Atlanta"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jameke Toussaint",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T19:28:49.000Z",
          "Titre": "Failed to inform that their Mouse and…",
          "Contenu": "Failed to inform that their Mouse and Keyboard adapter isnt compatible with PS5. wasted my money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 1,
          "Date": "2019-01-31T17:58:48.000Z",
          "Titre": "Worst Product on Market - MUST READ",
          "Contenu": "I purchased this product for my son to use on his Xbox. It worked for a few days. When pulling the products out of the Xbox's USB the product fell completely apart.  The manufacturing was horrible.  Believe it or not, this is the great part of the story. I attempted to reach out to the manufacturer and recent less than no help.  The actually confirmed they seen this many times but deem this as \"damaged\" not a \"defect\".  Direct quote from customer service \"We are not obligated to replace a damaged product, and we are not obligated to accept a return of your product if it was damaged by you.\" So, a polite go screw. Actual email thread from customer support:Hello, As I have stated, the product comes with a 1 year warranty. If you believe this is a defect, XIM Technologies can examine the product and determine if they agree. However, we have seen this issue happen a number of times. If the product is removed at an angle from the console, it can cause excess friction on the USB port and cause separation from the device. As this was damaged during use, we can not replace the product. Your credit card company may provide a 'damage warranty' (some CC companies do) and it may be worth investigating with them to see if that is the case. We are not obligated to replace a damaged product, and we are not obligated to accept a return of your product if it was damaged by you. We are sorry that your product got damaged. XIM Technologies does offer a repair service, and may be willing to do so a price that is far lower than the cost of a new item. Sincerely, Flashback Limited"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "marcio Honda",
          "Nb_Reviews": 1,
          "Date": "2018-06-04T17:33:07.000Z",
          "Titre": "On the USPS website says that the order…",
          "Contenu": "On the USPS website says that the order was delivered, the hotel reception says nothing was delivered. I'm waiting for some clarification."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Roberto",
          "Nb_Reviews": 6,
          "Date": "2018-08-21T08:30:38.000Z",
          "Titre": "If you buy outside of USA",
          "Contenu": "If you buy outside of USA, you are going to pay taxes. It's better to buy in a chinesse shop, they put the package as gift."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Fulcher",
          "Nb_Reviews": 2,
          "Date": "2019-06-04T19:53:09.000Z",
          "Titre": "It was poorly designed doesn’t fit…",
          "Contenu": "It was poorly designed doesn’t fit right and ended up having to buy a new controller"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Violet",
          "Nb_Reviews": 1,
          "Date": "2019-07-19T15:41:04.000Z",
          "Titre": "Why can’t I cancel my order?",
          "Contenu": "I need to cancel my order and I’ve sent two emails and NOBODY has responded. Nor have I got my refund. I haven’t even received the item yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Scott",
          "Nb_Reviews": 1,
          "Date": "2020-12-31T02:11:26.000Z",
          "Titre": "Not a good experience",
          "Contenu": "Not a good experience, they don’t honor express shipping but they will definitely take your $!"
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Dmitry Bondarenko",
          "Nb_Reviews": 1,
          "Date": "2019-01-25T15:59:13.000Z",
          "Titre": "No device in package. Customer service don’t want solve it.",
          "Contenu": "Very bad store. Fully unsatisfied. That’s my post on Reddit. Good day friends! I have a question and a warning. I would like to know if somebody came across such a situation and what to do. I bought xim apex on flashbackltd.com. I'm from Russia. ahead of the questions I will explain that we sell it at 30% more expensive, even taking into account the delivery. I made a choice in favor of this store. The delivery is very fast, but it is more the merit of postal services. I ordered this device for shooting a review in one of the Russian-speaking gaming communities. but before the detailed review there had to be a video about unpacking and the first impression, as well as a comparison with hori tac pro. This was done in order to publish this review in the xim user group and attach a referral link for further receiving small bonuses. I attach the link to the failed video. why did it fail? because there was no device inside. only hub however, he was in 2 packs (!). Perhaps this is done to correct the weight of the parcel. I will say in advance that at the customs in Russia and at the postal service they assured me that the parcel had not been opened, otherwise 2 acts would have been drawn up. I also checked the integrity of the outer packaging at the post office. I dropped the video to the support service, but a few days later they said that it was not their problem and they were fine. they refused to solve the problem in any way. They didn’t answer the question of shipping insurance. Actually the topic: 1. Is there an opportunity to complain to this site and return the money? what to do and where to write? 2. Never buy there. below the video. most likely you will not understand anything, but this is not necessary. without words everything is clear.You can look at video, search on YouTube xim apex Flashbackltd"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2020-01-26T15:37:41.000Z",
          "Titre": "Ordered the xim apex on Tuesday with 3…",
          "Contenu": "Ordered the xim apex on Tuesday with 3 day early shipping and still haven't recieved my item emailed them twice for help regarding my package and no response if you trying to buy the xim apex just buy it from Amazon instead I have no idea why I can't get any help regarding my package can't even get a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tre Henriques",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T09:57:02.000Z",
          "Titre": "Didnt get a tracking number",
          "Contenu": "Didnt get a tracking number paid 48 dollars for overnight shipping"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Genocide Jones",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T18:50:02.000Z",
          "Titre": "My Product does not work... even with professional help it would not pair to my PS4 controller and I do have the correct PS4 dualshock controller...",
          "Contenu": "I bought a Cronus Zen back button for my PS4 controller because I already have the Cronus Zen device I thought this would be a plus which it still might be if I had a product that was functional and working! I have gone on every Cronus Zen website for better instructor even a FaceTime call with a collective Minds agent and we could not get the back button attachment to pair up with my Cronus Zen device. Now the Cronus is very fun to use I do use a scuf controller with it wanted to use a regular PS4 controller with these action buttons on the bottom where I am used to the paddles of a Scuf Controller but anyways I bought this in haste due to Black Friday sales I actually after I bought it found it $15 cheaper brand new on GameStop's website all in all I guess I'm saying you don't know what you get from this company apparently I believe they are all refurbished items or overstocked items but all in all my device does not work..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shane Raney",
          "Nb_Reviews": 1,
          "Date": "2020-04-06T20:50:26.000Z",
          "Titre": "did not work.",
          "Contenu": "power supply received power, and failed to transmit power"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deja Shelton",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T01:00:02.000Z",
          "Titre": "You delivered to the wrong address"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Raborn",
          "Nb_Reviews": 1,
          "Date": "2021-05-08T01:58:47.000Z",
          "Titre": "They lied about 2 day mail don't get it…",
          "Contenu": "They lied about 2 day mail don't get it it'll take a week anyway"
        },
        {
          "Note": 1,
          "Lieu": "TW",
          "Pseudo": "晉賢 蘇",
          "Nb_Reviews": 1,
          "Date": "2021-07-15T06:13:21.000Z",
          "Titre": "So slow",
          "Contenu": "Because Your delivery is to slow"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Brown",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T01:31:23.000Z",
          "Titre": "Device I purchased doesn’t work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T21:48:56.000Z",
          "Titre": "Converter did not work for g27 to ps4"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cody Kaufman",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T04:00:35.000Z",
          "Titre": "I have not received my Xim Apex and…",
          "Contenu": "I have not received my Xim Apex and it's been over a month..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shawn Brothers",
          "Nb_Reviews": 2,
          "Date": "2018-05-04T20:50:04.000Z",
          "Titre": "Smashed parts",
          "Contenu": "I bought a HDMI replacement port for the 1100 series pS4. I received the HDMI smashed in unusable condition. Not a good 1st experience. Feeling hesitant towards future  Purchases"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mad gamer",
          "Nb_Reviews": 1,
          "Date": "2018-05-07T18:34:15.000Z",
          "Titre": "Shipping",
          "Contenu": "I had put two day shipping. It shipped from Michigan and I live in California and my package went to Hawaii. It’s been over a week and I still done have my xim apex."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Julia Jakabova",
          "Nb_Reviews": 1,
          "Date": "2020-02-11T00:49:10.000Z",
          "Titre": "I haven't received my item yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michaela B",
          "Nb_Reviews": 1,
          "Date": "2018-03-10T17:01:52.000Z",
          "Titre": "It didn’t work for my PS4 headset",
          "Contenu": "It didn’t work for my PS4 headset. I’m not sure if it’s just not pairing right or what but I don’t know what to do."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Timo Piet",
          "Nb_Reviews": 1,
          "Date": "2021-08-08T13:26:59.000Z",
          "Titre": "Bought it 20 days ago and it still not…",
          "Contenu": "Bought it 20 days ago and it still not shipped"
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "SauD Alharbi",
          "Nb_Reviews": 1,
          "Date": "2018-07-11T15:40:57.000Z",
          "Titre": "Where is my stuf",
          "Contenu": "Where is my stuf ? Now 17 days"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Isahan Bery",
          "Nb_Reviews": 1,
          "Date": "2020-11-17T22:51:55.000Z",
          "Titre": "Shut doesn’t work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Salvador N Argumedo",
          "Nb_Reviews": 1,
          "Date": "2020-03-23T21:55:19.000Z",
          "Titre": "Ps4 controller cases (2) were defective",
          "Contenu": "Ps4 controller case was defective. Second one was also trash. I would not buy any replacement cases from here ever again. Wasted money. Plus shipping is way over priced."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bryan Ortiz",
          "Nb_Reviews": 1,
          "Date": "2019-03-01T18:37:59.000Z",
          "Titre": "Terrible Experince",
          "Contenu": "I had a terrible experience ordering an internal cooling fan. When I received the fan, one of the wires was cut so it could not function. I emailed them letting them know It was very important to me to receive this fan before the weekend. Unfortunately they did not offer Saturday delivery. When I emailed to the Customer service representative, I was under the impression that they would ship a replacement part, even though I wouldn’t recieve it when I needed it, i still accepted that offer. A few days later I received  an email saying my money had been refunded. All in all, I received my fan about 3 weeks after I actually needed it. As someone who works in the e-commerce business, I was very disappointed with my experience here."
        },
        {
          "Note": 2,
          "Lieu": "HU",
          "Pseudo": "pmarci1117",
          "Nb_Reviews": 2,
          "Date": "2019-07-12T20:19:53.000Z",
          "Titre": "I didn't get the item"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2022-03-29T21:42:58.000Z",
          "Titre": "Good shipping time, customer support. Needs better instructions.",
          "Contenu": "The product arrived in a good time frame. The instructions online are not clear, I've had trouble getting it working. Customer support did answer my emails in a timely manner. They seem to be genuinely trying, which I appreciate. I would recommend a user's manual be included with the product, and videos be more detailed in explanation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jake Peterson",
          "Nb_Reviews": 1,
          "Date": "2019-07-12T21:08:52.000Z",
          "Titre": "Decent... but needs improvement",
          "Contenu": "I took off one star because of the price, which doesn’t need to be over $100 for a usb hub and the XIM apex itself, it costs them $5-10 to make the equipment. I’m taking off another star because if you try to move completely horizontally to the right, the cursor will also move down as you move to the right. The opposite is done when you move to the left, the cursor moves up along with it. One more complaint I have is in the game Rainbow Six Siege. If you are sprinting forward and press Q or W, you will stop sprinting and walk forward in that direction. You are usually able to continue sprinting in a diagonal direction when doing this on both pc and Xbox."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "EMANTHEHITMAN",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T20:43:27.000Z",
          "Titre": "Cover the button letter prints, they come off 2easy",
          "Contenu": "bought the psp2000 button pack & the pieces were made to fit perfectly but the printed letters on the buttons scratch off too easy, unlike the OEM buttons which the letters are covered with a piece of clear plastic."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zion..",
          "Nb_Reviews": 2,
          "Date": "2020-01-09T05:01:12.000Z",
          "Titre": "Ordered the item on a Monday with one…",
          "Contenu": "Ordered the item on a Monday with one day flat rate and got the xim apex delivered to me on Thursday. I paid 20 extra dollars to get it in one day and it came in 3. I could’ve saved some money but other than that I have had an great experience with the item. I definitely recommend buying it for console gamers."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "ethan booth",
          "Nb_Reviews": 1,
          "Date": "2020-01-06T05:05:57.000Z",
          "Titre": "i have been waiting a bit i ordered my…",
          "Contenu": "i have been waiting a bit i ordered my xim on xmas day and its now the 6th of jan so im hoping it comes soon otherwise i want a refund"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2018-08-23T18:48:16.000Z",
          "Titre": "Quick and good customer service",
          "Contenu": "Quick and good customer service, The product works great but if you live outside from the usa you have to pay taxes. And i had to pay 40€ !! I Highly recommend to buy from europe or china."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Estes",
          "Nb_Reviews": 1,
          "Date": "2018-07-02T17:47:05.000Z",
          "Titre": "Product was not exactly as described",
          "Contenu": "Product was not exactly as described.  Return process was adequate but, we lost $$ in the process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joshua Brown",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T13:29:48.000Z",
          "Titre": "Most buttons fit perfectly",
          "Contenu": "Most buttons fit perfectly, one however did not."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Vivian Wang",
          "Nb_Reviews": 1,
          "Date": "2017-10-24T23:58:35.000Z",
          "Titre": "Ask for 3 days express delivery but it …",
          "Contenu": "Ask for 3 days express delivery but it ends up 8 days. Don't  know whose problem but at least you guys are willing to solve the problem,thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wren Sinclair",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T20:13:03.000Z",
          "Titre": "I could see how this product would be…",
          "Contenu": "I could see how this product would be good or useful, however it is not compatible with my AG9 afterglow headphones. I will be returning."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel Ortega",
          "Nb_Reviews": 1,
          "Date": "2017-10-07T22:35:33.000Z",
          "Titre": "I got 2 day shipping",
          "Contenu": "I got 2 day shipping, but I got the item 5 days later."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jose",
          "Nb_Reviews": 2,
          "Date": "2023-03-22T18:14:20.000Z",
          "Titre": "Great experience",
          "Contenu": "The shipping packaging could have been better, but otherwise, I received what I ordered at a good price."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alan",
          "Nb_Reviews": 5,
          "Date": "2022-11-03T00:16:00.000Z",
          "Titre": "Bought a Honda 200 paid for it in early…",
          "Contenu": "Bought a Honda 200 paid for it in early July.arrived today 2nd November! Almost giving up on seeing the bike arriving minus its side stand. Attempting to communicate but this have proved difficult throughout."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2018-07-29T17:14:48.000Z",
          "Titre": "Ordered the Xbox one controller unlock…",
          "Contenu": "***UPDATE Flashback contacted me and refunded me my money right away without me asking for either. They explained that this items sells often and they have not had any problems, so I must have gotten a bad one. I appreciated them taking the time to making it right even though I didn't  ask for it.Ordered the Xbox one controller unlock tools set, took forever to get to my house and once it did the special tool to remove screws is too small and doesn't work. Do not order this product from here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chase C",
          "Nb_Reviews": 6,
          "Date": "2018-06-05T13:25:52.000Z",
          "Titre": "Honest",
          "Contenu": "I ordered [Xbox One Green Aluminum Alloy Metal Analog Thumbsticks] & [XBox One Case and Controller Unlock Tool Kit]. I received them when i was told and they came in a small package. The green analog thumbsticks came as seen on the website but there was a little bit of white in the cracks of them. I had to whip them off but it didnt harm them what so ever. Uhm, so id give them a 9/10. First time using them, may use them again. (:"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clayton Gardner",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T22:50:36.000Z",
          "Titre": "Prompt shipping and quality products...",
          "Contenu": "Prompt shipping and quality products at good prices but 4 stars due to not having photos of merchandise available on site"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyler Campbell",
          "Nb_Reviews": 1,
          "Date": "2019-07-17T23:38:10.000Z",
          "Titre": "The experience was a lot better than I…",
          "Contenu": "The experience was a lot better than I expected. The only thing was my order arrived late but other than that everything went smoothly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Riley Bioren",
          "Nb_Reviews": 1,
          "Date": "2020-04-02T16:27:30.000Z",
          "Titre": "Good",
          "Contenu": "Quick shipping, the dongle and my headset takes a few tries to connect but eventually they do"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Aaron",
          "Nb_Reviews": 2,
          "Date": "2020-08-21T08:14:47.000Z",
          "Titre": "overall good service",
          "Contenu": "overall good service, got my product after a week and a half, didn't have any problem.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2020-01-06T22:07:49.000Z",
          "Titre": "They had the items I wanted for the…",
          "Contenu": "They had the items I wanted for the price I was willing to pay.Shipping was a little slow, but I live in Alaska, so it is expected.Completely happy, and if needed, I will order from them again.Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "garrett schabow",
          "Nb_Reviews": 1,
          "Date": "2020-03-09T23:38:54.000Z",
          "Titre": "Received a defective part but great…",
          "Contenu": "Received a defective part but great customer service corrected it promptly. Defect was due to manufacturer, not flashback limited."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carter",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T13:18:53.000Z",
          "Titre": "Xim Apex",
          "Contenu": "Had the xim apex for a mouth now and have injoyed using on R6"
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "sim juyoung",
          "Nb_Reviews": 3,
          "Date": "2021-07-15T09:28:52.000Z",
          "Titre": "You can buy with confidence."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Ahmad Aizuddin",
          "Nb_Reviews": 1,
          "Date": "2017-10-12T06:29:51.000Z",
          "Titre": "I've received the parcel in a good …",
          "Contenu": "I've received the parcel in a good condition but i hope in the future the items are well wrap by using bubble wrap or put in a box to avoid any damage to the items. Thank you guys"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cody Fisher",
          "Nb_Reviews": 1,
          "Date": "2019-05-03T15:56:56.000Z",
          "Titre": "1 day late",
          "Contenu": "1 day late. Amazing product. Does what it says. Love it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jorge Martinez",
          "Nb_Reviews": 1,
          "Date": "2017-12-11T16:06:56.000Z",
          "Titre": "The Web page easy to navigate and to …",
          "Contenu": "The Web page easy to navigate and to place my order.  Keep me inform about the status of my order. My item arrive on-time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Joseph lloyd",
          "Nb_Reviews": 1,
          "Date": "2021-03-06T20:08:48.000Z",
          "Titre": "Great prices",
          "Contenu": "Good items cheap."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Carroll",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T20:00:37.000Z",
          "Titre": "Ships Quick, Even on Holiday Weekends",
          "Contenu": "Quick turnaround!I ordered something on Black Friday and it arrived the following Monday!"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Magnus Rekdal",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T17:38:20.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery, user friendly website, original qualityproduct"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T21:02:49.000Z",
          "Titre": "Fantastic experience",
          "Contenu": "Easy website to navigate fast shipping. Great product selection!  Item came and functional order and works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel K",
          "Nb_Reviews": 1,
          "Date": "2019-06-10T17:31:25.000Z",
          "Titre": "No problems, would recommend",
          "Contenu": "Item came in expected condition, no dents or damage to boxing.Delivery was a day late but that's honestly expected where I live, so no star reduction for that.Product itself works perfectly, so I'd say 5 stars! Never heard of the company before so I was honestly skeptical of them, but it seems my fears were unfounded as everything turned out alright."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny cole",
          "Nb_Reviews": 2,
          "Date": "2022-02-22T14:59:55.000Z",
          "Titre": "PS4 controller shell",
          "Contenu": "Months ago I accidently messed up my PS4 controller shell. Looked around for a bit and found Flashback limited. The shell came quickly and nicely packaged. I do think shipping was a bit expensive at $6.30 for something so light and small, but it still was still cheaper than other places overall.The shell needed some posts removed and a slot filed into it for fitment, but that was disclosed and I am handy with things so it was no problem. It feels wonderful and well worth the money."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Engin Günel",
          "Nb_Reviews": 1,
          "Date": "2018-09-14T05:41:50.000Z",
          "Titre": "Xim Apex",
          "Contenu": "I ordered the product from Turkey, came to my door every 14 days, Thanks Flashback Limited. No need to tell Xim Apex, if you want to play FPS games on the console, the only device that gives the closest sensitivity to the Pc is even better than the PC when fine tuned. I am writing this with the help of Google Translate, I hope it is understandable. Get Xim Apex without thinking best ;)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Freeman",
          "Nb_Reviews": 5,
          "Date": "2021-10-06T22:48:30.000Z",
          "Titre": "Fast, Reliable and affordable services!",
          "Contenu": "I was looking for a smaller online store for replacement parts for an old entertainment system and was able to find everything I needed here! Prices were better than on Amazon or Walmart, and shipped quickly. I would do business with this company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Gandaria",
          "Nb_Reviews": 2,
          "Date": "2020-02-04T16:14:28.000Z",
          "Titre": "Ordering",
          "Contenu": "Ordering, shipping and delivery was great and fast! I have yet to use the product, but everything appears in order and boards are brand new, so they should be working fine. I would definitely not hesitate to order from flashback limited again! Will be purchasing other products in the future. I would recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Ota",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T10:13:29.000Z",
          "Titre": "Exceeds Expectations",
          "Contenu": "Have only used this brand so can’t compare to others, however the XIM Apex performs flawlessly.  Easy to manage/adjust preset game templates.  No lag in gameplay whatsoever. It’s a no-brainer."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "IJ",
          "Nb_Reviews": 2,
          "Date": "2018-10-22T16:24:42.000Z",
          "Titre": "Enjoyed a wonderful experience from order to delivery",
          "Contenu": "Bought my XIM Apex from Flashback Limited at the lowest price you will ever find both online and offline. They went extra miles to make provisions for my order due to my location and they responded to all my inquiries with lightning speed. Even more, they shared tips and advise (which I will always use going forward) with me from their wealth of experience. As if that wasn't enough, they got my product to me on the other side of the globe in record time. Flashback Limited is more than just a company selling products. I am very grateful. I would definitely use them again and also refer them to friends and family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corentin",
          "Nb_Reviews": 1,
          "Date": "2018-06-23T04:52:07.000Z",
          "Titre": "Couldn't do better!",
          "Contenu": "I contacted Flashback Limited a couple of times because I had questions about the availability of a praised product. Every time I got an answer super quickly and the person was very nice!I ordered the product, received it quickly and in perfect condition. I'm super happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad B.",
          "Nb_Reviews": 1,
          "Date": "2019-11-11T18:58:03.000Z",
          "Titre": "The customer service was fantastic!",
          "Contenu": "The customer service was fantastic. We actually did not receive the cord we ordered, but when we contacted the company they were very apologetic. They sent out the correct cord right away and admitted their mistake. No extra charge of course."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DANIEL",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T22:07:14.000Z",
          "Titre": "Products were as described and arrived…",
          "Contenu": "Products were as described and arrived in great condition. Shipping was surprisingly fast! I'm very satisfied and have no complaints. Would be happy to buy from with Flashback Limited again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esteven Cocks",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T13:39:42.000Z",
          "Titre": "Great experience I never heard of the…",
          "Contenu": "Great experience I never heard of the company untill last week! I order a xim mattix for retail thanks flashback much appreciated I’ll definitely be shopping here again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cailin Depetris",
          "Nb_Reviews": 1,
          "Date": "2019-01-10T22:48:00.000Z",
          "Titre": "Perfect experience!",
          "Contenu": "I had a relatively perfect experience with Flashback, the product arrived right on time (may have actually been a little earlier), everything was correct, product was right and seems to be functioning great so far. I give you 5 stars and plan to use Flashback in the future, thanks so much again!!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Julián",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T19:18:42.000Z",
          "Titre": "All really good",
          "Contenu": "All really good ! Fast delivery , product arrived very soon in a great condition very well packed , no doubt I will buy again on this site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gian B",
          "Nb_Reviews": 1,
          "Date": "2018-05-29T20:47:22.000Z",
          "Titre": "Response time was very good",
          "Contenu": "I had issues with the shipping because I lived in a student residential area. But this company not only had crazy fast response rate, they also managed to help me out very well.10/10 I would recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JG",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T05:40:43.000Z",
          "Titre": "Great experience",
          "Contenu": "All of my customer experiences were great. Everyone I spoke to were very kind and polite. Today's day and age, it is so hard to find a company with great support staff.  I bought a 2pk of controllers and they did their best to troubleshoot the issue and tried very hard.  They quickly sent me a replacement product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Saint Morsel",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T23:12:14.000Z",
          "Titre": "Came as described",
          "Contenu": "Came as described, and works flawlessly, ofcourse i ordered a part so dont order if you dont do at home refurbishment for your own devices but if you do, this is the site to go."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chance Enyeart",
          "Nb_Reviews": 1,
          "Date": "2019-09-10T14:06:36.000Z",
          "Titre": "Xim apex review",
          "Contenu": "I love the item honestly I thought at first it might be a scam but it came about 4 days later also the xim apex on this website is cheaper than any where else it’s a really great product and I think you should really consider getting it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerardo Juarez Contreras",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T04:40:59.000Z",
          "Titre": "High quality product at a low cost",
          "Contenu": "High quality product at a low cost. I just suggest having some neon glowing in the dark buttons and r l buttons for psp"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caulin Hadley",
          "Nb_Reviews": 1,
          "Date": "2018-09-05T18:19:23.000Z",
          "Titre": "Awesome",
          "Contenu": "I only bought from them one it was a XIM APEX and my buddy recommended that I buy on from here as it's the cheapest option. It was great both of ours come early and nothing is wrong with my product I'm still using it today"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Thoma",
          "Nb_Reviews": 3,
          "Date": "2019-09-18T14:45:30.000Z",
          "Titre": "Quick shipment and a responsible company",
          "Contenu": "Quick shipment and even offered a refund of the parts since they did not help the problem with my Xbox One X.  Flashback Unlimited is highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Stabler",
          "Nb_Reviews": 4,
          "Date": "2021-08-11T23:16:39.000Z",
          "Titre": "The part functioned as it was supposed…",
          "Contenu": "The part functioned as it was supposed to.  Post office screwed up delivery. Not the fault if Flashback. Ordered second part and used UPS. It arrived before the first one. I returned it and received a refund in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russ",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T20:39:30.000Z",
          "Titre": "Timely shipping at great prices!",
          "Contenu": "Timely shipping at great prices!Usually you never know with these kind of sites, but I didnt have to worry about waiting for a shipment from china."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric V",
          "Nb_Reviews": 1,
          "Date": "2020-12-11T16:51:14.000Z",
          "Titre": "Small issue, great replacement",
          "Contenu": "Ordered a replacement fan for the Xbox One X. It was clearly used and was not removed from the original with care. There was a broken plastic corner meant to retain it in place. That being said, it works like new, and was cleaned thoroughly. I am happy with the price and the delivery was fast. I would buy from Flashback Limited again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Zinczuk",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T00:18:22.000Z",
          "Titre": "Order arrived in the mail as advertised…",
          "Contenu": "Order arrived in the mail as advertised and shipping was extremely quick. Great service! Will definitely use again when needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob C.",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T23:16:57.000Z",
          "Titre": "Great Order",
          "Contenu": "Shipping was very quick. As soon as my payment was completed the order was out the door. Item worked as intended. Great packaging."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alyssa Wilson",
          "Nb_Reviews": 1,
          "Date": "2018-06-30T19:31:03.000Z",
          "Titre": "Company is great",
          "Contenu": "Company is great. I had to modify my order after I had purchased my items. Wanted to keep one and not buy the other since I had found it. Still bought a PS4 keyboard and my boyfriend loves it. They have good customer service thank you Nicholas Heinig."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Almo7eb Roushdi",
          "Nb_Reviews": 1,
          "Date": "2018-06-07T17:17:42.000Z",
          "Titre": "I ordered from them xim apex over 5…",
          "Contenu": "I ordered from them xim apex over 5 orders and they never despoilment me with delivery or any problems perfect services .."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TAVARIS PRAYER",
          "Nb_Reviews": 1,
          "Date": "2018-10-02T23:40:15.000Z",
          "Titre": "Great company got my part on time both…",
          "Contenu": "Great company got my part on time both times I order from them. Only company that offered faster shipping everyone said it would take at a week and a half and I needed it in 2 days, Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Day",
          "Nb_Reviews": 1,
          "Date": "2018-09-05T11:54:26.000Z",
          "Titre": "OEM part came in a minimalist package",
          "Contenu": "OEM part came in a minimalist packageGood instructions were found on the order page.Works just as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Hutchins",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T23:56:55.000Z",
          "Titre": "Absolutely amazing",
          "Contenu": "Absolutely amazing, very fast delivery and even put the tools I would need if I wouldn't have happened to have them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Williams",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T22:30:11.000Z",
          "Titre": "Great, fast and correct",
          "Contenu": "This was a great price, in fact cheapest in my search, (except for direct from China) fast shipping  and arrived just fine. Will do business again, only next time I will just drive the 45 minutes  and save shipping. I didn't realize that it was in my own state. Great job! Thank you guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Cortes",
          "Nb_Reviews": 1,
          "Date": "2018-09-01T16:04:33.000Z",
          "Titre": "Bought it he apex on Friday so 2 day…",
          "Contenu": "Bought it he apex on Friday so 2 day shipping wasn’t really 2 day thanks to mail schedule but they did everything right on their part. Would order from them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isaac DeAbreu",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T22:30:07.000Z",
          "Titre": "Great store",
          "Contenu": "Was very helpful and thorough with my order. Would definitely trust them to purchase replacement parts again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PlunkRock",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T18:48:45.000Z",
          "Titre": "Great prices",
          "Contenu": "Great prices, product shipped really quickly. They responded to a question I asked (before I decided to buy) and I will be coming back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Vanoy-warner",
          "Nb_Reviews": 2,
          "Date": "2019-05-13T18:31:57.000Z",
          "Titre": "I received my item right on time and it…",
          "Contenu": "I received my item right on time and it was exactly what I was expecting. Definitely would order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Ebert",
          "Nb_Reviews": 1,
          "Date": "2020-11-21T21:40:33.000Z",
          "Titre": "Received order in a timely manner",
          "Contenu": "Received order in a timely manner. Good product. No issues at all. Would recommend to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andreas Enke",
          "Nb_Reviews": 3,
          "Date": "2021-12-17T10:46:33.000Z",
          "Titre": "Looks like fangs or horns.",
          "Contenu": "Wonderful ideas for my carfts that i will be working on and thank you for these ingenious items."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zydos",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T20:44:07.000Z",
          "Titre": "Gamecube & Wii HDMI adapters",
          "Contenu": "Both of the products I received were exactly as described and work perfectly fine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Rogers",
          "Nb_Reviews": 1,
          "Date": "2020-03-02T17:12:48.000Z",
          "Titre": "Got my $$$ worth",
          "Contenu": "Cables worked phenomenally well for what I wanted. I will definitely purchase from you again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T18:28:10.000Z",
          "Titre": "Flashback Remote review",
          "Contenu": "The device works great, my other remote malfunctioned and this one works wonders."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B.",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T20:34:46.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy! Delivered exactly as expected and free shipping as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesus Hernandez-Levien",
          "Nb_Reviews": 1,
          "Date": "2020-02-08T18:46:10.000Z",
          "Titre": "Exactly what I wanted",
          "Contenu": "Exactly what I wanted, how I wanted and delivered so fast with the most utmost service I've had in a while. No other words than 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2020-03-06T22:22:46.000Z",
          "Titre": "Great experience",
          "Contenu": "The item I ordered came quickly and In perfect condition. I will definitely buy again from flashback."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shane Bronson",
          "Nb_Reviews": 1,
          "Date": "2019-06-06T18:06:36.000Z",
          "Titre": "Got my part in just a couple days ..",
          "Contenu": "Got my part in just a couple days ... exactly what I ordered but now I need to get the red and green adapter cord that plugs into the part I ordered so I can use my head set"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Mermilliod",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T13:35:33.000Z",
          "Titre": "Your equipment worked perfectly",
          "Contenu": "Your equipment worked perfectly.  However thr system I bought elsewhere did not."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ZoelVII",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T03:27:12.000Z",
          "Titre": "Shipped very fast",
          "Contenu": "Shipped very fast! Works perfectly! Will order again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Ashenbrener",
          "Nb_Reviews": 3,
          "Date": "2023-01-02T20:35:29.000Z",
          "Titre": "It’s comforting",
          "Contenu": "It’s comforting, knowing that you can connect any controller to an Xbox by using the brook super converter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shaina Schaefer",
          "Nb_Reviews": 1,
          "Date": "2019-12-16T22:52:37.000Z",
          "Titre": "Quick shipping and product is as…",
          "Contenu": "Quick shipping and product is as expected! My husband will be happy with this purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2018-12-11T01:45:05.000Z",
          "Titre": "This is the second order from Flashback…",
          "Contenu": "This is the second order from Flashback Limited, and both times the order shipped next day."
        },
        {
          "Note": 5,
          "Lieu": "JO",
          "Pseudo": "Ameer L. Omar",
          "Nb_Reviews": 1,
          "Date": "2018-10-20T13:34:25.000Z",
          "Titre": "I Bought an xim apex through flashback",
          "Contenu": "I Bought an xim apex through flashback. Cheapest one on the internet and came in 3 days. Would definitely use them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip J. Stafford",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T19:07:42.000Z",
          "Titre": "Great product and great response from…",
          "Contenu": "Great product and great response from customer service when I had an issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabe",
          "Nb_Reviews": 1,
          "Date": "2018-10-02T16:05:27.000Z",
          "Titre": "Bought a xim through flashback",
          "Contenu": "Bought a xim through flashback. Cheapest one on the internet and came in 2 days. Would definitely use them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Edgell",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T23:08:22.000Z",
          "Titre": "This shop is great",
          "Contenu": "This shop is great. Item was shipped very fast and works well. The overall cost was reasonable. I would definitely shop here again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Obrien",
          "Nb_Reviews": 2,
          "Date": "2019-02-05T18:23:56.000Z",
          "Titre": "Great product",
          "Contenu": "Great productGreat communication Got to my son a day earlier than expected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dominique Martinez",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T20:30:45.000Z",
          "Titre": "Fair price, Fast shipping!",
          "Contenu": "The product was priced fairly low and built with high quality, a great look and shipped lightning fast."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "cody braunschweig",
          "Nb_Reviews": 3,
          "Date": "2018-09-26T04:42:52.000Z",
          "Titre": "Great company",
          "Contenu": "Great company, I bought from them a couple times. They typically ship-out the same day and respond to emails fast. I will use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "melissa burnett",
          "Nb_Reviews": 1,
          "Date": "2018-12-04T13:19:16.000Z",
          "Titre": "easy online shopping and got it fast…",
          "Contenu": "easy online shopping and got it fast thank you Flashback Limited"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Seb",
          "Nb_Reviews": 1,
          "Date": "2019-03-02T17:07:37.000Z",
          "Titre": "I recommend to anyone",
          "Contenu": "Nice product. Very fast delivery. I will buy again. I would recommand this store to anyone ! Thank you ;)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oliver Manegdeg",
          "Nb_Reviews": 1,
          "Date": "2021-07-03T19:36:07.000Z",
          "Titre": "It was fast and no a scam and my…",
          "Contenu": "It was fast and no a scam and my package came earlier than expected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MW",
          "Nb_Reviews": 9,
          "Date": "2022-04-21T00:01:49.604Z",
          "Titre": "Just what I needed",
          "Contenu": "Just what I needed. Good fan and does not take up unnecessary space. Shipped fast in good packaging. Would buy again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Stanfill",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T06:08:46.000Z",
          "Titre": "Phenomenal service shipping extremely…",
          "Contenu": "Phenomenal service shipping extremely fast. I definitely will return in future and tell family and friends!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney McGee",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T20:10:34.000Z",
          "Titre": "It was just great",
          "Contenu": "It was just great! Fast shipping, no complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Schappert",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T17:10:38.000Z",
          "Titre": "Great seller",
          "Contenu": "Great seller, loved their service. My product got to me fast and well-protected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jared Kuykendall",
          "Nb_Reviews": 1,
          "Date": "2020-10-05T16:45:22.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. I returned my purchase and they gave me a full refund great things at lower prices"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mason",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T13:29:39.000Z",
          "Titre": "Just what I needed",
          "Contenu": "I found exactly the part I needed and it was shipped fast. Great experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toney Gabbard Jr",
          "Nb_Reviews": 1,
          "Date": "2019-10-14T17:55:34.000Z",
          "Titre": "Flawless transaction",
          "Contenu": "Flawless transaction. Would be happy to do business with the vendor again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Sullivan",
          "Nb_Reviews": 1,
          "Date": "2018-08-07T17:08:11.000Z",
          "Titre": "Great service",
          "Contenu": "Quick shipping, had a question and they were very responsive.  Good stuff!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff D., Va, USA",
          "Nb_Reviews": 3,
          "Date": "2018-10-02T19:25:43.000Z",
          "Titre": "Very pleased",
          "Contenu": "Very pleased. Fast shipping - Excellent price compared to competitors. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Ken Toyoda",
          "Nb_Reviews": 1,
          "Date": "2019-12-11T10:08:01.000Z",
          "Titre": "Great support",
          "Contenu": "Great support, fast ship, competitive price, and nice items!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Konrad Patrzalek",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T18:00:28.000Z",
          "Titre": "Man they shipped fast to me",
          "Contenu": "Man they shipped fast to me. Not only that it was way cheaper than Amazon. I was definitely impressed with the speed of this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hector Santos",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T02:21:52.000Z",
          "Titre": "My package arrived on time and the item…",
          "Contenu": "My package arrived on time and the item itself was in good shape"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rory Siercks",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T23:09:02.000Z",
          "Titre": "Fast shipping and the parts were…",
          "Contenu": "Fast shipping and the parts were exactly what I needed to fix my PSVITA."
        },
        {
          "Note": 5,
          "Lieu": "BH",
          "Pseudo": "Mr Jaffar Murad",
          "Nb_Reviews": 3,
          "Date": "2018-11-02T17:55:44.000Z",
          "Titre": "Xim apex",
          "Contenu": "Fast international shipping and the best price for the xim apex."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kieran Devane",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T07:58:46.000Z",
          "Titre": "No problems",
          "Contenu": "No problemsAll arrived on time as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Davis",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T19:51:11.000Z",
          "Titre": "Perfect Experience",
          "Contenu": "Part came in on time and fixed the problem. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2019-05-03T00:44:11.000Z",
          "Titre": "Perfection",
          "Contenu": "Product arrived on time and was exactly what I was expecting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2018-12-01T17:19:37.000Z",
          "Titre": "Easy purchase and fast delivery",
          "Contenu": "Easy purchase and fast delivery. Would highly recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Farrington",
          "Nb_Reviews": 1,
          "Date": "2018-09-05T23:45:40.000Z",
          "Titre": "I ordered with overnigt shipping",
          "Contenu": "I ordered with overnigt shipping, it showed uo the next day with no BS, product works great. No reason to not leave a 5 star"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David DeMont",
          "Nb_Reviews": 4,
          "Date": "2019-03-04T16:31:16.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, great product.. kept me informed every step of shipping route!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris M",
          "Nb_Reviews": 1,
          "Date": "2019-02-05T17:24:43.000Z",
          "Titre": "Works great!",
          "Contenu": "Speedy delivery, product works great and as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2020-03-06T17:28:42.000Z",
          "Titre": "All and All Pretty Good!",
          "Contenu": "Quick, Easy, I had no problems, Good Packaging, all and all pretty good. I have no problems what so ever."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Akins",
          "Nb_Reviews": 1,
          "Date": "2021-03-05T19:19:50.000Z",
          "Titre": "This company went far and beyond what…",
          "Contenu": "This company went far and beyond what they had to in order to help me. Way beyond. I was amazed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "zhiguang zhang",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T18:13:36.000Z",
          "Titre": "Thanks order was received as listed",
          "Contenu": "Thanks order was received as listed, communication throughout, even word of delays but order was received in satisfactory time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2021-06-07T16:26:17.000Z",
          "Titre": "Honest review",
          "Contenu": "Still trying to work it out how to work it but the community seems pretty good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Henderson",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T21:32:38.000Z",
          "Titre": "Just what was advertised",
          "Contenu": "Just what was advertised , working just fine"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Branden Goyette",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T16:13:28.000Z",
          "Titre": "Great shipping time",
          "Contenu": "Great shipping time, great controller quality. No complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Wilson",
          "Nb_Reviews": 1,
          "Date": "2020-03-09T22:03:06.000Z",
          "Titre": "This is the perfect N64 handle adapter…",
          "Contenu": "This is the perfect N64 handle adapter to USB!!! 10/10 awesome and just works!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Pickel",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T00:17:11.000Z",
          "Titre": "Xim Apex arrived on time and as…",
          "Contenu": "Xim Apex arrived on time and as advertised. Great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "aaron peloquin",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T17:23:18.000Z",
          "Titre": "Fast shipping and as advertised",
          "Contenu": "Fast shipping and as advertised. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Urias",
          "Nb_Reviews": 1,
          "Date": "2018-11-06T17:42:03.000Z",
          "Titre": "Highly recommend  this website.",
          "Contenu": "Highly recommend  this website.. hands down .."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SpartacusBaker",
          "Nb_Reviews": 3,
          "Date": "2023-02-16T00:49:29.000Z",
          "Titre": "Worth the leap",
          "Contenu": "Good price, got it sooner than my Amazon orders."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Williamson",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T20:28:37.000Z",
          "Titre": "It’s everything I hoped for and more…",
          "Contenu": "It’s everything I hoped for and more for a great price and even arrived a day early!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eugene Swagger Jr",
          "Nb_Reviews": 2,
          "Date": "2021-10-26T13:08:19.000Z",
          "Titre": "Recieved the product on the date…",
          "Contenu": "Recieved the product on the date estimated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruth",
          "Nb_Reviews": 2,
          "Date": "2019-07-05T20:06:30.000Z",
          "Titre": "Everything was as described",
          "Contenu": "Everything was as described. Arrived when it was suppose to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Bollin",
          "Nb_Reviews": 1,
          "Date": "2019-04-08T18:44:23.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery. Exactly what I ordered and really easy to set up"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T22:59:02.000Z",
          "Titre": "Quick and easy despite being from…",
          "Contenu": "Quick and easy despite being from another country."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Omer Boat",
          "Nb_Reviews": 1,
          "Date": "2018-07-09T08:04:33.000Z",
          "Titre": "100% legit and quick they should sell…",
          "Contenu": "100% legit and quick they should sell more stuff on the website"
        }
      ]
    }
  ]
}