{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "flexscreenretail.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terence H Renick",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:12:20.000Z",
          "Titre": "The whole measurement process could…",
          "Contenu": "The whole measurement process could have been different I purchased your tool and I didn’t need it I learned this from a tech from Window Nation who told me that the measurement was on the frame"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T17:49:11.000Z",
          "Titre": "We used the Flexscreen tool as per…",
          "Contenu": "We used the Flexscreen tool as per flexscreens instructions, messured 3 times to be exact. Three of the screens are an inch larger and will not even come close to fitting. 2 screens were 1/4inch to big and we got them in but because so tight the screen itself is slack. I should have just messured the screens I have to be sure but did it flexscreens way which says \"Do not measure your current screens. Thus I spent a large amount of money for screens that do not fit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Colin Yorke",
          "Nb_Reviews": 5,
          "Date": "2023-10-12T01:02:34.000Z",
          "Titre": "While no problem purchasing",
          "Contenu": "While no problem purchasing. Product received was not what we had hoped. Seems fragile. Incapable of preventing stink bugs from getting through. And just not up to par."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Koellner",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T17:45:26.000Z",
          "Titre": "Very disappointed in how they securely…",
          "Contenu": "Very disappointed in how they securely they fit the windows. I’m trying to get them to stay in using the stick on foam but I greatly regret the purchase. Also, 4 of the 12 screens were made too small (not to the dimensions I provided) and they are supposed to be remade."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger Maddy",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T21:03:48.000Z",
          "Titre": "Window measurements",
          "Contenu": "The window measurements seem straight forward but not all windows are square.  The top and bottom measurements are usually different.  An explanation on what to do in those instances would have helped greatly.  One screen we ordered was too small and the other was slightly too big.  We will not order another Flex Screen."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 3,
          "Date": "2023-06-07T19:24:55.000Z",
          "Titre": "Don't waste your money",
          "Contenu": "The return policy is a joke. For how expensive these screens are, customers are getting trapped into buying something they might not like and then are stuck with. Customer service is also a joke, I've never bought something where you have 0 time to adjust the order after hitting submit. I will never recommend this product to friends and family, especially for how expensive they are.To be fair they screens do seem to \"work\" though. But that's the highest praise I can give. My rigid frame screens from two years ago are actually better though because they seal around the window tighter. These FlexScreens have MASSIVE gaps around the window frame, letting bigger bugs like stink bugs just crawl around."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Faith",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T19:35:50.000Z",
          "Titre": "Size is incorrect on all screens",
          "Contenu": "Size is incorrect on all screens. Currently working with Support to get new screens. Submitted sizes are accurate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Colin Yorke",
          "Nb_Reviews": 5,
          "Date": "2023-10-13T17:42:13.000Z",
          "Titre": "The screen was not as good as our original screen",
          "Contenu": "The screen was not as good as a regularly framed screen. Our experience was sub par.  And of course, you can't return it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 5,
          "Date": "2022-08-07T23:25:00.000Z",
          "Titre": "I think Flexscreen is a good product in…",
          "Contenu": "I think Flexscreen is a good product in theory,but my experience was not what I expected.  Maybe the website was a little confusing.  On the page where it tells the customer to subtract 1/16 of an inch or 3/16ths, depending on pocket and then on the order page it subtracts 1/16 from the actual measurement, which I did,  Therefore, the screen frames are oversize and buckled which makes the screen itself look like a burlap bag and wavy.  I guess, I should have reduced the measured size by another 1/8 and it probably would be a lot better.  I will not recommend Flex screens to anyone.Mike Olson"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Cox",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T21:00:23.000Z",
          "Titre": "4 of the 6 screens were the wrong size",
          "Contenu": "4 of the 6 screens were the wrong size. They won't give a partial refund or give any compensation. They want me to do extra work and send them pictures of the screen measurements so they can send me new ones. I just want a refund since they got less that 50 percent right."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S G Brown",
          "Nb_Reviews": 1,
          "Date": "2020-01-31T21:29:20.000Z",
          "Titre": "Crazy cost.",
          "Contenu": "The product is fine.  The cost is expensive, especially after the owner expressed on TV what the cost to manufacture is.  I'll be glad screens to do my entire house when the cost per unit reflects multiple windows with the same sizes, single shipment boxes and multiple window orders."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tina Misenor",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T16:34:37.000Z",
          "Titre": "Pretty terrible",
          "Contenu": "Pretty terrible. Advertised to be a flat rate for the screens so I placed my order. Went in to enter my measurements and get my screens in production and the final submission page pops up with an alert that my order will incur a $200 shipping charge. THAT'S MORE THAN THE SCREENS COST! Terrible way to advertise and hook your customer. I cancelled the order, this was a bit of a gamble being they have you measure your own windows and I'm not willing to more than double my investment in something I'm unsure of."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Potential FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-08T01:35:40.000Z",
          "Titre": "No one ever responds back to inquiries",
          "Contenu": "I had made several inquiries in the past on behalf of my company who was looking for a solution to their screen issues for their window orders and no one has every had the courtesy to call or email back. I can understand something falling through the cracks once ... but several times? I eventually got the impression they were snubbing us and didn't want our business because we were Canadian or who knows. That's too bad as we sell about 10,000 windows a year with a percentage of them being operatable requiring a screen solution. Maybe our volume was too low for them to lift a phone to call back or click a button to reply by email."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emma Eichler",
          "Nb_Reviews": 2,
          "Date": "2022-11-07T20:18:26.000Z",
          "Titre": "The screens don't fit or stay in the…",
          "Contenu": "The screens don't fit or stay in the window!!!I even bought the flexscreen measuring device, followed all of the instructions, took the measurements multiple times.I did flexscreen because I did not want to pay for installation but now I need new screens and installation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "diane",
          "Nb_Reviews": 7,
          "Date": "2023-07-02T02:06:27.000Z",
          "Titre": "These are garbage",
          "Contenu": "These are garbage. These might keep out birds, but every type of bugs get through these screens. If our window guys measured correctly, these are useless! So disappointed and heartbroken."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathleen Engstrom",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T20:39:43.000Z",
          "Titre": "This review is for the company and its…BEWARE \"OVERSIZE\" shipping!",
          "Contenu": "This review is for the company and its policies - NOT for the actual screen itself.  I ordered an \"Oversize\" screen - smaller than standard high but wider than standard - well within their size limits.  After placing the order with $35 shipping, I was told the new shipping total would be $235!  The screen itself only costs $65!  That is almost 7 TIMES the cost of regular shipping! When contacted, the company said they have no control over shipping costs.  The product is called FLEX screen for goodness sake.  All they have to do is loosely roll or fold the screen and it would fit into standard packaging.  By not really offering oversize shipping, they do not really offer non standard sizes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gwenda Dumbauld",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T15:38:08.000Z",
          "Titre": "Too good to be true :(",
          "Contenu": "None of the 4 screens I purchased are fitting.  I took time to measure and remeasure all aspects the window multiple times; I used the measuring tool and online tool which was very easy, however none of the screens fit the windows. While squeezing the screen to get it in, the screen is now out of shape.  I have tried putting moulding but still not fitting.    I would not recommend this product.  Time and money wasted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick Dober",
          "Nb_Reviews": 2,
          "Date": "2020-01-28T19:49:20.000Z",
          "Titre": "Worst home accessory I've never…",
          "Contenu": "Worst home accessory I've never purchased. And your survey is far worse. II am not a customer,  you should confirm purchase before soliciting praise. Review could have been worse than 1-Star"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean Katt",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T17:58:49.000Z",
          "Titre": "I got the flex tool for measurements and followed their directions",
          "Contenu": "I got the flex tool for measurements. I triple checked my measurements and based on their description of windows screen slots I used the deductions they called for … so in depth I have two of the “same window” but measured them so exact I found one to be 1/8” different than the other. What a waste of my money and time. The screen itself doesn’t appear to blow me away on build quality however the one star is because NONE of my four screens fit even remotely well in the channels. And then they send these “retention bumpers” to make a tighter fit, now I have to use these on every screen that I paid ALOT of money for doesn’t feel like a solid or even snug fit my screens move around now and seems ultimately like it will not form a good enough seal to keep bugs out. My advice is to not listen to them on how to measure and then substract. Just measure your space. For the record I have your average big brand name vinyl windows nothing special or limiting and followed their directions and it’s a horrible fit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nutty Burd",
          "Nb_Reviews": 2,
          "Date": "2022-06-29T18:27:20.000Z",
          "Titre": "Customer Service after the sale",
          "Contenu": "I contacted FlexScreen after receiving our order concerning the fact that they did not fit properly after completing following their measuring instructions.  I have yet to hear back from them as to how to proceed.  Not very customer service friendly after the sale."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 2,
          "Date": "2020-01-28T21:53:47.000Z",
          "Titre": "Prices are way too high.",
          "Contenu": "Prices are way too high.Lifetime warranty makes me take pause when it says it only covers defects.  What exactly is a defect?  That is always up for debate and from my experience it will go the other way.  Will the company still be in business if the screen material disintegrates in 20 years?  There is no telling.  If it does, is that a defect, wear/tear, or environmental damage that is not covered under defect?  In addition, it says the screens have to be shipped back.  Shipping can be expensive for large objects.  Sorry, this product does not make sense at this price point and I'm not enticed by the limited warranty wording.  I don't feel a bug screen is an investment.  Good luck.  Seems to be a unique product with a price structure that may not be realistic."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2020-09-28T19:59:57.000Z",
          "Titre": "Absolutely terrible company",
          "Contenu": "Absolutely terrible company. Purchased \"FlexView\" which they claim is more see-through/less noticeable than standard window screens. I took the risk as this is the exact reason we wanted new screens.In short: They are the same as standard screens. The fact that they even think they deserve this marketing moniker truly astounds me. Go to WalMart and buy a standard screen for 75% less. You get the same product.Upon asking for a refund: Was given a nice, simple nope.Awful company. Spend your money elsewhere. A true, garbage joke."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CopySalmon",
          "Nb_Reviews": 1,
          "Date": "2020-10-29T13:24:24.000Z",
          "Titre": "Childishly Avoiding Admission of Fault",
          "Contenu": "As others have noted recently, I was excited to have good screens for my condo. Unfortunately, what I got were screens that were up to a quarter of an inch smaller than what I'd specified on their online form--I took screenshots of those measurements, the stickers on the edge of each screen show those measurements, but my Stanley tape measure shows that they're uselessly smaller. I've contacted customer service 3 times, and now that I've sent them the requested photos of the dimension stickers (not sure why--the sticker dimensions are correct, the screens are not), they're ghosting me. I've called direct phone lines and left messages, I've replied to the same email thread that we've been communicating on, and they just don't seem to wish to deal with the issue. Like children."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stuart Forbes-Robinson",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T23:00:31.000Z",
          "Titre": "I measured the opening as you asked",
          "Contenu": "I measured the opening as you asked. When I filled out the order you suggested that I go a little larger. Now I have a screen the does fit the opening it's just a little too big, it almost fits but doesn't. Not a great experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan Mark",
          "Nb_Reviews": 1,
          "Date": "2021-02-25T19:47:25.000Z",
          "Titre": "Don't fit, and measured correctly. NO FIX. NO REFUND.",
          "Contenu": "Total scam. No refunds or recourse. They don't stand behind their product at all. I spent about $650 on their screens and virtually none of them fit or stay in at all with my sill type, despite their repeated claims prior to purchase that this would work for me.In their videos they show people with their kids sitting on the screens implying they are somehow super durable, but just in the simple installation of my 10 or so screens, half of them easily tore on the edges of the aluminum frame.After giving me the run around on phone calls and over email for months, they basically said I would have to re-order $700 worth of screens if I wanted a fix. And then they just stopped replying to my emails altogether.Avoid these guys at all costs. Deceptive marketing, and zero help from customer service. Biggest waste of money I've ever spent on anything."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eddie Ramirez",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T22:21:06.000Z",
          "Titre": "Very disappointed with the fit and…",
          "Contenu": "Very disappointed with the fit and finish. I used the device provided to enter the window measurements on to the website tool. The screens still came with a very loose fit. It was difficult to get the screen to stay in & it's clear that bugs will still get through the edges. for the amount of money i paid, I do not recommend these to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie Quinn",
          "Nb_Reviews": 1,
          "Date": "2020-07-05T12:34:26.000Z",
          "Titre": "Screens are hazardous to small children and animals",
          "Contenu": "Had this screen installed in winter of 2019 with a new front window - I wasn't advised of this product being used. A few months later in spring when I opened the window, at some point my cat must have leaned on the screen and it and the cat fell out, missing for days. What if it was a toddler who leaned on it? The company came and installed an additional screen, but I still won't open my front window out of fear. Waste of money, they're garbage!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Denise Gleason",
          "Nb_Reviews": 1,
          "Date": "2020-03-05T03:22:34.000Z",
          "Titre": "Poor quality and design",
          "Contenu": "Took a while for owner to help with my measurements originally bought 9 but had them send only 1 and we were very disappointed when the screen came out if the frame when lifting out if the box2nd problem... Now way to hold on for install when on a 2nd story window...bad design I will wait for something better."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew Cowherd",
          "Nb_Reviews": 1,
          "Date": "2020-11-30T15:27:24.000Z",
          "Titre": "SCAM ALERT",
          "Contenu": "WARNING: This company appears to be a fraudulent operation. They took my money and never delivered anything. They won't give me a refund and their \"customer service\" is non-responsive. Do not fall for this scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-05T03:27:10.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Concept seems great. Price is high but there was an advertised warranty so we tried it. Screen is okay at best. Customer service is horrible and will not respond to multiple website messages and emails. Warranty is good because there is no way to register the screen. Would not buy again at this point."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T16:05:15.000Z",
          "Titre": "A COMPLETE WASTE of MONEY",
          "Contenu": "Spent over $700.00 on 6 screens and they were at least a 1/2 off I measured by there solutions and there is NO customer service at all , no “ sorry we will fix this or give us another chance “ they person I spoke with talked to me like I was a child that had to be scolded for something , they are a bul:$&t company , if a shark invested in this company . They were USED as bait . Scam company and according to the other reviews they aren’t worth your time and SAVE your money . They need to be on SCAM tank , just a con man coming onto that show to solicit a shark to promote a scam . I feel bad for 2 things...... the shark that invested in this company and for buying GARBAGE!! BUYERS BEWARE!!!!! SCAM"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert  Howard",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T01:23:55.000Z",
          "Titre": "I don't like your system for receiving measurements",
          "Contenu": "I don't like your system for receiving measurements.  I'm a remodeler and know how to use a tape and laser measure.  I'd rather just give you the dimensions I want.The screens I ended up with are about a 1/4 inch too tall."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly Thornley",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T01:36:37.000Z",
          "Titre": "Soooo Many bad reviews/ Flex Screen",
          "Contenu": "Soooo Many bad reviews, I’m out!!! Just saw you guys tonight on Shark Tank, was willing, then  I thought I should read the reviews....... shame on you!!!!   If ANYONE has a problem, according  to the reviews, ..........TOO BAD, suck it up........ AND, there was AT THE LEAST $700.00 involved in these purchases by regular folks, like you and me. I would love to be supportive of any company that is honest in regards to their product.  It appears to me that this company is trying to make a buck while they F anyone dumb enough to purchase, without looking at the reviews!!!!! So don’t be a dumb ass, look at the reviews!!!!! I cannot do more than this!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-03T11:52:45.000Z",
          "Titre": "Garbage product and customer service",
          "Contenu": "I purchased four screens when they arrived they were smaller than the dimensions I ordered.  Customer service stated that they had to be smaller for installation.  Three of the screens are in but there is a gap on one side and if you touch them they fall out.  The fourth is so small it will not even touch on three sides.  Customer service stated that it is not their problem as they built the screens to the sizes provided.  After arguing that the product received was smaller than dimensions ordered the agent dismissed me by stating there was nothing that could be done and basically it is what it is. Garbage product and garbage Customer service.  I will not recommend this product/company to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EG",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T20:19:39.000Z",
          "Titre": "Cheaply made - WARP",
          "Contenu": "These screens are cheaply made and warp in the center.  Not a great fit despite the correct measurements.  The company does not offer refunds either.  SAVE YOUR MONEY.  DO NOT BUY!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry C",
          "Nb_Reviews": 1,
          "Date": "2020-01-31T11:06:20.000Z",
          "Titre": "They Do Not Fit My Windows.",
          "Contenu": "I am a little unhappy with the finished product because it is too tall and will not fit the window. The product is probably a good product but since it won't fit I can not give it more than one star. I received 3 screens (as a trial) and was thinking of ordering for my whole house. Customer Service was VERY nice and wanted to replace the screens however I would have to pay for the shipping, $108, That's about 3/4 of the original amount just to replace the ones that are too tall. I declined since I didn't want to waste any more money on something that I couldn't use in the first place. I did use their video and measuring guide but they still were too tall. I'm sorry I have to give them one star but they ask me for my review..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ROSANGELA MONACO",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T16:55:21.000Z",
          "Titre": "HOPE",
          "Contenu": "Good Morning!I was so thrilled when I saw this product on Shark Tank! It was the solution I was looking for - practical, efficient, and clean and I ordered it right the way!I was really surprised with how fast it was delivered - since it is a personalized product I thought it would take weeks.When my screens arrived my family and I were leaving for Indiana, so we decided to open the boxes and check the screens once we were back home. We opened the boxes and I was disappointed to find they were not labeled, even though on the website, we were asked which room each screen would go. Then, upon opening each of the seven screens I ordered I noticed all but two of them were crooked and one was ripped. Their borders were also damaged, so it definitely compromised our ability install them.So,  5 out of 7 in total were damaged. I need these screens to be replaced, because they really can't be used the way they are.Thank you very much for your time and I hope to hear from you soon.Rosangela Monaco"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pam  Murphy",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T01:53:35.000Z",
          "Titre": "The screen fits but falls out at just a…",
          "Contenu": "The screen fits but falls out at just a mild touch making it impossible to open my windows as all you have to do is touch them and they fall out."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T20:07:20.000Z",
          "Titre": "Stop emailing me",
          "Contenu": "Stop emailing me. I never signed up for this mailing list, you keep adding me through data gathered from LinkedIn. I have unsubscribed multiple times."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashley Harr",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T15:30:54.000Z",
          "Titre": "Awful",
          "Contenu": "We had confusion measuring our windows because they are horizontal sliders so they are too wide to get a flex screen. When we were told by a representative that we would have to get half screens he informed us there would be a gap where bugs would be able to get in. Another lady was also of no help. Between talking to two people, with MUCH confusion with both of them,  neither of them ever once asked what type of window we have. At a third phone call for help, trying to decide if we should settle on a screen with a gap, and complaining that the website should ask you what type of window you have, the lady told us there is no way they could do that because there are so many types. REALLY? REALLY?! You sell window screens!!! Eventually I did research, found out the retail side sells a special type that has the edge that would prevent bugs from coming in. The lady FINALLY informed me that she could transfer this to their retail side to fulfill the order so that we would have no gaps in our half window screens. In the end, all that was sent was our screens with an additional slide on that would prevent the bugs. This was fine. But WHY DO YOU NOT OFFER THIS TO CUSTOMERS FROM THE BEGINNING?!?! THIS WAS ONE OF THE CRAZIEST CUSTOMER SERVICE EXPERIENCES IVE EVER HAD AND THE SOLUTION WAS SO SO SIMPLE. WHY ISN'T THIS SLIDE ON GAP PROTECTER JUST OFFERED ON THE REGULAR SITE???!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry  Chambers",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T11:08:54.000Z",
          "Titre": "Product may be OK but I will never know",
          "Contenu": "The product seems to be good however when my screens arrived the were too tall. They would remake them but I had to pay $108 shipping to get the replacement three screens sent out. That is way too much to find out even If I like them. I'm sure it is a good product but I can not give any good ratings when they did not work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ruth Krzyzowski",
          "Nb_Reviews": 3,
          "Date": "2023-07-16T16:26:52.000Z",
          "Titre": "Still haven't received the measuring…",
          "Contenu": "Still haven't received the measuring tool after a week and a half, no response to my emails."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 2,
          "Date": "2020-01-29T00:50:55.000Z",
          "Titre": "No reply to website email!",
          "Contenu": "Sent and email through their website, never received a reply. There screens may be great - don't know since they don't reply to emails on their site. An email they clearly received in order to have put me on a review list."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T23:34:03.000Z",
          "Titre": "I didn't buy anything from your website…",
          "Contenu": "I didn't buy anything from your website but keep getting review requests.  1 star for that.  Email also appears to be from 1995"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Welch",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T22:05:15.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Very disappointed! These look like great screens, and I was excited to finally get a screen for my odd-size kitchen window that is almost twice as wide as it is tall. But when I received the screen, it could not be installed despite being nearly the right dimensions (1/16 over even though I subtracted it) because there is ZERO amount of flex on the sides. All the videos I've seen of this product show it should flex easily at the sides. The screen flexes plenty vertically – top and bottom – but without any side flex it just won't go in my window. And I know they got the orientation right because the label is in the lower right corner where it should be. If they can't make wider-than-tall windows to flex at the sides, then they should put that warning on the order page and I would have ordered it shorter at the sides and used their little rubber make-it-fit thingies (which they didn't send, by the way, though they are supposed to be included in the order). I had ordered it through Home Depot so I went through their customer service and was told that this company had reviewed the photos I sent and decided that it was \"built within tolerance so there will be no refund.\" Talk about leaving the customer holding the bag! That would have been $70 wasted if Home Depot had not given me a full refund – kudos to them. So now I have a screen I can't install, a kitchen window with still no screen, and three more (standard-size) windows that need screens, but I will have to find another solution for them because it would be unwise to deal further with a company that can't be relied on to do the right thing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Megan Panetta",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T13:21:11.000Z",
          "Titre": "Scam- screens do not work!",
          "Contenu": "Bought screens for my whole home under the premise they work on any windows (as advertised).  I paid for the highest level of protection (solar screens) and they arrived scuffed.  They did not work on my windows and fall out constantly (especially after rainfall).  I also cannot see out of my windows after rain due to the high density of the solar screens- you might as well cover my windows with black construction paper.  These screens are completely pointless and expensive.  We contacted customer service who responded we should purchase a different level of protection than solar screens (yes, please let me sink more money into screens that fall out of my window).  They then stopped responding to our follow up emails.  Their customer service is a joke, especially after spending as much money as we did.  I understand there is a no money back guarantee, but if you're going to advertise your screens work on any window that should be true.  Flexscreen should be ashamed of themselves, they don't stand behind their product and therefore offer no guarantees/returns.  Purchase at your own risk, or better yet, stay far away from this scam of a company.Response to flexscreen's response- it is not a measuring issue, as we've told you in several emails. We got your measuring tool before ordering and my husband works in mathematics. We also got a second opinion from a contractor who agreed it's not a measuring issue. The contractor said your screens would never work on our windows due to the way our home is constructed.  I'm not interested in spending more money on your faulty screens and unless you're willing to offer a refund, I'm not interested in waiting weeks for a response from your customer service team. Your last solution was to purchase a different level of screens, which we will never do. I've already wasted enough money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-06-09T21:10:36.000Z",
          "Titre": "Ordered screens several weeks ago",
          "Contenu": "Ordered screens several weeks ago, admittedly during the Coronavirus outbreak, but your website didnt give any information about ordering and I havent had any communication from you since I placed he order. Not great customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer Sharon Jones sltmjones@hotmail",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T22:54:23.000Z",
          "Titre": "Email response non existent.  No reply to request",
          "Contenu": "I sent an email regarding a possible order of 13 6 foot screens and no one has contacted me to answer my questions."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2020-12-30T05:44:10.000Z",
          "Titre": "I purchased 11 screens for all of my…",
          "Contenu": "I purchased 11 screens for all of my windows. I viewed their video on how to measure the windows. I measured exactly how the video showed. When I received the screens they were about 1/4 inch too big. They wouldn't even fit in my windows. It was a waste of $700. The screens seemed like they were very cheap to make with an equally high markup."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jake Pearl",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T02:44:37.000Z",
          "Titre": "The screens were the wrong size",
          "Contenu": "The screens were the wrong size, and now you want to do a bunch of stuff to prove it, I don't have time for this.  Process was much to complex, and you did not handle your mistake well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T20:09:14.000Z",
          "Titre": "ever since you joined with those shark…",
          "Contenu": "ever since you joined with those shark tank guys - it's way too expensive - too bad - it could have been a great productgood news - there are now other options"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pat Crews",
          "Nb_Reviews": 1,
          "Date": "2021-03-06T19:34:48.000Z",
          "Titre": "The problem is you pay first",
          "Contenu": "The problem is you pay first, then they point you to a video which tells you the thickness of the screen, and also when you find out they won't work.  Don't pay first.  What a horrible way to design a site for the consumer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "No Owner",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T20:04:10.000Z",
          "Titre": "I do not own a flexscreen",
          "Contenu": "I do not own a flexscreen, but you keep sending me e-mails asking me to review the product. Take me off your mailing list."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pat Hughes",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T23:21:05.000Z",
          "Titre": "My screens work great one small problem…",
          "Contenu": "My screens work great one small problem my magnets are wearing out.Please let me know where I can purchase them"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-05T23:52:11.000Z",
          "Titre": "Never used flexscreen therefore I will…",
          "Contenu": "Never used flexscreen therefore I will have to give it 1 star for the continuous emails"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Glasser",
          "Nb_Reviews": 3,
          "Date": "2020-01-28T20:12:32.000Z",
          "Titre": "Received very little help with…",
          "Contenu": "Received very little help with measuring and addressing the problem I had,. I canceled my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jenna Skouby",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T21:16:29.000Z",
          "Titre": "$70 for 1 screen",
          "Contenu": "$70 for 1 screen, what a joke! These are definitely not for the average home owner!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 2,
          "Date": "2020-01-28T20:34:36.000Z",
          "Titre": "Pricey",
          "Contenu": "Pricey, pricey, price too high. Rediculous!Love product but too too expensive and I’m upper middle class! Sorry"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shane Baganz",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T17:05:07.000Z",
          "Titre": "I have yet to receive the product",
          "Contenu": "I have yet to receive the product.  It has been approx 10 days since the items was declared shipped."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Maldaner",
          "Nb_Reviews": 3,
          "Date": "2020-01-29T01:49:51.000Z",
          "Titre": "Too expensive.",
          "Contenu": "We were intrigued by these when we saw them on TV, so we went to the site to check them out. But they are way to expensive!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Meghan",
          "Nb_Reviews": 1,
          "Date": "2020-02-03T17:07:02.000Z",
          "Titre": "No customer support",
          "Contenu": "We ordered 2 screens. One screen fit perfectly. The other did not. When we reached out to support, we heard NOTHING."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T11:47:08.000Z",
          "Titre": "Not great",
          "Contenu": "Not great, it doesn't stand up to well and you have to be straight on without blurry view"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T03:59:17.000Z",
          "Titre": "Have never received my screen",
          "Contenu": "Have never received my screen. Was ordered almost 2 weeks ago"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "chris",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T20:28:37.000Z",
          "Titre": "Terrible was the second screen they…",
          "Contenu": "Terrible was the second screen they sent out. It was too tight and produced gaps all around the sides."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-05T01:39:35.000Z",
          "Titre": "Flex screen is extremely over priced",
          "Contenu": "Flex screen is extremely over priced. It seemed like a good product when I saw it on Shark Tank."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robin Dodds",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T05:50:41.000Z",
          "Titre": "Came broken",
          "Contenu": "Came broken. Waiting for replacement."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Carper",
          "Nb_Reviews": 2,
          "Date": "2022-04-21T20:19:09.710Z",
          "Titre": "Spliced Frame is junk",
          "Contenu": "My original screen had a one piece frame and fit easily into my window pocket. The replacement that I just received had a spliced frame and where the splice occured it was larger than my window pocket and needed to be beaten in the pocket with a screw driver and hammer. Not sure I'll be able to get it out now when I need to clean my windows. Two thumbs down, from me.Mark Carper"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Scott",
          "Nb_Reviews": 2,
          "Date": "2022-03-25T17:59:38.000Z",
          "Titre": "Incorrect advertisement",
          "Contenu": "Quick service but not what was advertised. The website claims beautifully invisible. Which the screens are not. As a matter of fact they are black and not gray.  Gray makes the screens invisible on your home and black makes them stand out and not match anything else on my home.  No refund or help was given to remedy the issue.  So I’m stuck with two screens at 180 bucks total that I won’t display at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ct",
          "Nb_Reviews": 1,
          "Date": "2022-03-26T01:39:18.000Z",
          "Titre": "Terrible Screens",
          "Contenu": "Terrible Screens. They advertise that they're flexible on the sides but they're only flexible in the middle on the sides. As a result I have not been able to get them over the lip of the track. Waste of money! And they made them 1/8 too high but even if they had been accurate the lack of flexibility would have prevented me from using them. So disappointed. Don't waste your money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy Dytmire",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T21:00:34.000Z",
          "Titre": "This was completely the wrong size",
          "Contenu": "This was completely the wrong size.  6 feet tall and 4 feet wide.  Not what I ordered"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T20:53:22.000Z",
          "Titre": "My screen was 3 years old in a concrete…",
          "Contenu": "My screen was 3 years old in a concrete building. They insist on re measuring the screen openings and sides. If they just made is easier and not making the process more confusing with pages and videos. Just answer one. Does your current screen fit right? Great measure the screen and enter here. I took a picture of the screen label and they just ignored it. I saw no box for the fuzzy piece at the top of the screen. So I didn't get that. It took about two weeks to get the screen and their antenna measuring device. I never received the first tool sent out. So I am with a useless screen."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacob Benrud",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T21:38:26.000Z",
          "Titre": "Screen was ripped on arrival"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Virginia  Medford",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T01:43:12.000Z",
          "Titre": "Order at your own risk",
          "Contenu": "While the concept is a good one, the measuring was confusing as mentioned in MANY other reviews. I thought I followed the instructions exactly but realized when I got them that I took the instructions to literally I guess. In addition, being “flexible” I assumed that meant they would be flexible and you could take them in and out. After taking them in and out twice, one has screen already pulling away from the edge. Not at all the quality I expected."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean B.",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T01:10:30.000Z",
          "Titre": "Poor communication/Product does not fit",
          "Contenu": "Ordered on May 10th 2021 and never heard a word  from the company, for 4 months, then sent a email on 9/9/21 asking what was going on with my order, didn't receive a reply (with no explanation besides your order has shipped) until 9/22/21.  I finally got the 1 screen I ordered to try them out and the sizing is wrong by a 1/4\" top to bottom and side to side...Hoping to contact customer service and see what they say, to be continued..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pattipeppermint",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T03:54:39.000Z",
          "Titre": "They have got to be kidding",
          "Contenu": "I reached out to customerservice@flexscreenretail before leaving this review. They have got to be kidding. I told them that including Shipping, I paid $110 for one screen. It fit great, but Screen separated from frame and after writing to their customer service, they'll replace it if I first pay $70 for shipping!!! Screen lasted a half year. What a waste. Isn't there some way to pick it up at Home Depot or somewhere locally and skip the shipping? It's not like it lasted years. I'm in my 70s and on limited income. I have tried regluing screen to frame and finally used needle and thread to hold in place and keep scorpions out!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "janderjd",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T21:18:22.000Z",
          "Titre": "The screens don't fit",
          "Contenu": "The screens don't fit. I spent a long time measuring and remeasuring for the screens.  I carefully followed the instructions and used the tool provided.  They are too loose.  The screens were supposed to come with some sort of spacers to help make the screens snug.  But they were not included.  I am very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Uzma Kazmi",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T12:22:55.000Z",
          "Titre": "9 of 11 screens are the wrong size!",
          "Contenu": "I purchased 11 screens, out of those 2 had significant tears out of the shipping box and 9 were not the correct size despite having the correct measurement labeled on the screen. I sent pictures to customer service but have received no answers except I may be required to send more pictures to document their errors. Horrible experience, I was willing to pay more per screen for the convenience of FlexScreen but that was a horrible decision given their manufacturing and customer service policies."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janae Smith",
          "Nb_Reviews": 1,
          "Date": "2021-06-19T04:08:28.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible!  Whenever a Company has a disclaimer that they do not stand behind their product, it is a HUGE red flag.  We measured perfectly, triple checked and the screen arrived and is an hourglass shape when put in the window.  Biggest waste of $100 for a useless screen and when contacting them, they are condescending and unhelpful and blame mis-measuring as the issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luke Gottlieb",
          "Nb_Reviews": 1,
          "Date": "2021-09-29T19:05:02.000Z",
          "Titre": "Poorly manufactured, not as sturdy as I needed",
          "Contenu": "My screen arrived and the screen portion was not well attached to the frame, with a large gap where it should be glued down.  So the product is unusable.  I put it straight into the garbage, and will stick with traditional screens in the future.  You should redesign this product so that the screen is embedded in the frame, and not just glued.A replacement screen will be manufactured in the same way;  I purchased this product because I wanted a tough, hard to break screen to put up with my pets and kids."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Valentyna Lishchuk",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T16:21:08.000Z",
          "Titre": "One of the screen was damaged and when…",
          "Contenu": "One of the screen was damaged and when request replacement was asking $49.95 for shipping.That screen is 22 x 23 and weight about one poundI will not shop here again , because there warranty S. You pay almost the same price as if you buy the screen from anywhere.Don't shop there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alison",
          "Nb_Reviews": 3,
          "Date": "2021-06-22T19:51:46.000Z",
          "Titre": "I don't recommend this product",
          "Contenu": "Looked like a great product.  Followed instructions on measuring however there was a clip on the top of the frame, that no matter which way we measured, they would not have fit.  It's very unfortunate that they have no accountability for product that won't work.  Do not recommend.The reply simply reiterated what I already knew.  The screens won't fit, but if I want to spend MORE money, I can try a new size with gap fillers.  No thanks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesse",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T15:15:32.000Z",
          "Titre": "Screen doesn't fit. Beware if no pockets.",
          "Contenu": "Followed instructions carefully for pocketless window frame but still ended up with screen that was too large to use. This was a very disappointing experience.  Had to throw away the oversized expensive screen.  Frankly measuring the old screen probably would have been perfect but instructions said not to do this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DS",
          "Nb_Reviews": 1,
          "Date": "2021-10-20T12:56:47.000Z",
          "Titre": "I ordered four screens to try them out…",
          "Contenu": "I ordered four screens to try them out before ordering the rest.  Two of my screens do not fit and with no way to return them it’s a complete waste of money.  I used the measuring tool that was sent and they are still too big.  I won’t plan to buy any more in fear that I will measure wrong."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathleen R. Skubitz",
          "Nb_Reviews": 2,
          "Date": "2021-12-13T14:54:34.000Z",
          "Titre": "I would not recommend buying these",
          "Contenu": "I would not recommend buying these. Really do not fit tight in middle of the window edge. Bumpers do not help. Measuring takes a lot time. We did it and rechecked 4 more time because wanted to be sure the measurements were accurate. They arrived quickly and screen is clear."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 2,
          "Date": "2021-04-18T21:59:06.000Z",
          "Titre": "Do not purchase, quality is not that great, wouldn’t hold up in any storm!!!",
          "Contenu": "The screen doesn’t fit.  I measured it to the screen and it doesn’t work right. The black thing that is supposed to snap in is too thick.  The screen is not flush the black square, so it is not well made.  THE WORST PRODUCT I HAVE PURCHASED. I spent $$$ and now it is going on the trash..... what a horrible product as it’s not returnable. DO NOT PURCHASE!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Kaiser",
          "Nb_Reviews": 2,
          "Date": "2021-04-26T17:20:30.000Z",
          "Titre": "If I could give it a zero I would",
          "Contenu": "If I could give it a zero I would. I ordered 5 screens and the first two ripped immediately. When I told them, they said it's rare screens rip, but it does happen. They will not take a return or give a refund. They will only send replacement screens. What happens when those are ripped too? More replacements. The customer service is horrible and the screens themselves are poorly made. Stay away from this product at all costs. It is not worth your time or aggravation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T23:41:21.000Z",
          "Titre": "Not interested",
          "Contenu": "Not interested. Spam mail."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "junk",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T14:01:43.000Z",
          "Titre": "Product for the price is garbage",
          "Contenu": "Your measuring tool is garbage. Instead of having a way to put in exact measurements you have a list of measurements to pick from and you can't get a proper fitting screen. The material the screen is made from could not be any cheaper. I had a screen rip from trying to instal it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Simply The Schuesslers",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T18:11:25.000Z",
          "Titre": "Well was totally excited to get new…",
          "Contenu": "Well was totally excited to get new screens, bit pricey but willing to try... Until they refused to even give me an estimate on shipping? on the site says free if you buy more than 4... except on oversized screens.. OK,  so after reading their contract ( the small pint) I called, they said buy them 1st and then we'll figure out the shipping after words...I'm sorry but in my world I don't pay for something until I find out the REAL costs.. I won't be doing any business with this company.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don Choi",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T21:20:49.000Z",
          "Titre": "i havent even recieved the product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharon Fraley",
          "Nb_Reviews": 2,
          "Date": "2021-10-30T22:49:09.000Z",
          "Titre": "Our screen came to us with the screen…",
          "Contenu": "Our screen came to us with the screen pulling away from the side. The screen had a tear, but it appeared the box was damaged from fedex because the tear in the screen was the same area the box was damaged. I would not recommend anyone to buy this product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glenn Torrez",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T19:59:40.000Z",
          "Titre": "TERRIBLE CUSTOMER SERVICE!",
          "Contenu": "TERRIBLE CUSTOMER SERVICE!I can't tell you how disappointing it was to try and work with these guys! I placed and order late afternoon and after placing my order realized a did not account for a dimension, I emailed them the next morning and they said \"sorry it's to late to make a change\"! Who does business this way? Obviously they're not concerned about customer satisfaction or future business! I would never do business with these crooks again! In addition you have to pay in advance of being able to place your order and there was no customer service available to help you!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack Crittenden",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T22:59:17.000Z",
          "Titre": "your process is totally f********ed",
          "Contenu": "your process is totally f********edeach side of the pockets on my window are different and your form only asks for one side of the top and one for each side.... what a cluster f..............Geeeeeezusssss"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peggy P",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T23:10:15.000Z",
          "Titre": "Tired of trying to get it done right",
          "Contenu": "Wrong screens sent. No indication of screen material sent. Second screen too small and damaged due to poor packing. Third one fits but has a small pucker. I’m just tired of dealing with them so I’m keeping a very over priced screen with a pucker"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Holzman",
          "Nb_Reviews": 1,
          "Date": "2020-03-01T16:59:40.000Z",
          "Titre": "They’re ignoring me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2021-06-14T21:51:34.000Z",
          "Titre": "3 strikes and I'm out.",
          "Contenu": "I have had 3 screens screen shipped to me and every screen was short by give or take a 1/4 inch. The last one also had a hole in the screen. Sandy at customer service was great each time. Each time I sent pictures of me measuring the screen, the measurement and the sticker on the screen labeling what the measurement should have been. Short every time. This last time they had to redo it, I was assured that the plant manager would personally check the screen. That was the shortest one of all. Not even close. I really wanted this to work but I can't go through this again. Thanks again to Sandy for all your help. You were the best part of this experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan Phillips",
          "Nb_Reviews": 1,
          "Date": "2021-11-06T18:44:18.000Z",
          "Titre": "Not worth the money",
          "Contenu": "Not worth the money. They are custom made so no returns.  The fit will keep birds out of your house but not frogs,  lizards or bugs. Save your money and hire a window company to remake you new screens."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alison",
          "Nb_Reviews": 3,
          "Date": "2021-05-04T19:20:15.000Z",
          "Titre": "Shame on me for not reading the reviews…",
          "Contenu": "Shame on me for not reading the reviews here before ordering.  We measured our windows per the instructions, however our windows have a little clip on the top to hold the upper panel in..  this prevented the screens from fitting properly.  One screen came damaged.  They were happy to replace the one screen, bit since they wouldn't fit, why bother.  I asked if they would make the replacement screen to accommodate the clip, and they wouldn't do it.They did offer to remake all of the for $10 each and $35 shipping.  So that basically tells you what the screens cost them.  Pure crap!  I wouldn't do business with this company if I had the chance to do it over again.  And how do their employees sleep at night knowing they are helping to screw people out of their hard earned money?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron F.",
          "Nb_Reviews": 6,
          "Date": "2021-06-04T17:32:48.000Z",
          "Titre": "Came about a 1/4-1/2 inch smaller than…",
          "Contenu": "Came about a 1/4-1/2 inch smaller than ordered on both sides..and is way to small for my windows... despite following their instructions exactly on measuring required size"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Enoch Lewis",
          "Nb_Reviews": 3,
          "Date": "2021-06-04T17:17:15.000Z",
          "Titre": "No transparency on shipping",
          "Contenu": "Positively a quality product, but not transparent on cost when the postage was more than the product and not revealed until after the product was ordered and ready to ship"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A Lou",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T19:56:41.000Z",
          "Titre": "Too expensive for \"meh\"",
          "Contenu": "The screen seems mostly well made but there's major issues I don't like1) the squishy rubber bumpers are small and if used, they create gaps because it doesn't run the whole length. If you like gaps in your screens, you'll love it!2) there's no tabs to pull screen and get a grip easily. You have to push from the inside out which can mess up windows, paint, even your screens.We bought only 2 to test and unfortunately for the price and considering above - will not be purchasing for remaining windows."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T18:11:28.000Z",
          "Titre": "Mike was great",
          "Contenu": "Mike was great, but I wish the $200 upcharge ( regardless of quantity) was discussed up front. It may be legit but it sure comes off as 'scammy'. Reminds me of buying something off of ebay for $5, but S&H is $30 for a pet rock. Further more I received the order and the screen sizes I ordered 43\" square, is less than the shipping container used. I am still waiting on a promised call for additional information regarding fulfilling my order. I also have a facility within the area and I could have had my own company carrier pick up the order, as I did offer that scenario."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lorraine",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T17:04:23.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Very disappointed. I ordered 5 screens and only 2 fit. It be because I got the heavier screen because of my pets which are the reason for needing new screens. The corners of the screen were particularly thick and knobby and do not fit in the channels. Perhaps it would have been a better fit with regular screen or perhaps if I decide to try again, I would give a narrower measurement so it wouldn’t matter if they didn’t fit all the way in. However, the 2 that fit are great."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacqueline Cruz",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T16:48:19.000Z",
          "Titre": "The screens look nice but pop out…",
          "Contenu": "The screens look nice but pop out easily even with the bumpers they include. Two screens are small even though I measured the window with the tool they sent. I contacted them to see if I can send them back and get a replacement and they said they’re custom so no and if it was an error on their part they would charge me 10 dollars a screen."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vanessa Rising",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T16:40:41.000Z",
          "Titre": "Not for 1950s windows :(",
          "Contenu": "Screens were the correct size per our measurements but don’t fit correctly in our 1950 wood double hung windows. We triple measured per the directions but somehow some screens are too tight and some bow in at the sides. One screen is already beginning to rip. Good in theory but probably only work on windows from 1970s and younger (metal or vinyl frames)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KLAEYZ",
          "Nb_Reviews": 6,
          "Date": "2022-10-07T16:35:41.000Z",
          "Titre": "Flex from the top and bottom not the sides",
          "Contenu": "Despite specifying that my windows only have side pockets and not top or bottom, my screens arrived flexing from the top and bottom.Upon contacting customer support they explained that it’s due to my windows being wider than they are tall. My windows are only slightly wider than the height, and even so I don’t understand why this would have any bearing on where the screens flex from. As is, they require great force to install and are very difficult to remove. I purchased these under the impression through all the demonstrations that they flex from the sides in order to easily fit into the side pockets. Mine do not. Very disatisfied."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sherry G.",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T02:14:13.000Z",
          "Titre": "Website measurements!! Disappointing!!",
          "Contenu": "I've had several questions through the email that were very helpful. They responded quickly to any email sent. And one of the emails they recommended that on their website you can put in your sizes of the flex screen that you would like to order. In doing so the screens that were sent they did not fit. Very disappointed in the product size to large and I followed the website directions on how to me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lori Laverdiere",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T17:41:16.000Z",
          "Titre": "I used the FlexTenna to measure the window…",
          "Contenu": "I used the FlexTenna to measure the windows and followed the instructions and two of the screens don't fit on the sides and both screens had the same measurement for the living room windows.  Even using the bumpers provided the width doesn't fit.  Now we're not sure what to do."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Jorgensen",
          "Nb_Reviews": 4,
          "Date": "2020-01-29T22:07:19.000Z",
          "Titre": "WHAT PRODUCT?  IT IS NOT CLEAR TO ME",
          "Contenu": "I am not sure what I am getting when I order this FlexScreen.  Am I ordering a sheet of the screen, then molding it to a frame, or do I provide my own frame (new or old), then cut the screen to match whatever screen holder I have or have removed from my window jam.  It is not clear what I am ordering, even though your view may seem clear."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Herr",
          "Nb_Reviews": 1,
          "Date": "2020-08-20T12:06:37.000Z",
          "Titre": "I didn't know flex screen came with…",
          "Contenu": "I didn't know flex screen came with Harvey windows. I wanted a screen I could raise to the upper sash where the shade would cover. I want clear views through glass.The half screen has no mechanism to raise the screen and stay in place. I wish Harvey explained that and I  wanted a traditional screen when ordering and not one that is static.Flex screen needs to develope a way to do this in their product. 21 bucks traditional Harvey screen vs 36 bucks flex that doesn't allow for customer flexibility. I'm not happy with Harvey Windows. Flex customer service is being understanding about my situation and I'm trying to deal with a solution that meets my needs. There is a disconnect with the flex screens and #Harvey windows.Harvey wants to charge $1500.00 for 17 screens because it's painted bronze which is a stock colour on their Tribute PVC windows."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T21:11:59.000Z",
          "Titre": "My husband measured our window for the…",
          "Contenu": "My husband measured our window for the screen exactly as said and unfortunately the screen was to small.  The part where the screen isn't supposed to fit in an area, this screen fits into.  We had to rig it to get it to work, otherwise would of been perfect and just what I needed.  Maybe my window is just to old, still was frustrating it doesn't fit.*Correct, he measured for no pockets.  Our pockets are 4/16ths and your instructions said 5/16ths and somehow your screen still fits in the pockets when they should not have.  He exactly as the instructions said.*"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Schense",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T17:38:35.000Z",
          "Titre": "Flimsy and dangerous. Kids or pets? Don't risk it.",
          "Contenu": "Moved into a house with flexscreens. Seemed fine until our cat saw a bird and jumped at the screen, pushed it out and ran off. We got her back after much trauma. We have 7 of these screens and they all fit fine, but they fit loose at best.  Online retailers say \"all screens are designed to keep things out, not in. Any screen can be pushed out\". Industry BS. Now we use expandable screen inserts on a couple windows and keep the other ones at about 4\". If you don't have animals or toddlers, the screens are nice, but otherwise they present a hazard and are best avoided."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-31T01:14:29.000Z",
          "Titre": "Please Disregard",
          "Contenu": "I had mistakenly posted a negative review of FlexScreen. I thought the review was for a 3D screen I'd purchased at Christmas, which I was not impressed with.My  sincere apologies to FlexScreen, I remember seeing them on Shark Tank and had visited their website for more information. Sorry for my misunderstanding."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cary Nash",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T19:20:08.000Z",
          "Titre": "I saw FlexScreens on Shark Tank and…",
          "Contenu": "I saw FlexScreens on Shark Tank and loved the idea.  I liked being able to order my exact sizes on your website.  However, now that they have showed up I'm not that happy.  On each side of the screen near the top and bottom the frame is smaller than the middle.  As a result it leaves gaps that flies and other insects can come through."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matt Della Mora",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T01:49:52.000Z",
          "Titre": "Not as satisfied as I thought I would…",
          "Contenu": "Not as satisfied as I thought I would be. Be careful when you measure. I ordered 6 screens and only 3 of them fit. The other 3 windows had these little tabs in the corners of the window that make it so the screens don't fit. Make sure, if you are measuring that you are finding the smallest part of the window and do the measurements from there. Also, I would go short on your measurements rather than trying to be exact. The bumpers they send with the screens can help secure them in place if there is any give. There is no adjusting these things and no returning if they don't work so I'm out quite a bit of money. When they do fit, it is just as easy as they claim it to be. Had I known this in the first place I totally would have measured different and I would have given them 5 stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 2,
          "Date": "2020-02-06T16:31:38.000Z",
          "Titre": "Product OK, customer service is lacking",
          "Contenu": "The product is good for the cost and it does what it says and what you would expect.The negative I have is that I ordered 3 and 1 arrived cracked, packaging was terrible. I contacted customer service regarding the issue and never received a response. Customer service can make or break a company. I will not order again from this company because of the lack of customer service.2.06.19 - so the company responded to my review and asked that I contact them so they could make it right. I have called the 800 number and a recording says to email their support email address and the voice mail is full. I email support, get no response, call still can't talk to anyone. Frustrated. Gave them more than one opportunity to make it right. Like my original review stated - their customer is service is terrible!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cory Cottingim",
          "Nb_Reviews": 3,
          "Date": "2023-08-22T21:06:57.000Z",
          "Titre": "Sizing instructions with their antenna…",
          "Contenu": "Sizing instructions with their antenna were followed carefully, but screen too small."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mari hertzberg",
          "Nb_Reviews": 2,
          "Date": "2020-05-06T23:02:42.000Z",
          "Titre": "I love the screen but I had asked for…",
          "Contenu": "I love the screen but I had asked for the additional plastic pieces to us since our opening is not quite square and have still not received them after I emailed them twice????"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tracy M.",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T20:28:47.000Z",
          "Titre": "We were really hoping these would work",
          "Contenu": "Waited on the measure tool. Measured using the tool. sent in specs. screens look good but are too tight which flexes the bottom up. useless to keep bugs out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brianna Conley",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T21:04:58.000Z",
          "Titre": "Measuring calculator wrong.",
          "Contenu": "I used the measuring tool both that was sent and the tool calculator online and it is far too small. And now I'm stuck with 3 screens that don't fit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jess",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T12:55:20.000Z",
          "Titre": "The screens were larger than the…",
          "Contenu": "The screens were larger than the measurements I sent by at least 1/16 of an inch width and height. I called customer service, they said they would call back to see what they could do for me and did not call back. Now I have $300 worth of screens that I can't use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 2,
          "Date": "2020-01-28T22:37:44.000Z",
          "Titre": "I sent an email asking for information…",
          "Contenu": "I sent an email asking for information and didn't hear anything back.  If this is their customer service, I'm not buying the screens"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Window Depot Albany New York",
          "Nb_Reviews": 1,
          "Date": "2020-02-05T18:39:34.000Z",
          "Titre": "Its a good product but as I mentioned…",
          "Contenu": "Its a good product but as I mentioned at the Window convention the screen material isn't tight enough customers say they dont like the look"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T00:24:52.000Z",
          "Titre": "Please simplify",
          "Contenu": "Order process was much more difficult with more steps than should be needed. Annoying"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Mitchell",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T20:10:28.000Z",
          "Titre": "Not good install instructions and two…",
          "Contenu": "Not good install instructions and two screens too big."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beki Heath",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T17:45:54.000Z",
          "Titre": "3 of our screens are the wrong size",
          "Contenu": "3 of our screens are the wrong size. They are marked correctly but actually measure too big."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 3,
          "Date": "2022-10-05T20:49:40.000Z",
          "Titre": "Using the 3/16 deduction does not work…",
          "Contenu": "Using the 3/16 deduction does not work with my windows, that have virtually no lip on the vertical dimensions."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Madigan",
          "Nb_Reviews": 1,
          "Date": "2020-08-06T20:04:01.000Z",
          "Titre": "Was ready to order, but...",
          "Contenu": "Was ready to order, only one screen, but then noticed the shipping was $35! No way...I'll just get the $10 screen fix kit instead..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FlexScreen inquiry",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T21:12:42.000Z",
          "Titre": "Not sure when website states \"pay now…",
          "Contenu": "Not sure when website states \"pay now order later\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T15:24:33.000Z",
          "Titre": "Cracked less than 60 days",
          "Contenu": "Cracked less than 60 days.  Disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 2,
          "Date": "2022-05-04T16:15:37.000Z",
          "Titre": "Ok screens, poor measuring",
          "Contenu": "The screens themselves seem like good quality, and shipping was fast.  However there is definitely a problem with their measuring system as I used the included Flex-tenna and followed the directions exactly.  I triple checked all my measurements and subtracted the amount they say is necessary for windows with pockets, but upon installation all of the screens were too big for my windows.  Three of them I was able to force into place with a lot of bending, but two are way too tall to fit and will now be expensive trash.  I understand there are no returns, but I wrote to customer service and never got a response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Diehl",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T23:43:12.000Z",
          "Titre": "My order arrived in perfect condition",
          "Contenu": "My order arrived in perfect condition. I was one day away from calling my credit card company to cancel the order. I ordered measured and paid for my order,almost four weeks later my order arrived, the week prior my credit card statement came. Their is no way of contacting them to see when your order will be shipped and no invoice in the order. I have one screen that is damaged and no way of contacting this place. Hopefully they will contact me to see how my order is."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "cberg",
          "Nb_Reviews": 1,
          "Date": "2021-08-30T14:26:56.000Z",
          "Titre": "Poor quality control",
          "Contenu": "4 out of the 6 screens arrived with screen not sealed to the frame.  Flexscreen is sending replacements, but with such poor quality control, I have doubts about the quality of the product.  I hope after years of excellent performance I will feel these were worth the expense and I can give them more stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charlie A",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T17:26:09.000Z",
          "Titre": "Screens are flexible and looked nice…",
          "Contenu": "Screens are flexible and looked nice when new but definitely not as squishy as they appear in the ad or on Shark Tank. Must wrestle to install but slightly easier to remove (measured perfectly btw). Spots already drooping from pushing out screen to remove. High shipping fee also seemed like a hidden cost not evident from ads."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Holly Wagley",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T23:06:09.000Z",
          "Titre": "Loose fitting",
          "Contenu": "After my in-laws ordered a few screens, we ordered a test screen. It was a very easy install however not 100% tight on all corners but it did stay in place and did its job. We measured and ordered 7 more screens and none are actually tight enough to stay in place without physically altering the screen or window (i.e. caulking, weather stripping, adding a shim or even glueing). There is not enough tension to keep in place. We aren’t sure how this happened since the first did fit. Disappointed that we are now stuck with screens without a proper fit that will not work for us."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MCNAB",
          "Nb_Reviews": 2,
          "Date": "2021-12-01T13:31:22.000Z",
          "Titre": "Didn’t fit after using their measuring…",
          "Contenu": "Didn’t fit after using their measuring tool! The flex part is a great idea but they need to have someone measure it as doing what they said didn’t work. Also the screen is already torn from the seem so not well made. Waste of over $150."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T22:35:48.000Z",
          "Titre": "Very slow on responsive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Chassanoff",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T16:09:05.000Z",
          "Titre": "Fit problematic",
          "Contenu": "One fit. One didn’t. Also, the screen frame was a tiny bit too wide compared to the slot I have. The ‘measuring tool’ did not account for that width problem. Nice product, but getting the right fitting is not a perfect science."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary Nolan",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T04:31:50.000Z",
          "Titre": "Not Honest In Their Description",
          "Contenu": "They really should warn you that if your windows do not have tracks for the screens, they are going to leave large gaps.  I'm not sure I would have purchased them knowing that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jon Orendorff",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T14:42:41.000Z",
          "Titre": "Even after multiple measurements the…",
          "Contenu": "Even after multiple measurements the screens did not fit correctly.   And with no return you are wasting $.The product itself is a good idea but the execution is terrible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Watson",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T17:55:31.000Z",
          "Titre": "Good product, terrible execution.",
          "Contenu": "I paid the money I filled out the form with all of the details on measurements and then waited three weeks and did not receive my product. I contacted support and was told that I did not submit something properly. They said they submitted it for me. Just makes no sense. I did what was asked of me and I pushed submit. To have it blamed on the customer it’s terrible customer service I probably should’ve given you one star right there.  They did not expedite the order I received it 2 1/2 weeks after I submitted a support ticket. They only sent me enough of the rubber bumpers for two of the windows even though I needed it for all of them so I had to contact Support again. The screens are high-quality and I appreciate that but this company needs to really work to get its act together when it comes to customer support and quality control."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Raj p",
          "Nb_Reviews": 1,
          "Date": "2021-08-06T15:43:40.000Z",
          "Titre": "The fit wasn’t great despite using…",
          "Contenu": "The fit wasn’t great despite using their own tool to measure. Screen keeps falling and looks flimsy"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T20:14:40.000Z",
          "Titre": "Pricey",
          "Contenu": "Prices were way to high."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "C L",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T14:41:23.000Z",
          "Titre": "I don't understand the hype, folds and ripples everywhere",
          "Contenu": "I don't understand the hype. They advertise invisible, and yet each one has so much extra material I can see ripples and folds when I look at any window from most angles (whether installed or not, so it's not a fit issue with my windows). Customer service was lovely and said it wasn't right, sent another set, and they're exactly the same. They look pretty bad."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt B",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T00:14:41.000Z",
          "Titre": "Product seems good, SHIPPING COSTS WAAAAY TOO EXPENSIVE",
          "Contenu": "Product seems good, was easy enough to install. But \"additional oversized shipping costs\" are RIDICULOUS.  Charged over $250 to ship one screen (which you don't find out about until you have placed your order).  Paid it just to see what the product is like.  I have to replace all the screens in my house (15+ windows), not sure it is worth it with those shipping costs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda Hursa",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T14:53:54.000Z",
          "Titre": "Quality control issue",
          "Contenu": "Although I am pleased with the overall look of the screen, I was not pleased with the quality control of the product. There are 4 places near each corner that are not welded to the frame and I’m sure with continued use those openings will worsen. It looks like maybe the screen was cut too short in those spots and didn’t get attached to the frame. Even though each one is a small area this  most certainly should’ve been noticed during an inspection after it was made."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Todd Dehlin",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T02:52:11.000Z",
          "Titre": "The screens are delayed in shipping and…",
          "Contenu": "The screens are delayed in shipping and Flexscreen did not answer my email asking for an update.  I had to pay upfront, measure on my own, manually enter measurements.  I would expect better customer follow up related to issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grant Gursky",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T21:46:47.000Z",
          "Titre": "I’m a returning customer because I have…",
          "Contenu": "I’m a returning customer because I have had positive experiences with Flex-Screens. Really like the Flex-Tenna measuring device.I do not understand why Flex-Screen reduced the measurements by a couple 16ths of an inch. This made the screens a little less snug in the frame."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert S Mayer",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T01:39:55.000Z",
          "Titre": "The screen separated from the edge when…",
          "Contenu": "The screen separated from the edge when installed.  about a 2 inch separation.  based upon how fragile the screen is I would not recommend for the cost."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VJ",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T16:35:34.000Z",
          "Titre": "I ordered several screens so was bound…",
          "Contenu": "I ordered several screens so was bound to make at least one mistake in measuring.  I accept its my own fault! These are very good screens and SO easy to install due to their flexible frames. It's just unsettling how expensive they are when you realize one is unusable.  :("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary Segadi",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T00:43:28.000Z",
          "Titre": "Not all need the measuring tool",
          "Contenu": "I understand the measuring tool but not everyone needs that. I had to wait for the tool after paying which I really did not need. Plus I had to pay for shipping which I could have picked up at the store and saved some $$. The screens box came pretty beat up. Luckily the box was longer than the screen. The screen fits perfectly. Interesting how the screen is made to flex. Thanks for your appearance on Shark Tank otherwise I would never have known you exist"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maryann Virga",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T22:15:27.000Z",
          "Titre": "We followed the instructions but…",
          "Contenu": "We followed the instructions for measurement and used the antenna tool but the screens are ever-slightly too big to fit within the tracks.  We placed them in the space and secured them with thumbtacks.  I would certainly prefer that they fit correctly, but did not see any type of money-back guarantee They do appear to be a high-quality product otherwise."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diana L",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T14:04:43.000Z",
          "Titre": "Fast shipping",
          "Contenu": "I ordered one screen. I liked that it came two days after I submitted my measurements. I have narrow pockets on the sides, so I used the bumpers. They confused me though, because it seems they will just make a space for insects to get in. All seemed well until the next morning, when I found the screen flopping outwards. I had to go around to the outside (which is an awkward spot) and tape the screen in all around. I could have bought a much cheaper screen if I knew I'd have to do that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 4,
          "Date": "2020-02-04T20:16:44.000Z",
          "Titre": "I printed out the how to measure sheet",
          "Contenu": "I printed out the how to measure sheet, paid a maintenance contractor to do the measurements ; however two of the 5 screens were too long. He measured so the screens would fit up in the grouve , but the frames are too wide to go in on the two older window frames.  Too complicated, plus expensive for half windows,  so I will not order  any more . Brenda Nix"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "User 450",
          "Nb_Reviews": 3,
          "Date": "2020-03-28T14:24:42.000Z",
          "Titre": "The product is great but.....",
          "Contenu": "The product is great. Even though I agree with the adage “you get what you pay for” the cost is prohibitive for outfitting my entire home and/or ordering one of these for a small window. Also, the ordering system requiring you to pre-pay before seems irregular and probably scares customers off who may think it is a scam. Finally, the ordering process had a glitch and a question to the vendor went unanswered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erik Johnson",
          "Nb_Reviews": 1,
          "Date": "2020-07-19T17:16:16.000Z",
          "Titre": "$35 for shipping of ONE SCREEN",
          "Contenu": "I was ready to order from FlexScreen but I can't justify paying $35 for shipping on one screen. I work a lot with USPS & UPS and there's no way it costs $35 for a single screen.It's a great concept but I just can't see paying that much, going to work with more conventional options."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T16:43:57.000Z",
          "Titre": "Screens came quickly…",
          "Contenu": "Screens came quickly and are good quality. However two of six did not fit, although I measured the same way on all windows."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HJMiller",
          "Nb_Reviews": 5,
          "Date": "2020-02-04T21:01:56.000Z",
          "Titre": "Product seems very good yet pricey",
          "Contenu": "Product seems very good yet pricey. I believe a sub-$50 window price is a better target. I can redo 4-5 window screens for $14 with screen material  from the big box stores. Since it seems the screens are the same type I'd be paying a large premium for the frames which don't go bad that often.Note I have not yet purchased the product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 2,
          "Date": "2020-01-28T21:33:17.000Z",
          "Titre": "I give the product 5 stars but I don't…",
          "Contenu": "I give the product 5 stars but I don't like having to input the size until I have completed the order also, the price is a little steep if buying more than one. Is there any chance of a quantity discount?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T23:07:18.000Z",
          "Titre": "Shipping is outrageous",
          "Contenu": "Fit was perfect. Shipping costs are outrageous. Quality is great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T03:33:44.000Z",
          "Titre": "Unable to make size of windows",
          "Contenu": "Unable to make size of windows. Redid all windows with flexscreen except for 4 windows because they were a couple inches too tall"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle B",
          "Nb_Reviews": 1,
          "Date": "2020-08-15T19:20:29.000Z",
          "Titre": "I think this is a FANTASTIC idea, but....",
          "Contenu": "I think this is a FANTASTIC idea, and I was so excited to install a FlexScreen in a second-story window where I regularly remove an awkward traditional screen to access a window flower box. The product arrived when promised, looks and bends just like the video, and seems to be of high quality. Unfortunately, the large size (height) of my double-hung window and the fact that it only has a single upper track to hold the screen make fitting the FlexScreen securely even more difficult than the traditional screen. There’s just nothing to hold onto, and the FlexScreen has nearly dropped two stories more times than my heart can take. So the FlexScreen is going to live in a box under the house, and I’ll go back to using the awkward traditional screen in my window. I would recommend if you have large windows, especially ones with only single tracks to hold your screens, that you start by ordering one FlexScreen to be sure they work for you since your purchase is not refundable/returnable!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "william rinehart",
          "Nb_Reviews": 6,
          "Date": "2022-11-05T06:06:57.000Z",
          "Titre": "measurements and labeled screens",
          "Contenu": "the screens seem to be good. i just got them.  the 2 things that i think could have been better is they could have the measurement so you just put the actual size in and it calculate the size you need. The consumer should not have to do math.  I don't thing it would be that hard to have a program that did that. Second I got 10 screens and they came in 2 boxes but were not marked the size. and most of the windows were very close in size, It would have helped to have them marked which window they go in."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jimmye Hawkins",
          "Nb_Reviews": 3,
          "Date": "2020-01-29T00:59:35.000Z",
          "Titre": "The company quoted one price when they…",
          "Contenu": "The company quoted one price when they premiered on Shark Tank but by the time I went to the website to order the price had increased 500%! Each screen is $80! That’s pricey for a small screen and to order 25 screens it makes this product too expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T21:21:08.000Z",
          "Titre": "One of my screens came bowed and it is…",
          "Contenu": "One of my screens came bowed and it is bent when I installed it. Now I have it sitting out since it looked horrible. The others fit perfectly!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Kondo",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T20:33:42.000Z",
          "Titre": "Not for my Milgard awning windows",
          "Contenu": "Because where the screen sets in the window is only 1/16\" depressed. There is a gap at the corners. But service is outstanding."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-10-25T18:38:51.000Z",
          "Titre": "Great product, terrible shipping and delivery",
          "Contenu": "The product is great and the ordering process is super well designed but the shipping and delivery is severely lacking."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicholas Bravo",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T21:20:01.000Z",
          "Titre": "The process was quick and easy though",
          "Contenu": "The process was quick and easy though. I didn't have to worry about buying custom screens."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T02:01:05.000Z",
          "Titre": "Ship speed of measurement tool"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raymond Orsi",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T19:23:14.000Z",
          "Titre": "Not quit what I expected and its not so…",
          "Contenu": "Not quit what I expected and its not so flexible like the presentation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thom High",
          "Nb_Reviews": 2,
          "Date": "2020-02-04T20:19:07.000Z",
          "Titre": "Good product",
          "Contenu": "Good product, bad hooks. Did not stick well. Maybe 3M adhesive would work better, that’s what I used."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 2,
          "Date": "2020-01-28T21:52:58.000Z",
          "Titre": "What is measured and what is made…",
          "Contenu": "What is measured and what is made including recess is not the same"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 4,
          "Date": "2020-01-28T20:15:34.000Z",
          "Titre": "Looks awesome but expensive",
          "Contenu": "Looks awesome, just a little too expensive for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RAnderson",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T23:42:45.000Z",
          "Titre": "I love the idea of the Flexscreens and…",
          "Contenu": "I love the idea of the Flexscreens and they likely work great for those who have pockets for the screens. I didn't and I also have wood frames.I think because I have wood frames it made measuring more difficult. Even though I checked my measurements multiple times when the screens arrived only 2 of the 4 fit.  I used the bumpers but that left small spaces for smaller bugs to get inside."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T15:35:21.000Z",
          "Titre": "Extra shipping charges :(",
          "Contenu": "Specifically ordered enough screens to qualify for free shipping only to be slapped with an extra shipping fee of $200 because they were oversized screens. No where did it mention an additional fee for oversized screens or what that oversize was."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward Buck",
          "Nb_Reviews": 2,
          "Date": "2022-05-17T19:15:56.000Z",
          "Titre": "Tried but Did not Like",
          "Contenu": "Box came damaged and tape coming off all sides but the screen was okay.  I do not have a channel for the screen to fit in and so using the rubber tabs that were included and I was able to get the screen seated.  But in doing so the rubber tabs change the height which causes the screen to bow in the middle such that there is a gap between the screen and the window edge.I ordered one screen to test it out to see if I could use it on all my 2nd story windows.  At this time I don't think that I can use them since the screens bows out slightly but the gap is large enough for bugs and flys to get in the house."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debbie Trussel",
          "Nb_Reviews": 4,
          "Date": "2022-01-07T14:40:53.000Z",
          "Titre": "Three out of four worked great",
          "Contenu": "I think I would probably give at least 4 stars but I reached out via email that one of my screens does not fit, is too big. I bought 4. Tried to be as precise as I could with the measurements. 3 screens work pretty well but not sure why the 4th one is so big? I know there is no refund but thought when I contacted FlexScreen someone would get back to me to see what can be done. Just beware & be very, very, careful with measurements & double check. No refunds!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Palmer",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T18:07:18.077Z",
          "Titre": "Disappointed",
          "Contenu": "Although very prompt, the tool you provided to measure was flimsy in the middle where it screws together, this must have created a slight bow.  This added to the measurement and the screens don’t fit properly bow out creating open spaces on the sides."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kai",
          "Nb_Reviews": 1,
          "Date": "2021-09-24T23:09:23.000Z",
          "Titre": "Poor visibility even with FlexScreen Clean",
          "Contenu": "I purchased FlexScreen Clean which is advertised to give superior visibility. However, they still tend to be thicker and block more view than a lot of the conventional screens I used. Given it's easy to put on and at the very least keeps all the bugs out, I'd give it a 3."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen Palazzolo",
          "Nb_Reviews": 1,
          "Date": "2021-08-24T13:27:07.000Z",
          "Titre": "Wanted to leave a 5 star response",
          "Contenu": "Wanted to leave a 5 star response. A little disappointed. I actually waited for your measuring tool, which made it easier, before I submitted my measurements. I then very methodically measured 6 Windows.  None of the windows fit flush. I had to use the included rubber bumpers to tighten the fit. I like the quality and clarity of the screens. But we live in a very windy area, so a flush, tight fit is necessary to avoid rattling. I have many more windows in my house. I like the concept of your screens. But I have reservations on ordering any more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen S",
          "Nb_Reviews": 2,
          "Date": "2021-10-19T12:30:23.000Z",
          "Titre": "I ordered 4 screens none fit right",
          "Contenu": "I ordered 4 screens, each labeled (in the ordering process) however the the screens were not labeled when they arrived. There is a gap with each screen, as they were smaller than ordered which will let in bugs.They were easy ro put in, but the fit is not correct."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Schrader",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T17:34:37.000Z",
          "Titre": "I ordered 2 Flexscreens",
          "Contenu": "I ordered 2 Flexscreens. The first one came within a couple of weeks and was absolutely fine. It was as advertised. The second screen was ordered in February 2021. I was sent the wrong size as confirmed by the measurements that I sent and the mis-measured windows that I got. I called customer service and was promised the correct size screen. That was in February. The correct screen came in May. That is not a spelling mistake. It was May. That also was after numerous phone calls and emails. That pretty much explains my 3 star rating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald Keeslar",
          "Nb_Reviews": 7,
          "Date": "2022-03-23T17:02:31.000Z",
          "Titre": "Measure very carefully",
          "Contenu": "Well I got my screens but so far I have only installed one and that one fit extremely tight and even has a little wrinkle to it but not really noticeable. I thought I measured quite accurately. But maybe not. Anyway even though I anticipated using the bumpers as my slots are only 1/4\" wide, I was not able to use them in this first window,  but the screen will stay put the way it is, just wonder about how much I should subtract on the other 11 windows I still have to do. I think my windows are a little strange maybe. I will call and discuss my issue before my next order if I decide to stick with flex screen.  Will have to see how the other 5 fit. As far as durability,  only time can answer that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T14:01:26.000Z",
          "Titre": "good screen, packing issues",
          "Contenu": "I loved the screen but had some issues. I used the FLEX-tenna to measure and my screen fits. however the frame was cracked when it arrived. I had read other's reviews that said there isn't much the company will do for that issue. I was able to get the frame realigned and get it to fit snugly in the window. But I cannot remove the screen without causing more damage. I'd suggest packaging large screens better. It was basically just a piece of cardboard folded around the screen. if there was a bit more padding I think it would have been safe. maybe some styrofoam around the edge of the frame."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan Kelly",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T12:32:50.000Z",
          "Titre": "One of the 4 screens has loose screen.",
          "Contenu": "I do like the flex screen and they were easy to install. HOWEVER, one of the screens was not made flat and there is a looseness of the screen. I may call to see if this can be replaced. I think that it should."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah S.",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T20:05:21.000Z",
          "Titre": "Screen material is loose and not a great fit",
          "Contenu": "When I first placed the order for my FlexScreen, I was under the impression I would be getting the screen delivered. However, the first shipment I waited for was only for the measuring tool. I understand why this is important, but I didn't expect there to be two steps to the process - I wish that was more thoroughly described when you place the order. Despite using the measuring tool, the frame came in slightly too narrow. Thankfully it still fit because the height was perfect, but the screen material itself is also a bit loose, which means if you press on it at all, the sides of the screen pop out of the window frame. I suppose this is still easier than trying to create a screen yourself, but I am a bit disappointed for the amount of money I paid for this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Lee",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T17:56:35.000Z",
          "Titre": "Using the flextenna and the suggestions…",
          "Contenu": "Using the flextenna and the suggestions on measurement was easy but the screen thaty was sen was a biy small for our space. am going to have to use weather stripping to prop in the screen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T17:14:53.000Z",
          "Titre": "Average screen",
          "Contenu": "Measurements are very specific to fit actual window. Ours did not fit, customer service did help us resolve issue and ship new ones for an additional cost. The quality of the screen is very average."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike M",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T15:07:13.000Z",
          "Titre": "Be prepared to pay and wait",
          "Contenu": "I still HAVEN'T received my screens!They make you pay up front for the product and shipping and it’s been weeks and I still haven’t received my screens! Just find a local contractor to help you, it’s probably about the same price and you actually get what you pay for.UPDATE We received our screens roughly 4/5 weeks after paying for them. The turn around time was less than ideal but the product itself is great. If you need something quick this isn’t the bear option (we had a broken screen hence the order and hence the frustration.) We could have gotten something cheaper and quicker from a local contractor.  I’m updating this from a one star to three. If I could get the screens in a timely manner it would be 5 stars but have to pay for screens up front and wait so long was inconvenient."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Prochnau",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T22:03:54.000Z",
          "Titre": "Follow-up. Customer service did an excellent job",
          "Contenu": "Customer service did an excellent job. But I have to admit that the measuring process was difficult, we  followed the instructions, both orders were incorrectly measured. We were provided a measuring device after we placed both orders. Unfortunately both orders cost us hundreds of dollars and now we're stuck with two orders of screens that don't fit. Great idea, a great product, great customer service, But the measuring and ordering can definitely be improved in some way to make it easier for the customer. Follow-up, Unfortunately, the measuring tool was not provided or wasn't available when we made our purchase(s). All we found, at that time, was instructions on the Flexscreen web site. We ordered the tool when we placed our second order. Having that tool would have saved us hundreds of dollars...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nanci Crisp",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T21:29:45.000Z",
          "Titre": "I won't be ordering again",
          "Contenu": "The screens are constructed well and are easy to install. I very much like how clear they seem.I did not like the ordering process of paying first, just doesn't instill a sense of trust. But the pricing is certainly competitive.The measuring process is ridiculous, I don't know why you can't just measure your current screen; and if you get it wrong they do not accept returns. In my case, I forgot to take off a bit on just one side to account for the windows that are no longer perfectly square. I'm left with screens that are slightly too big on one side which means it has a gap where it should sit in the track. I should've just measured the old screen.I like the easy installation but that doesn't outweigh the issues described above. I will not be ordering from this company again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Helmick",
          "Nb_Reviews": 2,
          "Date": "2022-02-01T18:12:34.000Z",
          "Titre": "This appears to be a great product",
          "Contenu": "This appears to be a great product, but not tight around the edges for taller screens. We'll wait and see if it can withstand winds without blowing out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 2,
          "Date": "2021-06-04T19:28:03.000Z",
          "Titre": "Flexscreen is a nice product.",
          "Contenu": "Flexscreen is a nice product.To make it the best, offer it in white as well as black.Most important I know this is difficult, but for the price it needs to be repairable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Mook",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T02:31:48.108Z",
          "Titre": "I need a video on how to install in a…",
          "Contenu": "I need a video on how to install in a pocket-less window.  I can get them to stay in.  I get one corner in and another one pops out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Foltzer",
          "Nb_Reviews": 2,
          "Date": "2021-06-04T20:37:30.000Z",
          "Titre": "Poor communication",
          "Contenu": "Poor communication, high shipping costs for larger pieces, website interface very clunky. For a normal, small window, one screen at a time, it’s fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy Allen",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T11:47:04.000Z",
          "Titre": "Window sceens",
          "Contenu": "I bought 8 solar sceens"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ric",
          "Nb_Reviews": 4,
          "Date": "2020-01-29T00:09:07.000Z",
          "Titre": "WAY too expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Davidson",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T19:21:30.000Z",
          "Titre": "Great idea and protect",
          "Contenu": "Great idea and protect, very price"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nathan Toldt",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T02:26:47.000Z",
          "Titre": "Good product but beware of $150 oversize shipping fee!!!",
          "Contenu": "The Flexscreen product seems well made and Im happy with it so far.  The only reason I am giving 3 stars is due to the outrageous shipping fee that I was charged. The Flexscreen website advertises free shipping.  I ordered 7 screens and at the time of ordering there is a small disclaimer that some orders may have an oversize shipping fee. But there is no indication of how much that fee might be or what dimensions incur oversize fees.  So I paid for my order in full and then submitted my measurements right after.  Again there was nothing that indicated that my specific order had oversize fees.   2 weeks later… I get an email saying that owe another $150 for shipping because my screens were deemed oversize!!  I contacted support to reduce this fee and they said I had to pay it or cancel my order which I had already waited 2 weeks for.   This was a really poor customer experience. Why not tell customers up front about these shipping fees at the time of placing the order?  So for anyone considering buying Flexscreens beware that if your screens are anything but small you might be charged with $150 shipping fee 2 weeks later."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Not Satisfied",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T23:51:03.000Z",
          "Titre": "Still Waiting for Delivery",
          "Contenu": "The product ordered is late being delivered and we are still waiting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Powers",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T09:36:47.000Z",
          "Titre": "I didn’t receive the bumpers",
          "Contenu": "I didn’t receive the bumpers, how do I get them?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JASON HALDEMAN",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T12:11:45.000Z",
          "Titre": "they are bowing in the middle"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phil",
          "Nb_Reviews": 4,
          "Date": "2020-02-04T20:52:11.000Z",
          "Titre": "nothing that impressive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AF",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T20:51:24.000Z",
          "Titre": "Overall great product (but not perfect)",
          "Contenu": "Great screen that fit perfectly. I wished the net was more under tension."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dawn Evennou",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T18:50:26.000Z",
          "Titre": "It's a nice product",
          "Contenu": "It's a nice product. Easy to install, but they do not fit perfectly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jose Palafox",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T18:51:00.000Z",
          "Titre": "The product is fantastic",
          "Contenu": "The product is fantastic. One of my screens looks like its pulling out of the corner of the frame I sent a picture of it earlier and would like support for it, but wow I'm super impressed with how perfectly they fit and how well they work!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tobi",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:04:44.000Z",
          "Titre": "Fit very nicely, but ...",
          "Contenu": "Love how these fit so nicely.  Four stars because they really look shabby around the edges.  The screens are raggedly sticking out from the frame.  Luckily, this is not seen when the screens are in place.  I have channels the screens fit into."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T17:39:29.000Z",
          "Titre": "Good product",
          "Contenu": "Good sturdy product, fast turnaround.Friendly & helpful customer service team.Looses a star for only taking measurements in inches & fractions of an inch, as oppose to millimetres."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JW",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T17:47:40.000Z",
          "Titre": "The screen measuring input screens are…",
          "Contenu": "The screen measuring input screens are not user-friendly.  When trying to copy the same measurements from one to the next, resulted in changing the dimensions.  Also, there should be a way to directly input the dimensions you want your screen to be, based on the company's recommended gaps."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy Robbins",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T23:58:34.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, I was concerned about paying for something before actually ordering it. Did so research and found your company to be legitimate.  Great product we’ll see how long they last. Can you do anything on pricing? Almost want to put new screen in the old frames. Lol."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim Carreau",
          "Nb_Reviews": 3,
          "Date": "2023-05-02T23:47:04.000Z",
          "Titre": "Up front payment turn off…",
          "Contenu": "Having to pay a flat rate up front regardless of screen size is a turn off. Customers would be much happier if they only pay for flextenna up front then pay set pricing dependent on actual screen size. Screens work great though but are very pricey."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Penelope Miller",
          "Nb_Reviews": 3,
          "Date": "2023-08-05T17:32:29.000Z",
          "Titre": "The screens arrived when promised",
          "Contenu": "The screens arrived when promised. They are easy to install and do the job.I had to remind the company to send the Flex Tool after waiting over a week for it.The tool was easy to use and when I called the company for additional measuring instructions I was given the correct information to accurately measure my windows."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vivian Sauter",
          "Nb_Reviews": 3,
          "Date": "2023-04-30T23:02:21.000Z",
          "Titre": "Good Product",
          "Contenu": "The process of measuring and ordering was great! We followed the instructions to a T. Upon delivery, we were concerned because the shipping box was a bit beat up - but, the screen looked fine. Placing it in the window was easy peasy, but we were  a bit dismayed that it isn't a perfect fit. it doesn't have the tightest fit in the lower corners. It'll work fine enough, and we are satisfied with the quality. We believe that when following the directions to subtract according to the chart given, that is why it isn't the perfect fit. All in all - a good product!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary McCoy",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T21:03:55.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "We worked with Mike in customer service. He made it very easy to place the order and to report our measurements. We did disagree, however, with FlexScreen's instructions to take accurate measurements then subtract 3/16\" from those measurements. Those instructions result in a very loose fitting screen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christine Fekete",
          "Nb_Reviews": 3,
          "Date": "2022-12-28T17:14:31.000Z",
          "Titre": "Nice screens",
          "Contenu": "I am very happy with my screens, they were easy to install.Only gave 4 stars as: The ordering process had me a little confused, but that was probably my fault.  I didn't realize that I would be charged when I placed the order without giving my measurements, as I was planning to wait until after the holidays to actually order them as I didn't want them to get ruined during the Holiday rush.  But to my surprise they all made it successfully. Nice screens."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Matthew",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T22:34:16.000Z",
          "Titre": "The whole process seemed very lengthy",
          "Contenu": "The whole process seemed very complicated and EXPENSIVE.  For the price we paid, it seemed to talk a long time, I think it was like 1M end to end, which given paying $35 in shipping seems much too long.Given there are other products on the market, maybe not as good but at a fraction of the price, might try them next time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Meyer",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T01:37:52.000Z",
          "Titre": "Great product but measuring is tricky…",
          "Contenu": "Great product but measuring is tricky for old house with windows out of square. Directions didn’t account for this issue and made fit less than ideal and harder to install"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Westmark",
          "Nb_Reviews": 3,
          "Date": "2023-11-19T21:48:53.000Z",
          "Titre": "Glad they have a flexible screen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Les G.",
          "Nb_Reviews": 1,
          "Date": "2020-03-01T17:55:52.000Z",
          "Titre": "Sorry it took so long for the review…",
          "Contenu": "Sorry it took so long for the review but it was too windy to attempt installation until today. To my great relief and somewhat surprise, both screens fit perfectly. I was nervous but used the old adage - measure twice, cut once - except I measured at least 3 times. They fit perfectly, look almost invisible and are a great solution. I'll order the rest for the bedroom windows in the next week or so. Thanks much for  great job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron Crosby",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T16:35:56.000Z",
          "Titre": "Order process and easy installation…",
          "Contenu": "Order process and easy installation were great!To improve:1. Price point is high, 2x or maybe even 3x that of a conventional screen.2. The screens don’t have great tension. Little waves appear if looking at an angle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Billy Gibson",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T22:49:05.000Z",
          "Titre": "Easy purchase",
          "Contenu": "Easy purchase Good instructions on measurements with adequate warnings.Received mine- they fit well and snug. They are flexible as marketed but not as durable as I expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T19:51:14.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, but too pricey for new construction market. We use in replacement windows only and especially when special colors are offered, eliminating the need to match the screen frame with the window color. Figure out a way to reduce the cost to manufacture and you have a grand slam!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T03:00:11.000Z",
          "Titre": "Great Overall Value",
          "Contenu": "Overall, these screens are high-quality, easy to install, and fairly priced. The only drawback is that they sag slightly along the top crossbar for very wide windows (50in+)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2020-01-28T21:47:13.000Z",
          "Titre": "Love the screens",
          "Contenu": "Love the screens, but your measuring instructions need to be a bit better.  All 3 screens came in about an 1/8\" short on all sides, luckily the stick on foam you send was enough to make up that difference."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Neil Tullis",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T19:34:48.000Z",
          "Titre": "I'm happy with the screen and the…",
          "Contenu": "I'm happy with the screen and the contacts I spoken to at FlexScreen.  I purchased two screens and one was just a little too big, but I blame that on the fact I had to measure from inside the house rather than climbing a ladder and doing it from the outside.  I blame it on me not FlexScreen.  The other one fit perfectly.  I would buy screens from FlexScreen again, but would measure it properly from the outside nexttime."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wolf Windows",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T19:55:35.000Z",
          "Titre": "We and our customers love the screens!",
          "Contenu": "We and our customers love the screens!The only thing that keeps me from giving you a 5-star is the labeling system.I would like each screen to reflect the label/customer name in order to make sorting them out easier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DL in Texas",
          "Nb_Reviews": 1,
          "Date": "2022-06-12T14:06:17.000Z",
          "Titre": "Pet Durable With Fresh Air on the Side",
          "Contenu": "I am enjoying my new FlexScreen® Window Screens. I purchased 4 x Standard Window Screens for two bedrooms and 7 x FlexView Tuff Window Screens for rooms that my rambunctious pets frequent. They know what a screen is but, when they see an occasional squirrel, lizard or other critter through the window they just have to go check it out. Sometimes that's straight through an open window. My expectation is the Tuff screen and frame will withstand their excitement. I like the idea of the durable screens, and the frames fit perfectly based on the measurements I supplied (I was a bit nervous about providing the correct measurements). I thought the ordering process was unusual. I had to pay in advance for the type and number of screens I wanted to purchase before the website advanced to providing measurements for each screen I just purchased. I also thought the price per screen was a bit over premium but, was willing to pay the price with the assumption the screens would hold up over time. I give the screens 5 stars 🌟🌟🌟🌟🌟 and the price 4 stars 🌟🌟🌟🌟."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T20:25:09.000Z",
          "Titre": "The screens look great but they were a…",
          "Contenu": "The screens look great but they were a little off on the height.  The width was perfect but somehow the height was off by 1/4 inch.  I measured 3 times about took off 1/8 inch as directed because I had one channel at the top.  I used the measuring tool provided but somehow still off."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 2,
          "Date": "2020-01-28T20:10:53.000Z",
          "Titre": "It has been a good while since my last…",
          "Contenu": "It has been a good while since my last and first purchase. At the time I was pleased with the purchasing process. The delivery of the screens went well. I am looking forward to my next oder.  As a reseller the experience and process I am certain will become even better."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Galligan",
          "Nb_Reviews": 2,
          "Date": "2020-05-17T19:10:40.000Z",
          "Titre": "The product was great but the…",
          "Contenu": "The product was great but the instructions on measuring for size left a lot to be desired.  These instructions were very confusing and my measurements were a little off from what I needed - no second chances!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shadoe Miller",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T14:45:35.000Z",
          "Titre": "4 of the 6 screens fit perfect not sure…",
          "Contenu": "4 of the 6 screens fit perfect not sure why but the two bathroom window screens were nearly too big and I measured them the same as the others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave WALLER",
          "Nb_Reviews": 2,
          "Date": "2020-02-06T01:39:13.000Z",
          "Titre": "love the product!",
          "Contenu": "love the product!; However online buying experience was crude/strange, didn't seem fully baked.  My Flexscreen arrived faster than expected (Sunday delivery)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Armellino",
          "Nb_Reviews": 3,
          "Date": "2022-06-11T11:15:33.000Z",
          "Titre": "Improve FlexScreen Ordering Process",
          "Contenu": "In order to simplify the FlexScreen ordering process the website, package tracking process, and warranty registration actually feel clunky, kind of like a recipe missing a few steps making one wonder how it will all turn out.  Bottom line, you have a great product so take the next step of improving the ordering process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adrian Ciolko",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T19:14:03.000Z",
          "Titre": "Great Window Fit",
          "Contenu": "Screen fit is very accurate! Follow the Flex Screen instructions carefully and seek assistance when necessary."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne Grossman",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T20:25:53.000Z",
          "Titre": "Is not flexible as much as I thought it…",
          "Contenu": "Is not flexible as much as I thought it would be but does flex. As such it was not as easy to get in as I hoped but seems to be a very durable product. With quality & look, I’m not sorry I purchased."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray Scholes",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T23:41:54.000Z",
          "Titre": "Great screen but not cheap.I would have rated the screen a 5 but…",
          "Contenu": "I would have rated the screen a 5 but felt the cost was awfully high for a small screen like mine. Maybe a 2 or 3 tier pricing model?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "T.M",
          "Nb_Reviews": 8,
          "Date": "2023-03-10T05:25:08.000Z",
          "Titre": "High quality screen products only one…",
          "Contenu": "High quality screen products only one problem 2 screens are a little short in height."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FlexScreen Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T21:01:07.000Z",
          "Titre": "Good concept and performance",
          "Contenu": "Good concept and performance, a little pricey for some applications"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawrence",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T19:02:46.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, great response time. My only negative? A bit \"pricey!\""
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2023-04-10T23:18:46.000Z",
          "Titre": "Quick fulfillment",
          "Contenu": "Quick fulfillment, nice fit...we'll see how they last"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Hottel",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T20:34:44.000Z",
          "Titre": "We like it a lot but it fell out the…",
          "Contenu": "We like it a lot but it fell out the 2nd day when we weren’t home so now we put 4 of the rubber stops in . Just waiting for a windy day with the windows open to see if it stays. Looks nice and easy to install. I saw you on Shark Tank great presentation they should have supported you but they couldn’t get a good return since they seems to be quality and not junk that breaks and you have to replace often. Good luck !!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zack Zalewski",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T21:16:52.430Z",
          "Titre": "The screens are great",
          "Contenu": "The screens are great! It is simple to measure and if you do it right they will be good. The only issue is the packaging! It needs to be more sturdy and have down or something to protect the screens. One screen had a rip in it and I already heard the customer service isn’t so good so I not going to worry about it. But the packaging needs to be updated with some foam"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yoram",
          "Nb_Reviews": 2,
          "Date": "2022-03-15T16:33:29.000Z",
          "Titre": "The screens are awesome",
          "Contenu": "The screens are awesome!  Overall it was an easy process to order, wait for the measurement tool, submit the measurements and install the new screens.  One star down due to the measurement site being down and the fact that no one answered their customer service phone.  Did receive an email after a day that allowed me to submit my measurements.Overall highly recommended."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOHN GOTH",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T02:49:26.000Z",
          "Titre": "good product",
          "Contenu": "i liked the screens. but i think were way over priced. i bet a good 50.00 profit on every screen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HappyCitizen",
          "Nb_Reviews": 2,
          "Date": "2021-11-09T17:37:58.000Z",
          "Titre": "The entire process was easy and…",
          "Contenu": "The entire process was easy and explained in detail.  The quality of the products exceeded my expectation.  The only reason I didn't give 5 stars was the difficulty in getting accurate measurements.  Using the measuring tool provided, and taking three (3) separate measurements for both height and width, I still came out about 2 mm wide."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karl Ubellacker",
          "Nb_Reviews": 1,
          "Date": "2021-10-20T14:26:16.000Z",
          "Titre": "Measuring 150 year old Victorian…",
          "Contenu": "Measuring 150 year old Victorian windows is tough!  Even with the guides, I still feel like I could have went 1/8th inch less on top and bottom.  The good thing is the screens are flexible so they are working.  Just not the perfect fit I hoped for, but after some window repairs (i.e. removing 150 years of paint build up) I think they will be perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chrys  Leonard",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T14:15:23.000Z",
          "Titre": "My only complaint was the length of…",
          "Contenu": "My only complaint was the length of time receiving the screens.  I had to email the company to ask why I had never received them.  Their response was immediate and I received the screens within 2 weeks of asking.   I am very pleased with the screens- they were easy to install by myself ( 70 and female ). I have deleted my emails but think I waited about 2 months instead of 2 weeks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yvette R",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T23:59:17.000Z",
          "Titre": "The screens fit great and were shipped…",
          "Contenu": "The screens fit great and were shipped extremely quickly once they were ordered.My only criticism is the ordering process. Once I had indicated how many screens I wanted and paid I thought an email response would be imidate on the sizes. I'm not sure what the problem was but I was not contacted until later. The email went to another filter of promotions when it did come, not your fault, but then it went unnoticed by me for quite awhile and I thought I had been scammed by a fake site. I had in that meantime sent an email to customer service and was not responded to by Flexscreen.All my other orders have gone through Home Depot without a problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T23:11:54.000Z",
          "Titre": "good, but not perfect",
          "Contenu": "I love the product and they fit perfectly.  The only problem is that some of the coating on the metal frame was chipped and one was even a little rusty.  I don't think the chips and rust will be a problem in the long run... just don't like seeing it on something I bought brand new."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Vandal",
          "Nb_Reviews": 3,
          "Date": "2021-08-08T00:31:00.000Z",
          "Titre": "I am overall pleased.",
          "Contenu": "I'd probably would still be waiting for for my screens if I hadn't called to find out the status of my order. In any case the screens did arrive and I was quite pleased with them. One screen was about 5/16 inch short. I made it work. Another screen had a minor tear in a corner. And a larger screen (54 inches wide) which had the right dimensions would \"hour glass\" so that there was a gap between the screen and the frame. I am disappointed about the \"hour glassing\"  but am overall pleased with Flexscreen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darcy",
          "Nb_Reviews": 3,
          "Date": "2021-12-01T05:02:46.000Z",
          "Titre": "3 out 4 screens for this order were…",
          "Contenu": "3 out 4 screens for this order were 'spot on accurate'. The 4th was cut to short length wise and as a result of this problem it falls out of the window that it was intended for. Otherwise, I am happy with the quality of these screens.Regards, TLG."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Ashman",
          "Nb_Reviews": 1,
          "Date": "2021-08-20T14:01:55.000Z",
          "Titre": "Very pleased with the end result",
          "Contenu": "Very pleased with the end result. Great quality product. The process of measuring is a bit fiddly. Wish the tool used to measure had a locking component. Had to measure a number of times because I was worried it had slid a half inch or something. Would (and have) recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 2,
          "Date": "2022-04-05T20:26:46.000Z",
          "Titre": "FlexScreen was easy to order and install but needs better markings",
          "Contenu": "FlexScreen was easy to measure and send in the order. W bought ten replacement screens for our screen room. Most of the screens fit well, though some of our window frames were a little un-square. I did not give FlexScreen five stars because when the screens arrived they were not visibly or easily matched the individual screens within the order. I had to go back to customer service to find out that the screen had etching on the side frame with information, though that was hard to read. I ended up just measuring the screens to determine which window opening they matched up to. It would be better if the window screens had \"tags\" on them that matched up the screen to what was enetred on the website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brittany Moser",
          "Nb_Reviews": 2,
          "Date": "2021-11-03T16:42:36.000Z",
          "Titre": "Great screens not so great measuring instructions",
          "Contenu": "The screens themselves seem great. I got the flex clear and they are nearly invisible. Really easy installation and removal. Will make keeping the windows clean a much easier task. Would be 5 stars except in the instructions for measuring they tell you to remove 3/16” (I think that was the amount but whatever it was was the length I removed). However all of my screens were then about 3/16” too small. Had to use the included bumpers. And even with those the screens don’t fit as snugly as I would like. Wish I had just submitted my actual measurements. But with the bumpers they work well enough and overall I would buy again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Fay",
          "Nb_Reviews": 1,
          "Date": "2021-06-07T20:20:47.000Z",
          "Titre": "I really like my flexscreens and have…",
          "Contenu": "I really like my flexscreens and have them all installed.  I did have some trouble with a couple of the measurements where the sides weren't completely parallel and there was a gap, I ended up putting some weather stripping on the edge to seal up the gap."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maureen Adams",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T20:41:51.000Z",
          "Titre": "Overall we love the screen, but",
          "Contenu": "Overall we love the screen.  We did not receive 8 bumpers, I went to the web site to see if we could get 4 more bumpers or buy more bumpers, it has been a couple of weeks and I still have not heard anything or any acknowledgment that they received my request."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy Friedman",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T03:38:14.000Z",
          "Titre": "The measuring was alittle tricky",
          "Contenu": "The measuring was alittle tricky, they seam to fit good. But I found the screen a little loose not tuant. And this may have something to do with the type of screen not sure they are."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed Nichols",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T14:43:21.000Z",
          "Titre": "Great product but took longer to get…",
          "Contenu": "Great product but took longer to get than advertised.I did receive my product fairly quickly when I called and reported that I had not gotten shipment on time as advertised----screens are a great alternative to ordinary rigid frame screens."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron Franklin",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T14:36:55.000Z",
          "Titre": "Flex screen was good using FedEx not so…",
          "Contenu": "Flex screen was good using FedEx not so delayed 2 times then said it would be delivered on a Monday came Sunday while we were gone have to watch for porch pirates"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Danihel",
          "Nb_Reviews": 1,
          "Date": "2021-08-05T12:29:10.000Z",
          "Titre": "The measuring guide tool is not…",
          "Contenu": "The measuring guide tool is not entirely accurate. Following the video of using cardboard boxes sounded like a good idea but the screen looks so unfortunately a little too long and goes beyond the window screen frame."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 5,
          "Date": "2021-09-21T18:09:46.000Z",
          "Titre": "Ordered 13 screens.",
          "Contenu": "Ordered 13 screens.4 were off just a bit?Measured multiple times.2 are real tight and 2 are loose.Other than that the rest fit fine and was easy to do. Would probably order again…not sure?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian W",
          "Nb_Reviews": 4,
          "Date": "2021-09-21T13:10:43.000Z",
          "Titre": "Great screens! Delivery a little slow",
          "Contenu": "The screens are great! I received them at the end of the estimated window and without the bumpers. An easy call to the company and I received the bumpers in the mail a couple of days later."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindy Owen",
          "Nb_Reviews": 2,
          "Date": "2021-10-27T12:29:53.000Z",
          "Titre": "Screen fits perfectly and easy to…",
          "Contenu": "Screen fits perfectly and easy to install. Only problem was, when received, a 3-inch section where the screen material had separated from the metal frame. Fixed with duct tape."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy S",
          "Nb_Reviews": 1,
          "Date": "2021-09-29T17:07:47.000Z",
          "Titre": "Great Product, Delayed Delivery",
          "Contenu": "Product itself is exactly as advertised--amazingly easy to install and I like the quality of the product (keep in mind that I have never ordered a new window screen in my life.)  There are a couple of small areas on the screen where something went wrong with the paint on the screen--but the screen is going up on a window usually viewed from several feet away so it was not noticeable enough to request a replacement screen.I subtracted one star because it took five weeks for the arrival of the screen.  If there was going to be a delay (I was given an estimate of 1.5 - 2 weeks after submitting measurements), it would have been so helpful if FlexScreen notified me of the delay.  In the end, I had to reach out to FlexScreen around week 4 to find out what happened to my screen.  At that point, it hadn't even left their facility."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed H. Seattle",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T21:49:52.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Great value. Works exactly as described (and seen on Shark Tank.) Only criticisms: the complicated measuring process and the extended delivery time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia Fisher",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T19:13:41.000Z",
          "Titre": "Love the quality of the screens",
          "Contenu": "Love the quality of the screens. Personally I had a issue measuring as my windows are a wacky size. The measuring tool was very helpful!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2022-03-15T17:59:50.000Z",
          "Titre": "Good product, but expensive.",
          "Contenu": "Love the products, easy to get correct measurements. Works as good as expensive. Excessively expensive in my opinion, especially the shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph W Nobbe",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T20:36:08.000Z",
          "Titre": "Measuring guide needs to be simpler",
          "Contenu": "Measuring guide needs to be simpler. Have two screens out of twelve that ended up on the snug side as the frames us slightly different."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick Choinski",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T13:50:30.000Z",
          "Titre": "Very good quality",
          "Contenu": "Very good quality! Fast delivery. I think there are more of these screens in our future. GOOD IDEA"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Howard Artrip",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T16:53:42.000Z",
          "Titre": "Everything was good",
          "Contenu": "Everything was good, just took longer than expected to receive measuring tool"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel D Morgan Ii",
          "Nb_Reviews": 8,
          "Date": "2021-08-18T13:24:01.000Z",
          "Titre": "Product is high quality and performance…",
          "Contenu": "Product is high quality and performance is great.  We could not be happier with it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2021-06-04T17:15:15.000Z",
          "Titre": "Forget trying to talk to someone if you have a question or problem",
          "Contenu": "I like the product, but was unable to talk to customer service with a question."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mona Kornberg",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T17:37:32.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good, we shall see!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gman",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T18:03:00.192Z",
          "Titre": "Overall, a good experience",
          "Contenu": "Order fulfillment was good as was the packing of the goods"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T01:39:55.000Z",
          "Titre": "How much will you pay me to write a review?   You know I paid a lot",
          "Contenu": "Sure my hourly rate is….."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NENA BILITER",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T18:15:10.000Z",
          "Titre": "I love them but need to explain…",
          "Contenu": "I love them but need to explain measuring better"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Braun",
          "Nb_Reviews": 1,
          "Date": "2022-06-11T01:52:14.000Z",
          "Titre": "Good product",
          "Contenu": "Good product. Is as advertised."
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "Tammy Swart",
          "Nb_Reviews": 2,
          "Date": "2021-11-19T10:04:32.000Z",
          "Titre": "Mostly Happy",
          "Contenu": "Much of my reason for the four stars instead of 5 is because the company would not ship to my home in Puerto Rico.  I had to have them shipped to my daughter in Florida, and then I paid for the shipping from there.  SO MANY vendors ship here, I just can't understand why some still do not. The screens themselves seem to be good.  They are flexible, which is the primary reason I needed them.  I did not test how durable they are, fearing that they would not be durable enough, so in that, I can not advise.  The screen material seems to be fused to the frame.  There are spots where the screen material is hanging off after being fused, and I hope that does not provide a snag that will cause the screen material to be pulled from the frame.  I was very careful not to pull those tabs.I purchased 5 of the FlexView Solar, and two of the Flexview Clean. I had asked the question \"Does the hydrophobic water repelling coating keep rain from coming through the screen?\".  The answer was that if any of the screens could do that, this would be the correct choice.  After installing the screens, I find that water is not repelled by the screen.  It still comes in.  I have not had rain on the other screens, but the water repelling screens allow rain to hit the glass, where it seems to remain far longer than glass with no screen.  A minor annoyance, until the water dries. My final comment would be about the price structure.  I am sure that people who need full height screens to cover both upper and lower windows, are very happy.  However, for those of us who only need half a screen to cover the lower window only, we are not so happy with the price.  It would be nice if there were different prices for smaller screens.The reason I purchased these screens was that they were my only choice.  I had installation of roll-down storm shutters (Puerto Rico) and they left absolutely no room to remove the original screens for cleaning without bending the frame.  I am happy to have these screens available and love how they do not obstruct the view.  I hope that they hold up to many years of trouble free use. Shipping was fast and the screens fit perfectly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KA",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T22:06:55.000Z",
          "Titre": "Good product but pricey"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen J.",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T14:39:54.000Z",
          "Titre": "Six Star…",
          "Contenu": "I liked all the amenities connected with this company from start to finish. When a business is rated a five star, they are the best. So, by giving them a six star means that they go above and beyond expectations. ******"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PHILIP ROBINSON",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T23:53:42.000Z",
          "Titre": "Had great experience with flex screen",
          "Contenu": "Had great experience with flex screen. Ordered the flex view clean. Wify is happy with the look of the screens and view from inside the house looking outside. They were so easy to pop in. I received my flextenna for measuring on aFriday morning and had my 10 windows measured and order completed by late Friday afternoon. Once submitted said I would receive in 10-15 working days but holy cow I received my 10 screens the following Wednesday just 5 days later counting the weekend. Everything came as ordered and clearly marked on each screen which window they went in. Couldn't have been easier.Before ordering I had contacted flex screen by email with questions on 2 different occasions and Mike was quick to respond each time with my questions clearly answered so customers service seems on the ball ,also. Measure carefully and follow flex screen's instructions and screens should pop right into place as shown on videos. Do not measure your old screens or you will  have problems. Can't speak to longevity since I have had less than a week but should hold up for years to come."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Norton",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T02:36:26.000Z",
          "Titre": "I must say that I was extremely happy…",
          "Contenu": "I must say that I was extremely happy and impressed with the entire experience. I forget the gentleman’s name but I initially had a problem ordering on line. It was a Sunday and I knew no one was in the office so I emailed my issue and a gentleman called me first thing Monday morning and I was able to order my screens. After I uploaded the measurements the screens came in about 5 days. I installed them last week and they fit perfectly. They were so easy to install. The only hard part of the entire day was cleaning my windows!I will highly recommend these screens to anyone who asks me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "buttons",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T17:05:30.000Z",
          "Titre": "Exactly as advertised",
          "Contenu": "Exactly as advertised. Very happy with my purchase. Easy to do with the measuring tool sent. Everything done in a timely manner. Will purchase again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GP",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T02:05:10.000Z",
          "Titre": "Very satisfied with product & delivery",
          "Contenu": "The screens that I order turned out great! They were easy to install and fit perfectly using the included adjustment pads."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hugo Gorosave",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:28:37.000Z",
          "Titre": "Terrific product",
          "Contenu": "Terrific product, customized and fit perfect on my windows. I will be purchasing more screens for my hoe and I will highly recommend them to my friends and family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Murray",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:43:48.000Z",
          "Titre": "Perfect",
          "Contenu": "everything perfect from start to finish...easy to install...this s the best screen out there"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pedro De Anda Jr",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T08:49:22.000Z",
          "Titre": "A perfect fit!",
          "Contenu": "Ordering was easy and shipping was quick. I received a free flextanna beforehand to measure my windows. If you are going to measure the opening, make sure to use the “help me measure” on the measurement page. This will adjust the size automatically when you input the window opening measurements. Otherwise you will have to measure the opening and then minus out 1/16” from the width and 1/16” from the height to get the adjusted size. Mine fit perfectly. I will definitely order more for my other windows."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARK TRUMBULL",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:28:01.000Z",
          "Titre": "My new Flex Screens were extremely easy…",
          "Contenu": "My new Flex Screens were extremely easy to install!Perfect fits as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alberto",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T22:27:22.000Z",
          "Titre": "Great customer service (Mike)",
          "Contenu": "Great customer service (Mike). Ease of installation.Quick delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EFF",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:50:07.000Z",
          "Titre": "Excellent!",
          "Contenu": "The screens came very quickly. Certainly saved us money over ordering retractables and THEY FIT PERFECTLY. They don't obstruct the view at all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jon riggins",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T02:52:15.000Z",
          "Titre": "Skeptical but Believe!!!++",
          "Contenu": "At first I was skeptical about the process pay first and then get your screens but it paid off well. The screens work well, I love them!!!! Thank you guys and they helped me out because I wasn't computer savvy.  Appreciate all your help!!!! Thank you!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Morgan",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T02:43:26.000Z",
          "Titre": "FlexScreen superbly responsive",
          "Contenu": "FlexScreen superbly responsive to any issue. Constant-contact behavior. Mind you, not pushy. Once & done support. Entering an order is a learning curve. Just read screens carefully. I ordered 7 screens and wish They could simply be numbered lieu of Dining room, Den, Bedroom etc. I was compelled to re- order 6 due to my mistake in measuring. It's odd customer must subtract 3/16\". Couldn't the \"screen maker\" make that adjustment? As a precaution, I subtracted 1/4\", lieu of 3/16\" and \" fit\" still tight."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "a brick",
          "Nb_Reviews": 3,
          "Date": "2023-10-17T15:21:21.000Z",
          "Titre": "Excellent product",
          "Contenu": "Had sort of been in the market for window screens, as most of mine were either bent or had holes or tears in the screens. Hadn't jumped on replacing them, as I was concerned that I'd bend and misshape the frames when installing them. So when I saw these, I immediately ordered. The process was simple - get your flextenna and take measurements, then enter them online. About a week later, I had my screens. They were packed well and arrived in mint condition. Installation was a snap, and every screen fit nice and snug. Excellent product. The only improvement I'd suggest is to put little tabs at the midpoints of the edges to allow for easier installation and removal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Scott",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:14:21.000Z",
          "Titre": "Good service and product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:55:23.000Z",
          "Titre": "Prompt delivery, quality product, easy to install",
          "Contenu": "The instructions were clear and easy to understand. Deliver was prompt and the quality was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Koehler",
          "Nb_Reviews": 3,
          "Date": "2023-10-10T14:36:56.000Z",
          "Titre": "Responsive Company will make sure you are satisfied.",
          "Contenu": "We had an issue with FlexScreen 2 years after installation.  Michaela fixed the issue within one week.  It is uncommon to do business with a firm that acts to correct an issue with expediency.  I can see that they are all in and serve customers to their best ability."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RICHARD YEH",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T02:21:58.000Z",
          "Titre": "Great fit for Andersen E-Series screen door",
          "Contenu": "I needed to replace a damaged screen insert in an Andersen E-Series door. FlexScreen’s process was so easy. I measured (without the measuring tool), entered the numbers on the web site, and a few weeks later, received the new screen. Installation was easy.FlexScreen’s web site allows sizes larger than FlexScreen through Home Depot - which I needed because my door is taller than the maximum screen height on the Home Depot website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL MCCHESNEY",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T01:43:34.000Z",
          "Titre": "Incredible product",
          "Contenu": "Incredible product! As a landlord who takes care of his properties, I have been WAITING FOR THIS EXACT PRODUCT. The window companies have us stuck between a rock and a hard place but not anymore my friends. Triple check your measurements and purchase ASAP. Shipped in 5 B days, Installation was a breeze. Product is flexible but STURDY. I could not be happier. Also, Here We Go #412"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T20:02:44.000Z",
          "Titre": "I'm a believer!",
          "Contenu": "Recently moved to an old home with no screens and odd-sized windows. I read about FlexScreen but was skeptical, so I only ordered three. They fit perfectly and are easy to put in and take out. So much better than aluminum frames!!! I'm getting ready to order five more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sonja Polster",
          "Nb_Reviews": 3,
          "Date": "2023-09-14T20:53:22.000Z",
          "Titre": "Best product of you need to remove your screens!",
          "Contenu": "We added Bahama shutters for hurricane protection and all of our old screens broke trying to get them out so we could close the shutters from inside on the second floor. We ordered Flex screens and couldn’t be any happier. I found them easy to remove and install as we have to do it often to lubricate the shutter mechanism. The ordering process is super easy and they send you a tool to get precise measurements. I had to call customer service as I made an error on my input page and Mike was so helpful! Our screens arrived within a week and the are beautiful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T03:48:11.000Z",
          "Titre": "Awesome Product!",
          "Contenu": "I have been needing screens for windows for years but didn't know where I could get them without building them myself.  I saw a FlexScreen advertisement and knew it was what I needed. I purchased one to see if I liked it.  I LOVED it. Will be purchasing more to finish the unscreened windows. Thank you so much for this awesome creation!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Valdez",
          "Nb_Reviews": 3,
          "Date": "2023-09-09T04:17:46.000Z",
          "Titre": "Ordered my first FlexScreen",
          "Contenu": "Ordered my first FlexScreen. The ordering process was simple and the provided detailed instructions on how to measure for the installation of your new FlexScreen. Received my order in about 10 business days and installation took less than a minute. I love the way it looks and I am seriously thinking of replacing all of the screens in my house with FlexScreens."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MB",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T03:55:29.000Z",
          "Titre": "Great quality, long leadtime",
          "Contenu": "Great product quality.  The only downside was the timing of the entire process. From order placement to window measurement to screen delivery was 16 days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "maureen schiau",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T21:13:51.000Z",
          "Titre": "Screens from FlexSteel",
          "Contenu": "I like to give a good review unless I am totally disappointed.  Especially when I am taking the measurements.  I did like the quality of the screening.  I did think it was rather expensive.  But tried to get screening for a few years and your company was the only one that would make it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RICHARD WILEY",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T15:42:28.000Z",
          "Titre": "Mike in customer service is great",
          "Contenu": "Mike in customer service is great.  Quick and thorough responses. FlexScreen policies encourage continued use, and referrals from me, as they are fair and flexible(no pun intended).And it's a great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Lickfold",
          "Nb_Reviews": 2,
          "Date": "2023-06-10T04:55:49.000Z",
          "Titre": "Extrememly Impressed",
          "Contenu": "I couldn't be more impressed with these screens and the whole ordering process. I had been looking at them for years, finally decided to buy them. I used the measuring tool and the screens fit perfectly, I mean absolutely perfectly. I have windows that only have one pocket at the top and the screens still fit perfectly and snug, snapped right into place, and I didn't need to use the retention bumpers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Pyles",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T20:46:41.000Z",
          "Titre": "It was an easy order process",
          "Contenu": "It was an easy order process. I had originally ordered 5 screens with plans for 2 to be doorway size. But had to request a refund as I did not realize the door size ones would come with such a high shipping charge. But the site made it super easy to request the refund.I placed a new order for just the windows I wanted new screens for, they fit perfect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris W",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T20:35:51.000Z",
          "Titre": "Easy measure, shipped quick, seamless fit",
          "Contenu": "I had some screens with holes and bent frames.  Initially, I looked to replace them with the same kind of screens but decided to give FlexScreen a shot. I'm glad I did!  It took a little longer as I had to receive the antenna measuring device first. Measuring was guided on the phone and simple. The estimated ship date was 14 days from the order, but I received the screens within 4 days!  The screens popped into the windows easily.  This is definitely the way to go if you're replacing screens!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valerie S",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T20:32:56.000Z",
          "Titre": "Great quality screens and customer service",
          "Contenu": "The screens are great and the customer service was excellent. Two of my screens were damaged in the process of installing them, and FlexScreen sent me replacements as quickly as they could. Just a heads up that while easier to install and remove than standard screens, it's still possible to have the mesh tear off of the frame and to warp/break the frame, so be careful. If it's seeming too difficult to install from indoors, try outdoors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "violetturtle",
          "Nb_Reviews": 3,
          "Date": "2023-07-25T20:43:24.000Z",
          "Titre": "Skeptical…But believer now!",
          "Contenu": "I was skeptical… Believe me… But I trusted the system and figured that if it was not true, it was going to be on me. WELL…we were pleasantly surprised (My hubbs and I) how perfect the system is and how beautifully these screens fit into our already existing storm windows where the screens had been broken. I will definitely use this company again when I have the need for more screens and would recommend you try this product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Francesca Patenaude",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T20:25:43.000Z",
          "Titre": "Beyond Happy",
          "Contenu": "I truly couldn't be happier. Our home swaps screens for seasonal window a/c use and our old screens would constantly bend, rip and come undone. Our home looks so much more buttoned up. FlexScreen is a wise investment and can't wait to order the remaining screens we need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DougJ",
          "Nb_Reviews": 4,
          "Date": "2023-07-03T20:03:59.000Z",
          "Titre": "Pleased so far, time will tell…",
          "Contenu": "The screens fit. Easy to install. Poor to no shipment notification, I had to make contact to get shipment information. Not sure if these will last due to the way the screen is glued to the frame in the Central Valley heat in California. Overall pleased so far. The bug/insect screen is dark which is a bonus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yelena Libin",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T01:02:45.000Z",
          "Titre": "Easy to order, quick to arrive and effortless to install!",
          "Contenu": "Easy to order, quick to arrive and effortless to install!We used a measuring tape to calculate the size of the screens needed and it was the hardest part of the process. If you are not sure - wait for the tool provided by the company.Our screens arrived in couple of days, exactly the size we needed and were extremely easy to install.We choose the “waterproof” version, but didn’t have rain yet to see them in action.They are almost invisible.Overall- easy and pleasant experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa R",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T22:04:05.000Z",
          "Titre": "Don’t hesitate, these screens are amazing!",
          "Contenu": "We remodeled an older home that had Pella windows.  The Pella company decided it was a good idea to stop making screens for the older windows. It is a must in Texas to have a screen to open a window during the 5 days of cool weather. I came across an ad for the flexible screen and took a chance. I ordered the measuring tool and 1 screen to see if it was going to work. It is PERFECT!!!! I am putting an order together for the rest of the windows. Love these screens! Thank you for solving a “what are we going to do” situation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ernesto colon",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T21:54:13.000Z",
          "Titre": "Customer service was incredible..Thank You Mike!",
          "Contenu": "Customer service was incredible especially from a gentle called Mike. Thank You Mike. Because of his generosity I will be ordering more screens and so will a few of my neighbors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie M",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T01:36:09.000Z",
          "Titre": "I was afraid to try and measure myself",
          "Contenu": "I was afraid to try and measure myself, but Sandy walked me through the process like a champ.  The screens arrived in perfect condition and I was able to install in a matter of minutes.The screens are exactly what we wanted.Truly a great American Made company that we will be purchasing from again.Wonderful customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 4,
          "Date": "2023-06-13T23:37:57.000Z",
          "Titre": "As a newcomer to FlexScreen",
          "Contenu": "As a newcomer to FlexScreen, I needed assistance to correct my original measurements. FlexScreen Customer Service Rep. Mike, could not have been more helpful. He walked me through the process and ten days later I had new, perfectly fitting screens. And I love them! Bravo FlexScreen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina O",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T19:23:36.000Z",
          "Titre": "Worth it! Will buy again!",
          "Contenu": "The process was excellent. I placed my order for the pet safe screens and received the free measuring tool. I entered my measurements and followed the easy directions and my screens fit perfect and look beautiful.  FlexScreen even labeled them so I knew which windows they went to! Super easy to install!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JB Gearhart",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T01:53:59.000Z",
          "Titre": "Ordering screens online",
          "Contenu": "Ordering screens online - I was skeptical.  Skeptical about the measuring process, the material's appearance, the fit with my windows, and customer service.  Well, they proved me wrong.  On all counts.  Their measuring instructions were clear.  They provided a handy tool (for free) made the task easy.  The material was exactly as described.  The flex in the product makes install and removal very easy.  The fit is excellent.  So based on practical first person experience, yes I fully recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martha",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T19:49:48.000Z",
          "Titre": "Better than expected!",
          "Contenu": "Directions on website for measuring were spot on!Screen fits perfectly!  And, the bumpers make it an even more secure fit.  I did pay attention to a prior review about handling edges with care.  I do love the clean look of the screen too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DIAMOND MIKE",
          "Nb_Reviews": 3,
          "Date": "2023-11-07T23:05:42.000Z",
          "Titre": "I NEEDED FLEX SCREEN CUSTOMER SERVICE…",
          "Contenu": "I NEEDED FLEX SCREEN CUSTOMER SERVICE HELP AND MICHAEL WAS VERY PROFESSIONAL AND THERE EVERY STEP OF THE WAY."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina Handley",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T01:09:37.000Z",
          "Titre": "Easy to calculate the measurements",
          "Contenu": "Easy to calculate the measurements. And the screen arrived very shortly thereafter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob R.",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T20:51:10.000Z",
          "Titre": "Too Easy",
          "Contenu": "The process was easy to follow, everything shipped quickly, and the screens were a perfect fit. I received email updates throughout the process to keep me informed on the status of my order. This was a flawless experience start to finish."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fernando Diaz",
          "Nb_Reviews": 3,
          "Date": "2023-09-13T20:00:36.000Z",
          "Titre": "My FlexScreen Experience",
          "Contenu": "It was easy to measure and submit the order. It does take a few days to get initial rod to measure but well worth it. The you just submit those measurements online and your screens get made. When I got my screens was amazed at how beautiful the screens are and how easy they are to install. They fit perfectly, no issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kisha Phillips",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T21:09:03.000Z",
          "Titre": "Excellent customer service, process and product",
          "Contenu": "Very easy ordering process. Very detailed and easy to follow measuring instructions.  Quick delivery and response. Screens fit exactly as they should and we are VERY happy with this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Zylstra",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T18:54:10.000Z",
          "Titre": "Replaced 2 screens and measuring tool…",
          "Contenu": "Replaced 2 screens and measuring tool helped to get a tight fit so the screen would stay in place; even with no pockets on the sides of one screen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Herring",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T20:30:27.000Z",
          "Titre": "I love the Flexscreens",
          "Contenu": "I love the Flexscreens! They were so easy to install and it doesn’t obscure your view like most screens do. You barely notice they’re on the windows. I have already ordered more and will definitely recommend them to anyone. Thank for the awesome screens!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Leonard",
          "Nb_Reviews": 4,
          "Date": "2023-09-08T22:24:26.000Z",
          "Titre": "Instructions for measuring excellent",
          "Contenu": "Instructions for measuring excellent.  The screens fit excellent.  All is good,  just hope they last 20+ years like the original screens when the house was built did."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marie Juliano-castellano",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:01:57.000Z",
          "Titre": "Easy and looks great and keeps bugs out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mike salapka",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T22:33:58.000Z",
          "Titre": "Incredible All the Way",
          "Contenu": "The product and service are both top notch!  Michael was VERY helpful on email and the phone with ordering and measuring.  Shipping was fast and communication great.  I am NOT a DIY kind of person and was worried about installation, but it was easy enough even for me!  I put in 10 screens in about 15 minutes and we absolutely love them.  Much better than the old ones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T01:39:17.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. They were quick to respond to any questions I had. The measuring tool really helped to get the exact size and I really appreciated the websites help in automatically adjusting the size entered, depending to the type of frame the screens go in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jessie Hobbs",
          "Nb_Reviews": 3,
          "Date": "2023-08-22T23:39:57.000Z",
          "Titre": "Measure and call CS to verify length and pocket  … the screens are awesome,looks great, fit is great.. very happy with purchase.. we got the solar screens..",
          "Contenu": "We got the flex tena .. did the measurements.. Called CS.. very helpful.. made our account.. put In measurements and size was adjusted to exactly what the CS had verified with us..arrived in damaged and they fit perfect.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Brooks",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T15:22:43.000Z",
          "Titre": "Purchase process was quick and easy",
          "Contenu": "Purchase process was quick and easy. Customer Service very responsive to my questions. Measure tool made the process quick and easy to insure the correct size. Screens arrived quickly, installed easily and look great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Paul",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T21:58:46.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service. Had several product questions. The Rep sent screens samples. We ordered a total of 6 screens. Received the Flex-Tenna within a day of the order. After providing the screen measurements, within a couple days later I received an email (tracking#) saying the screens were shipped. FYI...We don't care for the look of the solar screens from the outside of the house (to dark, not stretched tight enough, wavy) but are very happy with the small insect screens. Just hope they work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C.Smith",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T13:10:32.000Z",
          "Titre": "Works for Casement windows with no pockets",
          "Contenu": "The process of paying first and without the measurements seem a bit scary for me at first but I decided to give these screens a try.  I followed the instructions and watched the videos and to my surprise these screens are PERFECT! They look very elegant, minimalist, and not bulky at all.  We have casement windows so ours don't have pockets (tracks) but they have the perfect measurements and solutions for every window type. When we moved into the house, the workers told us there was no way to install window screens and I'm glad they are wrong.  I will be ordering a few more for other windows. They are a bit pricy but the quality is great and the service is fast and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. Thomas Groy",
          "Nb_Reviews": 2,
          "Date": "2023-05-22T22:12:39.000Z",
          "Titre": "Very happy with FlexScreen!",
          "Contenu": "Very happy with FlexScreen!!  Purchased two replacement screens for bedroom windows.  Screens arrived about 10 days after the order.I can truthfully say it took longer to unbox the screens than it took to install them.  Install was about 1 minute for each screen.  Each screen snapped into place with a perfect edge to edge fit.Next time I need window screens, I'm buying them from FlexScreen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. Thomas Groy",
          "Nb_Reviews": 2,
          "Date": "2023-05-20T00:47:46.000Z",
          "Titre": "So happy I found FlexSreen!!",
          "Contenu": "If you can use a measuring tape, you can get the best window screens at great prices.  Ordered a pair of replacement screens about 10 days ago.  They arrived today.I can honestly say it took longer to unbox the screens than it took to install them.  Such an easy and effortless install, it took less than one minute per screen.  Would recommend FlexScreen to anyone needing replacement screens.Dr. Thomas GroyGilbert, AZ"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G.Galvan",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T20:43:07.000Z",
          "Titre": "New home now has beautiful screens…",
          "Contenu": "I recently purchased a house that had no screens on the windows. I’m a pretty handy guy, but the thought of making up some ugly traditional aluminum framed screens got me thinking about Flexscreen’s. So, I ordered the number of screens needed and waited for the flextenna to measure the openings. I followed their instructions and in a few weeks I had my new screens. They came labeled (great idea) and installed easy. They look sharp, fit great too. The purchase process went smoothly start to finish. It’s simple, just follow the well tailored instructions they provide and you’ll be set."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina Ferrara",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T22:22:01.000Z",
          "Titre": "I have older windows and I washed the…",
          "Contenu": "I have older windows and I washed the screens one day and leaned them against the garbage cans to dry. I forgot them and I guess the garbage company thought I wanted to throw them out. My husband does construction and kept saying these aren’t regular windows they’re old and odd sized & you’ll never find new screens. Well I came across flex screens I waited for the measuring tool, I measured on my own and presto now I have great screens. They fit perfectly. My husband said “what’s this it genius!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T15:23:55.000Z",
          "Titre": "My window washer recommended these as…",
          "Contenu": "My window washer recommended these as several of our screens were broken or I’ll fitting.  We order a few to see how they fit. Perfect!  Will be ordering for the rest of the house !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2023-06-07T14:56:24.000Z",
          "Titre": "Everything",
          "Contenu": "Everything!  When I had a question prior to purchase, I received a helpful answer almost immediately.  Entering measurements & placing my order was simple and fast.  Delivery was as promised.  Most exciting is the quality of the screens I received and I was thrilled that they all fit perfectly and look great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Holt",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T21:08:41.000Z",
          "Titre": "After reviewing the flexscreen products…",
          "Contenu": "After reviewing the flexscreen products I placed an order. They sent me a flex measurement tool. After receiving the tool, I watched the video on how to measure. Followed their instructions, and about a week later received flexscreens that fit perfectly.We do not have a screen pocked on our windows. So, I was a bit concerned if they would work. The snug, nearly perfect fit, keeps the screens tightly in place.Far better than any other screen product I have ever used."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maribeth Jaubert",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T17:50:15.000Z",
          "Titre": "Very satisfied with product",
          "Contenu": "Very satisfied with product, and people at Flex Screen were helpful. Also, time from order to delivery was fast!!’"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorna Grant",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T01:14:18.000Z",
          "Titre": "We love the flex screens",
          "Contenu": "We love the flex screens - so easy to insert and remove when needed.  They look good too.We provided measurements which were met exactly.Cost is also very reasonable.A very good experience so far - we have 10 more windows and look forward to the same results as above."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Fairclough",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T16:33:34.000Z",
          "Titre": "Flexscreen is an affordable screen replacement",
          "Contenu": "I have been in need of two window screens in my house for years but it was always expensive to have somebody make one for you until I found flexscreen.  When the screens came in I thought they were too large at first but they fit like a glove. They look great. I can now open the windows to get fresh air in those rooms without letting bugs in.  I will be recommending flexscreen to friends and family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mukunda das",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T19:34:38.000Z",
          "Titre": "Great product for several reasons",
          "Contenu": "The screens came to the exact measurements I provided.  The frames are flexible enough to allow for easy installation and rigid enough to stretch the screen so there's no \"waves\" in it, even on the larger size I ordered.  I will never build a replacement screen again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donnald Dindinger",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T13:47:01.000Z",
          "Titre": "Easy to follow guided instructions for…",
          "Contenu": "Easy to follow guided instructions for taking measurements, fast delivery, and responsive customer service. Regular metal screens were almost impossible to replace in my windows without breaking the screen. Flexscreen was much easier to insert. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claude Romano",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T23:56:26.000Z",
          "Titre": "New replacement screen review",
          "Contenu": "Super easy to order, measure and install. Much easier than expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Gordon",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T19:13:53.000Z",
          "Titre": "I'm in love with my new Flex Screens",
          "Contenu": "I'm in love with my new Flex Screens! I had two very difficult to remove and reinstall window screens which resulted in frame damage and Flex Screens were the perfect replacements for them. Everything about the ordering process was a piece of cake and the fit and finish of the screens was perfect. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T23:43:50.000Z",
          "Titre": "Super Easy to install",
          "Contenu": "I had the screens installed within an hour of receiving them. Super easy to install and they fit perfectly based on my measurements."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caroline",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T05:54:22.000Z",
          "Titre": "Customer Error",
          "Contenu": "I somehow mismeasured one of my windows, and FlexScreen offered to remake it for me and all I would pay is shipping. Since I ordered 7 screens, not having to buy another one was awesome. Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Minke",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T23:31:48.000Z",
          "Titre": "Easy as 1, 2, 3",
          "Contenu": "The FlexTenna made measuring much easier (1). The screens were individually labeled and made sorting easier (2). And they all popped right in place and fit perfectly (3)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T16:26:19.000Z",
          "Titre": "Greenhouse Screens",
          "Contenu": "I ordered three screens for my greenhouse windows.These are large windows so I was not sure if the Flex Screen product would do what I expected. I measured and ordered. When the screens arrived, about a week and a half later, I was surprised at how well they were packaged. It took me longer to unpack than it did to install. The screens fit well and are working as expected. My only complaint is, that they were not marked which screen went with what window."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Murphy",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T07:32:28.000Z",
          "Titre": "Product is as good as it is advertised…",
          "Contenu": "Product is as good as it is advertised to be. The order and sizing process is over thought. Order one screen, follow the guidelines for ordering and then once you have it and you know what you are doing, order the rest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Olson",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T01:29:41.000Z",
          "Titre": "Screens fit.",
          "Contenu": "My window frames are tough and getting old. I measured VERY carefully and they all seem to fit pretty much how I measured. We will see about any difference in heat blockage but I’m glad to finally have screens on my home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean Wade",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T23:27:17.000Z",
          "Titre": "Got the screens today",
          "Contenu": "Got the screens today, but have opened the box.  What has made this a memorable experience is that I emailed a question about holding the screens in place and was answered competently and quickly.Also, the screens were mailed out within a few days of sending in the measurements.Great job to all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommy G",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T02:30:59.000Z",
          "Titre": "The screens fit and they were not…",
          "Contenu": "The screens fit and they were not damaged. Very nicley packed. Our windows look great again. My only recommendation is that when entering the measurements on the website, I was unsure about the deduction. It was not clear of the exact way to figure this but it worked."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Phelps",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T12:29:18.000Z",
          "Titre": "Flexscreen was very responsive",
          "Contenu": "Flexscreen was very responsive and helpful in getting all of my screens in and accurately doing so.  I ordered 4 but I will be ordering more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deanna Herreman",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T22:13:16.000Z",
          "Titre": "This product is amazing",
          "Contenu": "This product is amazing. So easy to install and aid so much more sturdy than what I had before. I don’t have a standard type of window so a “normal” screen would not work but Flex Screen has provided an exceptional product for me and I am so happy!! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Fleming",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T23:06:23.000Z",
          "Titre": "Screens fit well",
          "Contenu": "Screens fit well.  Shipping was unbelievable.  Attention to detail and screens were protected from damage.  Thank you.  I am getting ready to order more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "chicken334",
          "Nb_Reviews": 3,
          "Date": "2023-05-08T19:37:30.000Z",
          "Titre": "Great Product and Customer Servcice",
          "Contenu": "10 of the 11 screens I ordered fit perfectly.  The one that didn't was my fault for an incorrect measurement.  I called and spoke to Michael, who helped rectify the situation with minimal effort and cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 4,
          "Date": "2023-07-01T02:11:18.000Z",
          "Titre": "Great customer service great window…",
          "Contenu": "Great customer service great window screen. Sturdy and strong. However I did measure wrong and they were willing to make a new one at a cheaper cost but that was my fault regardless. But they helped me and are awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne Perry",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T04:58:58.000Z",
          "Titre": "9 window screens in less than 20 minutes…",
          "Contenu": "Everything was so easy they sent me the measuring tool to measure my windows. Once I did that I sent them the information. My screens arrived within two weeks, and they fit perfectly. I installed all nine screens in less than 20 minutes and I love them. I absolutely love them. Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curtis Carter",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T23:08:59.000Z",
          "Titre": "From start to finish the experience and…",
          "Contenu": "From start to finish the experience and process was flawless. The screens are just perfect, look great, and less expensive than having the local people build new screens."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Lutze",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T07:45:04.000Z",
          "Titre": "If you get the measurements perfect",
          "Contenu": "If you get the measurements perfect, this will be the best purchase you have made.  For the measurement that fits into the groove of my window frame, I rounded down 1/8th inch just to be safe as I did not want it to be too big, but I could have gone up as well.  Still fits like a glove and looks great!  Worth the price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck Sanders",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T21:09:25.000Z",
          "Titre": "New Fkex Screen purchased from Home…",
          "Contenu": "Used the FlexTenna purchased from Home Depot. Got precise measurements and then ordered online. Screens came and a perfect fit!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RB",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T23:19:14.000Z",
          "Titre": "Fit for u",
          "Contenu": "If you measure right,  these are the best screens ever, they fit perfectly, and only take a second to install them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vickie",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T07:14:11.000Z",
          "Titre": "Exactly what I needed!",
          "Contenu": "The ease of measuring and then installing these screens was wonderful. The frame is sturdy even while being flexible. The screen type I choose has kept many bugs out as well. Very pleased with this purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shayne Abelkop",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T17:55:32.000Z",
          "Titre": "Very quick shipping",
          "Contenu": "Very quick shipping. Excellent product. Works as described. I like that the screens are very thin to fit into older windows. They work exceptionally well. No complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leoj",
          "Nb_Reviews": 2,
          "Date": "2023-06-26T17:22:39.000Z",
          "Titre": "Perfect fit!!",
          "Contenu": "Everything went super smooth I wasn’t sure what to expect out of the whole process but everything was perfect fitting and a lot less expensive then going with Pella for the screens"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonah",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T00:43:49.000Z",
          "Titre": "Great and quick option for screens",
          "Contenu": "The screens were made and shipped quickly. The longest part was waiting for the measuring tool. I used it to get all my measurements for 4 screens. Two fit perfectly, one fits decently, and one not so great. The one that’s not so great is just a bit too wide so it bows out on the bottom. This may have been my user error in measuring."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael C",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T17:31:54.000Z",
          "Titre": "so easy to measure the tool and…",
          "Contenu": "so easy to measure with the tool and enter the measurements on the website the product came quickly, and installed perfectly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynda Bruns",
          "Nb_Reviews": 3,
          "Date": "2023-06-13T20:36:45.000Z",
          "Titre": "Received screens as expected",
          "Contenu": "Received screens as expected.  They all fit perfectly in my windows.  Very satisfied.  Will be ordering more in the near future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alicia F",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T03:39:21.000Z",
          "Titre": "Bought for a rental",
          "Contenu": "Bought for a rental. Easy measure and perfect fix. Easy to install and remove. Have referred to friends as well. Will be buying additional screens for my house!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher P Sheedy",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:48:33.000Z",
          "Titre": "Hassle-free experience!",
          "Contenu": "The measuring tool makes things a cinch. The screen shipped fast after I entered the measurements. Installation was a breeze. Thanks guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T20:00:15.000Z",
          "Titre": "Impressive",
          "Contenu": "Quick turnaround. Clear instructions very easy to implement. Perfectly fitted result.  Installs in seconds."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Vogel",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T18:41:54.000Z",
          "Titre": "Easy to order",
          "Contenu": "Easy to order, they fit perfect and with all videos on website the instructions for measuring and fitting was great. Delivery was faster than expected. Great service?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Tredway",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T00:28:09.000Z",
          "Titre": "Easy ordering",
          "Contenu": "Easy to order. Measuring instructions very detailed and final measurements calculated for you. Arrived within 10 days. 1 screen was fractionally difficult to install,  but it does fit. Satisfied with product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zachary Wendt",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T22:34:50.000Z",
          "Titre": "Ordering was easy and the technology…",
          "Contenu": "Ordering was easy and the technology was great!I work on a college campus and we go through a lot of screens. So the ease of measuring and ordering is a game changer for us."
        }
      ]
    }
  ]
}