{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "fonoma.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Eva Wardle",
          "Nb_Reviews": 8,
          "Date": "2023-12-21T17:25:30.000Z",
          "Titre": "I would like to give you a zero rating17/22/23.",
          "Contenu": "I would like to give you a zero rating.I've been a customer of Tesco mobile for more years than l care to remember. I topped up my account in the usual manner on 17/12/23 but this was not added to my account until 18/12/23 but l was messaged to say that this was in my rocket pack on17/12/23 this is a monthly to up. My credit ran out  19/12/23 customer service closed l had to top up again text again to say accepted now lm being told l topped up into a different account and l cannot get a refund.  I have been charged twice for my monthly top  up. Date of review should read 17/12 /23."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jack",
          "Nb_Reviews": 2,
          "Date": "2023-05-13T13:45:46.000Z",
          "Titre": "You have taken money from my bank…",
          "Contenu": "You have taken money from my bank account 3 times recently without my permission. I can't block you or change my card number because your app doesn't allow that. Please stop using my card now and refund the last 3 withdrawals. You have ignored my request.  I don't want to use fonoma anymore"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nelson",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T00:23:23.000Z",
          "Titre": "customer before profit",
          "Contenu": "FONOMA this time really disappointed me !!!! I did send a recharge to cuba and my relative NEVER got it !!! despite I DID SENT TO FONOMA a screen capture of the phone shoving NO balance from TWO consecutive charges , fonoma denied my claim, as a result I lost about 65 canadian dollars the value of those two undelivered charges"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Sandra",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T20:43:39.000Z",
          "Titre": "Currency",
          "Contenu": "I am in Canada, told total was 18.88, ended up being charged $25.  Should state which currency being charged in."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Yorly",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T20:36:33.000Z",
          "Titre": "One of the worst experiences that I…",
          "Contenu": "One of the worst experiences that I never experienced in my live. I sent a cell recharge to my daughter in Cuba that she never got. And on top of that I has been dealing for a solution for.over a week without any explanation of what happened. NOT RECOMENDED Una de mis experiencias mas terrible en mi vida. Le envie una recarga de cell a mi hija en Cuba la cual nunca fue entregada. Llevo mas de una semana lidiando con la situacion sin una explicacion de a donde fue a parar o una solucion. NO LE RECOMIENDO USAR ESTE SITIO DEL TODO."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Walter",
          "Nb_Reviews": 3,
          "Date": "2022-05-26T23:17:56.000Z",
          "Titre": "You can have the translation with…",
          "Contenu": "You can have the translation with Google. Let me speaker crenchas about them. It easyer for me and fair for them. This is the whorst compagny i Nevers deal whit it. You nées and informacionnnn and they send you à web site to Buy something.Simple question. Why my bill it’s up for 40%. ONLY IN SPANISH.Ok no problem But why.Esta político.What¿Hang on"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Walter",
          "Nb_Reviews": 3,
          "Date": "2022-05-25T22:49:13.000Z",
          "Titre": "How to steal money from pobre",
          "Contenu": "I Réally don’t like your compagny. You help comunista whit a 40% Moore for recharge. Shame on you. I will be close soon my account. When i want to speak to someone curiously they dont speak English. You are like thé régime. Give me your money ans close you fuc...king mouth."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ernesto Murphy",
          "Nb_Reviews": 6,
          "Date": "2021-10-13T19:37:17.000Z",
          "Titre": "I have no complains about the process",
          "Contenu": "I have no complains about the process, but I can never be happy when my cousin who is a Surgeon and an Specialis in ICU has to wait for me to pay his cellphone bill. It is the most expensive service in the world under the Etecsa monopoly in a country with no freedom and a lot of misery. PATRIA Y VIDA."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joel",
          "Nb_Reviews": 1,
          "Date": "2021-09-24T15:18:45.000Z",
          "Titre": "Do not use. Worse customer service ever and will pocket your money",
          "Contenu": "Extremely poor customer service. Recharged twice the same number by error. Called back and ask for a refund. Not available to do it. Needed opening a dispute with my credit card. Will not use their services again. FYI, I was their customer for 8 years and it did not matter."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Golf Guy",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T23:03:19.000Z",
          "Titre": "The last time I sent credits they were…",
          "Contenu": "I stand behind my comment that Fonoma does not always deliver. Your company never fixed the issue even after I asked for help and the issue was obviously the fault of Fonoma.Buyer Beware and Know that you won't always have your credits delivered."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "osmond",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T22:05:21.000Z",
          "Titre": "Poor",
          "Contenu": "Trying to give my visa no 4 weeks now.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Herman",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T23:59:13.000Z",
          "Titre": "My last recharge has not been processed…",
          "Contenu": "My last recharge has not been processed yet and it was sent over 2 days ago I have emailed twice and still no resolution to my problem"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2021-07-17T08:06:22.000Z",
          "Titre": "I send the last wednesday a recharge to…",
          "Contenu": "I send the last wednesday a recharge to Cuba and never appear the recharge...I send many messages and nobody had interested  in resolve my situation but the pay is active....What do you want I think from Fonema....?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raphael Cortez",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T03:48:12.000Z",
          "Titre": "Not the best agency to send money",
          "Contenu": "Not the best agency to send money . They place a hold on the transfer and don’t say why but can’t cancel it either . Their competitors are better . Won’t waste my time or money with Fonoma again."
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Giles",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T14:48:47.000Z",
          "Titre": "My phone is now open but i can't…",
          "Contenu": "My phone is now open but i can't connect to wifi/internet through my fonoma account. i am using Nauta internet cards. Please tell me how to dix this. Giles Slade"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "ex-customer",
          "Nb_Reviews": 2,
          "Date": "2020-07-14T05:39:39.000Z",
          "Titre": "Approval after one recharge...?? What for?",
          "Contenu": "Far to expensive, only for single transactions useful. As soon as you try to do more than one recharge, one has to wait for an \"approval\". What for? What a stupid set-up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elio Hernandez",
          "Nb_Reviews": 2,
          "Date": "2022-09-23T00:27:54.000Z",
          "Titre": "i need cancel a transation and is…",
          "Contenu": "i need cancel a transation and is impossible the comunication with the company"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "valentina",
          "Nb_Reviews": 1,
          "Date": "2021-01-02T20:11:05.000Z",
          "Titre": "31 December I sending for recharging…",
          "Contenu": "31 December I sending for recharging for my friend, and he never received,and I lost my money.I am writing for help,and they can't help.Very bad service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "brian",
          "Nb_Reviews": 2,
          "Date": "2021-06-08T00:59:23.000Z",
          "Titre": "Poor customer service and a bunch or…",
          "Contenu": "Poor customer service and a bunch or robbers they take your money and the family in Cuba never ever got the service the I pay for is a rip off."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Cristofer Jimenez",
          "Nb_Reviews": 2,
          "Date": "2022-03-25T09:22:56.000Z",
          "Titre": "Terrible my recharge was in revision…",
          "Contenu": "Terrible my recharge was in revision for 24 hours. Other companys dont even have this. Don't waste your time."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "cesar",
          "Nb_Reviews": 1,
          "Date": "2020-12-16T23:05:12.000Z",
          "Titre": "I try to pay with different credit card…",
          "Contenu": "I try to pay with different credit card and every time ill try to enter de new credit card is already been charge to the one on file."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charlie",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T19:49:31.000Z",
          "Titre": "Paid for recharge on 2 separate and…",
          "Contenu": "Paid for recharge on 2 separate and neither person ever received their recharge but you sure did charge my credit card"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "froylan",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T01:15:46.000Z",
          "Titre": "people only used this service because…",
          "Contenu": "people only used this service because there\"s not many choices over all its a ripoff for the people in CUBA"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T12:06:53.580Z",
          "Titre": "My friend did not get the recharge on…",
          "Contenu": "My friend did not get the recharge on monday 5355962413 I paid u said I paid she no get"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2020-05-17T18:57:53.000Z",
          "Titre": "I save a Money credit to use…",
          "Contenu": "I save a Money credit to use somestimes, one day company removed it.They never tell me You have to use ir."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susana",
          "Nb_Reviews": 1,
          "Date": "2020-06-28T03:55:00.000Z",
          "Titre": "very well ..",
          "Contenu": "very well ... I thank you very much ... Many Blessings for you ... take good care of yourselves ..."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kent",
          "Nb_Reviews": 3,
          "Date": "2020-05-12T13:34:58.000Z",
          "Titre": "Your rates of exchange are higher than…",
          "Contenu": "Your rates of exchange are higher than your competition.I have changed now to be a Ding customer"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Man",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T22:33:29.000Z",
          "Titre": "The app has problems and they don’t…",
          "Contenu": "The app has problems and they don’t want to accepted, really bad experience"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 1,
          "Date": "2021-08-02T12:21:17.000Z",
          "Titre": "I only wish I could sent charges of…",
          "Contenu": "I only wish I could sent charges of $100 or more instead of $62.00"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yesy",
          "Nb_Reviews": 1,
          "Date": "2021-11-29T22:56:35.000Z",
          "Titre": "It's expensive",
          "Contenu": "It's expensive. Cubatel has better prices"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Erasmo",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T09:01:57.000Z",
          "Titre": "Your price is highest that other…",
          "Contenu": "Your price is highest that other different companies"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Amado",
          "Nb_Reviews": 1,
          "Date": "2020-06-15T04:31:25.000Z",
          "Titre": "It was good to give a gift to family…",
          "Contenu": "It was good to give a gift to family and friend"
        },
        {
          "Note": 1,
          "Lieu": "SK",
          "Pseudo": "Jozef",
          "Nb_Reviews": 1,
          "Date": "2021-06-25T17:28:06.000Z",
          "Titre": "They recive recarga after 3-4 days I…",
          "Contenu": "They recive recarga after 3-4 days I payed"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2020-06-26T22:47:15.000Z",
          "Titre": "When things go wrong you are not…",
          "Contenu": "When things go wrong you are not helpful."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "cuccu",
          "Nb_Reviews": 4,
          "Date": "2022-07-16T08:10:56.000Z",
          "Titre": "Very expansive"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "blub",
          "Nb_Reviews": 1,
          "Date": "2021-05-31T19:41:50.000Z",
          "Titre": "I payed but not worked"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "750cc_boiii",
          "Nb_Reviews": 1,
          "Date": "2020-06-14T23:38:39.000Z",
          "Titre": "Overpriced",
          "Contenu": "Overpriced scam"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Denis",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T09:32:50.000Z",
          "Titre": "To expensive!"
        },
        {
          "Note": 1,
          "Lieu": "CL",
          "Pseudo": "Luis",
          "Nb_Reviews": 2,
          "Date": "2021-06-19T00:31:13.000Z",
          "Titre": "Good service"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "THARMARAJAH",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T05:00:40.000Z",
          "Titre": "yes last few years I am using you…",
          "Contenu": "yes last few years I am using you company to recharge. my friend's phone  in Cuba, I only use my credit card. with your company, recently my card information was used in America, to by the air ticket, I believe someone has access to my credit CARD INFORMATION IN YOUR COMPANY and did this fraud. Since that I am using prepaid credit card  to avoid this happen again.my advised please try to stop this happen to other clients, I am from Canada thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T01:53:31.000Z",
          "Titre": "Need to offer more and better specials"
        },
        {
          "Note": 2,
          "Lieu": "CU",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T00:57:18.000Z",
          "Titre": "Fonoma's unfair data rates and lack of explanation",
          "Contenu": "Fonoma's data rates are unfair. Fonoma does not fully explain that *Promotional *Bonuses* cannot be used as gb's for data. I purchased over $70 promo a month ago under another account for my other number just to realize that I had limited data and I couldn't use my full purchase on what I need which is data. Also, 2.5gb's for $12+USD is a rip off, data shouldn't cost that much."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Juan",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T10:19:44.000Z",
          "Titre": "Many times got my account frozen,got to…",
          "Contenu": "Many times got my account frozen,got to wait several hours without response from fonoma,I was left on my own,while people in Cuba was waiting desperately for the recharge.Shame on the service which I was paying without any problem.Regards thank you."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Mathew",
          "Nb_Reviews": 2,
          "Date": "2021-06-28T15:31:28.000Z",
          "Titre": "I don't understand your \"review\"…",
          "Contenu": "I don't understand your \"review\" processing, especially that I've been your client for quite a long time. I am wasting time waiting for the review instead of sending another and have it off my shoulders for the next two weeks."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Huub",
          "Nb_Reviews": 2,
          "Date": "2020-05-13T09:44:46.000Z",
          "Titre": "Unfortunately by using a wrong telepone…",
          "Contenu": "Unfortunately by using a wrong telepone number for the recharge for my friend Yaima 0n the 6+7 april the recharging failed and I lost my money ( about 50 Euro). In emails I asked to restore the situation. No commitment and very disapointing.  Yours sincery Huub Drost"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T16:38:15.000Z",
          "Titre": "Site would not allow viewing of…",
          "Contenu": "Site would not allow viewing of purchase history. Because of this I could not verify that purchase was made. Therefore I purchased another which I did not want to do at this time. Disappointing. I usually use DING and have never had this problem."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Christopher Lockie",
          "Nb_Reviews": 5,
          "Date": "2020-06-24T21:53:32.000Z",
          "Titre": "I made a recharge of 20 CUC which was…",
          "Contenu": "I made a recharge of 20 CUC which was supposed to attract a bonus of additional 20 CUC, but the extra 20 CUC bonus recharge was not honoured by ETECSA/Cubacel. What a behaviour!  And the costs of these recharges to CUBA are so high.... too high!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Arthur Wasserman",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T17:16:39.000Z",
          "Titre": "You have the highest rates on the…",
          "Contenu": "You have the highest rates on the planet for the poorest people in the western hemisphere. Totalitarian are terrible business managers. You population deserves a better life. Your island has so much potential."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Davide",
          "Nb_Reviews": 2,
          "Date": "2022-10-12T11:45:49.000Z",
          "Titre": "The price of the offers is too high"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Johnny",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T02:10:41.000Z",
          "Titre": "More expensive than other companies",
          "Contenu": "Wondering why you are more expensive than the other carriers. Why prices are more expensive. Wondering why I should stay with your company. There are no reasons"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Olivier",
          "Nb_Reviews": 3,
          "Date": "2020-05-14T14:27:50.000Z",
          "Titre": "My recharge was NOT sent",
          "Contenu": "My recharge that was sent to +53 55646359 was NOT sent, though the money has been taken from my account."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2020-09-26T13:02:01.000Z",
          "Titre": "I rate this s one star because you…",
          "Contenu": "I rate this s two star because you can’t cancel orders. Also you can’t get your money back."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T14:20:59.000Z",
          "Titre": "I sent 40cuc I was told 80cuc bonus but…",
          "Contenu": "I sent 40cuc I was told 80cuc bonus but my friend is saying he only received 40 cuc"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T16:25:51.000Z",
          "Titre": "Poor customer service",
          "Contenu": "Poor customer service. I asked a question ,I did not have a clear answer."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Dayli Fdez",
          "Nb_Reviews": 8,
          "Date": "2020-06-23T20:32:32.000Z",
          "Titre": "In euros it is more expensive than…",
          "Contenu": "In euros it is more expensive than other websites that offer the same."
        },
        {
          "Note": 2,
          "Lieu": "BR",
          "Pseudo": "Oziel",
          "Nb_Reviews": 1,
          "Date": "2020-05-14T10:10:13.000Z",
          "Titre": "Wonderful.",
          "Contenu": "Wonderful. Congratulations to too all. Hope that you keep it that way."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Chuchi",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T17:38:58.000Z",
          "Titre": "Text messages dont work",
          "Contenu": "Is that.your answer???To.my question?"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Denis",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T22:54:34.000Z",
          "Titre": "I paid 24$ can dollars you charge 34."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Alberto",
          "Nb_Reviews": 1,
          "Date": "2021-01-30T18:13:04.000Z",
          "Titre": "I send a message and never respond"
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Johan",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T07:50:56.451Z",
          "Titre": "Its ok no more"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2020-12-26T22:33:57.000Z",
          "Titre": "A Little Pricey",
          "Contenu": "But it works fine."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jack",
          "Nb_Reviews": 2,
          "Date": "2021-05-30T18:25:48.000Z",
          "Titre": "Too expensive"
        },
        {
          "Note": 3,
          "Lieu": "NO",
          "Pseudo": "denise",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T19:22:21.000Z",
          "Titre": "I was pretty happy with Fonoma but it…",
          "Contenu": "I was pretty happy with Fonoma but it is getting more and more expensive.I am disappointed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 3,
          "Date": "2021-05-08T04:14:15.000Z",
          "Titre": "Better if could schedule future recharges",
          "Contenu": "Would be better if you were able to schedule recharges ahead of time—OR to be able to send it, but not have it start until the receiver chooses to or opens it.The best thing of course would be for there not to be a time limit, and for it to be usage based so it can carry over months if not used much. Very, very expensive for very little—I hope this suggestions are taken to mind. You’ll have a lot more users if they are."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Chuck",
          "Nb_Reviews": 2,
          "Date": "2021-07-05T23:58:17.000Z",
          "Titre": "Price is Important",
          "Contenu": "I’ve used your company at times. But I’ve found another at a much more reasonable price. You should check the competition. I see you responded and no your price even with a 3% bonus offer is still much higher than Acuba. And so far I’ve also had fantastic service from them."
        },
        {
          "Note": 3,
          "Lieu": "AW",
          "Pseudo": "Gregory",
          "Nb_Reviews": 2,
          "Date": "2021-11-25T22:50:00.000Z",
          "Titre": "Review Use Fonoma.",
          "Contenu": "Good Evening, Neither That Good. Compared To Other Apps., Neither So Bad. Only It's Applied For Cuba Residents, Not For Other Countries. Maybe You Should Change That, In The Near Future.Gregory F. A. Bislip."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Marie",
          "Nb_Reviews": 1,
          "Date": "2020-08-17T03:40:21.000Z",
          "Titre": "If I recharge a mobil in Cuba",
          "Contenu": "If I recharge a mobil in Cuba, I pay more than 20€ for one month. The people received maximum 4GB, and half an hour to call, and 50sms internacionalIn my country I pay 20€ and i have 8GB and i can call without limit.This is a big difference. I think that Fonoma can do beter to help the poor people en Cuba. The crisis es hard. The people have no tourist ... So there live is not that simple"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Omer Renault",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T16:56:16.000Z",
          "Titre": "If it was not for double rechages jan…",
          "Contenu": "If it was not for double rechages jan 27 2019 and feb 9 2020 not caused by me I would of givin you a 5 star.I tried to contact you after feb 9th but got not reply.Another double recharge on dec 29 2019 was my error but not those after that date as I was very careful.I did use Ding after that but retried Fonomabecause of your kind operators."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T06:07:58.000Z",
          "Titre": "Might be 0 stars after this....",
          "Contenu": "It would have been 5 stars... But the last recharge I sent did not go through... My payment for it went through, but they never got there re charge and they are a 3rd party so the have to wait for some other company to investigate it... So I don't know if they will make it right and either give them the re charge, refund my money... I would prefer for them to just provide the re charge that I paid for already on August 8th and it is now August 12th with no resolution, I got a confirmation email from Fanoma saying it went through ant approximately 1 A.M. on August 9th... This is ridiculous and should not take this long and if they don't make it right then this will go from a 3 star to a 0 star real fast..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JAMES WILLIAMS",
          "Nb_Reviews": 4,
          "Date": "2021-01-06T19:01:47.000Z",
          "Titre": "I am not sure why the company switches…",
          "Contenu": "I am not sure why the company switches from CUP To CUC and back for different advertising deals, it was confusing and I think that I got shafted once because of not understanding the differences."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Colette",
          "Nb_Reviews": 1,
          "Date": "2020-09-09T19:01:01.000Z",
          "Titre": "Good & Bad ~",
          "Contenu": "Good & Bad ~ I like the service quite a bit. It is easy to use and reliable with very good customer service. An essential service for keeping in contact with Cuba. 5 stars here. BUT I find the exchange rate charged on CAD to USD very high. There is a Fonoma service fee, of course, that makes sense, yet Fonoma adds an extra 4% to exchange. The current exchange rate is 76% although I know no one ever sees the exact exchange. The exchange I received was 72%. For the 20CUC recarga, instead of costing approximately $26.30 + Service Fee, I was charged $36+ CAD by the time it comes to my account. In my opinion, that's very high. If I can find a more affordable, yet equally reliable service, I will be sure to change my habit of using Fonoma."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "George Gamache",
          "Nb_Reviews": 4,
          "Date": "2020-05-18T18:13:41.000Z",
          "Titre": "The recharges go through without a…",
          "Contenu": "The recharges go through without a problem. The Cuban people are paying too much for phone service and limited internet. It's more expensive than we pay for unlimited services in Canada and the USA."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Julian",
          "Nb_Reviews": 2,
          "Date": "2021-07-19T09:42:53.000Z",
          "Titre": "No is the services",
          "Contenu": "No is the services, but the offers are very expensive compared to the rest of the world. I suppose part of the problem is, the company's internal market analysis."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 4,
          "Date": "2021-07-03T22:26:16.000Z",
          "Titre": "More expensive than the competition",
          "Contenu": "It is not as good as other websites price wise. Other sites have the double recharge to Cuba for $19.00. Fomono is almost $25 o I won't be using them again. Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Norma",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T14:05:29.000Z",
          "Titre": "I sent the recharge on Monday",
          "Contenu": "I sent the recharge on Monday. Yesterday, Wednesday my brother ad not receive it yet. Please, let me know if there is a reason for the delay.   Thank you."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "nestor",
          "Nb_Reviews": 1,
          "Date": "2020-11-25T15:13:18.000Z",
          "Titre": "I used this service just to money in…",
          "Contenu": "I used this service just to money in the  mobile of my parents, but  is really expensive for the same price in EUROPE  i HAVE internet 24 hours per month"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debra Enos",
          "Nb_Reviews": 2,
          "Date": "2020-11-25T14:37:10.000Z",
          "Titre": "Ease of use but high service fees",
          "Contenu": "The service is easy to use and the regargas arrive quickly but I think they charge too much for their services.  A $20.00 recharge ends up being $24."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "alex",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T21:16:42.000Z",
          "Titre": "Everything works properly",
          "Contenu": "Everything works properly. Debtel deliveres the same for € 15,- instead of € 20,-.....Question: can you make special offers for Wifi?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "jerzy",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T19:09:22.000Z",
          "Titre": "It is too expensive",
          "Contenu": "It is too expensive, it could have been a bit cheaper."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Harry",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T15:02:34.000Z",
          "Titre": "Your promotion should apply to all of…",
          "Contenu": "Your promotion should apply to all of your clients not just for new ones and should be a monthly event not just a few days."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Aubrey",
          "Nb_Reviews": 1,
          "Date": "2020-06-09T17:53:22.000Z",
          "Titre": "I have had good luck with Fonoma",
          "Contenu": "I have had good luck with Fonoma. The only problem is that everything is in Spanish. I am sorry I do not speak Spanish."
        },
        {
          "Note": 3,
          "Lieu": "PA",
          "Pseudo": "Al B.",
          "Nb_Reviews": 1,
          "Date": "2020-08-19T21:01:42.000Z",
          "Titre": "Usually good",
          "Contenu": "Usually good, but a few times you never sent it and I had to eventually cancel it......Still dont understand why....."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T15:44:35.000Z",
          "Titre": "Too expensive in Canadian dollars!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2020-10-04T15:32:19.000Z",
          "Titre": "The rate of 20 CUC is deceptive you…",
          "Contenu": "The rate of 20 CUC is deceptive you charge 24 USA obviously 20 CUC is not worth 24 USAAn exchange rate of 20%?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "michel gonet",
          "Nb_Reviews": 2,
          "Date": "2020-11-13T12:27:09.000Z",
          "Titre": "the cost of recharging telephones for…",
          "Contenu": "the cost of recharging telephones for cubans are DISGUSTINGLY HIGH, it always feels like you got robbed"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amilkar",
          "Nb_Reviews": 1,
          "Date": "2021-08-01T15:33:00.000Z",
          "Titre": "I wish that they would allow $10…",
          "Contenu": "I wish that they would allow $10 recharge. It is basically too expensive. Best Regards1"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Corinne",
          "Nb_Reviews": 2,
          "Date": "2020-05-04T10:37:58.000Z",
          "Titre": "The  bonus is not always proposed",
          "Contenu": "The  bonus is not always proposed.  When  it’s not i but with ding . An other taker. Best regards"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T18:35:22.000Z",
          "Titre": "charge every month",
          "Contenu": "I would like to be able to charge my wife's phone once every full month! Not every 3 weeks."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "aaron",
          "Nb_Reviews": 2,
          "Date": "2021-03-25T08:08:14.000Z",
          "Titre": "Sometimes it takes very long time to…",
          "Contenu": "Sometimes it takes very long time to make recharges if you make more Than one recharge."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Alissa",
          "Nb_Reviews": 2,
          "Date": "2020-08-28T16:36:29.000Z",
          "Titre": "more expensive than others but when…",
          "Contenu": "more expensive than others but when there is a limit I have to use this as my second choice"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T01:18:10.000Z",
          "Titre": "I couldn't do another recharge to Cuba",
          "Contenu": "I couldn't do another recharge to Cuba Phone 55314390 it won't go through"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "robert",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T07:55:07.000Z",
          "Titre": "The only thing for me",
          "Contenu": "The only thing for me, is converting Canadian into US dollar then to Cuban pesos."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Sigi",
          "Nb_Reviews": 1,
          "Date": "2020-06-09T07:47:22.000Z",
          "Titre": "It says 20 dollar to pay but it's…",
          "Contenu": "It says 20 dollar to pay but it's always like 21euros, more expensive then promoted"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "pedro",
          "Nb_Reviews": 1,
          "Date": "2020-12-29T01:40:23.000Z",
          "Titre": "You should have more sales specially…",
          "Contenu": "You should have more sales specially with the time of having to keep away"
        },
        {
          "Note": 3,
          "Lieu": "BW",
          "Pseudo": "Juan",
          "Nb_Reviews": 1,
          "Date": "2020-08-26T10:56:37.000Z",
          "Titre": "I more expensive than others I hope to reduced the prices. Please",
          "Contenu": "I more expensive than othersWe hope to reduce the prices Please"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "stephane",
          "Nb_Reviews": 1,
          "Date": "2021-09-13T05:46:27.000Z",
          "Titre": "A lots of Time",
          "Contenu": "A lots of Time , spécial is only for New users"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Lorenzo",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T13:50:54.000Z",
          "Titre": "Too pricey for too little gigas."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rafael",
          "Nb_Reviews": 1,
          "Date": "2021-02-14T19:28:52.000Z",
          "Titre": "It seems that we are paying for less…",
          "Contenu": "It seems that we are paying for less this year."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Laura",
          "Nb_Reviews": 3,
          "Date": "2020-05-09T13:02:23.000Z",
          "Titre": "It doesn’t work when using Safari on…",
          "Contenu": "It doesn’t work when using Safari on Iphones"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T08:04:21.000Z",
          "Titre": "You need to have information in english."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "dierick",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T06:56:45.000Z",
          "Titre": "es caro la comosion",
          "Contenu": "es caro la comosion its expensive"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jean-pierre",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T12:31:49.000Z",
          "Titre": "too expensive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jose M Beltran",
          "Nb_Reviews": 5,
          "Date": "2021-05-15T03:30:35.000Z",
          "Titre": "More expensive than competition",
          "Contenu": "Ding is slightly less expensive"
        },
        {
          "Note": 3,
          "Lieu": "CZ",
          "Pseudo": "Uru",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T15:36:18.000Z",
          "Titre": "More data",
          "Contenu": "More data, much more"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Marek",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T10:46:51.000Z",
          "Titre": "I don't speak Spanish"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Senanu",
          "Nb_Reviews": 2,
          "Date": "2020-07-14T18:52:19.000Z",
          "Titre": "Price is still too High"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Serge",
          "Nb_Reviews": 2,
          "Date": "2020-05-12T05:08:11.000Z",
          "Titre": "Too much expensive!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Arturo",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T15:22:34.000Z",
          "Titre": "Too expensive"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "william",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T18:25:01.000Z",
          "Titre": "I was surprised at the price increase…",
          "Contenu": "I was surprised at the price increase on my last recharge I sent it use to be 24.00 American and this one was about 38 , not good I.will have to find another way to send a recharge????"
        },
        {
          "Note": 4,
          "Lieu": "HN",
          "Pseudo": "RAYMOND",
          "Nb_Reviews": 5,
          "Date": "2023-03-26T09:52:01.000Z",
          "Titre": "The thing I do not like is that they…",
          "Contenu": "The thing I do not like is that they will not allow me to send three recharges in the row. When I try to send the third one it sends it to security I send you the same numbers so I don't understand what the problem is other than that your service is fine"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Trym Boxing",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T19:51:24.000Z",
          "Titre": "I am very satisfied with Fonoma.",
          "Contenu": "I am very satisfied with Fonoma.It's easy to order top-up for my contacts in Cuba.This has worked for a long time, but one of my last transfers on February 31st to # +(53)-5282-9127. Order ID 124709146, according to recipient Miosoti Rodriguez, her cell phone was not charged..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-03T08:03:51.000Z",
          "Titre": "Usually happier…",
          "Contenu": "I feel that you advertised one promotion and what my friend in Cuba got was about 20% or so, less. He told me you give them emergency funds??? Crazy and he told me you ‘discounted’ what I paid for."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ruby",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T21:02:01.000Z",
          "Titre": "I appreciate the opportunity to assist…",
          "Contenu": "I appreciate the opportunity to assist our friends & family in Cuba. One positive thing is that the transfers happen pretty much right away.  The only negative is týhat the currency conversion could be much better."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "ennio",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T17:48:56.000Z",
          "Titre": "very good",
          "Contenu": "very good. b.regards"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ginette",
          "Nb_Reviews": 2,
          "Date": "2023-01-23T16:15:47.000Z",
          "Titre": "easier",
          "Contenu": "i would like the expérience in French , thank you"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Roar Løver, Kongsberg",
          "Nb_Reviews": 9,
          "Date": "2023-01-23T10:41:35.000Z",
          "Titre": "Fast and easy way of charging cellphones"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JG",
          "Nb_Reviews": 3,
          "Date": "2021-11-15T21:14:46.000Z",
          "Titre": "Fonoma is great, could be even better",
          "Contenu": "Fonoma is great!  One thing could make it better. It would be nice if you could add a phone charge to a \"cart\", and then add others to the same cart before checking out.  I usually send 4 phone charges to different people at a time, and it's a little annoying to have to keep performing the same steps for every charge."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "charles frederic",
          "Nb_Reviews": 2,
          "Date": "2021-12-11T20:28:53.000Z",
          "Titre": "A little problem that can be mejored, to be optimum!",
          "Contenu": "The little problem you have not organised the posibility d'apreciate in french or in spanish, and after aproxymary tens recargas your service don't accept more recargas, please intent to change that!    To have a really completly good service!   Frédéric Charles."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T04:00:47.000Z",
          "Titre": "Last week",
          "Contenu": "Last week, I was in Cuba and my sold have become  verry low to me and I was afraid to not have suficiently minutes to can use my phone before come back at Canada. Like I can't use my credit card to make me more credit on my line, I ask to my friend, in Canada, to make this for me. So, it had been so hard to her, to can understand with you to make the transaction for the tranfer. Hours had been necesary to can complete the transaction, some calls and verifications without end. Then, she told me that had been very hard and was near to cancel the bought before at least, I finaly receve the charge."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Eduardo",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T14:52:34.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, just a couple of points as feedback:1. It would be great to be able to send multiple recharges at the same time, meaning being able to send recharges to multiple numbers at the same time.2. Often my Paypal payment is on hold for an hour or so after the second recharge, \"being verified\" not sure why that is, for verified customers, this shouldn't be the case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T14:35:08.000Z",
          "Titre": "Expensive, but reliable.",
          "Contenu": "I have not had any problems with the service at Fonoma, but I have to limit recharges to when there are discounts. The service is too expensive otherwise. Nevertheless, I consider the service essential for people with families and friends in Cuba. I am thankful their service is available. If the normal rates were cheaper, I would send recharges more often."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Theodore",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T18:15:32.000Z",
          "Titre": "The service is fairly east to use…",
          "Contenu": "The service is fairly east to use however one thing you could add, unless its there and I don't see it is to have an English, French or other option on the home page. Here in Canada Eng & Fre are the common languages spoken. It would help to understand what you are doing. Right now I just go thru the motions from memory. If your site or procedure ever changed, I would never been able to recharge a phone because I wouldn't understand anything."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "katia",
          "Nb_Reviews": 7,
          "Date": "2021-09-24T17:53:11.000Z",
          "Titre": "I enjoy the service and the direct…",
          "Contenu": "I enjoy the service and the direct contact with your staff they are very lovely, it would be nice though to have an emergency contact for countries like Cuba where things can get complicated as my aim is to help my friends there but as i am sure you are aware things are not always easy with the services in Cuba.So far so good so hope to continue to use your services for the long future. Offers are great maybe if possible amounts that can go into their main balance so that it can be used longer than a month?just expressing a wish that's all. thank you."
        },
        {
          "Note": 4,
          "Lieu": "NI",
          "Pseudo": "Tor",
          "Nb_Reviews": 1,
          "Date": "2021-07-29T16:29:26.000Z",
          "Titre": "Well",
          "Contenu": "Well, you are Almost 5 Star Fenoma. JejeAlso good to see you Ask customers to help make you better. Democracy.))Wish we could also send Money to Cuban Friends and Family via Fenoma.You are very good now informing me when you have special rates on sending recargas to Cuba.Buenos tardes))"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lucy",
          "Nb_Reviews": 1,
          "Date": "2021-08-28T12:53:47.000Z",
          "Titre": "Great service!!",
          "Contenu": "Great service!!However, we are trying to help our Episcopal Cuban friends in Vertientes, and it’d be truly wonderful if you would provide the bulk discount for under 10 lines/month ... Please consider this under the dire pandemic circumstances in Cuba.Many thanks!LB"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vincent",
          "Nb_Reviews": 2,
          "Date": "2020-12-01T00:45:45.000Z",
          "Titre": "My first experiences with using Fonoma…",
          "Contenu": "My first experiences with using Fonoma was a bit annoying because there seemed to have been a constant delay and request for additional authorization, I think if I entered the correct login and card information, there should no need for any additional.  To me, the process was flowed; I don't seem to have that issue anymore."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Angelo",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T10:20:46.000Z",
          "Titre": "I had a small problem with a…",
          "Contenu": "I had a small problem with a advertisement that talked about promotion. The period of this promotion was not clearly seen. Better to put promotion and validity period together so that it is transparent. Thank you Angelo Frate"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2020-07-08T10:34:43.000Z",
          "Titre": "keeping in touch",
          "Contenu": "Thank you for the oportunity to keep in touch with the loved ones. Also very pleased that you offer a recharge at 10$. Everytume I had an issue your team was very helpful. The only thing is sometimes the recharge doesn’t go the right day when there is a promoción and in those cases an extra dy should be added. I know it is not Fonoma’s fault but ETECSA is robing data maybe you could put some pressure on them."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "alfredpleiter",
          "Nb_Reviews": 1,
          "Date": "2021-02-11T18:17:23.000Z",
          "Titre": "Recharging is easy",
          "Contenu": "Recharging is easy. But its inconvenient that cubatel has no english version of the recharge module. And it gives not much insight of the possibilities a recharge give. For foreigners who are used to unlimited data for landlines, reasonable amounts of data for cellulars and mostly free calls its weird."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Audrey",
          "Nb_Reviews": 1,
          "Date": "2020-05-14T18:58:05.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, fast, with a website easy to use.However, a few months ago, I had registered my credit card number in my account, and a hacker used my credit card the day after I sent recharges. Not sure it’s related but I think it is as it’s the only website where I had registered this card. Now I erase the card number after each purchase. Anyways, still using Fonoma !"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Stanley COLIMON",
          "Nb_Reviews": 3,
          "Date": "2021-01-05T00:03:42.000Z",
          "Titre": "Just one bad experience.",
          "Contenu": "Quite satisfied, but I once had a very bad experience with the site. I sent a recharge and something went wrong (no matter what). I made the correction and sent it again. Than after, I realize that the phone number had changed. So either make sure to keep the data previously seized on the page, or at least, empty the field(s). As a computer science teacher I was disappointed and upset for sending to someone else, against my will.I intend to use Fonoma Business soon. I seems to be convenient for my needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TONY",
          "Nb_Reviews": 1,
          "Date": "2020-09-07T01:14:11.000Z",
          "Titre": "Hi everybody",
          "Contenu": "Hi everybody.  I been using Fonoma for sometime by now and I have no problem.  And when I had any issue I contact customer service and they help me so what could I say  . The only thing I DON'T like it's the 4 Dallas I have to pay for one recharge I think it could be better. THANKS a lot for your service."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Arthur & Yamell Cornelese",
          "Nb_Reviews": 5,
          "Date": "2020-06-27T13:00:17.000Z",
          "Titre": "Service",
          "Contenu": "Service, the app, et.cetera are perfect! The only thing is that they are a little to expensive. With another company you get the same recharge for almost 3 euros less. If you recharge reguarly, in my case 2 or 3 times a month, the difference is to big.Even if you get a discount step by step you can use to reduce the price."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T23:32:37.000Z",
          "Titre": "Works well, safe",
          "Contenu": "Saves my contacts"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Pink",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T12:32:03.000Z",
          "Titre": "Could have better deals for the price...",
          "Contenu": "I am truly happy with the services but seriously i find the recharges for us Canadian people with money exchange extremely expensive for what they receive.  It is always for someone outside Cuba most of the time that has to help them out with their phones.....Cannot give 5 stars because it can be better"
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Tara",
          "Nb_Reviews": 1,
          "Date": "2021-07-17T09:21:31.000Z",
          "Titre": "Sending recargas with fonoma is easy…",
          "Contenu": "Sending recargas with fonoma is easy and fast, I would only like to also be able to send multiple recargas with one payment and not have pay each recarga individually. Or maybe if this is alredy possible the instructions would have to be clearer."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "NICK",
          "Nb_Reviews": 1,
          "Date": "2020-10-08T01:06:10.000Z",
          "Titre": "I would have given you 5 stars but once…",
          "Contenu": "I would have given you 5 stars but once or twice I felt I got ripped off because I did not get the bonus . I blamed your ads as being misleading . Right now I am satisfied though as I have had smooth transactions for the last several months .Thank you and keep up your good work ."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sébastien",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T02:56:32.000Z",
          "Titre": "Good service",
          "Contenu": "Good service. Only thing I'd like a little bit more, for example if I send a recharge of 20 cuc, you put a bonus of 40 cuc but on local call only. Since I'm in Canada, would it be possible to put like 20 cuc on bonus megabits,and 20 on local call? Any constructive feedback would be welcome"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cathy",
          "Nb_Reviews": 1,
          "Date": "2020-05-13T02:59:20.000Z",
          "Titre": "Thank you for the promotions!",
          "Contenu": "I prefer the previous promotion to the currant one.  I wish you could get the promotions all the time, for someone who sends as many recharges as I do.  I am still happy that we have Fonoma and I am able to send recharges to Cuba from Canada instantly.  Thank you for that!  Sincerely, Cathy"
        },
        {
          "Note": 4,
          "Lieu": "CU",
          "Pseudo": "Pedro",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T03:00:03.000Z",
          "Titre": "Fonoma has a good recharge services to…",
          "Contenu": "Fonoma has a good recharge services to Cuba cellphone.  It's support service is great and always be in improve. My only opinion is for grow it's market with others services like money transfer to Cuba bank accounts."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Haim",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T11:31:42.000Z",
          "Titre": "usualy the servise is good ."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Marie",
          "Nb_Reviews": 2,
          "Date": "2020-05-16T21:39:20.000Z",
          "Titre": "Revise terms",
          "Contenu": "It is good to be able to send credit but wish it could last longer than a month. Also, some people in Cuba don’t have 4 G capacity on mobiles so the data part of promotion is useless to them. Maybe a few revisions to give better value to Cubans receiving the credit."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ihar",
          "Nb_Reviews": 1,
          "Date": "2021-02-11T15:04:11.000Z",
          "Titre": "How to pay CUP",
          "Contenu": "Ya, it's good overall, using few years..but why cubans can't recharging Cuba got using own card and pay w CUP (how you promote)?! It's kinda tricky...not really even close 20 cuc o 500cup..almost double come to!Thanks 😊"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Marilynn",
          "Nb_Reviews": 7,
          "Date": "2020-06-23T07:00:35.000Z",
          "Titre": "Love all the notices",
          "Contenu": "Love all the notices they give , especially when special is onOn the whole , service is prompt One thing I do not like , is constantly having to ask for it to be sent in English They do not for what ever reason understand and very frustrating"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T21:56:15.000Z",
          "Titre": "Fonoma is a fast efficient way to send…",
          "Contenu": "Fonoma is a fast efficient way to send a recharge (phone minutes) to people in Cuba.  I have been using it for more than 3 years.   It is cost effective and super easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T20:49:04.000Z",
          "Titre": "Its good but now many companies have…",
          "Contenu": "Its good but now many companies have the same deals with having to pay less Next recharge I am going to tryout another company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Antonio",
          "Nb_Reviews": 1,
          "Date": "2020-06-05T03:12:34.000Z",
          "Titre": "To me it's been a great service I have…",
          "Contenu": "To me it's been a great service I have no complaint , I know  you got it make some money to pay to your workers but I AM not sure if 4 dollars for one service is ok maybe yes maybe not  I just WANT things to be fare.  Thanks."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Denis",
          "Nb_Reviews": 1,
          "Date": "2021-07-04T17:20:35.000Z",
          "Titre": "I am very happy with the service I…",
          "Contenu": "I am very happy with the service I received, fast and courteous.There  something on the other hand that I hav a problem with is how do I find the list and the dates the  previous echarges are listed?"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T11:17:48.000Z",
          "Titre": "Great service",
          "Contenu": "Great service.  Blessed to be able to help our Cuba friends stay in touch with their families as they face the hardships of Covid 19 . We have been using this service for a few years and have never had any problems.  Thanks"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Bobby",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T22:09:33.000Z",
          "Titre": "The prices should be lower…",
          "Contenu": "The prices should be lower !!!!!!!!!!!!!!!!!!!!!!!&I feel that I should get some kind of a PERK sometimes because I have been a long time client of yours; but I have never received anything ?    :("
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2020-07-17T16:03:46.000Z",
          "Titre": "I am Canadian and wish your would…",
          "Contenu": "I am Canadian and wish your would charge my card in Canadian$ instead of USD for which everyone knows gets assessed a 20% penalty becoming $24USD then converted to $CDN. People can pay in EUROs so why not CDN$"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2020-10-29T21:29:48.000Z",
          "Titre": "I am not happy with buying into the…",
          "Contenu": "I am not happy with buying into the bonus special then finding out the minutes must be used up in 30 days, failing which. they are LOST. Thus, buying the larger amounts is pointless....virtually stupid."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JULIANE",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T05:21:53.000Z",
          "Titre": "I find the service very fast and…",
          "Contenu": "I find the service very fast and reliable. The only thing I would like to see improved is the packages. They seem to change every monthso it gets a little confusing. But overall the service is great!"
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Tor Gjesdal",
          "Nb_Reviews": 2,
          "Date": "2020-05-05T18:14:17.000Z",
          "Titre": "Fenoma has been very good for me",
          "Contenu": "Fenoma has been very good for me. Only problem I have had is sending money to Cuba when there is no sale ( discount ) period.Your Chat is aso exellent,; promt, friendly and helpful people also."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roxana",
          "Nb_Reviews": 2,
          "Date": "2020-06-09T16:05:17.000Z",
          "Titre": "The service is great and make…",
          "Contenu": "The service is great and make communication with family and friends possible. But sometimes the promotions are unclear. It’s difficult to understand what “Schedule a recharge” means."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "eduardo raonel puente sánchez",
          "Nb_Reviews": 2,
          "Date": "2021-05-19T21:25:40.000Z",
          "Titre": "comment",
          "Contenu": "Efficient, fast and clear service. Valuation of the payment in hard currency (€, $) .. My suggestion: for more frequently used customers, increase the discount."
        },
        {
          "Note": 4,
          "Lieu": "EC",
          "Pseudo": "Yasmany",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T11:48:06.000Z",
          "Titre": "from time to time i get on hold a few…",
          "Contenu": "from time to time i get on hold a few hours reviewing payments on numbers I have already use and with a payment method, I have already used. which its really annoying"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T15:31:32.000Z",
          "Titre": "The service is not always reliable",
          "Contenu": "The service is not always reliable. The internet connection to the program drops a lot during promotional periods."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Casey",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T00:50:37.000Z",
          "Titre": "Good service.",
          "Contenu": "I like that you offer some of the information in english and have had no problems with the service. It works and it helps me help some friends in Cuba. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Robert Moran",
          "Nb_Reviews": 6,
          "Date": "2021-05-07T17:39:48.000Z",
          "Titre": "Actually",
          "Contenu": "Actually, I send the recharge to a friend and she always thanks me.Beyond that I have no idea.I guess I will ask her next time I speak to her."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tricia",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T20:45:00.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I just wish that i did not have to pay in Canadian money so much more of a difference. But the rate is different so no choice. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kerry",
          "Nb_Reviews": 1,
          "Date": "2021-04-17T19:01:07.000Z",
          "Titre": "It is fairly easy to recharge with…",
          "Contenu": "It is fairly easy to recharge with fonoma. It would be nice to get my emails in English but it is also easy to copy the email and translate."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cubanito229",
          "Nb_Reviews": 2,
          "Date": "2020-05-26T18:48:45.000Z",
          "Titre": "I don't like that the recharge expires…",
          "Contenu": "I don't like that the recharge expires after a month. We should be able to carry over whatever is left. Also it is less than a month not 30 days."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gerald",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T21:22:18.000Z",
          "Titre": "Good service",
          "Contenu": "The service is generally very good but sometimes there is a short delay in sending recharge while they undertake checks."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "robert",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T20:31:03.000Z",
          "Titre": "Punctual and straight forward service but to Cuba is not fair enough",
          "Contenu": "Punctual and straight forward service but to Cuba is not fair enough."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Herminio Manso Jubier",
          "Nb_Reviews": 5,
          "Date": "2021-07-14T08:00:52.000Z",
          "Titre": "it is",
          "Contenu": "it is , at times, difficult to do what you want, particularly when you signed in and later on you have to do it again. Inconsistent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michel & Ward, PC",
          "Nb_Reviews": 2,
          "Date": "2022-06-28T14:45:20.000Z",
          "Titre": "Good deals and good reminders about…",
          "Contenu": "Good deals and good reminders about when the deals are expiring (so I don't miss them!)"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "JULIA LYNN FISHWICK",
          "Nb_Reviews": 6,
          "Date": "2020-05-12T13:15:11.000Z",
          "Titre": "When you send email regarding recharge…",
          "Contenu": "When you send email regarding recharge I can enter directly with success.But if I try to go directly to your website the page does not open."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Carl",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T16:16:37.000Z",
          "Titre": "Good but expensive",
          "Contenu": "Good service but as I have to pay in Us funds credit card company  charges 5dollar service  charge for converting  from Canadian  funds"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sylvie",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T21:31:47.000Z",
          "Titre": "You always send message in spanish and…",
          "Contenu": "You always send message in spanish and i m french and i speak english too , so i always have To right To you too send me in english"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mohammad",
          "Nb_Reviews": 1,
          "Date": "2020-05-31T15:43:36.000Z",
          "Titre": "Hi,hello",
          "Contenu": "Hi,It is fast and efficient,But the data is not working good for the area where she is,The connection is not good for face time,Thanks"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2020-06-09T11:00:45.000Z",
          "Titre": "great way to help friends in Cuba to…",
          "Contenu": "great way to help friends in Cuba to keep in touch with family. Recharges are always available on time and bonuses are really appreciated"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Julio",
          "Nb_Reviews": 1,
          "Date": "2021-06-25T00:43:57.000Z",
          "Titre": "Love it!!",
          "Contenu": "Love it!!! I wish the accumulative credit should be higher, that will bring more customers, therefore more recharges"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2020-12-10T04:46:58.000Z",
          "Titre": "recipient did not get the bonus offered…",
          "Contenu": "recipient did not get the bonus offered by cubacel.they only got the basic amount..nothing extra from the promotion"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Armando",
          "Nb_Reviews": 2,
          "Date": "2021-03-26T16:09:08.000Z",
          "Titre": "Effective",
          "Contenu": "Effective. Fast. Friendly. Constant information about specials. Friendly people the common of the Cuban people."
        },
        {
          "Note": 4,
          "Lieu": "RS",
          "Pseudo": "Nebojsa",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T10:43:48.000Z",
          "Titre": "Recharge received after few hours",
          "Contenu": "Recharge received after few hours. It will be good to make possibility to send meessage togehther with recharge"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2021-01-13T11:56:36.000Z",
          "Titre": "I was disappointed not to be able to…",
          "Contenu": "I was disappointed not to be able to use your service over the Holiday period and I had to go with Rebtel"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Wlodzimierz Skwara",
          "Nb_Reviews": 7,
          "Date": "2020-09-23T19:23:17.000Z",
          "Titre": "Fonoma service",
          "Contenu": "Sometimes I have to wait half an hour or longer to top up my friends phone but all service is professional"
        },
        {
          "Note": 4,
          "Lieu": "CW",
          "Pseudo": "arthur",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T20:38:02.000Z",
          "Titre": "easy to use",
          "Contenu": "easy to use and I like the payment system. Suggest to modify the contact list alphabetically"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "rebar",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T14:47:56.000Z",
          "Titre": "All was fine",
          "Contenu": "All was fine. I use regularly but my guy uploaded one of these and did not get the bonus 3x ?????"
        },
        {
          "Note": 4,
          "Lieu": "QA",
          "Pseudo": "Libra",
          "Nb_Reviews": 1,
          "Date": "2020-05-27T03:54:50.000Z",
          "Titre": "Recharging to Cuba is very fast and…",
          "Contenu": "Recharging to Cuba is very fast and safe at fonoma. I would recommend to everyone to recharge here."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T22:37:55.000Z",
          "Titre": "A good efficient service",
          "Contenu": "A good efficient service. Bonuses are varied and sometimes attractive."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Natacha",
          "Nb_Reviews": 1,
          "Date": "2021-06-30T19:06:10.000Z",
          "Titre": "Excellent services",
          "Contenu": "Thé service is wonderful but I would  like to have a promotion for 15$.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rainer",
          "Nb_Reviews": 2,
          "Date": "2022-04-27T23:26:55.512Z",
          "Titre": "Everything works well ,you just a…",
          "Contenu": "Everything works well ,you just a little more expensive than rebtell"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gaponov",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T14:32:11.000Z",
          "Titre": "The service is reliable.",
          "Contenu": "The service is reliable.Sometimes my ftiends experiene a delay with getting recarga.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ramonin Alvarez",
          "Nb_Reviews": 3,
          "Date": "2020-12-10T17:37:24.000Z",
          "Titre": "Is just a little more more money using…",
          "Contenu": "Is just a little more more money using fonoma but team is great and they work fastThanks"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T11:16:37.000Z",
          "Titre": "great company",
          "Contenu": "I use fonoma since years , it's work perfectly to make recharge of phone."
        },
        {
          "Note": 4,
          "Lieu": "HR",
          "Pseudo": "Ervin",
          "Nb_Reviews": 2,
          "Date": "2021-03-13T08:15:43.000Z",
          "Titre": "VERY GOOD.ALMOST EVERYTHING IS…",
          "Contenu": "VERY GOOD.ALMOST EVERYTHING IS POSSIBLE.MUCH SIMPLER AND MORE USER FRIENDLY THAN DING"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "kris",
          "Nb_Reviews": 1,
          "Date": "2021-11-29T20:51:40.000Z",
          "Titre": "Your service is great but nit price…",
          "Contenu": "Your service is great but nit price competetive. I think Rebetel is cheaper"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T04:09:13.000Z",
          "Titre": "Good and straight forward service.",
          "Contenu": "Good and straight forward service.When required, very usuful customer service via chat."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T15:51:08.000Z",
          "Titre": "None",
          "Contenu": "Sometimes a little slow getting to my recipients. Other than that. Good"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Endi",
          "Nb_Reviews": 2,
          "Date": "2021-08-02T05:43:27.000Z",
          "Titre": "some times",
          "Contenu": "some times, it did not go through, and take to much time to solve the issues."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "claude",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T21:25:23.000Z",
          "Titre": "Reliable",
          "Contenu": "Reliable never any problems and the recharge get to my recipient in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "brian",
          "Nb_Reviews": 2,
          "Date": "2021-05-31T20:46:19.000Z",
          "Titre": "Excelente.",
          "Contenu": "Exelent work and clarity in the recharge of our family communication system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "macario",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T16:28:21.000Z",
          "Titre": "It's good service fair prices",
          "Contenu": "It's good service fair prices Good promocions.I ma happy"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Paolo",
          "Nb_Reviews": 1,
          "Date": "2020-07-17T15:10:21.000Z",
          "Titre": "MY EXPERIENCE WITH FONOMA WAS GREAT",
          "Contenu": "MY EXPERIENCE WITH FONOMA WAS GREAT. I AM VERY SODISFACTED OF YOUR WORK.Saludos"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "stefano",
          "Nb_Reviews": 1,
          "Date": "2020-05-13T11:16:29.000Z",
          "Titre": "I don't know if this is the less…",
          "Contenu": "I don't know if this is the less expensive operator but i know it is serious"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Michel",
          "Nb_Reviews": 2,
          "Date": "2020-05-15T22:54:27.000Z",
          "Titre": "Too short",
          "Contenu": "I did not give a 5 stars because i find the bonus should be more than 1 month"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Tonny",
          "Nb_Reviews": 2,
          "Date": "2020-07-23T20:13:40.000Z",
          "Titre": "It would be nice that i recive the…",
          "Contenu": "It would be nice that i recive the promotions in englisch istaef of spanisch"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandy Johnson Shockley",
          "Nb_Reviews": 2,
          "Date": "2020-05-13T00:01:21.000Z",
          "Titre": "You have helped us quickly turn friends…",
          "Contenu": "You have helped us quickly turn friends in another country’s cell service on"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "jo",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T01:12:38.000Z",
          "Titre": "Not bad at app works  good..",
          "Contenu": "Not bad at app works  good... scan bave ôter promo  header 5 or 10 cuc"
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "Yn",
          "Nb_Reviews": 1,
          "Date": "2021-03-29T14:19:30.000Z",
          "Titre": "It’s ok",
          "Contenu": "It’s ok. I wish you got bigger discounts or credits from time to time."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Astrid Castricum",
          "Nb_Reviews": 3,
          "Date": "2020-07-14T09:07:44.000Z",
          "Titre": "It is oke",
          "Contenu": "It is oke. Its better when the VS stop the block and help the Cuban people"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Martinho",
          "Nb_Reviews": 3,
          "Date": "2022-07-15T17:41:54.000Z",
          "Titre": "Price too higher to Cubacel or Dime…",
          "Contenu": "Price too higher to Cubacel or Dime Cuba."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbaro",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T17:57:14.000Z",
          "Titre": "Very safety",
          "Contenu": "Very safety, fast and comfortable. However you can find cheaper companies."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Danny Kwan",
          "Nb_Reviews": 2,
          "Date": "2020-07-16T18:11:07.000Z",
          "Titre": "Money deliver fast,but the prices…",
          "Contenu": "Money deliver fast,but the prices charge more expensive than movilescuba."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JO",
          "Nb_Reviews": 1,
          "Date": "2020-08-02T23:39:34.000Z",
          "Titre": "should give more free smsm or option to…",
          "Contenu": "should give more free smsm or option to buy bundle msg or calls to cuba"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Liette",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T12:09:08.000Z",
          "Titre": "I need more bonos or good price  for…",
          "Contenu": "I need more bonos or good price  for call international ..cuba - canada"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Daniella",
          "Nb_Reviews": 3,
          "Date": "2023-05-12T12:27:42.000Z",
          "Titre": "Very quickly answer on my questions…",
          "Contenu": "Very quickly answer on my questions about the charges. The chatt conversation was more than good!Best wishes Daniella"
        },
        {
          "Note": 5,
          "Lieu": "CU",
          "Pseudo": "Debbie Armstrong",
          "Nb_Reviews": 4,
          "Date": "2023-05-12T13:21:45.000Z",
          "Titre": "Service was quick and special offers…",
          "Contenu": "Service was quick and special offers are good."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Roberto",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T01:27:12.000Z",
          "Titre": "Trusted",
          "Contenu": "Wonderful service and very trustworthy staff"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Manuel",
          "Nb_Reviews": 2,
          "Date": "2023-02-09T05:55:24.000Z",
          "Titre": "Fonoma it has been great for me and my family.",
          "Contenu": "Fonoma it has been great for me and my family in Cuba, is easy and secure to use. Before Fonoma I was using recargascuba and they sold my bank information to Ding and they started taking money out of my account. I trust Fonoma 100% and I’m glad there are promotions more often than before. Thank you all of you for making possible to be in contact with Cuba."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Karim",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T16:34:01.000Z",
          "Titre": "Good morning",
          "Contenu": "It's excellent customer service everything going very well thank you very much ,"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rocket",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T03:54:59.000Z",
          "Titre": "Best of the services available. More megas!",
          "Contenu": "Gentlemen, Pricewise, hoping for lowering, it is after all, a very competitive service area. The best feature is... your immediate recharge. Wanting a service to provide Mb. Large amounts. Streaming, internet learning courses. More megas."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Hans",
          "Nb_Reviews": 5,
          "Date": "2023-02-17T21:46:48.000Z",
          "Titre": "Trustworthy.",
          "Contenu": "Easy to transfer money although you have to provide a lot of information of the person in Cuba. But I used this site earlier and the money always arrived quickly in Cuba."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ajay",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T22:04:53.000Z",
          "Titre": "Always accurate and website is easy to…",
          "Contenu": "Always accurate and website is easy to use."
        },
        {
          "Note": 5,
          "Lieu": "BW",
          "Pseudo": "Ariuska",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T07:12:00.000Z",
          "Titre": "Is importante for people to have an excellent service",
          "Contenu": "Is great to use Fonoma because of the qualified and fast service.I think that you are doing an excellent job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alberto",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T13:25:36.000Z",
          "Titre": "Trustful company, I've been using over 4 years",
          "Contenu": "Seems to be a trusted service company. I've been using over 3 years and never had a problem to report.Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GT",
          "Pseudo": "Enrique",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T04:24:39.000Z",
          "Titre": "Amazing site",
          "Contenu": "Efficient, and just really wasy to use! Great tool to send a gift to family!"
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Radócz",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T13:22:50.000Z",
          "Titre": "easy to understand",
          "Contenu": "easy to understand, quick, secure, never had the feeling that something is not clear during transactions."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Luca Pratesi",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T00:08:36.000Z",
          "Titre": "Very good! Simple, quick, perfectly working."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T21:36:11.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. And they remember my information making it very fast."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DOUGLAS A. BETHUNE",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T14:53:18.000Z",
          "Titre": "Easy to negotiate top-ups ."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "jos",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T14:35:20.000Z",
          "Titre": "Quick clear service and promotions."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Nadja",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T11:44:50.000Z",
          "Titre": "great",
          "Contenu": "The deal always works great. I use it since 3 years and never had problems."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "danielle",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T14:40:04.000Z",
          "Titre": "Yearly plans needed",
          "Contenu": "While the service has been appropriate, it is lacking in terms of offering.Cubans have difficulties and individuals trying to assist are obviously being over charged for something that should be made affordable to all Cubans with the assistance of others. Fonoma will lose customers if they don't come up with yearly plans."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bogdan",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T06:17:32.000Z",
          "Titre": "very good web side I did never had…",
          "Contenu": "very good web side I did never had problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "maria",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T21:55:25.000Z",
          "Titre": "It is easy to follow and always on time."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Zalmai",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T01:05:21.000Z",
          "Titre": "Very good promotions and on time delivery"
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Selvin",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T20:55:48.000Z",
          "Titre": "Very quick and efficient services and…",
          "Contenu": "Very quick and efficient services and great customers service to my queries"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Eric Nuss",
          "Nb_Reviews": 2,
          "Date": "2022-10-27T01:57:40.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. No issues or problems. Recharge is fast."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Jose",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T02:46:35.000Z",
          "Titre": "Very fast and convenient",
          "Contenu": "Very fast and convenient. Great service!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T16:56:49.000Z",
          "Titre": "The service is quick and easy",
          "Contenu": "The service is quick and easy, and it's a trusted site"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "René",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T13:53:29.000Z",
          "Titre": "It is very easy to use",
          "Contenu": "It is very easy to use, il use it when m’y girl friends need it in cuba"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gustavo",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T00:17:01.000Z",
          "Titre": "The best service and very fast",
          "Contenu": "The best service and very fast , excelente 🙏"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rosario",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T12:45:50.000Z",
          "Titre": "As of today",
          "Contenu": "As of today, September 14, my experience with Fonoma is excellent.Said that, allow me to take this opportunity to compliment you on the much-needed service you provide to us and the noble people of Cuba, less fortunate than me and us."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "peter misevski",
          "Nb_Reviews": 3,
          "Date": "2022-07-30T20:40:23.000Z",
          "Titre": "Muy Bien.",
          "Contenu": "My transaction, recharge, went nice and smooth and I love it, but I have one problem with you: I am a snowbird and I spent my Canadian winter ❄️ in Cuba and I have a cuban phone line.When I am in Cuba, I can't charge my cuban phone,why is that?...... can you explain it in my email address please?. P.C.I have not tried to charge my phone there in last few years, maybe you have chenged.I will find out this winter coming up.    Thank you and keep your good work.                 Cheers 🍻."
        },
        {
          "Note": 5,
          "Lieu": "CU",
          "Pseudo": "Brian and Elena's Cuba Tours",
          "Nb_Reviews": 2,
          "Date": "2022-04-07T02:01:12.000Z",
          "Titre": "Every time I have the recharged Kevo…",
          "Contenu": "Every time I have the recharged Kevo it's always been delivered in the time it said it will be delivered when I've had queries about the charges not being seen own recipients SMS service I've contacted customer services and that evil has helped very good service"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Davina",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T15:35:29.000Z",
          "Titre": "Fonoma is so easy to deal with",
          "Contenu": "Fonoma is so easy to deal with. All you need to give is the phone number you wish to charge and your information and it is done.Their bonus charge ups are a great deal."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T19:39:05.000Z",
          "Titre": "Fast and Efficient"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T22:54:20.000Z",
          "Titre": "I have not had any problems using…",
          "Contenu": "I have not had any problems using Fonoma.  All payments have been received by the intended recipients on a timely basis.Please ensure your promotional information to Canadians is available in English....most of us don't know much Spanish.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Marisleybis Martinez naranjo",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T08:57:00.000Z",
          "Titre": "Octima.rapidita e correttesa."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T16:37:36.000Z",
          "Titre": "Good job I was looking for a good app…",
          "Contenu": "Good job I was looking for a good app to send money to cuba and I find you and I love you fonema thank you for your good job thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arlen",
          "Nb_Reviews": 1,
          "Date": "2021-10-31T01:05:58.000Z",
          "Titre": "I have found Fonoma to be very user…",
          "Contenu": "I have found Fonoma to be very user friendly and would recommend them to anyone. They even called me to make sure that I was the one using my credit card to pay for these phone recharges, and not someone else using my number. Yes, Fonoma deserves a 5 star rating!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "roy moore",
          "Nb_Reviews": 4,
          "Date": "2022-09-14T20:44:36.000Z",
          "Titre": "fonoma is a trustworthy site and i…",
          "Contenu": "fonoma is a trustworthy site and i would highly recommend this site to anyone wanting to recharge a cellular phone"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T10:08:12.000Z",
          "Titre": "I like Fonoma because is reliable",
          "Contenu": "I like Fonoma because is reliable. Recharges always arrive at their destination. There have never been any errors. Thank you! :)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Iqbaldesh",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T02:01:54.000Z",
          "Titre": "Best service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dinorah diaz",
          "Nb_Reviews": 3,
          "Date": "2023-02-26T23:39:23.000Z",
          "Titre": "porq me da recompensas"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Victoria Larson",
          "Nb_Reviews": 3,
          "Date": "2022-03-10T00:29:07.000Z",
          "Titre": "Fonoma works for me and friends",
          "Contenu": "I have received excellent service from Fonoma. My Cuban friends have been happy with their topups. Service is good. The varied prices give me an option that I can afford. No complaints."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "EVELYN",
          "Nb_Reviews": 10,
          "Date": "2021-10-16T15:59:44.000Z",
          "Titre": "I love Fonoma",
          "Contenu": "I love Fonoma!  It's a fast and efficient way to recharge your loved ones' cell phones in Cuba.  I especially like the promotions and purchase them when they are advertised. I highly recommend this app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NORMA",
          "Nb_Reviews": 3,
          "Date": "2022-03-10T04:24:55.000Z",
          "Titre": "The recharges have always gone through…Great Company and Great Service",
          "Contenu": "The recharges have always gone through immediately. Fonoma is a reliable company and I am very happy with their service.I’m always alerted several days prior to a new a promotion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2021-11-24T13:21:43.000Z",
          "Titre": "I love Fonoma",
          "Contenu": "I love Fonoma, I love the way they do business, never miss a notification about the transactions, their offers and when my family receives the recharge. Always in time. Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nael",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T18:13:33.000Z",
          "Titre": "Yes satisfied and Very good communication",
          "Contenu": "Yes l do like this app and sometimes is extremely very good and sometimes we have bad connection so I have no idea is me or the app"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marion",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T00:21:17.000Z",
          "Titre": "Easy to utilize. Accessibility to the internet",
          "Contenu": "Easy to utilize, i.e. customer friendly!) Effective, and prompt service delivery. Affordable"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Mario",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T12:29:09.000Z",
          "Titre": "Easy to use and good offers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T14:43:08.000Z",
          "Titre": "This is a very dependable company..",
          "Contenu": "This is a very dependable company... No complaint, everything is  Right,,,,,LUIS FERNANDEZ."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jon B",
          "Nb_Reviews": 14,
          "Date": "2022-10-12T01:16:14.000Z",
          "Titre": "Phone credit top up",
          "Contenu": "Quick and reliable"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ariel",
          "Nb_Reviews": 2,
          "Date": "2022-05-30T12:13:54.000Z",
          "Titre": "I have tried other websites to…",
          "Contenu": "I have tried other websites to recharge, so far this seems to be the most reliable. I will stick with this one for now."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Edward",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T21:12:35.000Z",
          "Titre": "Great site for sending mobile recharges…",
          "Contenu": "Great site for sending mobile recharges to my parents in Cuba. Easy to use, never had any issues where the recharge did not get to my parents."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T04:29:10.000Z",
          "Titre": "I find Sonoma very helpful and useful…",
          "Contenu": "I find Sonoma very helpful and useful for recharging my girlfriend's phone in Cuba"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T03:59:24.000Z",
          "Titre": "On time",
          "Contenu": "Always fast and good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Any",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T03:12:44.000Z",
          "Titre": "Easy. Fast works",
          "Contenu": "Easy.. fast service .  Love it"
        },
        {
          "Note": 5,
          "Lieu": "CW",
          "Pseudo": "Elvis",
          "Nb_Reviews": 3,
          "Date": "2023-04-21T13:24:57.000Z",
          "Titre": "Very good 👍🏾"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Guillermo",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T13:34:53.000Z",
          "Titre": "I use this site for send some recharge…",
          "Contenu": "I use this site for send some recharge to Cuba, so far excellent service. Working automatic just minutes between sending-getting."
        },
        {
          "Note": 5,
          "Lieu": "CU",
          "Pseudo": "Vincent",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T23:04:33.000Z",
          "Titre": "They always deliver…been using them for…",
          "Contenu": "They always deliver…been using them for 3 years and the service is fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eduardo",
          "Nb_Reviews": 2,
          "Date": "2022-08-01T17:37:35.000Z",
          "Titre": "Thanks to you I have been able to…",
          "Contenu": "Thanks to you I have been able to communicate with my love ones during this difficult time."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Betty",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T03:11:15.000Z",
          "Titre": "You are the best,always on time",
          "Contenu": "You are the best,always on time, excellent service I'll be with you for ever, thanks Fonoma."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roni",
          "Nb_Reviews": 2,
          "Date": "2021-11-12T14:24:48.000Z",
          "Titre": "Thank you for this service",
          "Contenu": "Thank you for this service.  My experience has been wonderful.  The site is easy to navigate and the on line assistance is excellent."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jayne",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T13:59:58.000Z",
          "Titre": "Sorry l pressed the wrong star the …",
          "Contenu": "Sorry l pressed the wrong star the  service is excellent will continue to use very fast and worry free Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yesenia",
          "Nb_Reviews": 2,
          "Date": "2022-03-29T20:53:05.000Z",
          "Titre": "I am very happy with this company since…",
          "Contenu": "I am very happy with this company since I can always send with bonus the recharge of my family phone in Cuba."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ofelia",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T16:16:13.000Z",
          "Titre": "The best ,fastest and secure page to…",
          "Contenu": "The best ,fastest and secure page to send recharge  to cuba I so happy  with yours services"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sue",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T17:35:43.000Z",
          "Titre": "My MIL",
          "Contenu": "My MILDoes not text or use the internet so options for calling most important to me.. thx"
        },
        {
          "Note": 5,
          "Lieu": "BS",
          "Pseudo": "Cadbury",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T02:46:35.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. My friends recieve their recharge very fast and i get a discount i have no complaints thanks."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "michel",
          "Nb_Reviews": 1,
          "Date": "2021-10-16T01:22:38.000Z",
          "Titre": "Fonoma works very well every time",
          "Contenu": "Fonoma works very well every time. I have used this company for many years without a problem. Thank you Fonoma."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Fabius",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T18:17:15.762Z",
          "Titre": "Excellent I get along very well with…",
          "Contenu": "Excellent I get along very well with Fonoma.  very kind and helpful.  I highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "ROGELIO",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T14:31:13.000Z",
          "Titre": "ROGELIO2103"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JOSEE",
          "Nb_Reviews": 1,
          "Date": "2022-01-15T16:27:10.000Z",
          "Titre": "The service is fast and effecient",
          "Contenu": "The service is fast and effecient. The best way to connect with my cuban family. Gracias a todos"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Magdalena",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T18:35:57.000Z",
          "Titre": "It is handy and easy",
          "Contenu": "It is handy and easy! I use it a lot."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "jeanot",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T20:05:30.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, precise and secure until now. Hopefully it will stay secure. Merry chritsmas guys.thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evry Mann",
          "Nb_Reviews": 2,
          "Date": "2021-12-27T20:29:37.000Z",
          "Titre": "I love Fonoma.",
          "Contenu": "Fonoma is how I keep up with my friends on the island.  Easy to use and great value.  Gracias."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "hartmut",
          "Nb_Reviews": 2,
          "Date": "2022-07-15T09:26:11.000Z",
          "Titre": "iam very happy with fonoma … fasr…",
          "Contenu": "iam very happy with fonoma … fasr recharge and good offers … hartmut"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Cenneth Carlsson",
          "Nb_Reviews": 3,
          "Date": "2022-04-08T16:40:21.000Z",
          "Titre": "A very easy way to send money to my…",
          "Contenu": "A very easy way to send money to my goddaugter in Cuba. Im very happy for that."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Yosvani",
          "Nb_Reviews": 4,
          "Date": "2021-11-03T21:45:01.000Z",
          "Titre": "My experience with Fonoma is being…",
          "Contenu": "My experience with Fonoma is being great. Thank you for offering a  such personal service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 4,
          "Date": "2022-07-25T01:31:29.000Z",
          "Titre": "It’s easy to use and the person gets…",
          "Contenu": "It’s easy to use and the person gets the credit right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nilda Pedraja",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T12:17:19.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Their service is excellent and fast. They always have good specials going on."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Graziella",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T17:21:40.000Z",
          "Titre": "Very good",
          "Contenu": "Your service is always reliable and easy to use."
        },
        {
          "Note": 5,
          "Lieu": "CU",
          "Pseudo": "Sara",
          "Nb_Reviews": 6,
          "Date": "2022-09-15T17:29:57.000Z",
          "Titre": "Great place to recharge phones in Cuba"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "lazaro",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T07:00:39.000Z",
          "Titre": "The service is good and faster I'm…",
          "Contenu": "The service is good and faster I'm happy with that thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benny",
          "Nb_Reviews": 1,
          "Date": "2021-10-31T14:37:19.000Z",
          "Titre": "Perfect",
          "Contenu": "Perfect, I like the quick  response they have, thanks so much for your services"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "alvaro",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T15:46:32.000Z",
          "Titre": "everything was easy and smooth"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randall",
          "Nb_Reviews": 1,
          "Date": "2021-11-27T02:20:11.000Z",
          "Titre": "Thank you for allowing me to help my…",
          "Contenu": "Thank you for allowing me to help my friends in Cuba with ‘Regargas’. Gracias"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Nelson",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T12:47:20.000Z",
          "Titre": "The best top up option .",
          "Contenu": "The best top up option .Professional and good communication. Gracias  Fonoma"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gerard Anskaitis",
          "Nb_Reviews": 3,
          "Date": "2022-08-28T04:55:04.000Z",
          "Titre": "Congratulations very happy with the…service",
          "Contenu": "Congratulations very happy with the service"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sylvain Boulay",
          "Nb_Reviews": 1,
          "Date": "2022-01-29T01:46:37.000Z",
          "Titre": "Great service",
          "Contenu": "Great service.  Quick delivery to the receiver.  Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "yalile",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T00:29:57.000Z",
          "Titre": "Wonderfull",
          "Contenu": "Wonderfull experience and positive for mi"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacques",
          "Nb_Reviews": 3,
          "Date": "2021-11-24T19:41:50.000Z",
          "Titre": "Great deal to help my cuban friends to…",
          "Contenu": "Great deal to help my cuban friends to keep in touch and stop starving."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Gerhard",
          "Nb_Reviews": 3,
          "Date": "2022-05-25T11:17:57.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service! I am going to continue to use Fonoma ."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Harpreet",
          "Nb_Reviews": 3,
          "Date": "2021-12-26T17:18:33.000Z",
          "Titre": "Very good service. Thanks",
          "Contenu": "I recharged the phone in Cuba and received the recharge in 5 minutes."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "bgkantine",
          "Nb_Reviews": 6,
          "Date": "2022-05-12T09:29:35.000Z",
          "Titre": "all perfect",
          "Contenu": "all perfect  like this service and will continue using it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T19:33:56.000Z",
          "Titre": "Good experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonard",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T18:19:07.000Z",
          "Titre": "The service has been excellent I would…",
          "Contenu": "The service has been excellent I would recommend phonoma to anyone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2021-10-27T22:41:42.000Z",
          "Titre": "You have been wonderful to me and my…",
          "Contenu": "You have been wonderful to me and my ability to comunicate.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T21:19:50.000Z",
          "Titre": "Fonoma is the best to recharge",
          "Contenu": "Fonoma is the best to recharge. Honestly I would not use any other."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T20:24:07.000Z",
          "Titre": "The best place for recharges and the…",
          "Contenu": "The best place for recharges and the customer service is excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "phillip bounds",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T20:37:46.000Z",
          "Titre": "How easy it was"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2021-12-04T20:21:49.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent I love using it. It allows me to help out others easily."
        },
        {
          "Note": 5,
          "Lieu": "CU",
          "Pseudo": "luisa",
          "Nb_Reviews": 1,
          "Date": "2022-06-11T08:03:22.000Z",
          "Titre": "Fonoma is very Easy for the recarge",
          "Contenu": "Fonoma is very Easy for the recarge. Congratolation"
        },
        {
          "Note": 5,
          "Lieu": "NA",
          "Pseudo": "Eldys",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T07:16:27.000Z",
          "Titre": "Fonoma is the best way to recharge…",
          "Contenu": "Fonoma is the best way to recharge cellphones very safe and eficient"
        }
      ]
    }
  ]
}