{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "fonusmobile.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kim Dawson",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:07:24.000Z",
          "Titre": "Fonus has switched to Fonus Ltd",
          "Contenu": "Fonus has switched to Fonus Ltd.  For 3 months in a row they have been double billing me.  Customer service says they can do nothing to fix it or stop it.  They want me to call my credit card company every month and have the charges reverses.  The credit card company says they can't block the double billing from occurring but they have now reported it to their fraud unit.  Can you imagine!  A company knowingly double billing all it's Customers and doing nothing to stop it."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tapash Rozario",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T00:35:26.000Z",
          "Titre": "One of the worst company ever",
          "Contenu": "First time I heard from mobile carrier referring to go with another carrier from their customer support. Data was  unlimited after high-speed 5GB downgrade to 3G data. Recently, they gave me policy violation of excessive data usage and disconnect my service. On website posted unlimited data but it’s not. Now I am asking to refund my money, but they are declining."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David Chesney",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T18:10:41.000Z",
          "Titre": "Customer Support was absolutely the…",
          "Contenu": "Customer Support was absolutely the most ignorant person I've ever dealt with.  Not at all helpful with assisting me to port my number.  Wouldn't explain anything and when I asked them to put me onto another support representation because they wouldn't help me, they even rejected that and said no, trying contacting us at another time.  They even went as far as saying that this is a busy time so pretty well figure it out yourself.  I'm absolutely flabbergasted in the incredibily bad service.  I have never expereinced this in my lifetime."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "FIRETOP",
          "Nb_Reviews": 2,
          "Date": "2023-10-21T20:05:43.000Z",
          "Titre": "I do not recommend dealing with this…",
          "Contenu": "I do not recommend dealing with this service at allFirstly, I have never seen customer service that lacks politeness and ethics in my life.Request to cancel the service after an hour of placing the order.Tell me I'm not welcome again.Have you seen customer service immoral people like these in Canada?When they returned the money, they stole $2.I will file a complaint against them to CRTC Canadian Radio-television and TelecommunicationsNote that it is a mobile company, but it does not provide a phone for customer service, only on their website"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Smith Rowsell",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T22:54:00.000Z",
          "Titre": "Phone calls",
          "Contenu": "Different issues since I started. Always fast reply’s and helps this last issue unable to make phone calls when hooked up to Wifi I hook up to wifi so I don’t use all my fast data. EG .72 gb left and 5 days to go.  Cause I take it of wifi to make calls then forget to hook it up again therefore using up my fast wifi. Two weeks or more with many emails going back and forth. Very frustrating."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "John Macdonald",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T19:02:39.000Z",
          "Titre": "This is actually my 2nd review as Fonus…",
          "Contenu": "This is actually my 2nd review as Fonus was somehow able to take my first review down and I didn't reply to trustpilot in time to have it stopped.  I bought 2 fonus sim cards and when we were about to travel to the US I tried to activate but their activation server was down.  It took them 2 days of me chatting with them before an agent even admitted to me that the activation server was down.  So not really sure how good the service is but do know you can't rely on them.  Thank god for T-mobile and if you are in Canada Public mobile now has a plan $40 for 40 gigs that works in both Canada and the USA but with a real phone number not a voip one.I should also mention a bunch of other people also stated the activation servers were down and I have to wonder if they were able to remove those reviews as well."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "John Don",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T21:17:02.000Z",
          "Titre": "Scam.. still charge credit card even after port out and refuse to refund",
          "Contenu": "Scam.. still charge credit card even after port out and refuse to refundUnable to receive any message text from bank or other institutions. Unable to receive text for verification purposes.3/4 of call drops. False advertising as data is not unlimited as advertised because they send warning email when you use 40 GB but the thing is all calls and text go through fonus apps which use a lot of data as fonus is not like traditional carrier, fonus use LTE data for calls and you will quickly reach the 40GB even if you don't stream video. Poorest customer service of all time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hugo Frenette",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T23:50:16.000Z",
          "Titre": "Terrible App, bad services…",
          "Contenu": "Terrible App, which is the centerstone of their service, exclude everything your OS is running. Zero compatible with OS functions, even just calling a google searched place. Cant roam from wifi to data, need to reset the app each time thus using alot of data which is not unlimited after all. Been coping with a 12+ days of text and call outage and the customer service is awful. Same answer everyday \"give us 24-72hr\" to fully restore service. still nothing works 12 days later and I cannot change of carrier because the phone number port out service is affected too by this outage. So I am stuck with them and it doesn't work...great!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T05:45:12.000Z",
          "Titre": "Not true unlimited streaming",
          "Contenu": "I've been using it for emails, social media, and Netflix,  YouTube no phone calls or texts yet . At 30GB I was cut off (after just under 3 weeks of use). I received a warning email . Unlimited so long as you don't use too much. They said in the email this was a direct violation to fonus fair use policy,  they reserve the right to limit,  suspend or terminate without notice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Abe Khan",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T11:23:32.000Z",
          "Titre": "Absolutely terrible experience with…",
          "Contenu": "Absolutely terrible experience with fonus. I supported Fonus when the initially launched their service. They assured me a lifetime service as I was the first 500 to qualify for their lifetime service after paying them the initial fee. I sent multiple requests to active my sim and have ticket numbers associated with my request. My sim was never activated upon my request and they never resolved my ticket. This company is a scam, after reaching out to them many times with proof of my conversations they never delivered their promises. You are much better off paying for a service that delivers on their promises and service. Would not recommend throwing their money away on fonus to anyone.Please feel free to reach out for any documentation you require."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ed W. Visser",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T03:11:48.000Z",
          "Titre": "I've been a happy customer till now",
          "Contenu": "I've been a very happy customer for several months. But by Dec 15, 2002, I wasn't able to send or receive calls or texts. Data is fine. Oddly, I am able to call my wife, but she gets a busy signal when she calls me. I noticed the loss of service around the time the big storm came through many of the central/eastern states, and I figured that AT&T's outage was affecting our service.  But that turns out not to be the case because data remains good, but receiving calls and sending and receiving texts doesn't work."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Brcanuck",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T02:02:25.000Z",
          "Titre": "This app is horrible on android phones",
          "Contenu": "This app is horrible on android phones, they seemed to be geared to the iPhone market. If you logout you loose all text messages older than,24 hours. I was unable to make phone calls and tech  support were unable to resolve the problem. When I got ticked off because I lost all my text messages and still could not make phone calls they refused to help me. I have tried the sync messages option they state below but I am still missing all messages prior to Oct 8th (the last time tech support told me to logout)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T18:42:41.000Z",
          "Titre": "NO REFUND!!",
          "Contenu": "After finding out that my calling /messaging features  on my Iphone with Fonus would be altered and I would not be able to use it like normal I attempted to cancel the service.They showed me how to do it and followed through with it and confirmed it.I noticed that they deducted from my bank account and logged back on there website to see my account was active again.Took 3 days to get a response and they will not refund my money! They said there a prepaid company and cannot refund me! It was there website error and they will not honour it.I STRONGLY recommend staying away from this company!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jackie Drenth",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T20:57:00.000Z",
          "Titre": "My phone has been ringing busy since at…",
          "Contenu": "My phone has been ringing busy since at least yesterday.  Tried chat only to receive message about busier than normal call volumes etc. to try later which I have been doing with no luck.  Located a customer support number and got a recording about an update which required me to reconfigure my apn setting and to visit a website.  Unfortunately I couldn't hear the website name it was garbled.  Followed the instructions on my phone to reset the apn and that didn't work.  Emailed them and got the same reply about agents being busy and to try again later.  I'm having no trouble with the mobile data, just the phone. At this point I'd like to cancel but can't figure out how to do that either.  My opinion of fonus is that when it works it's great but I sure wouldn't do it again."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "B Savage",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T16:58:51.000Z",
          "Titre": "Number unavailable for 3 days",
          "Contenu": "Number unavailable for two days. Help centre gives automated “it will soon work” . Can’t afford to not have a phone unavailable. Not doing anything to fix my problem. STAY AWAY FROM THIS COMPANY!Now the 3rd day and no action to get my phone working. And YES I auto pay my bill.All I get from Fonus is- Thank you for contacting our customer support team. We are currently experiencing a high volume of requests and all of our agents are busy assisting other customers. We apologize for any inconvenience this may cause. We understand that there is a service outage currently affecting some of our customers where calling and texting features may not work properly and we are working diligently to fix it as soon as possible.Please try contacting us again later and one of our agents will be happy to assist you as soon as possible. Thank you for your patience and understanding and we look forward to helping you."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ela Bader",
          "Nb_Reviews": 1,
          "Date": "2022-04-09T07:50:19.000Z",
          "Titre": "Works like a scam company!!!!",
          "Contenu": "Charge double what any other phone provider charges for a SIM ($20+CAD), then instantly charge you for a month ($40+CAD). They refuse to port your phone number, and only offer phone numbers that aren't even close to your location. My actual area code doesn't even exist in their system.So now I have no service, no number, and I'm out $60. SCAM company!!!!ETA: They delete negative reviews from their Facebook posts (and I'm sure other social media as well). They just deleted mine, that had stated the same thing about costs and now I have no phone service and am out that $60. This is not an honest company at all! Don't trust their reviews, as they are clearly adjusted by the company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan Stalport",
          "Nb_Reviews": 3,
          "Date": "2023-06-15T16:30:28.000Z",
          "Titre": "Fonus customer service are totally out to lunch!",
          "Contenu": "I appreciated getting a phone call from the hospital who were trying to reach my wife for an emergency procedure. They told me the line was disconnected!  I tried her cell twice with the same response. Finally got through to Fonus customer service to be advised that she should put her phone on airplane mode for two minutes.  Excuse me…the line is disconnected! How do I reach her??Finally the representative does some action on there end and it gets cleared up. This is not the first time they are having internal issues. I asked what the issue is and was told because it’s a new payment system.  Well that’s a standard response these days.As her service was down I sought compensation for the outage period and got the perfect response “We can’t do that because We are a prepaid company “.  Huh? You take my money on a monthly basis but can’t make an adjustment in my favour because you have internal problems?What kind of logic is that Fonus?What kind of squirrels are running the company?"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Sam Kane",
          "Nb_Reviews": 3,
          "Date": "2022-08-19T15:28:44.000Z",
          "Titre": "This is the worst app and the worst…",
          "Contenu": "This is the worst app and the worst phone company I have ever had to deal with.  My app is not working most of the day. I have to restart the phone 2 times a day to get service. When I get service I can't hear callers and they can't hear me. I complained about the service and the US dollar pricing and a manager named Stuart threatened me that customer service will not help me if I insinuate that they false advertise costumer service will not help me anymore.  Porting in and out is a nightmare because fonus is a landline."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Decio Azevedo",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T01:07:08.000Z",
          "Titre": "Not true unlimited",
          "Contenu": "I've been using mine to web surf, check emails, social media, and Netflix as well as YouTube. I would download in batches to avoid long periods of consistent use. At 40GB I was cut off (after just under 3 weeks of use). This was within minutes of receiving a warning email that I didn't immediately notice. Unlimited so long as you don't use too much. They include a statistic in the email about using more than 99.5% of other users, a stat which they control since they can cancel at any time. This would suggest they only keep clients who use less than 40 GB per month. I hope they're smart enough to not charge me again (others claim to have this experience). I've also seen them respond to other peoples posts and publicly reveal details about their account (such as usage details). It seems they're looking for people who want unlimited but won't use it. If you plan to stream, you'll need to monitor your usage.  Depending on your video quality you'll get 5-10 hours per week of streamed content before they give you the chop."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T21:43:49.000Z",
          "Titre": "I ordered a SIM Card on Nov17",
          "Contenu": "I ordered a SIM Card on Nov17, and all I ever heard from the company was excuses (holiday, mail issues, with check with shipping, will get back to you with 24 hrs.). All I received were lies.  I have requested return of my monies earlier today, still no response.  Next step will be to dispute it with CC.  I had to give a one star because there is nothing lower."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arnold Jol",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T06:43:19.000Z",
          "Titre": "Up till dec 12 was working ok....not…",
          "Contenu": "Up till dec 12 was working ok....not great but ok.....then could not receive calls or texts....company is not responding to my urgent requests.....I have a business and cannot be without.....will be going with another provider!!.....too bad"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Simola",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T13:50:47.000Z",
          "Titre": "Founus Texting and incoming phone calls out…",
          "Contenu": "Texting and incoming phone calls out since at least Dec. 16. Inquires about restoration of services got me 24 to 72 hours and then the next few days.Update - full service back Dec. 29 2022"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara Clark",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T08:56:51.000Z",
          "Titre": "Service does not work called to fix multiple times...",
          "Contenu": "Service does not work called to fix multiple times Fonus said they would fix it and contact me but nothing I will be asking for my money back and telling people it's not good."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "JM Desrosiers",
          "Nb_Reviews": 7,
          "Date": "2021-11-02T19:12:39.000Z",
          "Titre": "Android app not updated in 7 months",
          "Contenu": "I'm having issues with the android app dialer and sadly the app was not updated in a LONG TIME. Feels like abandonware, and it's impossible to get a statement from Fonus or it's owner about this."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "William Bradley",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T09:01:27.000Z",
          "Titre": "Hasnt been a great experience so far...",
          "Contenu": "Hasnt been a great experience so far. Spent time with tech support and they were ready to blame this on some outage. My other family members dont see this issue."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Martin McNaughton",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T22:13:08.000Z",
          "Titre": "If you use too much data they cancel…",
          "Contenu": "If you use too much data they cancel subscription without any warning whatsoever, and even when I offered to pay extra money, they refused. Just stick to a real company."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Eugene Robitaille",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T23:34:10.000Z",
          "Titre": "Very bad service",
          "Contenu": "Very bad service, (1) this is a VIRTUAL wireless service. So, the quality of the line cannot be better than Fongo, Messenger, Viber, WhatApps, Google Hangout, etc. Those other virtual services, ARE NORMALLY FREE OR REALLY CHEAP, so why pay for  Fonus ??)... (2) You have to use Fonus App to do everything, the problem is that the app offered by Fonus is realy bad, for instance, it cannot pass from wifi to wireless automatically, you will have to do this manually. and each time you do this, if you are on the phone, the line will cut !!! the service always cut for may other unclear reasons. Furthermore, It does not work well with other technology like Bluetooth, Microsoft Your Phone, etc. The contact list is hard to use on the Fonus App, it's even hard to hang after you make a call (the screen often disappears and it's impossible to get it back). If you use this service, be prepared to restart your phone 3-4 times per day and miss at least 30% of your call. I wanted to encourage a new business, but I do not recommend."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2021-09-24T17:56:30.000Z",
          "Titre": "It's waste for your money/time.",
          "Contenu": "It's waste for your money/time.Be careful to avoid this service - because- it does not support tethering - you can dial from your car dashboard.- when you are on one call, the second call peeps in but no caller information provided.- call history takes time to update- Call drops every now and then.- No telephone support - No online support - if you keep chasing them when you do not get the service you are supposed to get.- it takes for weeks to port in / port out your number.- Very poor customer service - This is a Voip landline number but they call it Fonus mobile."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jas",
          "Nb_Reviews": 5,
          "Date": "2022-05-14T18:19:10.000Z",
          "Titre": "Fonus NO good Stay away",
          "Contenu": "Why removed my previous feedback I keep posting reviews even again remove. Fonus is not recommended for Canadian Stay away this company Only data service is ok since provided by Rogers But Phone and Txt service No good You pay C$40+ and use only 20gb data Unable to get or make calls or txt through their app Fonus app is garbage Its working on voip service Big Noooo for new subscribers in Canada I lost and don't want others to loose So Stay away"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T08:39:43.000Z",
          "Titre": "Very disappointed with this service…",
          "Contenu": "Very disappointed with this service. It's next to impossible to connect to the network and when it does, I still can't make a phone call and in the rare times I can make a call the quality is poor. As it stands now, I feel like I just threw over $45 down the toilet."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Georges Gérémian",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T21:27:37.000Z",
          "Titre": "The worst company ever",
          "Contenu": "The worst company ever. Zero service, sero help, any problem deal with it and they are full of lies. To transfer your phone or anything you do it yourself. Any problem you pay for it up front and never refund. I sent many email for my problem on their different email adress and zip no amswer (they don't give a dam) I tried many time to get teir land adress adress in Canada or U.S. so I can send them a registered claim. No way no adress anywbere. Avoid this company like hell. Much better elsewhere"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Benjamin",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T08:52:56.000Z",
          "Titre": "Had no service for 10 days after it worked the first day…",
          "Contenu": "Had no service for 10 days after it worked the first day. Contacted support multiple times to try a bunch of stuff before they sent a replacement SIM."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Francisco Phillips",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T04:02:58.000Z",
          "Titre": "Not sure who wrote all the reviews...",
          "Contenu": "Not sure who wrote all the reviews, but I couldn't disagree more. S21+ and constantly disconnects. Didn't use my phone beyond mapping and used 4gb in a day."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Sunny",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T12:39:18.000Z",
          "Titre": "Asked them regarding the refund on my…",
          "Contenu": "Asked them regarding the refund on my sim since the network doesn't support personal hotspots. I was being told that I am not eligible for a refund since the sim has been shipped to you."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Charles Bruney",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T04:34:12.000Z",
          "Titre": "I’ve tried my new sim on two separate phones…",
          "Contenu": "I’ve tried my new sim on two separate phones - I was previously on AT&T and didn’t have calls dropping left and right but now I have almost no service anywhere - at home, at work, anywhere in between."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tooba Reaz",
          "Nb_Reviews": 3,
          "Date": "2022-01-23T15:28:30.000Z",
          "Titre": "Ive been waiting for my sim for months",
          "Contenu": "Ive been waiting for my sim for months. Ive spoken to chat 5 times. They just stop responding now. No one gets back to me. I have never seen such bad and unresponsive company ever. They tell me that theyll talk to their shipping department and never get back to me."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nitin Kumar",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T09:07:51.000Z",
          "Titre": "Really bad experience",
          "Contenu": "Really bad experience. Really bad service and bad customer service too Don’t recommend at all. There is no one to answer you questions and to solve problem."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T08:34:01.000Z",
          "Titre": "I cannot access customer service without my phone being active",
          "Contenu": "I cannot access customer service without my phone being active. The chat bot on the website Read more about review stating Poor service."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Barry Boyett",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T08:23:21.000Z",
          "Titre": "Calls aren’t connecting...",
          "Contenu": "Calls aren’t connecting, other side of the call is complaining that it’s breaking up. Text messages don’t go through."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gianni Bravo",
          "Nb_Reviews": 3,
          "Date": "2023-02-15T16:00:50.000Z",
          "Titre": "THIS IS A SCAM",
          "Contenu": "This is a scam.  They get you to purchase a sim card that can't be activated and chatbot keeps telling its customers to wait 2-3 days. Repeatedly.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan Stalport",
          "Nb_Reviews": 3,
          "Date": "2022-01-03T23:55:54.000Z",
          "Titre": "Very weak customer service and worse experience with their support",
          "Contenu": "Sadly 99% of the time customer service has a glib answer that does not resolve the issue. Case in point, porting phone numbers. Two of my phones were released from the original carrier on a Wednesday, a week later after hounding customer service it was finally resolved. Another was instead of sending a call to one telephone they set it up so that the same number was put on 2 different phones. My wife’s telephone number was effectively placed in limbo so she couldn’t receive calls from the hospital about her ailing mother.On another note I’m still trying to understand how they can only supply under 8mpps download speeds with AT&T in Texas. I’m not in the hinterlands I’m in an area of the Rio Grande Valley  Surely it is populaces enough to offer more than that?It has been slow and difficult to get resolution from them. Just setting up my phone and my wife’s took more than 20 hours of online dilly dallying. That’s unacceptable.  Guess I’m the dummy for hoping that this company might be offering a reasonable service at a very competitive price, but unfortunately they fail when it comes to service and supportToo bad really.I will add to this that the one bright exception to the above is Bruce in Customer service who never fails to provide unwavering support with the challenges of getting the phones (2) to work. He is thoughtful and knows his stuff. Hope Fonus can clone him soon   He is their saving grace."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Sinclair",
          "Nb_Reviews": 2,
          "Date": "2021-12-30T19:42:23.000Z",
          "Titre": "I've had this service for 2 months now",
          "Contenu": "I've had this service for 2 months now. It worked seamlessly when I went across the border.Having issues with calls both inbound and outbound. Calls are very spotty and sometimes I have to hang up and call back.The app connects to the car but I cannot hear the person.When on wifi the service is still choppy on calls.When I leave the house I have to restart the app in order for it to work.I've asked multiple times about my issues and its always\" we've sent your issues to our tech team and we'll get back to you\". Still waiting. I suspect they have no fix.I've used many other so-called voip apps and they all work much better. I'm switching out of this application to another cell provider and I'll figure out something when across the border.I do have to say that Anna and Bruce are very good as customer service agents but the problem fonus has is with the stability of what they offer.Too bad though the price is goodAs of today Dec 20 2021 Fonus still has not come back to me with any potential fix to the issues, as I suspected they have none, nor have they contaced me either. I am switching carriers since they do not appear to want to keep customers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Micheline Tremblay",
          "Nb_Reviews": 2,
          "Date": "2022-01-06T14:02:12.000Z",
          "Titre": "Ordered a sim card Nov",
          "Contenu": "Ordered a sim card Nov. 22nd and never received it.  They said they were shipping another one on Dec. 23rd, still not received it, always excuses.  I lost my money and my time trying to get the card or the money back.  Never again"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Abe",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T18:51:48.000Z",
          "Titre": "I ordered this sim card and I still…",
          "Contenu": "I ordered this sim card and I still haven't received it now these people are ignoring me and won't reimburse my money don't fall for these American company people it's been 3 months and I still haven't received nothing there's no contact# I would strongly suggest to stay with a Canadian company I am and they are great in case you issues you can easily contact them through a self serve app or contact# ...I hope I get my money back but and it's a long shot these people are thiefs because they take your money and don't return it back shame on them."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Cristina PV",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T02:20:04.000Z",
          "Titre": "Worst Costumer Service experience as a paid client",
          "Contenu": "Worst Costumer Service experience one could imagine as a paid client. After a fairly good short experience (I'm in Canada only 3G, LTE sometimes here) I tried to reactivate the SIM card when I was about to travel to the US, where I've heard works as it is promised (5G).1) Contacted with a Costumer Service Supervisor and I was misled to believe they cannot reactivate SIM cards on weekends (?), they had to \"refresh\" my SIM card with AT&T (??), and no, they could not do anything else. 2) They made me wait for 3 days during a long weekend, and even after paying for one more month I never received a notification saying the SIM card was reactivated... the same day I paid!3) With frustration, I requested the cancellation and refund, since I never used it.4) A Costumer Service Supervisor named Bruce arrogantly, not only cancelled my account without an explanation on why I was told no reactivation on weekends, but informed me YOU will not get a refund after he cancelled my account. This \"company\" sells SIM cards but resells a service provided by AT&T, but in terms of Costumer Service you are better treated if you deal with an actual professional support team, and Fonus does not provide but misleading excuses, then cancels you as a client, but keeps your money, since they don't refund for a service that was not used.Trailblazer Mr. Simon Tian. Nice chatting with you on Telegram, BTW --I was expecting a more CEO kind of intervention from you in this matter."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Terri Murphy",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T08:30:15.000Z",
          "Titre": "Calls drop or people cannot hear me…",
          "Contenu": "Calls drop or people cannot hear me. I have never had a problem with my previous phone service."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Ron Chambers",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T18:12:05.000Z",
          "Titre": "Had FONUS for a few weeks. GARBAGE",
          "Contenu": "Had FONUS for a few weeks.  I did not have one call I could say was OK.  Most calls dropped, people could not hear me or vis versa.  Several people said that my phone would not ring when they called.  Customer service was rude and not helpful at all.  Lost my phone # of 32 years as they would not assist in the porting.  RUN FROM this one!  You will see Phonus's response below.  I was NOT advised by them that my number had not been ported when I requested a cancelation.  I am a new cell phone owner and they did not tell me it would be lost.  They also do not mention that they said they would try and help and then went silent when I asked for help.  They also did not verify that their plan was unless to me.  Where are those records?  Customer be ware."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "oliver howson",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T05:24:59.000Z",
          "Titre": "Reliability and customer service",
          "Contenu": "Service went down as of Dec.11/22 they told me to do a few tasks did not fix the issue.Then they said they have to forward this to there team.They got back to me Dec.13/22 asked if i was receiving calls.Still was not then they told me there was an outage it would be fixed in a FEW HOURS.Still nothing Dec.15/22 Again i got on a chat they said it would be fixed in a FEW HOURS same day i get back to them now its a different person and he says current ETA 12 HOURS.I had told them to FIX IT  in capitals they did not like that because i put my caps lock on. He then told me they will stop answering entirely from now until the issue is fixed they will let me know by email.  WHAT A BIG JOKE THESE GUYS ARE.  Beware ( p.s. i also took screen shots of conversations )"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tooba Reaz",
          "Nb_Reviews": 3,
          "Date": "2021-10-20T13:16:41.000Z",
          "Titre": "Customer service is bad",
          "Contenu": "I got the sim. It didn’t work. They said they will send another but no one replies and I haven’t gotten it still. They stopped replying to my emails and just ignore my request. I haven’t had a sim for over a year and this just seems to keep going."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Corbett",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T04:49:00.000Z",
          "Titre": "Data coverage was terrible and MMS wouldn't work...",
          "Contenu": "Data coverage was terrible and MMS wouldn't work, they refused to refund for $30 for 1 month of unusable service."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T15:12:27.000Z",
          "Titre": "Did not work for traveling!",
          "Contenu": "Worked OK in Canada but far from how it was advertised. I travel across North America and thought would be a great way to keep in touch with important.  However once I left Canada only the data/text portion seemed to work, which can easily get free apps that do that.  I was able to make one outgoing call from Mexico and received another from Canada but beyond that it wouldn't allow me to make or receive calls, they would not even dial out.  Customer service was less than helpful as they would each tell me to restart the phone or reboot the app, then got very snarky and argumentative when I asked to cancel.  I simply asked to cancel because it didn't work for me, I didn't ask for a refund, they replied that they would not provide a refund, although offering to provide some sort of refund or forward moving solution would of made sense, I got more of a snarky response about how it works for others and that no refund would be provided.Despite their reply, multiple force stops, reboots and reinstall of the fonus app did not work, and their responses when I asked to cancel were extremely snarky and passive aggressive. Was going to return if they fixed their issues, but definitely not with their level of customer service.I've also read their great reviews and highly suspect the way they are written is from their own employees, mainly Bruce who in reality was a very passive aggressive person and belongs nowhere near any sort of customer service department.Another further update is that if you wonder how they get all the great reviews on Facebook, they delete all critical comments then block them from commenting, even if constructive on how to improve their service,  very shady company!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tooba Reaz",
          "Nb_Reviews": 3,
          "Date": "2021-11-02T14:37:58.000Z",
          "Titre": "bad customer service",
          "Contenu": "I have tried reaching out to them a couple of times. They have yet to send me my sim. My services don’t work and their chat support doesn’t respond. Very bad service."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Kent Sweat",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T04:42:02.000Z",
          "Titre": "I used the app that said it would work in my area…",
          "Contenu": "I used the app that said it would work in my area. I gave it chance won’t be renewing after time is up."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T08:49:16.000Z",
          "Titre": "Have to buy a new phone...",
          "Contenu": "Have to buy a new phone. Fonus does not work with my Samsung Galaxy 7."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kalpesh Patel",
          "Nb_Reviews": 4,
          "Date": "2020-08-27T22:54:23.000Z",
          "Titre": "Iam lifetime Fonus user and suddenly…",
          "Contenu": "Iam lifetime Fonus user and suddenly stop my all Fonus service I tried to attach chatting with Fonus agent , because Fonus agent said if you have call is successful then is free       I am not abuse any service, because I use international services After Fonus agent with chat ,so it's not my fault , I have email for Fonus agent chatting but I don't know how to attach here"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2020-07-12T17:49:40.000Z",
          "Titre": "Scam company in for a quick cash grab",
          "Contenu": "I purchased a sim in November on the second day it was announced and was told I would get free service for life.I waited six months before two sim cards were sent to me, both are non-functional. I have reached out to Fonus and the team directly regarding this and have been ignored each time.Avoid this company like the plague."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Hamid",
          "Nb_Reviews": 1,
          "Date": "2021-04-10T05:13:04.000Z",
          "Titre": "It is Absolutely Rubbish and scam",
          "Contenu": "scam scam scam please save your money and don’t buy any Sim card from them because it doesn’t work in Canada and it’s not a proper network or proper Sim card it’s like an application I would give them zero or under zero andThey don’t refund your money so please be aware"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2020-07-12T15:55:38.000Z",
          "Titre": "Promised the world delivered one continent",
          "Contenu": "I'll try to make my review short and to the point.In Nov 2019 Fonus was touted as the \"world's first global carrier\" offering worldwide unlimited talk text and data for $30/USD per month. I purchased my sim on \"Nov 21 2019\"It was received at my address in Canada on \"July 9 2020\" yes over 7 months later! When I went on the website to activate I learned that it is now offering simply North American roaming with USA number only for the same price.That's not what I signed up for."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Takeshi Kinko",
          "Nb_Reviews": 4,
          "Date": "2020-07-13T18:15:11.000Z",
          "Titre": "I don't recommend this!",
          "Contenu": "Toward to the point. First of all, I paid the SIM in November 2019 and promised a free lifetime service for this SIM. At the end of the day: 1) I've got the SIM in June 2020 (8 months). 2) Didn't get promised Life-time free service. 3) No unlimited use in 64 countries (as it was originally advertised). 4) It's not unlimited even in North America at all. 5) Gives US DID only. 6) Support doesn't answer any questions just redirecting me to untrusted messenger \"Telegram\". Really looks like cash-collects then gone."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Lawrence O",
          "Nb_Reviews": 1,
          "Date": "2020-08-18T02:19:11.000Z",
          "Titre": "FONUS IS A SCAM",
          "Contenu": "FONUS IS A SCAM. They hid behind the pandemic to justifying orders not being sent/tracked/shipped. But they debited me twice, ordered on june 15th, still haven't received anything more than 10 weeks later. Customer service lies you will receive more information. COMPLETE FRAUD.update: Fonus is trying to report this review as if it was violating rules. No, this is an honesy review. You told me every week that I would receive an email and never follow up, and 10 weeks later still you're telling me the same automated customer service messages that your team is working on it... Sad"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ranjit Singh",
          "Nb_Reviews": 3,
          "Date": "2020-07-19T03:26:02.000Z",
          "Titre": "Bad support and horrible experience…",
          "Contenu": "SCAM ! Bad support and horrible experience Overall. I ordered sim in Nov 2019 and got it in June 2020. Was offered free for lifetime service but after contacting support to activate there is no response for almost over a month now."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Khalid Wahid",
          "Nb_Reviews": 1,
          "Date": "2020-08-13T05:55:32.000Z",
          "Titre": "No service",
          "Contenu": "I have been using the service for about a month at first it was working great but than it stopped completely now no service. Waiting for fonus customer service for a resolutionn"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Chris",
          "Nb_Reviews": 6,
          "Date": "2021-03-31T01:50:30.000Z",
          "Titre": "Really bad support and service. False advertising",
          "Contenu": "Really bad support and service.Initially, it wasn't good as I was harassed almost every day by AT&T calls.It never stopped but they told me everything was okay..Then yesterday, my sim card has been deactivated for no reason.My account isn't accessible anymore.Noone answers me on their chat support.So, if someone still dares to make business with this poor company, keep in mind they could cut their services at any time, without giving you any reason whatsoever, not even a REFUND.It is raging when it happens in the middle of a paid month.Update March 2021 :I gave their V3 sim a try and it is worse than before.You cannot reach any cel phone in Europe and Asia and vice versa. Poor quality calls to any fixed phone on these same continents.I rarely get 4g connection in town.I've posted a comment on their marvellous Facebook Fonus Club to compare with other users and I have been kicked out.Pretty dishonest as dishonest as they actual offer which is a false advertising.False advertising is called a scam."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kalpesh Patel",
          "Nb_Reviews": 4,
          "Date": "2020-09-19T03:26:59.000Z",
          "Titre": "IAM Fonus lifetime free customer and my…",
          "Contenu": "IAM Fonus lifetime free customer and my service is not active Last two month , I complained to support team still not responding"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Wkaz",
          "Nb_Reviews": 1,
          "Date": "2020-08-28T03:41:18.000Z",
          "Titre": "Haven't received the Sim yet. Been 8 months",
          "Contenu": "I paid for the sim in December 2019. I haven't received any email except for the receipt."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Minh Tam Le",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T23:17:16.000Z",
          "Titre": "I bought the sim to check out what the…",
          "Contenu": "I bought the sim to check out what the company actually offers.Sim recived in a few days, great. But when i activated the sim with the CCID AND IMEI. Everythingwent through smoothly, credit card was charged and even stated on on Fonus account as successful charged, but the sim was in disconnected status. It was on the weekend, so customer supports stated that activation department doesn't work on the weekend. OK, fair.... i waited till end of day on Monday. Still \"deactivated\" on my Fonus account.Then i reached out on Tuesday,  im giving the  your activation is pending due to too many activations. End of day of Tuesday, still nothing.Wednesday,  i tried again with the chat support. I asked the chat support person, how long does it take to activate the sim. The answer was 24-48 hours. Ok, so i stated my business that i paid on the 19th and now its the 22nd, so what happened to my activation?PROOF OF PURCHASE as asked again. CCID and IMEI was given as well. What i got back was. Wait another 24 hours then try again. Seriously, what kind of a telecom company takes 4 days to activate a sim. Im at the point of trying to do a chargeback on the company.* response to Fonus's reply: the reason i bought the sim is to try put what your company has to offer. That intention is still there. All i wanted is an active sim. I don't care about the month that you mention."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry Tanaka",
          "Nb_Reviews": 1,
          "Date": "2020-10-08T11:57:16.000Z",
          "Titre": "Stay far far away from any of this guy's companies",
          "Contenu": "Paid with credit card, went through eventually. In 2019 it was advertising these key features-Canadian numbers with the sim-unthrottled data (unlimited)-Canadian number port-in-world roaming (not that important for me, but it'd be nice for vacations)Now, I have a sim that works relatively well but none of these features are available. I was told that now I have to download a VOIP app to get them. I already have a voip app. He also wouldn't activate my sim unless I followed him on Facebook and liked the pictures that he posts... He's also admitted that he's been arrested multiple times in the last year for weapons charges in Singapore and has posted videos of himself swearing at the Japanese police outside their police station. How this is news that legitimizes his company, who knows? Currently unlimited data is working and speeds are temperamental but when it's working, it's fast.Credit card is cancelled just in case as Simon has the reputation of being a scammer.Please do not purchase this without doing your research on Simon Tian's history first. Pay with an e-visa if you decide to purchase. I've also heard that he will be removing features such as phone calls and text messaging and we will have to use the voip app only. Not what was originally promised. This is worse than the Neptune smart watch where he scammed all his crowdfunders. Please look all of this up.He also has a history if purchasing reddit votes, twitter followers, and positive reviews...."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Alejandro Suarez",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T02:38:53.000Z",
          "Titre": "The internet service is okay",
          "Contenu": "The internet service is okay. The phone and text service is very discouraging. I live in Canada, Toronto area, and there are occasions when the service is intermittent"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "roland gelinas",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:35:14.000Z",
          "Titre": "-Phone call is a real…problem",
          "Contenu": "-Phone call is a real problem....there's always a delay with me and the speaker on the line....-I must reset each day the apps to do inside and outside call -some Phone numéro are not take in charge by Fonus-Internet is very good"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Secured",
          "Nb_Reviews": 4,
          "Date": "2023-06-10T16:45:48.000Z",
          "Titre": "Company needs to update their app to…",
          "Contenu": "Company needs to update their app to make sure no calls and text messages are missed and properly sent out. Cancelled fonus a couple days ago due to failure to fix issue of messages not sending out after requesting twice to be fixed from Anne on online customer support chat.Was with them over 2 years but due to failure to update app and fix important issues it is no longer a good fit."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Beth",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T18:29:06.000Z",
          "Titre": "Fonus is in the process of changing its…",
          "Contenu": "Fonus is in the process of changing its billing system.. for months now.. so phone numbers keep getting disconnected and caller calling my phone(s) get the message that the number is disconnected. This has been happening for months now. Ask for a credit, and told No credit.. its a prepaid system.. since we reactivated your line, you are good to go. Fonus is missing the point! Inconvenience, no incoming calls, people thinking your line is disconnected etc etc. Don’t ask for a manager, cause apparently they do not exist. One unhappy Fonus customer! Asked for a $20.00 credit on each line… NOPE! Nada, zip, zilch given to make up for the multiple months of inconvenience. Told the billing system is fixed now.. so let’s see moving forward what grief is incurred."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Joseph Rohde",
          "Nb_Reviews": 12,
          "Date": "2023-05-11T02:04:48.000Z",
          "Titre": "Less than forthright.",
          "Contenu": "The service itself may be fine...but the presentation of what it is seems less than forthright.  The phone service is VOIP over Data services.  This means (for iPhone users) that things like iMessage or WhatsApp are unable to use the Fonus service. (Note that they can be used with WiFi, so long as you switch your ID to your email address - but that is NOT using Fonus)  It also means that texts from systems with International restrictions also wont come through.The customer service is OK, but the tech support is marginal. Be prepared to figure things out on your own.But the biggest reason for the 2 star rating is that they were not at all clear about the technical underpinnings and resulting limitations."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Daniel C.A. Stalport",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T18:22:02.000Z",
          "Titre": "After 6 months of use still many issues not corrected",
          "Contenu": "After months of use, I am living the extremes with FONUS.  Price, coverage, and data services are beyond what we expected.  On the other hand, voice connections are often very poor quality.  we have 2 iPhones with them and all too often my wife's phone will instantly go to voice mail.  Another recurring issue is when I try to call her phone from mine, there appears to be a configuration conflict and the call will not connect.  Even went so far as to change both phones to upgrade.  Still no improvement.  The solution offered is to refresh the phone.  Just wondering how many times a day, week or month we will have to play this game to overcome these technical problems?  I wish that our relationship of more than 6 months with Fonus was addressed properly!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Scott N",
          "Nb_Reviews": 9,
          "Date": "2021-08-27T20:59:16.000Z",
          "Titre": "Customer service Great! Phone service... Not so much :(",
          "Contenu": "Customer service is speedy and excellent, but thats where my good experience ends. Since having it, my calls sometimes never make it to my phone, it drops calls all the time. It may be a bit my samsung A70s fault too as since the android 11 update its been a $h!t show. I cannot continue with this service if I will be missing important calls."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Clint Nelson",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T21:29:32.000Z",
          "Titre": "Poor call and text experience",
          "Contenu": "Poor call and text experience. Took nearly a month to port my Canadian number. Fonus runs calls and texts through their own app which is brutal. Can't search for a business and press the number to call. Have to enter it manually in the App. Calls are frequently dropped and missed. Texts sometimes take 30 minutes to show-up (which is awesome when you're waiting for a verficiation code that expires in 15 minutes). The data option is awesome, but not worth it for a daily user who makes lots of calls and texts."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Roger Doyle",
          "Nb_Reviews": 2,
          "Date": "2021-12-15T23:35:46.000Z",
          "Titre": "Wanted Fonus to work for me",
          "Contenu": "Wanted Fonus to work for me. In principal Fonus sounds good however there were too many problems for me to overcome on my own. Although the chat support was there they were not able to sort out the problems. They are in a unique VOIP cell market and should be able to sort out these various problems far better than they do. I will try them again in a couple years to see if they are closer to meeting my needs. In the meantime I'm back to my traditional provider.Roger DCalgary"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Donna Vakalis",
          "Nb_Reviews": 1,
          "Date": "2021-09-13T15:18:47.000Z",
          "Titre": "They sub-contracted out my number, making it very hard to leave",
          "Contenu": "I had less than consistent ability to use my phone for calls while with Fonus: two things would happen. 1) some calls were just not allowed through (a few people told me when they called they got a busy signal, even when I wasn't on the phone)2) when I tried to call, sometimes the wifi signal was just too poor. Despite my city being covered by Fonus's networkThe really frustrating part was trying to leave. Fonus goes through a third-party for their VOIP phone plans. And when I tried to leave Fonus, and wanted to port my number out (something that takes about 1 day normally)...it ended up taking 3 weeks and lots of phone calls to their third-party provider (and to make things even worse, they had sold my number to another sub-contractor, who stalled on releasing my number). *Edit: in response to Fonus's reply below, I am adding the following detail: My number was not sold to their VOIP provider (IRISTEL) which is who I had to deal with for porting it out; in fact, IRISTEL was surprised to note that the number had been sold to ANOTHER third-party. Also, I repeatedly sent the SAME information in my request to port and eventually it was accepted - the initial claim on their part that the address didn't match was never substantiated. All of this was NOT worth the meagre savings. Especially since I ended up paying for an extra month while dealing with them dragging their feet when I tried to leave."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "เกรแฮม รัดด์",
          "Nb_Reviews": 4,
          "Date": "2021-11-17T15:55:13.000Z",
          "Titre": "I gave Fonus a few months to impress me, but ended up cancelling my account.",
          "Contenu": "OK - so I have gone from 3 stars (1st review - some months ago) to 5 stars in my second review after a few weeks of use. Today I canceled my account with Fonus after about 5 months of use. Here is why in no specific order.1st) Very unstable connection for mobile reception, I have missed numerous calls due to this problem. It appears you need to delete the Cache often to keep your device connected for voice calls.2nd) 2FA (Two Factor Authentication) = because Fonus is VOIP many if not all 2FA will not work with this system. This includes Online Banking, Brokerage firms, and many more. There are workarounds for some but not all. So Be Aware.3rd) Double Billing and extreme challenges changing your current billing, yes they will double bill you, you need to check your payment method frequently. Also if you need to change your payment method you basically need to start again, cancel your account and SIM then input the new billing information, very challenging.On the positive side, the Data is a good and very reasonable price. In the USA you get access to 5G so that would be a positive, but not available in Canada. Also, their customer service is very good, attentive, and helpful, however during an online help session the agent told me to \"search the internet for a solution\" for my issue. I did and found the solution, \"Cancel my account\".Not to say I would not come back to Fonus if they can improve the issues noted, but as of today, I am moving on to Shaw Mobile. Yes, I have heard the problems they have so you may hear more from me soon."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Percy Bacha",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T16:25:02.000Z",
          "Titre": "Okay but with issues",
          "Contenu": "Acceptable Service and Help is very quick .. Do not still have Call Forwarding though they IT help keeps informing me they \"are working on it\" and they cannot accept verification texts for 2 Step verification from certain agencies and banks which make it VERY frustrating.  Have used it in Canada and USA with mixed results but not tried anywhere else"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Anne Fournier",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T14:06:16.000Z",
          "Titre": "I did not like the message taking…",
          "Contenu": "I did not like the message taking system, I received a message, and I could not hear or understand what the person was saying."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Lacasse Jean-Philippe",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:19:44.000Z",
          "Titre": "The only things that I dislike is the…",
          "Contenu": "The only things that I dislike is the fact that lots of 2fA won't work in that plan as well as the lack of option to hide our phone number when placing a call"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jean Troy",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T18:43:28.000Z",
          "Titre": "Fonus Administrative Issues & Quality of Service",
          "Contenu": "I had an issue while we were away in Florida in Feb. 2023 where Fonus suspended our accounts due to non payment when in fact we were on automatic monthly USD credit card payment withdrawal which they blamed on an administrative error on their part. It took a few days to resolve the issue which effected our ability to communicate with family back home.  A second event was more problematic when Fonus changed its system back in July/Aug. & sent an e-mail to an address I don't use.  When I missed the deadline to switch over I found out my texts on Aug. 21st were not being received which caused some issues as I was having a known medical condition resurface & this caused others to worry needlessly because my text messages didn't go through in a timely manner.  Why didn't Fonus send me some type on warning through the cell phone system. The matter was eventually resolved but did require a lot of communication via e-mail with Fonus to set up this new plan & having the ability to function within the system again.  On the positive side, I made a couple of short telephone calls that worked much better than the past when calls were disconnected after several minutes & the lines were iffy at best.  Communication over e-mail is OK on straight forward issues but live over the phone discussions are required on more complex ones which Fonus seems to make almost impossible to have & led my wife to change service providers.  I have remained for the time because I use the Fonus system for mainly text messages at this point."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "David Guttman",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:05:05.000Z",
          "Titre": "so far so good",
          "Contenu": "so far so goodhad a bit of a snag about 4 months ago when your company lines went down , and i didnt have any service for about 3 weeks, AND DIDNT GET CREDIT FOR TIME LOST."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Rahm De Undergrad",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T01:34:14.000Z",
          "Titre": "User Beware...  Probably best for a once in a while; while traveling phone",
          "Contenu": "Have been with Fonus for several months now. Been working on and off. Not advisable for someone who isnt technically inclined. Service has been shut down right around christmas this year and has been harsh to all users. Not satsified with customer service either."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "robvann",
          "Nb_Reviews": 4,
          "Date": "2022-12-15T14:46:51.000Z",
          "Titre": "Good option if I ignore the 12 hour network outage",
          "Contenu": "Recent 12 hour Inteliquent network outage.  Can't receive calls or text's.  Interesting that I CAN make calls.Until this point it has been a good option for us travelling between Canada and Mexico.  Its a bit odd having to use their App for phoning, but it works.  The support via chat has been excellent."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Michael Ganong",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T21:05:15.000Z",
          "Titre": "It works, sort of...",
          "Contenu": "Got my sim and activated it, got a new number. My Issue is this is essentially a VOIP service, i can't make calls or send txt's without using their app. I really dislike having to use a separate app to use my phone as intended. So i doubt i'll continue using this service when my month is up. If they could seamlessly integrate the service into the standard functions of my android phone, it would be better."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "David Lam",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T03:44:48.000Z",
          "Titre": "Bad phone calls and text services.  APP is a sad application",
          "Contenu": "Setup is relatively simple, but the porting process takes a long time.  Never advise that I have to sign up a new temp number before I ask for porting process, and I  wait over 20 days and they told me my Cdn phone company rejected the porting which is not true.  I wasted one month's service fee with no service waiting for porting.  The phone calls got dropped most of the time, and texting is really bad using the APP.  I think I have to go back to my traditional service provider after my trip to the US."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ray Schumann",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T20:12:09.000Z",
          "Titre": "Fonus Mobile Canada",
          "Contenu": "We are a family in Canada, wife and 2 adult children. We have been using Fonus since July 2022 with 4 mobile devices. I also convinced my best friend to switch. We have had problems since the very beginning including activations, reliability and billing. The billing issues are the most recent with 3 of the 5 plans being disconnected for no reason. Got those issues resolved quicker and less stress with each one as I learned how deal with it.Each time there has been problems, I have been assured quick resolutions which have never been the case.The only things which keep us from dropping Fonus like a brick are the vast quantity of data and the option to switch to any of the Canadian service providers on demand. If I travelled to the U.S. regularly, I'd add the no roaming fees and activations to that list. All in all, I have a love/hate for this company with hopes that they smooth out all their issues and become the benchmark for mobile service. On the other hand, perhaps another startup company will come out of the gate strong and compete directly with Fonus."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VAPE-X ENTERPRISE INC 💨",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T16:31:16.000Z",
          "Titre": "The customer service is 10/10",
          "Contenu": "The customer service is 10/10 The service itself is 4/10 basically, you get what you pay forOverall experience is 5/10This service is not a regular service,  this company runs only on DATA ,So when you make a call it's not like a regular call Everything is trough DATA so that SUCKS! also you have to use their STUPID app to send a text message,  or to make a call It's not worth the money in my opinion   Unless you don't plan to use the service,  And you only want to use it as DATA But to be honest even the data is very SLOW"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "เกรแฮม รัดด์",
          "Nb_Reviews": 4,
          "Date": "2021-07-21T21:41:28.000Z",
          "Titre": "Beware of the Exchange Rate and the hidden fees.",
          "Contenu": "OK - so I have only ORDERED the SIM card, the plan looks very good at $30 for all that Data, but you need to be aware of the exchange rate (I am in Canada). The original invoice was for the SIM card, $15.79 USD with tax, then when the charge goes to my CDN bank, is is for $16.58 USD this works out to $21.52 CDN, A little dear. Then they charge a separate charge of $1.00 USD ($1.29 CDN), which they now tell via their online chat, is an authorization charge, it will be credited back at some time. Now I am complaining about the exchange fees mostly, I am not certain if this is them or my bank, but the 1.29 rate for USD>CDN is very dear. This could be solved if they offered payment via PayPal (at least for me). I will continue to post the experiences with FONUS as I get my SIM and set up the APP."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Grahame Shannon",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T21:16:34.000Z",
          "Titre": "Fonus service is prompt and effective",
          "Contenu": "Fonus service is prompt and effective. There were some minor problems because I tried to activate two numbers on the same account (different phones). It was fixed quickly. The app is a little clunky, lacking the ability to block calls, and create favorites. However it works well for calls and texts."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Roy Butterworth",
          "Nb_Reviews": 3,
          "Date": "2023-11-01T01:01:18.000Z",
          "Titre": "Fonus App suggestion...",
          "Contenu": "Notwithstanding the fact that one is able to break away from the strangle-hold by Canadian Telecoms, the service is pretty decent.  However, a safety issue... You need your app programmers to link you app with the default phone app dialing systems in Android (Samsung).  dialing from the phone in a vehicle is not only illegal but, down right dangerous.  You're people to be more stupid than they already are when dialing out in a car, etc.  Good luck with your ventures."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Joseph Rohde",
          "Nb_Reviews": 12,
          "Date": "2023-10-31T21:35:38.000Z",
          "Titre": "Generally I am satisfied with the…",
          "Contenu": "Generally I am satisfied with the service, and certainly the price.  A few downsides:- many institutions (eg. Banks) refuse to text authorization codes to VOIP numbers. This is the biggest downside for me.- The 'new' App lacks support for multi-party chats. You can send to multiple people, but then each reply and conversation is point to point- the 'automatic' switching of carriers is hit and miss when traveling between Canada and the U.S."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Del Mandap",
          "Nb_Reviews": 5,
          "Date": "2023-11-01T06:36:19.000Z",
          "Titre": "FONUS is for real",
          "Contenu": "FONUS is for real!  Imagine having access to call Canada, USA, and Mexico phone numbers WITHOUT roaming charges?!  My husband, with his \"computer-guy\" searching skill, stumbled upon Fonus which we now use, for $30 each per month.  Who would complain about unlimited data and text, NO ONE, duh!!! :)The only problem, which I think the company will be able to resolve soon, is that there are times when it's hard to get a signal, especially when you're on the go."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Baer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T18:42:20.000Z",
          "Titre": "Far and above the connection has been…",
          "Contenu": "Far and above the connection has been great. So much better than other operators in Canada. Normally I was getting drops with an old carrier, but when I signed up again after trying out another carrier, this time I've connected fine for months."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Candido",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T01:36:22.000Z",
          "Titre": "The last upgrade of Fonus is better on…",
          "Contenu": "The last upgrade of Fonus is better on the phone side than the original offering.  I appreciate how quickly the help line is, although it was faster before the upgrade.Overall, I will stay with Fonus, but I wish they would offer a Canadian Dollar plan!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Turney Wong",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:14:02.000Z",
          "Titre": "Fonus  great for travelling",
          "Contenu": "I love the fact that I can use the data in Canada, US, Mexico and recently in Portugal. Reasonable pricing on 3 plans. My only issue is the app still gives me problems sending and receiving calls. However, I use Google Voice mostly for that."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jon R.",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:07:50.000Z",
          "Titre": "Best value for your money and…",
          "Contenu": "Best value for your money and convenience. You get data up to 20 GB, then it slows down and unlimited world wide calls and unlimited world wide roaming. That right there makes it worth it. Customer service is also usually good and crazy fast. The main issues are the fact it says “unlimited data” but once you get past 35ish GB of use, they threaten to shut off your service due to “fair use” agreement. So it’s not actually unlimited data and is very misleading. I’ve had this happen at least twice and my service even shut off altogether once. The old app was also very very buggy. The new app is much much better although sometimes texts don’t appear even after getting a notification for it and the only way the text will appear is if I open and close the window of the app repeatedly. The old app was terrible. Dropped calls, texts not sending or receiving and more.  Thankfully this new app is running relatively smooth. Overall good experience"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dianne Logan",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T13:00:50.000Z",
          "Titre": "Major Improvement",
          "Contenu": "Since we have been using the new sim cards the service has improved 300%. Good connections and no lost calls. There are still a few little glitches in trying to add and delete contacts. One problem is the fact that at this point I have to turn off WiFi to send an outgoing call. I don't think this is the situation with all phones."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dean Ziyone",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T08:03:29.000Z",
          "Titre": "Text and browsing excellent",
          "Contenu": "Messaging worked good. Had a problem with unnecessary large photos. Internet worked excellent. Fast download speed but there is a minimal delay playing online games. Phone call worked much better after installing codec that Roger's used with it's voip service."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mark Pomponi",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T21:22:00.000Z",
          "Titre": "4.5 out of 5",
          "Contenu": "4.5.  Mostly been great.  New app is a huge improvement. When Rogers went down mine automatically flipped to Bell and I didn't even notice. Tech support has been really good but i haven't needed them on months."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Roy Butterworth",
          "Nb_Reviews": 3,
          "Date": "2023-10-12T16:41:13.000Z",
          "Titre": "Totally happy with Fonus",
          "Contenu": "When I initially started using Fonus, I had a few quirks in getting it setup however, that was soon overcome by their 24/7 online support.  That said, connections to US and Europe numbers from Canada were easy and no lost calls.  This is quite a treat considering that Canadian telecoms are seriously overcharging.  When I travel to Europe, I'm sure one will get a chance to evaluate the service. Can't seem to connect the phone to my vehicle.  It receives calls but will not dial them. As for all the complainers, just a bunch of whiners."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Bruce Harling",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T13:31:44.000Z",
          "Titre": "There are times the device takes over a…",
          "Contenu": "There are times the device takes over a minute to provide internet. This seems to happen when it has been offline for a while, and needs to reconnect."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jean Côté",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:17:30.000Z",
          "Titre": "The new SIM Card and the new app…",
          "Contenu": "The new SIM Card and the new app improved tremendously our experience with Fonus.Also appreciate the price for value."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tariq Hasan",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:26:31.000Z",
          "Titre": "It was easy to setup",
          "Contenu": "It was easy to setup. I elected esim and got the servic setup right away. The only thing I don't like is if I have to use the service in one of my ten phones, I have to get new esims everytime."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Normand Ringuette",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T17:02:30.000Z",
          "Titre": "sometimes the signal is weak and i have…",
          "Contenu": "sometimes the signal is weak and i have to contact you to resend or reset."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ed L",
          "Nb_Reviews": 2,
          "Date": "2022-04-02T22:04:37.000Z",
          "Titre": "Just want to say I've been using Fonus",
          "Contenu": "Just want to say I've been using Fonus for over 6 months. If I had the ability I'd give four and a half stars out of five can't give five because nothing is perfect on this world but this is pretty darn close. So glad I signed up with this service I am using it all day long in my transportation job between calls music and podcasts and those things, Rock solid and keeps trucking all day all night long."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tufik Chediak",
          "Nb_Reviews": 4,
          "Date": "2022-11-07T01:30:33.000Z",
          "Titre": "The best but with a big issue",
          "Contenu": "I live in Canada and here all plans are really expensive. This company offer 20Gb that works in 3 countries without pay extra, no other companies are offering something similar. But a big issue is Fonus disable the hotspot of your device, so you will no able to use it with your tablet or pc. For me that is a big disadvantage, but really Fonus continues being the best option here, probably in USA or Mex there are better or similar options."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick P",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T17:45:14.000Z",
          "Titre": "Fonus WOW! Great improvements!",
          "Contenu": "Fonus has finally updated their app and Sim cards!  This occurred in August 2023.  The reliability of their service prior to this upgrades was just okay and not dependable.  I had several friends prior to these changes try out Fonus.  Some kept the service and others dropped it like a hot potato because of the reliability issue.  I had cancelled the service as well 2 weeks prior to the changes not realizing they were going to happen.Two of my friends who stuck with them advised me that after the changes Fonus was now reliable!  Not dropping any calls and the voice quality of the phone calls was now great.As I am going to do a lot of traveling around the world I decided to give them a second chance and a signed up with them again.  WOW what a difference.  The app is 100 percent better and the call quality is great.  No dropped calls. Now I can roam in 55 Countries and call 85 without paying anything extra! The only issued I have run into so far is that they advertise 5g service where available.  Well I live in Winnipeg where it is available and my phone is 5g capable.  I can not get any 5g signals from any of the companies that Fonus uses here.  Having said that the 4 g download/upload speeds are decent 83 down and 5.3 up.  Would like to know where 5g is available though?As long as the service stays the same or improves I'll be quite happy staying with it for a very long time!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "James Ha",
          "Nb_Reviews": 5,
          "Date": "2022-12-11T20:15:56.000Z",
          "Titre": "Dishonest Advertising",
          "Contenu": "I would have given them a 5 star, but they need to be more honest about their pricing. Their main webpage advertise service for $30 per month. Only after ordering the SIM card and activiting, do they reveal that there is an additional $1.58 \"Fonus Mobile Administrative Fee\" consisting of 2.9%: credit card authorization and processing fees, 2%: telecommunications regulatory fees and 0.35%: e911 fees. This is not a lot more, but the right thing to do is reveal ALL fees before a potential client orders a SIM card."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ray",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T18:22:26.000Z",
          "Titre": "My initial hookup went bad",
          "Contenu": "My initial hookup went bad. Mostly my fault. Until I talk to a service technician that was very good and knowledgeable. He hooked me up at 1:30 amAugust 23, 2022.  Fonus made my anniversary date the day I received my sim. But my phone number got ported in on August 22 which Fonus picked this date.  Working on a solution with Fonus.  Great sound great text.  Data works perfect"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "deb",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T17:28:09.000Z",
          "Titre": "I was enjoying my service and now have…",
          "Contenu": "I was enjoying my service and now have had no texts or calls every time I talk to someone I get told they are working on it!! Last night at 8pm was told expecting it back in 12 hrs still nothing ...I really need my phone !!Customer service on chat has been helpful .."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "gregm",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T10:01:17.000Z",
          "Titre": "I have been using the service for 2…",
          "Contenu": "I have been using the service for 2 years in Canada and USA. It is overall great . Since Dec 15,2022 I have not been able to text out nor receive texts. Secondly I can only make outgoing calls with fonus. I cannot receive calls since Dec. 16,2022. When I try to contact customer service ,I get an automated message that all agents are busy due to high volume. It says they are aware of an outage and working on it. This is the 3 days with no text and no incoming calls.As of Dec 31,2022 all services from Fonus ( talk, text and Data) have been working properly again for me.  Customer service was great throughout the service crash."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Wayne and Dawn MCISAAC",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T20:09:54.000Z",
          "Titre": "For me it is a much cheaper option",
          "Contenu": "For me it is a much cheaper option. I live 6 months in Niagara and 6 in South Florada so a no brainer. The issue I have is while in Niagara we have poor cell service on Lake Ontario and I get 1 bar of data and with that it’s not enough to allow wifi calling!?! All calls ring but drop. But I can call the number back, go figure. My network stays on AT+T and does not use Rogers or Bell, maybe because I’m so close to the US?!? Text work fine. Speed when not at home is good."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Bob Taylor",
          "Nb_Reviews": 7,
          "Date": "2022-11-26T12:46:34.000Z",
          "Titre": "Excellent alternative to expensive…",
          "Contenu": "Excellent alternative to expensive Canadian plans for travel. Text data are very good.  The cell can have issues."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ed W. Visser",
          "Nb_Reviews": 2,
          "Date": "2022-12-29T22:03:10.000Z",
          "Titre": "All is Well",
          "Contenu": "Could not receive calls, send or receive texts, data was OK, for 2 weeks.  Suddenly, today, everything works again. What a relief!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Yousuf Khan",
          "Nb_Reviews": 3,
          "Date": "2020-07-10T23:04:37.000Z",
          "Titre": "Rocky start, but Great working service!",
          "Contenu": "Rocky start. But it's going and getting bigger.  Happily using the service and appreciating it.  Now I can easily keep in touch with my family in the U.S. and use data as I need without having to worry about it. I look forward to seeing where fonus goes, and I'll be there the whole way.Will recommend it once it passes the 3 month mark of service.Good Luck Fonus and all the best!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Yousuf Khan",
          "Nb_Reviews": 3,
          "Date": "2020-08-27T15:14:59.000Z",
          "Titre": "Rough start, Good working service",
          "Contenu": "Honestly a Rough start.  a too good to be true vibe from it.  However, looking at profit margins from the telcos you can see this is a very achievable price point, even profitable.Good plan for Canadians and Americans looking to save.  I've been using it for couple months now with no issues.  At one point I had an issue with Text messaging but that was because I messed up my phone settings.  Once I fixed it, works no problem.Currently the plan works for North America. It's a work in progress to get Global Calling/Texting/Data.Looking forward to where this company goes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T17:53:23.000Z",
          "Titre": "Data and text works great in Canada, voice is a bit delayed",
          "Contenu": "Data and text works great in Canada. The one downside is the ping time is about 200ms which causes a delay in voice calls. This is pretty annoying. I am still deciding if i will port my number in and finally cancel Robellus for good..."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jacy Bowering",
          "Nb_Reviews": 3,
          "Date": "2021-04-13T21:53:37.000Z",
          "Titre": "trouble shooting",
          "Contenu": "i had trouble finding where to install the APN but the customer service directed me to be able to properly install it. Customer service prior to this has been extremely helpful and informative about fonus and their service."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Norman James Lim",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T12:56:58.000Z",
          "Titre": "Fonus.me SIM works",
          "Contenu": "After a rocky start my service for life SIM was finally activated.  It took over a month of chats and email follow ups but it seems to be working.Can't wait to travel again to see how well it works all over the world!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dylan Thompson",
          "Nb_Reviews": 2,
          "Date": "2020-07-11T01:55:10.000Z",
          "Titre": "An impressive young company",
          "Contenu": "I purchased my SIM card on February 2 and was delivered mid June; this was quite a while even with COVID-19 going on. I understand this has been resolved. This is a young company that is still ironing out all of the little details that a telecommunications company needs to figure out; I have experienced a couple service interruptions; a few hours while some behind the scenes work was done, and once being throttled; it was quickly fixed by a message through Telegram to the CEO Simon Tian. I anxiously wait all the future improvements that are planned; a VOIP application (Canadian number support), full world wide local based service (no roaming), and an unlimited, unthrottled, hotspot compatible data connection."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mike Saker",
          "Nb_Reviews": 2,
          "Date": "2020-07-13T16:50:56.000Z",
          "Titre": "Great value in a phone plan",
          "Contenu": "Great value in a phone plan, There are a few growing pains, as this company gets the bugs out it will become a real contender for your cellphone needs"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Papilexo",
          "Nb_Reviews": 1,
          "Date": "2020-08-10T05:12:22.000Z",
          "Titre": "When the service works it works great…",
          "Contenu": "When the service works it works great and no problem. When i had issues they solve it right away"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dany Caissy",
          "Nb_Reviews": 1,
          "Date": "2020-07-12T18:09:15.000Z",
          "Titre": "Legit and perfectly fonctionnal",
          "Contenu": "Legit and perfectly fonctionnal ! Some limitation but perfect for the Price"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "sally",
          "Nb_Reviews": 2,
          "Date": "2021-05-21T14:49:05.000Z",
          "Titre": "Good deal and customer service, TERRIBLE software and it's a virtual phone app",
          "Contenu": "The fonus offering is unheard of in Canada - a north american unlimited plan with a local number provided. However, what I hadn't realized is that they give you unlimited data and from that you use it to call and text from a fonus app - not from your native phone software. I thought that app was optional somehow.Every aspect of setting this up was untenable, other than the customer service. I couldn't get the sim because I was in some UI infinite loop on their site. I had to order it through Amazon. Activating the sim caused some mysterious 404 error where I was an unknown user for some API of an american voip service. I had to use a different email and my incognito tab. Now I have two separate accounts, but the new one has a email provided password I can't reset because of some unexplained 401 error, given I can use the password to log in. So I'm stuck with the security compromise of having this unencrypted password in my email. Another email told me to put the wrong name into the APN. It was not clear from the email or anywhere that I'd be dependent on this Fonus app. It took me over an hour to set this up today. If they didn't have rapid response chat help I wouldn't have made it through. I kind of resent I did. The deal was too good to pass up. Now I'm just waiting for my number to port over and I'm hoping that's the last I have to do of setup; that I can just coast on some good savings now.Update - ah, my password did update to the new one, even thought it said otherwise. Ok, less concerned about security of my payment method now...I have a feeling that over time as I travel more I'll be really happy I chose this."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "DS",
          "Nb_Reviews": 2,
          "Date": "2020-07-13T18:34:15.000Z",
          "Titre": "Start up growing pains, but delivered on service",
          "Contenu": "Fonus had some growing pains, as it originally promised unlimted everything, everywhere, with roaming around the world.It may have launched a bit too soon in November 2019 which has left quite a few of the early adopters very disgruntled as they didn't get what they hoped for right away.   Covid-19 played a part in the delays as most SIM cards were shipped from China, and did not get delivered until Apr-June 2020.   Some roaming agreements may have fell through, as once SIM cards starting getting activated, service is only available in the US/Canada/Mexico.   Simon, the CEO, is on track to have worldwide roaming in place with a future update.Nonetheless, in Canada the Fonus SIM is fantastic.  It roams on all 3.5 of the major carriers (Bell, Telus, Rogers, and Freedom Mobile) with LTE speeds.  It will automatically select the network that has the strongest signal and adapt as needed.   In Toronto, I've reached 300Mbit speeds with Telus.There will be future updates such as a VoIP app as a way to have a Canadian number and the ability to port numbers to it.  Currently, you can only get a US number, and there is no ability to port non-US numbers.   This will change to a data-only SIM, with the VoIP app.   In addition, future roaming agreements are supposedly coming to allow for extended roaming in more countries.In Canada at least, the value is there as a $30 USD/month plan with unlimited data on all 3.5 carriers is tremendous value.   Right now, it might be best suited in dual-SIM phones though due to not being able to port over your Canadian number.If you need lots of data, there is good value in the service, and eventually the future updates will make it something very unique in the Canadian market."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dudeman",
          "Nb_Reviews": 1,
          "Date": "2020-07-19T17:21:35.000Z",
          "Titre": "Rough Start But Getting Smoother",
          "Contenu": "So from the start Fonus had a rocky start which really hindered the Brand of Fonus.I was 1 of the 500 to snag a Lifetime plan when they first got mentioned.Once I got my sim it was as simple as getting my ICCID and IMEI for the hookup with either a Fonus Support Agent or Mr.Tian for the the Lifetime service and i was rocking within 20 minutes.Fonus has been my goto over my actual BellMts plan I have here in Canada due to the True Unlimited Data they Offer as any other Canadian providers seem to just nickel and dime you out of all your hard earned Cash.Coverage is very massive although I admit I personally have not fully traveled to test out more of the region I am located in but their is many others who have been testing with great results.Speeds vary depending on the time of day as i would expect it to with any other provider.Anywhere from 25mbps up to a whopping 200mbps+ depending on your location to the service tower in your areas.The support is available when you need it with Fonus!!I use Fonus as my spare day to day for anything I really could think of.There are still hiccups here and there but those growing pains are normal with a Up and coming business in this day and age.As a service recipient since June 2020 I have been very pleased with my overall experience in the time I have had it.Would I drop my BellMts plans?-Not just yet as Canadain Number Porting is not fulling implemented quite yet but it has been a critical focal point for Fonus.Pros-Great Support-Quick Service -Not locked into a Contract / Cancel Anytime you want/needCons-No Fonus App Yet (coming roughly soonish)-Must Contact support if your data gets throttled-Some issues with certain devices Picking your CarrierCritical Thoughts-Give it a try for a month and see how it suits your needs as you could be surprised on how well it suits you.Just a short review from my experience so far.Could change as more progress forward happens."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Vitali Kolos",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T02:48:48.000Z",
          "Titre": "5 star service",
          "Contenu": "5 star service! I've got a Canadian number and I do work overseas. I have no need for local SIM cards anymore when I travel as I have data access and can use my phone wherever in the world I am.Only wish they make their phone app work with Android Auto to place phone calls, that's about the only inconvenience I can think of using FONUS."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Stalport",
          "Nb_Reviews": 3,
          "Date": "2023-11-07T22:12:12.000Z",
          "Titre": "Was able to get immediate assistance…",
          "Contenu": "Was able to get immediate assistance from Fonus to set up my Hot Spot.Have to say that since the updates with the new affiliation with KPNL the service is 99% better. No dropped calls, no repeated dialling and 100% clarity.All of this combined with better pricing. You’re punching above your weight now….It’s a winner folks!!!Keep up the good work.."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jbirch",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:38:03.000Z",
          "Titre": "Glad to see an MVNO operating in Canada…",
          "Contenu": "Glad to see an MVNO operating in Canada (even if not Canada based?).  Lower cost rates for no contract data access than the incumbent Telcos after taxes. Subscription plan: World Unlimited Starter (with eSIM) Good chat based customer service (thanks Sophie) helped out on sign up mix up (esim vs. sim).  e-sim works as expected with Pixel 6a.  No complaints to date."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Marcel Elderhorst",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:57:31.000Z",
          "Titre": "Love the new recently introduced format",
          "Contenu": "Love the new recently introduced format for Fonus. We just went on a transatlantic cruise to 7 different countries and Fonus worked in every one of them. A big plus was that the Fonus app works on any internet connection, we were able to make and receive phone calls for free through the ship's wifi while we were in the middle of the ocean far from any phone or data connections."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Randy Randell",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T21:56:50.000Z",
          "Titre": "Canada/U.S. Cell Phone Service",
          "Contenu": "So far the transformation from a Canadian provider for service in Canada only to Fonus that gives us phone coverage in Canada and the U.S. (plus other countries) has been tremendous. No issues with phoning anywhere, texting anywhere or using data to search for things in the internet. To top it all if, the monthly rates are fantastic. There were some small glitches at the beginning but that’s been ironed out. Right now Fonus is my Cell Phone Service provider of choice."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ken",
          "Nb_Reviews": 12,
          "Date": "2023-10-31T22:22:22.000Z",
          "Titre": "Best bang for buck mobile operator for…",
          "Contenu": "Best bang for buck mobile operator for the whole  Canadian 🍁 citizen land include worldwide coverage free of charge.Have both a choice of a USA or Canadian number is also possible 🙀.One SIM do everything solution."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T16:34:24.000Z",
          "Titre": "So Far really good",
          "Contenu": "So Far really good.  Received SIM card in only a few days.  We are in Canada and the Account Initiation was smooth (we requested a new number).  We chose the 5GB plan and the first bill went through as the quoted $19.00 USD plus GST (Canada Tax).  You do have to get used to the change to always using the FONUS app for calls and texts but it has work smoothly for us.  It picks up all you contacts from your Google Account.We are in a Rural area of British Columbia and the Cell became active in just a few minutes at LTE speed.  It has worked in other cities in BC and Alberta we have travelled to at LTE or 5G speed and we are now in Nuevo Vallarta MX and it worked just 2 minutes after landing and is currently shown on the Telcel network at LTE speed.So all as described so far and we are happy with the way the FONUS app works."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brandon Arneson",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T03:40:59.000Z",
          "Titre": "Highly recommend Fonus",
          "Contenu": "I've had fonus for 3 months as of now and I'm extremely satisfied with the unlimited data that I'm getting for the lowest price I've ever paid, I highly recommend this carrier as an esim or physical sim!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mehr Kay",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:38:40.000Z",
          "Titre": "I like the simplicity of Fonus and its…",
          "Contenu": "I like the simplicity of Fonus and its excellent customer service. Although I wish they had a direct phone line, their chat support and response time are great. The voice quality is clear, even though it is a VoIP service, and the connection is reliable."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michel H.",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T15:53:18.000Z",
          "Titre": "The new version is fantastic",
          "Contenu": "The new version is fantastic. Were we supposed to receive a credit, when the new billing was applied or did I read wrong? Keep up innovating.Kindest regards.Michel Hamel, 613-900-1910"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Frankie Lam",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:45:37.000Z",
          "Titre": "Beyond my expectation",
          "Contenu": "Surprisingly easy to use and it works well with my smart watch. The app connects incoming calls and WhatsApp calls with no problems at all. It could be perfect if I can dial out from the smart watch as regular phone line. Hope it will work in future app update."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Amanda Smith",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T23:09:04.000Z",
          "Titre": "Fonus customer support is amazing and…",
          "Contenu": "Fonus customer support is amazing and coverage is exceptional. I was happy before upgrade and now I am beyond thrilled with service. I honestly don’t think I would go back to a regular service provider, especially in Canada because it’s impossible to unlimited service here unless you want to pay couple hundred bucks a month."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "James Mactier",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:41:53.000Z",
          "Titre": "Fonus Works",
          "Contenu": "Fonus has worked well for me and my partner for 2 years now. It even works at our remote cabin I can create a hotspot with my iPhone and laptop. It even worked seamless in our trip to Scotland and Iceland. We LOVE Fonus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Carnogursky",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:15:33.000Z",
          "Titre": "I am using focus in remote part of…",
          "Contenu": "I am using fonus in remote part of Slovakia, and have three local carriers to choose from. Excellent service for 3 years in Canada already."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Christine Bouchard",
          "Nb_Reviews": 4,
          "Date": "2023-11-01T04:43:02.000Z",
          "Titre": "Why I love fonus",
          "Contenu": "There is always support when I need someone. I am not a huge tech person but the support here walks you through everything. They are patient kind and compassionate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Engineer C.",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:32:09.000Z",
          "Titre": "Fonus working great",
          "Contenu": "Fonus working great! Using a New/Old stock/Unlocked Sim_ LG Stylo 6- 4G Android cell phone. USA Customer"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Allister",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:19:28.000Z",
          "Titre": "A great roaming data mobile service.",
          "Contenu": "Oct 2023 updated: A great roaming data mobile service. The service I purchased is 20GB at full speed and above that is at a lower speed. So far I've used in Canada and the US and it works great. Nothing negative to say about the service so far. I will updated again if needed."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mike Saker",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T22:29:25.000Z",
          "Titre": "The service keeps getting better",
          "Contenu": "The service keeps getting better. More countries added to the unlimited data package. More pack options. Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mark Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:03:23.000Z",
          "Titre": "simple cheap service using voip and…",
          "Contenu": "simple cheap service using voip and lots of data plan not for everyone but works if you accept manual dialing"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Keith M",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T07:31:45.000Z",
          "Titre": "great service",
          "Contenu": "great service, easy to use and great when roaming,as you can call for free without those annoying roaming charges."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "H Fulton",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:10:22.000Z",
          "Titre": "Great, world provider.",
          "Contenu": "The service has had some changes over the years, but I have been very satisfied with the service I have had from Fonus since the beginning."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gary Grewal",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:14:19.000Z",
          "Titre": "Using now from few years",
          "Contenu": "Using now from few years, No issues. Dialing local or overseas. Work fine."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Niculita Sergiu",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:04:07.000Z",
          "Titre": "My experience with Fonus is great…",
          "Contenu": "My experience with Fonus is great because is the ony company who give me unlimited calls with Europe and unlimited GB for only 45$ CAD."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T21:44:30.000Z",
          "Titre": "It works but there are some minor…",
          "Contenu": "It works but there are some minor learning curves you need to get used to it in the beginning."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Keith Loo",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T07:26:44.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Have been with the plan for a couple of years now - and they're consistently getting better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Buckshot",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T21:31:47.000Z",
          "Titre": "Great App/phone service",
          "Contenu": "We're very pleased with the recent upgrade , much improved. Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Queena T",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:09:14.000Z",
          "Titre": "Love it",
          "Contenu": "Love it , has stable wifi and can cover most daily contact need"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brad M Wilgosh",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T21:29:10.000Z",
          "Titre": "So Far, So Good.",
          "Contenu": "So far so good and works in all of North America, not just Canada and USA. Works in Mexico as well."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Johnny Mac",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T03:15:18.000Z",
          "Titre": "The new app is 100% improvement on the…",
          "Contenu": "The new app is 100% improvement on the old one. I can’t fault fonus. 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ron Pollock",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:13:23.000Z",
          "Titre": "The price is right and the service is…",
          "Contenu": "The price is right and the service is great , I can usually get help right away !"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sky Mooney",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T07:44:28.000Z",
          "Titre": "Was having trouble migrating over to…",
          "Contenu": "Was having trouble migrating over to Fonus's new esim plan from what was considered v3.  Used the online support system and they were able to resolve my issue promptly."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Samir Salihagic",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T23:22:13.000Z",
          "Titre": "wherever I have been in the world a…",
          "Contenu": "wherever I have been in the world a very good signal, and I am very pleased and glad to be with you.Fonus"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Paul Brandejs",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T03:14:34.000Z",
          "Titre": "So far so good.",
          "Contenu": "The price is right and everything is working as promised."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Steve Andrews",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T21:32:24.000Z",
          "Titre": "The incredible patience numerous…",
          "Contenu": "The incredible patience numerous members showed an old codger like me with my phone issues. Many thanks again. Highly recommend fonus. Steve A"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Fortsch",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T14:16:20.000Z",
          "Titre": "Works fine now",
          "Contenu": "My charger stopped fast charging after 3 weeks HOWEVER it was not the charger cord, it was the block it came with!  The block was replaced and now it fast charges just fine!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Denise",
          "Nb_Reviews": 1,
          "Date": "2022-05-30T01:26:20.000Z",
          "Titre": "I was skeptical but it's FANTASTIC- $30…",
          "Contenu": "I was skeptical but it's FANTASTIC- $30 U.S. unlimited everything in Canada, U.S. and Mexico?? YES!!! It's been fantastic!! 20gig at full speed, great coverage, 5G where available, no roaming fees and major providers (AT&T, Bell, Telus and Rogers for sure) -  YES PLEASE! About two months in. The only negative I can report is that I've had a few phone calls drop. Personally, I'm way more interested in data and texts and can readily call using another data based app if I have to, like Messenger, WhatsApp...there are other options, but calls do typically work fine. IMO, Fonus is a no brainer."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Billy Kot",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T14:56:30.000Z",
          "Titre": "Very helpful and attentive",
          "Contenu": "The online chat help agents are great.  They're available to help right away even at after midnight.  Got my new SIMs setup and my old numbers transferred over within an hour, even when I was told it would take up to 24 hrs.I have been using Fonus for a couple years.  It's great for traveling in the US and Mexico.  Now with the upgraded world roaming, I'm sure I'll like it more."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dilbagh Puri",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T03:23:41.000Z",
          "Titre": "PERFECT FOR WORLD ROAMERS",
          "Contenu": "I TRIED ALL POSSIBLE WAYS TO LOOK OUT FLAWS IN FONUS.VERY PERFECT. ONLY THING IS THAT A LITTLE TRICKY TO CONFIGURE AND GET DOUBT AT EVERY STEP, IF IT IS SCAM.BUT I AM SATISFIED.AT END I CAN SAY, IF PHONE CONNECTED TO WIFI, YOU CAN USE NORMAL DIALER. IF WIFI NOT CONNECTED USE FONUS APPLICATION FOR TEXTING AND CALLING. ONLY PROBLEM WILL BE NO VIDEO CHATYES I AM EDITING MY REVIEW AND ADDING LINE THAT CUSTOMER SERVICE IS EXCELLENT."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dave Hamilton",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T00:40:11.000Z",
          "Titre": "Fonus Rocks!!!",
          "Contenu": "I researched several travel sim companies for a recent multi month trip and decided to try Fonus. The SIM card arrived very quickly. Being new to setting up a service it took me some time to figure it out and ran into trouble. The Fonus tech support had me up and running in no time. The service worked as promised throughout Canada, US and Mexico. For 30 bucks a month for unlimited data and uninterrupted service truly impressed me. Highly recommend and I plan to reactivate the service for my travels in future."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sid",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T03:36:03.000Z",
          "Titre": "Excellent service in Canada as well as…",
          "Contenu": "Excellent service in Canada as well as in USA I am quite impressed specially those who are still paying insane bill monthly in Canada.Just imagine for $30 USD you are getting international calling and everything unlimited.Its been over a month i have been using Fonus and every time i had any issue the customer service is excellent and 24/7.On Sunday i had a issue and that got resolved today itself.I switched from big 3 so far I am beyond happy if you using in USA/Canada as there is No Roaming and moreover you don;t pay insane roaming charges."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Adrian D",
          "Nb_Reviews": 1,
          "Date": "2021-08-07T12:55:11.000Z",
          "Titre": "Successfully ported-in two VoIP numbers to Fonus",
          "Contenu": "[Readers to be informed and aware about technical limitations, Fonus phone service may not fit all users needs] Initially wished not to worry about mobile data limits, now I don't :)Then wanted to transfer a VoIP number, registered for free ~8 years ago (frankly, I didn't believed that can be done). Took ~2 weeks until I received the successfully completed email notification! Now I can even talk and text from my very-first number across North America without worrying about coverage, minutes or text limits. Thanks to Fonus Support, always responsive and polite! Just have patience and faith and provide all required data to Fonus Support, very easy to do and follow up via email/chat. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Thomas Lenart",
          "Nb_Reviews": 3,
          "Date": "2021-09-03T16:39:34.000Z",
          "Titre": "Old number was transferred from Freedom to Fonus",
          "Contenu": "This is my second review ,and to be honest I was kind of worry about my old  phone number from Freedom Mobile to Fonus Mobile transfer.Actually everything it's done and I have my old number .To apply to keep your old number click on the  arrows  on the temporary number on the  Fonus application.Wait few second and page will loaded with instructions.I really like Fonus ,my phone works everywhere from Quebec and all Canada to all US and is 40 Canadians Dollars unlimited which means 20 GB and after still connected with slower speed.Im sending lots of documents via TurboScan and I'm not worry about cost ,speed or services"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "CyberNut",
          "Nb_Reviews": 2,
          "Date": "2021-08-06T18:18:18.000Z",
          "Titre": "I was skeptical about Fonus at first…",
          "Contenu": "I was skeptical about Fonus at first because there is nothing like this in Canada. Unless I don't know otherwise. I was using Public Mobile, as cheap as It could be, but data still costs a lot for 3G in Canada. I have been so impressed with Fonus, the SIM was delivered in 5 business days and didn't have any issues with setting up the plan. My service runs on Rogers, but can switch to Bell by choosing the carrier. Seriously amazing for 40 cdn a month."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dave Gibson",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T23:42:31.000Z",
          "Titre": "Fonus is A ok in my books. After a bit of frustration with the…",
          "Contenu": "After a bit of frustration with the Fonus billing department, I had an unexpected turnaround of events. I had used my Fonus account for approximately four months when I no longer used their service. Unfortunately, two more payments came out of my account over two months. I vented my frustration on a public forum, and believe it or not somebody chimed in from Fonus. Let’s call him “Simon”. Simon says (no pun intended.) Leave it to him and he will track down the billing information. After a short period of time Simon got back to me and told me that they had over billed me for two months , and that was going to be remedied. Oh my gosh within a matter of a few days the money is back in my account and I am so happy with that turn of events. Fonus is definitely OK in my books."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sami Dalouche",
          "Nb_Reviews": 1,
          "Date": "2021-08-26T16:23:15.000Z",
          "Titre": "All set!",
          "Contenu": "Ordered the SIM card, arrived in 2-3 business days, then transferred my existing number from Fizz (Canadian/Quebec provider), which took another 2-3 business days, and now, I'm all set. The setup process could be slightly more user-friendly (especially with regard to APN creation on iOS), but definitely not a deal-breaker. Just properly read the instructions, follow them, and you're all set.Haven't used the service much for now, but there are no reasons to doubt the service quality since it connects to the Rogers network where I live."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Daniel Buss",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T19:40:32.000Z",
          "Titre": "Here is my experience",
          "Contenu": "Here is my experience. Odered a SIM and it arrived 3 days later (not bad). Activated it with the help of support and then had to set up APN (a bit complicated but managed to do it), then the data started working immediately! Got around 200Mbps in Montreal."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Matt Cianfarani",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T02:17:36.000Z",
          "Titre": "Exactly as advertised",
          "Contenu": "Exactly as advertised. A data plan with an app to call/text with. Support (Anne + Bruce) are great. I recently re-subscribed to the service simply as there were no comparable options on the market. Recommended!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "dave smith",
          "Nb_Reviews": 1,
          "Date": "2021-08-08T03:35:13.000Z",
          "Titre": "Superstar Support",
          "Contenu": "Fonus is not the most user friendly service I have ever used.  However, saying that,  they have an incredibly strong support crew that is incredibly knowledgeable.   Bruce was my latest support person and he walked my through my issue like it was nothing.  I can't begin to thank these guys enough.The plans are exactly what the ads say they are and the service is top notch!  Thank you very much Bruce, and Fonus."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Monik",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T17:43:29.000Z",
          "Titre": "ACTIVATE A NEW CARD",
          "Contenu": "I just activated my new SIM card and received absolutely amazing support from Manon and Bruce. The whole thing scared me because I'm not good at electronics but everything works wonderfully well."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tania",
          "Nb_Reviews": 3,
          "Date": "2021-11-08T00:06:32.000Z",
          "Titre": "I was having some technical challenges…",
          "Contenu": "I was having some technical challenges with my phone during set-up and the staff offering live chat were always readily available and super helpful. I found this way more helpful than when I have contacted my old provider (a big provider company). Highly recommend Fonus."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gabriella Ferraro",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:23:59.000Z",
          "Titre": "Great service",
          "Contenu": "Since your upgrade the service is absolutely incredible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T22:40:31.000Z",
          "Titre": "After AT&T shut down the 3G network, I found a perfect alternative!",
          "Contenu": "After AT&T shut down the 3G network, my phone would not work with AT&T and I was requested to buy a new phone exclusively from AT&T. I decided to abandon AT&T and look for another option. Given the fact that I need to use my phone in the US and Canada, I came to know about Fonus. I have looked into several articles about Fonus and read through lots of reviews before I decided to use this service. I purchased a SIM card and it was delivered to me in only 2 days. I installed the card and by following the instructions, I was able to activate my SIM card and select a new number of my preference. Since I started using Fonus, I had no problem and I am totally satisfied with its service. I am saving over $20USD by paying only $30USD for Fonus compared to AT&T and with better service!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Guillaume Mercier",
          "Nb_Reviews": 1,
          "Date": "2022-07-09T17:48:05.000Z",
          "Titre": "Did setup my phone in 5 minutes",
          "Contenu": "Did setup my phone in 5 minutes. Now I have access to unlimited data inin Canada, USA and mexico. For 30usd /month. I did have a mini problem I did enter the wrong APN. They helper me via chat on they website in 2 minutes. Exellent customer service. I highly recommend fonus mobile."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Robert Gerald Farrar",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T22:06:38.000Z",
          "Titre": "I encountered a configuration problem…",
          "Contenu": "I encountered a configuration problem with my oddball dual sim Asus Zenphone and was unable to connect to data. The technicians at Fonus stuck with it even after I was ready to call it quits and resolved it for me. Huge shout out!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Holger Renner",
          "Nb_Reviews": 2,
          "Date": "2021-12-14T22:59:23.000Z",
          "Titre": "Fully satisfied with the Help to setup my Cell Phone !",
          "Contenu": "Yesterday I had to setup my Cell Phone. It didn't really work on my own, so I called Your Customer Service. First I talked to Anne and she gave me  a good help, but the Phone didn't really want to do what I wanted from the Phone - It Should work. Then BRUCE called me back and finally he had the Genius Idea : I have a MAGIC JACK Home Phone connection, and he ask me to deactivate the option to block automated calls and guess what - IT worked ! Thanks to Your guys . They were really Helpful !!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Scott N",
          "Nb_Reviews": 9,
          "Date": "2021-09-15T23:55:02.000Z",
          "Titre": "Great service, just not compatible with my crappy samsung android 11",
          "Contenu": "To be honest, at first It wasn't working for me, and I thought it was the service, turns out its dumb old android 11 and all the bugs that come with it. May return again some day, once i get rid of this crappy phone. The customer service team is PHENOMENAL. 5/5 They are super helpful and friendly and always there to help the best they can. Word to the wise, STAY AWAY FROM ANDROID 11"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Charlie Pierce",
          "Nb_Reviews": 1,
          "Date": "2022-06-26T16:40:23.000Z",
          "Titre": "Good service with issues",
          "Contenu": "I been using FONUS in my phone for many months.  The only problem I have is it drops most incoming calls.  I have reset the app many times as suggested each time I complain, still drops most call after 1 ring, so I have to return the call.  I also wish they would allow the SIM card to work in my iPad Air."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sesvin",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T02:01:05.000Z",
          "Titre": "Amazing Customer Support",
          "Contenu": "I had trouble activating my SIM and used the text bot to talk to customer support. Anne was an amazing help, she was very patient and stayed with me through out the whole process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Murney",
          "Nb_Reviews": 2,
          "Date": "2022-06-23T22:53:08.000Z",
          "Titre": "Great customer service",
          "Contenu": "I am not very technical.  I had some difficulties setting the service up, their tech support could not have been more helpful and walked me through setting changes step by step"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mark Pomponi",
          "Nb_Reviews": 2,
          "Date": "2021-11-27T19:06:38.000Z",
          "Titre": "After 2 weeks it's been rock solid",
          "Contenu": "I've been using the service for two weeks after reading about them for months. I finally switch and the service has been surprisingly good. It has been rock solid. I'm actually switching my wife over next month. I had a minor bug with the UI for the app and a quick reinstall fixed it. Support has been really great. Like....instant. Although the calling is done through their app it in reality has no impact. Works great."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Erlyn Mae Palorma",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T02:02:34.000Z",
          "Titre": "I recently learned about Fonus and I…",
          "Contenu": "I recently learned about Fonus and I have been very impressed. What I appreciate most about Fonus is their focus on simplicity and affordability. Their mobile app is user-friendly and easy to navigate. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-02-11T17:45:01.000Z",
          "Titre": "Fonus is a good choice in telecom services",
          "Contenu": "Had some issues in getting the app to work. Bruce was systematic and patient as we tried to set things up properly. Well done and successful. The app works as promised and seems a great choice for low cost data/phone service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Steve Andrews",
          "Nb_Reviews": 2,
          "Date": "2022-01-09T01:58:26.000Z",
          "Titre": "Bruce was absolutely great in helping…",
          "Contenu": "Bruce was absolutely great in helping me with my wife’s phone problem. He was so patient with me as a senior the technology doesn’t come easily to me. Many thanks again Bruce and fonus support team"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Carlos",
          "Nb_Reviews": 2,
          "Date": "2022-02-05T22:01:06.000Z",
          "Titre": "Awesome service with small sacrifices",
          "Contenu": "I saw an ad on Facebook for this service, and after doing the necessary research, I decided to give it a try. The first sign that this service was legit was when I got my SIM card in less than a week. Considering I am paying in USD, I expected it to be shipped from the US and take much longer. Next favorable impression was when I needed customer service to activate my SIM card after running into issues, and with the rapid and friendly assistance from Bruce, I was quickly up and running!I think the only thing to consider is that with this service you essentially get a generous data plan, but not actual calling or texting - You must use the associated Fonus app to actually emulate the calling and texting features. If you can live with this, the service is an unbelievable value!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "veroncy",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T22:17:52.000Z",
          "Titre": "Chat was invaluable to set up",
          "Contenu": "Chat was invaluable to set up. The rep was very responsive and clear in providing guidance. I didn't have to wait very long for responses. All my questions were answered. I encourage all new users to use the Chat service during setup."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Buj Rao",
          "Nb_Reviews": 2,
          "Date": "2021-08-19T17:45:27.000Z",
          "Titre": "ALL SUPPORT IS NOT CREATED EQUALLY",
          "Contenu": "I recently decided to take Fonus up on their offer of $30/month unlimited ... so all I had to do was port my number over from another company (let's just say I was not very LUCKY in doing that).Fonus kept sending my old provider a message saying I wanted to port my number to Fonus and they keep[ rejecting my request. I had to contact my old provider for over 4 weeks asking why they kept rejecting the port request and they kept saying try again and it would work. Well, Fonus hung in there with me and after numerous attempts we finally got the number ported. I just want to say it was a very frustrating process but Fonus support was always there for me and never stopped trying, suggesting things we can try along the way .Products are products, services are services but in the end, all support is not created equally  .. Fonus has top-notch support and that will keep me loyal for years to come"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Deane",
          "Nb_Reviews": 2,
          "Date": "2022-01-13T20:11:26.000Z",
          "Titre": "It is with great pleasure that I write…",
          "Contenu": "It is with great pleasure that I write this review of my contact with Fonusmobile.  I am 74 yrs old….very young at heart and busy but as your dealings with me will bear out, am not to computer savvy…(lol)Fonus reps have been very helpful in guiding me thru the setup system.  They deserve top marks ..helpful friendly and patient…I am really looking forward to my travels..when we can …being able to contact friends and family in Canada and the USA and not  have a bill every every month THANK YOU FONUS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John McKaig",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T17:54:17.000Z",
          "Titre": "Tremendous Help",
          "Contenu": "I am a old guy and not all that familiar with how to find my way around with this stuff but I had tremendous help from a fellow by the name of Bruce.  I am sure that I tried his patience on more than one occasion but he stuck with me and we got it done.  So a big THANK YOU BRUCE."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brandon Edstrom",
          "Nb_Reviews": 2,
          "Date": "2022-05-16T03:06:19.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, I have had a couple bumps but I have glided through all them with ease thanks to their great online reps, all issues fixed in seconds."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Thomas Lenart",
          "Nb_Reviews": 3,
          "Date": "2021-08-12T00:52:03.000Z",
          "Titre": "This is a great mobile option for Canadian Truck Drivers ,awesome price for US data",
          "Contenu": "This is a great mobile option for Canadians with lots of megabits for Canada and the US, with a very good price, and great support to set it up.20 Gb nobody cat bit it up 42 Canadians Dollars, all Canada and US"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kristiano Klimi",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T23:27:18.000Z",
          "Titre": "Great service & plans."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Troy",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T04:56:15.000Z",
          "Titre": "So far these guys have been amazing",
          "Contenu": "So far these guys have been amazing. The wifi is great. Cell reception is a bit spotty but the customer service is so fast and helpful and awesome to deal with highly recommend these guys!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Lynn",
          "Nb_Reviews": 2,
          "Date": "2022-04-11T22:35:03.000Z",
          "Titre": "Server was excellent",
          "Contenu": "Server was excellent, patient with us.  Phone would not work using data, only internet.Everything good now we think.   Please pass on that seniors do not do tech good, we used tablet and phone and 2 people.  Being able to talk on a phone would be much easier for us even if you must call us.   Thank you"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "George",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T01:10:34.000Z",
          "Titre": "Great service worldwide"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Roland Stegner",
          "Nb_Reviews": 1,
          "Date": "2022-07-10T16:09:04.000Z",
          "Titre": "This service is fantastic Customer…",
          "Contenu": "This service is fantastic Customer Service is A ++++ They really work to get you a solution if you have an issue, Oh and when the Rogers Service went down across Canada this service was up and running no issues on another provider within seconds. I highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael K a s h k o v",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T05:35:49.000Z",
          "Titre": "Well for $30 US evergreens I can get…",
          "Contenu": "Well for $30 US evergreens I can get the best of the best mobile internet in Canada since Canadian operators overcharge customers... Also, I was a nice option this Christmas being able to use the internet in Mechixo without any additional charges."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Marty",
          "Nb_Reviews": 1,
          "Date": "2021-07-29T22:28:13.000Z",
          "Titre": "Excellent Service",
          "Contenu": "I had multiple issues setting up my Fonus account, mostly due to my own ignorance. However, the customer service was fantastic and made an otherwise confusing situation a breeze. The reps responded quickly and did a great deal of work in the background, which was  muchly appreciated. The deal and service they offer is unmatched in telecommunications."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "RG",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T22:18:03.000Z",
          "Titre": "im so happy with fonus",
          "Contenu": "im so happy with fonus, its a big big savings and its 20gb with everything unlimited . and you can transfer your number to fonus with no charge. this really big move for Canadians"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Matviy Avdonine",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T02:58:39.000Z",
          "Titre": "I love FONUS customer support not…",
          "Contenu": "I love FONUS customer support not because it's 24/7 but because of their knoweledge and willing to help at anytime. Thank you guys!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Smith Rowsell",
          "Nb_Reviews": 3,
          "Date": "2022-04-26T00:46:16.695Z",
          "Titre": "I had an issue when my phone was…",
          "Contenu": "I had an issue when my phone was updated, I am a senior with little knowledge of this stuff. The person I chatted with online helped me. This is not the first time I have had issues and they are always patient and very helpful! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Frank Charry",
          "Nb_Reviews": 1,
          "Date": "2021-11-23T21:22:05.000Z",
          "Titre": "had issues with certain area codes…",
          "Contenu": "had issues with certain area codes calls didn't go thru talked with reps  then had me up and running in a short time .Their crew are well trained and was pleasure in chatting with them all is well Job well done Fonus staff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pénélope Fortin",
          "Nb_Reviews": 3,
          "Date": "2021-09-29T21:02:32.000Z",
          "Titre": "Best customer service!",
          "Contenu": "For a startup, the customer service is unbelievable! Always super helpful. And very satisfied of the data plan service. For the price, it's amazing. Thank you Fonus!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "wayne tait",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T21:11:41.000Z",
          "Titre": "affordable and reliable . real people answer your questions",
          "Contenu": "affordable and reliable . a great option for local and international ."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bristle",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T04:51:34.000Z",
          "Titre": "I thought this deal was too good to be…",
          "Contenu": "I thought this deal was too good to be true ordered a sim activation was very easy payed 30$ and it was ready to go downloaded the app got a phone number for free in any state 4 bars of lte on iPhone 12 super fast unlimited data thanks fonus"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel Reid",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T08:41:58.000Z",
          "Titre": "For the price hey are offering",
          "Contenu": "For the price hey are offering, Really can't complain. In my opinion this is a no-brainer for those who spend much time between US and Canada."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Peterson",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T13:44:09.000Z",
          "Titre": "This is great plan if you need to call…",
          "Contenu": "This is great plan if you need to call overseas a lot. They include international calling free of charge."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael Mah",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T23:02:07.000Z",
          "Titre": "Reliable and prompt service!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Paul  Carnogursky",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T03:10:39.000Z",
          "Titre": "fonus works great",
          "Contenu": "fonus works great, works everywhere, data is fast, @ much better rates than any phone company in Canada."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Riz Far",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:08:31.000Z",
          "Titre": "Great customer service and 5G…",
          "Contenu": "Great customer service and 5G connectivity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hima Albaria",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T01:39:41.000Z",
          "Titre": "Surprised it's working",
          "Contenu": "Surprised it's working! Great experience so far and their support team responds right away which is great!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Saumya Joshy",
          "Nb_Reviews": 1,
          "Date": "2021-10-24T02:32:27.000Z",
          "Titre": "Query",
          "Contenu": "Quote\"The plan shall be used in compatible phones only; hotspots and routers are not supported\".unquoteCould you please be kind enough to shed more light to the statement."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Amed",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T01:11:14.000Z",
          "Titre": "Wish they came sooner!",
          "Contenu": "Super quick and seamless! everything is self-explanatory and straightforward! If you ever stuck the Chat support 5-STARS*****"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Frank Hull",
          "Nb_Reviews": 4,
          "Date": "2023-01-01T14:31:53.000Z",
          "Titre": "There are limits to unlimited using Fonus.",
          "Contenu": "While visiting in Carmel New York the cable internet went out for two days. So I decided to stream Netflix and Xfinity Stream over my Fonus data plan using apps on my phone. To my surprise I was not throttled over AT&T. In Canada I am always throttled to 512kb once I hit 20GB so I never go over 20GB by much. Toronto is home. After using almost 40 GB of data. I received this e-mail. Hi there,This message serves to inform you that your account's data usage is greater than 99.5% of all Service customers and has been deemed excessive, indicative of our service being used as a home internet replacement.This is in direct violation of our Fonus' FUP (fair use policy). You may find the FUP on our \"Privacy & Legal\" page, at trust pilot does not allow links.Here is the excerpt of the FUP relevant to your situation:\"Fonus Mobile Service and any related data services are provided solely for purposes of web browsing, messaging, and similar activities. You are responsible for all data activity from and to your device regardless of who initiates the activity. You may not be allowed to use the Fonus Mobile Service with applications and systems that drive continuous heavy data sessions and generate excessive amounts of traffic. We reserve the right to limit, suspend or terminate without notice any misuse of our network or violation of these Service Terms and Conditions.\"Please reduce your data consumption immediately and significantly; and use Wi-Fi whenever possible to avoid suspension of service. Fonus has the right to not renew our month to month service agreements if it deems excessive use is contributing to network congestion.We thank you for your understanding and apologize for any inconveniences caused.- Fonus Customer ServiceFor questions, chat with our 24/7 support team at fonusmobile.com. I have now tuned off my phone until my next billing cycle. if you plan on streaming video or use your device for heavy data do not go ever 20GB. The term unlimited data does not mean you can use the service like your home internet connection. It clearly states that in this e-mail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mariya",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T05:31:33.000Z",
          "Titre": "Very satisfied customer here",
          "Contenu": "Very satisfied customer here. Their chat support is great if you run into any issues."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mohamed Galal",
          "Nb_Reviews": 2,
          "Date": "2022-04-28T08:06:05.087Z",
          "Titre": "Anne was very professional and helpful…",
          "Contenu": "Anne was very professional and helpful and know the answer to every question, I'm very happy to deal with her."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "alpha",
          "Nb_Reviews": 2,
          "Date": "2023-02-24T08:18:44.000Z",
          "Titre": "my tech person Ann is great to have…",
          "Contenu": "my tech person Ann is great to have helping me.  She fixed everything and reset the system for my phone and I'm back online."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Regine McCreery",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T04:05:36.000Z",
          "Titre": "Perfect phone plan for a snowbird like…",
          "Contenu": "Perfect phone plan for a snowbird like myself who speeds half my time in Canada and the other half in USA."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "William Hanson",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T09:20:56.000Z",
          "Titre": "Fonus App has a UI from at least 4…",
          "Contenu": "Fonus App has a UI from at least 4 years ago. But it's functioning regardless. Calls and texts go through and data works."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dex Bee",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T00:00:35.000Z",
          "Titre": "With the help of the Fonus customer…",
          "Contenu": "With the help of the Fonus customer support i was able to configure my APN. Great job for walking me through. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benn Stocks",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T07:52:12.000Z",
          "Titre": "Ordered a SIM",
          "Contenu": "Ordered a SIM. Arrived within 3 days. Needed some assistance to set it up. Took about 20 mins but when it was all said and done service was working great!"
        }
      ]
    }
  ]
}