{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "forever.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lois Lane",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:10:08.000Z",
          "Titre": "I have NO Idea what this Program is",
          "Contenu": "I have NO Idea what this Program is.  I have NO intention on PAYING for another SERVICE as I don't have time to Use the ones I have already PAID for.  This does not seem like anything I need."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcie",
          "Nb_Reviews": 5,
          "Date": "2023-12-21T00:31:49.000Z",
          "Titre": "No resolution",
          "Contenu": "I got a response and said he would look into the answer but have not heard back again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike  Jr",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T22:07:29.000Z",
          "Titre": "Never got my pictures you use a bad…",
          "Contenu": "Never got my pictures you use a bad delivery system"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Fullerton",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:41:52.000Z",
          "Titre": "I had film that was water damaged and…",
          "Contenu": "I had film that was water damaged and explained such on the order.  I asked it to be checked before filling the order.  It was not checked.  When I asked if it had been checked they determined that some of the film was not able to be preserved.   When I got the other films on the thumb drive it is obvious to me that these should not have been preserved as well.  I wish they would have just said they were not able to make good copies and charged me a service charge for their trouble."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T19:01:53.000Z",
          "Titre": "I bought Artisan 6 and I think it was…",
          "Contenu": "I bought Artisan 6 and I think it was the biggest mistake I’ve made so far in my life. Not only is it so basic for the price you pay but also it is so unprofessional. And they only have a 5 day return window which is barely enough of time to figure out if you like it. Needless to say I’m very disappointed and annoyed. I think it is a waste of money and I want my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shirley",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T03:15:39.000Z",
          "Titre": "I wanted to have three albums sent to …",
          "Contenu": "I wanted to have three albums sent to a different address but no way to do it. There was talk of bonuses for spending money on your website, but I spent over $1000.00 and nothing was offered. And I still have not received my albums. They were finally to arrive on 12/12 and did not arrive. Now they are saying tomorrow 12/14. They are Christmas presents I have to forward. I spent nearly 2 years on this album."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T22:03:29.000Z",
          "Titre": "I have not received the package yet",
          "Contenu": "I have not received the package yet.  Per tracking info, it was in my town but has be rerouted to several other towns a ways away. I hope I get it so I can wrap and ship it in time for Christmas! I paid extra for shipping so it would get here with plenty of time to spare.  Disappointed in the delivery promise."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T02:28:48.000Z",
          "Titre": "I had considered acquiring your Large…",
          "Contenu": "I had considered acquiring your Large Specialty box for photo scanning; however, I ultimately decided against it after perusing the reviews. Additionally, I received an email from Trustpilot, which raised privacy concerns as I had never placed an order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T20:21:10.000Z",
          "Titre": "Communication was excellent… ambassador…",
          "Contenu": "Communication was excellent… ambassador was excellent. However, communication was all boilerplate so I was not aware, nor was my ambassador, that my vhs could not be digitized, until we received it back with no thumb drive. After asking, we found out!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Suzanne",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T15:15:51.000Z",
          "Titre": "I bought $800+ storage",
          "Contenu": "I bought $800+ storage, downloaded pictures for two weeks. I got down to the last 4,ooo and the app just shuts off and won’t work! I open it and it just closes immediately and stops. I’ve rebooted my phone made sure I have all the settings correct on my phone. Very frustrated and disappointed!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Weber",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T04:09:18.000Z",
          "Titre": "Very disappointed",
          "Contenu": "First off when I submitted the help ticket they responded with an explanation of the error. If they had taken the time to read my request they would have known I knew what the error meant and the it did not apply which was the reason I submitted the ticket. Secondly, every time I asked for a scheduled time to work on the issue I would not receive a response until right before or after the time requested. That just prolonged the issue so I kept trying different things and finally figured it out without any help from Forever support."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T16:29:07.000Z",
          "Titre": "My videos have been lost",
          "Contenu": "My videos have been lost. While the company is working to track them, I had to contact my Rep regarding the loss. It's been a week and the company has yet to reach out to me personally, just a phone call from the rep saying the company is working on it.Update 6/6/2023 Still Lost, no refund, same run around, they are looking, can't find it. FedEx can't find the box either."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 3,
          "Date": "2023-03-14T14:00:19.000Z",
          "Titre": "If this is about my seminar order for…",
          "Contenu": "If this is about my seminar order for March 11, 2023, I did not receive an invite to connect to zoom. This is the second time I have lost out. I feel I am not getting important information I need!!  And I don’t like to bother the office for help each time….even though they are most helpful!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Just meh.",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T06:32:28.000Z",
          "Titre": "Entire process was confusing at best.",
          "Contenu": "I had old film reels digitized. I feel like the process was hard for someone to do on their own. I thought I had used the ruler and information given to guesstimate the cost. And was floored with how expensive it was. The whole process was confusing. I had storage and then it seemed in order to view them I had to buy video storage. If I had it to do all over again I would go a different route. I will say the quality of the digital files were very nice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T20:03:43.000Z",
          "Titre": "The forever app is not working and…",
          "Contenu": "The forever app is not working and won’t download pictures from my camera roll. I’ve tried deleting and reading the app, but no luck. Please advise."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T20:16:19.000Z",
          "Titre": "I find it getting very expensive to…",
          "Contenu": "I find it getting very expensive to print the books even with the 50% off specialI love the quality but may have to use a different print shop"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heather McMichael",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T21:50:08.000Z",
          "Titre": "I have never received my order",
          "Contenu": "I have never received my order.  Emailed support this morning early and have not been contacted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:18:44.000Z",
          "Titre": "10 Picture was chopped off",
          "Contenu": "10 Picture was chopped offOthers was zoomed in on"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eileen Rafferty",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T20:44:27.000Z",
          "Titre": "I ordered a blanket and am extremely…",
          "Contenu": "I ordered a blanket and am extremely disappointed.  It is thin and flimsy.  Not at all worth the full price and I ordered it at half price.   Very very disappointed and I am embarrassed to give it as a present.  Off to the trash."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debra  Hill",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T02:56:34.000Z",
          "Titre": "Still waiting for product!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T00:41:41.000Z",
          "Titre": "My issue was not resolvable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan Solander",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T20:02:41.000Z",
          "Titre": "Next time read my entire email before responding",
          "Contenu": "The first response I got was a standard response and not what I had asked for. The second response asked me for so much information it was overwhelming and too much for me. I didn't get any real help at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T16:41:35.000Z",
          "Titre": "I didn't get a link to the webinar I…",
          "Contenu": "I didn't get a link to the webinar I registered for - and during the webinar, the website chat feature wouldn't work so I could request one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 3,
          "Date": "2023-01-06T16:06:42.000Z",
          "Titre": "I can't install it because I am in S…",
          "Contenu": "I can't install it because I am in S mode.  I really don't want to take S mode off.  Trying to get some help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "B. Stewart",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T23:12:57.000Z",
          "Titre": "ordered 9 large calendars when they…",
          "Contenu": "ordered 9 large calendars when they arrived they were skewed and off center. Currently waiting on reprints."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Breaux",
          "Nb_Reviews": 4,
          "Date": "2023-01-05T00:42:41.000Z",
          "Titre": "No timely response",
          "Contenu": "On November I sent an email saying \"I recently purchased a new laptop with Windows 11.My current app for Historian 4 and Artisan 6 are still on my old laptop which is running windows 10. I downloaded Historian software and used saved License Key  from my forever account.I can not activate the new copy on my new laptop. I am afraid to uninstall my Historian and Artisan apps from the old laptop until am sure they will be functional on the new laptop.\"The response from the customer rep: \tMelissa Schuh (FOREVER)Nov 22, 2022, 2:48 PM EST\"Since Historian is only licensed for one computer, this is why you are getting an error message when you activate on the new computer. The Artisan, you would be able to activate as it is licensed for two computers. Once I deactivate Historian from the old computer, you will be able to activate on the new one. Does that make sense? \"That did not work, when I try to activate with the keycode I was using with Historian4 I receive a message saying I have reached the max number of downloads.I just would like someone to activate the copy that was downloaded to my new laptop since the copy on my old laptop was deactivated."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Marjorie Hnydiuk",
          "Nb_Reviews": 3,
          "Date": "2023-10-20T23:29:06.000Z",
          "Titre": "What was sold and what I got was two…",
          "Contenu": "What was sold and what I got was two different things"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Marie",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T03:28:13.000Z",
          "Titre": "I took advantage of the blanket promo…",
          "Contenu": "I took advantage of the blanket promo and in ordering the 3 blankets I made it said I could save on shipping so I flipped to that screen I thought before my order went through. I was frustrated when I went back to finalize my order I couldn’t find it so I started over and remade my blankets. The order went smoothly this time. When I checked my order I was shocked to see both orders had gone through. Instead of three blankets I had six.  I immediately called to cancel the order. Beth Ann said her boss had left early for Halloween and had to be the one to check with production. I was told up front it didn’t look promising. The boss checked the next day and it was too late. I had an extra $239.00 dollar order I could not cancel within 10 minutes (hold time) of submitting the order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debra",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T22:12:10.000Z",
          "Titre": "I got a three reviews on one request I…",
          "Contenu": "I got a three reviews on one request I submitted today and haven't rec'd a reply from Forever yet.  Hard to review on a submitted problem waiting for an answer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T00:49:01.000Z",
          "Titre": "I was never able to log in the the…",
          "Contenu": "I was never able to log in the the virtual scrap."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T03:51:58.000Z",
          "Titre": "The mug was printed with the example…",
          "Contenu": "The mug was printed with the example line”The Smiths”"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T05:50:59.000Z",
          "Titre": "Too confusing to download"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T20:45:24.000Z",
          "Titre": "My upgrade is still not activated after…",
          "Contenu": "My upgrade is still not activated after trying several times and contacting support several times."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Caryn Mathes",
          "Nb_Reviews": 6,
          "Date": "2023-02-14T12:22:31.000Z",
          "Titre": "My archiving materials haven't yet…",
          "Contenu": "My archiving materials haven't yet arrived."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennie Geisler",
          "Nb_Reviews": 10,
          "Date": "2022-11-03T22:19:39.000Z",
          "Titre": "I was cancelled with no reason"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer Jeanne",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:35:59.000Z",
          "Titre": "Wanted rounded corners",
          "Contenu": "Wanted rounded corners, but got square and one of the pictures was cut off a bit. We ordered these with three other people (customers) and all four orders were wrong/incorrect in some way or another.  Very disappointed for the cost of the product.  Expecting a much higher quality than received."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barbara Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T05:31:05.000Z",
          "Titre": "FRUSTRATED!!!!!",
          "Contenu": "I've had problems with A6 for over 2 years. The company says they know about them and they are documented on my account so it can be looked up. With each update I've always hoped the problems would be fixed but they never have fixed them. Not even one problem has been fixed!   I'm very disappointed by Forever's lack of care with these problems."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T05:27:41.000Z",
          "Titre": "Communication could be better",
          "Contenu": "When I ordered the email said I would receive my photo within a week. I don’t mind it being longer, but I do think if the company is backed up, I should not have had to call to find out I wouldn’t be receiving my photo within that timeframe.  The staff member who called me back was lovely and explained the situation."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Argee",
          "Nb_Reviews": 3,
          "Date": "2023-01-20T00:50:06.000Z",
          "Titre": "Reneged on their promises to Australia",
          "Contenu": "I signed up at the launch in Sydney years ago where we were promised availability of printing and conversion of old media would be carried out in Australia. Never eventuated. Artisan 5 was touted as the Best, to be pulled as more than often it did not work, to be replaced by A6 which had to be purchased. Not the most reputable way to do business IMO."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kathy Behringer",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T22:39:13.000Z",
          "Titre": "Ashley Roesch",
          "Contenu": "The consultant who was helping me was impatient and the pictures I put on the calendars were covered with white \"speckles\" like snowflakes.  I have been using Forever to make calendars for my family for several years and have always had good quality results until this time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T20:26:56.000Z",
          "Titre": "Puzzles too expensive and pieces very…",
          "Contenu": "Puzzles too expensive and pieces very small and thin.Will not order thru this co. Again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Connie",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T01:44:21.000Z",
          "Titre": "Order Creation Issues",
          "Contenu": "During the process of finalizing my order I had switched the picture between two, to see which one would be better. Not realizing it, the website reset the specifics I wanted. I finished my order for my puzzle. When I got the email letting me know it was on the way was when I realized I was not getting the 530 piece puzzle I thought I ordered. I got the smallest puzzle. It is entirely my fault. But considering I gave up on trying to create a calendar for similar issues, I should have known better. I don't plan on ordering anything else. Not even sure I'm going to return my Forever box."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T15:50:09.000Z",
          "Titre": "The tracking was terrible",
          "Contenu": "The tracking was terrible, didn’t arrive when said. The pictures were blown up so big they didn’t even have the whole slide in the picture."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T05:40:11.000Z",
          "Titre": "A calendar I ordered was out of order",
          "Contenu": "A calendar I ordered was out of order.  She said she would talk to her supervisor and send an email/message telling what he said.  I still have not heard back.  Didn’t appreciate her saying to just turn the calendar to the right month and flip it back for the next month.  For the price of Forever printing, I don’t think I should have to accept substandard workmanship."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer Marsha",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T03:09:14.000Z",
          "Titre": "My membership was discontinued",
          "Contenu": "My membership was discontinued. I called to resolve with no return call as requested. Also, the credit card I had on file was the same I reopened with. I comment Stacy for trying to helping but she was unable to. The date below might not be correct."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T16:36:39.000Z",
          "Titre": "Absolute sticker shock",
          "Contenu": "Absolute sticker shock! I was told by my advisor to fill the box. I had no idea the overage would be $2,000!! She said there should have been a tally sheet with pricing in the box, but later found out that's not included in the box anymore. If I'd known ahead of time, I wouldn't have spent hours and hours and hours going through photos, sorting into packs of 25 and shipping them. I ended up taking all the photos out of the scan order and now I'll scan them myself, one by one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen Frank Neal",
          "Nb_Reviews": 4,
          "Date": "2023-06-23T14:27:42.000Z",
          "Titre": "Still Waiting!!!!",
          "Contenu": "Well first of all I ordered these prints over two weeks ago said it was sent out on the 15th and I still do not have it yet, I love forever, however the shipping is terrible. Why am I paying so much to ship something that takes so long to get here! Ridiculous!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Linda Hauge",
          "Nb_Reviews": 4,
          "Date": "2022-11-30T03:37:46.000Z",
          "Titre": "Really messed up my order",
          "Contenu": "I sent 3 orders on the same day and all orders were messed up and sent to the wrong people. One calendar was not sent at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "andy",
          "Nb_Reviews": 4,
          "Date": "2023-07-18T23:37:15.000Z",
          "Titre": "the gutters in the book ended up really…",
          "Contenu": "the gutters in the book ended up really weird, in a way that it didn't show online and your costs are just outrageous.  I hate using you, but it's the program i have, so im screwed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T03:56:10.000Z",
          "Titre": "Quality is very poor",
          "Contenu": "Quality is very poor!  Hair color wrong.  Clothing and skin washed out on many photos.  Originals were good color and quality.  Scans are not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LJS",
          "Nb_Reviews": 2,
          "Date": "2022-12-20T02:44:16.000Z",
          "Titre": "Special surcharge not clear",
          "Contenu": "The instructions/documentation do not state that there is a $6 per roll surcharge when handling Advantix negatives.  Had I known this I would not have purchased the Forever box."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Abby",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T22:52:19.000Z",
          "Titre": "Highly disappointed with the cost of…",
          "Contenu": "Highly disappointed with the cost of shipping. It is not worth it anymore. Yes the pictures come out great on the card but I can get them printed elsewhere for much less"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phyllis Groover",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T15:51:43.000Z",
          "Titre": "Printing Issues, Software issues",
          "Contenu": "A \"blank\" page at the end of the book printed with Page Keeper.  Had issues with this at beginning of book and support told my consultant - don't worry it won't print anything, it will be blank.  Consulatant had already deleted the text off that page, but we did not worry about the one at the back of the book. This is my third book to do through Forever.  Everyone of them has \"crashed\" while working on it.  Have had to start a new book and import the pages I had already done.  Of course pages come in scrambled and you have to spend at hour or more to  sort them out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T21:49:37.000Z",
          "Titre": "Transferring my tags from Historian 4…",
          "Contenu": "Transferring my tags from Historian 4 did not work. It is very time consuming to recreate them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T01:27:41.000Z",
          "Titre": "Way too difficult to upload picture…",
          "Contenu": "Way too difficult to upload picture from mobile app"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Val Anderson",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T18:18:18.000Z",
          "Titre": "I can not edit my calendar cells…",
          "Contenu": "I can not edit my calendar cells because the OK button doesn't show up when I am done editing.   The technician had to go to tier 2 tech support and I was sent an email saying that my computer's resolution is 1366 x 768 and that I need to buy a screen with a resolution 2048 x 1152.  When I checked with a computer technician that we deal with in the city, he said that is really big and figured that you made a mistake in the size of resolution.  He said that 1080 or a 2 K should be plenty big enough.  He told me to check again and make sure.  He said that the OK button not being there is your problem and not mine and that is what I told the woman that I was talking to last week.  You are going to lose a lot of customers and advisors over this problem if you don't rectify it.  Could someone recheck about the resolution and get back to me about that.  Thank-you for your time and patience.Val Anderson"
        },
        {
          "Note": 2,
          "Lieu": "GE",
          "Pseudo": "Bonnie",
          "Nb_Reviews": 3,
          "Date": "2022-11-04T05:59:35.000Z",
          "Titre": "I referred a friend and got $20",
          "Contenu": "I referred a friend and got $20, which buys nothing that I want.  I wanted additional storage space.  I will not recommend in the future."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T22:23:18.000Z",
          "Titre": "Very costly and shipping is costly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T19:39:57.000Z",
          "Titre": "Not for the inexperienced person",
          "Contenu": "For the inexperienced person, the website is not particularly user friendly.  Instead of finding information about how to do things on their site, they bombard you with ways to spend more money.  My local guide through this maze generally did respond very quickly to my emails and most of the time answered my questions.  I also didn't comprehend how much this was all going to cost.  If I hadn't already gotten into the process, I might not have continued, but their plan to digitize my parents' photos and make then available to others in the family was what I wanted to achieve. I will be more conservative if I chose to use any other of their services."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T15:03:59.000Z",
          "Titre": "No warning for blurry picture",
          "Contenu": "The large picture on the very first page of the calendar is out of focus/blurry and there wasn’t a warning before ordering. It’s rather disappointing and the first thing you see when looking at the calendar."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "fred vermeern",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T21:50:14.000Z",
          "Titre": "i had old 16 mm film digitized to a…quicktime file",
          "Contenu": "i had old 16 mm film digitized to a quicktime file to edit with,   once I  understood the pricing per foot of film and commited  to doing it. I ordered my box.                  it arrived within days. I read the instructions repackaged the box with my film.  had to go to fedex to send box back they reviewed my order and finalized  the total payment including additional feet of film digitizing and a flash drive. I paid  the final bill  my original film and flash drive arrived in a couple weeksvideo played well and I edited with it. I posted some clips on youtube.  mission accomplished.  the  staffwas great very knowledgible on the services they offer"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kelley G",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T20:27:07.000Z",
          "Titre": "Medium rare experience",
          "Contenu": "My consultant, Ginny Petrilla, is the best part of forever! She does a fantastic job of promoting and encouraging her clients to use the products and services! However this is my 3rd order of photo cards and once again I have black marks on the edges of my cards from the printing process … I hesitated ordering and once again I’m disappointed. I don’t need any more. I don’t want a discount for another order. A refund would be nice however I believe your staff deserves a paycheck. So I probably won’t use this service again. I am satisfied with the other services I’ve used in the past."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T16:29:12.000Z",
          "Titre": "I like the Christmas cards I sent out, but...",
          "Contenu": "I like the Christmas cards I sent out, but annoyed that there is limited words I could use in the text box to summarize our 2023 year. I had to really shorten everything up to get the amount of words to fit in the text box, and didn't include anything what I and my spouse did this past year... just the kids."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "NZ customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T03:38:45.000Z",
          "Titre": "10x10 photobook with layflat",
          "Contenu": "Speed of production and delivery was a 10/10. Really impressed with the service. Highly recommend the 10x10 size. Easy to handle and look through the book. This is definitely my new favourite size. Sadly however, I’m disappointed in the print quality of the photo’s (they were all high resolution). They seemed to lack a crispness/sharpness to them, with some definition lost. Also disappointed in the binding. I paid extra for the layflat upgrade. The layflat is black  (wish I’d known this) which means there is a black line that runs through all of my white pages. It is also inconsistent in that the top of the book looks like the pages are pulling away/out of the spine. I’m glad I didn’t pay full price but I’m pleased that I have a photobook to send in time for Christmas"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pam Moeller",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:14:11.000Z",
          "Titre": "The photos on the frosted glasses were…",
          "Contenu": "The photos on the frosted glasses were not as bright and clear as I hoped. They arrived quickly which was good.Service from my ambassador Lisa is always excellent."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Sharon B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:46:40.000Z",
          "Titre": "I have  been finding that  the software…",
          "Contenu": "I have  been finding that  the software becoming more and more glitchy with every passing upgrade...so many times that the computer tells me that Artisan 6 is not repsonding.. and I have to reboot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jill",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T06:06:32.000Z",
          "Titre": "The cover image is too small",
          "Contenu": "I was super excited to design my own picture puzzle for my granddaughter.  1014 pieces came in a small square box and the original picture was on a \"sticker\" and did not even cover the small lid.  There was no additional photo inside which will make it very difficult to put together a very busy 20 x 30\" puzzle using a 3 x 4.5\" image as a guide.  For the price of this gift, I am very disappointed that you didn't either put it in a larger box with a nice full image on the cover &/or provide a larger folded photo inside to work from.  I was otherwise happy with the quality, but I'm going to have to figure out a way to print a larger picture to fix this issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wendy H",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T22:34:20.000Z",
          "Titre": "Fantastic help, not enough envelopes",
          "Contenu": "My ambassador was exceptional and helped me tremendously.  My cards arrived in good condition, but I only received 54 envelopes to go with my 80 cards that I ordered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sherry Hanaway",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T23:52:05.000Z",
          "Titre": "In the end everything worked out and…",
          "Contenu": "In the end everything worked out and maybe the problem was on my side but it was a lot of back and forth and phone calls being over charged but also being credited back… I hope it’s all correct. Really didn’t appreciate one of the team members bad mouthing my consultant. She is loyal and only ever speaks highly of your company. I would have taken my $1200 projects elsewhere if not for her."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T20:03:38.000Z",
          "Titre": "The resolution was fine",
          "Contenu": "The resolution was fine; the customer service person wasn't friendly.  I told her I loved the blanket and she said nothing! I tried to make friendly conversation and she just made me feel uncomfortable.  I'm bummed that the mug had to be reordered"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nancy Wells",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T21:43:34.000Z",
          "Titre": "Great People, but questioning...",
          "Contenu": "The people I met from Forever are great and very helpful. My only complaint so far is the following:There should be a way to get just a few more GB at a time. I have 12GB. I purchased 10 and got 2 more as the initial promo for joining. This barely covers my present pictures. So I need to purchase another 10GB for any more? I feel a less amount should be an option."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary  Corta",
          "Nb_Reviews": 5,
          "Date": "2023-10-29T12:37:09.000Z",
          "Titre": "Could Be Better",
          "Contenu": "My ornament looked washed out and the border (frame) was not visible at all. I also received a satin gift bag with “Shutterfly” printed on it. That was confusing and off putting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "New Customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T16:12:32.000Z",
          "Titre": "Order Split, Quality So-so",
          "Contenu": "My order of three puzzles was split into two deliveries, the first of which arrived very timely. The second was delayed for another 4 days. There was no notification of the split packaging which caused a call to customer service to find out why. Additionally, the puzzle pieces themselves seem to be fairly thin. Not quite the quality I was expecting for the price point."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cindi",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T13:52:56.000Z",
          "Titre": "I needed to use the software to edit a…",
          "Contenu": "I needed to use the software to edit a picture to print locally. I didn’t like that I was only allowed to print if it was for uploading to one of your products. I just needed this picture as a 4x6 and needed it that day. Disappointed that that feature I used in the past was gone. I already made a purchase on the software the least you could do is allow me to print where I want. It really doesn’t excite me to order more products in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marisa C",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T00:23:14.000Z",
          "Titre": "Poor printing of my cards",
          "Contenu": "I have not called yet because I received my cards as I was leaving for a weekend away.  I was very disappointed when I opened the box and saw that many of the cards so that there is a white strip on one side and the picture is partially missing on the other side.  I have not gone through all of them yet but 10 so far are not right."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Peggy",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T22:37:24.000Z",
          "Titre": "I have used Creative Memories for years…",
          "Contenu": "I have used Creative Memories for years and now Artisan 5 which I love but now I am unable to print my story books without boarders which I totally dislike unless I upgrade to Artisian 6.  I can not afford to upgrade and would like to have my books printed to the edges, any way I can do that without upgrading?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Irwin family",
          "Nb_Reviews": 3,
          "Date": "2022-12-27T04:17:19.000Z",
          "Titre": "Finally updated my program to Artisan6…",
          "Contenu": "I finally updated my program to Artisan 6 & with the newest/first album I did on that program, I utilized the new feature of \"print guides\". Unfortunately, they weren't very accurate and some text/photos were slightly chopped off. Or they didn't center the page when printed, since I noticed if the bottom of the page was chopped off the top was down further then what the program showed.HOWEVER, I still love Forever and will continue to use their photo book creating program. I will just go back to my old method of guessing where the page margins are."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T20:37:13.000Z",
          "Titre": "I received a timely response to my…",
          "Contenu": "I received a timely response to my request, with a request for more information.  I replied and received another quick response.  My issues is being forwarded to the mobile support team.  So as yet the problem is not resolved, but the customer service response was good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T01:07:42.000Z",
          "Titre": "Artisan 5 to 6",
          "Contenu": "I purchased the upgrade to change from Artisan 5 to 6. It was expensive and yet I find no difference in the two. I had to change several settings on my computer to get the program to work and spent hours trying to complete the transfer process and get the program to function properly. I had to contact FOREVER several times."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T00:06:49.000Z",
          "Titre": "Heads were cut off in some of my…",
          "Contenu": "Heads were cut off in some of my photos? Not sure why! But it was disappointing.Someone reached out fairly quickly to see if a correction can be made."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan E",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T18:54:06.000Z",
          "Titre": "The process seems confusing to me",
          "Contenu": "The process seems confusing to me - especially how much it is going to cost.  I paid for a box to return my pictures in.  I understood that purchase included 2 GB of storage.  Time passed while the pictures were being digitized.  I had to then select whether to download the pictures myself or onto their cloud.  That makes sense now but it did not at the time.  When I tried to save to the cloud, it forced me to purchase additional storage.  Something seemed wrong there.  There is no way I used 2 GB of storage with my original scans.Some of the pictures were old black&whites.  I thought the quality would be the same or improved.  Instead, when I look at the scanned files from my computer screen, they are blurry.  Worse that the original picture."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T23:22:45.000Z",
          "Titre": "The calendar is great but the freight…",
          "Contenu": "The calendar is great but the freight charge is way too excessive :-("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeanette",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T01:04:15.000Z",
          "Titre": "The cost of postage has gone up WAY TOO…",
          "Contenu": "The cost of postage has gone up WAY TOO MUCH!  I cannot pay $300 a year for postage I may or may not use.  Other than that, I love Forever!  I will continue to use it to store my photos, but will find alternatives for printing and gift buying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Monica",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T18:40:00.000Z",
          "Titre": "I’m really excited to use this program",
          "Contenu": "I’m really excited to use this program. I wish there was more help video’s that actually helped. I have spent hours trying to figure out how to move my photo over. I don’t want to do all of them. I want to pick. And I don’t know if your videos are old but I can’t find the green + button ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Heather Gardiner",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T15:49:42.000Z",
          "Titre": "Nicaraqua",
          "Contenu": "The Ambassador, JoAnne Boyd, was extremely helpful in setting up my pages and writing my comments.  The pictures were very clear.  The book arrived quickly after it was ordered.  Overall, the book is beautiful!  I am a little disappointed that there is a large scratch on the front cover."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T04:17:30.000Z",
          "Titre": "I would like to see a warning that…",
          "Contenu": "I would like to see a warning that indicates that not all fields have been edited. I neglected to edit the “Family” field and, therefore, I had the wrong family name on the front of my cards. I then had to place another order."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Canadian",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T18:28:09.000Z",
          "Titre": "Canadians want to pay in CAD $$",
          "Contenu": "I really enjoy forever’s photo storage.  I truly wish they offered an option to pay in CAD for your Canadian customers.  If purchasing in CAD was an option, I would be sure to purchase more of your lovely print projects."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T13:45:35.000Z",
          "Titre": "I was comparing your prints to cheaper…",
          "Contenu": "I was comparing your prints to cheaper prints - cheaper prints and shipping from other placesUploading from computer is easy. Print price was 1/3 more and I didn't see a difference in quality.Shipping was spendy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T23:15:20.000Z",
          "Titre": "I have 4.0 version and installed the…",
          "Contenu": "I have 4.0 version and installed the 6.0 version on another computer.  I was given the impression that I could use either program to add photos and access them as long as it was on the same account. I cannot view the photos from the 4.0 version on the 6.0 version and I asked for assistance.  I was given instructions that are not user friendly.  I feel like I was not really assisted."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T04:19:06.000Z",
          "Titre": "I like the photo but was disappointed…",
          "Contenu": "I like the photo but was disappointed that a correction of the blurring wasn’t better. When you look at the metal print up close it’s profound but, from a distance it looks just fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T15:24:02.000Z",
          "Titre": "I know it can't happen",
          "Contenu": "I know it can't happen, but wish I could get reprints the next day rather than 9 days.  I do not want to pay extra to get them next day, but that's my only complaint about Forever reprints."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Caring Friend KLS",
          "Nb_Reviews": 3,
          "Date": "2022-11-26T03:44:05.000Z",
          "Titre": "Mug was not what I thought....",
          "Contenu": "I liked that the mug was $10 but was unhappy that the shipping & handling cost was the same as the mug.  I liked how quickly the mug was created, shipped, and delivered.  But, I was disappointed, when my friend received the mug, that the picture was not centered in the front of the mug.  It was in the middle of the mug.  And, I put a title for the mug, thinking that the title would be on the mug.  But, it was not.  So, I paid $20 for a mug that was 2/3 blank.  That picture/title was important as it was from an event that my friend attended with her daughter, who passed away two weeks before I ordered the mug.  There was plenty of room on the mug for the title to be on the back and the picture centered on the front by the handle."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tricia",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T23:52:53.000Z",
          "Titre": "It was hard to find the bottom line…",
          "Contenu": "It was hard to find the bottom line price for the storage, how much for pictures, how much for videos, how much to convert videos, etc, is it a one time fee, monthly, annual, etc."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carol L",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T15:49:05.000Z",
          "Titre": "Lack of attention …",
          "Contenu": "The letters on my title page were all askew and there was no attempt to right them. (The word was Center—as in World Trade Center.). Instead, the page was copied as is, delaying the production of my album.  I am very disappointed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T18:15:59.000Z",
          "Titre": "Pictures came out great but your…",
          "Contenu": "Pictures came out great but your shipping charge is ridiculous.  You can put in a flat rate box or flat rate padded envelope for less then 10.00"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet Thrush",
          "Nb_Reviews": 2,
          "Date": "2022-11-22T01:00:35.000Z",
          "Titre": "Preview card - order in smaller increments",
          "Contenu": "You need to have an option to order a “preview” card - most other companies do that. Yes, you can preview it on Forever, but when I get a card I can hold in my hand, I always find changes I want to make. It would be nice to see that, make the edits, and then put in the desired # of cards I’d like to order.Also, give us the opportunity to order in increments of 5 rather than 10 (or actually ANY desired #.)Shorten the production and shipment times…..especially when placing an order mid-Nov, so we don’t have to pay double and triple to get the order in a reasonable time."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Margaret Maw",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T02:46:54.000Z",
          "Titre": "Help given",
          "Contenu": "I found Forever helpful when I had a problem - I hadn't included a code and some materials didn't initially come. All good now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carol D",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T04:37:18.000Z",
          "Titre": "I wish that the process for putting the…",
          "Contenu": "I wish that the process for putting the books together was more flexible and more intuitive. Also, I REALLY wish I could edit photos better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carla",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T20:52:19.000Z",
          "Titre": "Printing",
          "Contenu": "The printing was messed up a bit. My pages were all cut off at the bottom,  some with words that were cut off and there was one page that had a small blot of ink"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T00:58:01.000Z",
          "Titre": "Disappointed that the photos appear…",
          "Contenu": "Disappointed that the photos appear very dark, even tho I tried to brighten them w the limited autu correct available in design and print."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Maggie",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T03:43:15.000Z",
          "Titre": "The quality of the flat card was…",
          "Contenu": "The quality of the flat card was excellent! The envelope glue left a lot to be desired. It would not stick. I had to go buy scotch tape to close the envelopes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joy M",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T17:44:49.000Z",
          "Titre": "I labeled every roll of film being…",
          "Contenu": "I labeled every roll of film being under the impression that would have been applied during the conversion and it wasn't.  Also the roll numbers do not follow all of the rolls or there is no consistency to the order to pull up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T17:34:46.000Z",
          "Titre": "Photo prints…",
          "Contenu": "The ordering process and delivery were good. The quality of some of the photos were below average. The color was not accurate on several of the 5x7 photos and especially the 11x14."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lorrie",
          "Nb_Reviews": 7,
          "Date": "2022-12-13T00:26:55.000Z",
          "Titre": "Since starting digital scrapbooking I’m…",
          "Contenu": "Since starting digital scrapbooking I’m on my third laptop this time I bought a personal cloud and the facial recognition software won’t find my pictures."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T18:13:16.000Z",
          "Titre": "Sent 40 items",
          "Contenu": "Sent 40 items, and 3 came back with the picture, but the audio was all distorted."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Valerie Taft",
          "Nb_Reviews": 2,
          "Date": "2023-05-03T22:52:28.000Z",
          "Titre": "Flawed Blanket",
          "Contenu": "I already contacted the help department as I ordered 2 Grad blankets for my Grandsons.  One came and it was perfect.  The other one has a flaw in it.  It is a black line right up the blanket.  You can tell it is a flaw in the blanket, just by feeling it.  Sent an email this morning and I am waiting to hear back from them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T20:26:26.000Z",
          "Titre": "I thought I would be getting a dvd disc…",
          "Contenu": "I thought I would be getting a dvd disc of the video I sent in to be digitized. I misunderstood the process. I would now like to burn a disc but have to figure out if and how I can do that. I also thought it took longer than I expected to digitize. But everything was returned safely"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "mm",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T17:09:53.000Z",
          "Titre": "Blanket",
          "Contenu": "Some pics on blanket appear faded and smeared. Hem on top edge not finished. Have purchased many blankets and all have been just beautiful!! Choice of pics probably part of it."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Barb",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T23:06:42.000Z",
          "Titre": "The book I ordered came in record time",
          "Contenu": "The book I ordered came in record time. However, I have had 6 or 7 hard covered book printed. This is the first one that I think the spine might break. I am almost afraid to open the book all the way. I have reported it to support just in case it does break."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T15:18:01.000Z",
          "Titre": "Bad adhesive",
          "Contenu": "The adhesive on the envelopes was useless.  Never got a separate text when cards shipped.  Quality of cards was OK though.  Overall satisfied"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customerVivki",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T18:30:24.000Z",
          "Titre": "bad packaging",
          "Contenu": "The package holding the product was too flimsy and had gotten torn so two of the magnets were damaged."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T05:07:38.000Z",
          "Titre": "Honestly, Good but slow and a little harder to use than it should be.",
          "Contenu": "Honestly, I would both be happy to recommend this service and it was just much slower than I anticipated.I didn't realize that when I sent my item in for digitization that it would take a month from when they received it to when it would be completed.Maybe that is totally fine ... after all, I didn't even know that recording existed for about 3 decades so how much of a rush could I really be in to digitize it?But I also live in an Amazon world where I can get most things delivered same day.Now my understanding was the long que was an consequence of their move to a new purpose built digitization facility intended to deal with that backlog.  So if you are reading this soon and are impatient then ask customer service what the wait time is.If you have more patience than I or you are reeding this a few months down the line this problem may not apply to you at all.But when I think of my experience it gets 3 stars.Here are the things that kept if from a higher score:1. Long wait to have my item digitized that was not clear before I shipped it in.2. Signing up for an account so I could formalize my order and pay for it ... the directions I was given didn't actually get me there so it took a few days of back and forth.3. Product was sufficiently unclear that I was not sure what I should order and bought a USB drive from them that I didn't need to and that significantly and needlessly boosted the cost.4. I was surprised to learn that given they have a product that is lifetime hosting of stuff that you upload to their servers that they only host stuff they digitize for you for a short time (so download it quickly).  The disk space on a Forever basis for a small digitization project like mine would have only cost a few cents, so I was surprised that it didn't just come with the account roped into the cost I'd already paid.  Ultimately not really a problem I just downloaded it from Forever on to my computer then uploaded it to my Google Drive and shared the link to the files with my Google Drive with my family.  My internet is fast enough that that was a pretty minor annoyance, but I don't know why it needed to be.  I could have just shared a link with file location and password data for view only privileges with Forever to my family.  I'd think that would have made more business sense for them because they'd get to advertise their logo and brand to all my family ... but now I don't even have a good reason to mention them.I know it seems odd to both recommend a company and give them only 3 stars, but that is what I got when I asked my gut what to give."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sue",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T21:24:55.000Z",
          "Titre": "Love A6 but corruptions",
          "Contenu": "I really like A6 and your products but there has been too many corruption issues.  It has been going better now but it has stopped me from becoming an Ambassador and selling it to my Creative Memories customers.  Frustrating to have to constantly save, close software if not working on it even for a few minutes, make sure computer isn't running anything in the background, make backups and worry about errors.  Pricing is high.  I wait for coupons and deals which are great but not always convenient.  Customer service is top notch.  Very professional, kind and helpful!  H6 has been working really well and I love it."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T23:50:10.000Z",
          "Titre": "The metal panels are beautiful.",
          "Contenu": "The metal panels are beautiful.Ordering however was very frustrating. 3 times my order was reset while ordering. Projects, Coupons or  gift certificates would disappear from my cart. Putting multiple projects in the cart is frustrating.  I would like to be able to select multiple projects and add all to cart instead of having to click add to cart, then be taken to the product page, again add to cart and then taken to the open cart. After each project added I had to go back to my profile, my projects and find which project I wanted to add. Also, when purchasing prints, each photo cannot have a different number of copies unless you add each photo to the cart separately. Wonderful if you want to print an entire album. Frustrating when you need different amounts of several photos."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ruth",
          "Nb_Reviews": 2,
          "Date": "2022-11-03T21:47:20.000Z",
          "Titre": "Binding on Print Orders",
          "Contenu": "The support from Forever is fantastic.  The return policy is fantastic.  However the quality control of printed products is pathetic.  I ordered to books recently.  Both had to be returned because the binding was terrible.  One was a Seamless layflat and the other was a hinged layflat.  The books that were replaced were great.  They were marked for extra scrutiny. This seems to be happening a lot and takes away from the profitablity of the company which then will lead to higher prices."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie Fancher",
          "Nb_Reviews": 2,
          "Date": "2023-03-12T14:05:59.000Z",
          "Titre": "Ordered prints",
          "Contenu": "Ordered prints. I do not think this company does well with prints. They always seem so dull.  Just not up to my expectations."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Janine",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T07:48:32.000Z",
          "Titre": "one of my calendars was out together in…",
          "Contenu": "one of my calendars was out together in the wrong order. print quality is not as great as in previous years"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kim Mouw",
          "Nb_Reviews": 4,
          "Date": "2022-10-27T19:09:35.000Z",
          "Titre": "Faster response time needed",
          "Contenu": "I was at a scrapbooking event and couldn’t do anything because I couldn’t get my pictures into the program to work on them. I reached out to Forever right around 4:00 pm. The event went until 10:00 pm. The evening was a total waste of time since I didn’t get a response from Forever until the next morning, when I was busy with “life”.   A much quicker response time would have been appreciated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LBarry",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T20:05:37.000Z",
          "Titre": "Duplicate tapesI sent two tapes that were identical…",
          "Contenu": "I sent two tapes that were identical and one with nothing on it.  You processed snd charged me for all three."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jan",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T02:04:35.000Z",
          "Titre": "Some of my products I've had printed…",
          "Contenu": "Some of my products I've had printed we're not even, (wall art) & I had a very expensive album was not bound properly. I also ordered a frosted glass for dad, that I wasn't charged the American fee.So I never did receive it. Other than that I was very happy. Now I don't order as much."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Tawnya painchaud",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T23:48:40.000Z",
          "Titre": "Shipping costs",
          "Contenu": "Was greatly disappointed at the shipping cost. Maybe it would be possible to add more options with different price ranges."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Lynette",
          "Nb_Reviews": 2,
          "Date": "2022-11-03T23:34:17.000Z",
          "Titre": "Just getting to learn about Forever",
          "Contenu": "Just getting to learn about Forever New iPad & I just need to find the time & get help to figure some stuff outIt’s probably not the system, it’s me"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lorrieviv",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T16:42:42.000Z",
          "Titre": "A lot of online work is not intuitive",
          "Contenu": "A lot of online work is not intuitive. Only repetition helped. Fortunately, I have a great coach in Claudia who made it possible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-21T02:40:47.000Z",
          "Titre": "Hard to navigate between website and…",
          "Contenu": "Hard to navigate between website and digital uploads."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T23:16:11.000Z",
          "Titre": "I found the photos dark and pixilated",
          "Contenu": "I found the photos dark and pixilated. Not sure if it’s my phone."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Kari",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T07:55:22.000Z",
          "Titre": "I really like the program",
          "Contenu": "I really like the program, just wish there was more support when setting it up and adding pictures."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T18:42:33.000Z",
          "Titre": "It was a simple question",
          "Contenu": "It was a simple question. It took 2 days for an answer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janine",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T21:32:21.000Z",
          "Titre": "It's very difficult to load pictures…",
          "Contenu": "It's very difficult to load pictures it's frustrating"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pam C",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T00:10:36.000Z",
          "Titre": "Much more complicated than advertised.",
          "Contenu": "It seems like everything I wanted to do requires an up charge and I received many, many sakes pitches before I unsubscribed. On the plus side, my ambassador, Carrie Koster, has been very helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristine Dannheim",
          "Nb_Reviews": 2,
          "Date": "2023-01-23T20:50:35.000Z",
          "Titre": "It was a large price to pay for the…",
          "Contenu": "It was a large price to pay for the update, when I can't tell their has been any upgrades to the software."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Allison",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T20:48:41.000Z",
          "Titre": "Disappointed",
          "Contenu": "The app, the website on tablet and on computer had different ways of editing my book in ways that prolonged the process and made it difficult. You can’t edit your books at all on the app, making it a waste of space on my tablet. using the website on my tablet was better but still had its difficult moments — you can’t move the pages farther than the row they’re in and every time I press the “move” button the website refreshes. The best way to use Forever is on my computer, which was not convenient for me since my pictures were all on my iPad/phone. The app and website are clean and straightforward, but the UI is difficult to get around, especially if you aren’t very tech-savvy. I appreciate the selection of interesting collages to place my photos in, but it would be nice if I could choose where to include and not include text. I felt limited by what I could create, and I was afraid the book I ended up making would look repetitive. The book theme I chose didn’t offer a page that could put 8 pictures on, but they had 7 and 9. I found this odd and also limiting.The shipping was awful. Yes, it was quick, but the way my books were shipped was sloppy. A piece of cardboard and one piece of flimsy tape was all that was used to protect my books. I made these with my grandma, they mean a lot to my family and me, and if a book was lost or ruined we would be devastated. We were extremely lucky to have our books delivered unharmed.This could be a fantastic website, but the UI needs to be looked at and updated. I’m extremely disappointed with how my books were shipped, I really think that needs to be looked into as well. The books printed beautifully, my grandma and I worked really hard on them and we’re satisfied with the end result, but it could I’ve all be ruined by sloppy packaging. I believe this app/site could be something really great, but only after these things are looked into and fixed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HikerCris",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:37:53.000Z",
          "Titre": "Quality photo cards & envelopes",
          "Contenu": "There was a bit of a glitch with the delivery date but it arrived in an acceptable timeframe.I am impressed with the quality of the cards and envelopes. Plus the photos are clear.I've used other companies in the past. I am happiest with Forever."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:31:38.000Z",
          "Titre": "Everything was shipped quickly and…",
          "Contenu": "Everything was shipped quickly and received before expected. I loved the Planners I received. The large blankets (Sherpa) are warm, which is why I bought them and we use them every day, but the plaid images were not as sharp/clear as I expected or I would have given 5 stars. I love everything I have ordered from Forever and this was only a small disappointment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie Koke",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T01:13:56.000Z",
          "Titre": "Beautiful Holiday Cards",
          "Contenu": "My holiday cards arrived promptly and I was very pleased with the quality. The only issue was that the cards were scrambled up - I expected them to be alphabetized by last name, as they are in my Forever address book, but they came in a totally random order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:22:32.000Z",
          "Titre": "Service is user friendly",
          "Contenu": "This site is really easy to use, and for the amount of storage I get I think the price is really fair. I love how easily I can upload from my phone with the app"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judy Tysinger",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T00:50:40.000Z",
          "Titre": "You hire the best people",
          "Contenu": "You hire the best people, always friendly, courteous and knowledgeable your products.  I am always so pleased.  Recently I sent in a forever box but I was totally unprepared at the total cost once you received the box.  I did talk with a service agent and got the bill of $400 additional over the original cost of the box and now I have gotten another bill for over $300.  I thought once I paid the additional $400 that was it.  So shocked."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "First Timer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:02:59.000Z",
          "Titre": "This was the first time I had utilized…",
          "Contenu": "This was the first time I had utilized Forever to create the Photobook. I found the website very user friendly.I probably didn’t capture all the options available in creating the book - for example I would have liked to include more wording in the captions on some of the pages.I mostly appreciated the quick delivery from time of order - well done!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:55:17.000Z",
          "Titre": "The blanket looks wonderful",
          "Contenu": "The blanket looks wonderful. It will be a Christmas present so I am hoping it will stand up and keep its appealing look. Joanne Boyd  the consultant was excellent ! Did a great job Helping me put it together.Marion McDuffe"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Colleen",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T17:54:32.000Z",
          "Titre": "So pleased with my holiday cards",
          "Contenu": "I appreciated how easy the card design process was; and am so pleased with the final product. Our holiday cards have a nice heft to them, and the almost-velvety texture feels a bit more elegant and lovely than a plain cardstock would.The only improvement I would suggest is to expand the variety in how many photos can be used in the templates. There were some designs with template choices for either one photo or a large number (6-8) of photos, when I only wanted to use 3-4."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Diane",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T06:23:51.000Z",
          "Titre": "Canadian prices are not advertised on excellent products and service.",
          "Contenu": "Good quality products and fast service are awesome.  The only huge drawback is that I live in Canada and the product prices sound great until the prices get transferred into the Canadian dollar which is so much higher.  Is it not possible to advertise the Canadian product prices?u"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phyllis",
          "Nb_Reviews": 5,
          "Date": "2023-12-02T14:26:39.000Z",
          "Titre": "I am truly happy to share this product ...",
          "Contenu": "I loved the interaction with my representative. She was amazing. She called and made sure I knew how to use the app and that I took advantage of all the services available to me. She helped me use my skills ina  way that allowed me to do MY best work and get a product I was truly happy to share with a special friend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Megan V.",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:42:47.000Z",
          "Titre": "Holiday cards",
          "Contenu": "I loved some of the designs, but would have enjoyed to edit some small pieces of each. I would love each option (for example, the holiday cards) to be more like templates instead of designs that cannot be edited. For example, I loved the script font and photo layout of one holiday card, but would have preferred it to say \"Happy Holidays\" instead of \"Merry Christmas.\" I ended up finding one that I liked and worked for my needs though, so it all worked out. I'm excited to send these off to loved ones!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane Meagher",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T18:54:44.000Z",
          "Titre": "I am happy with the final product",
          "Contenu": "I am happy with the final product, but the layout options were more limited in terms of the number, size and shapes of photos, backgrounds and embellishments than what I am used to with other sites like Snapfish."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T01:04:14.000Z",
          "Titre": "Calendars",
          "Contenu": "The program to do my calendars was easy to use but I am finding the prices are getting out of line so I don't think I will be doing this anymore."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:18:37.000Z",
          "Titre": "Prices are high ÷(",
          "Contenu": "Experience was good... just wish your prices were better. Could only afford to do a book since I had a 50% discount."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:44:44.000Z",
          "Titre": "Great",
          "Contenu": "The cards were gorgeous and quality card paper.I thought I ordered a folded card, bit it came as a flat card"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T00:02:09.000Z",
          "Titre": "Everything went well",
          "Contenu": "Everything went well.  Sent my films, they processed / digitized them and sent them back.  It took about three months.  This is due to there move to larger facilities.  Communication could have been better during the delays. I'm not sure if I want the monthly streaming option.  It's a little pricey."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T22:33:17.000Z",
          "Titre": "I’ve used Forever archiving before and…",
          "Contenu": "I’ve used Forever archiving before and knew that my family’s precious photos would be well taken care of. My consultant’s help to get it all organized and safe for years to come is a great relief. I love being able to share photos easily too!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Leanne M",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T16:12:56.000Z",
          "Titre": "Great Quality",
          "Contenu": "Great quality of my photo book. It's a Christmas gift and my husband will love it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathleen Cataldo",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T21:29:13.000Z",
          "Titre": "The quality of the prints are great",
          "Contenu": "The quality of the prints are great.  The order arrived very quickly!  It was frustrating during upload as I had to recenter almost every photo.  Any photo where the main subject(s) filled the frame were cut off and I had to choose what I really wanted in the print.  Most of those prints I had to eliminate as they were group photos."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T16:18:29.000Z",
          "Titre": "For the most part",
          "Contenu": "For the most part, the items I had digitized were fine. There were, however, several negatives that when digitized, were very light. They looked washed out and the original prints I had made several years ago were not. Also, some were digitized backwards."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pam",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T03:49:07.000Z",
          "Titre": "The book arrived today and it is…",
          "Contenu": "The book arrived today and it is lovely. I did not give 5 stars because I was frustrated while creating it by not being able to manipulate which boxes contained photos and which contained text. Seems like that should be an easy thing to do, but I contacted the company and they said it’s not possible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T16:56:36.000Z",
          "Titre": "I love the Artisan program - however.",
          "Contenu": "I love the Artisan program.  Love the concept of having my photos secured “forever” through the Forever program.  Two areas that need improvement:1.  Photo editing capabilities.  I now edit my photos before moving them into Forever as the editing is not great in Forever.  2.  Training- the “getting started” trading has been very helpful, but good luck to new users trying to find a link to the training that works.  This needs to be corrected!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barb Everson",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T15:33:54.000Z",
          "Titre": "Girls baby pictures were in order the…",
          "Contenu": "Girls baby pictures were in order the boys were not"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol Carlson",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T14:50:07.000Z",
          "Titre": "New Year’s photo card.",
          "Contenu": "New Year’s photo card was good quality card stock and color quality but the card I chose had the year printed on the bottom front of the card.  I was ordering this in late December 2022 or early January 2023 for the New Year 2023.  The card had Happy New Year 2022 printed on the front which I didn’t notice when ordering.  I think the card in your inventory should have been updated to show the correct upcoming “New Year”."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sheila Krueger",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T17:24:00.000Z",
          "Titre": "Downloading products",
          "Contenu": "The purchase and downloading was clear and easy to follow. I enjoy trying new products like masks at the deal of the day 50% off"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T21:10:00.000Z",
          "Titre": "Photo book",
          "Contenu": "I ordered a photo book for my daughter and her husband with their wedding pictures.  The pictures were beautiful and the book turned out really good.  The only complaint is that a couple of the corners were dented and the black back of the book was scratched.  It probably happened when it was shipped.  My suggestion would be to package the books differently so that damage does not happen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margene",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T07:06:20.000Z",
          "Titre": "Unique personal gift",
          "Contenu": "I love the ornament quality and how personal I can make them.  I loved them so much this is my second order because I had to get them for everyone on my list. Everything, which is a lot, I have bought have been the highest quality. This includes puzzles, blankets, photo books and now about 20 ornaments. Worth the money for sure and love the 50% deals so I could really buy a lot. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Jo Gillespie",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T21:45:48.000Z",
          "Titre": "Dream Vacation",
          "Contenu": "I am just now getting back with my input since I have been working diligently to put together picture books. We went on a dream vacation and I needed to google faces, places and so many cathedrals and it takes time for us old folks. So far, so good with ease of use and I love Jodi Bondy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T18:21:42.000Z",
          "Titre": "Customer service was amazing",
          "Contenu": "Customer service was amazing!  I had a few glitches with payments ect.  The videos are okay. I wish they could slice out the long pauses of film where there is nothing. For instance someone dropped the camera and it sat for over an hour. So to me that was a waste of space and I could have gotten a different tape done. It’s hard to not see the tapes before you send them in. It’s literally a crap shoot for me on all my tapes. Otherwise overall good quality. Hard to hear some spots."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Heather McLaren",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T21:10:20.000Z",
          "Titre": "8 x 10 photo books in Design and Print",
          "Contenu": "I wanted to create an 8 x 10 photo book from a scrapbook that I had scanned but this size is not available in any of Forevers Design and Print books. I had to go to my ambassador to create it through Artisan which I do not use. The final product was great and I gifted them to many in my family and all were very pleased with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robin Bonner",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T22:36:38.000Z",
          "Titre": "Christmas cards and wedding album",
          "Contenu": "I recently ordered a wedding album, and some Christmas cards.  The three wedding albums look good, and they are all consistent with each other; good job.  I ordered the cards in two installments.  In the second installment (40 cards), the crease line for folding the card was not centered, so my cards didn't look neat and tidy.  It was a little embarrassing sending them out like that, but in order for people to receive them by Christmas, I went ahead and sent them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Gomes",
          "Nb_Reviews": 3,
          "Date": "2023-09-08T22:09:17.000Z",
          "Titre": "Service was good",
          "Contenu": "Service was good.  One improvement in the system would be to allow the ability to change to a lay-flat book if it wasn't initially selected when creating an album or at least give a warning that this is not possible  once a choice is made."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T19:20:47.000Z",
          "Titre": "Customer service was outstanding",
          "Contenu": "Customer service was outstanding! Probably one of the most problematic on-line orders I’ve ever made but Elizabeth and Natalie saved the day! My first attempt to order was on Jan 2nd and I finally got confirmation on Jan 11. The product has arrived and it will be given as a gift in June."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lucy Knutson",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T17:35:42.000Z",
          "Titre": "My Specialty box experience...",
          "Contenu": "Overall the experience was fine. One question...I did not see in the instruction manual included in the box links to online videos that would have made the process easier to follow. Also, I recycled the exterior box not knowing that I needed to keep it. I think it would be helpful to send an instruction email to those that purchase the boxes with links to the online videos and \"highlighted\" instruction to keep the exterior box once it arrive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "martha",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T00:46:51.000Z",
          "Titre": "My rep",
          "Contenu": "My rep, Ann Gulledge is great.  She hosts monthly \"click clubs\" for us. The reason for my 4-star ...if I try to send a picture from Forever to a text or an email, the person gets a https...long website. I would like to send a picture as a picture, not as a website. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rebecca Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T20:44:14.000Z",
          "Titre": "A little nervous for the first time",
          "Contenu": "A little nervous for the first time, but the process went smoothly!  Only thing that would really help a first-timer is having detailed instructions on whether you need to move files down (and how), or just leave in Forever Storage.  First-timers need step-by-step instructions to navigate without stress!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barrie",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T05:02:13.000Z",
          "Titre": "Transparency about box digitizing pricing",
          "Contenu": "It was good to get my family memories preserved on the Forever cloud. As usual the staff was courteous. However, I was distressed at the additional cost for the extra photos in the box. I specifically called ahead and stated I had more photos than provided bags. I was informed that I could put as many photos as I could fit in the box. No one ever mentioned there would be an additional charge or how much it would be. I should have been informed of the additional charge rate before I sent the box. I would have not sent so many photos. I was shocked at how much it ended up costing for the digitizing. Never again."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Penny Z",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T22:33:42.000Z",
          "Titre": "Personalized Blankets",
          "Contenu": "I ordered 3 blankets and 1 ornament. The pictures on the blanket were very good quality, I found the blanket itself a little thinner than I hoped for. I still have not received the ornament I ordered. I was very impressed with the short delivery time! The blankets will be wonderful momentos."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victoria Stauber-Pufall",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T23:53:31.000Z",
          "Titre": "My first experience with Forever was…",
          "Contenu": "My first experience with Forever was good! I'd used another company for extended family memories and was pleased with their results also. I'm grateful for your company and the ability to keep these memories available! Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vivian",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T13:23:42.000Z",
          "Titre": "Impeccable customer service and care with my photos",
          "Contenu": "I have been using Forever to slowly digitize my photos for a while now. The process and customer service are impeccable. They handle your photos with care in the mailing process and notify you when they are safely received. I've been happy with the digital images overall, and I trust the platform to store my photos. My videos seem to come back darker, but they are from VHS tapes that are over 20 years old!  My concern is the price - to me, it's rather expensive."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T00:55:11.000Z",
          "Titre": "The book i created has great colour…",
          "Contenu": "The book i created has great colour photos and enough room for my notes. My challenges were with adding pictures and not realizing how big some of them would turn out to be- wish it would of been easier to add photos to the last few pages."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T23:13:37.000Z",
          "Titre": "Metal Wall Panel is well made but......",
          "Contenu": "the site was easy to navigate and to select the product I wanted. I was able to insert the images I wanted easily. The shipment arrived quickly as well. I chose a 16\" x 20\" metal wall panel. I am dissappointed in the metal panel being curved, rather than flat. The material might be too thin? I did love the mounting hardware and the bumper on the bottom to hold it away from the wall but the curve really bothers me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T23:23:53.000Z",
          "Titre": "pretty good site",
          "Contenu": "Shipping was quick, i like the things they put in the notebook like to do list, etc. ( although i wish they would have shown that on the preview.) The photos were blurry, but they told me it was going to be blurry on the site so i guess i cant blame them. overall good site. they send a TON of emails though."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:20:58.000Z",
          "Titre": "Pictures came out clear on the card.",
          "Contenu": "Pictures came out clear on the card.I wish I could have added text to the pictures—if there was a way to add text it was not obvious"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roberta",
          "Nb_Reviews": 3,
          "Date": "2023-07-31T16:53:01.000Z",
          "Titre": "Service is great but getting through difficult",
          "Contenu": "Once I got through to a customer  service representative, it was great. However, it took me several calls over two days to get through. I had also left a message one day and never heard back."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T13:57:32.000Z",
          "Titre": "Had a few issues",
          "Contenu": "I have called customer service twice about my order- left messages as requested and no one called me back. Normally they are so good!!  Order is missing the ribbons to hang the ornaments."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 3,
          "Date": "2023-04-15T03:53:22.000Z",
          "Titre": "Almost five star",
          "Contenu": "The softcover photo book was printed quickly and packaged well so that it arrived in perfect condition. The only reason the experience wasn't five-star was that I felt the text box was printed closer to the bottom edge of the page than was indicated on the print preview. I used AutoBook to create the photo book, so the textbox was provided for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "E J stute",
          "Nb_Reviews": 2,
          "Date": "2023-01-17T01:09:04.000Z",
          "Titre": "5 grandkids",
          "Contenu": "The photo shoot was greatIt was picking out the pictures to put in the book.  I wanted to delete one of them and it would not let me.  The front photo on the book is up to high.  Not centered.  The grandsons hat is cut off."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gretchen",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T16:50:26.000Z",
          "Titre": "Order was received fairly quickly after…",
          "Contenu": "Order was received fairly quickly after placing the order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A Onnen",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T21:03:49.000Z",
          "Titre": "I am a fan of the Forever services",
          "Contenu": "I am a fan of the Forever services, especially the software that allows digital scrapbooking. The only reason I can't give 5 stars is that the cost is becoming difficult for me to handle on my retirement income. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T14:31:06.000Z",
          "Titre": "Thank you",
          "Contenu": "Everything that I ordered safely came and arrived on time and not damaged.  The only reason I don't give it 5 stars is that the color on some of the pictures I am finding not as bright/sharp as they were on the computer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan Brownell",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T01:20:26.000Z",
          "Titre": "Replacing the plastic straps in the finished album.",
          "Contenu": "Everything was great except there was one metal strap holder loose in each album.  Fortunately I could just leave it because the top metal piece was secure.It is difficult for me to undo and replace each metal holder."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Pauline",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:04:26.000Z",
          "Titre": "Great organization options!",
          "Contenu": "I love being able to access all of my photos from any device! I love how easy it is to make different albums as well. This program helps me to keep my photos organized. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bernice Rogers",
          "Nb_Reviews": 3,
          "Date": "2023-07-16T21:32:10.000Z",
          "Titre": "The digitizing of my slides and the cassette tapes was great.…",
          "Contenu": "The digitizing of my slides and the cassette tapes was great. I have never been disappointed with the work Forever does with my photos.The only item that needs to be fixed is my address - I have updated my address everywhere i know to do it but the box always goes to my old PA. address and not my current address in UT.   I thought we had this corrected but it still needs work.  But I still highly recommend Forever.com to all i meet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Foster",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T00:15:17.000Z",
          "Titre": "First time experience",
          "Contenu": "Since it was my first time using the program, I had to figure a lot out on my own. Once when I figured how to manipulate the program, I was enjoying myself. It was a trial and error. I am really looking forward to receiving my photo books to see if it is as great as it looked when ordering."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T21:48:53.000Z",
          "Titre": "Your representatives were so very…",
          "Contenu": "Your representatives were so very helpful.., but your service itself is very expensive.  Haven’t had time to review archive - I’m sure it’s great .., I’m just in a super busy season of life."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joy Bayani",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T22:25:27.000Z",
          "Titre": "It was easy to create a project",
          "Contenu": "It was easy to create a project. The planner/notebook and the prints turned out really good. The only complain I have was the packaging/shipping of the planner/notebook-it arrived wrinkled."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lyn",
          "Nb_Reviews": 3,
          "Date": "2023-06-27T20:34:14.000Z",
          "Titre": "I have been using Forever now for about…",
          "Contenu": "I have been using Forever now for about 11 years and have thoroughly enjoyed the results.  I make a scrapbook for my grandchildren every year and they get it at every birthday.My only problem is getting some \"embellishments\" that I would like.  But that is just me.  Thrilled with the results and so quickly too!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caryn",
          "Nb_Reviews": 2,
          "Date": "2023-04-15T17:41:02.000Z",
          "Titre": "I absolutely love this product",
          "Contenu": "I absolutely love this product!  There is nothing like it on the market.  I have absolute freedom and control and the ability to move and adapt my templates to my style and purpose AND the printing/binding of my album is fast and flawless!  Thank you Forever!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Betty Price",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T18:09:48.000Z",
          "Titre": "My experience with forever",
          "Contenu": "This company is reliable, do good work and trustworthy.  I would recommend them.  It is great to have photos for future generations to view and know who their relatives are.  Deanna Johnson is super always ready to help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patty",
          "Nb_Reviews": 3,
          "Date": "2023-03-14T05:16:01.000Z",
          "Titre": "Calendar box broken. I received on 2024 calendar in a beatup…",
          "Contenu": "I received on 2024 calendar in a beatup box. Thankfully for the tape that somehow held it together! The corner of the box was broken, unclear how the calendar stayed in the box, but it did. Suggest putting tape twice on each side, incase one tape comes loose!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Hill",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T04:02:19.000Z",
          "Titre": "12 x 12 Scrapbook pages",
          "Contenu": "I had scrapbooking pages 12 x 12 scanned.  They were great.  Some of the pages contained the jeeping and some did not.  I expected them all to be without jeeping as I indicated on the order.  Otherwise, excellent job and I am going to order my third specialty box."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dana",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T18:06:17.000Z",
          "Titre": "Great experience, overall.",
          "Contenu": "The entire experience was clear and went smoothly! Ordering the box and packing it up was simple and  I appreciated the tracking and updates provided online in my account as I was waiting for the recordings to arrive.There are two reasons I gave it 4 stars. One is that I seem to have to download each of the 40 recordings separately and they are not named as they are on Forever. I understand they are hoping I will purchase long-term storage, but it just made an experience I paid a lot of money for a bit more cumbersome.Second, the cost is the same for transferring VHS tapes that I had literally 2 or 3 minutes of recording on vs. much longer recordings. Just a little disappointing to have to spend so much for those much shorter ones. I found the customer service to be impeccable. They were clear and quickly responded to all my questions in a friendly manner. I would recommend this service to others and am grateful to have so many memories that had been lost to us for decades."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T01:31:38.000Z",
          "Titre": "I believe this will be a nice service…",
          "Contenu": "I believe this will be a nice service to use but the uploading from my phone has taken over a week. Also, I don’t like there is a range of how many photos you have when you purchase. I like black/white so I’d prefer based on a solid quantity with storage."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T20:12:35.000Z",
          "Titre": "I love the quality of Forever photo…",
          "Contenu": "I love the quality of Forever photo books and the program makes it so easy to design a book just the way you want it.  My only problem this time was a glitch when I tried to download my book for printing.  After some back and forth with Forever Help staff, the problem was resolved with the help of an minor fix update."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Beverly L",
          "Nb_Reviews": 2,
          "Date": "2022-11-25T22:10:47.000Z",
          "Titre": "Ornament & Photo Book",
          "Contenu": "I ordered an ornament and loved the quality and the printing of the photos was spot on. I ordered two copies of the same book. One was printed with my cover and someone else's pages. My reprint was submitted Nov 17th and as they expedited delivery, I had it Nov. 23rd. No hassles for the reprint and fast delivery. The only downside was one book was printed very slightly too light, taking away some of the details of the photos, but the other was printed just right. I'm happy with the overall quality of the pages and cover."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Tamayo",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T04:20:17.000Z",
          "Titre": "The book was printed and delivered…",
          "Contenu": "The book was printed and delivered pretty quickly, but I have to say I was disappointed in the quality of the default paper weight for the pages compared to books I have ordered through other digital sites.  I was told you could choose 2 different paper weights but I did not see that as an option when ordering.  I also don't like that I would have to pay extra for a thicker, higher quality of paper from Forever compared to what is standard on other digital sites. Overall my impression with the Forever book printing is still to be determined as I order more books."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T17:53:34.000Z",
          "Titre": "This rating is based on working with…",
          "Contenu": "This rating is based on working with very old home moves from the early 1970's. I think you did a good job with what was presented. I am just beginning to take time to learn and work with my Forever account. Thankfully a neighbor is my Forever Ambassador."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan Nilson",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T23:58:35.000Z",
          "Titre": "Things I like and don't like about forever.",
          "Contenu": "My \"Ambassador\" is awesome and very helpful.  Things I like is I own the storage (no monthly fee).  The few books I have made seem to be quality products.  Reasons for only 2 stars:  Forever changes the meta data associated with your photos so you lose the location data.  Artisan software is expensive and buggy.  To crop a photo, I had to first crop it in another program then use that photo otherwise the Artisan cropped photo was not what I had cropped.  The software does not automatically update even though I have update turned on.  My biggest complaint is that when using Artisan, the first and last page have what I thought was a watermark stating \"This page intentionally left blank\" so I left those 2 pages alone thinking they had to be blank and would be  blank because of the message on the page because of the printing processes.  I got my book in the mail and the first and last pages had the watermark stating the page was intentionally left blank.  I went back into Artisan to see if the messages could be deleted but they can't.  The \"safe zone\" really isn't \"safe\".  A few of my picture boarders were cut off (not a huge deal since is wasn't very noticeable).Update:  I have been working with Forever about the \"watermarks\".  They have agreed to reprint the book at no charge.  Because of this, I have increased my rating."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "551955 - Rochelle Theresa Jones - South Pacific",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T03:13:15.000Z",
          "Titre": "Order was easy and delivery came 1 week…",
          "Contenu": "Order was easy and delivery came 1 week later. Very fast! The glue on the inside cover did bleed, sticking the last page and leaving a rough edge. There's also 1 too many blank pages added to the book. Makes it look empty, like I could have added more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 2,
          "Date": "2023-02-03T01:13:24.000Z",
          "Titre": "Problem with book binding",
          "Contenu": "I purchased a hardback, layflat digital scrapbook with 54 pages. I have bought 23 of these books from Forever and had a problem with only three of them. One made my 5 year old granddaughter looks like a teenager because it looked like she had lipstick on. On the second book, the printing colors were off (I think). On my latest book I purchased in January, the problem was that the binding of the book was not glued down to the spine of the cover of the book. I was going to call in about it but decided it would be ok as long as it was not handled roughly. I love Forever and Artisan and would not use any other company. The customer service is professional, quick and fixes any problem you may have. Only good things to say about Forever - its just some small things that needed attention."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol Phillips",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T18:53:06.000Z",
          "Titre": "How-To",
          "Contenu": "Its been years since I tried to make a Forever book so I had to relearn the how-to's. I have the most patient ambassador for whom I am extremely grateful! Can't wait to see the finished product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MCG",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T04:21:14.000Z",
          "Titre": "Too limited in basic form.",
          "Contenu": "The product was a present. It works well but it’s basic form is extremely frustrating in that the capability of creating Albums costs extra—$40 a year. Ridiculous! A digital fishhook."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julie Everett",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T22:03:05.000Z",
          "Titre": "Product Upload",
          "Contenu": "There seems to have been a bit of an issue with the product uploading.  I had to do it a few times before it actually worked/appeared for it to be unlocked."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kathie",
          "Nb_Reviews": 5,
          "Date": "2022-12-12T21:26:13.000Z",
          "Titre": "Enjoy this Company!!!",
          "Contenu": "I have been with this company for a long time and appreciate the progam very much. I am curious to understand though, why the pictures don't seem a clear and sharp as they used to....."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "VIcki HOrnby",
          "Nb_Reviews": 2,
          "Date": "2023-02-01T21:11:02.000Z",
          "Titre": "Always a pleasure to deal with you all",
          "Contenu": "Always a pleasure to deal with you all.  A small misunderstanding over holiday period but sorted once we got on same page. Thanks for a great product and service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T21:53:14.000Z",
          "Titre": "Artisian",
          "Contenu": "I have used and very much like Artisian for years I love making books and calendars I wish I could touch a previous page with my cursor and know what art program it came from"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T04:45:45.000Z",
          "Titre": "IT WAS AN EASY PROCESS",
          "Contenu": "IT WAS AN EASY PROCESS, MEGAN WAS REALLY HELPFUL ONLY PROBLEM I HAD WAS THERE SEEMED TO BE ADDITIONAL COSTS THAT I WASN'T MADE AWARE OF UNTIL BOX WAS ALREADY THERE"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T23:16:04.000Z",
          "Titre": "Review of paper photo pages scanned",
          "Contenu": "I love FOREVER and have had good experiences with transfering our VHS/DVD's onto our online account.  I decided to try making copies of my Creative Memories paper photo books to have online also, in case something would ever happent to the books.  I felt it was pretty expensive and the pages were big (12x12) so I could not put all of them in the largest box.  Thank you for the 40% off, but still it was a couple hundred dollars.  I realize it is an expense on FOREVER's side too.  Sending and delivering the box is amazing and I fully trust Forever to get my precious memories back to me.  The pages came back the way I sent them and thank you.  The only issue was when Forever put the pages on my online account the pages were not in order as I sent.  I had baby pages mixed up with kindergarten etc...I don't know how to get them in order, which will also take time to correct that and figure that out.   The pages were well done though and clear.  I still believe in what Forever is doing and thankful to know my photos/videos are safe on this site.  S. Hayes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Faith",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T02:35:25.000Z",
          "Titre": "Very happy except two small flaws",
          "Contenu": "I was very happy with the speed in which my photo book was printed and shipped to me.  I was also very happy with the wonderful printing and binding job you all did.  There were just two little flaws that keep me from rating you as a five-star job.  There was a small flaw on the back cover and a little bend in the top of the spine in the front of ONE of the two copies I ordered.  Thankfully, the second one was good so I will be giving that one as the gift and keeping the flawed one.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T01:18:18.000Z",
          "Titre": "Website Needs Help",
          "Contenu": "Aside from the website needing to be easier to navigate, everything was great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margaret",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T02:12:46.000Z",
          "Titre": "The calendars I ordered are beautiful",
          "Contenu": "The calendars I ordered are beautiful. The only reason I did not give a 5 star is because the 1 st package delivered was damaged requiring a reorder and delivery."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Lynne Lyster",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T21:35:58.000Z",
          "Titre": "Photo books",
          "Contenu": "I love the photo books that I made of my trip, the only draw back is that it is from the US and the US dollar makes it more expensive for us Canadians."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bridget Mills",
          "Nb_Reviews": 3,
          "Date": "2023-02-06T04:39:10.000Z",
          "Titre": "Good Prints",
          "Contenu": "The prints were very good. Shipping was a little high for just prints. I love knowing my pictures are safe if my computer malfunctions and I could lose those precious memories."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Not at this time",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T19:06:24.000Z",
          "Titre": "I didn't have to do it..I've been…",
          "Contenu": "I didn't have to do it..I've been holding on to the tapes for so long..I just wish I had heard about Deanna sooner, so I could've watched them with my husband before he passed.  I'm happy to know that the memories are safely tucked away and can be viewed at any time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customerChar",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T01:59:29.000Z",
          "Titre": "4x6 reprints made",
          "Contenu": "I had 4x6 reprints made.  The color and quality were very good.  I need to find out why a few prints was were sort of cropped, in that a top or side was not fully printed.  All but a couple were still usable.  They were mailed in a timely protected way … 3 packages of prints were sent in a box👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T23:10:27.000Z",
          "Titre": "Helpful to work with an experienced person",
          "Contenu": "A lot of what made it great was working on it with someone who was familiar with their products and what could and could not be done."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customerdiane Jensen",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T20:13:43.000Z",
          "Titre": "I don’t like how the lay out pages page layout are…",
          "Contenu": "I don’t like how the lay out pages are put together I would sooner pick what I want for each side of page"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-22T21:25:30.000Z",
          "Titre": "The service was very prompt",
          "Contenu": "The service was very prompt. I ordered the book that lies flat- it feels like it will fall apart, although it hasn't done so yet. It makes a cracking noise every time you open the pages."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T23:00:32.000Z",
          "Titre": "My favorite program",
          "Contenu": "I love this program. It's fairly easy to learn. I like the flexibility of working on projects offline. Occasionally I do see bugs in the software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T18:55:59.000Z",
          "Titre": "Gift Certificate It was good I just didn’t realize gi…",
          "Contenu": "It was good I just didn’t realize that I had to send the information to the person I bought the gift certificate for. Other than that it was great."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Diane W",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T23:26:51.000Z",
          "Titre": "Excellent turnaround time.",
          "Contenu": "I was quite shocked to see arrive at my door less than a week after I ordered it.The quality of the notebook is superb and I will enjoy giving it as a gift."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T18:47:21.000Z",
          "Titre": "I was able to upgrade and download the…",
          "Contenu": "I was able to upgrade and download the new program with ease. Transferring information from an earlier version on another computer was difficult."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dale",
          "Nb_Reviews": 3,
          "Date": "2023-01-06T02:41:40.000Z",
          "Titre": "Easy to make an order",
          "Contenu": "Easy to make an order.  I received the Delivery quickly, the only criticism I have are the pictures didn't come out as good as I expected."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Carol",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T21:51:48.000Z",
          "Titre": "Blankets are fabulous",
          "Contenu": "Blankets are fabulous. Water bottles and mouse pad were good; one of the coasters had a bit of an edge on otherwise good. Timing was super!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T01:45:19.000Z",
          "Titre": "Fur Baby Virtual Event",
          "Contenu": "Hi, I wasn't able to finish watching the virtual FUR event so I can't wait to watch the replay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T19:37:29.000Z",
          "Titre": "You had a quick turn around time which…",
          "Contenu": "You had a quick turn around time which was awesome! I was so excited to get to see all of our old videos! I was disappointed that a few of the tapes we sent were blank, but we still had to pay for them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer in TN",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T19:02:01.000Z",
          "Titre": "Album quality",
          "Contenu": "The quality of the albums are very nice. Wish I could edit photos with more tools on the site, such as blurring the background."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TOM",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T21:14:41.000Z",
          "Titre": "I RECEIVED ZERO COMMUNICATION ONCE I…",
          "Contenu": "I RECEIVED ZERO COMMUNICATION ONCE I PLACED THE ORDER. NO INFO ON SHIPPING AT ALL THEY JUST SHOWED UP. THE PRODUCT TURNED OUT GREAT."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MM",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T14:51:11.000Z",
          "Titre": "Easy Transfer of Vault",
          "Contenu": "Once program was downloaded it was super easy to open vault in newer version."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Leachman",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:16:18.000Z",
          "Titre": "Carrie Koster is an All-Star Forever…",
          "Contenu": "Carrie Koster is an All-Star Forever representative.  Carrie recently helped me produce a photo book about a trip my wife and I took to southern Spain earlier this year.  I received the book today and it looks great.  I am planning to present it to my wife for Christmas.  Carrie helped me organize the book and taught me how to edit page lay-outs and add pages.This is my 2nd photo book and I plan to produce more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Leach",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T04:10:14.000Z",
          "Titre": "MORE SPACE",
          "Contenu": "I recently purchased an addition 10 GB of storage space online.  My purchase went through without a hitch, and --better yet--the additional space was on sale!Thank you, FOREVER!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail Joyce",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:39:39.000Z",
          "Titre": "My shipment did not ship complete but…",
          "Contenu": "My shipment did not ship complete but when I called they handle it so quickly and efficient along with several ornaments not up to my expectations, they handle over the phone and redud the color and reshipped at no extra cost. I forget her name but she was excellent.  Thank you Forever"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Audrey F.",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:23:44.000Z",
          "Titre": "First print projects",
          "Contenu": "First time using print service. Made 3 books.  System easy to useOrder delivered in a timely fashion. Love the finished products.  Cant wait for recipients to open their Christmas  gifts!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Marilyn",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T00:37:59.000Z",
          "Titre": "Laura Peck was instrumental in ensuring…",
          "Contenu": "Laura Peck was instrumental in ensuring my project worked, was successfully completed, and successfully uploaded to the print shop - this after I encountered a couple of never-before-seen glitches. Without her expertise and patient willingness to assist me I'd have been lost! What an asset she is to your tech team! All tech support people I have dealt with over the years have been expert in the field and with good people skills. There was just something special about Laura that made the entire experience relaxed and pleasant. So, I send a big shout out to her! Thanks, Laura!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:13:59.000Z",
          "Titre": "Outstanding customer service!",
          "Contenu": "I ordered 8 blankets as gifts. All of them were perfect except one. I contacted customer service and explained the situation. They shipped out a replacement blanket very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherrie Newman",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:16:06.000Z",
          "Titre": "5 Star Review",
          "Contenu": "My ambassador, Christine Vonesh, is the difference maker. She was so helpful in walking me through my project. So patient, kind, and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Maureen",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T08:41:29.000Z",
          "Titre": "Sherpa blanket",
          "Contenu": "I really love the quality of this blanket.  Ordering it was relatively easy and it came in the time indicated.  I’ll definitely be ordering other product in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marty",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T00:49:49.000Z",
          "Titre": "The products are top notch",
          "Contenu": "The products are top notch. The people who I have interacted with are very professional and very knowledgeable how to get the best results."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:46:12.000Z",
          "Titre": "Great Customer Care",
          "Contenu": "I had a snag with a Christmas print order.  When I contacted support they were very quick to reply and fix the problem. I am impressed with their great customer care and intention.  I will gladly be telling my friends about the great support I got from Forever."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:06:40.000Z",
          "Titre": "Happy with Forever",
          "Contenu": "Happy with Forever - annoyed with the spam message that my shipment was delayed and they wanted $0.99 to expedite the shipment of the box, I knew it was fake but thought you should know."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:54:38.000Z",
          "Titre": "Two photo books, two cards and two ornaments. Great customer service!",
          "Contenu": "I have made two photo books, two holiday cards and two ornaments. I am very please with everything. I had a printing issue on two items and customers service was very responsive and helpful in replacing the items quickly and at no cost to me. The only thing I wouldn’t do again is use white writing on the ornaments as it doesn’t show up as well as I would like."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie Schumm",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:55:52.000Z",
          "Titre": "16x20 Canvas print",
          "Contenu": "I was able to edit my pictures and create a 16×20 canvas print using several photos. I loved the outcome so much that I ordered another for my son's family. I ordered it on a Monday and they received it before the week ended!!! How's that for service!❤"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T23:20:37.000Z",
          "Titre": "Great calendar",
          "Contenu": "I order personalized calendars every year.  The quality is always very good.  Even when a warning says a picture if of low quality, it still comes out looking very good.  I like that the top part of the 12 x 18 calendar can easily fit into a scrapbook.  I also like that the Christmas delivery dates seemed to be much later this year.  It was always hard to complete a project for Christmas by middle of November."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:39:22.000Z",
          "Titre": "See above",
          "Contenu": "Love the quality and ease of use EXCEPT I would like to have the QR code be able to link to a video of a picture reel. I though this was possible but could not make it work, even with the pompt customer support you provide."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ada Marin, MD",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:34:02.000Z",
          "Titre": "Personalized photo blankets",
          "Contenu": "I made personalize photo blankets for myself, and each of my sisters, nieces, nephews, & great nieces and nephews- all in memory of my parents who passed away recently. They are beautiful; and I am SO happy with the finished products. I can’t wait for my family to open them on Christmas Day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:39:55.000Z",
          "Titre": "The cards arrived quickly and they…",
          "Contenu": "The cards arrived quickly and they looked amazing! It was very easy to use and I loved the quality of the cards compared to other companies I have used in the past!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T01:37:48.000Z",
          "Titre": "T-shirt blanket",
          "Contenu": "I was hoping to find the time to make our graduate a t-shirt blanket. I was unable to complete the project before graduation.  Thankfully I didn’t start the project before I started working with Forever!  We made her a t-shirt blanket with Forever. We both feel this blanket is probably better than I would have made and it is actually a completed piece!  It was worth the money for the time saving and quality of product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Williams",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T21:02:42.000Z",
          "Titre": "Solid communication, fast shipping, great service",
          "Contenu": "I had many slides after my father passed away; I sorted thru them and purchased a box.  Even though it took me longer, Forever let me know I could still send the original box and they quickly emailed me a new label.  I bundled the slides as instructed and mailed it off.  The company communicated all the way from letting me know they received the box, that the slides were being digitized, to the shipping is the slides.  I purchased a USB from the company and it was loaded perfectly.  In addition, the Forever website holds my slides for 2 months.  I have made several copies of the slides on flash drives to give as Christmas presents.  I’m very happy with the process and end products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T00:41:07.000Z",
          "Titre": "VERY HELPFUL",
          "Contenu": "There were issues of not having last years addresses still there. My rep was immediately responsive and helped me get the issue resolved!! The help staff at Forever were very prompt with replies also!This is my second year doing my Christmas Cards and I am totally pleased. LOVE that they print the addresses on the envelope for you!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:47:53.000Z",
          "Titre": "Calendar …",
          "Contenu": "A calendar that I had printed wasn’t forever’s normal quality. It had an ink drop appearance on most of its pages. I emailed and was given full credit for a new calendar to be printed. The new calendar looks great! Thank you very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Myers",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:38:09.000Z",
          "Titre": "BEST Customer Service this Christmas!",
          "Contenu": "EVERY one of my gifts have arrived early, and are beautiful. My family and friends who have received them are loving them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MimiC",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T05:17:49.000Z",
          "Titre": "High quality Christmas cards",
          "Contenu": "The Christmas cards I ordered turned out even better than I expected--e.g., the quality of the cardstock is very high; the gold \"Merry Christmas\" had texture on the card."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T16:25:32.000Z",
          "Titre": "Photo Restored & Colorized",
          "Contenu": "We had a family ancestrial photo restored and colorized. It was beautiful! And it was so touching to see my mother, now deceased, back at age 20, with her beautiful brown hair and brown eyes.  That photo was close to 80 years old and was originally black and white. The colorizing really brought everyone to life. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T04:02:00.000Z",
          "Titre": "My order was processed in a quick and…",
          "Contenu": "My order was processed in a quick and timely manner. There were many great options to choose from. It was easy to see how my picture looked in the different options before I made my decision."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T01:34:46.000Z",
          "Titre": "Digitization - worth every dollar!",
          "Contenu": "I love the digitization project I invested in. I was unable to view any of my 8mm and VHS tapes. It was such a pleasant surprise to start viewing these forgotten and almost lost memories."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K B",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T14:58:08.000Z",
          "Titre": "Kathy Winters has been fantastic",
          "Contenu": "Kathy Winters has been fantastic in aiding me through the process of understanding all of the facets of Forever. I’m excited to get my home movie digitized as the first step and for her assistance in moving forward in using their storage and creating projects! Oh and the forever club is a great way to get things started."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Celeste S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:16:28.000Z",
          "Titre": "The BEST solution to photo/video digitization and organization!",
          "Contenu": "I have been extremely happy with the digitization service; I've had over 20 orders processed over the past few years. All of my old videos and faded pictures have come back to life! In addition, I love the privacy and permanence of the cloud storage and the organizing features are user friendly and make it easy to find anything with the click of button! I would recommend FOREVER to everyone because everyone needs their services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:59:50.000Z",
          "Titre": "So very easy to order and if ever I…",
          "Contenu": "So very easy to order and if ever I have a question, Lisa Webster, my awesome ambassador, is right there to help me!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T19:54:26.000Z",
          "Titre": "FOREVER Support is always so helpful",
          "Contenu": "FOREVER Support is always so helpful. And if the rep doesn't know how to resolve my problem (usually not the case), he or she either finds out for me or refers me to someone who can."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Arleigh",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T20:02:49.000Z",
          "Titre": "Quality is foremost",
          "Contenu": "The quality of the items if on the top of the list.As a Canadian, it gets a bit harder with the exchange but when I know my gifts are unique and no one else has the same item, it becomes very special to me.They also do their very best to get it to me in an best way possible. I did order my last gift a day after the deadline, but is is already on its way. Beautiful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jan Weckman",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T23:37:51.000Z",
          "Titre": "Beautiful quality!!",
          "Contenu": "Products came within a short time.  The canvases look great!!  I would recommend this product to others.  Thank you for caring about my memories!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marilyn Kuehnast",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:52:18.000Z",
          "Titre": "I very much liked the quality of my…",
          "Contenu": "I very much liked the quality of my books and that they came sooner than expected. I was worried that they would not get here in time for Christmas gifting, but you came through. Very much appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky in Minnesota",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:00:49.000Z",
          "Titre": "Forever is so easy to use",
          "Contenu": "Forever is so easy to use:  Here are my reasons:1. I have created folders that work for me2. I like the options for photos to put details for the photos if I wish3. I feel good that these pictures will survive if something happens to the originals 4. I can share the folders with different people so we all have access5. I can choose to get a databox to get more photos scanned as needed6. I can purchase more space if I wish.7. There are other services I haven't explored yetThank you to the Forever Team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Benningfield",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:49:47.000Z",
          "Titre": "Great service from my Brand Ambassador",
          "Contenu": "Great service from my Brand Ambassador, Sharyl Rapavy, and I appreciate Forever's commitment to product quality and customer satisfaction. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T09:42:33.000Z",
          "Titre": "Quality of Holiday Cards was Top-Notch",
          "Contenu": "In ordering my holiday cards I sought help in how to download my photos and set up my card.  The order was processed quickly, shipped within a few days after ordering, and   I received the order in six days from the shipping date (I live in California).  My cards were beautiful and I know I’ll receive many compliments.  Thank you, Forever.  Everything was perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Juntunen",
          "Nb_Reviews": 5,
          "Date": "2023-12-11T01:57:55.000Z",
          "Titre": "Quick results!",
          "Contenu": "When I received my ornaments one of them was not printed correctly.  I notified my ambassador and she helped me figure out how to reorder.  I notified Customer Support and within 24 hours they had expedited my reorder so I will receive the ornament before Christmas.  There was no charge for the ornament or shipping.  Thanks so much to my ambassador and Customer Support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Canterbury",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:56:49.000Z",
          "Titre": "Our cards turned out beautiful",
          "Contenu": "Our cards turned out beautiful.  The paper and style looked great and felt nice too. The program was easy to use to get the right look I was going for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T01:57:09.000Z",
          "Titre": "Sandra Rocks",
          "Contenu": "Sandra, was very helpful in helping me choose the appropriate items.  When one of the pictures was too light, she redid it for free."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Leslie",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T20:54:40.000Z",
          "Titre": "Early Christmas!",
          "Contenu": "The people at your office were very helpful in helping me transfer all my programs and software over to my new computer.I created my new book in record time and am very happy with it.  It arrived in good time for Christmas."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cindy Jackman",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T19:54:40.000Z",
          "Titre": "Beautiful product",
          "Contenu": "The product I ordered was a 12x12 album. It shipped out quite quickly. It was packaged well. The album was made very well. The binding is solid and the pages are excellent quality."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Debbie",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T04:31:03.000Z",
          "Titre": "Beautiful calendars",
          "Contenu": "Love the quality of the calendars that I order every year. They also always arrive in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jane Perishocustomer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:07:08.000Z",
          "Titre": "Forever kept me informed",
          "Contenu": "All the materials needed to send in album pages were in the Digitization Box, along with detailed, step-by-step instructions. Similarly, all was returned in the way I’d packed it originally.I received emails during every step of the process. The estimated finish time was on target.I only wonder why the digitization itself has the pages out of order. I’m glad I had penciled each page’s number on the jeeping. I’ll need that to reassemble the albums efficiently. Those will then guide me to create Forever lay flat albums in Artisan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janess Pasinski",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:49:34.000Z",
          "Titre": "FOREVER hands down has the best client…",
          "Contenu": "FOREVER hands down has the best client support team of any company I've interacted with. They handle any question big or small with speed and efficiency!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T05:03:47.000Z",
          "Titre": "The People, The Product & A Plan!",
          "Contenu": "Tabitha who came as we struggled in our downsizing with BOXES of VIDEOS and PHOTOS/ALBUMS.  She had a product with a plan and took the time to make it easy for me to see how letting go of all these boxes could be not only freeing but allow the whole family access for years to come.  Now my Father has passed and I am talking this product and plan with my brother!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:47:48.000Z",
          "Titre": "I love my forever memory book!",
          "Contenu": "I worked with Debbie who was just great.  She was helpful, patient, and explained the process.    The memory book turned out great and I am so excited about sharing it with my family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kirk",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T18:01:07.000Z",
          "Titre": "I was easily able to create…personalized Christmas Cards.",
          "Contenu": "I was easily able to create personalized Christmas Cards. They were delivered promptly. I received great help from my representative, Amy, who guided the process. I am very pleased."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:37:07.000Z",
          "Titre": "My order was processed very quickly and…",
          "Contenu": "My order was processed very quickly and delivered with no damage. It even arrived 1 week early."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T08:24:28.000Z",
          "Titre": "Christmas cards",
          "Contenu": "My Creative Memories coach, Brandi Koehm, spent alot of time with me to help find a Christmas card that would accommodate the unusual size picture I had. The printing came out beautifully and I received the cards today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T16:14:41.000Z",
          "Titre": "Beautiful Pint  Job",
          "Contenu": "I ordered a metal print and it came out beautiful.  The colors were vibrant and print quality excellent."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kathy Clark",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T06:37:44.000Z",
          "Titre": "I am so lucky to have a great Ambassador !",
          "Contenu": "I just ordered the video streaming for life. My ambassador, Ann Ozdoba, is so thoughtful in letting me know when I should take advantage of good opportunities and she is so very helpful walking me through everything I have to do. I haven’t used the streaming yet, but I look forward to having it. Thanks, Ann!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anne Johnson-Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T04:42:38.000Z",
          "Titre": "The books",
          "Contenu": "The books, mugs, calendars, cards look wonderful. They have all arrived - last two items arrived today- 17 days before Christmas."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:30:28.000Z",
          "Titre": "I wish there was more help with coupon…",
          "Contenu": "I wish there was more help with coupon codes. I am a founding Forever club member and love how that is automatically added but I recently bought a 199 page album and got 50% off yet I didn’t realize there was a free shipping code. Upset about that.I raised this to five stars when Forever gave me free shipping. Excellent customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T00:12:13.000Z",
          "Titre": "I ordered with Forever Lorrie Curley…",
          "Contenu": "I ordered with Forever Lorrie Curley and  I highly recommend this business. Lorrie’s customer service is second to none. She helped put all the details together for my nonprofit holiday card. And the product quality was outstanding, exceeding my expectations. I will definitely order from her again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Donna Lien-Willcott",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T22:37:23.000Z",
          "Titre": "Order every year and never have an…",
          "Contenu": "Order every year and never have an issue. Everyone loves their calendars!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Judy",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T16:37:27.000Z",
          "Titre": "This company has the best support…",
          "Contenu": "This company has the best support system!  Whenever I have an issue, the staff are so knowledgeable and quick to help me solve my problem.  I have completed over 50 photobooks with them & they are all beautiful keep-sakes for our family!The quality is top-notch!Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan R.",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T22:11:21.000Z",
          "Titre": "Beautiful Christmas Cards",
          "Contenu": "Wow!  I just received my Christmas cards!  I did not choose any options other than pre-addressed envelopes.  They are stunning!  The printing is vivid and bright.  Thank you, forever, for the best cards that any of my family and friends will receive this year!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T18:04:34.000Z",
          "Titre": "Forever always goes above and beyond to…",
          "Contenu": "Forever always goes above and beyond to make the experience as best as it possibly can be.  They listen to the customer and their needs and try to make it right whenever they can.  The Best Customer Service ever.  Their products are great and their storage is the best ever because it is permanent and you own it, no other company out there that has this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol L",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T02:08:01.000Z",
          "Titre": "I used Forever to print my 2024…",
          "Contenu": "I used Forever to print my 2024 calendars and they were quick to print and ship and the quality is great."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Addie",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T05:27:52.000Z",
          "Titre": "The products arrived in a timely manner…",
          "Contenu": "The products arrived in a timely manner and in very good condition. The quality of the products are excellent and customer service very good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arlene",
          "Nb_Reviews": 3,
          "Date": "2023-11-26T21:23:05.000Z",
          "Titre": "Converting Slides to digital files.",
          "Contenu": "I love the Box Center where I can track my precious memories (slides) during the conversion process.  I love being able to view them and share them.  I love that they are automatically sent to my permanent account.  Knowing that family photos are saved and backed up gives me peace of mind.  Photo memories are priceless!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl and Joe",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T21:03:11.000Z",
          "Titre": "The software is simply fabulous and I…",
          "Contenu": "The software is simply fabulous and I have been using it for over 20+ years.  The IT support and staff are beyond knowledgeable.  It's scary working on all your life's memories and being able to trust this group to get it done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tabitha V",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:41:14.000Z",
          "Titre": "Amazing, as usual",
          "Contenu": "Amazing, as usual. My Christmas cards came much sooner than expected and they are beautiful. Such amazing quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeanne",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T21:16:23.000Z",
          "Titre": "I needed a lot of telephone help and…",
          "Contenu": "I needed a lot of telephone help and Ariel, Katie, and Laura were absolutely wonderful.I ordered the books on Sat Nov 18th and got a email on Tuesday four days later that the books were on their way. And they are beautiful. Thanks Forever, Ariel, Katie and Laura."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Rebhan",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:49:34.000Z",
          "Titre": "My order turned out great",
          "Contenu": "My order turned out great.  It arrived before the scheduled time which I really appreciate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie C.",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T20:05:15.000Z",
          "Titre": "High Quality Photo Cards",
          "Contenu": "My family Christmas photo cards are beautiful! The paper quality, even at the standard level, far surpasses other companies’. The envelopes are so thick and slightly textured. Recipients will not be able to see through them. The address printing option is fantastic, and looks so high end."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna G",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T02:11:29.000Z",
          "Titre": "Forever, try it, you'll like it!",
          "Contenu": "I have been searching for a while for a photo organization system & I think I have found it with Historian 6. The reviews were impressive but it was a personal recommendation from a fellow scrapbooker that tipped the scales. And the fact that my new ambassador turned out to be someone I've known \"forever\" (pun intended! 😁) helped a lot.She is GREAT as well as the CS technician who helped me with a software problem.  No pressure to purchase FOREVER storage, although I am quite confident I WILL be doing so in the near future. Thanks for being a great company.  👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie Esser Babcock",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T18:02:30.000Z",
          "Titre": "The process was so very easy",
          "Contenu": "The process was so very easy.  We can now view all of our old videos and pictures.  This brings back many fond memories for the whole family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Long-term Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:20:15.000Z",
          "Titre": "BEST DIGITAL EXPERIENCE EVER!",
          "Contenu": "This company is amazing. I have been with them from the very beginning. The Artisan scrapbooking software has almost no limits when creating pages and books. The Historian software is great for manipulating your pictures to improve and achieve the results one is looking for. The quality of their products, such as, mugs, ornaments, scrapbooks, etc. is beyond compare.I used the scrapbooking software long before it was acquired by Forever and have a library of books I have created over the years. While I believe, even in the early years before if was acquired by Forever, that the quality was good, there is no comparison to the quality today. Their service is amazing. When I have had questions, they have helped me work through them with patience. I have used email, the chat room and at times talked directly to the support team. They are very knowledgeable and helpful.Did I mention their online storage? It is worth every penny to buy it. I buy a little at a time. As I create my books, I load only those pictures into my storage. I use the best pictures in my books, they are the one I want to preserve for those that follow me.In my opinion, Forever is the BEST quality product on the market today. I tell everyone about Forever. If you are not utilizing their services, you may just be missing out on something you might find amazing as well.To clarify, I am NOT an ambassador for the company but believe whole heartedly in them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colleen Donovan",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T21:21:38.000Z",
          "Titre": "Great Company!",
          "Contenu": "Every person and every product earns five stars from me. Good advice is dispensed and everyone is knowledgeable, cordial, and helpful. Especially high marks to my ambassador, Lori Funden. She is the connection between the company and me. My understanding of the products and how to manipulate them to my advantage is significantly increased because of her. This ambassador idea you folks came up with is a top notch idea. It adds a lot of value to your product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T19:21:36.000Z",
          "Titre": "2024 calendars",
          "Contenu": "We received our order of 2024 calendars within a week of our order and the calendars look great!  Thank you, Forever!  I love using your program."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customerLouise",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:41:46.000Z",
          "Titre": "They know the answer to all my problems…",
          "Contenu": "They know the answer to all my problems and helped me to correct them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T02:04:46.000Z",
          "Titre": "My Ambassador got an A+!",
          "Contenu": "My Ambassador, Mary, was great. She helped me the entire design/layout and everything else related to my project. The result is a beautiful 20 x 30 canvas wrap!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T14:53:20.000Z",
          "Titre": "Photo preservation",
          "Contenu": "This is the company I use for all my memory preservation !  When doing my grandmother photos some over 100 years old, they were handled with care, took time to answer my questions and now all our family photos are preserved forever.  Now all those photos are easy to access for anyone in the family that needs to.   They also do beautiful photo books that are great quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff B.",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T04:18:19.000Z",
          "Titre": "JB Maine trip",
          "Contenu": "I always wanted to display family photos but I never found the appropriate format. Then my neighbor introduced me to the Forever Company. I was impressed after seeing some of the albums that she had expertly and artistically put together for other clients. I trusted her explicitly and she took my photos and visually told a story of our family trip to Maine this past Summer. I still enjoy reliving our trip every time I open the book. I look forward to putting another album together very soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T05:31:30.000Z",
          "Titre": "The personal service I receive is HUGE…",
          "Contenu": "The personal service I receive is HUGE for my experience. Having a number I can call to talk to a real person will make me keep coming back to FOREVER."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lola Halbert",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T14:19:28.000Z",
          "Titre": "I enjoy my memories as I download…",
          "Contenu": "I enjoy my memories as I download pictures and journal the experiences my pictures tell. The printing and completing my story is your job and it always comes out beyond my expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Heiden",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T20:21:36.000Z",
          "Titre": "A loyal customer for 14 years",
          "Contenu": "I have been using Forever for 14 years and love the experience.  I’ve made one or two books every year for my grandsons. They are very fast and have great discounts. A Happy Digital Girl!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebekah McGlamry customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:33:52.000Z",
          "Titre": "MGlynn Banks my Forever person",
          "Contenu": "My Forever person, Glynn Banks, is most talented.  She   was creative and helpful in producing our best Christmas card yet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ZCD",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:09:04.000Z",
          "Titre": "Awesome Customer Support",
          "Contenu": "After completing my project, I had an issue that required the assistance of customer support. I had the most awesome service from Lisa Lewis who answered my call. Not only did she help me, she followed up making sure I was completely satisfied and my self imposed problem was resolved. She is to be highly commended for her efforts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Resa Balyeat",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T06:02:40.000Z",
          "Titre": "Happy, affordable memories, …",
          "Contenu": "My creative memories consultant that I’ve known for 20 years told me about forever. It was easy to use an amazingly reasonably priced. I’m happy with it so far."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ethel Harris",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T17:38:16.000Z",
          "Titre": "Wonderful",
          "Contenu": "It was an interesting experience.  Wonderful that my friend, Mary Anne Ladner, walked me through everything.  The resulting album is perfect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miriam Spencer",
          "Nb_Reviews": 6,
          "Date": "2023-12-04T06:04:53.000Z",
          "Titre": "My representative made for a great…",
          "Contenu": "My representative made for a great experience. It was her knowledge, expertise and kind professionalism that drew me to take a look at this. Thank you Kelly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn D",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:56:04.000Z",
          "Titre": "My order arrived",
          "Contenu": "My order arrived, and the books were stunning!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T14:28:20.000Z",
          "Titre": "Shipping timely",
          "Contenu": "Shipping timely - was easy to create my projects and shipping took no time to get my items!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue Baracchini",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T05:38:56.000Z",
          "Titre": "The customer service team is top notch!",
          "Contenu": "The customer service team is exceptional. Everyone knows their stuff, no matter who replies to my emails or anyone that answers the phone. The staff is helpful, friendly and patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bonnie Space",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T16:52:58.000Z",
          "Titre": "Help Desk Heroes",
          "Contenu": "I submitted an order for 3 photo books, one for myself and two to be used for gifts. After I submitted my photo books for production, I noticed a very glaring error and the Help Desk was able to stop the production so that I could fix the problem and then they printed my books correctly. My ambassador, Gail Berzins, jumped into action to help correct the errors to my books. Everyone was invested in me getting a product that I can proudly give as Christmas gifts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Willett",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:03:26.000Z",
          "Titre": "The entire process from creating my…",
          "Contenu": "The entire process from creating my project to receiving in the mail was easy and fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorrie C",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T15:04:07.000Z",
          "Titre": "New foil cards gorgeous and easy",
          "Contenu": "I have done my holiday cards with FOREVER for many years now. As usual the process was easy and quick. The new foil cards are GORGEOUS and I love being able to change fonts/sizes of text boxes now. A huge bonus is being able to add my recipients mailing info printed on the envelopes. WOW, just amazing! The process was seamless and I know my family and friends will LOVE our cards!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T19:33:34.000Z",
          "Titre": "Best Cuustomer Service",
          "Contenu": "I have been a customer of Forever for awhile now. They have the best customer service I have ever had the pleasure to work with. They are constantly working to improve their products and services. If you want to keep your memories safe from old age as well as unknown people, Forever storage is the way to go. Yes it's costly. But they guarantee their storage for your life time and are constantly updating so that those memories will he accessible in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:58:08.000Z",
          "Titre": "The communication is excellent",
          "Contenu": "The communication is excellent, from start to finish, so that you know that your precious materials arrived safely, were handled with care, and that they were returned safely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie P.",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T21:28:07.000Z",
          "Titre": "Exceptional Service and Support",
          "Contenu": "I have always had exceptional interaction with Forever support.  They respond in a quick and timely manner and have always followed up to see if I was having any other issues.  They are always very professional and polite.  They are very knowledgeable and if it is something out of their expertise, they are always quick to say it is and they are following up with someone else who does have knowledge regarding that issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Art",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:04:09.000Z",
          "Titre": "Beautiful forevrr remembrance …",
          "Contenu": "My wife's anniversary year books were done extremely well. She died in November 2022. I was not aware of their existence until the annual memorial service. I bought 4, one for me and 3 as gifts for family members. Cant wait to the family members reactions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B Dixon",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:20:19.000Z",
          "Titre": "I purchased two gift certificates for my wife",
          "Contenu": "I purchased two gift certificates for Christmas.  They were easy to find and I could add a special message.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "EMartin",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T15:41:57.000Z",
          "Titre": "Gift giving made easy",
          "Contenu": "I am a Forever club member and make monthly payments into my account. I had set my daughter up with an account a few years ago and she wanted more storage for all her photos that are automatically uploaded from her phone through the Forever app. I had enough funds accumulated in my account to send her a gift of 25 GB. She is happy to have a safe place to store and view her photos and I like knowing her photos are safe for years to come. Great gift for teens!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:22:38.000Z",
          "Titre": "They always get me through my problems…",
          "Contenu": "They always get me through my problems and explain step by step what I (not too computer smart) need to do. That was over Thanksgiving Holiday and it was very prompt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betsy H.",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:34:39.000Z",
          "Titre": "Thank you Carol for making my Christmas…",
          "Contenu": "Thank you Carol for making my Christmas card order so easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tabitha O'Connor",
          "Nb_Reviews": 4,
          "Date": "2023-11-28T16:26:39.000Z",
          "Titre": "The foil cards are beautiful",
          "Contenu": "The foil cards are beautiful! The soft-touch laminate is definitely a special touch for the cards! Loved having the envelopes pre-printed with return and addressee addresses! To the post office in no time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeni M.",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T18:52:45.000Z",
          "Titre": "Besides the excellent quality of their…",
          "Contenu": "Besides the excellent quality of their products, FOREVER has the best client care team of any company out there!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stacy",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:50:41.000Z",
          "Titre": "Procedures are very clearly laid out…",
          "Contenu": "Procedures are very clearly laid out and easy to follow."
        }
      ]
    }
  ]
}