{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "gabb.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joel Smith",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T23:58:37.000Z",
          "Titre": "Triple check that they canceled your kids phone",
          "Contenu": "They will tell you that your account is cancelled and you will have a one time fee.  They never mentioned that to cancel, there’s another email you have to respond to to doubly confirm?  that you want to cancel.  Then they will just continue to bill you for mo the until you catch them.  Never heard of extra verification needed to Cancel a plan.  Solid scheme tho."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:46:46.000Z",
          "Titre": "Upgraded to a Gabb 3 watch a few months…",
          "Contenu": "Upgraded to a Gabb 3 watch a few months ago (had an original Gabb watch for 2 years prior) and had nothing but issues since. Can't get customer service to resolve the issues (I've spent literally hours on hold or waiting on chat for interaction). Emails and messages telling me to reset or update that doesn't fix any issues.Basically wasting time and money for a device that doesn't work and can't get timely or useful responses from the company. I can't even cancel my service since I can't speak with anyone! Extremely disappointed, I wouldn't recommend getting anything from Gabb unless it's been out for at least a year so they can resolve their technical issues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bobbie Townsend",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:58:05.000Z",
          "Titre": "Do not give your money to Gabb",
          "Contenu": "I left a review several weeks ago that was removed - not sure why. This company is the worst. We were sent a phone that didn't work weeks ago. Spent hours on the phone trying to \"troubleshoot\" the problem with this paperweight. When I posted a review here, Maggie called me and offered to send an upgraded phone at no charge and give me 3 months service. I guess that's their SOP to keep consumers on the hook. Maggie offered to make an appointment with us for set up. I replied twice to do that, no response. That should have been another warning. So now it's time to set up the phone (it's for my son who just got back). It does not work. Hours on the phone and it still does not work. Not having a working phone has been beyond inconvenient. The hours and hours spent on the phone with Gabb have been costly and frustrating. I recommend you avoid this company at all costs. There are others out there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bobbie Townsend",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T03:28:15.000Z",
          "Titre": "Do not give this company your money!",
          "Contenu": "Do not give this company your money! We have had this phone for almost 2 weeks and cannot get it to work. We have spent hours waiting for support, but they can do nothing. At this point I want them to release my son's phone number so he can go back to his old phone, but it seems they are holding it hostage. I want the number released and my money returned, but I fear I'm going to need to contact the Attorney General to report their immoral, unethical business practices!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donovan Family",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T04:13:46.000Z",
          "Titre": "**Gabb Wireless F rating w/BBB & pages of complaints**",
          "Contenu": "**Gabb Wireless has an F rating and pages and pages of unanswered complaints with the Better Business Bureau! Buyer BEWARE!** This company is very dishonest and their products are subpar. I have been a customer for several years. There are constant issues with pairing to the parent's Gabb app for accurate location information, the quiet settings during school don't work and my child keeps getting in trouble for his phone making noises when it's supposed to be silent. To make matters worse, I've had multiple technical issues with 2 different devices. They are not made to last, they are made to break so the company can collect ridiculous deductibles and monthly fees. Most recently, my son's phone wouldn't let him open his phone with his fingerprint or the correct password. Customer service is horrible. They don't post the number on the website to make it harder to get support - once you do get the number from the chat feature, be ready to be on hold for at least 45 minutes and then get hung up on. I finally got through after multiple attempts and the customer service rep told me we would have to do a factory reset. After going through that whole process, it caused the phone to start shutting down over and over. So I called with 1 issue and ended up with a worse problem! When I call back because the phone keeps shutting down, I'm told it'll have to be replaced and despite paying monthly for the extended warranty, I'll have to pay a deductible that is nearly the cost of the current price of the phone!! Mind you, I'm only having to replace it due to the new issue caused by the directions I was following from their customer service rep!! Outrageous! I tell them this is unacceptable and they said I could try talking to the billing department to see if they would adjust the fee. I wait on hold yet again. After finally talking to billing, they will not budge. I tell them that I shouldn't have to pay for a replacement on a phone that looks perfect - no visible damage at all - but is a terrible product that their tech dept made worse with their \"troubleshooting\" directions. I decided to file a complaint with the Better Business Bureau. In filing that complaint, I see that Gabb is not accredited by the BBB and it has PAGES AND PAGES of unanswered complaints with an F rating from BBB! Buyer Beware!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T02:03:31.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Horrible customer service. I sat on hold for over an hour before then being on the phone for another hour. The end “resolution” was unpairing my child’s device and repairing it. They failed to mention that all of his data and history would be deleted. He had done so well and earned points to get all the pets he had on his device and now he is in tears that everything is lost. Absolutely frustrated with how much we pay for Gabb and how incompetent their tech support and services are. It’s the customers and children who pay for the lack of competent tech support and services!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Grady",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T19:20:02.000Z",
          "Titre": "Cheap devices and unhelpful customer service",
          "Contenu": "Devices are cheaply made, software is buggy, and customer service is not helpful. Need I say more? Unfortunately, I opted for a 2-year contract which got me pretty much stuck with no options unless I wanted to pay the exorbitant termination fees. We bought 2 watches for our kids to be able to communicate with them when they are out and about and we have constant issues getting through to them or receiving calls back. Same for texts. Defeats the whole purpose of purchasing them in the first place. Not worth the hassle. Spend extra on an Apple Watch or flip phone!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SplatGuy",
          "Nb_Reviews": 3,
          "Date": "2023-10-16T20:41:24.000Z",
          "Titre": "From a former sufferer",
          "Contenu": "Gabb sucks a**. I got ostracized from my friend group. Unless you don't care about your child's social status, mental health, and general well-being, just get them an iPhone. You can't protect them forever. Good riddance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa Schmidt Brandstatter",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T22:13:11.000Z",
          "Titre": "The gps never works on the phone",
          "Contenu": "The gps never works on the phone.  I have called customer service and followed their directions but it only works temporarily then goes down again.  It has no features a kid would like and none that are useful to a parent.  I will likely be getting my child a different phone in spite of being locked into their contract because the cost of a new phone/plan is worth my child's safety."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesse Osbourne",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T23:33:29.000Z",
          "Titre": "We feel misled by the company",
          "Contenu": "We feel misled by the company. We canceled the service and missed the deadline to return the phone. We inquired if we could still receive the refund after missing the deadline and were told yes, so we sent it back. We checked on the refund and were told it was non-refundable after missing the deadline. If we had been told that initially, we would have kept the phone. Now they have the refund and the phone. Would not recommend dealing with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T20:52:39.000Z",
          "Titre": "I found it difficult to get an answer…",
          "Contenu": "I found it difficult to get an answer via chat so went to email and then back to chat. Then the wrong chargers were sent to me when offered to troubleshoot our charging issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rich A",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T20:36:44.000Z",
          "Titre": "Don't do it, save some mental capital!",
          "Contenu": "My daughters (7&9) were gifted watches for Christmas.  The battery life was frustrating and the watches were hardly used as a result.  They never created the habit of using and charging, so when they did think about it, most times charging was needed.      Then the cancellation process was just as bad, if not worse.  You have to submit a form for cancellation, you can't just ask for it.  Then a review process must take place.  In my case, an extra month of cost was the result."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T23:48:00.000Z",
          "Titre": "Find another alternative if you actually want to be able to use GPS",
          "Contenu": "We have had this service for over a year and it is horrible. It says it has GPS bull! The GPS has not worked on my sons for about a year. We connect customer service and we go through all the verification and they fix it and it works for a day then stops again. The last time it showed my sons location was Aug 11th (it only worked that day because they 'fixed' the issue) and before that it was May. I did all the things they suggest but it continues to give us issues with no real help from Gabb. Would never recommend this phone to anyone. This is just one of the issues with this phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tess Eddy",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T22:52:49.000Z",
          "Titre": "Wouldn't recommend",
          "Contenu": "We have had a Gabb phone for 3 months.  In that time we had to replace the phone because of \"water damage\" My son had it in his backpack and his water bottle in a different pocket leaked. I know phones don't say they are waterproof, but these are especially poor quality.  My iPhone is not as sensitive.  Also, we went on a vacation and we paid for my son to be able to send and receive photos.  When his phone died, he lost all his vacation pictures because apparently, we didn't pay another storage fee.  This company charges for everything but is not good at helping the customer understand the services.  We are locked into a 2-year contract, but I wish we could change that.  I thought this would be a good alternative to something that gets on the internet but I was wrong."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jodi Artzberger",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T17:35:39.000Z",
          "Titre": "They do not care about the safety of…",
          "Contenu": "They do not care about the safety of your child! The phones are not quality, you have NO control over the apps so if you want to take an app away as a consequence, you can in 6 weeks. Or take the whole phone away then you as a parent can worry about your child when you can't reach them or see where they are. It's funny how I can turn apps off of any other phone, but this one. Also, the GPS is not nearly as accurate as they say."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mom of a pre-teen",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T06:08:38.000Z",
          "Titre": "Unreliable data service",
          "Contenu": "Unreliable data service— and really, the whole point of a Gabb phone is to be able to get ahold of your child! My daughter’s device will show that she has data service (when she doesn’t but she has no idea), so she doesn’t know she’s not receiving our texts until she gets home from school and we ask her why she never responded. We restart the phone and magically all her texts from throughout the day will then arrive. But in the meantime we can’t get ahold of her! Their customer service has been beyond frustrating having us update apps, reset the device, they did a “network reset,” they sent us a new SIM card, they had us do a factory reset… and in between all of these steps we wait to see if it fixed the problem. Nope, not yet! And this has been going on for 6+ months. The software is buggy, too. Now that we’ve done their latest “fix” of the factory reset we can’t restore my daughter’s gabb cloud data back to her phone - even though when speaking with customer service today they were able to see her gabb cloud backup from this afternoon. Their solution was a software update that I had to wait 10-30 min for, and of course, it didn’t work. So now I have to call them again tomorrow and in the meantime my daughter has none of her contacts/data/pictures - nothing. I don’t know if I got a lemon of a device or what but customer service has been far less than helpful (even though they’re always very nice). I suggest you look at alternatives to Gabb."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lydia M.",
          "Nb_Reviews": 2,
          "Date": "2023-08-30T15:59:15.000Z",
          "Titre": "Just not ready for prime time",
          "Contenu": "This is my second time trying to get a Gabb phone to work for my children. The first time, I tried to port my 14yo from another provider and phone to Gabb's provider and phone. I tried their website and phone service, and I was never successful even with their CSR's help. I wasted about five hours of my time and the CSR's time. That was a month or two ago.The second time, I didn't even try to port a phone; I bought a Gabb phone for the 11yo who needs to carpool with his older siblings. I can't believe I tried again, but I got an ad saying the device was totally free, so I figured why not. I did actually receive a phone this time. The Gabb phone comes with lots (14!) of apps I don't want. I just want phone and text for safety and a GPS. I don't want the FM phone, video, etc. I tried to use chat support to ask how to remove these apps. Although it was before 7 pm Mountain time (when their customer service closes), their chat support was \"too busy\" to message. I emailed, and I got a response that I'd be replied to in 3-5 business days! For support! What's more, it's been five business days today, and I still haven't heard back from them! (And as far as I know, you can't delete these apps, which makes it 90% less kid-oriented than I wanted it to be.)Gabb may be great someday, but it's just not ready for prime time yet. In order to be a real phone service, you have to have real customer service. Edited on Aug 19 to add: Now the phone (which was free) won't charge. I think they probably knew there was something wrong with these phones, which is why they were free. I emailed them today to ask them what was up, and I got this email back: \"Thank you for reaching out! Your request has been received by our Gabb Experts. We aim to respond within 10 business days. We appreciate your patience.\" NOW THEY'RE UP TO 10 BUSINESS DAYS to reply to customer-service emails. INCREDIBLE.Edited on Aug 30 to add: After charging me for another month of service because they don't read their emails, I got an email saying that I would be charged $50 to \"restock\" my \"free\" phone that literally never charged. This is not to be believed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T17:11:31.000Z",
          "Titre": "We received two watches that did not…",
          "Contenu": "We received two watches that did not work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JEN",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T16:16:17.000Z",
          "Titre": "Data issues and poor GPS locating",
          "Contenu": "We are having constant problems with data on both of our children's phones as well as frequent issues with the GPS location services. I've spent lots of time chatting with customer service and done all sorts of things to get the phones working. Nothing lasts and we then have issues again shortly after. Plus we have had issues with backup after factory resets.  It's been a headache and I can't keep track of my kids with GPS and that's the hugest frustration. Our contract ends soon for one of our kids and we are going to try something else."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Francis Adjei",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:59:12.000Z",
          "Titre": "First experience with Chantelle through…was terrible she had little info on how to resolve my problem and felt she gave me miss leading  info",
          "Contenu": "First experience with Chantelle through the text app with support, terrible the second experience with Miss Stephany very good. She told me what I needed to do and was on point about the information. The online representative through text message didn’t know anything about the companies handling of warranty policy or how much the product even cost but told me I will have to pay it in full, quickly i called support and I was corrected by Miss Stephany and the problem was resolved"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "dbmo",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T17:07:40.000Z",
          "Titre": "Don't Give Up on the Phone, Learning Curve, Operator Malfunction. TA Lag Time",
          "Contenu": "The first go around with the phone TA was wonderful! Once the phone was activated we discovered these new issues. The location didn't work, and I was not able to see her contacts on my phone I have tied searching YouTube and online resources without success. If you have suggestions, please pass them on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T01:19:58.000Z",
          "Titre": "The customer service person was good",
          "Contenu": "The customer service person was good, but the company solution was terrible! Had to wipe the phone to get it to work again losing all of my kids stuff on it! That is terrible tech support!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "N.R. Noorlander",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T17:43:28.000Z",
          "Titre": "Unreliable GPS and frequent call dropping",
          "Contenu": "We had a Gabb phone for just over two years. The GPS tracking was invariably spotty, and the calls repeatedly dropped. My phone calls with my daughter usually happened in 30 second intervals between calling and having the call dropped. We worked with Gabb on these problems a number of times. Their suggestions revolved around restarting the phone, which seemed a bit odd, considering it would have to be restarted by a kid who wouldn't know the GPS isn't working, and who shouldn't have to repeatedly restart their phone in order to get through to us. We learned after the phone warranty was expired that they may have been willing to exchange our phone, but no one suggested this to us in the dozen customer service calls we put in until after the warranty was expired. We've cancelled our phone service with Gabb. We still have a watch service with them, as the watch has been more reliable.Update to this review: Gabb reached out about our experience, and tried to resolve the issue. They were apologetic, polite, and offered a small discount on the Gabb watch service we still maintain with them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T03:11:04.000Z",
          "Titre": "I am having issues with the location of…",
          "Contenu": "I am having issues with the location of my sons phone.  I call, they fix it, and then it quits working the next day.Also, I am disappointed in the emojis that are in his phone.  I feel that most parents who choose a Gabb phone do so to protect their kids from worldly issues.  My sons phone has gay emojis and when he tried to send a emoji of a guy and a girl it sent 2 guys.Other than these two issues I have loved the Gabb phone.  I have recommended it to several parents as well.  I love that I don’t have to worry about him spending too much time on his phone or being on social media."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elle",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T01:22:56.000Z",
          "Titre": "Factory reset help",
          "Contenu": "I had canceled our gab account because trying to get help and wait times were increasingly very long and then I would be disconnected. When I tried to call Lynn for some assistance. Today was a different story since we went with a different carrier I wanted to give the phone to a younger child from a different family in elementary school and the family was very grateful. The gentleman that helped me was fast, efficient patient and understanding he was exceptional, considering the lack of, good customer service while we were actual customers. I’m hoping that my friend will get the exceptional customer service that I received today."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T17:41:37.000Z",
          "Titre": "Good first phone",
          "Contenu": "We had a Gabb phone for about a year. Overall I was happy, especially knowing my son was not on social media and being able to see where he was in our neighborhood.  My son, though, said his phone glitched (froze) too often and the camera was not the best quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:03:29.000Z",
          "Titre": "Great Experience",
          "Contenu": "Maggie was knowledgeable, helpful, kind, and went out of her way to help me activate when she could have directed me to the website. She handled my activation with ease and answered all of my questions. Easily one of the kindest interactions I’ve had with a customer service agent in a long time. I hope who ever manages her sees this and acts accordingly, she’s great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bree",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:18:52.000Z",
          "Titre": "Frustrated at first but fantastic help in the end",
          "Contenu": "I was feeling especially frustrated with trying to get my daughters new GABB watch set up. I had had it for 2 months and exchanged emails back and forth with someone and it just wasn't getting resolved and yet, I was still paying the invoice even though we couldn't use it. Then someone else reached out and offered to call. She stayed with me on the phone as we set up the watch together and worked through all of the glitches and weird things happening. She credited me the months I had already paid for while being unable to use the watch. She also emailed me helpful links and articles to make sure I understood everything about my daughters new watch. I left that interaction feeling so much better and with a working watch! Fantastic follow through and help the second time around!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tia Knarr",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:19:07.000Z",
          "Titre": "Taylor E is the guy!",
          "Contenu": "Taylor E helped save me time and energy by answering all my questions over the phone. He was knowledgeable and patient with me! lol  I was quite pleased with the results of our call, as he enabled me to make choices on devices based on facts, all in time for Christmas!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon M.",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T16:29:20.000Z",
          "Titre": "Gabb customer service has been awesome",
          "Contenu": "Gabb customer service has been awesome. They helped me with upgrading my child’s watch to the Gabb three watch. I did experience technical difficulties with the new device and quickly called them for assistance. They Immediately sent out another watch. Their customer service is amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T19:14:09.000Z",
          "Titre": "Thorough customer service",
          "Contenu": "I didn’t have to wait long for my phone call to be answered. The problem resolution took awhile but customer service was thorough, kind and accommodating."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:07:52.000Z",
          "Titre": "Great tech support",
          "Contenu": "The tech guy I talked to was very polite and helpful. Got the problem figured out and fixed within a very reasonable amount of time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:15:11.000Z",
          "Titre": "The agent who helped me was extremely…",
          "Contenu": "The agent who helped me was extremely kind, patient, friendly, and thorough. I appreciated her being so nice and giving her time instead of rushing off the phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diana Olsen",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T23:04:39.000Z",
          "Titre": "Wonderful Technical Service Tech",
          "Contenu": "The technical service representative that I worked with was wonderful; she was kind, patient, and informative and went above and beyond to help me resolve my device issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T00:20:42.000Z",
          "Titre": "Understood the problem I was having",
          "Contenu": "Understood the problem I was having, worked with tech support to trouble-shoot problem and had it solved by the time I got home from picking my kids up from school. No technology is without its problems, but having support to fix issues relatively quickly is a plus!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heidi",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:40:58.000Z",
          "Titre": "Trouble connecting watch",
          "Contenu": "Rep did great at trouble shooting and then pulling in tech to dig deeper. There were issue with the online purchase from Amazon and the watch would not pair with the phone. I would suggest buying straight from GABB to avoid any unnecessary issues that can arise from buying from other resources."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerSuzanne Byrum",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:55:58.000Z",
          "Titre": "Great customer service",
          "Contenu": "Sara helped me set up 2 Gabb 3 watches and she was amazing! So patient and vey helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LuAnn VanBuskirk",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T21:24:44.000Z",
          "Titre": "Sara's help is what made my experience…",
          "Contenu": "Sara's help is what made my experience great!  5 star customer service.  Up until now... I've been getting very impatient and frustrated that our needs to get the Pro 3 up and running has gotten me so stretched since we received it a week ago last Friday.  She was attentive to send us out a replacement immediately and to fix my son's working phone so he can get music.  She was VERY patient and most professional.  Thank you Sara, you redeemed this horrible experience!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:47:15.000Z",
          "Titre": "great service.",
          "Contenu": "While one of the 2 issues persisted (and is now in the app developers hands) customer service went above and beyond to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T00:38:53.000Z",
          "Titre": "My whole family loves this company were…",
          "Contenu": "My whole family loves this company were really grateful for the service they provide and when I had a billing issue. They were there very patient and helpful. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Collin",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T02:38:39.000Z",
          "Titre": "Maggie was awesome",
          "Contenu": "Maggie was awesome. We had a very long and complicated issue, and she helped us through all of it with poise and humor and was a delight to work with. She and her team lead were diligent and got to the bottom of our issue after some time, and it was quite the relief. I appreciated her calm demeanor and humor, I wish more support folks whereas excellent as she was. She rocked!!!  If I have to contact Gabb support again, I am definitely asking for her."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:44:27.000Z",
          "Titre": "The sales representative was Amazing!",
          "Contenu": "The sales representative that worked with me was so sweet and cute she walked me through every detail. Never trying to up sale me on anything. It was refreshing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley Colby",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T08:17:46.000Z",
          "Titre": "Amazing Andrew",
          "Contenu": "When I first called I was extremely frustrated that I could not get my newly purchased watch to connect. Come to find out, it was a defective device, but when I didn’t know that I spoke to several reps. While they were all very polite and assisted to the best of their abilities, there was one shining star that went above and beyond, and that was Andrew. He made me feel like I was the most important customer, and was absolutely wonderful. Prior to connecting with him, I had been frustrated for several hours and was ready to cancel…he is 100% the reason I am still a Gabb customer, and I cannot praise him enough. He was kind, knowledgeable, funny, and made me feel like I was valued as Gabb customer. Thank you, Andrew!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samantha Weaver",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T22:24:59.000Z",
          "Titre": "Product not right for my family but great customer support from Ana.",
          "Contenu": "Ana was very patient and considerate of my issues with my Gabb device. I bought this phone to help my daughter become more efficient in time management and to give her a safe way to communicate with friends and family. Unfortunately, the Gabb phone will not work for us but Ana took the time to verify each avenue to troubleshoot my phone and provided me with amazing customer support. I wish there were more representatives like Ana. Thank you for your patience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "cLyn Thomasustomer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:08:20.000Z",
          "Titre": "The person I talked to today was…Rich",
          "Contenu": "The person I talked to today was extremely helpful and very patient!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Enyart",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T19:12:11.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "The customer service agent took time to hear and understand the issues I was having, and then worked with me and with his superiors as needed to resolve the issues.  When we got cut off or had to schedule another call, he was prompt about calling back and was dedicated to reaching a satisfactory resolution.  He was always kind, patient, and professional, but able to give explanations and instructions that were easy to understand and follow.  In my top five experiences with customer services, for sure!  Even my daughter said the agent was G.O.A.T."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JV",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T04:35:50.000Z",
          "Titre": "IT to the rescue!",
          "Contenu": "Although it was an easy fix I am glad IT support was patient with me teaching me how to maneuver my new gabb phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T05:13:11.000Z",
          "Titre": "The customer service was super awesome",
          "Contenu": "The customer service was super awesome! The agent was very patient and helpful clarifying the plans and upgrades, devices etc. I had several questions and all were answered thoughtfully and throughly even as more questions came up! I am so glad to have an alternative to an iPhone to give my kiddos!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAKCYN",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T01:31:42.000Z",
          "Titre": "Richard who apparently has only been…",
          "Contenu": "Richard who apparently has only been with your company for one full day on his own did a top kitchen job and was on the phone with us for over two hours. We have been experiencing issues with this company several times even prior to becoming clients but decided after doing research and thought after the last experience oh no what did we just do but I’m so glad that even thou there was a bump in the road with what we believe is a app issue our rep Richard, was the one with the help of his team leader truly was a great asset to your company. Way to go Gabb!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T23:08:02.000Z",
          "Titre": "After a bit of a frustrating experience…",
          "Contenu": "After a bit of a frustrating experience with a faulty watch and then being unsuccessful in pairing our new replacement device I was feeling hesitant to continue our Gabb service. I decided to call customer service one last time and was so pleasantly surprised by the quick, efficient, and pleasant manner in which our issue was resolved. My sons watch is now up and running and I am happy that my kids and I are getting the communication tech we need, and that Gabb is prepared and eager to provide the tech and support that their customers need.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:19:38.000Z",
          "Titre": "Agent was super nice and patient as she…",
          "Contenu": "Agent was super nice and patient as she helped me fix my daughter’s watch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T05:59:44.000Z",
          "Titre": "Customer service took care of my questions",
          "Contenu": "Customer service answered my questions and if he didn’t know the answer he found someone that did immediately.  Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristi",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T01:09:23.000Z",
          "Titre": "This company honors their discounts and…",
          "Contenu": "This company honors their discounts and word with quick response times. I love their product for my kids."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al Blosser",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T04:44:54.000Z",
          "Titre": "The Gabb 3 that we just purchased to replace a Gabb 2",
          "Contenu": "The Gabb 3 that we just purchased to replace a Gabb 2 because our 9 year old broke it. Not the watches fault. The gabb 3 has many improvements. The Gabb support team was exceptional.  American based support people who know their product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenna",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:54:48.000Z",
          "Titre": "Richard was extremely helpful and made…",
          "Contenu": "Richard was extremely helpful and made the whole process super easy!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alia Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T20:32:00.000Z",
          "Titre": "Jessica was very kind",
          "Contenu": "Jessica was very kind, professional, and helpful. She showed empathy and understanding to my situation and went above and beyond to assist. I am grateful for her service today and will continue to recommend Gabb to all of my fellow collogues and friends that are looking for phone services for their kids."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel Purchase",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T03:02:34.000Z",
          "Titre": "Taylor was super helpful and kind",
          "Contenu": "Taylor was super helpful and kind. Answered all my questions and was so patient untangling the situation at hand. I appreciate him so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taylor Hutchins",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T15:22:35.000Z",
          "Titre": "Fast Knowledgeable Service",
          "Contenu": "My experience was great to quickly order a replacement phone for my son. Options were quick and concise with product info shared to aid in my decisions of what to purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nakia Constant",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:30:25.000Z",
          "Titre": "Excellent CS Experience",
          "Contenu": "Sarah was so very friendly, patient & helpful. She resolved my problems to the best of her ability, sought help when she needed it, & assured me she'd reach out to me when bugs were resolved. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Griggs",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T04:57:45.000Z",
          "Titre": "The Gabb Watch 2 has been great",
          "Contenu": "The Gabb Watch 2 has been great for my kids. They sometimes need a soft reset, but customer support is always there to help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KA",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T13:39:27.000Z",
          "Titre": "Prompt response",
          "Contenu": "Prompt response. Helpful in navigating our issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T20:10:46.000Z",
          "Titre": "Jessica was the most amazing customer…",
          "Contenu": "Jessica was the most amazing customer service and Technical Support team member that I’ve ever had the privilege of interacting with, hands down. So refreshing to communicate with someone that loves her job and loves to help others!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Holly Wigton",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T20:24:02.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Service was very helpful and kind. All my questions were answered. I didn't feel rushed at all. She was very attentive and understanding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Casey rescinito",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T01:23:35.000Z",
          "Titre": "She was amazing",
          "Contenu": "She was amazing, very helpful, made me laugh and comfortable to trust. Amazing worker you have. Don't let her go!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Britton Kleinpeter",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T17:38:27.000Z",
          "Titre": "Awesome Job",
          "Contenu": "He was quick and decisive on what I needed. The hold time was 10x the solution time but that’s not on join, whatsoever. Great job!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Good customer NY",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T20:25:29.000Z",
          "Titre": "Stephanie is a tech support superstar!",
          "Contenu": "Stephanie provided expert tech support that quickly resolved my daughter’s issue with the new Gabb Messenger app. Thanks to Stephanie’s help, we could open the messenger app and send and receive texts once again. She was friendly and supportive, and had us do several tests to make sure the phone functioned properly before ending our call. She is superlative! Thank you, Stephanie!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T07:41:28.000Z",
          "Titre": "Steve saved the day!",
          "Contenu": "I experienced back and forth email communication regarding an issue with reception since June with gabb customer service. While each interaction was polite, every email I sent was responded to by a different representative. This created a very long, drawn out and failed resolution to the initial problem. I believe Gabb could resolve this issue by assigning cases to specific representatives so it is a seamless interaction from start to end. I finally decided to call today, as a last ditch effort, before canceling my service. I spoke with Steve, who spent almost an hour on the phone with me, reading through every email and updating himself on the situation. He knew exactly what needed to be done, and went above and beyond to ensure that I was properly taken care of. He was empathic, supportive and knowledgeable. He ensured that the situation was resolved before we hung up the phone. He emailed confirmation of what was done. Speaking to him was relieving, after feeling hopeless! Steve is the reason I am still a Gabb customer today, and I hope to encounter more representatives with his demeanor and capability in the future with Gabb."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kendall De Pasquale",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T00:58:14.000Z",
          "Titre": "Pleasant",
          "Contenu": "My experience over the phone has always been pleasant. Gabb has always gone over expectations!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T22:09:07.000Z",
          "Titre": "Great customer service",
          "Contenu": "Everyone I have spoken to at Gabb has been extremely helpful and very patient guiding me through technical issues. This company delivers great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Whitney",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T01:12:30.000Z",
          "Titre": "followed up promptly",
          "Contenu": "Thank you for following up with me and helping me activate the new line!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adele",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T03:53:15.000Z",
          "Titre": "Top customer service!",
          "Contenu": "Kelsey was superub! She helped to resolve my phone problem for close to 2 hours. She was patient with me & so kind. I would love to have her be my contact whenever I need to call gabb."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:45:57.000Z",
          "Titre": "Richard was awesome and so helpful",
          "Contenu": "Richard was awesome and so helpful. He is the only one that stayed with our tech problems until they were finished"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhonda",
          "Nb_Reviews": 3,
          "Date": "2023-07-16T10:08:17.000Z",
          "Titre": "We love, love , love our Gabb phone",
          "Contenu": "We absolutely love our Gabb phone! We not only have service everywhere we have needed it, but I can breath a sigh of relief knowing my kids have a phone for emergencies but not all the craziness of the internet and social media. Plus I love that Gabb will give me updates on their usage and healthy reminders. What a wonderful option! Can’t say enough about it! I recommend this phone to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T22:02:12.000Z",
          "Titre": "Outstanding Service!!",
          "Contenu": "The customer support I received was exceptional!!! I apologize I’ve forgotten the support staff’s name (started with a C), but he went above and beyond the expectations of good service by following up after our phone call with an email, after double checking with the shipping department that the shipping address was correct and that the issue was a glitch. Job well done!! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. Grimm",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T20:41:28.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "My issue was addressed by a very polite, and competent representative. The matter was resolved by using a different e - mail address, as my primary e - mail would not pass through a confirmation request to verify my account. Therefore the problem was on my end, and I can work on resolving that. The device works excellent. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T20:58:49.000Z",
          "Titre": "The Gabb watch = peace of mind",
          "Contenu": "The Gabb watch has made my life much easier knowing I can send my child off to play outside or go to extra curricular activities while I manage with other kids at home. The peace of mind is worth it knowing I can see where my child is and contact them or they contact me whenever necessary."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BookBub User",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T06:24:18.000Z",
          "Titre": "At first I was very frustrated but…",
          "Contenu": "At first I was very frustrated but after I was able to talk to an actual person on the phone and not via chat it was soooo much better. I got the help I needed and I am very happy and appreciate the time taken to make sure the problem was resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan E",
          "Nb_Reviews": 4,
          "Date": "2023-06-20T20:55:57.000Z",
          "Titre": "Technology is a mystery to me",
          "Contenu": "Technology is a mystery to me. I contacted Tech support by phone and had an extremely patient and helpful tech guy! I have lost his name but I hope he sees this and knows who he is… he spent over and hour walking me through several issues! Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T23:06:05.000Z",
          "Titre": "The representative was very well aware…",
          "Contenu": "The representative was very well aware of our problem and took care of it in three steps.He also gave us a $25.00 credit for the frustration of having the app problem for several days and others could not figure it out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Pyle",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T19:28:43.000Z",
          "Titre": "The customer service technician took…",
          "Contenu": "The customer service technician took his time to make sure I understood everything before letting me go. They always go the extra mile, which we really appreciate! I highly recommend using them for your kids devices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carla AM",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T18:11:17.000Z",
          "Titre": "Richard was very patient and helpful",
          "Contenu": "Richard was very patient and helpful, it took a couple of phone calls but we've gotten the problem solved. Thanks Richard 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T01:15:18.000Z",
          "Titre": "The phone I bought for my kiddo wasn't…",
          "Contenu": "The phone I bought for my kiddo wasn't working at first. I needed some help setting it up and called tech support. My technician, Steve, was super helpful and went above and beyond to resolve my issues. Once we got the phone working, it is PERFECT. Exactly what I wanted for my tween."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Davis",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T01:00:46.000Z",
          "Titre": "Every rep is top notch",
          "Contenu": "Every rep is top notch, easy to go talk to, able to be if help, and understanding of the issues!! I never have to catch the new rep up in my situation because excellent notes were left by the previous rep!!! Well done, Gabb!!! 💯 on customer service!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Courtney Pickett",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T23:59:19.000Z",
          "Titre": "very prompt and helpful...know will receive help with new phone if needed after setup",
          "Contenu": "My sons phone was stolen, refund received for month charged and discount on new phone...love Gabb phone services and look forward to further service. I had issues with tracking, like my sons phone was ALWAYS at his school, even when he wasnt! Hoping with the new phone , this will not be an issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:08:23.000Z",
          "Titre": "Customer support was helpful and took…",
          "Contenu": "Customer support was helpful and took the time to address and solve my issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T21:59:00.000Z",
          "Titre": "Very polite and helpful",
          "Contenu": "Very polite and helpful. Made sure I knew exactly what he was trying every step of the way"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica",
          "Nb_Reviews": 5,
          "Date": "2023-06-18T00:42:34.000Z",
          "Titre": "My customer service enquiry was amazing…",
          "Contenu": "My customer service enquiry was amazing today! I was on the phone with an agent for an hour, getting one-on-one help to resolve our connectivity issues. The agent was patient and cheerful and encouraging."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:27:08.000Z",
          "Titre": "Cameron was very kind and knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Genna",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T23:29:29.000Z",
          "Titre": "Best service",
          "Contenu": "My customer service agent was clear, concise, and helpful. He walked me thru setting up a new Gabb watch with patience and thorough instructions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T02:15:25.000Z",
          "Titre": "Stephanie was amazing",
          "Contenu": "Stephanie was amazing. Very prompt understood and heard my needs and was quick to finalize my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samantha",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T22:00:17.000Z",
          "Titre": "Excellent!",
          "Contenu": "After lots of confusion with other agents, the last one I spoke with was amazing and I was able to complete my transaction very easily.  She was kind, courteous, and understanding!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin Rossel",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T01:22:39.000Z",
          "Titre": "Just got off a chat to resolve some…",
          "Contenu": "Just got off a chat to resolve some issues and customer service (Bob) was awesome. Was thinking about switching but with the service I just got, I'll stick around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenna",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T19:49:46.000Z",
          "Titre": "Charlie was beyond helpful",
          "Contenu": "Charlie was beyond helpful. He navigated a kind of confusing situation seamlessly and walked me through what he was doing every step of the way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elocaria",
          "Nb_Reviews": 2,
          "Date": "2023-06-26T22:21:47.000Z",
          "Titre": "Amazing customer service!",
          "Contenu": "Whenever I call Gabb customer service, I am always greeted by a person, an actual person!  One that is friendly, helpful and efficient.  My issue/problem always gets resolved on the phone and the customer service representative always suggests I check to make sure things are resolved before hanging up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T00:44:23.000Z",
          "Titre": "Very friendly",
          "Contenu": "Very friendly, helpful, and professional customer service  representative who fixed my problems and called me back to make sure everything was working well. Thank you for the great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T18:32:48.000Z",
          "Titre": "Jessica was so helpful",
          "Contenu": "Jessica was so helpful. She answered the phone quickly and was so helpful and accommodating."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie kuch",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T23:22:09.000Z",
          "Titre": "I’ve probably never had a better…",
          "Contenu": "I’ve probably never had a better customer service experience. Jackson seemed more like a family friend than a gabb representative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T22:28:46.000Z",
          "Titre": "Watch replacement",
          "Contenu": "My son broke the face on his watch and I called Gabb customer service to discuss options for a replacement watch. The representative I spoke with was very helpful and made ordering a replacement very easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T15:45:16.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "The employee I spoke with was very polite, helpful, and had a sense of humor throughout the phone call. I was very impressed after speaking with her."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meg H",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T16:38:37.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Our customer service rep was very kind. He gave clear and simple instructions and got our issue worked out quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T02:25:29.000Z",
          "Titre": "My daughter broke her phone",
          "Contenu": "My daughter broke her phone, gabb was very understanding and sent her a new one for the price of the new activation fee."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T20:41:19.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service! I was accidentally disconnected from the first helpful representative. When I called back, the next representative was able to pick up right where the first left off and helped me complete my transaction"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T18:01:52.000Z",
          "Titre": "Supportive Tech Support",
          "Contenu": "Supportive Tech Support. I appreciated the authentic interactions with tech support. I felt like they cared about my situation and did their best to help find a resolution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angie",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T22:35:40.000Z",
          "Titre": "Thank you, Keaton!",
          "Contenu": "My son’s phone has not been working for two weeks. Very frustrating. Keaton was so helpful today! He was on the phone for over an hour with us to resolve the issue. He should be promoted! Thank you!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kat C.",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T23:18:28.000Z",
          "Titre": "Gabb Support is very helpful",
          "Contenu": "Gabb Support is very helpful! They are patient, very kind with their words and want to fix the problems if you incur any."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:30:16.000Z",
          "Titre": "Quick response",
          "Contenu": "Quick response, very friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T21:13:20.000Z",
          "Titre": "Great customer service",
          "Contenu": "Always has great customer service.Quick and efficient help with any problems I have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T. Wiley",
          "Nb_Reviews": 4,
          "Date": "2023-07-01T01:15:53.000Z",
          "Titre": "GABB has GREAT customer service",
          "Contenu": "GABB has GREAT customer service!  No matter my questions, they are always helpful, understanding and kind!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Missi Firth",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T18:05:51.000Z",
          "Titre": "Helpful and patient",
          "Contenu": "Helpful and patient. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T22:26:01.000Z",
          "Titre": "Amazing support",
          "Contenu": "Amazing support, efficient in their efforts and problem solving! We love this company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T20:18:13.000Z",
          "Titre": "The lady on the phone was extremely…",
          "Contenu": "The lady on the phone was extremely professional and very helpful. She was also very very nice!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T01:00:40.000Z",
          "Titre": "The person who I spoke with was amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T00:36:25.000Z",
          "Titre": "Gabb was great",
          "Contenu": "Gabb was great!  They were friendly and fast to help me solve my problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T04:14:00.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. She was wonderful to talk to. Very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T02:15:44.000Z",
          "Titre": "Easy to work with and gave me the…",
          "Contenu": "Easy to work with and gave me the correct answers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T03:22:28.000Z",
          "Titre": "The rep was so helpful and patient with…",
          "Contenu": "The rep was so helpful and patient with me as I searched for something. She waited and didn’t make me feel rushed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T19:47:31.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! Fast and she spoke English!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Biondi",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T22:51:03.000Z",
          "Titre": "Rosie was thorough",
          "Contenu": "Rosie was thorough, helpful and kind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T03:11:50.000Z",
          "Titre": "Janessa was awesome and took all the…",
          "Contenu": "Janessa was awesome and took all the time we needed to fix our problem!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:14:24.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service! Like truly awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MELISSA J",
          "Nb_Reviews": 2,
          "Date": "2023-06-17T04:03:19.000Z",
          "Titre": "They listened...",
          "Contenu": "They listened to the issue I was having and were helpful! We love Gabb!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mihnea",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T02:59:18.000Z",
          "Titre": "The agent was amazing",
          "Contenu": "The agent was amazing. Super kind and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T18:52:58.000Z",
          "Titre": "Excellent knowledge",
          "Contenu": "Excellent knowledge, patience, demeanor, and problem-solving skills. Loved the experience!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K Souza",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T18:56:37.000Z",
          "Titre": "Quick and  awesome"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T12:39:00.000Z",
          "Titre": "Shawn and Vanessa were both very…",
          "Contenu": "Shawn and Vanessa were both very helpful and pleasant"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rochelle",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T16:29:31.000Z",
          "Titre": "I don’t normally leave reviews",
          "Contenu": "No wait time, Very helpful, quick resolve."
        }
      ]
    }
  ]
}