{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "gamertech.shop",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David B",
          "Nb_Reviews": 5,
          "Date": "2023-12-01T23:44:24.000Z",
          "Titre": "Well I order 2 separate order for…",
          "Contenu": "Well I order 2 separate order for Samsung nvme drive 1tb, they had them priced for 49.99 ,from 79.99, I purchased 3 total , 2 in the first order,  1 in 2nd order, recieved a email at 10:40am saying \"Hello David,Apologies--we had to cancel your order as there was a pricing error on that item.Mike, FounderGamertech.shop\" Now I personally own my own business and and constantly quoting jobs for my customers,  and yes I have made mistakes before, and have to own them.. I have never screwed the customer because of my mistake,  I had a lot of respect for this company before, so much so that when a psu i ordered from them came in and was left in a hell of a rainstorm buy the delivery company, so they( gamertech) did a insurance claim on it for me and I ask them to out the refund it on gift cards cause I knew I would shop here again. So not only was my power supply ruined, my money refund went to them\"per my request\"  that is what these purchases were actually made with. But now they have nothing I needed except those above listed items, so now they get to keep my refund money,  and won't let me spend ,even if it was there mistake.. just saying think wiser than I did and choose who you shop with , maybe a bigger company that honors their mistake is the way to go. Hopefully someone can learn from my mistakes on who to shop with.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeannine Leger",
          "Nb_Reviews": 5,
          "Date": "2023-09-10T21:20:06.000Z",
          "Titre": "Within hours of this purchase being…",
          "Contenu": "Within hours of this purchase being made online, I reported to you that this was a fraudulent purchase using my hacked PayPal/ checking account. Not only did I receive zero response from your Customer Service, but you continued to fill the order. Luckily, PayPal isn't charging me, not sure who will be paying the bill, but in my opinion, it should be you for your lack of response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KJThaDon",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T18:05:11.000Z",
          "Titre": "No communication at a regarding a…",
          "Contenu": "No communication at all regarding a potential order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dom N.",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T18:35:02.000Z",
          "Titre": "The wrong item was shipped",
          "Contenu": "The wrong item was shipped, and this item won’t work with my device, so I’m not able to build my system at the moment without a lot of inconvenience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 3,
          "Date": "2022-03-09T14:51:07.000Z",
          "Titre": "Scam Shop",
          "Contenu": "Asking for 300$ for a pc case when it only costs 180. What a scalping scam. Not even a authorized dealer hence a scalping store. Avoid."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WD",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T17:53:33.000Z",
          "Titre": "Only got 1 of the 2 things I ordered",
          "Contenu": "Only got 1 of the 2 things I ordered. I got a refund but it took awhile to figure out that the other one wasnt even coming because they dont ship things themselves."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jacob nelder",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T16:57:33.000Z",
          "Titre": "The shipping service is horrible",
          "Contenu": "The shipping service is horrible. Said they \"knocked on my door\" and \"left me a notice\" but I sit right next to my front door while I work and no one ever knocked and there was no notice left. I can't cancel my order. And now it says that it \"has been delivered to a postal office\" it doesn't even tell me which one. And now I have to wait until January 24th. Which is almost a whole month after purchase. To get it refunded. The site had no problems, just the shipping service is horrible. This was a 1 star review but the customer service has been quick and very helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Todd",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T20:53:11.000Z",
          "Titre": "Happy, but...",
          "Contenu": "Placed an order for a power supply listed as ATX 3.0, but it's not.  It did have the new 12 pin connector that I wanted, so it works fine.  Also ordered 4 fans.  Everything arrived in about one week in perfect, new condition, so I'm happy.  I ordered these items at about midnight, and then sent an email early the next morning asking if they could add a strimer to my order - the shipping cost would have gone from about $18. to about $18.50.  My email was never answered, and the original items were sent.  So now if I order the strimer, the shipping cost is over $15.  I screwed up, but to this day, a couple of weeks later, they never answered my email.  I'll eventually get the strimer on Amazon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mitch Collins",
          "Nb_Reviews": 3,
          "Date": "2023-09-03T07:21:18.000Z",
          "Titre": "Could have be shipped out faster",
          "Contenu": "Took a few days to ship and at the time of writing I have yet to receive the packageBut they did refund me some of the amount"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T02:17:57.000Z",
          "Titre": "Tardy delivery but solid small business",
          "Contenu": "Was super excited to see a store other than Newegg have the product I wanted. Pre ordered the new LL infinity fans. The shipping date gets pushed back a week because of a port issue- understandable. Shipping gets pushed back another week, no explanation- kind of a bummer. This business is a good alternative if you don’t want to support Newegg."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T13:24:03.000Z",
          "Titre": "Small business.",
          "Contenu": "Originally it seems like a really sketchy store. But it's just a small business doing small business things. Clearly putting customers first."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ayven Lewis",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T06:47:10.000Z",
          "Titre": "Awesome!",
          "Contenu": "A few problems occurred while checking out. I used PayPal and it tried to make me pay twice. Which is not his fault. Will be back! small business that seems sketchy but it is actually awesome!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Crypto Alex En Español",
          "Nb_Reviews": 1,
          "Date": "2022-07-10T06:01:12.000Z",
          "Titre": "Wrong color sent but refunded",
          "Contenu": "Update (They ended up refunding the amount of the case that was sent incorrectly (Wrong color). Thanks for the refund."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicholas Terry",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T04:40:03.000Z",
          "Titre": "Great prices and fast delivery!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Conner",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T22:15:22.000Z",
          "Titre": "Good deal on the fans I ordered",
          "Contenu": "Made a mistake ordering the wrong product and they got it cancelled for me quick and re ordered the correct product and got it super quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:30:27.000Z",
          "Titre": "Really easy to find my way around the…",
          "Contenu": "Really easy to find my way around the store and the prices are pretty competitive. Quick with shipping too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Whatley",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T00:16:32.000Z",
          "Titre": "Great Experience!",
          "Contenu": "Ordered on Wednesday and received it on Saturday. I will be purchasing more from them. Great communication from them from the time I placed my order all the way through delivery confirmation. The items were well-packed...not like other places that throw a small package in a larger box with no padding. More online retailers should be like GamerTech!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T20:42:46.000Z",
          "Titre": "Great price and efficient shipping",
          "Contenu": "Great price and efficient shipping. No complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Russell",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T23:04:13.000Z",
          "Titre": "Top quality prices and products.",
          "Contenu": "Prices are better than anyone else i found for Lian Li products, i ordered infinity fans and strimer cables. My order was confirmed and shipped only 20 minutes after placing it. All items were correct and arrived quick. Would absolutely reccomend this site for pc parts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lukas Oswald",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T23:18:06.000Z",
          "Titre": "Hard to find products - reliably",
          "Contenu": "After searching high and low for the Lian Li Infinity Reverse fans I finally stumbled across Gamertech. I needed them in a pinch in order to avoid needing to re-build the system down the line with the proper fans. They shipped quick, were responsive to questions, and we’re even willing to work with me to expedite shipping. The one thing I regret is not ordering more components from them. Cheers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Stanton",
          "Nb_Reviews": 3,
          "Date": "2023-08-18T01:42:14.000Z",
          "Titre": "Actually",
          "Contenu": "Actually, I was so happy I sought out TrustPilot. \"Anything higher than 5 stars? Order for an ARCTIC Liquid Freezer II 360 was placed Thurs. morning, shipped Thurs. afternoon, on my step Sat. afternoon. Good notifications. Box was factory sealed top and bottom. Price with shipping was less than Amazon. Sticker on the box says it's a B Rev. 7, which appears to be the current version. Packing was good, using no plastic.\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Stanton",
          "Nb_Reviews": 3,
          "Date": "2023-08-13T23:34:47.000Z",
          "Titre": "Anything higher than 5 stars",
          "Contenu": "Anything higher than 5 stars? Order for an ARCTIC Liquid Freezer II 360 was placed Thurs. morning, shipped Thurs. afternoon, on my step Sat. afternoon. Good notifications. Box was factory sealed top and bottom. Price with shipping was less than Amazon. Sticker on the box says it's a B Rev. 7, which appears to be the current version. Packing was good, using no plastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sal",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T22:02:05.000Z",
          "Titre": "Great deals best products",
          "Contenu": "First I just wanna say this is my first time I heard of GamerTech and took a risk buying from them you know how it is with online vendors when you see a good deal is a risk you might get scam. So let me just say this website is legit the prices they have are good compared to Other vendors and there shipping is quick I got my stuff quick and well packaged thats a plus+ so my purchase where - lian li galahad II performance AIO- lian unifan Sli v2 set of 7- lian li side kit rgb fan adapter And they came well packaged and they all work perfect I will continue to buy from them for the great price and well packaged as well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noah",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T15:54:44.000Z",
          "Titre": "I read a few bad reviews about scams…",
          "Contenu": "I read a few bad reviews about scams and stuff like that…..I was skeptical myself and to be honest got pretty scared myself since I spent over $200 and Lian Li fans but they were professional and answered my questions and I got my fans on the exact date as promised and they even threw in stickers! Will definitely order from them again. 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LongLost Coder",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T03:01:15.000Z",
          "Titre": "Customer service beyond reproach",
          "Contenu": "Customer service was astounding. I have never built a PC before. And this gentleman not only gave me sound advice about the product, but then proceeded to help me understand his suggestions. The customer service here is beyond reproach."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Rannow",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T19:40:44.000Z",
          "Titre": "Top notch experience! Ultra spec custom pc is amazing!",
          "Contenu": "Mike took the time to understand my needs and to educate me while discussing tradeoffs since I’m newer to custom build pcs. We arrived at very capable specs for a fair price.Fast build time, efficient testing, and pre-setup support. Fast shipping and secure packaging. Thanks to him, I’m currently enjoying Diablo 4 on ultra specs. Absolutely no issues. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Huynh",
          "Nb_Reviews": 2,
          "Date": "2022-12-22T10:12:30.000Z",
          "Titre": "Legit shop that does look suspicious",
          "Contenu": "Legit shop that does look suspicious, but you'll get what you buy with fast shipping and fair prices. I purchased a 13th gen intel and got it new and sealed.EDIT: Answer to reply: at a glance it just looks like those numerous hardware scam sites that only appear when searching new tech. Went to check the site history and eventually reddit presence first before considering this business is likely safe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James S.",
          "Nb_Reviews": 4,
          "Date": "2023-10-24T00:30:35.000Z",
          "Titre": "Lian Li Evo XL Black case",
          "Contenu": "Ordered a Lian Li Evo XL Black case, one of the few stores that had one in stock. It was shipped promptly and arrived in great shape, very smooth experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Goeke",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T02:47:09.000Z",
          "Titre": "The owner rocks",
          "Contenu": "The owner rocks! He went above and beyond to source the products I was looking for. Packaging was second to none and speed of delivery was on par with Amazon back in the old days!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spencer Wilkinson",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T07:59:19.000Z",
          "Titre": "Order a Lian-Li Fan Cable",
          "Contenu": "Ordered a Lian-Li Fan Cable. Initially received incorrect cable, however this was immediately corrected by customer service without any hassle on my end. Product works great! Would definitely purchase from here again as needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2023-04-22T19:11:51.000Z",
          "Titre": "Good shopping experience!",
          "Contenu": "I was skeptical about purchasing here because I had never heard of this shop but decided to give them a try. Picked up an Arctic Liquid Freezer 360 from GamerTech as I was unable to locate one anywhere else that didn’t have reseller juice. Price was fair, shipping was fast, wished it was free, but it’s not free for them either. Overall good experience. Would shop here again. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David B",
          "Nb_Reviews": 5,
          "Date": "2023-06-05T00:57:04.000Z",
          "Titre": "Absolutely helpful",
          "Contenu": "Absolutely helpful. I made order mistakes they swapped items to correct, only issue I could say is they need the inventory pumped back up. Highly recommend. I will definitely be shopping with again. I have completed 3 orders to date. Thank you. GAMERTECH.SHOP"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon King",
          "Nb_Reviews": 3,
          "Date": "2023-09-10T01:43:26.000Z",
          "Titre": "Pricing and availability 4th time buyer",
          "Contenu": "Pricing and availability  unmatched and unbeat normally I put shipping in there as I order and it shows up 2 days later from the east coast but unfortunately usps has dropped the ball on this one I use them for all my lian Li needs and I recommend gamertech to absolutely everyone happy building everyone !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ctb",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T02:54:26.000Z",
          "Titre": "White Asus ROG Strix 4080 OC In Stock",
          "Contenu": "I was completely shocked to find the following site and that they had an Asus ROG Strix 4080 OC White Edition In Stock.  I quickly purchased it as these are pretty hard to find.  The checkout process was quick and painless.  Email order status updates were very prompt and the product arrived quicker than expected. Product Quality upon receiving it was packaged very well and exactly what I ordered.  Thank you for the great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David B",
          "Nb_Reviews": 5,
          "Date": "2023-06-16T07:53:56.000Z",
          "Titre": "HIGHLY RECOMMENDED",
          "Contenu": "I can't recommend this company enough,  I sound like a fan boy , well cause' I am, super helpful, super friendly service,  \"well text box lol\", couldn't hear them making fun of my questions, but they definitely answered them all.. only complaint,  I would have is they need a bigger store for more items....,   buy lots from them all folks,  help them get that bigger store.. thank you guys/gals for ask the help. Oh YEAH super fast shipping also.. like seriously,  I'm in Florida  And they ship from michigan.  2 days 3 max, awesome awesome,  hope this helps someone shop with confidence with these folks.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie Lowry",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T21:13:17.000Z",
          "Titre": "Best Customer Service Ever",
          "Contenu": "Words can't express how impressed I have been with the patience and guidance by Mike at Gamertech. He guided me throughout the process of buying components for my son's build.  Personal and professional, kind and knowledgeable--Gamertech will always be my go-to for the many needs I expect we will have for years to come.UPDATE:  My son assembled the computer by the end of Boxing Day and all has gone so well.  He is thrilled.  THANKS AGAIN!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrian Cuevas",
          "Nb_Reviews": 6,
          "Date": "2022-12-20T17:54:02.000Z",
          "Titre": "Gamertech has outstanding customer service",
          "Contenu": "I just bought a 4090 gaming OC from Gamertech, super fast shipping my GPU arrived earlier than expected! They E-mailed me thanking me for my purchase and opened a line of communication if I had any questions or comments to reach out to them, so I asked if they’ll be selling the new uni fan sl120 V2 and I got a response back same day!! I won’t tell you what they said cuz I want to be the one of the first to purchase the fans from Gamertech😉"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David B",
          "Nb_Reviews": 5,
          "Date": "2023-06-09T06:32:33.000Z",
          "Titre": "Once again I absolutely love this…",
          "Contenu": "Once again I absolutely love this store, customer service, expedient shipping ( literally ill get a notice 60 min or less I would say, text\"your order has shipped\"...) love it\",,, I said I'd be shopping here again, true to my word, i spent another 3 or so on my sons graduation gifts. And everything will be here tomorrow.. Thank you all again. I'm sure I'll be back..  my son and I are already talking about the next one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrian Cuevas",
          "Nb_Reviews": 6,
          "Date": "2022-12-01T20:12:29.000Z",
          "Titre": "Best shop for all your needs!",
          "Contenu": "I emailed asking for assistance with placing an order and I received a quick response with clear and accurate answer. I placed an order for SL infinity fans and they came in just a few days in great packaging and exactly as described brand new!! You cannot beat Gamertech for all of your PC needs!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Stringfellow",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T20:00:50.000Z",
          "Titre": "Take the Plunge!",
          "Contenu": "I'll concede, I was apprehensive when I was introduced to the website. I'm glad I took the risk. I purchased the i7-13700k for a price well below any other vendor that held stock. No taxes were charged and shipping was free. It arrived quickly and in superb condition. If you're uncertain, I encourage you to patronize GamerTech. This is a quality seller who deserves our support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Micah Lee",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T02:06:55.000Z",
          "Titre": "Absolutely amazing customer service!!!",
          "Contenu": "There was a slight issue with my order (nothing wrong with the items themselves, everything was in immaculate condition), so I reached out via chat and Mike and his team at Gamertech were quick get it resolved. The customer service here is truly top notch. They’ve earned themselves a repeat customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert White",
          "Nb_Reviews": 2,
          "Date": "2022-04-07T20:36:29.000Z",
          "Titre": "Ordered the 011 Dynamic Snow White",
          "Contenu": "Ordered the 011 Dynamic Snow White Edition... first off let me say AMAZING customer service!!! I will be returning for future purchases and will check gamertech.com prior to any other online retailer after my experience today. Second off, the Snow white edition is rare some what, and I couldn't find it available anywhere else. Customer for life now and I follow great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Aguilar",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T04:33:41.000Z",
          "Titre": "Great prices, great customer service, great company",
          "Contenu": "Great prices, great customer service, great company.Was able to purchase an i9-13900k from GamerTech. The item came extremely quick, the customer service was fantastic. It's nice knowing big box stores aren't your only option. Will definitely be purchasing from here again and definitely recommend you reading this review to do the same :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alvaro Villagomez",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T18:37:17.000Z",
          "Titre": "Service Beyond my Expectations!",
          "Contenu": "I rarely write reviews unless I encounter a product or service that goes well beyond my expectations and GamerTech has this distinction. I had difficulties installing a PNY NvLink Bridge on my system. When I reached out to GamerTech, Mike (the owner) personally got in touch with me and ensured a PNY Rep contact me to help resolve my issue. This is the type of personalized service you rarely find in this automated \"good luck getting in touch with a human\" world we live in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Fernald",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T07:32:25.000Z",
          "Titre": "Ordering things on the internet in this…",
          "Contenu": "Ordering things on the internet in this day and age where there are repeated parts shortages is difficult. You either over pay, have to wait to get things for exceptional amounts of time or find your orders canceled.I ordered 10 unifan infinates and a controller from Gamer Tech Shop and they were shipped fast, came in OEM packages and the pricing was on spot with what they should be from MSRP.Other retailers wanted to charge me $50+ more per set of 3 fans on top of shipping.I would 100% buy from GamerTech.Shop again if the need arose for me in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Skates",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T18:55:54.000Z",
          "Titre": "Ths is a great shop",
          "Contenu": "Ths is a great shop. They answered my questions quickly on the weekend and ordering was easy and the water cooler shipped quickly and was delivered in a couple days. I ordered a second water cooler since they are a reseller of Arctic Freezer products which for the 360 is hard to find. No markups, excellent communication and fast service. I'll order from them in the future and highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "valerie duncan",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T18:12:08.000Z",
          "Titre": "Fabulous customer service!",
          "Contenu": "Fabulous customer service!I am building my first rig.  I ordered an AIO and after it had shipped realized it would not fit in the case I have.  I contacted GamerTech and they offered to help me select and alternative that would fit. And when I declined they immediately issued an RMA.  No hassle or upsell.  After dealing with other companies with such poor customer service, Gamertech is like a breath of fresh air.  THANKS GAMERTECH!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Harriman",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T18:30:02.000Z",
          "Titre": "Extremely fast",
          "Contenu": "Extremely fast, same day shipping, and shop let.me split in payments, never seen it beyond 4. And very minimal interest to split pay over 6 months. Exactly as described and a great sale for 5800x3d. Finally using my 4090 to ita full potential"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "akumatakai",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T02:47:55.000Z",
          "Titre": "Suspicious to Safe",
          "Contenu": "At first I was highly skeptical of this website, as it is new and I had seen some angry Reddit Posts... but after finally getting ahold of the 7900 xtx in good shape and operational condition as promised, I no longer doubt. The owner had messaged me personally several times to reassure me that the order was safe and that he understood my concerns when dealing with a new shop. He was very friendly and even submitted my package earlier than he had stated to supply some comfort. Excellent customer service, product is in great shape. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T01:49:15.000Z",
          "Titre": "The customer service was excellent",
          "Contenu": "The customer service was excellent. Had a great conversation with the owner, who actually carried a great amount of help. The product was perfect as mentioned. I was at first skeptical because I hadn’t heard of the website, but I am so glad I bought from this website. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T15:45:23.000Z",
          "Titre": "Shipped quickly and was in great condition.",
          "Contenu": "I will say I was hesitant to try a company that is so new when buying my Lian Li fans. What got me to purchase was the price actually being the normal when Amazon and NewEgg were over charging 30+ dollars, and I'm glad I did. Gamertech shipped my fans quickly (and had the option to use UPS over USPS which is a plus), and when I tested them in my build they worked perfectly as intended. They sent multiple emails about when the order was received, when they shipped (with tracking number), and when it was labeled as delivered. Definitely a good experience from my end. I'm much more trusting and willing to use their services again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2022-02-25T23:36:54.000Z",
          "Titre": "Legit - Good customer service",
          "Contenu": "This company is legit seem to be in stock occasionally of hard to get items. I actually had to cancel my order because my buddy already ordered the case I needed. They refunded me and even intercepted the item so I didn't have to ship it back. I'll be checking their website in the future if I'm having trouble finding computer hardware in stock"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Kacynski",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T14:59:20.000Z",
          "Titre": "Will shop here again.",
          "Contenu": "As others have said, I was skeptical. But decided to give them a shot. Glad I did. Got a 5800X3D for a great price. The lowest I've seen it online actually. Was notified my order was fulfilled and that a shipping label was created within 1-2 hours. I received my order 4 days later which isn't bad considering I choose USPS first class. I also chatted with their customer service online during the process and they responded quickly and we're polite and informative. I will be building a new system later this year and will certainly stop here first to see if they have what I need. P.s. The 5800X3D is an animal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tupe Ray",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T04:25:37.000Z",
          "Titre": "I would definitely buy a gun from them",
          "Contenu": "I would definitely buy again from them. I bought a cooling system from them I paid $281 that was with tax and shipping and I received it new in the box and all the pieces as well. Highly recommend I would deafly buy again from Tupe Gaming"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ralph Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T05:32:49.000Z",
          "Titre": "Fast Service",
          "Contenu": "Fast Service, Delivery was awesome no muss no fuss"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Avery Boccella",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T03:24:43.000Z",
          "Titre": "Item was exactly as described, excellent support",
          "Contenu": "Item was exactly as described, price was very good, before even considering that you don't charge tax. The person running your Ebay page was very helpful in allowing me to put in my order, and told me exactly when the item I wanted would be in stock. I have never had such help when buying a product that is out of stock, and was a painless experience. 6/5 stars"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bret C.",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T04:59:43.000Z",
          "Titre": "Great Store, Amazing Communication, Will Buy Again!",
          "Contenu": "First off, this was the ONLY place I could find the 10 Lian Li fans I wanted for my new PC Build. They had a convenient option to order the exact number you needed, which I haven't seen in any place like Newegg or Amazon. Second, I made the mistake of not reading the description that was very clear. I e-mailed the owner asking about possibly buying a part I believed I needed to make my specific set up work. He responded within minutes on a Sunday! After offering to sell me the parts at a sale price, he pointed out that I likely did not need them, saving me money and time.Thanks! Will buy again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Norton",
          "Nb_Reviews": 2,
          "Date": "2023-01-14T03:54:44.000Z",
          "Titre": "Excellent customer service and good products!",
          "Contenu": "I had questions regarding a product for sale, and they answered my questions immediately through their online chat feature. I placed my order and it shipped the very next day. Shipping was fast, and I got exactly what was advertised for the lowest price that I could find online. I recommend this website and will shop with them again! Thank you Gamertech.Shop!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "caleb",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T17:27:27.000Z",
          "Titre": "Everything exactly as advertised",
          "Contenu": "I was initially hesitant to order a 'better than new' rtx a2000 12g that had aftermarket TIM applied. Came very quickly and extremely well-packed. Box had all accessories and it's working great! I would definitely order from this outfit again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Quinn",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T00:23:56.000Z",
          "Titre": "Great customer service",
          "Contenu": "I ended up ordering the wrong thing. They helped me exchange it hassle free. Would recommend to anyone looking for any computer parts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cloe",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T04:56:19.000Z",
          "Titre": "Good price for a small business",
          "Contenu": "I was looking to buy a set of 9 Lian Li fans and searched for quite a while to find the best price I could. I found on amazon, getting 9 of them would cost around 300 dollars. Upon searching ebay, I found this shop and ended up getting the 9 fans for around 240 dollars. I was meaning to get SL120 fans, But I mistakenly purchased AL120's, I reached out to the owner and they were more than willing to replace the order with the SL120's or even give a refund. I appreciate the shop and experience I had and certainly will look at their shop again if I need to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2022-05-30T03:40:30.000Z",
          "Titre": "Purchased Lian-li A4 H20",
          "Contenu": "Purchased Lian-li A4 H20.  Gamertech was very helpful and responsive with chat.  They shipped out in a timely fashion.  All was well however email stated I’d receive texts or emails with updates about shipping but I didn’t really see them.  I don’t know if I did something wrong there but either way the item arrived and I am satisfied :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean F. Roberson, MBA",
          "Nb_Reviews": 3,
          "Date": "2022-12-08T11:49:32.000Z",
          "Titre": "Exceptional Distributor",
          "Contenu": "Impeccable Communication! Serving in remote locations in the United States Air Force, computer components are expensive on the local market. Gamertech was able to accommodate hard-to-acquire parts and ship those components out to our location.  I can't thank him enough for his hard work and tenacity"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex L",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T07:17:31.000Z",
          "Titre": "A Miracle - Big Shipment to Hawaii",
          "Contenu": "I am from Hawaii and I purchased a Lian Li DK-05FX from GamerTech. Prior to Gamertech, I tried to purchase the desk case from the big name online stores (Newegg, B&H, etc) and not a single one made an effort to try and ship the item to my location despite my willingness to pay the fee. Mike from Gamertech reached out to me directly when I was trying to buy the desk. Mike instantly offered his service that he will do all his best to get the desk from California to Hawaii. With the assistance of his team, they were relentless in pursuing all shipping options. With their close coordination with Ship-to-Hawaii company, a miracle happened. Mike was able to ship the desk to Hawaii. I recommend to reach out to Mike if you encounter any issues on Gamertech store. I can guarantee they will reach and provide solutions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KaiSupa",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T08:10:59.000Z",
          "Titre": "What you want, when you want it",
          "Contenu": "Got exactly what I ordered (in this case a vertical gpu mount for my case) in a timely manner. Was very convenient as the normal retailers I buy from were out of stock or had much higher prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Micah Lee",
          "Nb_Reviews": 2,
          "Date": "2023-02-11T16:26:11.000Z",
          "Titre": "Was skeptical about the site at first…",
          "Contenu": "Was skeptical about the site at first (got a really good deal on the Lian Li fans I bought), but everything turned out great. They upgraded the shipping and kept me up to date with the order. Still waiting on a few components from other vendors so I won't be opening the fans for another 1-2 weeks. Hopefully everything is in working condition when I start building the PC. But as it stands, will definitely be using gamertech.shop for future orders.EDIT: Customer service is amazing! Chatted in with a question about my order and was responded to very quickly. I then had a general question about my new (and first) pc build and Mike was quick to offer his help. We hopped on the phone and continued our conversation there. These guys are truly amazing!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin King",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T09:08:27.000Z",
          "Titre": "It's not amazon next day shipping but…",
          "Contenu": "It's not amazon next day shipping but both products were significantly cheaper and worked great. Super legit. I will be checking this website before I look elsewhere."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrian Cuevas",
          "Nb_Reviews": 6,
          "Date": "2022-12-08T19:55:03.000Z",
          "Titre": "This site Is awesome!!!",
          "Contenu": "This is my second time ordering from Gamertech.shop and once again they outdid themselves with fast shipping and the no price gouging! The prices are so good items sell out quickly but they come back in stock quickly as well, I can’t wait for new items to become available so I can get more honest priced merch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Cameron",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T17:57:18.000Z",
          "Titre": "Fast Shipping",
          "Contenu": "Fastest shipping I could get on the Arctic Liquid Freezer II 360, everything arrived great. I was hesitant due to not really knowing anything about this seller, but they came through for me. Will use them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T19:33:11.000Z",
          "Titre": "Great site for buying PC parts",
          "Contenu": "I recently bought the Lian Li o11 Dynamic EVO - Snow White. Hands down, the best customer service and experience I have had with buying PC parts. If you are hesitant about buying from this site, worry no more. The owner of the site \"Mike\" is a wonderful guy who answered all my questions. I ordered my case on a Friday and received it in 3 business days. Everything was a smooth process, the case is brand new and sealed, with its original packaging. Gamertech.shop will now be my go-to place to look for PC parts with sweet deals :) It definitely beats Newegg and Amazon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ty Haney",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T01:30:40.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I ordered the SAPPHIRE Radeon RX 7900 XTX 24GB before the 110c hotspot issue was of my knowledge and this was one of the most expensive single upgrades I have done to setup. So when I found out I had this issue with my card, I was shitting bricks to keep it short. But within minutes of me emailing GamerTech they got back to me with a solution to contact Sapphire and they would replace it. They did not, and told me to go back and talk to GamerTech about getting a replacement model. I was even more scared I was gonna be stuck with this $1200 paperweight. But again within minutes of emailing GamerTech they responded. Offering me another card because they where out of XTX's at that time. Long story short they gave me an upgraded model the ASRock RX 7900 XTX Taichi OC for no extra charge and made me feel that they cared if I was happy with my purchase and not left out to dry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T09:00:39.000Z",
          "Titre": "Not a scam lol. Very happy with my purchase :)",
          "Contenu": "Saw a few iffy posts on reddit after already placing an order and got really scared. I realized I put from a website I’d never heard of and they were offering discounted prices on items that weren’t in stock or was being solder above msrp such as the lian li inf fans and strimers. However they had really fast shipping and everything came neatly packed and it was all legit and I’m beyond happy with my purchase. Thank you so much! Will 100% buy again if I needed. Sadly the aio wasn’t in stock so I couldn’t get it from here but these people are amazing. Props to the owner for this!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnny Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T09:36:51.000Z",
          "Titre": "Ordered lian li sl120 infinity fans",
          "Contenu": "Ordered lian li sl120 infinity fans. Order filled fast and shipping was quick. Prices were excellent. Definitely a go to spot for future purchases. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paige Cory",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T21:32:16.000Z",
          "Titre": "Nothing but the Best",
          "Contenu": "Nothing but the best! Great customer service, quick shipping, and got just what I needed with a handwritten note. Gamertech went the extra mile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mehmet Arda",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T15:00:49.000Z",
          "Titre": "Good place to shop for your liam li case needs. …",
          "Contenu": "I recently baught few liam li fans from gamer tech.the package came in 3 days prior to its predicted time. It was well packed and  the price was fair. All and all i was happy with the service i received. I definitely use them again. And i say this very seriously it takes a lot for me to recommend some1 im very critical buyer but definitely recommend gamertech shop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 3,
          "Date": "2023-06-09T18:36:28.000Z",
          "Titre": "Standalone Lian Li Uni Fan Controller",
          "Contenu": "You were the only company online I could find that was selling the Lian Li Uni controller on its own. Everywhere else only had it bundled with the 120mm fan 3-packs. I use 140mm Uni fans, which don't come in a 3-pack (c'mon Lian Li...) so I was stuck until I came across Gamertech. My delivery was quick and everything works perfectly! Thank you so much. I will certainly do business with you again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Erdman",
          "Nb_Reviews": 2,
          "Date": "2023-03-04T21:01:53.000Z",
          "Titre": "Awesome company",
          "Contenu": "They where very responsive to my needs. They went above and beyond at a fair price. Made several purchases and all were exceptional. Even gave the personal touch for shipping. Will go to them first for my shopping needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dylan Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T01:37:06.000Z",
          "Titre": "Great prices and fast shipping",
          "Contenu": "Great prices and fast shipping. I hadn't heard of them before but I took the chance and couldn't be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Tompkins",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T02:41:26.000Z",
          "Titre": "Shipped out exactly what I ordered and…",
          "Contenu": "Shipped out exactly what I ordered and gave me a heads up about a slight shipping delay due to the post office closing, but got it shipped promptly the next day. Great price and great quality GPU with good packing and no damage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Smith",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T23:44:31.000Z",
          "Titre": "Quick and efficient so far",
          "Contenu": "Quick and efficient so far.  Still waiting on some refunds to get my motherboard, so I can only assume the part is as good as it was fast and easy, but I might look at their stock when Amazon 🤦🏻‍♂️ Finally gives me my refunds. 🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️They DID have some 4090s. 🤷🏻‍♂️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T20:08:55.000Z",
          "Titre": "Definitely order from this place",
          "Contenu": "I’ve ordered from the site twice as of now.  The first time I was on the fence because I had never saw or heard of this site but it was a good price on Lian Li infinity fans so I pulled the trigger they came quick and everything worked.  This is now the second time and from order to deliver date was two days. I cannot recommend this site enough.  Thanks for the great products and prices and superb shipping!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Zachary",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T18:21:03.000Z",
          "Titre": "Gamertech=AWESOME",
          "Contenu": "I have nothing but wonderful things to say about this company. Great communication Great fast shipping Great customer support. If you’re needing pc parts this is the place to buy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T00:43:20.000Z",
          "Titre": "Great Response Time and Wonderful Business Practice!",
          "Contenu": "Had some questions regarding product availability and they responded with haste and we’re able to confirm the products were in stock and helped me adjust my order to save some me money which is always a good sign of great business practice and ethics. They also guranteed the order would ship out the next day, which falls on a Friday, which I very much appreciate considering most online businesses would take a full business day to process and then make me wait two full days until Monday to then ship my order.All in all, a wonderful first time experience with a relatively new online storefront that I didn’t have any knowledge going into.(Plus no sales tax! Not asking how, but I’m definitely not complaining)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean F. Roberson, MBA",
          "Nb_Reviews": 3,
          "Date": "2022-12-18T16:07:50.000Z",
          "Titre": "Attention to detail",
          "Contenu": "Gamertech is amazing when it comes to attention to detail. He processed my large order with a variety of different component at different quantities, perfectly. The packaging was exceptional...nothing was damaged...not one dent on a box!  Highly recommend to anyone looking for the best distributor in the world!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devon Herbert",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T08:45:51.000Z",
          "Titre": "Small wait but worth it!",
          "Contenu": "Other then a small wait on shipping, my 9 new sl infinity fans arrived in great condition with no problems at all. Pretty good packaging as well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Erickson",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T06:03:36.000Z",
          "Titre": "Quick and QC on point",
          "Contenu": "Fast shipping, easily fixed my error on charging on wrong card. Board runs great compared to Newegg sending me DOA boards back to back 2 times now!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Saikedo",
          "Nb_Reviews": 6,
          "Date": "2022-11-07T15:27:19.000Z",
          "Titre": "Was able to purchase a i9 13900k from…",
          "Contenu": "Was able to purchase a i9 13900k from this store which wqs out of stock everywhere.Had the chance to talk with customer support, very responsive and nice experience.The item was shipped and delivered fast and as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel Fairleigh",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T22:53:00.000Z",
          "Titre": "Really great buying experience",
          "Contenu": "Really great buying experience. My purchase has come with a great deal of technical support, which is something you could never buy from Best Buy or new egg."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Woo",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T07:56:52.000Z",
          "Titre": "Super communicative",
          "Contenu": "Super communicative, super quick responses, and gave me the cheapest option for a combination of products instead of just letting me buy it at full price. Super nice too! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Dommell",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T20:00:22.000Z",
          "Titre": "Fantastic Experience with GamerTech.Shop",
          "Contenu": "My package arrived quickly and was well protected. The best part is that it was cheaper than Newegg or Amazon too. Shipping will be a little more, but that is to be expected with stores that aren't gigantic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T18:15:15.000Z",
          "Titre": "Deciding on a GPU",
          "Contenu": "1st off I was betweand 2 different brands of Graphics card with the 4090 Hardly ever being available At or around MSRP I was trying to snag AMD's Flagship, Or at the very Least grab 4080 either at msrp or on sale. Now I know all these graphic cards are over-priced from manufacturers but I also know that they all perform very well. I ended up with the asus tuf model of 4080 from gamertech.shop  which had it up for sale at the same price(after tax) that I would get a non reference 7900xtx. I was only just able to install it last night, but for example playing spiderman miles morales from my 2080ti I was set at 2560x1440 res at high settings with raytracing off and getting relatively smooth performance. With tuf 4080 it reset resolution 4k, turned graphics to custom with everything maxed, raytracing on, and was extremely smooth gameplay. The sting of paying  so much for a graphics cards was lessened by this friendly and knowledgeable salesman here at gamertech.shop. He contacted with answers very quickly and always was above the norm when I was asking questions or requiring assistance from him. I will be shopping from them again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T05:32:06.000Z",
          "Titre": "A+ company",
          "Contenu": "Customer service was a pleasure to deal with, and went above and beyond what they needed to. In todays world that’s not something you can say very often. I will definitely be a customer in the future and couldn’t recommend them higher."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2022-03-06T03:33:06.000Z",
          "Titre": "Bought a Liam Li 011 evo however I…",
          "Contenu": "Bought a Liam Li 011 evo however I wanted to return the case as I had difficulty building with the specific case. The seller was very helping and kindful. The seller will go above and beyond to help you with anything u need. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James C",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T17:16:21.000Z",
          "Titre": "Great deals with great price!",
          "Contenu": "Great Deals with great price! Satisfied! The Lian Li Strimer Plus V2 and the UNI fans is in working condition and shipping was punctual."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Nichols",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T22:34:48.000Z",
          "Titre": "Great communication,products arrived in…",
          "Contenu": "Great communication,products arrived in good condition,good pricing,had products I was looking for, they were either un available or way over-priced elsewhere.Very good customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 3,
          "Date": "2022-11-20T16:28:23.000Z",
          "Titre": "Nice alternative to Newegg",
          "Contenu": "Never heard of this website before and was unsure about buying from here because of it. Couldn’t get a 13900k because they were out of stock, but GamerTech had them and for $10 off. Arrived quickly and well packaged. Cpu works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Warner",
          "Nb_Reviews": 1,
          "Date": "2022-05-29T01:18:12.000Z",
          "Titre": "Very pleased with my purchase of Lian…",
          "Contenu": "Very pleased with my purchase of Lian Li Al120 fans.  From Gamertech,  and they answered all my questions. I could not be happier with there Customer Service they were awesome. And shipping was extremely fast.Needless to say I was very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spriggan",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T04:39:58.000Z",
          "Titre": "Incredible service from GamerTech!",
          "Contenu": "I originally pre ordered the new Lian Li SL120 Infinity fans in black for my new pc build, but after a few days decided to go with an all white build instead. I inquired with GamerTech about canceling and reordering the white fans instead. Mike canceled/refunded my order and allowed me to get the white fans although the pre orders had closed....amazing!  Most places would tell you \"too bad\" or \"sorry can't do anything for you\", this wasn't the case with GamerTech. I was absolutely blown away by their customer service ( I work in the hospitality/ tourism industry, so I know all about customer service and satisfaction) so much that I immediately ordered the new Lian Li Strimer v2 24pin and dual 8 pin cables on the 4th of July and lo and behold, shipped the very next morning (today July 5th) Just an incredible vendor and will be doing many more orders via GamerTech!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick D",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T03:19:43.000Z",
          "Titre": "Overpaid but fast and legit",
          "Contenu": "Overpaid for both shipping and the pc fans but it’s better than waiting a month from Ali express or Newegg to restock. Shipped fast and product was exactly what I ordered!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek Nadeau",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T09:09:33.000Z",
          "Titre": "Better then new egg",
          "Contenu": "Best pricing by far and they are legit and will always get my business depending on what they have in stock of course. Only down fall was I still haven’t received my product…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve S.",
          "Nb_Reviews": 5,
          "Date": "2023-01-25T19:43:31.000Z",
          "Titre": "Trustworthy. NVIDIA GPU Super Deal.",
          "Contenu": "Found great deal on expensive $2000+ GPU Nvidia card. Ordered it, shipped and delivered on time. Product new, factory sealed as it should be. And no tax micky mouse here like other retailers do, I pay my taxes myself. Thank you Gamertech. Will shop again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hayden Seng",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T12:35:13.000Z",
          "Titre": "Outstanding customer support",
          "Contenu": "Amazing customer support helping me throughout my process of receiving replacement lian li sl120 v2 fans I overall had the best experience contacting them out of all company’s would definitely recommend buying from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dillon U.",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T22:44:25.000Z",
          "Titre": "Fast easy shipping experience",
          "Contenu": "Fast shipping experience! Package arrived in good condition and can't be mad about a sticker pack included. Would definitely order from here again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ajay Sharma",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T03:51:00.000Z",
          "Titre": "Great Overall Experience",
          "Contenu": "The website was easy to navigate, the ordering process was simple and quick, and communication regarding orders was effective, in addition to a quick arrival time. I have no complaints and look forward to ordering from gamertech.shop in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Hero",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T15:09:43.000Z",
          "Titre": "Actually Legit!!!!!!",
          "Contenu": "This site actually legit. I ordered 6 unifan infinity and got it the week after. I'm very happy with my order. I would order from this site again if i need any other computer parts. Thank you GamerTech."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Superior Aerial Films",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T02:12:03.000Z",
          "Titre": "Great Company even better customer service!",
          "Contenu": "By far one of the best companies I have ordered something from, the owner making it a personal mission to ensure the transaction went smoothly and that the item was delivered in a timely manner even refunding shipping on a large item. I'll definately be ordering more in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Short",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T14:04:19.000Z",
          "Titre": "Gamertech.shop did right by me!",
          "Contenu": "Ordered a gig oc 4090 on Dec 19th, and received and brand new one on Dec 27th.Was a pretty quick delivery considering the holiday and bad weather."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shaun Maxwell",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T20:03:28.000Z",
          "Titre": "Quick delivery and exactly what I needed",
          "Contenu": "The shipping was way quick and exactly what was ordered. I love the option of buying a custom amount of fans."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Collin Maley",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T17:45:21.000Z",
          "Titre": "Trustworthy",
          "Contenu": "Had a slip up where my case was sent to the wrong address, but the shop paid to have it redirected free of charge.  Good service, quick responses.  They also were able to refund a pre-ordered product with no fuss.  Easy to work with, recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon King",
          "Nb_Reviews": 3,
          "Date": "2023-06-12T06:27:58.000Z",
          "Titre": "3rd time buying from them!!",
          "Contenu": "3rd time buying from them stupid fast shipping as described and always the best prices especially for lian li products!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kalajooni",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T03:38:36.000Z",
          "Titre": "Pretty good",
          "Contenu": "Bought some Lian Li Infinity fans. Product was shipped out the same day and arrived two later. Can't ask for a better experience than that"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manny L",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T18:14:55.000Z",
          "Titre": "Great Customer Support and Fair Prices",
          "Contenu": "Thank you for your fair prices and communication throughout the entire process of my purchase.  I was concerned with potential hardware quality issues and purchasing from a new vendor, but your team helped to alleviate my concerns.  I'll look for new opportunities to patronize your shop again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Black",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T19:57:51.000Z",
          "Titre": "Order was delivered quicker than I…",
          "Contenu": "Order was delivered quicker than I expected and everything was in great condition and it was actually in-stock. The bigger stores stay out of stock on everything so actually being able to buy it and supporting a smaller company is a win-win to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terran Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T18:52:07.000Z",
          "Titre": "I accidentally bought the Lian li…",
          "Contenu": "I accidentally bought the Lian li infinity SL fan controller without the 7 pin cables and Gamer tech sent me some for free instead of me having to spend 50$ for 4 cables."
        }
      ]
    }
  ]
}