{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "getdimension.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rocky",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T17:56:58.000Z",
          "Titre": "Delays",
          "Contenu": "Delays, cancellations, drivers not knowing where to go and WHEN to go. Billing before the job is complete. Was a totally frustrating experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andreas Santucci",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T17:24:18.000Z",
          "Titre": "UPDATE: SOLICITATIONS AT 7 A.M.",
          "Contenu": "UPDATE: Dimensions actually SOLICITED my # at 7 A.M. to ask if they can re-charge my card hundreds of dollars for a service that they failed to deliver 5x over. I find this absolutely hilarious but also a serious sign that the management at this company is absolutely clueless. Even though I had requested service previously, I am absolutely no longer wishing to to be contacted by this \"business\" again. LOL at the level of IQ that went into the 7 A.M. solicitation phone-call."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andreas Santucci",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T07:26:33.000Z",
          "Titre": "Doubling of prices for failed expectations",
          "Contenu": "Over the course of the week that I interacted with this \"business\", they doubled their asking price whilst consistently failing to deliver on expectations. Read: 5 missed appointments on their behalf. What. A. Waste. Of. Time. I'll be calling 1800 Got Junk who can come within a couple hours of me calling very reliably. Their team is professional and courteous unlike the folks at Dimension. At Dimension, you aren't paying the provider for a service. You're paying them to find a provider for you. Unfortunately, they have unreliable providers in their network and they seem to think it's a good idea to let a provider with only 1 service experience in their lifetime repeatedly cancel on me \"due to emergency\".This company doesn't even fulfill it's most basic premise of removing junk, even after doubling the asking price. Use Got Junk or any other Googled \"junk removal\" provider and you'll be much happier."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James House Commercial",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T16:24:44.000Z",
          "Titre": "wrong quote",
          "Contenu": "Sent Several Pictures , Answer a lot Of questions and was quoted several Bids for job , Finally gave me a a bid , went with it and the delivery pick up went well , but the quote was not right and the young man was left with the load for two days . with out doing anymore jobs we ended up paying way more than we were quoted. I will never use this service again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dylan Lyon",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T20:45:27.000Z",
          "Titre": "Good customer service. Poor time management.",
          "Contenu": "Customer service was prompt with responses so they have that going for them. However, I was charged more than my original quote due to \"increase in demand.\" That's fine. However, they were late to my scheduled appointment and tried to reschedule. I made an appointment for a specific time for a reason. Good job charging more and under delivering with your service. Will not be using ever and will spread the word."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "greg novak",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T13:58:18.000Z",
          "Titre": "Unprofessional and unreliable company",
          "Contenu": "Finally, after being 24 hours late and causing me to drive an additional 100 miles the next day, the job was completed Saturday.  Originally scheduled for Friday to arrive 10:30 AM at the latest.  Last I heard from the 'so called' provider he was to arrive at 1PM, two and a half hours late!  After that, he never showed up and would not respond to any texts or calls.Had to reschedule for the next day and drive an additional two hours round trip to finally have the job completed.  A reasonable request was made for a refund for Dimension's incompetence.  So far, Dimension has failed to offer a full or even a partial refund!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joy Justus",
          "Nb_Reviews": 8,
          "Date": "2023-11-08T08:58:36.000Z",
          "Titre": "No show all day and terrible service",
          "Contenu": "Scheduled a pick up for 10 AM with 2 days advance notice. At 10 AM they called and said it would be 1 PM. At 1 PM they called and said 3 PM. Then I didn’t hear anything and they called me at 5 PM and said they couldn’t make it. Really? I waited my entire day. They said they could schedule it for the next day which I agreed. Then they had the audacity to ask me for additional money, even though the order itself had not changed. They said their supplier wanted more money. That isn’t my problem. They had already quoted me a price and I paid and they wasted my entire day. How can they even think for a moment they should ask me for additional money?  Very unprofessional fly-by-night company and I do not recommend. If anything they should have discounted my order but they only offered a $10 discount on a $300 order! I regret ever using them. FYI, on the second day, they actually did send someone to do the pick up and he was fabulous but I still would not use Dimension again because of what happened the day prior and how they handled a bad situation. Horrendous customer service, and unreliable vendors, who appear to be independent contractors. Would be surprised if this company stays in business. Don’t waste your time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Meg",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T18:52:40.000Z",
          "Titre": "So not only did I rent a 10 yard…",
          "Contenu": "So not only did I rent a 10 yard dumpsters and it was a trailer that was dropped off, it was booked for 7 days, picked up after 48 hours without notifying us, but now the booking agent is refusing to communicate with me. So trying to get a refund is now ending up a huge frustration! I’m really hoping the company will do the right thing here, as I have all email and live chat screen shots. But dissatisfaction with the whole experience…Edit: the company only acted quickly for a resolution due to my poor review and asked me to change my rating. I stand by my statement, they didn’t honor the contract and only refunded me based on the agreement I’d change my review. Look up the previous company name on BBB if you’d like, but I’m not about to help the sku reviews. This was a nightmare that ended costing my a huge trickledown effect."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "morgan blythe",
          "Nb_Reviews": 2,
          "Date": "2023-08-26T19:02:31.000Z",
          "Titre": "take your money and sanity somewhere else",
          "Contenu": "unfortunately, I've been dealing with this company. Ben Bessner was eager and happy to take my order and money. But then I could not get any information on when they would service it. Ben went silent... After a week and a half of constantly calling to ask about the status, we were told we actually had to pay $300 more for the service, still, with no solidified date. Upon getting \"hidden\" fees that were sprung on us, we decided to cancel our service and get our money back. This process took three days, and I am still waiting for a valid confirmation email that our money will be returned to us. Long story short, don't bother with them & take your money elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T04:04:15.000Z",
          "Titre": "No shows and terrible resolution of issues",
          "Contenu": "First person no showed 2 days in a row, second person was an hour and a half late, then left with the piano blocking my front door. They came back at 10:30pm the following night after giving me the runaround all day. No refund or help from Dimension to make up for the trouble. Will never use again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 2,
          "Date": "2022-05-19T18:19:51.000Z",
          "Titre": "I agree with negative reviews",
          "Contenu": "I agree with negative reviews. I hired trashwarrior to remove a couch several days prior. They assigned me to 3rd party contractor who had no reviews or previous jobs. She received my email, phone, and address. She never showed up. Trashwarrior could only shrug their shoulders and suggested they could assign a job to someone else in 10 hours. I ended up hauling the couch myself since I couldn’t anyone else to pick up the job so last minute."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T15:27:02.000Z",
          "Titre": "BEWARE!",
          "Contenu": "BEWARE! These guys sub out to local contractors and there is no accountability. Booked 5 days in advance 9am delivery. Delivery day local sub contacted complaining \"they just got told about the job last night\" and dumpster would not come until 4pm. Wooden trailer arrived 4:45pm causing issues.Dumpster was for wedding with \"food and beverage waste\" listed as the trash. After pickup the company claims there was \"hazardous waste\" animal parts in the trash. Leftover wrapped meat that was bagged was what they claim as \"hazardous\"! An unauthorized, unjustified $250 extra charge with no proof of their claim! UNPROFESSIONAL 3rd PARTY WEBSITE - USE AT YOUR OWN RISK"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T16:54:24.000Z",
          "Titre": "bad service",
          "Contenu": "All photos have been taken and the garbage has been updated, and additional charges are still required after arriving at the scene. It's hundreds more expensive than looking for other companies."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Antioneyca Thompson",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T02:30:31.000Z",
          "Titre": "COMPLETELY UNPROFESSIONAL. DO NOT BOOK.",
          "Contenu": "This service is COMPLETELY UNPROFESSIONAL. DO NOT BOOK. they refuse to show up or offer any notice of cancellation or rescheduling. This is the most unprofessional and ill-equipped company to exist. PLEASE READ ALL REVIEWS AND RUN FROM THIS COMPANY.  They never showed for my appointment after they rescheduled from 12pm to 5 pm then 5pm to 8pm. 3 DIFFERENT DRIVERES WERE ASSIGNED AND NONE OF THEM SHOWED. PLEASE DO NOT WASTE YOUR MONEY OR TIME. THIS COMPANY SHOULD NEVER BE ALLOWED TO RECIEVE ANOTHER BOOKING FROM ANYONE. Customer service does not offer anything I called all day and never received any calls back, they stopped answering and tried to offer me 5% off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aoun Haider",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T19:24:41.000Z",
          "Titre": "Its an absolutely pathetic company…",
          "Contenu": "Its an absolutely pathetic company which is a fraud. Ill be taking them to court for taking my money and providing absolutely nothing but lies. No one shows up. Jhicko Obordo is the guy who dealt with me DO NOT RESERVE WITH THEM!! Its a FRAUD!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nick hiott",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T20:57:47.000Z",
          "Titre": "Cancelled three times",
          "Contenu": "Cancelled three times, understand it was a holiday weekend but no communication until time of arrival. People in charge need to communicate better with warriors and customers. the trash warrior that showed up had no clue of items that needed to be picked up and did not have the proper hauling vehicle. While they were very nice people I feel like the company needs to be held responsible. Don't penalize the people lifting and hauling everything, take care of your customers and it shouldn't be that hard."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Damian Parker",
          "Nb_Reviews": 3,
          "Date": "2023-07-04T18:29:46.000Z",
          "Titre": "I would not use this company again…",
          "Contenu": "**EDIT** They also reached out to me to offer 50% off next purchase if I would remove my review if them...I would not use this company again their customer support is terrible and I was given 5 different delivery times. Then told it was because of traffic in my area. When I sent them traffic reports showing that was false they said oh it was traffic in between the areas. When I said no try again he was supposed to be 15 minutes away 2 hours ago.... I got \"he will get there when he gets there\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Schweitzer",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T22:23:16.000Z",
          "Titre": "Didn’t show up, waiting for refund.",
          "Contenu": "Just another customer who got the appointment ahead of time, provided pictures, went to some trouble to get dog and car out of the way, only to get an email mid-morning that said nobody could come.  You’d think they’d have known that ahead of time.  They did promise a refund, but it hasn’t shown up yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOHN Doe",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T07:40:43.000Z",
          "Titre": "Really wanted this company to succeed",
          "Contenu": "Really wanted this company to succeed, but they are going to have to do it without my money. Warrior has picked up around 50 percent of my trash, which makes them extremely expensive. Right now coming this Thursday (7-21-22) will make 3 weeks since last service pick up. Vultures actually opened trash receptacle and are going to town. It really smells that bad. BTW have been with Warrior for well over a year the service is just not there. Hired another company today, I don't expect any refund from Warrior, but do expect a further money grab even though I still have over 2 months on my current contract. Only one problem this guy needs to quit using his military past to sell himself. He was not an adequate soldier."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracy Enders",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T21:59:36.000Z",
          "Titre": "Don't trust this company",
          "Contenu": "The guy (Justin) who was supposed to pick up our couch did not. We rescheduled and still didn't come. There was no communication on his side so we had to reach out to him to see if he was still coming, but he lied both times saying he was and then never did."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PD",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T17:59:26.000Z",
          "Titre": "Call company ahead of time to make sure they service your area",
          "Contenu": "Booked my appointment a week in advance, never got a notification that a provider was matched so I called the company (no answer), emailed them (no answer) and finally texted the original phone number I called and got a response. They told me my area had very few providers and that they were hard to contact. Then tell me that sooner?? Why even say you service my area if it’s so difficult to get a contractor over here? I eventually did get matched with someone the night before but they never came. I tried to cancel the waste pick up over the phone an hour after my original appointment time was missed, after having called and texted about the missing contractor, and they told me I couldn’t cancel with a full refund until the contractor cancels. Eventually, after another hour or so they told me they couldn’t even locate the provider. After that they gave me a full refund very quickly (next business day), which I will give them credit for, but overall this entire experience has been confusing, opaque, and unproductive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alan Sperry",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T12:22:15.000Z",
          "Titre": "Driver called at noon",
          "Contenu": "Driver called at noon, the pickup time, and pressed us to put items outside for next day pickup. Contacted TW customer service. They were unable to find another team to pickup.  No discount due to TW not keeping the reserved time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lori Langdon",
          "Nb_Reviews": 6,
          "Date": "2022-07-28T22:14:45.000Z",
          "Titre": "I will NEVER use this company again",
          "Contenu": "I will NEVER use this company again. I originally paid $441.75 for a 10 yard dumpster. The day before it was to be delivered, they texted me to say that because of the high price of gas, they would need to charge me an additional $158.25. I had to pay because I had workers coming the next day. Then they woke me up at 5am to tell me that my dumpster would be delivered at 9am. Never showed up until 6pm. And it wasn't a dumpster. It was a trailer. I will be reporting them to the BBB immediately. Unacceptable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sherrie B",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T20:30:07.000Z",
          "Titre": "Dumpster Vendor w empty promises",
          "Contenu": "We had ordered a dumpster well in advance. Traveled to assist with a major project First had to experience days of up charging  for a larger dumpster only to receive word on the scheduled (and paid for ) delivery day that there was no dumpster available."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Missy mueller",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T12:58:18.000Z",
          "Titre": "No refund",
          "Contenu": "I was excited to see such a great price.  I booked and scheduled for 3pm and received a confirmation. I took all my junk (couch chair beds etc..not easy stuff!) Outside. They never showed. Spoke to customer service 4 times on phone and once on chat...(was hard to get ahold of may i add) apparently they couldnt find my warrior. After 2 hrs i finally said cancell. They offered a refund and quoted it would be in my account within 1 day. Took forever to get a confirmation of the cancel. And its going on 2days.. I still havent received it. Single mom and need that money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Caleb",
          "Nb_Reviews": 1,
          "Date": "2022-08-06T00:27:16.000Z",
          "Titre": "Does not stick to schedule. Delays pickup.",
          "Contenu": "Trash Warrior was quick to take my money after agreeing to the quote, but then came back and asked for more because they did not factor in the rising costs of gas prices. Instead of taking this as a red flag, I agreed with the extra charge. Then the day of picking up the dumpster came and I reached out for an ETA... 9am-4pm was the quote as though that narrows down the window. At 4:30pm I reached out and asked where they were, and they said they would reach out their provider. An hour later, I have to reach out again and then get told it will get picked up the next day. I request a morning pickup and they said okay, but it is now 3pm and after I had to reach out again to follow up, they are pushing back the pickup until next week. This dumpster has been in my driveway for days. Poor service, poor communication, and nothing but apologies. Don't do what I did--next time use local services and not these middlemen who over-promise and under-deliver."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joy Justus",
          "Nb_Reviews": 8,
          "Date": "2023-11-09T02:51:57.000Z",
          "Titre": "No show and price increase",
          "Contenu": "They no showed and kept switching the time on me. Then tried to charge me more. Do not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Johanna Schneiderman",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T17:02:21.000Z",
          "Titre": "Do no trust this company",
          "Contenu": "Do no trust this company. They will seriously do ANYTHING to keep your money. I had paid for a 20 yard dumpster truck and in the delivery day, my “match” cancelled on. They found someone one else only to have them cancel in me because their truck apparently did not fit through my driveway due to tree branches. I had moving trucks fit through them just fine. I had provided photos in advance of the space and trash and they approved it. They cancelled on me and only provided me with half my funds. I have submitted a claim with my bank. DO NO TRUST THIS COMPANY. They will do anything to keep your money without providing the services you paid for. You also end up talking to multiple people through chat and emails. It’s absurd."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan Bright",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T20:22:41.000Z",
          "Titre": "Fraudulent Billing Practices",
          "Contenu": "I booked a pickup job with a larger-sized truck for $99 on the website. Upon uploading photos of all items to be picked up, the quote didn't change from $99.On the day of pickup, the warrior cleared out the items in under 30 minutes. The warrior did a quick and clean job of removal, so my complaint isn't with him.At the end of the job, I received an invoice for an additional $900 on top of the original quote. They didn't update the quote when I sent photos of the items. They didn't update the quote upon arrival of the warrior. They only updated it once all work was done and they had the ability to effectively just pick a number.Plain and simple, this is fraudulent billing and will probably lead to the company ceasing to exist eventually. They refuse to address the issue through support, so I'm forced to file a chargeback with the bank and waste more of my time.UPDATE 2022-11-23: The company acknowledged that the operational mistake was on their end, and that someone should have reached out to discuss amended pricing before the booking based on the photos I uploaded. However, because they still have to pay the provider, they still want me to pay $650 for the job despite the estimate being $99. They see no issue with making this request despite acknowledging the fault was their own."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Fitzpatrick",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T23:51:14.000Z",
          "Titre": "I am extremely disappointed with Trash…",
          "Contenu": "I am extremely disappointed with Trash Warriors. They canceled my scheduled appointments twice without notifying me.  I am still awaiting my refund.  One star seems generous."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Misty Marchorro",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T19:29:17.000Z",
          "Titre": "Set up an appointment with Trash…",
          "Contenu": "Set up an appointment with Trash Warrior to have someone remove some wood and drywall from my dumpster. The trash warrior that was sent out was Willie. He requested some pictures of what needed to be picked up. After receiving them, he stated that it would be $150 more than what was already paid. I told him that I would not pay $150 more and he started to explain that he would pick up everything and that it was at a reasonable price because he was only being paid $40 to do the job. I agreed to pay him $100 more and he stated that it was fine. Willie arrived late and tried to only pick up half of what was agreed upon. I reminded him what we had spoken about and he stated that he would not be taking anything for that price. I advised him that I would not be paying more and he started taking the item along with the lady with him out of the trailer and tossing them back. He stated that I must be crazy if I thought he was going to take all of the items for $100. Then the lady stated that we used up all her Fuc*** gas for nothing.  I tried reaching out Trash Warrior and am still waiting for a reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "joy hunt",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T02:16:58.000Z",
          "Titre": "I was a worker for the company and…",
          "Contenu": "I was a worker for the company and didn't even get a chance to do a gig and then my account was banned and I didn't do anything but sign up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T04:56:48.000Z",
          "Titre": "Didn’t give us the results we were…",
          "Contenu": "Didn’t give us the results we were looking for . Didn’t take pictures and un responsive"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dogthority",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T16:33:21.000Z",
          "Titre": "The triple prices after booking and still charge a fee if you reject it",
          "Contenu": "Copy of my complaint belowI booked an appointment last week for $72. A day later someone called me to tell me that job had an extra charge of $200, immediately I rejected the estimate and asked the agent to cancel the order and issue a refund.I had used trash warrior in the past and the experience had always been extremely convenient and price competitive. Not even 6 months ago I was charged less than that to empty an entire 1 apartment. A couple of years ago I used one of your competitors Dolly for a move and they charged less than $100 to empty and load a 3 bedroom house. Yesterday I received a message saying my job was confirmed. I contacted your team to ask? And they confirmed the job was cancelled and the refund authorized (screenshot attached). By the way, I already had the job done by one of your competitors for $55.Today I got an email confirming my refund of $65. Receipt #3250-6988So if I understood this correctly, this is how things work with Dimension: I book a job and I got to the trouble of getting approval from the condo, schedule the service elevator, pay my deposit to the condo etc. Next you more than triple the original estimate and I reject the quote for obvious reasons and ask you to cancel and return my money. You fail to do so and I have to contact you again. And after all this I get charged $7. So in summary, you advertise a price, then you triple it and you still charge a fee to customers that don't accept your scam, am I right? I will be posting this review in every possible site I find to warn others not to fall for your scams. And obviously I want my $7 backThanks and have a good day.EDIT: they replied to the complain posted here with an apology but they still kept the stolen $7."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Swinden",
          "Nb_Reviews": 6,
          "Date": "2022-04-06T16:47:50.000Z",
          "Titre": "FRAUDS",
          "Contenu": "I hired this company to haul away a fairly heavy (275 lb. approx.) commercial copier, located on the second floor of my home. I gave exact details, weight, size and even included a picture of the unit with my daughter (for reference). The guy showed up on the correct day, at the right time, but he showed up by himself and without a dolly! I had just had a hip replacement 4 weeks prior, so I was in no shape to help (but I did). I helped him get the copier down the stairs, I helped him get it out the door, I helped him load it into his truck (where I also cut my finger wide open). Not to mention, he came in my house with dogsh*t on the bottom of his shoes, so I had to track down everywhere he walked and clean it.The guy was nice, but he came ill-prepared for the job. I have asked for a 50% refund but now they have stopped responding. Hell, I didn't even ask for 100% because he did take the copier away. I only asked for 50%. They can't even do that right!BEWARE of this company and if a single dude shows up to do a multiple man job, I would send him packing before he touches a thing.I'm pretty sure this company is being operated from overseas, as well. They may have a San Francisco, CA corporate address but they keep odd hours and no one EVER picks up the phone (not even sure it's dialing them, to be honest). They don't respond to their \"support\" email either. I should have done my homework...Hopefully, I can save YOU, a headache!UPDATE: I STILL HVE NOT RECEIVED MY PARTIAL REFUND (50%)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pranav Ramineni",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T22:44:41.000Z",
          "Titre": "AVOID!!! Unethical at worst, incompetent at best.",
          "Contenu": "Update: It is now October 14th, and despite the reply received on September 24th, no refund has yet been processed. It took a complaint to the California Attorney General's office to get a response in the first place, so I guess the only way this company is willing to rectify their mistakes is by making you go to the top. AVOID!!!! THEY WILL TAKE YOUR MONEY WITHOUT RENDERING SERVICE AND REFUSE REFUNDS. CUSTOMER SUPPORT WILL GHOST YOU.Would you use Uber/Lyft if they weren't able to find you a driver but still charged you? No? Then read on about why you should avoid Trash Warrior.Most of the positive reviews are about the contractors Trash Warrior finds. The negatives, including this one are about Trash Warrior themselves.Put an order in with this service, and my card was charged upfront over $400+. No warrior was found or matched to my request as per the email received. They asked me to wait an hour before offering a free reschedule or a cancelation. I waited for over an hour. No response from customer service at all.Due to the speed at which I needed a job done and as how Trash Warrior still had not found a \"warrior\" at this time or notified me with any update, I requested a cancelation as i found a local company willing to take the rush job (for less I might add). Although the cancelation was granted (still no warrior found) I was still charged 75%.This means that Trash Warrior took over $300+ for no services rendered. It's one thing if they had found a contractor and I canceled - I would pay that fair enough - but to charge me, not be able to render the promised service, and still charge me 75% of the bill is ludicrous and anti-consumer, if not straight up theft. Follow ups to the internationally based customer service team and the CEO on linkedin were met without adequate resolution. I unfortunately had to report these fraudulent actions to my states Consumer Complaints division.Unethical and malicious at worst, woefully incompetent at best. Use a local company, not Silicon Valley funded middlemen \"disrupting\" industries that don't need to be disruspted.TLDR: Trash Warrior charged me, were unable to render service, ghosted me, and when I canceled they were happy to charge me 75%."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T20:14:35.000Z",
          "Titre": "Price ended up being 60% more and 2…",
          "Contenu": "Price ended up being 60% more and 2 days later than initially quoted."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RMM",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T02:48:48.000Z",
          "Titre": "Save your stress and use someone else.",
          "Contenu": "The driver was so late that we had to push the pick up to the next day. We were moving and had strategically scheduled our moving work to be completed around the pick up. We had to rearrange our schedule the following morning to accommodate the driver mishap, rather than the company just sending us someone else. There was no apology, nor anything else thrown our way to reflect the inconvenience we experienced- on a service we scheduled for a specific time, and paid well for. Awful customer experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brett",
          "Nb_Reviews": 2,
          "Date": "2022-08-03T19:53:25.000Z",
          "Titre": "Costumer service is a joke to them",
          "Contenu": "I had originally written a very positive review. My handler was great that wasn’t the issue. I had worked out after my original quote that some items were to be removed and I would be refunded their removal costs. It’s been several weeks now, I still don’t have any money back for the items they didn’t take,  and after a few dead end messages to get help I’m just changing my review and would warn that if you have questions or concerns after the fact they won’t be there."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Asher Blue",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T03:38:41.000Z",
          "Titre": "Not that great",
          "Contenu": "Honestly - it wasnt that great of an experience at all. My warrior didnt show up at the agreed time, then showed up later (in his defense, he had lost his phone). The warrior did a great job when it came down to it, but I wasnt offered any sort of discount or refund for all the headache I went through. Plus, I was double charged because of the confusion over the warrior not showing up on time and am now having to follow up to get a refund! Overall not very satisfied and will likely never use this service again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T21:06:11.000Z",
          "Titre": "Expensive and possible unfair pricing",
          "Contenu": "The person who came to my house was great, but this service is ridiculously expensive. And I’m not sure they are very honest in pricing it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kay E.",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T17:53:43.000Z",
          "Titre": "Poor customer service",
          "Contenu": "We paid $720 for a 10-day, 20-yard dumpster rental to be delivered Saturday, 2/18/23 at 9AM. At 9:30AM, we called dimension because we didn't receive the dumpster.  Karen at dimension was polite, but she was the first person to let us know the delivery time is actually a 3-hour window. This was not communicated when we inquired nor when we paid. Karen called the provider, found out they had a problem with their truck, and asked if we could change the delivery date to Monday, 2/21 instead. This was not an option because we needed the holiday weekend to work on a time sensitive project. Karen ultimately offered a provider who could deliver a dumpster between 3 and 6PM on Saturday, but their dumpster was only available until Wednesday and they delivered at 5:35PM.   So, our 10-day booking was cut in half and we lost the first full day of work. I asked about having the rate adjusted and Karen assured us management would be apprised of the issues with our booking and would reach out to us to resolve the rate issue.The following Monday (2/21), Greg Llavore, Jr. (Sales Development Rep we booked with) sent a generic email stating he was doing a \"courtesy follow-up to check on [our] appointment\" and enlisted us to contact him directly for additional bookings in the future. This struck us as an odd approach to resolve issues we thought he'd be aware of. I sent a detailed email about what occurred and directly asked about the rate being adjusted since we paid for 10 days but had the dumpster for less than 5 full days. Greg offered a 15% refund and a discount on a future booking. This offer is not acceptable, which I communicated to Greg. In response, Greg said this was the best they could do due to \"minimum fees in the recycling facility and landfill\" and contended we weren't charged for 10 days since we asked for a quote for 7 days initially. I replied expressing my confusion about the fees mentioned when their Corporate Service Agreement states dimension does not provide waste management or function as a waste management carrier.  Their agreement states the services they offer are use of the tech platform which connects customers with waste management providers. I also sent him the 7-day quote he originally provided, which was less than $720 and again indicated a 15% discount is not an acceptable rate reduction when our rental was for less than half the time we paid for. To add insult to injury, I was issued a $90 refund to my payment method, which is less than 15% of $720.I requested to correspond with a different member of the management team and received no response.  I reached out via the dimension chat feature on the website on 2/24 and corresponded with an agent named Jhicko who said they'd help. They only confirmed my email address and I still have not heard back from management. It has been over 2 weeks since we informed Greg of the booking issues and he has not resolved our issues satisfactorily.The stars are for the provider we ended up with; Jaymes was professional and communicative. I cannot say the same for dimension. I would not book with dimension in the future due to the failure to communicate or resolve the issues with our booking satisfactorily."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darris Ely",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T15:59:49.000Z",
          "Titre": "Recycling",
          "Contenu": "I dislike the run around from the beginning not speaking to a live person.The youg lady i did speak to over the phone was the most helpful. I would call her directly if anything else was needed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keith O'Leary",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T14:05:29.000Z",
          "Titre": "My trash was removed as requested",
          "Contenu": "My trash was removed as requested. However, the provider was not well prepared and brought a too small truck for pick up. This required two trips and the provider charged an additional $50 for this additional trip. The amount of trash did not change from my original quote, so there was no reason for me to be charged more. There seems to be some disconnect between Dimensions and the provider."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T04:09:31.000Z",
          "Titre": "1st time customer",
          "Contenu": "I did not like the response time for when my pickup was. Especially after already confirming when i wanted the pick. Which is seem that it would be possible to do. Other than that, the driver who picked up Rick! He was very professional, smooth pick up, informative and extremely nice. I would recommend him for all my pickups."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fivehundred Frombluechips",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T02:09:08.000Z",
          "Titre": "Had an okay experience",
          "Contenu": "Had an okay experience. I got rescheduled twice and seemed to be hard to find a provider in my area to accept the job. Luckily I wasn't in a rush.Price was very competitive compared to others and the communication throughout was consistent. I would use again but not for an emergency or rush removal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Teflon Bandit",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T17:28:00.000Z",
          "Titre": "Pricing seems excessive for a sectional…",
          "Contenu": "Pricing seems excessive for a sectional sofa.  $50 for each piece when a 3 seat couch is much cheaper.  Should charge for two 3 seat couches instead of excessive for sectional."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T20:42:43.000Z",
          "Titre": "We had two events and they showed up…",
          "Contenu": "We had two events and they showed up for one and no showed for the other. I would have liked to give 5 stars but no showing on an event and then my clients had to pile trash into their cars it was horrible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JRS",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T17:58:29.000Z",
          "Titre": "My original scheduled pickup was…",
          "Contenu": "My original scheduled pickup was canceled and it was inconvenient but when the rescheduled warrior showed up they were professional, efficient, and friendly so three stars for scheduling, five for actual service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T20:10:26.000Z",
          "Titre": "Justin was very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Nufer",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T22:43:57.000Z",
          "Titre": "Overall a quality experience",
          "Contenu": "Overall a quality experience. The price was better than most that I found and I found their website to be really easy to use. I was a bit disappointed by the actual provider, they were somewhat rude and were a day late picking the dumpster up. All in all, I'd use them again, but it was far from a perfect experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Ingle",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T00:07:33.000Z",
          "Titre": "Started out bad but ended well",
          "Contenu": "At first, I was very disappointed with the service. The original contractor never showed up to haul away the old furniture before the new furniture arrived after I tried texting and calling many times. So, I had the new furniture taking up space with the old furniture still here. After an entire day of online chatting and phone calls, the man I was speaking with found a new contractor. He came at 4:45 and took the old furniture out very quickly and Dimension gave me a partial refund."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SueM",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T23:56:55.000Z",
          "Titre": "Moving boxes pick up",
          "Contenu": "The vehicle that showed up to collect my boxes wasn’t what I expected, but in the long run the experience was great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dorothy L.",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T20:28:41.000Z",
          "Titre": "Helpful service",
          "Contenu": "I used this service to remove a large stack of moving boxes and household boxes from my garage that was piling up.  The first trash warrior that accepted the job flaked and did not show up on the date and time requested.  I contacted customer support right away and they tried to get in contact with the contractor but was not able to reach him.  They re-scheduled me with a different trash warrior the next day.  The second trash warrior was much more responsive and texted me to see if they could come out earlier than scheduled.  They gave me a text heads up when they were on their way and were very professional and courteous when they arrived at my home.  I would use this service again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ayesha Tellis",
          "Nb_Reviews": 6,
          "Date": "2022-05-09T21:03:24.000Z",
          "Titre": "Moved into a new place",
          "Contenu": "Having recently moved into a new place, I needed help getting rid of a lot of boxes and packing material. The reservation process was easy and smooth. Day of, my trash warrior was a little bit delayed but he did a really wonderful job. He was accommodating and easy to work with. I had to reach out to CS to get an eta for him before he arrived and I think that is where they can improve a little bit - CS response was a little delayed and slow. All in all, I would definitely use this service again and recommend it to other!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cherie young",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T12:38:18.000Z",
          "Titre": "Dimension was quick to respond…",
          "Contenu": "Dimension was quick to respond initially to set-up pick-up date and time.  I received a text 4 hours prior, that my driver would be arriving within 30 minutes of the scheduled pick-up time of 10AM.  Unfortunately, the driver was still not at my home at 11:20AM.  I messaged Dimension to let them know.  They were quick to respond and connect with the driver.  Ten minutes later Dimension responded that the driver was having vehicle problems and was waiting on a mechanic.  They did not know when they would arrive specifically but would complete the job before 7PM.  A little frustrated to find this out I expressed my concern that we were inconvenienced waiting for the scheduled pick-up.  I explained that I would leave the mattress for pick-up outside.  Dimension acknowledged the outside pick-up and apologized for the delay.  At 2:35PM the driver called and said he was pulling up.  He was polite and friendly over the phone.  He collected the mattress and was professional in-person.  Other than the slight mishap waiting for our driver we would recommend Dimension for their service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Liz P",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T16:09:44.000Z",
          "Titre": "Perfect once they arrived",
          "Contenu": "My pickup came a day later than I’d planned (hence the 4 stars otherwise 5 all the way)but the haulers showed up and took away the items I wanted to be rid of. They were neat, friendly and efficient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "April Hanley",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T14:00:59.000Z",
          "Titre": "Would use again",
          "Contenu": "Having not heard of this company I was reluctant but I really needed this couch and chair removed. So I booked them and the job got done. The ONLY reason for the 4 not 5 stars was that they were late and I had no idea if they were going to show up or not until I got through to customer service to see if the job would get done. Also, reaching customer service isn’t that easy. Otherwise I’m happy it’s done and everything is good. Would definitely use again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T16:51:47.000Z",
          "Titre": "2h late",
          "Contenu": "The person assigned to my booking was 2h late but I was compensated for it so I’m happy about that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yuki",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T21:55:07.000Z",
          "Titre": "Some hiccups but overall good experience",
          "Contenu": "My pickup had to be rescheduled several times due to low availability in my area, but once the job was confirmed it was a smooth experience. The worker actually arrived several hours earlier than scheduled (which could have gone horribly wrong since no one was home at the time), but thankfully I had left out all of the trash for removal outside where it was easily visible, and had also attached photos of the items during booking, so it seems that the worker had no problem identifying and picking up the items. I just wish there had been a way for me to communicate with the worker on the day of the job for a more streamlined experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T18:31:17.000Z",
          "Titre": "Pickup came early and were friendly",
          "Contenu": "Pickup came early and were friendly, only left a few pieces behind, small enough to fit in my bin."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T22:04:55.000Z",
          "Titre": "OK Pick up was late.",
          "Contenu": "OK - Pick up was a little bit late."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim H",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:29:47.000Z",
          "Titre": "Costing was great and communication was…",
          "Contenu": "Costing was great and communication was very good.  Time to complete was a little longer than expected, but it did not affect us.  I would imagine smaller volumes would be quick as lightning with Dimension!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Murray",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T00:10:21.000Z",
          "Titre": "Everything was addressed as promised",
          "Contenu": "Everything was addressed as promised. The pick up person was on on time and removed all material as expected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Sanderson",
          "Nb_Reviews": 4,
          "Date": "2023-12-05T22:42:47.000Z",
          "Titre": "A very good experience!",
          "Contenu": "I had an old upright piano that wasn't repairable, so I just wanted to dispose of it. I found Dimension on the web after a quick search and the process to schedule a pickup for the next day couldn't have been easier. After the pickup was scheduled, I received multiple text messages from Dimension keeping me updated all through the process. And these weren't automated texts, they came from an individual that I could reply to. The gentleman that came to pick up the piano called me when he was on his way and arrived 30 minutes early! He was friendly, professional, and had the piano gone quickly. I am very glad I found Dimension and will use them again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Hammel",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T18:37:16.000Z",
          "Titre": "This company really worked with me to…",
          "Contenu": "This company really worked with me to keep me informed.  First contractor truck broke down,  They contacted me immediatly and we ended up rescheduling another vendor at an agreeable time.  Great customer support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pharmacorr",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T18:11:46.000Z",
          "Titre": "Response time was amazing",
          "Contenu": "Other companies either didn't respond to my enquiry or responded 2 days after Dimension. The quick response was amazing, and the price was also amazing. Once the decision was made to use Dimension, I was pleasantly surprised to find they were able to come that day to pick up the waste."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T07:28:27.000Z",
          "Titre": "The pallets were oversized",
          "Contenu": "The pallets were oversized.  However, the provider worked beyond expectations, and get those large pallets off our hands!The dimension coordinator made sure provider and us connected!We are very pleased with the work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:56:23.000Z",
          "Titre": "Responsive and communicative",
          "Contenu": "Responsive and communicative. But continue to send me emails and texts after I made a review already."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T21:41:52.000Z",
          "Titre": "Everything went off without a hitch",
          "Contenu": "Everything went off without a hitch. Michael and his team were excellent and efficient! Thanks a million!- Bruce"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T01:31:56.000Z",
          "Titre": "Your crew showed up on time and they…",
          "Contenu": "Your crew showed up on time and they were very efficient in moving the item we requested to be taken away. They were also very courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lydia Clarke",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T00:12:13.000Z",
          "Titre": "Great communication and customer service",
          "Contenu": "Dimension was super communicative and timely with their communications. When our first provider ended up canceling at the last minute, Dimension was immediately on top of it to find another provider, and get them scheduled ASAP."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T15:38:22.000Z",
          "Titre": "Fantastic job",
          "Contenu": "The service was flawless! The person who was assigned to the job was communicative and very thorough. He sent several photos of the job when it was complete. I would absolutely use the service again and would recommend them to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Morrow",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T18:42:19.000Z",
          "Titre": "When heavy trash pick up isn't around!",
          "Contenu": "Making this appointment was very smooth. Everything done online. Marvelle was at my house the day after making the appointment. He was on-time, very courteous and moved out my furniture very safe and quickly. I will be more than happy to use Dimensions services again. I highly recommend this company !Thank you! DeniseTotal amount paid$157.50Dimension LogoAddress2261 Market Street, #4061San Francisco, CA 94114BusinessDimension for BusinessCase StudiesCorporate Service AgreementProvidersBecome a ProviderProvider PortalAbout usWho is Dimension?CareersBlogCompany NewsSupportHelp CenterContact usTerms of ServicePrivacy Policy© 2022 Dimension. All rights reserved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debe Sue Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T21:24:51.000Z",
          "Titre": "I could not be happier with my experience",
          "Contenu": "I could not be happier with my Dimension Waste Removal service. I had a last minute pickup needed and was alerted within minutes of a match ready to pick up my items. Service was excellent. Great communication and our service provider was on time, polite and professional. Thank you so much and I will definitely refer you to all my friends and family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T22:58:22.000Z",
          "Titre": "Appreciate the willingness to make things right",
          "Contenu": "Dimension corrected the situation below and helped make it right, which was more than reasonable. I've used Dimension over 10 times for pickups, and never had an issue, but on this particular day -- the provider showed up without help, couldn't load the items and required significant assistance for loading. The quote provided also ended up being under what was charged, which has never happened before.  Their willingness to go above and beyond to ensure future business means I would happily use them again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vegetarian customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T22:11:21.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. Great job on handling trash, the team did it quickly and professionally. Very easy digital interface with the company. I will hire their services again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael & Gayle Lettenmaier",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T02:29:21.000Z",
          "Titre": "The Best Service & Very Reasonable Prices",
          "Contenu": "First and foremost, Trash Warrior was the only company that provided an upfront and immediate quote without us having to enter all of our personal information and signing up to receive emails.   The price that was quoted was the price we paid - there weren’t any surprise add-ons or fees.  The warrior showed up and hauled away our couch and loveseat very quickly.  We highly recommend using Trash Warrior for your haul away needs!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T23:51:15.000Z",
          "Titre": "Easy to schedule online",
          "Contenu": "Easy to schedule online. Despite me scheduling it a few days in advance, dimension texted me the next day asking if I was able to do the pickup sooner as a driver was in the area. So I actually got next day service without paying for it. Thanks Dimension!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 3,
          "Date": "2022-05-19T06:07:15.000Z",
          "Titre": "Awesome company!",
          "Contenu": "Great company, great service, great experience!  Had to dispose of a mattress and small furniture in less than 12 hours and TW saved me big time. Easy to book my appt online, constant communication and updates, and Eric showed up and knocked out my disposal in no time. Would highly recommend for any disposal needs especially same day last minute!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T22:34:03.000Z",
          "Titre": "Great Service",
          "Contenu": "Great Service, easy online set-up, and confirmation. The Debris pickup went as planned. Could not ask for better service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Hay",
          "Nb_Reviews": 1,
          "Date": "2022-05-29T19:01:03.000Z",
          "Titre": "Awesome Experience!",
          "Contenu": "Ben was more than professional and fantastic with helping remove our sectional! He was friendly, kind, and cared about doing a good job! You can tell how passionate he is about his business in one conversation! You will not be disappointed with booking with them! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jas",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T20:15:17.000Z",
          "Titre": "Great customer service, quick and reliable!!",
          "Contenu": "Loved my first experience using Trash Warrior. I'm replacing my sofa so I needed to hire someone to pick up my old one since I didn't know how to get rid of it. I reached out to other companies for a quote and they were quite expensive so I'm happy I found Trash Warrior. Customer service was great they answered quickly and the warrior who picked it up was on time, super quick and courteous!! Will definitely use again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-07-22T00:15:28.000Z",
          "Titre": "Highly recommend!",
          "Contenu": "I've had some old furniture in my garage for months. After learning that pretty much no donation companies will take sofa sleepers, I found Trash Warrior. They gave me a quick quote online and I scheduled my pick up for the next day. Can't believe I waited so long - Justin showed up with a smile and got the (heavy) furniture into his truck in just minutes. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kedar Mohile",
          "Nb_Reviews": 1,
          "Date": "2022-07-31T20:07:31.000Z",
          "Titre": "Cheap, Timely & Efficient Service",
          "Contenu": "The online booking process was easy to understand and offered some discounts as well. I could choose the time slot convenient to me. Submitting photos of the item pick up is good since it gives clarity to the service provider as well.The warrior (James) arrived in a timely manner & completed the job efficiently.If you are looking for junk haul away, I recommend TrashWarrior."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anne Birdseye",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T08:08:07.000Z",
          "Titre": "Truly amazing customer service!",
          "Contenu": "Such a great customer experience. The rep from Dimension (Joe) was so friendly, professional and helpful. He proactively called before arrival to check in. Then he texted me before and after photos, as I was not home but I left the items outside! It was a wonderful experience! In a time when customer service feels completely gone, I deeply appreciate the businesses that truly care."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauren Hubbard Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T03:55:38.000Z",
          "Titre": "Great experience from beginning to end",
          "Contenu": "Great experience from beginning to end! I had a lot of questions and the customer service I received in the chat was fantastic. I was able to get an estimate right away. The “trash warrior” who showed up was super nice and professional. The haul of our old baby grand piano was significantly cheaper than any other company. Will definitely be using this company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn P",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T20:15:29.000Z",
          "Titre": "First time we needed to hire help in…",
          "Contenu": "First time we needed to hire help in removing old furniture from our basement.  Trash Warrior was a great first experience.  They were in constant contact about the status of our job booking and very responsive when I reached out to them.  The team they matched for us were on time, courteous and were very professional, quick and efficient.  Will definitely use them again for our future needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb D.",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T00:15:26.384Z",
          "Titre": "Excellent service",
          "Contenu": "Trashwarrior.com was a great help.  I needed a couple bulk items removed from my home, and the company hooked me up with a local outfit that day.  Moreover, the cost was on average $100 less than the three other junk removal companies I contacted.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AvalonBay Communities, Inc.",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T16:14:54.000Z",
          "Titre": "Very happy with this service.  Would us them again.",
          "Contenu": "Ben from Dimension responded to my request quickly.  The person who picked up our expired hand sanitizer was very nice and polite, and removed the materials very fast.  Everything was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noah Zeidman",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T22:35:50.000Z",
          "Titre": "Great communication, fair price",
          "Contenu": "Booking the service was easy, and they had a coupon code that made it cheaper than any other mattress disposal by far. Amazing communication from my assigned warrior, Michael! He took care of the job in no time. I’d definitely use this service again for bulky items!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lola",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T00:01:09.000Z",
          "Titre": "Good experience",
          "Contenu": "Trash Warrior did a great job finding someone to help me remove bulk trash the same day. It was very easy to book through the website. The first pick up person I was assigned did not show up. I reached out to Trash Warrior customer service, and they quickly confirmed someone else for the next morning. I was skeptical, but the person showed up as scheduled and removed the items that I requested. Thanks, Trash Warrior!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Schimmel",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T21:57:58.000Z",
          "Titre": "I highly recommend Trash Warrior",
          "Contenu": "I hired Trash Warrior after searching the internet for a company that could help me clear out a few items of heavy furniture that were no longer in use -- and found that Trust Warrior offered the best price by far and the easiest method of arranging for their services.  Trash Warrior's website is user-friendly, and the crew that showed up to do the work was on time and very courteous.  I would definitely hire Trash Warrior again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T04:51:51.000Z",
          "Titre": "Got job done despite car issues.",
          "Contenu": "The driver had car trouble and was several hours late but these things happen and I didn't mind. He still managed to show up that evening and pick everything up which was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jess Nolette",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T03:10:21.000Z",
          "Titre": "The service was perfect",
          "Contenu": "The service was perfect! Robert my trash warrior went above and beyond what I expected. I would definitely use this services again, and will be suggesting it to my friends. I also think Robert deserves a raise. Trash warriors kept me informed and checked up after. Highly suggested."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Lim",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T19:19:48.000Z",
          "Titre": "Easy to use and super fast",
          "Contenu": "Easy to use and super fast! Service provider showed up right on time and the entire job took less than 5 mins. Highly recommend it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Whitney M",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T17:03:12.000Z",
          "Titre": "The pickup was done smoothly and…",
          "Contenu": "The pickup was done smoothly and efficiently! The team confirmed my booking request on short notice as well. Would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C T",
          "Nb_Reviews": 1,
          "Date": "2022-07-31T14:05:31.000Z",
          "Titre": "Very professional",
          "Contenu": "From booking to the removal of my old furniture, it was a flawless experience. The warrior that matched with my task knew his job and finished it in matter of minutes. Also their charges are much lesser than the other providers. I’d highly recommend trashwarrior to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew W.",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T21:50:07.000Z",
          "Titre": "Great Communication & Customer Service",
          "Contenu": "There was great communication and you were patient with us while we got approval for the budget spending. Also compared to other quotes you were affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris Gandee",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T18:28:25.161Z",
          "Titre": "I had an unforeseen last minute need to…",
          "Contenu": "I had an unforeseen last minute need to have a large refrigerator removed from my house (on a Sunday no less).  I contacted Trash Warrior by email at 10am.  The earliest time they could promise with such short notice was 4pm that day.  I chose it.  Within 45 minutes, they notified me that they had found someone to do the job.  They kept me posted about arrival times by text and email and everything was done on time by a very warm and friendly, careful and helpful man.  I couldn’t be happier.  I will be a loyal customer in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-09-07T02:04:22.000Z",
          "Titre": "Immediate Responsiveness",
          "Contenu": "I felt that the service and communication was fantastic, the responses were immediate and completely responsive...nice job. I like that I was able to text back and forth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Tebbe",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T18:52:36.000Z",
          "Titre": "Dumpster",
          "Contenu": "We could not get a dumpster at a property up in the hills of Los Angeles, however Dimension got the job done for less than what we were trying to pay waste management."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steph Cihlar",
          "Nb_Reviews": 1,
          "Date": "2022-05-07T14:12:24.000Z",
          "Titre": "Fair price and good service!",
          "Contenu": "Our first driver didn’t show up, but after communicating the issue with the customer service agents via chat and text the issue was quickly resolved and another driver was located quickly and arrangements were made for my junk removal.  The driver that arrived was friendly, quick and efficient.  The process to schedule was quick and easy and I love that the pricing is up front, before you schedule.  Pricing is fair based on comparison shopping.  Overall a good experience, despite an early schedule mishap.  Would definitely use this service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Michaels",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T07:10:05.000Z",
          "Titre": "Trashwarrior.com made the entire process easy!",
          "Contenu": "Trashwarrior.com made the entire trash removal process easy - selection, scheduling, booking, payment, and review after the job was complete. One of the best features of the site is how clearly all the pricing details are explained. These can be confusing with trash removal, depending on one's location, but Trashwarrior spelled everything out clearly and in plain language that was easy to understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Nichols",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T21:06:31.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Website is very easy to use, so booking service is quick. My service was having old but bulky furniture removed and junked. Provider was on time, efficient, and polite. Would definitely use trashwarrior again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlotte Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T23:49:51.000Z",
          "Titre": "Customer Service",
          "Contenu": "My driver was a little late but I was called to let me know. I was kept informed of the arrival time. That means alot. The driver was respectful of my time and property. I love great customer service!!! I will be using this company again in the very near future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nikki",
          "Nb_Reviews": 1,
          "Date": "2022-05-01T15:41:40.000Z",
          "Titre": "Efficient and Timely",
          "Contenu": "I needed an efficient and timely way to dispose of a Queen Sized bed box spring, and I was very happy to have learned about Trash Warrior. Very clear pricing and online experience, and my Warrior showed up right within the time-frame promised. Overall, a pretty seamless experience and I would recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ginny Rider",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T21:12:29.000Z",
          "Titre": "Twice used and will use again",
          "Contenu": "I have used Trash Warrior twice. Each time I had same-day service and it was easy. The teams were efficient and communicative. It's not cheap to get rid of trash but it feels so good and everyone online and offline communicates well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel Jordan",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T02:10:10.000Z",
          "Titre": "Needed trash removal within 24 hrs and…",
          "Contenu": "Needed trash removal within 24 hrs and they came to our rescue. Saved us time and money renting a trailer to hull away house hold/cleaning/moving trash. highly recommend and would use again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Dudley",
          "Nb_Reviews": 3,
          "Date": "2023-10-13T15:37:41.000Z",
          "Titre": "They did an amazing excellent job…",
          "Contenu": "They did an amazing excellent job removing all my packaging from my move. There was a lot too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NNN",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T23:51:25.000Z",
          "Titre": "Job well done!",
          "Contenu": "Rick was amazing. He was very organized and worked really quickly. He was done in under 15 minutes. He was also very polite and courteous. I really appreciate the service I received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Quigley",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T05:17:56.000Z",
          "Titre": "Mattress removal/disposal completed",
          "Contenu": "Booked Trash Warrior for a mattress pick up and disposal. Booking online was easy and allowed me to pick the day and time that suited my availability not the company’s. The warrior assigned to me was on time, efficient and friendly. I was also looking for an affordable price and Trash Warrior came in with a price that was lower than all the competitors for mattress disposal. I will definitely consider using this company again in the future for other trash removal needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Hallmark",
          "Nb_Reviews": 3,
          "Date": "2022-07-10T20:20:32.000Z",
          "Titre": "Great Service Pickup Service",
          "Contenu": "Great service! Good prices. I was notified when they were on their way. They came when they said they would. Very professional and nice. Will definitely use them again and recommend Trash Warriors to others. Great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Cox",
          "Nb_Reviews": 7,
          "Date": "2022-08-11T05:00:41.000Z",
          "Titre": "Super easy online and off",
          "Contenu": "Super easy online and off. I needed a couch picked up and the guy was here with a big smile on his face and great attitude but 11:00am the next day.  Good communication throughout the process.  Very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greta",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T20:56:17.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience! This service was much cheaper than others I found online. The process was very easy and I liked the transparency with the price. My couches were picked up on time and Angel was kind and communicative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cat D",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T03:39:39.000Z",
          "Titre": "2 great experiences, would recommend",
          "Contenu": "This is the second time i’ve used this service and both times i was able to book same day pickups that were professional, on-time and couldn’t have been easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rafeed Kahn",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T19:39:43.000Z",
          "Titre": "Fast and efficient Trash Warrior",
          "Contenu": "Found them through google and decided to give it a shot. Ordering the service was pretty easy. Online website was easy to navigate and setup the job. The person hired arrived fully prepared and performed great. I didn't have to do anything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T22:40:12.000Z",
          "Titre": "I had 2 queen mattresses removed",
          "Contenu": "I had 2 queen mattresses removed. It was a perfect experience, on time, quick, no hassel."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabriella Marie Ayerst",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T19:37:53.000Z",
          "Titre": "Quick, Simple and Professional!",
          "Contenu": "Michel was the utmost professional! Communicated clearly the morning of my pickup and made the whole process seamless. He also had a cheery disposition and positive attitude. The whole trash warriors process was so quick and simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Englund's Catering",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T02:26:03.000Z",
          "Titre": "Communication was excellent",
          "Contenu": "Communication was excellent. Phone calls were returned quickly. Follow up was great as well. Everything was done in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine Renee",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T19:44:31.503Z",
          "Titre": "Fast Cardboard Pickup",
          "Contenu": "The service was easy to use and the warrior came as promised. Service was fast and the cost was reasonable. It would have been nice to find a customer service phone number to talk to someone before booking, but it worked out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T22:42:00.000Z",
          "Titre": "Had a great experience with bed…",
          "Contenu": "Had a great experience with bed removal. Chantele Joy was kind professional, amazing ,fast and efficient with the gentlemen who came with her. I have used Trash Warriors one other time and it was another great experience. I will only use Trash Warriors for any furniture removal needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arthur Moreau",
          "Nb_Reviews": 2,
          "Date": "2022-07-09T19:18:59.000Z",
          "Titre": "GREAT customer service",
          "Contenu": "GREAT customer service.  Caught my 'double booking', called and asked about it.  Again, GREAT customer service.  Mike, on delivery, is also extremely professional.  Use them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T16:48:47.000Z",
          "Titre": "A happy experience with Trash Warriors",
          "Contenu": "The guys arrived on time, worked very efficiently and were pleasant & courteous.  Price was reasonable & i was able to schedule on very short notice.  I’ll definitely use them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin Delaney",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T16:54:36.587Z",
          "Titre": "Rick Payne is the Man👍",
          "Contenu": "I learned today Rick Payne is a one man show he blew me away.  I work from home and was in another room and giving him time to get all my junk out and no more than 10 minutes later he called me and I walked into the dining room and I was totally surprised 😳 everything was gone.  Also he has an Awesome personality and very Friendly.  Thank you Rick ⭐⭐⭐⭐⭐"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Olivia Skotnicki",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T18:24:32.000Z",
          "Titre": "Great service!!",
          "Contenu": "Great service, I had them remove a couch from my building’s dumpster I mistakenly thought I could put in there and they removed it with no issues. I didn’t even realize the guy came and did it lol."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monte Partee",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T22:15:13.000Z",
          "Titre": "Looking forward to using them again",
          "Contenu": "Trashwarrior provided a high quality cost effective service. I had multiple pieces of furniture to be hauled away. The removed everything quickly and carefully. I will be sure to use them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T19:44:59.000Z",
          "Titre": "Damon was just amazing and so helpful",
          "Contenu": "Damon was just amazing and so helpful! He was soon time, efficient and made the whole process so smooth!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natalia Walchli",
          "Nb_Reviews": 1,
          "Date": "2022-05-01T04:43:03.000Z",
          "Titre": "Trash warrior was a great experience",
          "Contenu": "Trash warrior was a great experience . They came same day . The communication was great through the whole process and Kendrick was very professional and friendly . It was fairly priced . I highly recommend Trash Warrior ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dionna",
          "Nb_Reviews": 2,
          "Date": "2023-01-28T02:14:36.000Z",
          "Titre": "Great experience with Dimension",
          "Contenu": "Great experience with Dimension. It was easy to book, cheaper than alternatives, and the person who came to complete the job was excellent (thanks, Eric!). Would book with Dimension again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KARIN PIERSON",
          "Nb_Reviews": 3,
          "Date": "2022-09-29T19:59:19.000Z",
          "Titre": "WE WERE VERY PLEASED USING…WILL USE THEM AGAIN AS NEEDED!!!",
          "Contenu": "WE WERE VERY PLEASED USING TRASHWARRIOR. IT WAS SHORT NOTICE AND THEY WERE ABLE TO ACCOMDATE US IN A SHORT AMOUNT OF TIME. EASY USER PAGE - MICHAEL LOVE WHO HELPED US WITH OUR JUNK WAS GREAT TO WORK WITH!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M Rahmani",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T23:48:36.000Z",
          "Titre": "Good company & reliable",
          "Contenu": "Good company & reliable. I scheduled next day service and the company came on time & at my convenience asked to arrive early for pick up. The pick up technician was polite and friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 3,
          "Date": "2022-08-25T01:18:44.000Z",
          "Titre": "Justin and team were great to work…",
          "Contenu": "Justin and team were great to work with! They were efficient and professional. They kept in contact with me throughout the day so I would know when to expect them. They had to tear the bed frame down and did so quickly.  I would highly recommend trash warriors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ty Garner",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T05:37:58.000Z",
          "Titre": "2Many Boxes",
          "Contenu": "After a recent move we struggled with how to dispose of our moving materials.  Trashwarrior offered a streamlined solution at a fair price.  The contractor they sent, Andy, exceeded expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan Mclean",
          "Nb_Reviews": 3,
          "Date": "2022-09-16T23:02:25.000Z",
          "Titre": "Great service",
          "Contenu": "They did everything they said they would in a timely manner. Customer service responded quickly to resolve a technical issue. The worker was friendly and helpful. I would use this again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T03:29:45.000Z",
          "Titre": "Excellent service",
          "Contenu": "Early. Pleasant, efficient, and professional. Forgot his first name, but last name was Benes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Fountain LLC",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T01:19:24.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, great response from team, and service was done on day and time requested."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T21:41:21.000Z",
          "Titre": "The crew worked long and hard without complaint",
          "Contenu": "The crew worked long and hard.  They were pleasant and courteous.  Unfortunately a table leg cracked open that we are trying to get fixed.  It was a long day for these men to be sure!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica E.",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T00:47:49.000Z",
          "Titre": "Can't wait to have more junk to remove!",
          "Contenu": "Very happy with the driver who came to pick up our junk!  He was quick and efficient,  and would definitely use this service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer L.",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T18:50:30.000Z",
          "Titre": "Easy and Efficient",
          "Contenu": "Booking was straightforward and easy, with multiple time slots available. The person who performed the service was prompt and friendly. Overall, a great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Timm",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T17:23:05.000Z",
          "Titre": "Great and easy process",
          "Contenu": "Great and easily process all around. Website was easy to use and contact with the driver was great. He was courteous and professional. Highly recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Ridler",
          "Nb_Reviews": 2,
          "Date": "2022-04-30T15:09:33.000Z",
          "Titre": "Using trash warrior was quick and easy",
          "Contenu": "Using trash warrior was quick and easy. I set up an appointment, they came by on time and the items I needed gone were removed just as fast.  Will use this service again! 10/10 highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J G",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T00:43:52.000Z",
          "Titre": "Very efficient with plenty of follow up",
          "Contenu": "Easy to book online. Got confirmation right away. Driver was on time and very efficient. Overall, I am glad I used Trash Warrior."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T18:56:58.000Z",
          "Titre": "Streamlined process",
          "Contenu": "Streamlined process, person showed up on time, took care of all boxes, everything went well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patti",
          "Nb_Reviews": 2,
          "Date": "2022-06-06T05:20:41.000Z",
          "Titre": "Always do a first rate job.",
          "Contenu": "This is third time we have used TrashWarror. They are able to schedule very quickly, the workers are always on time, work quickly and quietly. We would not consider calling any one else. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesica Santino",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T19:16:02.000Z",
          "Titre": "Great service",
          "Contenu": "My trash warrior was very helpful! He arrived on time (even early), was kind, and efficient. I would absolutely use Trash Warrior again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky Thompson",
          "Nb_Reviews": 3,
          "Date": "2022-07-29T18:32:46.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Krystal and her team was awesome.  They were friendly and professional.  They were in and out quickly.  I would recommend Krystal and her team to anyone.  Will definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Casey McGuire",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T03:52:33.000Z",
          "Titre": "Great service, highly recommend!",
          "Contenu": "Really great service! I had furniture I needed removed and they had somebody out the very next day. Additionally, the mover was nice, quick, and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T00:06:52.000Z",
          "Titre": "Personal service",
          "Contenu": "Personal service. Easy to reach a person by phone. Prompt response and picked up on time>"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Van Brusselen",
          "Nb_Reviews": 3,
          "Date": "2022-12-09T19:50:32.000Z",
          "Titre": "Trashwarrior!",
          "Contenu": "Have been happy with the jobs this company gives me , great way to make extra income as a freelancer! Most jobs I do alone have been able to split bigger jobs with friends ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Riddiough",
          "Nb_Reviews": 1,
          "Date": "2022-07-10T18:54:48.000Z",
          "Titre": "This was by far less expensive…",
          "Contenu": "This was by far less expensive than other options and the “warrior” assigned to me was amazing! Will use every time from now on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elaine",
          "Nb_Reviews": 2,
          "Date": "2022-08-17T20:22:40.000Z",
          "Titre": "Justin was able to come early",
          "Contenu": "Justin was able to come early, he texted prior to make sure it woud work for us. Very courteous and polite. We'll use again when needed. I'll recommend Trash Warrior to all our friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mayshin Keltner",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T08:10:55.000Z",
          "Titre": "I would highly recommend trash warrior…",
          "Contenu": "I would highly recommend trash warrior when looking for a junk removal company. The crew was very fast with getting everything moved out and was professional and diligent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Francy Crowley",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T01:21:59.000Z",
          "Titre": "He was on time and he also communicated…",
          "Contenu": "He was on time and he also communicated and really wanted to provide the documentation I needed to provide to TuftandNeedle so I could get my refund."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth K",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T16:46:11.000Z",
          "Titre": "I wish I’d done this sooner!",
          "Contenu": "This was so easy to do! I had a mattress and a chair I had to get rid of. I found Dimension online, scheduled it, and on the day and time I requested, they came out and quickly removed my items. I’ll definitely use them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Donaldson",
          "Nb_Reviews": 6,
          "Date": "2023-06-15T04:10:17.000Z",
          "Titre": "Although pickup postponed by a day",
          "Contenu": "Although pickup postponed by a day, crew arrived on time following day and picked up item."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathryn watson",
          "Nb_Reviews": 5,
          "Date": "2023-06-21T21:59:40.000Z",
          "Titre": "Dimension Waste Mgt",
          "Contenu": "They were able to find me someone  that was extrmely nice,professional, anda hard worker."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauro, Carl",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T01:14:00.000Z",
          "Titre": "Greg Llavore and his team were at the…",
          "Contenu": "Greg Llavore and his team were at the ready and able to pivot when needed.  Their response time to my questions was unparalleled and just a phone call away at any time.  Dimension made my job easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Webb",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T19:22:01.000Z",
          "Titre": "really Very Organized-  setting-up the…",
          "Contenu": "really Very Organized-  setting-up the appt-visit-pickup was very easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cisa Payuyo",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T18:26:46.000Z",
          "Titre": "Excellent Work!",
          "Contenu": "Their website is safe and user friendly. They contacted me in a timely manner and answered all my questions. The guys showed up on time and moved my piano safely. I would use them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 3,
          "Date": "2023-09-17T21:58:57.000Z",
          "Titre": "Remodel Debris Removal",
          "Contenu": "Removal was done at a reasonable cost, on time, and the area was left clean."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "clayworks on columbia",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T22:43:34.000Z",
          "Titre": "clean up",
          "Contenu": "very friendly and efficient"
        }
      ]
    }
  ]
}