{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "glocalme.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Chris G",
          "Nb_Reviews": 6,
          "Date": "2023-11-30T18:42:15.000Z",
          "Titre": "Lost €200 no product no reply",
          "Contenu": "Returned the product and never heard of them again. Lost €200. I don’t know where all these positive reviews come from…."
        },
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "Milena VULOVIC",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T23:40:27.000Z",
          "Titre": "Simbox scam and cheat",
          "Contenu": "Our family bought SIMboX devices for hundreds of dollars and not use it for last two years. Now when we need to use it, this company ask for service [100 mins of use] 10€ per month. It is cheating customers! When we bought there is no idea to pay for service, now they ask for 10€ but tomorrow maybe will be 100€... Just for fee coverage 🤣 also, they services are terrible, can not register new user on UK or Serbian mobile number, must ask for link to email registration on WEB. Also, VIP [🤣] membership payment from app does not work, support send me link on web to pay... stay away from this company services and devices."
        },
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "Goran Vulovic",
          "Nb_Reviews": 3,
          "Date": "2023-11-11T16:31:18.000Z",
          "Titre": "They are CHEATERS",
          "Contenu": "They are CHEATERS! I bought two SIMBOX device to use my SIM cards when roaming and paid hundreds of USD for devices. NOW THEY ASK FOR SUBSCRIPTION OF 10€ PER MONTH FOR SERVICE! PLEASE AVOID THIS CHEATERS IN WIDE CIRCLE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Milton V",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T06:56:50.000Z",
          "Titre": "Horrible service",
          "Contenu": "Horrible service, I rented a wifi l portable and connection was really slow, after I used the \"hi speed\" ( was never a high speed), then it never connected to the internet using a 3G network. They site states that it will connect to a faster network then a slower network but its not true. I change to another wifi company and it works a lot better than GlocalMe. Never again. Don't waste your money. Better to pay your own cell phone company or use a sim card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Hagins",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T15:53:09.000Z",
          "Titre": "I just got the Numen Air and I need a…",
          "Contenu": "I just got the Numen Air and I need a dependable connection on the go around my state so I ordered it. They give you a complimentary 1 GB. with just trying it out browsing the internet, keep in mind I didn't download or stream anything and within 15 minutes I had only 120 MB. Fortunately they refilled it for free but the speeds are terrible. The download was around 12 mbps and upload struggled to hit 1 mpbs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 3,
          "Date": "2022-11-30T18:42:30.000Z",
          "Titre": "Doesn't work",
          "Contenu": "I purchased this device and added 2 separate data packages. It has never worked. As a traveling veteran I do most of my medical appointments virtually now. I tried using this device and it never loaded even my emails so I could log on for my appointment. So far I have spent well over $100 for nothing. I am incredibly disappointed with this device"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "JS",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T08:03:24.000Z",
          "Titre": "Horrible customer service ! I made an order which was an incorrect…",
          "Contenu": "I made an order which was an incorrect non existent address. They say it was delivered. So I paid and have not been refunded nor sent correctly anything that I ordered. Therefore - GlocalMe - is not a company to trust."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dr BR Lawrie",
          "Nb_Reviews": 57,
          "Date": "2023-06-17T19:59:06.000Z",
          "Titre": "2.5 hours to set up",
          "Contenu": "2.5 hours to set up. Instructions awful. Did not find the advice at all helpful. Expensive to get data. Totally underwhelmed Would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Mohamad Elrefai",
          "Nb_Reviews": 3,
          "Date": "2023-03-19T10:09:17.000Z",
          "Titre": "do not buy Simbox device",
          "Contenu": "I buy Simbox device, for the last couple of month the device didn't work and couldn't make any call. after a lot of technical call and providing different idea to fix the issue. at the end they told me you can not use the device with iPhone IOS you have to but android phone to use the device. the support very bad and they are not telling the truth. I bay the cost of the device and pay for VIP considering to provide us best services but so far nothing went well with this company. and when ask to return the device they dont accept. I dont recommend to buy from this company as they are not honest."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Chris G",
          "Nb_Reviews": 6,
          "Date": "2023-03-27T09:39:10.000Z",
          "Titre": "DO NOT ORDER! Terrible after sales!",
          "Contenu": "I ordered a Mifi router for a world trip. After I received it was too bulky in my opinion and not as fast connection. So I wanted to return it. And that has been a struggle beyond imagination.They kept saying I had to reach out for anothe rdepartment. Then they said the return time expended. Then they didnt reply. After 3 months I finally got an address to where I could return the product. But they say the product had to be unboxed if I wanted a payback. I have hope that I can return this product according to the law and get a full refund. If that happens I will adapt this review accordingly. But for now, nothing good has come from this company regarding their after sales"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nola Fox",
          "Nb_Reviews": 10,
          "Date": "2022-12-19T00:32:36.000Z",
          "Titre": "You won’t be happy with Wi-Fi that doesn’t work.",
          "Contenu": "They offer a little pod that creates Wi-Fi.   It works 1/3 of the time.  I have to message customer service weekly to get them to make the Wi-Fi work.  They never get a manager for me to report how bad this has gotten and their customer service “Diana” specifically is awful.  I thought customer service meant that you help the customer.  But when I message to say my Wi-Fi isn’t working AGAIN they say, we sorry.  Try again. That’s all they do."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Chris G",
          "Nb_Reviews": 6,
          "Date": "2022-12-27T01:23:48.000Z",
          "Titre": "Not so good aftersales",
          "Contenu": "I have ordered a product with then but it is not what expected, so i wanted to return it. Unfortunately the responsible office will / can not reply to my emails since a month. Super dissappointing and really not nescesarry."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mariana Jones",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T23:13:04.000Z",
          "Titre": "Completely different experience, the second time around!",
          "Contenu": "Editing my original review because I wasn't refunded the amount that I was told I would be (which is what I said brought me to tears) and then to add insult to injury, I was charged twice for a single month! When I reached back out to support like they said I could, I was told the refund was issued to \"stripe\" which is their credit card processor, no way for me to reach out to them. Then they told me to speak with my bank to ask for the refund. Sigh. I've lost over $1000 because they can't track down the refund (or see the double payment in one month). NOT so great afterall....I made an error when purchasing a package for my GlocalMe unit and when I realized my mistake, I asked for some help through the online chat function. \"Lorraine\" answered my message and was incredibly quick to respond, helped me in canceling the subscription and went a step further that I won't go into details about but it brought me to tears! She was kind, efficient, professional and a delight to work with. Definitely 5 stars for \"Lorraine\"!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nola Fox",
          "Nb_Reviews": 10,
          "Date": "2023-01-26T01:12:45.000Z",
          "Titre": "AWFUL BEYOND",
          "Contenu": "AWFUL BEYONDWifi is ALWAYS slow, I have to message the techs through the app to get the to 'refresh' the network, which I have to do daily.  A customer service rep \"max' wasted an hour of my time trying to tell me wifi was working fine when it was taking 4 minutes to load a webpage.  4 minutes and they said 'your wifi is fine.\"  I asked him for a manager and he would not provide one to me.  I am so disappointed in this service beyond"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nola Fox",
          "Nb_Reviews": 10,
          "Date": "2023-02-25T02:23:57.000Z",
          "Titre": "WORST EVER",
          "Contenu": "WORST EVERI have already written a sad review for this device/company.  The company then contacted me to \"make it right\" but get this, i told them since their techs can't fix the wifi speed, it must be the device right?  I told them that, to send a new device and then we can see if its my area or their tech.  The customer service agent agreed, this would be the way to go to fix my CONSTANT issues, I can NEVER upload videos, circle are always spinning and it takes about 2 minutes to load a website.  It's that bad all the time.  once we both agreed that the device may be faulty thats when they stopped responding to my emails!This company is all talk no walk folks.  No walk."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T14:04:15.000Z",
          "Titre": "Failure to deliver the promised service in Egypt",
          "Contenu": "We purchased a 15GB 90 day global BIZ, and then traveled to Egypt for 2 weeks on a tourist trip. While at the beginning,  in the hotel in Cairo (there was a free WiFi anyway), the device seems to operate correctly, after the second day it stopped. During our entire 2 week trip it did not work. Our phones were not able to discover it, or when they were able to discover it, it was showing no Internet connection. It ruined our trip completely.  We relied on this device and it failed to provide the promised service. Immediately after we came back to the USA everything started working correctly again. The Customer Service guy said that they DO NOT GUARANTEE that the device would work in the foreign country. What is it? Why would anybody buy a device and a plan without a guarantee that it would work in the country they are going. Meanwhile, Egypt is included in our 15G plan and it does not state that it is contingent upon available service there. Now they do not want to give as a refund, because \" at some point the device has been working\" and some data has been used\". For me it is clearly an unfair business practice.Besides, their data service proves to be ways more expensive that any SIM card you could purchase in the other country. I cannot recommend GlocallMe. Not the GlocallMe device, neither their plans, nor their customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T17:34:47.000Z",
          "Titre": "25 GB disappeared while I did not use",
          "Contenu": "I used to rent routers from GlocalMe, but purchased Duoturbo a year ago, and used it in Japan this month. I bought a Day pass for 10 days and 25GB $50 plan at same time as I needed full speed to use it for my work. I switched the priority from 25GB to Day pass while I was traveling to save data use, but somewhat while I was on Day pass, 25 GB balance went zero balance from 19.5GB. We did not use Duoturbo for streaming or youtube but 25GB plan x 2 disappeared without equivalent significant activities in just 2 days. This is ridiculous. I explained this to Lorraine and contacted her in two days over one hour to get credit for 19.5 GB but she said that their system showed data all used, so there is nothing she could do, and another technical staff would contact me in a day. This happened 5 days ago, but no action to resolve my problem has been taken by GlocalMe since then.I am scared to use their service now as I feel my data plans 25GB x 2 total $95 somewhat unreasonably disappeared but GlocalMe did not give me a fair credit, so I switched to my carrier’s 15 GB plan which would keep my whole travel period. Now I feel safer as I have used only 3GB in 5 days on my carrier’s plan with basically same intensity of use when GlocalMe showed I used 50GB in 3 days!  I will not use GlocalMe again as I cannot trust their data use administration as well as diligence of customer service any more."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Mohamad Elrefai",
          "Nb_Reviews": 3,
          "Date": "2023-01-09T08:30:07.000Z",
          "Titre": "Not recommended at all",
          "Contenu": "Not recommended at all, the device is useless and they keep dragging the issue. I end up through the device in the grabage"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ray",
          "Nb_Reviews": 6,
          "Date": "2022-12-28T02:30:44.000Z",
          "Titre": "No help with G4",
          "Contenu": "I bought the time for 1 year and I cannot load it to my G4. I have yet to speak to someone that can help me. They sent an email which is no help. I guess I will start all over again tomorrow to make sense of it! I wish I knew where to reach these helpful people, so far I’ve gotten the run around."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Bernd Reimann",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T19:55:31.000Z",
          "Titre": "The service is catastrophic",
          "Contenu": "The service is catastrophic. I bought a Numen Air 4 weeks ago. Now there is a hardware error (can happen), which was confirmed by technical support. However, for a week I have not received any info (despite 3 contacts with the hotline) on how the exchange can be carried out.+++The GlocalMe reply is now another 2 days old and nothing happens. A standard comment without meaning it seriously"
        },
        {
          "Note": 1,
          "Lieu": "BD",
          "Pseudo": "Anisur Rahman",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T12:46:44.000Z",
          "Titre": "I stopped recommending Glocalme's…",
          "Contenu": "I stopped recommending Glocalme's SIMBOX service just after they started charging for outgoing calls. This company's future is very blind. Glocalme is a non ethical company.  It must be announced before buying this device that there will be $10/month charges. Hopefully they will pay the price one day. We have almost 5million members social network groups & every members from the group already started spreading out Glocalme's negative reviews everywhere in social platforms. It may collapse your name n fame."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Anne",
          "Nb_Reviews": 4,
          "Date": "2022-07-18T15:21:50.000Z",
          "Titre": "A TERRIBLE EXPERIENCE",
          "Contenu": "A TERRIBLE EXPERIENCEThis company has NO customer service; no response from chat OR email.They seem to be unable to ship internationally, think that over 10 days for delivery for Central London is fast.2 weeks after placing my order on their site, still no sign of the device despite paying £20 for delivery - which they LIE when they say is free.Hopefully the device actually works in the US and I can then sue for my money back.STEER CLEAR, DO NOT USE, NOT TRUSTWORTHY OR RELIABLE."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 7,
          "Date": "2022-07-13T10:32:42.000Z",
          "Titre": "ABSOLUTELY THE WORST CUSTOMER SERVICE.",
          "Contenu": "ABSOLUTELY THE WORST CUSTOMER SERVICE.Package stuck in customs. Resent via HongKong (to the UK, from Germany!!) allegedly the fastest way - 10 days to wait!!Customer service, a lady who does not understand any English and asks to send an email, despite my explaining I have done so many times.DO NOT USE UNDER ANY CIRCUMSTANCES!!!"
        },
        {
          "Note": 1,
          "Lieu": "ZM",
          "Pseudo": "Jonathan Brown",
          "Nb_Reviews": 1,
          "Date": "2022-07-09T15:50:13.000Z",
          "Titre": "They have just changed the service the…",
          "Contenu": "They have just changed the service the offer, I purchased a SIMBOX from Gocallme 4 years ago, even the quality was lacking, 2 of the 4 sims arrived broken, however the device has since worked without a glitch, however Gocallme have now decided to charge me $10 per month to use thier APP and limit me to only 100 mins per $10 without warning"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Pedro Ng",
          "Nb_Reviews": 3,
          "Date": "2022-07-01T15:38:48.000Z",
          "Titre": "GlocalMe starts charging USD10 / month…",
          "Contenu": "GlocalMe starts charging USD10 / month for using Simbox from today (1/7) but it only announce this subscription pricing on 24th June! Is it reasonable to the customers?  Worse still, USD10 / month can only allow you for 100 mins of voice call. It seems that we go back to early 90s when the mobile phone first launched. This company is too greedy! Will not buy any product / service from this company again!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-05-08T01:30:51.000Z",
          "Titre": "Who is running this company",
          "Contenu": "Who is running this company. I called into the company to get some support and there is one guy who says he is on holiday. So I called back to someone else and the same guy answered. Both times he did not say Welcome to Glocalme how may I help you he said Hi. Like I was calling a non business.   The unit drains to fast and if feels like I am dealing with someone in there garage in a different country."
        },
        {
          "Note": 1,
          "Lieu": "BS",
          "Pseudo": "Agustina",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T22:21:13.000Z",
          "Titre": "Really disappointed",
          "Contenu": "Really disappointed, support is not answering my texts"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T20:12:43.000Z",
          "Titre": "Devices are the worse",
          "Contenu": "Devices are the worse.  These devices are the worse.  Took them try after try to get a signal and even so, it’s still slow.  The device doesn’t really work as a hotspot.  Just because it receives signal doesn’t mean if can share it.  I have a Samsung s7 I put a mint mobile card sim and used that as a hot spot.  Next to each other the SIM card from Mint works better."
        },
        {
          "Note": 1,
          "Lieu": "EE",
          "Pseudo": "VALERIY ROZENBERG",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T10:14:59.000Z",
          "Titre": "ATTENTION SCAMMERS!!!",
          "Contenu": "I have a very bad experience! these are scammers! be careful!!! First I bought a free simbox. Then they told me that I need to pay 10 dollars a month. this is a scam company!!! don't mess with them! be careful"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashlee Parker",
          "Nb_Reviews": 2,
          "Date": "2021-09-30T13:53:43.000Z",
          "Titre": "Inconsistent and expensive",
          "Contenu": "Inconsistent and expensive. The only consistent thing was being connected with no internet. I had to constantly disconnect and reconnect, optimize the connection, only to have to retry every 5-10 minutes. If gets frustrating when all you want to do is stream as tv show. Funny too, customer service tried to tell me I had no data, when I had 82gb of it. If I hadn't known that, I would have to buy more."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T03:31:41.000Z",
          "Titre": "I am not happy with the device as I was…",
          "Contenu": "I am not happy with the device as I was under the impression that it would work when I didn't have cell service or when service was spotty via an internet connection. But that is not the case. So right now I am not happy with the service as it didn't when I needed it. So I am thinking about returning the device."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-15T06:08:31.000Z",
          "Titre": "I don't know how this company operate…",
          "Contenu": "I don't know how this company operate but I order their device 4G Pro for my trip to Japan. I order it on July 4 and paid an extra $29.99 for expedite 2 days shipping as I was going to Japan in July 10.  But the item never arrive, so now I am in Japan a device and have to rush order another operator here in Japan.  The new operator device arrive the next day.  So if you want to depend on Globalme to deliver in a rush (don't bet on them to deliver)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Georgette Wolfe",
          "Nb_Reviews": 1,
          "Date": "2021-05-15T03:07:25.000Z",
          "Titre": "I have purchased 349$ of credit to get…",
          "Contenu": "I have purchased 349$ of credit to get data with. I was sent an email with a passcode , and the number was reported to be invalid. Where did my money go? No one has been able to give me an answer when i called customer service during business hours, or the online service. Now i cant get a respond email either.Can someone please call me or email me, pleeeese."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Sérénus Houessou",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T18:22:58.000Z",
          "Titre": "GlocalMe!!!! Just a scam",
          "Contenu": "Please don’t buy this product (G4 pro). It’s just a scam. I bought it for my trailer to go to camping. Nothing works, I didn’t get any connection. I called them and I got someone at Hong-Kong who didn’t know what I’m taking about. He isn’t helpful. Please think about it before you waste your money. If I can put 0 star, I will."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pedro dePacas",
          "Nb_Reviews": 1,
          "Date": "2021-10-03T01:06:06.000Z",
          "Titre": "I purchased the U3 device hoping to use…",
          "Contenu": "I purchased the U3 device hoping to use it for a cross country motor trip.Tried to connect three different times using the chat window for instructions. Perhaps if there was a live number to call for support I would not have spent four hours trying to get it to work.Plug and play would be nice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arlene  Lum",
          "Nb_Reviews": 6,
          "Date": "2021-04-29T01:48:49.000Z",
          "Titre": "While the representative was courteous…",
          "Contenu": "While the representative was courteous and tried to help, she did not resolve my issue in using the new SIM for purchased for the U3.  It still doesn’t work and I’m very disappointed. I will need to return this U3 when I come back from my trip as it did not work as advertised, despite hours trying to fix it with your tech support."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T14:34:01.000Z",
          "Titre": "Buyer Beware",
          "Contenu": "The service is ok but the packages are way too expensive. The price I paid for 10 GB would of gotten me unlimited data plan anywhere else for a month. I will not be ordering again and I will be returning the device to Amazon that I already paid $80 for. So it's too expensive all the way around. I do not recommend anyone purchase this device."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Lerohl",
          "Nb_Reviews": 3,
          "Date": "2022-06-08T22:10:37.000Z",
          "Titre": "Your incredibly cumbersome activation…",
          "Contenu": "Your incredibly cumbersome activation process for the device meant I could not do it myself, but had to rely on a friend to do it for me.  Your manual for operating the device is essentially useless."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "A M Beraza",
          "Nb_Reviews": 3,
          "Date": "2021-10-25T17:50:26.000Z",
          "Titre": "You pay them and they don't send anything to you!",
          "Contenu": "I paid over 270 USD to GlocalMe a few weeks ago and have not yet received my device or order. Quite incredible!!! Where is my device?Your bank reviews in regards to your customers are part of your Business. You can not block shipments paid already for some strange reason."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T17:26:01.000Z",
          "Titre": "Expensive",
          "Contenu": "Expensive - with poor personal customer service. The way in which the data gets used ensures - if the customer is not careful - that the data allotment you've paid for will get used quickly. We've found this service helpful yet frustrating. For a portable hotspot device without paying a monthly subscription, it is one of the few options out there. If there were others, I would certainly consider switching."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kanyptian",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T14:41:33.000Z",
          "Titre": "Random Upgrades, Poor Customer Service",
          "Contenu": "Very difficult to get in touch with customer service. Very obvious they have limited English skills. No one can actually “walk you through” the dozens of steps it takes to upgrade the firmware. The device gets randomly upgraded without prior notice and when you need it~ it takes more than 1/2 hour to upgrade.I wouldn’t recommend this MiFi to my worse enemy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brady Garver",
          "Nb_Reviews": 1,
          "Date": "2020-10-20T15:29:18.000Z",
          "Titre": "Country Coverages Aren’t Accurate",
          "Contenu": "bought it for when I go to the Middle East super excited only to find out that your actual locations where it says it has coverage is not true at al customer service was not helpful they basically said it’s your problem not ours. Very displeased. I’m not contacting you back because it’s pointless the first person I spoke to there said that it’s covered but on mine it’s not which makes no sense and they told me that it’s my issue not your companies issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Hernandez",
          "Nb_Reviews": 1,
          "Date": "2021-05-30T04:37:16.000Z",
          "Titre": "Never was able to connect to the wifi",
          "Contenu": "Never was able to connect to the wifi. Customer service was terrible. Mike was the worst, he kept asking me to move places after telling him several times I could not leave where I was because I was traveling. Returning the device as it’s a piece of crap. Please don’t purchase this product"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 2,
          "Date": "2021-09-30T09:45:13.000Z",
          "Titre": "Just total waste of money",
          "Contenu": "Just total waste of money. I've gone back to using my own telco roaming services. I purchased USD90 of data which got used in just 3 days which is bonkers coz I wasn't downloading a single thing - just surfing internet trying to book hotels and restaurants..I had 2 devices on my Glocalme, but I made sure to turn Wifi off on my phone, whenever I was using my laptop, and vice versa. Still, somehow managed to eat through all that data so quickly. In addition to this, battery life of the device is ridiculously bad. I would put it at 2-4 hours, which is a lot less than an iPhone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T11:23:47.000Z",
          "Titre": "The Rates and Data plan for Kuwait…",
          "Contenu": "The Rates and Data plan for Kuwait aren’t good. The cost for data are extremely high for the little data that a person receives. “I AM NOT ASKING FOR ANYTHING TO BE FOR FREE”! However, please have some reasonable and functional data plans. $37 for 3GB is ridiculous as well as $217 for 12GB. The data will only last you a few hours in one day. Why is it like that? Also when you data runs out you have to begin the device binding all over again as though you never registered the device. Multiple issues that needs to be fixed."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T20:59:17.000Z",
          "Titre": "$100 USD is what I paid for a World…",
          "Contenu": "$100 USD is what I paid for a World Wide use package. Only Problem ... it had an expiry date. August 2020. Well COVID hit. Emailed support over 10 times, asking kindly if they'd give me a credit, an extension ... they gave me NOTHING.SHAME!!!!!!Don't support this company...they WILL NOT SUPPORT YOU."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 2,
          "Date": "2020-10-12T14:09:10.000Z",
          "Titre": "Avoid this subpar product",
          "Contenu": "I bought the device for a 6 week trip in hopes it would keep my phone usage down. It worked for 8 days and died. Customer service told me to charge it overnight and see if that would fix it... what a joke! Subsequent interaction with customer support was just sad and did not resolve the issue of a subpar product. I regret purchasing the device and would certainly not recommend others make the same mistake. I am left with a giant phone bill and a $250 paperweight that isn’t even aesthetically pleasing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 2,
          "Date": "2020-09-22T18:06:35.000Z",
          "Titre": "Very disappointing!",
          "Contenu": "We were told that the Gocalme network would work anywhere. Wrong. We recently went to the mountains in Virginia. The unit was totally unreliable! It would work for a while, and lose the internet just when you composing an email, or looking up something on Google. Try something better."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer Richard",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T18:10:21.000Z",
          "Titre": "Expensive and expiring data",
          "Contenu": "Expensive and expiring data.  Not a good deal at all.I only use Glocal because we don't have access to a phone plan as a non profit.  Glocal is pricey for what you get and the expiring data makes it even more expensive.  I recommend only if you have no other choice."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T02:52:25.000Z",
          "Titre": "Very bad support service",
          "Contenu": "Very bad support service. I wrote an email to explain my problem but did not get a reply. Then next is an email from Glocalme asking me if this item ticket can be closed, leaving my problem still not solved. I called the support line but the person said I can only to write in to Glocalme. I have an unsatisfactory experience using the device. The connection always dropped and sometime during call will just suddenly hang. I want to return and get a full refunds on the Mini-Turbo device I purchased. Interesting thing is the support line told me that Mini-Turbo has no Hyperconn which I thought I read it on Glocalme website that there is, so that was why I brought it. ver disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "June",
          "Nb_Reviews": 4,
          "Date": "2020-10-12T14:05:22.000Z",
          "Titre": "I sent my unit back twice!",
          "Contenu": "I sent my unit back twice. It was not at all what I needed. They have the unit and my money. Horrible service, their native language is not English and is so difficult to just talk regarding my refund I have kissed  that money goodbye. Big time swindlers!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kent Brown",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T02:05:15.000Z",
          "Titre": "I don't believe trust pilot rates this…",
          "Contenu": "I don't believe trust pilot rates this company so high new purchase is still unusable tech support links and phone dead chats useless"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laurie Lange",
          "Nb_Reviews": 2,
          "Date": "2020-09-22T17:44:09.000Z",
          "Titre": "I was not impressed with the service",
          "Contenu": "I was not impressed with the service. I purchased the highest level of data possible (unlimited) and could barely get any signal. I ended up tethering my phone and that was a more stable connection. Money wasted on the device and the useless data plan."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jennifer Wheeler",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T17:50:22.000Z",
          "Titre": "Is there a zero star rating?",
          "Contenu": "Is there a zero rating? Unfortunately, I rented a device, and the thing couldn't even turn on/charge. I had no internet access during my trip that I was supposed to be working. If you don't have a backup plan, don't trust them. Most people would lose their job in this case! I am being issued a refund, but I wouldn't be able to trust this company again for the 10 days of work lost. I had to interrupt my trip and travel several hours into the city so I could do work. I don't recommend trusting them! Will certainly be trying a different company/device in the future. They even sent me an email asking if I'd like to purchase the device that didn't even work - lol. no thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose",
          "Nb_Reviews": 1,
          "Date": "2021-04-06T14:16:53.000Z",
          "Titre": "The product is not what they say they provide !!!",
          "Contenu": "I bought this product because it said that the network was excellent, that there were no connection problems.  I received my product, it was easy to configure it, but when testing the network I did not have any type of connection, I rebooted it and connected not at the speed that they indicate but it worked for a while and then the videos started to stop I had to wait a long time for  to keep running and the truth is a very uncomfortable situation for me because it is not what I expected.  I tried to get help with customer service but since my language that I understand the most is Spanish, I spent a long time on the line trying to get someone and in the end they hooked me on the call."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Liberté Bisoux",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T18:43:53.000Z",
          "Titre": "Don't buy the device. It is a scam!",
          "Contenu": "Horrible experience with the device. I bought the device and it wouldn't work on the roads. The only way to get help is via email. So it requires to have internet but as the device is not working no internet. You see the run around for getting help. Then, I had to renew the data plan for the device that is not working. I used the link their website provided to buy the data plan. Guess what? The device is not working. It took me two weeks to get help and have the device working. Finally, the device worked for two weeks. I was told then that the data plan would last for a month starting 6/21. Guess what? on 07/07 the device stopped working. Now, I am being told three days later that I need to buy another data plan. Don't buy the device! it is a scam!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-25T21:43:41.000Z",
          "Titre": "It worked great for about a week",
          "Contenu": "It worked great for about a week. Then we tried to use it on a trip and it stopped working. We had in charger and I bought the big package of data. Still nothing. We waited several hours. I bought another package thinking the other one did not go through. Still plugged in. Nothing. We tried different outlets. Nothing. After many attempts I was able to email someone. Their solution - did you try charging with different outlets? YES outlets and cords nothing. We needed the data for work - so I had to buy a MIFI from a phone store at a truck stop. It was perfect with NO problems. I wanted to return the device that does not work and get a refund for useless data. I am beyond over with this product and its customer service. I am now out with them about $265. Never again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T13:44:13.000Z",
          "Titre": "Your prices are terrible.",
          "Contenu": "Your prices are terrible.Had I known what data costs from you - I never would have purchased the hardware.  I should have purchased Sapphire which cost 1/10 the amount your data costs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shane Totman",
          "Nb_Reviews": 2,
          "Date": "2020-10-12T14:52:47.000Z",
          "Titre": "Insane prices",
          "Contenu": "The prices in the United States are ludicrous. Im better off getting a data plan on my phone. Bring back 10$/month for a gig. Theres no way I'm paying like 40$ for a week of wifi."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg S.",
          "Nb_Reviews": 1,
          "Date": "2021-08-21T18:06:07.000Z",
          "Titre": "Never received the voucher",
          "Contenu": "Never received the voucher.  Traveled on my trip, carried my useless device with me since I had no service because voucher was never received.  Will be seeking refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sundew Mosher",
          "Nb_Reviews": 2,
          "Date": "2021-07-21T18:32:24.000Z",
          "Titre": "Just use your cell phone as a hotspot…",
          "Contenu": "Just use your cell phone as a hotspot and save a ton of money. There are no affordable GlocalMe plans for video streaming etc. I’m quite unsatisfied with the product."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Kimball Beard",
          "Nb_Reviews": 21,
          "Date": "2020-09-24T15:26:15.000Z",
          "Titre": "My device did not work at all",
          "Contenu": "My device did not work at all.  Could not choose any options at all.  Terrible situation.  At one time a great device, perhaps I will bu y a new one when I get back to Getmany."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-20T11:48:26.000Z",
          "Titre": "Little to no signal when other people…",
          "Contenu": "Little to no signal when other people had good cell service. Also I had over 2 gig just disappear in two minutes with only my phone on the hotspot and was not streaming."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose huitron",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T17:49:34.000Z",
          "Titre": "Could use better prices and evaluated…",
          "Contenu": "Could use better prices and evaluated plans for data packages, also longer expiration dates in terms of data packages length or longevity.!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sundew Mosher",
          "Nb_Reviews": 2,
          "Date": "2021-07-23T18:53:39.000Z",
          "Titre": "I am very disappointed with the data…",
          "Contenu": "I am very disappointed with the data plans available for this device. Just use your cell phone as a hotspot unless you want to pay too much."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "H B",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T18:26:26.000Z",
          "Titre": "Awful customer service",
          "Contenu": "Awful customer service. Terrible product. Does not work. Waste of time. Scam. They won't let me return the device."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T18:20:26.000Z",
          "Titre": "Not worth it",
          "Contenu": "Can barely connect and you loose minutes so quickly so its too expensive. Connecting to local wifi is faster, cheaper and better"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "June",
          "Nb_Reviews": 4,
          "Date": "2021-07-10T17:04:34.000Z",
          "Titre": "SCAM!",
          "Contenu": "It has been over a year. I am on a fixed income and Glocal me kept my money and product. Don’t try Glocalme this is a scam!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carole lloyd",
          "Nb_Reviews": 3,
          "Date": "2021-09-13T01:22:40.000Z",
          "Titre": "Totally unhelpful and my first 90…",
          "Contenu": "Totally unhelpful and my first 90 dollars did not last at all. Could not log on and at this stage I would like a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "carmen jimenez fernandez",
          "Nb_Reviews": 2,
          "Date": "2021-03-08T01:42:50.000Z",
          "Titre": "Service is very slow",
          "Contenu": "Service is very slow, I got 36 gb an is not as fast as it promise for USA, I need to call all the time to reset the system"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T08:19:04.000Z",
          "Titre": "Very bad experience",
          "Contenu": "Very bad experience. Even though the signal was 5G and I had a 5G plan, the speeds were unacceptable."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T18:18:12.000Z",
          "Titre": "With any sim card it only work in 3g",
          "Contenu": "With any sim card it only work in 3gWith sim card GlocalMe consume 100M per minutes even if no device is connected to it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T17:19:32.000Z",
          "Titre": "the wifi don't even work for atleast a…",
          "Contenu": "the wifi don't even work for atleast a hr i spent all this money for me to not have any wifi still"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T18:46:22.000Z",
          "Titre": "The device thought i was in France",
          "Contenu": "The device thought i was in France a lot of the time could not use uk websites wasted most of my data"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-10T11:10:30.000Z",
          "Titre": "if any money is taken out of my account…",
          "Contenu": "if any money is taken out of my account my attorney will be filing  a suit against your company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Xxsale_queenxX",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T13:48:24.595Z",
          "Titre": "The data runs out too fast its too…",
          "Contenu": "The data runs out too fast its too expensive and traveling looses signal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T05:42:51.000Z",
          "Titre": "WiFi connection kept breaking",
          "Contenu": "WiFi connection kept breaking.  I had to call their help support every day.  Bad WiFi!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dutertu",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T17:13:32.000Z",
          "Titre": "Bad expensive",
          "Contenu": "they say it's unlimited but none of that and the plans are a bit expensive"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T13:48:19.000Z",
          "Titre": "Did not work .",
          "Contenu": "Did not work .. signal extremely poor .. so didn’t deliver on what it is supposed to do"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "G-fourpro customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T20:52:28.000Z",
          "Titre": "Poor customer service...need to listen…",
          "Contenu": "Poor customer service...need to listen to customer concerns the first time 😡Bought on Amazon.ca in Canadian currency ... was to get the 8GB data with purchase..but was not included...took over a month to get it. They did not include 33data Xmas bonus offered to me via email...was told to refund G4 pro through Amazon and re-buy directly thru GlocalMe 😡. I was not going to play this game - and thus would need to wait another 2-3 weeks for a new G4pro and only to pay delivery fees and then be charged funds in US$. Note: I trust Amazon customer service...I did not know about GlocalMe service yet. But I’m starting to see it.GlocalMe Data prices are high ... and what makes it worse ...only in USA currency which is a 1.32 times more expensive due to exchange rate. I hope GlocalMe still values Canadian customers...and honour offers/free shipping/bonuses etc.There is no ticket system, and no followup on complaints. Have to tell our story to each agent over again.GlocalMe Support team made a promise to resolve over phone, only to change their mind by email.  They then apologized for not honouring original fix....then offer a 1GB free for our inconvenience but still have not done this either.Do better GlocalMe!Please keep your word and honour your service commitments especially when customers have prepaid you!G4Pro customer"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "J Montana",
          "Nb_Reviews": 7,
          "Date": "2022-01-22T01:07:57.000Z",
          "Titre": "CARA  the company NIGHTMARE",
          "Contenu": "CARA  the company NIGHTMAREMy experience was absolutely horrible, it began with a woman name CARA. Not only did she know less about the product then I did but she was shockingly hostile its like she trying to destroy the company reputation purposely. After losing my mind with CARA I was finally transferred to a woman named YoYo who I was surprisingly very professional and loved her JOB, she turn things around and quickly gained my trust . She was very apologetic and understood CARA had created a bad situation .  Finally she offered us 10gb of free time for all the trouble and we agreed to continue .The next day we were surprised to find the 10GB of free time had vanished , we went to bed late setting it up and it was impossible to use up 8gm in one night .we called to complain only to get TECH DEPT spreadsheet BS that proved NOTHING, but our FREE Welcome package had vanished.The product it self seemed very good quality, but if they can steal your package then there is no point so we returned it .Of course who was put incharge of REFUND .... You Guessed it CARA the same NIGHTMARE employee She then decided to CHARDE US FULL price for the PACKAGE THEY Gifted US FREE  !!!! You cant make this up !!!I return the Equipment @ my own cost only to receive a email from CARA saying she had REFUND a CARD 8113  ...That must be her Boyfriends card she sent my refund to because i have NO CARD 8113.  So im still trying to get my money back and may end up filling FRAUD charges on this company ...  BUYER BEWARE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JO",
          "Nb_Reviews": 2,
          "Date": "2020-09-22T17:59:48.000Z",
          "Titre": "Does not work like a cell satellite or…",
          "Contenu": "Does not work like a cell satellite or grab a weak signal and make it stronger."
        },
        {
          "Note": 1,
          "Lieu": "ID",
          "Pseudo": "Bachtiar",
          "Nb_Reviews": 2,
          "Date": "2021-08-07T05:09:41.000Z",
          "Titre": "Misleading promotion",
          "Contenu": "Wrong promotion bad compensationNot the way to treat your loyal customer"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "michel van welden",
          "Nb_Reviews": 2,
          "Date": "2020-09-22T17:49:23.000Z",
          "Titre": "I bought 3 G  for Mexico",
          "Contenu": "I bought 3 G  for Mexico, I was never able to use them Really bad"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T16:12:07.000Z",
          "Titre": "The item I bought doesn't work with my…",
          "Contenu": "The item I bought doesn't work with my cell provider"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T21:20:15.000Z",
          "Titre": "Great service",
          "Contenu": "Great product to use on the go! I recommend to any one"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T09:59:01.000Z",
          "Titre": "Not to what I expected",
          "Contenu": "Not to what I expected, poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T21:42:47.000Z",
          "Titre": "Don't know what parcel you are talking…",
          "Contenu": "Don't know what parcel you are talking about,"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Allan Rosenberg",
          "Nb_Reviews": 112,
          "Date": "2020-09-23T16:53:13.000Z",
          "Titre": "Expensive and non-functional",
          "Contenu": "Expensive and non-functional. I have scrapped it."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Paul McHardy",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T02:51:10.000Z",
          "Titre": "Flawed In-App purchase Wasted More time than data was worth!",
          "Contenu": "I have had the GlocalMe device for a few years now and it has generally worked well.  I have purchased a few data plans over the years and this process has generally been smooth.  Unfortunately my last experience was anything but.  I used the GlocalMe app to try buy a plan but was faced with a shipping fee for the first time.  Why there would be a shipping fee when buying data for a mobile wifi device is beyond me.  I asked the in-app agent for advice and was told to use the pickup option (even though the pickup option had a disclaimer saying it wouldn't work due to COVID).  I followed his advice and purchased the plan with the pickup option but no data plan was delivered to me.  I then spent the next two hours with another agent trying to get my data.  Even though I provided them with screenshots of my receipt and invoice with an order number and email confirmation they could not \"find\" my order.  Eventually they said that my purchase had gone through their webservice (not the app) despite the fact I had only used the app for the entire process.  The agent tried to tell me to contact their webservice to sort the problem out but I refused.  He then said he would check with them himself and came back to tell me that I would get an email voucher in the next few minutes.  This took longer than expected.  Eventually the email (with help from the agent I suspect) came through and I received the data.  In the end the data purchase cost me two and a half hours of wasted time (definitely not worth the cost of the data).  I don't know what changed or if this was just a glitch but the whole process with the app was flawed.  Being charged a shipping price for buying data that is sent electronically is absurd and then having to spend more than two hours getting permission to access some electrons I had already paid for was galling to say the least.I liked the service that GlocalMe provided but if this happens again, I won't use it anymore."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Leslie",
          "Nb_Reviews": 2,
          "Date": "2022-08-05T10:01:06.000Z",
          "Titre": "Buyer beware. Customer service is a nightmare and EU GlocalMe is NOT an EU based company.",
          "Contenu": "I recently purchased a hotspot from GlocalMe directly from their EU site, which has a German mailing address. I ordered this in advance of a trip within my own country (Ireland) in an area where service from my cell phone company was a little poor but other providers had better service.As I ordered from a German website, I assumed (incorrectly) that the hotspot would be coming from Germany. I received a shipping notice 4 days later stating it was about to be shipped from Hong Kong and had not even left their warehouse yet. Realising this was going to be too late for my trip, I emailed customer service to cancel my order because I knew it would be too late. I received no reply.Two days later I received another shipping notice that the hotspot had left Hong Kong. I emailed once again saying I no longer wanted the hotspot and that I had tried to cancel my order two days ago. Again, no reply.Unfortunately, I ended up having to order a different GlocalMe hotspot from Amazon.co.uk. I try to avoid using Amazon, and thought by purchasing from an EU site, I was supporting businesses within the EU. Of course, I was wrong, but the GlocalMe hotspot from Amazon arrived in time for my trip.Yesterday, 9 days since I sent my original email, I received a call from DHL saying I now owe €32 worth of customs charges for a hotspot I have repeatedly tried to cancel. For a hotspot I ordered from an EU website. As I live in Ireland, and ordered from a business posing as a German/EU business, I would not expect to pay customs fees.I have now been “dealing” with online customer service for the past two days who repeatedly tell me to “email customer service there is no other solution”. I sent a third email yesterday. Still no reply and online customer service keeps saying “hold for an email reply”. I have been holding for 10 days with not even a “we have received your email and are looking into the matter” reply. My requests to escalate to a manager are met with “no one is available.” The online customer service person claims they do not know where the email response people are located or who they are. There is no phone number. They simply claim “hold for email.”As for the workings of the device itself, we were using it for a cottage with no wifi. It turns out my own mobile service works ok, but this thing absolutely chews through data. We went through 10gb a day for two days on GlocalMe, then my husband tethered everything to his phone and we were using far far less.Customer service is non-existent with this company. I am now out €140 (plus an estimated €32 of customs owed) and hours of time dealing with them. Do not order from GlocalMe."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-04T15:28:51.000Z",
          "Titre": "Poor customer service",
          "Contenu": "I had purchased additional 50 GB for $99.99 and I never got it uploaded on my devise. The devise comes automatically with 8 GB which I used up in the first week. Not knowing that the other 50 GB were not loaded on my Devise, all of a sudden the devise was not working. I call the customer service company 3 times in one day, left messages and I also sent a detailed email to the customer service with all of the ID numbers on my devise to the email that was on the paperwork and never received a response. I called the following day again and someone answered from I think China. I explained to the person ( a lady) that I could hardly understand and in the background was another person talking Chinese to probably another customer on another line and she was talking so loud I could hardly hear the person I was talking to. The lady I spoke to wanted me to send the confirmation email that I bought the extra 50 GB which by the way it is only 36 GB I guess the 50 GB gets converted to 36 IN American. I never received the email confirmation of the purchase so I emailed a Screenshot of my account being charged. I call the lady back and asked if she received my email and she said yes but I would have to call back later after 1 AM My time because they were closed now. Unbelievable!!I called the next day and spoke to a Gentleman, his name was Max. He was very helpful. Had to explain everything to him again and again he asked me to send him the confirmation that I purchased the 50/36 GB. He said it would be in my Globalme app on my phone, but it wasn’t. He then asked me for a code # on my devise which I gave him and he did see my email with my screenshot of the money being charged to my account and asked if it was ok that he could upload remotely the extra 50/36 GB to my devise. Duh!! I said of course. So that is what he did and the devise worked again. I had asked why didn’t the lady I spoke to yesterday just so what he did. Naturally he said he didn’t know but I should be all set. Bottom line, very poor customer service for this product. It took 3 days to get something resolved that could have and should have been done the first day of trying to reach the customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T14:50:28.000Z",
          "Titre": "Totally dissatisfied with service"
        },
        {
          "Note": 1,
          "Lieu": "KW",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T13:17:17.000Z",
          "Titre": "Expensive for not that much data"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 2,
          "Date": "2020-09-23T16:37:08.000Z",
          "Titre": "Services and Prociss wasnt Good.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Renter",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T02:29:45.000Z",
          "Titre": "It is unusably slow."
        },
        {
          "Note": 1,
          "Lieu": "CY",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T02:12:21.000Z",
          "Titre": "Very difficult to set up"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-03T15:57:50.000Z",
          "Titre": "Very slowly connection"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T21:20:24.000Z",
          "Titre": "Still hasn’t  arrived"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T14:00:24.000Z",
          "Titre": "very very very slow."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T15:59:12.000Z",
          "Titre": "Poor customer services",
          "Contenu": "Online service operator did not honour the promise to get coupon on purchasing replacement device. Basically no follow up"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-06T02:50:25.000Z",
          "Titre": "Glocalme Is Expensive in Kuwait",
          "Contenu": "When comparing Glocalme to sapphire in Kuwait unfortunately Sapphire is a better deal. I did not appreciate that it cost $72 to get 8GB of data while you cam get 8GB for $15 with sapphire in Kuwait. As a matter of fact 250GB with sapphire costs $98. I didn't have any issues with service but it is expensive. If Glocalme can work on this I'd give it 5 stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "First time User - not the best",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T19:45:50.000Z",
          "Titre": "GlocalMe rates are very high for the US…",
          "Contenu": "GlocalMe rates are very high for the US when using their own plan and the G4 Pro device we got is not as universal as advertised.  We got a T-mobile prepaid SIM card specifically for hot spots with 40 GB of high speed data and turns out the G4 Pro is not compatible with this card."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KF Ft Lauderdale",
          "Nb_Reviews": 1,
          "Date": "2021-12-12T14:32:19.000Z",
          "Titre": "Here in Fort Lauderdale the connection…",
          "Contenu": "Here in Fort Lauderdale the connection is very very slow, less than 1mb up and down, so it makes it really hard to use it, can't receive pictures or use video chat at this rate, so not good. I have full 4G on the device, but seems like low  bandwidth. That's the only reason for low rating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T02:44:16.000Z",
          "Titre": "At first this worked well for us",
          "Contenu": "At first this worked well for us. We got the 50gb plan for a month and outr devices ran smoothly for the most part. As a family of 3, this plan ran out in 8 days. This was with us trying to keep our phones and iPads disconnected. Needless to say at $89 for 50gb that lasted 8 days… this has been way more expensive than a regular internet provider. We are currently in the process of setting up regular internet service and will be disconnecting GlocalMe soon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christie",
          "Nb_Reviews": 2,
          "Date": "2021-08-13T19:19:46.000Z",
          "Titre": "Unfortunately this WiFi device does not…",
          "Contenu": "Unfortunately this WiFi device does not work well.  It has had problems since day one.  We use it in a remote area in Texas and it does not keep a signal.  We upgraded our plan a couple of times to see if that helps and it doesn't.  Not sure I would recommend this device to anyone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-27T13:08:47.000Z",
          "Titre": "Not great",
          "Contenu": "The service from this device is spotty in a place with excellent reception otherwise (my home) and the cost is insanely expensive compared to similar offerings by other companies. I’m only using this service until I have time to fix my other service account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-08T01:21:51.000Z",
          "Titre": "Kinda sorta disappointed, was hoping for and expecting more!!",
          "Contenu": "Getting set up was a breeze, and the first time I turned it on it was amazing! Great internet and I had 3 devices connected. However, each day since then has been super spotty!! Pages are taking forever and a day to load, forget about trying to watch anything. I have 50gb worth of data, and I might not even make a dent in it because of how frustrated I am becoming."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T14:19:16.000Z",
          "Titre": "The hot spot does not connect in every…",
          "Contenu": "The hot spot does not connect in every area, even when wifi is available.  The charge for 1 gb for 1 week used to be $9.  The same amount of data is now available for 30 days but costs $35.   It feels like a scam.  I usually have to buy more data to get through a week when I travel.  GlocalMe almost tripled the price simply by extending the time the buyer has to use it.  Scammy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T19:09:56.000Z",
          "Titre": "NO Internet Connection-Laptop or Cell",
          "Contenu": "Unfortunately this will connect to my cell phone, but NO INTERNET, and my home laptop, will connect but NO INTERNET service.  On my cell phone the only thing I can do is email.  Not even that on my laptop.  For an expensive unit this is a loss."
        },
        {
          "Note": 2,
          "Lieu": "UA",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-19T16:44:58.000Z",
          "Titre": "Very slow, very unstable connection, and very expensive.",
          "Contenu": "It's very expensive,i have not received  the amount of data I have paid.The connection was very slow, and every time I had to reconnect, however the data was running out very fast.At same amount of data I have watched videos online used torrents, and used IP telephone all month long. in case of \"GloCallMe\" all said above was barely possible and data ran out in an hour. Worst, expensive internet ever."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lloyd Dennis",
          "Nb_Reviews": 2,
          "Date": "2021-03-29T15:12:36.000Z",
          "Titre": "I have one problem with the Glocalme G4…",
          "Contenu": "I have one problem with the Glocalme G4 Pro.I have a problem with the Display Brightness control.It's doesn't stay where you can see it well, it's either to bright or way to dark.I would like to control the brightness level myself, that would be nice.Other than that it's good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-22T03:55:31.000Z",
          "Titre": "Its a gr8 divice all work realy good…",
          "Contenu": "Its a gr8 divice all work realy good just struggle to get it started so it will pick up service coud not use it when i was in south africa it did not pick up there serv provider when it put in a sim card in it"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Jahangir",
          "Nb_Reviews": 1,
          "Date": "2020-12-30T18:00:26.000Z",
          "Titre": "Poor Call Quality / No Complaint Ticketing System) /",
          "Contenu": "Call quality is very poor.There is no ticket system, so you cant followup onnur complaints. You have to tell ur story to each agent from scratch.Call logs doesn't update incoming calln status.If you save any new contact in app ,it wont appear in your regular mobile contact list.Calls auto recording feature is not available, even manual call recording is not working.Chat Support team is not capable enough to resolve the issue and as per their technical team fault is at our end with our mobiles."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T18:05:32.000Z",
          "Titre": "GlocalMe doesn't have good reception",
          "Contenu": "Bought the GlocalMe package to the Yosemite trip in case the house rental Wifi is not good. But I guess GlocalMe does not have good reception in Yosemite so I couldn't really use it because the signal was too weak."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T11:07:46.000Z",
          "Titre": "Set up was difficult and there was no…",
          "Contenu": "Set up was difficult and there was no one to contact. Extremely frustrating. I accidentally purchased a $60 package twice because I couldn't figure out how to load my minutes. Now an entire $60 package that hasn't been used is about to expire!!!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "D M Roscoe",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T00:10:45.000Z",
          "Titre": "I bought the GlocalMe Triforce in order…",
          "Contenu": "I bought the GlocalMe Triforce in order to stream a video event from a remote lookout in northern Ontario. I tested the unit at my home and was very pleased with the upload/download speeds of 3.3/10.9 Mbps. But it failed me on the day. It could not seem to sustain more than a Kbps or so for more than a few seconds. Fortunately, a friend volunteered to let me use his smart phone as a hot spot so the streaming event was a success but I am disappointed in GlocalMe performance. I had hoped it would perform at least as well as a regular cell phone. If I missed something due to inexperience with the unit I am prepared to reassess my evaluation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian Dates",
          "Nb_Reviews": 1,
          "Date": "2021-07-23T14:19:50.000Z",
          "Titre": "Dissapointing",
          "Contenu": "The set up was great. However, this burns through gigabytes of memory ridiculously. I'll keep it for emergencies, but I'm already lookin for alternatives. It would cost no more for me to subscribe to wifi commercially."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debbie T.",
          "Nb_Reviews": 6,
          "Date": "2021-12-28T16:11:57.000Z",
          "Titre": "Poor Service in England",
          "Contenu": "I have a GlocalMe WiFi device and bought the GlocalMe 8GB 30 day package for Europe ($60 cost) to use while traveling in London and Canterbury for 15 days. The service was either very poor or completely non existent during my trip.  I was able to use only about 3GB for the entire trip. If it was not for FREE WiFi in many locations I would not have been able to use my iPhone to navigate!  I contacted Glocal tech support whose advice was to sit near a window and restart the device! I tried everything but even while outside, there was NO service in Canterbury.  VERY disappointed in this and will not use again. Verizon or ATT international data plans may be more expensive but they work and are reliable unlike GlocaMe. I do not recommend buying this service if traveling in the UK."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-29T03:12:52.000Z",
          "Titre": "I bought 180 days worth about 10Gb",
          "Contenu": "I bought 180 days worth about 10Gb; but it only lasted 2 months, wifi was service was gone and not using as much.I bought again the same 180 days and I monitore carefully my real use...I hope it works for 180 days if not I'll suspend Glocalme"
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T05:19:55.000Z",
          "Titre": "Your data rates are very high and of…",
          "Contenu": "Your data rates are very high and of poor value. I typically purchase local SIM cards instead of using your services if the stay is more than 24 hour. Local SIM plus unlimited monthly data is often less than a 1GB or 3GB package from Glocalme."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T12:12:51.000Z",
          "Titre": "No Internet service in my area",
          "Contenu": "So I live out in the woods and was hoping for this unit to provide Internet service as a mobile hotspot. There are surrounding neighbors with Wi-Fi but it seems that this unit does not pick up any signal unless I’m out in town."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T18:07:58.000Z",
          "Titre": "Works but disappointing",
          "Contenu": "I've used the U2 for several years with varying results in the Dominican Republic. Most times, the U2 says \"cannot connect to internet.\" The whole purpose of this device is to connect to the internet. Most disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2020-12-21T20:40:04.000Z",
          "Titre": "Bad/No Signal",
          "Contenu": "This review is concerning the USA:GlocalMe was recommended to me by a friend. He suggested the device locks into different providers depending on signal strength.As I found out this is not correct: The only provider is T-Mobile. While I was travelling extensively through California and visited National Parks, deserts and other remote places I hardly ever had a signal on the device.My Verizon cell phone had a signal in 95% of the areas.In metropolitan areas with full signal on the device I found the speed quite low when I was surfing the internet with my notebook. T-Mobile is just a bad provider as most people know. If GlocalMe would work with Verizon it would be worth the money!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T14:16:21.000Z",
          "Titre": "I ordered a unit from you guys and was…",
          "Contenu": "I ordered a unit from you guys and was told that it could not be delivered due to a wrong address, I think I know my own address smh. That was a few weeks ago and I still haven't received a refund"
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Khozema Ali",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T11:25:57.000Z",
          "Titre": "The product is great but tactics are…",
          "Contenu": "The product is great but tactics are not. The simbox is supposed to save you \"Roaming\" charges and for a month it was that way but all of a sudden the calls out stopped!Upon checking with a CSR, I was told to download the update and when done, the update was flashing a message that now we need to subscribe to get the outgoing call and if we don't then the simbox will stop working by the end of Sept 2022.The subscription charges are discounted from $20 to $10 per month.I want to ask Golocal Management that if we are to pay you this amount per month then what is the point of buying your product as we may be on roaming for a month at maximum in a year that too not at a predetermined time then what is the use of buying your product because if we are to pay subscription charges of $120 to $240 per year weather we are on roaming or not then it is better to pay for roaming charges to the telcom company for that period, it is cheaper than your subscription charges!So my review is that a good product is in the hand of wrong company with illogical policies.Furthurmore, there is no option of payment by debit or credit card. Alipay, Paypal and WeChat pay is not used everywhere that too in Chinese!"
        },
        {
          "Note": 2,
          "Lieu": "AF",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T04:08:55.000Z",
          "Titre": "Product barely worked",
          "Contenu": "Product barely worked then it gave me an error code 12 saying contact customer service when the whole reason I got it was because I wasn’t gonna have service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-05T15:13:16.000Z",
          "Titre": "The device could not support an Xbox…",
          "Contenu": "The device could not support an Xbox even if it was the only thing on it and you use up data with seems awfully fast and it's way too expensive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T03:11:05.000Z",
          "Titre": "Connection speed for unlimited North…",
          "Contenu": "Connection speed for unlimited North America (20gb full speed) has been very slow even though we have only used 4gb data. Disappointing."
        },
        {
          "Note": 2,
          "Lieu": "BR",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 2,
          "Date": "2020-10-20T06:55:49.000Z",
          "Titre": "I was unable to recharge",
          "Contenu": "I was unable to recharge, during my stay in France. Apparently I did pay a recharge via internet banking, but was unable to use it ):Best rgds,Teresa"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T16:41:41.681Z",
          "Titre": "Minimum bandwidth",
          "Contenu": "Minimum bandwidth, Apple does not recognize the VPN so I cannot use cloud or app services with apple."
        },
        {
          "Note": 2,
          "Lieu": "PL",
          "Pseudo": "Jack Black",
          "Nb_Reviews": 1,
          "Date": "2021-05-03T21:19:18.000Z",
          "Titre": "I do not reccomend this seller!Package…",
          "Contenu": "I do not reccomend this seller!Package delayed and not secured properly.I had to pay tax,hidden fee,not mentioned in the offer.Shame in YOU!"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T19:58:21.000Z",
          "Titre": "Ordering process itself very fine",
          "Contenu": "Ordering process itself very fine. Price too high, not competitive at all with locally purchased SIM cards. Frustrated."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-28T08:19:46.000Z",
          "Titre": "The reading is very fast..hope theres…",
          "Contenu": "The reading is very fast..hope theres free mb or gb if i did not yet rrach the xpiration of my package..thank u"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Bruce",
          "Nb_Reviews": 10,
          "Date": "2020-09-23T16:34:55.000Z",
          "Titre": "Not easy to connect multiple units with…",
          "Contenu": "Not easy to connect multiple units with the app. Complicated and time consuming. Kept having to re connect."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-21T19:57:28.000Z",
          "Titre": "I’ve spent a lot of money buying data…",
          "Contenu": "I’ve spent a lot of money buying data which either disappeared in minutes or I could never activate."
        },
        {
          "Note": 2,
          "Lieu": "PL",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 2,
          "Date": "2020-09-23T17:03:35.000Z",
          "Titre": "High prices compare to the other",
          "Contenu": "High prices computer to the other, 3 years ago was ok, but now You arE on the end."
        },
        {
          "Note": 2,
          "Lieu": "MA",
          "Pseudo": "Benk",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T22:25:23.000Z",
          "Titre": "Not for personal use",
          "Contenu": "Very good technically, but awfully expensive to operate."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2021-02-25T21:54:23.000Z",
          "Titre": "Device froze up a 15%tried factory…",
          "Contenu": "Device froze up a 15%tried factory reset still froze up"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 2,
          "Date": "2021-08-26T04:41:33.000Z",
          "Titre": "The cost is way too much for what you…",
          "Contenu": "The cost is way too much for what you get."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Naomi Simpson",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T21:48:52.000Z",
          "Titre": "I was charged twice😳,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-05T23:58:54.000Z",
          "Titre": "Thought it would be be better."
        },
        {
          "Note": 2,
          "Lieu": "KR",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-30T12:53:39.000Z",
          "Titre": "The connection always week"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-07T18:07:06.000Z",
          "Titre": "Haven’t received it yet!"
        },
        {
          "Note": 2,
          "Lieu": "AO",
          "Pseudo": "Jose Cardoso",
          "Nb_Reviews": 2,
          "Date": "2021-07-29T09:04:31.000Z",
          "Titre": "Not as expected."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T14:56:23.000Z",
          "Titre": "waste of money",
          "Contenu": "slow....slow"
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Bahaa",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T23:12:19.000Z",
          "Titre": "simbox device",
          "Contenu": "I have a simbox device, it’s amazing device and below my review:Device, is a very good device and providing a very good service.Service level, I found the service level is a medium service as i always have a delay voice during my calls.Customer Service, is outstanding service. All of the agents are a smart and helpful but I’ll mention one name of them Lucas, he is very helpful, smart, very friendly and supportive.The reason for my three stars review is the voice delay during my calls."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Fuk Keung Dennis Lai",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T01:59:31.000Z",
          "Titre": "Glocalme didn't provide service to G2",
          "Contenu": "Glocalme didn't provide any service for my G2 and asked me to upgrade the device with 15% discount. So really don't how long will be last for my new duoturbo and hope it can last for another 5 years."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Svetozar",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T21:17:24.000Z",
          "Titre": "Waited 5 days before shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aj N",
          "Nb_Reviews": 1,
          "Date": "2021-11-23T16:35:02.000Z",
          "Titre": "Too pricey for stand alone home wifi",
          "Contenu": "Too pricey for stand alone home wifi. Eats up data quick. With a full signal, runs slow and text messages sent locally aren't instant and lock up. Wish you were able to offer a product/service like Sprint/T Mobile. For $10 more on cell phone plan I get 60 GB of high speed mobile Hotspot per month (for $20 you get 120 GB + Amazon Prime membership included). So far no issues with speed or downloading..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-10-07T13:41:33.000Z",
          "Titre": "My G Pro 4 arrived quickly and was…",
          "Contenu": "My G Pro 4 arrived quickly and was securely packaged.  The design is beautiful and it started right up when I turned it on.  There was not much documentation on how to set it up and use it, but I figured everything out.  Unfortunately, I could not get it to work in my remote location, even though I have good, regular internet service. However, it worked fine in town.  I'm hoping that it will have good reception when I travel to various places around the world...fingers crossed.  I think that for the price, it should include a cover, or carrying case."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-01-14T17:22:25.000Z",
          "Titre": "The expiration and activation time…",
          "Contenu": "The expiration and activation time limits make it hard to take advantage of sales for which I intend to use for future planned travel. It would be much more convenient to buy data through GlocalMe if I could buy data farther in advance without timing the expiration. If I could buy data and know I can use everything I buy, it would be a clearer choice to buying a local SIM card."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Good service",
          "Nb_Reviews": 3,
          "Date": "2021-07-15T14:02:36.000Z",
          "Titre": "Simplify purchases and accounting so we know what we need and see what we have, please",
          "Contenu": "GLocalMe is a valuable tool for those who rely on portable high speed secure internet. However purchasing length of time and data speed is all about buying packages and all about apparent discounts. I need a way to see what I have. If I buy a package that turns out to be too slow and then buy a faster package, what happens to the money for the slower package?  How can one try out different speeds to see what is adequate? So, no surprise I have an important project and I can’t experiment so I buy the fastest in a panic."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T23:59:13.000Z",
          "Titre": "Good enough for basic internet usage.",
          "Contenu": "Being in the middle of urban places, the speed is only good enough for basic stuff (emails and browsing).  For a video conference or dealing with big data files, forget about it.   I’ve tried it so far in two main cities in Texas.  I’ll try it next week in Idaho, so I hope it works better; otherwise I might return it."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Lars Wöbcke",
          "Nb_Reviews": 3,
          "Date": "2020-09-23T18:37:51.000Z",
          "Titre": "Good, but ...",
          "Contenu": "Idea & device are great, but two problems:- Account balance was repeatedly erased, completely unacceptable!- UI is sub-par. Mixture of app and web-app confusing, it doesn’t tell you which provider is active (or available), hard or impossible to buy service when you’re not online.I contacted their service line via chat once, they appeared rather clueless. That’s a while ago, though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T14:16:15.000Z",
          "Titre": "The user interface is not the best",
          "Contenu": "The user interface is not the best. I purchased a plan from my phone and the Glocalme device was not showing it. I tried many things with no clear instructions on what to do. Eventually I gave up, and after a while I did reboot the unit from scratch and reinstall it and bound my mobile again and it did finally works. Please provide trouble shooting instructions."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Merkavelli",
          "Nb_Reviews": 1,
          "Date": "2021-01-31T03:28:43.000Z",
          "Titre": "Handy to be a walking wifi signal",
          "Contenu": "Good customer support and mifi device works decently but could have a stronger signal  and be be able to connect more devices would be nice 5 just isnt enough 10 would be perfect! They do have a selection of different data packages that can be afordable in any country. But i do find the highspeed data packages rather expensive there should be some 25g even 15g or 10g highspeed data packages at lower cost so everyone can afford highspeed data cuz i find the regular speed to be rather poor"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T22:38:05.000Z",
          "Titre": "The battery life is terrible",
          "Contenu": "The battery life is terrible.  It looses it's charge even if the hotspot is off.  the hotspot can only have 5 users which really fills up quick and make the unit really slow down.  I also have issues with the plans that are availablethat once you start using it you have 30 days to use it.  If you have any data left over you are out of luck."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Drone Pilot",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T17:52:12.000Z",
          "Titre": "Works Well But Expensive",
          "Contenu": "Your service works well but it is too pricy to use as much as I would like. You would sell me more data if rates were more competitive to local service providers. Your double data deals are just marketing titles with no saving value. If your rates were competitive I would use you as my full time service provider because you are reliable. Wayne"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T17:45:57.000Z",
          "Titre": "Would like to see longer expiration dates",
          "Contenu": "I'm, overall, happy with GlocalMe as an internet provider when I'm travelling or as backup when regular services go down. The gap in service that encounter the most is the expiration of the data packages that I use after 30 days. I can manage this by purchasing several smaller packages. However, I'd be interested in packages that provide similar amounts of data but with longer expiry terms such as 90 or 120 days, and I'd pay extra for the service."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T19:24:12.000Z",
          "Titre": "Basically fine",
          "Contenu": "Basically fine. Tried to work from Switzerland,near the border to Italy. Unit had difficulties several times to connect to a Swiss signal (as we bought a swiss data package) but connected or attempted to connect to an Italian signal...After moving position in the house it finally worked out well..."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Wendy",
          "Nb_Reviews": 2,
          "Date": "2020-10-13T00:18:18.000Z",
          "Titre": "It was hard to get started at first",
          "Contenu": "It was hard to get started at first, but once you figured out how to connect it worked fairly well. It's unfortunate that the packages expire after a period of time or that you can't carry forward unused GB to a new plan. IT would be useful to have that feature to maintain customer loyalty."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mike Parent",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T15:22:52.000Z",
          "Titre": "It really seems like the GB's that you…",
          "Contenu": "It really seems like the GB's that you buy on Glocalme run out faster than my cell phone is plan.With all of the cell phone plans today and low low prices for data it really doesn't make sense to buy data from Glocalme especially when all prices are in USA dollars and you live in Canada."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-23T13:44:13.000Z",
          "Titre": "Im my option and experience.",
          "Contenu": "Im my option and experience.Too expensive even for a small package, GB's doesn't last 30 days and doesn't work on up to 10 devices, it barely runs on 3, the more you use it on devices causes the other to run slow or not at all."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T06:21:38.000Z",
          "Titre": "App and device was good but the speeds…",
          "Contenu": "App and device was good but the speeds were very slow and inconsistent in Seattle and Los Angeles. In some areas not even strong enough to run a conference call vs the local AT&T which was pretty fast."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sean Hastings",
          "Nb_Reviews": 2,
          "Date": "2021-11-01T00:09:56.000Z",
          "Titre": "Think a great idea but my house didn’t…",
          "Contenu": "Think a great idea but my house didn’t have WiFi unless I walked down the street..That is why I bought this I thought it would be perfect..Nothing now I’m in a hotel an north California and it doesn’t work here"
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-31T12:04:54.000Z",
          "Titre": "The packages could be bigger",
          "Contenu": "The packages could be bigger. Especially to compete with other ISPs. Im in Turkey for a year or 2 and I can only buy 3 GBs of data at any time. I see the packages for 12 GBs or more but you guys have it priced at 90 dollars and im only assuming it's because it allows connectivity to the other European countries as well but if im not traveling there then it makes me not want to pay 90 dollars for availability to other countries that im not interested in visiting. Meanwhile other ISPs like Sapphire have packages all the way up to 25 GBs that are specifically for a region and if I want a bigger package then I'll have to pay a lot more money for it."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T09:17:02.000Z",
          "Titre": "Cloud Sim still has some blackout areas…",
          "Contenu": "Cloud Sim still has some blackout areas even in Germany. Sometimes weak/interrupted connection inside houses/ buildings. Much Weaker connectivity while driving in train/car. For that data prices are relatively high, especially in South Asia."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "Fadi M",
          "Nb_Reviews": 2,
          "Date": "2021-09-03T10:06:22.000Z",
          "Titre": "Nice to have but...",
          "Contenu": "Pros: Good device, strong Wi-Fi signal, nice battery bank feature, great and responsive customer support (almost immediate)Cons: Expensive data packages. I used the device while traveling by car accross Canada. The device understandably lost signal in numerous locations, however, the data vanished so quickly given the fact that it kept searching for signal most of the time. The data packages are expensive and if you have kids who watch YouTube and play games, the 12GB will vanish in no time, especially where there is bad or no signal. I believe there's a flaw somewhere that needs to be fixed. It is possible that the system will charge you for the reconnect attempts the device makes and that's unfair."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 3,
          "Date": "2021-07-12T13:08:53.000Z",
          "Titre": "The internet hotspot device is great",
          "Contenu": "The internet hotspot device is great! The data packages are way to expensive for me. I will be looking elsewhere for data. I only use this for a 95 year old lady that I take care of. She has no internet available in her rural area. So I got the device so I could introduce her to movies! I stream movies on her tv. I did manage to make her old, dumb tv, into a smart tv. She has dementia and this keeps her mind busy so she does not get agitated and wonder around. But as I have investigated other data plans from other companies, I realize now that your plans are seriously over priced. I would love to see a USA only plan that is not so high priced. i will be going to T-Mobile, $50.00 a month for 100GB!"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-19T02:19:06.000Z",
          "Titre": "Pros",
          "Contenu": "Pros: Convenient and the reception was good in all the countries I have been toCons: packages are too expensive for some of the countries. Might as well get a mobile internet sim from that country as that will be a lot more cheaper"
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Christian R. Brodbeck R.",
          "Nb_Reviews": 8,
          "Date": "2020-10-13T02:54:32.000Z",
          "Titre": "The service quality is depending of the…",
          "Contenu": "The service quality is depending of the local carrier, the price is definitely to high in comparison to local carrier for same data. Modem hardware is okay,software (apple iO) app not realy smart. COVID connection test fulfills."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-21T18:52:43.000Z",
          "Titre": "The WiFi coverage was good",
          "Contenu": "The WiFi coverage was good. The only reason for 3 stars was, in my opinion, the local WiFi providers provided better/cheaper data plans especially with unlimited data in the area that I acquired services."
        },
        {
          "Note": 3,
          "Lieu": "RO",
          "Pseudo": "Cristian Lucian",
          "Nb_Reviews": 3,
          "Date": "2020-09-25T14:45:03.000Z",
          "Titre": "Good but not great...",
          "Contenu": "Good but not great.... Packages still expensive, data is being consumed very fast compared with other sim/provider. There is still room for improvement. It's good to have it, but not for intensive use."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T16:58:09.000Z",
          "Titre": "When on holiday in county Donegal in…",
          "Contenu": "When on holiday in county Donegal in the Republic of Ireland I checked the signal using the initial free connection before buying a package but the signal was poor and slow. Never had any previous problems"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Manna",
          "Nb_Reviews": 2,
          "Date": "2020-12-29T17:03:15.000Z",
          "Titre": "Data to expensive",
          "Contenu": "The device works wonders the data pricing is just a touch to expensive for what it is. Canadian plans would be great especially seeing as the borders are closed currently for the foreseeable future"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gia Greene",
          "Nb_Reviews": 3,
          "Date": "2021-11-03T18:24:01.000Z",
          "Titre": "I purchased this product because it…",
          "Contenu": "I purchased this product because it says I can connect with my camera's system and I can't get it to work. Only TV and phones can connect 🙃"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T18:26:12.000Z",
          "Titre": "My service was very spotty where I…",
          "Contenu": "My service was very spotty where I went, I will chalk this up to access, but I think I was under the impression that this was connected to satellite, and not cell service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diane Francis",
          "Nb_Reviews": 3,
          "Date": "2020-09-22T18:22:44.000Z",
          "Titre": "Intermittent Connection",
          "Contenu": "When we are at our summer cottage in Plymouth, MA., we get a GlobalMe connection only some of the time.  It seems to work best in the early morning and then around dusk."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lloyd Dennis",
          "Nb_Reviews": 2,
          "Date": "2021-03-07T21:19:24.000Z",
          "Titre": "The G4 is none but I Live in the United…",
          "Contenu": "The G4 is none but I Live in the United States and I am a Truck Driver.The connection is ok it will get the job done, but not fast.Overall it is a good Product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2020-12-17T18:55:53.000Z",
          "Titre": "It’s okay",
          "Contenu": "Service is okay, price is steep with no unlimited option. Great as a backup, or when absolutely no other options exists. Not so great for everyday use on the road."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-20T16:38:28.000Z",
          "Titre": "It works fairly well",
          "Contenu": "It works fairly well, the only issue is buying new blocks of data - I can either overpay for 1 GB or pay a reasonable amount for a lot of data I don't need."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T22:03:58.000Z",
          "Titre": "You need to offer a 30 day plan whose…",
          "Contenu": "You need to offer a 30 day plan whose hours don't expire. At this point, I feel abused as a customer, paying for minutes that weren't honored (even if it is in your feel safe (for you) policies. 3 stars is the max. for me. You have left me hanging with less in my wallet.\"I want the money for my unused minutes back nd real options.\"Otherwise stop paying for Youtube adds etc. Advertising to me when I am already a customer. You steal money and time. Your questions are a waste of my time and your money. Why are you asking? Every video reminds of how I and others were f'uped over. I don't know or care to read your obstructive insistence on review of your terms and conditions in order to leave a comment. I am leaving this and check your \"I accept\" box but I don't agree. This is in order to leave a comment. I do not accept your conditions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-23T13:01:43.000Z",
          "Titre": "Came quickly",
          "Contenu": "Came quickly. Easy to use. I bought to use mostly for video conferencing. Performance has been disappointed. I can use it but lose video frequently."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T14:01:34.000Z",
          "Titre": "The product works well but the 30 day…",
          "Contenu": "The product works well but the 30 day limit for data is too challenging to manage. It is very hard to predict what you will use in 30 days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-01-03T16:49:32.000Z",
          "Titre": "I like my Glocal",
          "Contenu": "I like my Glocal, I do not like that it activates the data plan immediately upon turning on, that is my only problem thus far."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Tim Smith",
          "Nb_Reviews": 1,
          "Date": "2020-09-20T16:38:45.000Z",
          "Titre": "The service is good but there is…",
          "Contenu": "The service is good but there is limited coverage in southern Africa.   Would be very helpful to have coverage in Malawi and in Zimbabwe if possible."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Dhr. JACQUES VANDENBIGGELAAR",
          "Nb_Reviews": 2,
          "Date": "2020-10-16T15:27:39.000Z",
          "Titre": "the glocal me receiver does not work…",
          "Contenu": "the glocal me receiver does not work . the company took my opinion into account and  is working to improve the situation . Thanks for their feedback"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 2,
          "Date": "2020-12-10T11:47:41.000Z",
          "Titre": "Apple Software",
          "Contenu": "For some reason Apple store does not like the network. When I’m connected I can’t download or update my software on my phone or iPad."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T12:10:23.000Z",
          "Titre": "Too pricey",
          "Contenu": "The pricing on this is a bit ridiculous. You might as well go with your local cell phone provider for a product like this"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T21:21:39.000Z",
          "Titre": "They double the price.",
          "Contenu": "They double the price on almost everything. It is expensive. But, because I bought the devise, I have to use to go out of town."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T19:39:17.000Z",
          "Titre": "Technically absolute fine",
          "Contenu": "Technically absolute fine. The tariffs are more expensive in Europe compared to competitors. Thus a review is recommended."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-05T04:58:14.000Z",
          "Titre": "The internet is good but more expensive…",
          "Contenu": "The internet is good but more expensive than your competitors who offer the same quality m, such as Skyroam."
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T13:49:39.000Z",
          "Titre": "Theres very little option on the data…",
          "Contenu": "Theres very little option on the data package on each country and the global package is alittle expensive."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T19:15:08.000Z",
          "Titre": "Certain countries too expensive",
          "Contenu": "Data for countries such as Germany is too expensive. So, I have to use other services and not GlocalMe."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Robert Brecher",
          "Nb_Reviews": 4,
          "Date": "2020-09-20T12:59:49.000Z",
          "Titre": "All good apart from the invoicing",
          "Contenu": "All good apart from the invoicing. For me to get an invoice is very tedious and needs to be improved"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diane Francis",
          "Nb_Reviews": 3,
          "Date": "2020-10-12T14:45:11.000Z",
          "Titre": "Internet access",
          "Contenu": "Our need for internet access is in Plymouth, MA, where GlobalMe works some but not all of the time."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jacob Y Canada NB",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T03:07:05.000Z",
          "Titre": "Works as it should I suppose lol",
          "Contenu": "Works as it should, the plans for Canada should be a bit less pricey but it does the trick"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paula Bull",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T15:48:30.000Z",
          "Titre": "Support was slow and I figured out what…",
          "Contenu": "Support was slow and I figured out what I needed to do before they got back to me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T18:21:36.000Z",
          "Titre": "Getting better than before I purchased…",
          "Contenu": "Getting better than before I purchased data plan this time getting faster no buffering"
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Julius Balaz",
          "Nb_Reviews": 7,
          "Date": "2021-04-22T01:33:47.000Z",
          "Titre": "Mini pocket",
          "Contenu": "The mini pocket is nice, but the battery and the conection is very poor..."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "GlocalMe Customer Nick",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T20:45:08.000Z",
          "Titre": "Very long time Log in.",
          "Contenu": "Very long time Log in.When signal is weak, do not log in at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-25T11:56:50.000Z",
          "Titre": "Expensive and Glitchy",
          "Contenu": "Expensive, glitchy service that blows through Data."
        },
        {
          "Note": 3,
          "Lieu": "KE",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T16:33:58.000Z",
          "Titre": "Ist always too expensive the Mobile…",
          "Contenu": "Ist always too expensive the Mobile companys are cheaper."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Shane William Finlay",
          "Nb_Reviews": 8,
          "Date": "2021-04-22T10:32:58.000Z",
          "Titre": "says 4g but doesn't really support…",
          "Contenu": "says 4g but doesn't really support video calls"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "A. Kong",
          "Nb_Reviews": 2,
          "Date": "2020-09-22T17:41:39.000Z",
          "Titre": "The cost of data is higher than other…",
          "Contenu": "The cost of data is higher than other competitors!!!"
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T16:37:58.000Z",
          "Titre": "signal",
          "Contenu": "You need to fix the signal coverage worldwide!"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Markus",
          "Nb_Reviews": 3,
          "Date": "2020-09-23T16:59:56.000Z",
          "Titre": "In some countrys realy expensiv"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-05T17:34:51.000Z",
          "Titre": "Not a performance 4 G"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T14:01:12.000Z",
          "Titre": "The support is very eficient",
          "Contenu": "The support is very eficient. Thank you Lucas !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AK G",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T19:28:41.000Z",
          "Titre": "Very useful little gadget",
          "Contenu": "Very useful, especially when traveling.  Customer Service is great too. Diana was very helpful with an issue I was having with a plan purchase.  My only complaint is that the plans can be a bit expensive, but they frequently offer coupons that help defray the cost a bit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JoLee",
          "Nb_Reviews": 3,
          "Date": "2022-12-17T06:41:29.000Z",
          "Titre": "The real time customer service (Max was…",
          "Contenu": "The real time customer service (Max was great) is always accessible and effective. I only continue to use my device because of this as package rates are more expensive now. Avoid using for GPS or streaming movies as it’ll gobble your data."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Joe Tam",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T04:08:54.000Z",
          "Titre": "I got my GlocalMe DueTurbo today",
          "Contenu": "I got my GlocalMe DueTurbo today. having trouble and accidentally activate the Data plan. so I talk to the Online support name Max. He patiently help me and solve my problem for a 70 senior. I thank you him."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Carmen Roy",
          "Nb_Reviews": 2,
          "Date": "2022-12-18T01:34:54.000Z",
          "Titre": "I was successful in buying a package I…",
          "Contenu": "I was successful in buying a package I was interested in. Lucas came on real time client assistance and found the link I needed. Then he coached me on how to use my balance in my account and my 20% discount coupon."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "LM",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T12:53:49.000Z",
          "Titre": "It's getting better.",
          "Contenu": "I have had bad experiences before when contacting their support but Diana did great, was very helpful and patient with me. And solved the problem too."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "ANGELICA ESPEJO",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T17:25:38.000Z",
          "Titre": "Farro was very patient and gives…",
          "Contenu": "Farro was very patient and gives instructions as to how to fix my concerns."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Granger",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T18:40:20.000Z",
          "Titre": "Product lost in the mail",
          "Contenu": "When you shipped it to me it got stuck at the post office and someone else was able to pick it up. How I don’t know but not my problem. you were given a correct address and I have filed a complaint with the post office. Was a signature not needed. How amazingly incompetent. To say i am pissed off is a understatement. No return calls which I can’t get through to anyone as it blocks my call’s and emails!!!!! Well let’s say that you have one of the best scams going. I’ll be placing all the bad press I can do to prevent you from ripping off anyone else. If you have the balls to reply to this review and I will be happy to discuss a replacement for the one I didn’t receive at no charge to me. Sincerely, Richard C Granger CEO QCB Appliance GroupNovember 29 2022I needed to update the review because it was not Glocalme’s fault on the product not arriving it got lost in the post office box and I apologize for ranting about the way it was shipped. Upon talking with Cara from the support team she assured me that they would send a new wifi product and take care of the problem. After a week the product was located and it was connected to the internet and worked great but the amount of data it used for streaming was not what I wanted so I’ll be returning it to the company for a refund. I have no problem with the product it worked great for the first few hours and one movie 9 gigs of data was used up. Not going to work for my situation. Sincerely,Richard Granger"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Road Boss",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T17:15:47.000Z",
          "Titre": "RecievLooks a lot nicer than earlier set.",
          "Contenu": "Recieved in very nice FedEx parcel envelop. Yet to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Newton",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T17:50:46.000Z",
          "Titre": "Mobile wi-fi unit was a valuable asset on my trip",
          "Contenu": "The mobile wi-fi unit I rented was valuable to me in Mexico and worked fine.  I did have problems reaching Glocal for my pre-paid return label, for the item, in a timely manner.  After several efforts, on my part,  they contacted me and assured me there would be no additional charges. I was satisfied with the unit I rented and customer service, though delayed, was responsive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steph Bonifacio",
          "Nb_Reviews": 2,
          "Date": "2022-09-17T15:49:26.000Z",
          "Titre": "Talking with this company via the chat…",
          "Contenu": "Talking with this company via the chat and via email is excellent. Incredibly fast response and the people resolved my issue. Phone calls I did not receive much help. My wifi device did have an issue but the person named Farro on the chat resolved it very quick. These people know what they are doing!"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Kommi",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T10:03:48.000Z",
          "Titre": "Very quick and good customer service…",
          "Contenu": "Very quick and good customer service support from Mike.  Bought a G4 pro and wanted to try out the free data that comes with the device.  Unfortunately didn’t work.  Contacted online chat and Mike helped to isolate problem swiftly, along with answering a few questions I had.  Truely good job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "susie",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T02:41:42.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good.  We rented roaming man last year.  This year we purchased glocalme, duoturbo, dual modem.  Connecting was easy enough although to be honest roaming man is even easier.  The real test will be the 1150 mile road trip through four states.  Reason for glocalme duoturbo was last year's device would lose the connection and my kid would have to sign back into her virtual class everytime.  This year will we see if the duoturbo makes a difference with dropped connections.  Also, the duoturbo and data package were a better deal this year over roaming man."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Brian Fysh",
          "Nb_Reviews": 3,
          "Date": "2023-03-17T12:27:58.000Z",
          "Titre": "Very Easy Setup",
          "Contenu": "Only giving 4 out of 5 stars because I haven't actually used the device yet for travel.  Just wanted to say that set up really is as easy as they say  and I am just a reasonably tech savvy senior !   Also, had a data question and received a very prompt reply.Looking forward to using this on my travels.P.S. Have now used the device in both Canada and  the U.S. and it provides excellent high speed internet.  Very satisfied 🙂As a follow up...have since used the device in Europe and Costa Rica. Also use it at our cottage in a remote part of Ontario Canada."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T11:40:14.163Z",
          "Titre": "Works great",
          "Contenu": "Works great. Was able to have a mix of 12 computers, tablets and phones attached and all streaming video at the same time with little lag. Impressive. Only issue was stting up VPN and hidden network. But thst could have been user error. I'd purchase this again. Great choice for on the go type people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T22:09:58.000Z",
          "Titre": "Mostly very good customer support",
          "Contenu": "Mostly very good customer support. Fast response and quickly addressed  issues and concerns.Difficult to follow instructions given for and on the App."
        },
        {
          "Note": 4,
          "Lieu": "MO",
          "Pseudo": "Mickey",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T13:02:55.000Z",
          "Titre": "After receiving the device",
          "Contenu": "After receiving the device, I realised the whole thing was shipped from Shenzhen China, which you guys could easily add a button send to Macau… instead of traveling all the way from China to USA and back to China. LOL pretty wasteful…The device firmware still unstable, some options can’t be change, or it will crash and restart… Anyway is the ONLY 5G MiFi at the moment, so if you need it, just go for it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-21T17:41:09.000Z",
          "Titre": "Assistance that was provided excellent but...",
          "Contenu": "The email assistance was excellent.  The phone support also was excellent. Although very knowledgable, one of the individuals who helped me was very difficult to understand.  The other was not.  Since using the device, it is burning through data at a faster than expected rate.  I would have initially given 5 stars but it seemed like I should not have had to contact customer support so much to rectify errors on your end (length in which data packages were valid)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-11-25T14:49:14.000Z",
          "Titre": "Works well but Quick Start is not so quick",
          "Contenu": "Everything works just fine and we're pleased with the performance. The setup was a bit awkward. Things that appeared in the Quick Start manual were not quite the same as the things that appeared on the device's screen. I got lost several times and had to backtrack and redo my work. Annoying but, ultimately, it performs well and meets our needs effectively."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 2,
          "Date": "2021-11-02T19:48:24.000Z",
          "Titre": "The concept of the device is fantastic",
          "Contenu": "The concept of the device is fantastic. The biggest problem is that if you get into an area that it can't connect, there's no way for them to help you. They WILL bend over backwards trying though! Our home internet went down last night and I got the device out to use so I could work. The connection was very slow and kept dropping. Stephen was great and definitely gets 5 stars! Everything is working well now but, this also means I have to go back to adulting!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-21T14:06:33.000Z",
          "Titre": "It’s worked well at my house",
          "Contenu": "It’s worked well at my house. I’ve been using it for work to test it, however, I’ve noticed after using it for a couple of days for about 2 to 3 hours, I get a message stating that AT&T has temporarily blocked service. This typically lasts about 15 to 20 minutes.  I am hoping to use this on the road while traveling so that I can work. I plan to test it soon on a trip to see how well it works in different locations. Overall I’m pretty happy with it."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Pierre-Alexandre Lemay",
          "Nb_Reviews": 1,
          "Date": "2021-12-04T00:42:55.000Z",
          "Titre": "The service signal in Québec is very good !",
          "Contenu": "The service signal in Québec is very good !!! But the price of data package is a bit high ... i use the G4 Pro and it work good  i have seen it use Bell and rogers in my city but i cant talk about other region for now  but i love it and i would love to try the new one from glocalme !!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer eh!",
          "Nb_Reviews": 2,
          "Date": "2021-07-02T22:25:27.000Z",
          "Titre": "Fr Canada 🇨🇦: Great little device",
          "Contenu": "Fr Canada 🇨🇦:Great little, easy to use device. Its just like a cell phone that you hotspot into… so easy to use, monitors use and limits at a glanceBuying/using purchase data is simple.The ONLY challenging item so far is figuring out how to prioritize bought data packages. Would be bice is a bit more focus on that screen to understand the tiered use (global vs local). Ive worked from my campsite! How awesome is THAT!?"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Paolo Lanzellotta",
          "Nb_Reviews": 1,
          "Date": "2021-08-06T09:08:26.000Z",
          "Titre": "First gocalme experience",
          "Contenu": "The team was really helpful. They explained what I did not know and were not sure about. Great job glocalme.Unfortunately the device that interest me is avalilable only in Germany and the other will be a new entry, I hope also in Italy, in september. I'm looking for device with both choices sim card and plans."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Regina",
          "Nb_Reviews": 3,
          "Date": "2021-10-02T23:27:22.000Z",
          "Titre": "On a 2 week vacation from FL TO ME",
          "Contenu": "On a 2 week vacation from FL TO ME, driving in our RV.  I purchased the GLOCALME, We stay overnight at campgrounds and Rest Area, with other truckers.  Never did I have problem with getting on the Internet and so many data plans to choose from, especially data sales.  I recommend this product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SVD",
          "Nb_Reviews": 1,
          "Date": "2021-03-07T16:46:15.000Z",
          "Titre": "Works Great",
          "Contenu": "It's been a month, and the GlocalMe has become my source for home internet. Enough speed for streaming, daily business, and casual surfing of the internet. Terms are clear and more data always available in the app if needed at reasonable rates. Sometimes the device will have trouble booting up a usable network, but it's temporary. A quick restart solves the problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Happy online.",
          "Nb_Reviews": 2,
          "Date": "2021-08-01T15:12:59.000Z",
          "Titre": "My wife and I recently began to travel…",
          "Contenu": "My wife and I recently began to travel extensively in our motorhome and the places we most often stay are out of cellphone range. We spent quite a bit of money and time trying the different methods for internet access.Then we found Glocalme through ZDnet. Now we have high speed internet access as long as there is sky above us. It is easy to get the receiver and completely online after that; no chip needed.We mainly travel in the US but they have international service. If you try it, you won't be sorry."
        },
        {
          "Note": 4,
          "Lieu": "BS",
          "Pseudo": "Cha",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T12:59:53.000Z",
          "Titre": "Pros and cons",
          "Contenu": "Pros: Great product! Very quick and easy to use, from set up to daily data consumption. Great for basic use such as google maps, messenger, etc. Battery has a long life too. Would buy it again as it meet my needs.Cons: Bahamas, where i live, is not included on the list with coverage. Internet is sometimes very slow."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ignatius mauceri",
          "Nb_Reviews": 1,
          "Date": "2022-07-09T20:05:00.000Z",
          "Titre": "I found it a little difficult to cancel…",
          "Contenu": "I found it a little difficult to cancel my subscription and had to get assistance. However, Max was very helpful and reimbursed me for a data plan that I was not going to use."
        },
        {
          "Note": 4,
          "Lieu": "GE",
          "Pseudo": "Archie",
          "Nb_Reviews": 1,
          "Date": "2021-03-05T11:27:28.000Z",
          "Titre": "I was trying to sign in to my account",
          "Contenu": "I was trying to sign in to my account, I was waiting for  SMS to verify, but It did not be received. Finally I decided to contact to GlocalMe for help. Stephen immediately helped me to solve this problem. In whole GlocalMe is very good product and I would recommend it to those who are looking for this kind of service."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T05:59:30.000Z",
          "Titre": "The service provided is very good",
          "Contenu": "The service provided is very good. But bear in mind the router that they are selling are not so much reliable and suffering of weak signal. More over for Europe local pre paid sim cards are effectively more economical.I do like the fact that the charges are clear, and were ever I go globally, service is there as promised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lwolfe",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T16:48:27.000Z",
          "Titre": "Package came fast",
          "Contenu": "Package came fast. Nicely packaged. U3 supper easy to use and set up. Maybe to easy. Purchase a data plan that wanted to use for a trip. I logged in (super easy) just wanted to play with the unit. Just turning on the unit it activated my date plan. A bit disappointed I have to get more data. Hoping the user name a password was going to be  a bit easier to change and or share. Overall please so far will see how things go with my travels.Update: customer service reached out quickly. Offered lots of solutions. Great company to work with"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T17:49:49.000Z",
          "Titre": "Purchased a package for Germany",
          "Contenu": "Purchased a package for Germany, but was close to the Austrian border still in Germany. GlocalMe support was very helpful and after I moved away from the border I was able to start my data package and was still able to use it while close to the border again. Hanks for the good, quick and helpful support"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Helen Landry",
          "Nb_Reviews": 3,
          "Date": "2022-01-19T15:55:40.000Z",
          "Titre": "Snowbirds",
          "Contenu": "My husband and I are Snowbirds and I still day trade in the stock market.  I needed something that would give me access to internet any where I went, and I needed it to be secure for banking purposes.  Our trip this year takes us to the southern U.S. so we did alot of driving, from Ontario, Canada..  The GlocalMe G4Pro I have, allowed me to play games, watch movies or read books while travelling.  It made the trip more fun.  The G4 transitioned from tower to tower, and provider to provider seamlessly.  I would recommend it to anyone.The only reason it didn't get 5 stars is that I, personally, found the rates just a little too high.  It should actually be 4.8 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Chance",
          "Nb_Reviews": 2,
          "Date": "2020-10-30T05:14:11.000Z",
          "Titre": "Excellent delivery time",
          "Contenu": "Excellent delivery time. Love the device.. very user friendly. The website was a challenge for me, I almost did not order several times because the website kept converting to non-English script. My final attempt was through Facebook link and that worked. So far, product has had stellar performance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gail Wagner",
          "Nb_Reviews": 2,
          "Date": "2020-09-23T00:47:40.000Z",
          "Titre": "The U2s for camping",
          "Contenu": "I purchased the U2s to use while camping. It works great as long as you have cell service, no cell service and it's useless. I bought a package but didn't use it all, yet after a certain numbers of days it expired so that made the package not such a good deal after all. I had thought there was a \"pay as you go\" option which I thought you just paid for what you used, but I couldn't find it In spite of these few things, I like it and it's a great option for WiFi when it's otherwise unavailable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T12:17:04.000Z",
          "Titre": "Easy to set up and use",
          "Contenu": "Easy to set up and use, has good service in a place I would otherwise have nothing.  I wish there were more reasonable data plans but in a pinch when I just want convenient WiFi in a remote area, it worked well and was worth the price for service."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-19T16:28:15.000Z",
          "Titre": "One time I request stop the service and…",
          "Contenu": "One time I request stop the service and re-star again 3 months later because I delay an international trip due to COVID-19 but the support people didn’t help me even when they respond to me immediately.International service si good if you are in a cell phone signal cover area/zone."
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T05:18:28.000Z",
          "Titre": "Great purchase",
          "Contenu": "Works well and I’m pleased with overall performance and connectivity. Difficult to get service in some 4G areas often resulting in dropped calls, incomplete texts sent. The data burns through really fast in East Africa"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T12:29:50.000Z",
          "Titre": "I found self help directions incomplete…",
          "Contenu": "I found self help directions incomplete and the chat helpers beyond efficient and helpful.   While I’m still not clear how to sign my smart TV on to WiFi, I’m content to watch movies on my iPad.  My tv seemed to remain signed onto WiFi the first month but will not sign on this second month.  My iPad is dropping off WiFi frequently during this second month and slow to reconnectThe transition of service between the first and second months was awkward with too many days between purchase and renewal.  Your policy of temporary access to allow purchase to take place was nice.Other than keeping a charge on the modem, the WiFi experience is great.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GlocalMe Custome Sharon Lee",
          "Nb_Reviews": 1,
          "Date": "2020-12-27T07:02:21.000Z",
          "Titre": "Personal customer service",
          "Contenu": "After having some difficulty placing my order on the website. A real live person called and was very helpful, quickly resolving the problem and placing the order over the phone. It was refreshing to speak with a person instead of a computer.The wifi signal is strong and reliable, My only complaint is that the giga bites seem to be used up more quickly than other wifi services I have used. The app shows a detailed record of kila bites used according to date and time, It would be very helpful if a total to date were shown in giga bites, so running out of data could be anticipated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Quilter Steff",
          "Nb_Reviews": 2,
          "Date": "2020-09-22T17:47:00.000Z",
          "Titre": "The unit seems difficult to charge",
          "Contenu": "The unit seems difficult to charge, with the cables that were provided not being all that effective. And, it can't make the signal stronger in an area where it isn't strong already, but it is a good second source of internet even when there is one in place already."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Albert Barnett",
          "Nb_Reviews": 2,
          "Date": "2020-09-16T02:16:27.000Z",
          "Titre": "Over all this is a nice mobile WiFi…",
          "Contenu": "Over all this is a nice mobile WiFi device. I have the U3. I found it powered up quick and connected to my phone quick and connected to WiFi quick. My first use was in northern lower Michigan where there was only water, trees and bears and it had no problem connecting to WiFi. I was able to watch tv, surf And use my phone like I was at home. They have many different packages for mb to suit your needs. The only drawback is you have to use it or lose it. I bought 6mb got 6 mb free but only used 10mb. I’m quite happy overall and would recommend this device to anyone."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Dariusz",
          "Nb_Reviews": 2,
          "Date": "2020-09-24T08:17:51.000Z",
          "Titre": "There is a room for small improvement",
          "Contenu": "Since last years I can not see any improvment in GlocalMe service. I was saying for the long time that GlocalMe it is all seamen \"must have\" equipment but now with available eSims may be you should think also about this option to have eSim available too?"
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "GlocalMe Customer in Japan",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T03:12:30.000Z",
          "Titre": "GlocalMe easy to use",
          "Contenu": "I have enjoyed using the GlocalMe portable device. Easy access and use. The only negative is the battery life. In order to last for my 18 hour day I have to charge it overnight and charge it again towards the end of my work portion of the day."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tom G",
          "Nb_Reviews": 3,
          "Date": "2021-11-16T16:05:13.000Z",
          "Titre": "Very User Friendly, No Nerd required",
          "Contenu": "Got up and running in no time, worked right out of the box and seemed to perform better as the days went by. Was a bit slow at first but after a few days worked great. Was delivered very fast a day early!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T18:09:01.000Z",
          "Titre": "I used GlocalMe in Bahrain",
          "Contenu": "I used GlocalMe in Bahrain, the coverage was good. I didn't use all of my load becaue my company had me fly out early. Just wishing there was a way to pause the load for a future trip or transfer it to another package when things change."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "A Y-L",
          "Nb_Reviews": 3,
          "Date": "2020-09-25T12:22:54.000Z",
          "Titre": "Really handy mobile wifi",
          "Contenu": "Really handy mobile wifi - we use this during travel (most recently South East Asia) and when the home broadband is down.  Really useful and if you need a wifi source that is flexible and affordable for a temp purpose - highly recommended"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer J",
          "Nb_Reviews": 3,
          "Date": "2021-01-05T23:57:27.000Z",
          "Titre": "So Far So Good!",
          "Contenu": "I purchased this not too long ago.  So far, it works well.  I have not used it a lot though.  It was easy to set up and pair to my android phone and PC laptop.  I will come back and 5 star it if it does this well all year!"
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "Günter Ehlert",
          "Nb_Reviews": 3,
          "Date": "2020-10-12T20:47:16.000Z",
          "Titre": "I have to visit many countries for my…",
          "Contenu": "I have to visit many countries for my job. Glocal me was working at any places.Sometimes it is very difficult to book new credit via your mobile phone when you have no connection. But after you get your credits its working fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 2,
          "Date": "2020-09-22T17:55:16.000Z",
          "Titre": "I had some issues with a software…",
          "Contenu": "I had some issues with a software update shortly after purchasing.  It had to be explained via chat with the person from GlocalMe.  It was resolved eventually but it seems something like software updates should just be automatic."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Liz Ong",
          "Nb_Reviews": 5,
          "Date": "2021-06-01T06:56:49.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Speedy customer service with online chat. They resolved my problem quickly as I bought a local data package and it could not work. Step by step instructions and Jenny managed to find the solution in 15 minutes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "candice faye overcash",
          "Nb_Reviews": 5,
          "Date": "2021-03-09T20:58:28.000Z",
          "Titre": "This Device has some bugs but still good",
          "Contenu": "This Device has some bags. But overall it’s your best option for pay as you go mobile data without a contract.Pros: pay as you go, easy to monitor usages, easy settingsCons: switching locations and therefore switching networks can be tough. It’s always a risk that the one you switch to isn’t better than the one you already are connected to. Also, sometimes if you switch networks it will tell you it needs to “bind” to an account because it disconnected itself from yours. But without WiFi you can’t bind it. So it’s a hassle to fix.Pro tip!! Always email customer services they are great. But in some instances they will need it connected to a wifi or other network to be able to provide support"
        },
        {
          "Note": 4,
          "Lieu": "MA",
          "Pseudo": "Traveler from US to Morocco",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T16:10:33.000Z",
          "Titre": "Works as expected",
          "Contenu": "Works as expected. Data packages not so competitive with local sim cards, but still a great alternative to going out of your way to find a vendor. 5 stars if *coupons* or *sales* are more frequent."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T01:26:02.000Z",
          "Titre": "Need to have more data plans to choose…",
          "Contenu": "Need to have more data plans to choose from. Need to have clear instructions and steps to teach us how to use."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "manon guilbert",
          "Nb_Reviews": 3,
          "Date": "2020-09-22T18:48:41.000Z",
          "Titre": "Useful and dependable",
          "Contenu": "Works as it should, very dependable, adequate rates.Wish we could carry over unused data or stop package (pause) when plans change. Wish it would cover more countries for seamless travel.I would buy it again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 3,
          "Date": "2021-04-05T16:01:31.000Z",
          "Titre": "This is my second GlocalMe hotspot",
          "Contenu": "This is my second GlocalMe hotspot. While I like the service and quality of the units I was surprised to find out that in order to use the second unit I had to create a new account. I can only monitor one of the units at a time so I loaded one on my cellphone and the other on my iPad. While this works for me, it is a bit cumbersome. I have had hotspots from other companies that didn’t work in many areas where we travel but the GlocalMe has not let me down. I travel in an rv and with my GlocalMe I operate a Ring doorbell and can use our laptops, phones, and pads. While it isn’t cheap, when we choose to, we can stream our favorite tv shows from different online products. I am pleased with the quality and functionality of the hotspot devices."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T18:26:59.000Z",
          "Titre": "Buying packages is very easy",
          "Contenu": "Buying packages is very easy, status info with app is very helpful to monitor data usage and control use of packages. More variants in offered data packages (volume, validity) would be a great improvement!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 3,
          "Date": "2020-09-22T17:43:32.000Z",
          "Titre": "It’s very good that I can always have…",
          "Contenu": "It’s very good that I can always have WiFi on all the time. A little too expensive but when I paid for just 50gigs it was a little bit too slow but I could’ve been faster but over all I enjoyed it though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T02:47:29.000Z",
          "Titre": "Good Experience",
          "Contenu": "I had a good experience with this hotspot. It isn't lightning-fast, but it's capable, solid, and was good enough to get me through work while my home internet was delayed."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Hinawari",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T18:58:26.000Z",
          "Titre": "A very good travel companion",
          "Contenu": "Great service and value for what you pay. Sometimes the device pops out of the net and you need to restart. This takes a few minutes and is the only reason I won't give a 5star rating. Cheers :)"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Melinda Mensen",
          "Nb_Reviews": 5,
          "Date": "2021-11-28T07:21:37.000Z",
          "Titre": "Problem Solver",
          "Contenu": "Had an issue with changes to the data plan I normally purchase and Mike was very helpful in resolving! I have faith he’s going to resolve it permanently too! Thx Mike!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Guy",
          "Nb_Reviews": 2,
          "Date": "2021-03-31T14:51:29.000Z",
          "Titre": "The device works well, but pricey plans!",
          "Contenu": "The device itself works well. A little spotty at times. My only complaint is the cost of the different plans that is available. I wish I knew what plans were available before purchasing."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-25T05:29:32.000Z",
          "Titre": "This is a great device to use abroad…",
          "Contenu": "This is a great device to use abroad and in the U.K. I use it all the time when we are camping in the U.K. and it’s great with two kids for an evening movie when we are cooking ."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "S W",
          "Nb_Reviews": 2,
          "Date": "2021-04-09T01:26:23.000Z",
          "Titre": "5stars for Stephen, 4 for G3, 3 for other support, Sorry!",
          "Contenu": "Technical support by Stephen is excellent, prompt and courteous. On support chatting, he resolved all the troubles which did exist. My G3 did not perfectly work right away out of the box as I thought. Even my latest Google Android v11 phone and my minimal tech handiness, I could not get my phone to work with GlocalMe App properly without help. I suppose that was not to happen with me. I reached out for help. Unfortunately and initially, via email, web-chatting and phone calling was not very responsive and resolving the matter until Stephen managed to solve the whole problems in one go in about 15 minutes. After that, my G3 and data packages have worked perfectly as advertised. I wish there were no such troubles. Otherwise, GlocalMe would be qualified as a 5-star product and services."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 3,
          "Date": "2020-09-23T02:58:16.000Z",
          "Titre": "Love GlocalMe",
          "Contenu": "Signal is not available everywhere when we are far from big centres but generally, it is very good. The price is good to, especially with the two for one offer. It should always be that way."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Carmen Roy",
          "Nb_Reviews": 7,
          "Date": "2021-03-04T19:33:18.000Z",
          "Titre": "I am new to the cellular world",
          "Contenu": "I am new to the cellular world. I had a lot of questions for GlocalMe. I kept asking until I understood what was sent to me. GlocalMe never got tired of answering my questions."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Donghyuk  Kim",
          "Nb_Reviews": 2,
          "Date": "2020-09-29T14:08:55.000Z",
          "Titre": "Satisfied with their follow-up process",
          "Contenu": "I updated my original review because they had followed up on my issues and put sincere efforts into resolving them. It was a simple proof about how they consider customer value."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T08:29:27.000Z",
          "Titre": "Device often loses connection or it…",
          "Contenu": "Device often loses connection or it takes ages until connection is established.Beside that prices are very fair and a good alternative to my phone provider data plans."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Frank Daske",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T17:44:50.000Z",
          "Titre": "Worked for a long time in different…",
          "Contenu": "Worked for a long time in different countries. Today it won’t boot. But a chat with the service could solve the problem in minutes. I’m happy with this."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "nn",
          "Nb_Reviews": 2,
          "Date": "2021-08-29T03:19:31.000Z",
          "Titre": "Quick response via chat",
          "Contenu": "I contacted the hotline (via chat) due to a problem with my device (neos). Mike from the online service quickly responded and my problem is resolved."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-10T13:58:58.000Z",
          "Titre": "The wifi seems to be very slow.",
          "Contenu": "The wifi seems to be very slow.  Customer Service contacted me to say that they had tweaked my account.  There has been improved performance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Video Pete",
          "Nb_Reviews": 3,
          "Date": "2021-07-05T18:04:47.000Z",
          "Titre": "Great device but a little confusing as…",
          "Contenu": "Great device but a little confusing as to which plan to choose when you are primarily streaming video—-also doesn’t work well when cell service is poor"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer eh!",
          "Nb_Reviews": 2,
          "Date": "2022-01-10T21:22:18.000Z",
          "Titre": "Asked a quick question",
          "Contenu": "Asked a quick question, and Mike answered it quickly and accurately (I think, have not actually tried it yet!) LOL Seems easy enough."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "ANDREW POWELL",
          "Nb_Reviews": 9,
          "Date": "2021-08-25T10:00:55.000Z",
          "Titre": "Quite easy to use with the data i…",
          "Contenu": "Quite easy to use with the data i bought & lasted ok over 5 days holiday for several devices. Yet to try & use with overseas sim card."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T02:31:49.000Z",
          "Titre": "Good for use but long starting time",
          "Contenu": "Long waiting time, good for many countries and areas. If starting time was shorter, I would be more than happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glen Wulf",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T12:55:30.000Z",
          "Titre": "Good connection worked as soon as I…",
          "Contenu": "Good connection worked as soon as I landed - I recommend activating it before leaving your home country. Pricey though but somewhat worth it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 2,
          "Date": "2020-09-26T15:10:03.000Z",
          "Titre": "I love to travel with my Glocalme",
          "Contenu": "I love to travel with my Glocalme - always reliable  can share it with my wife and kids when we travel abroad without incurring terrible roaming fees."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EC",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T06:22:45.000Z",
          "Titre": "Equipment to be used abroad",
          "Contenu": "Mike helped me with questions about choosing equipment to be used abroad.Mini Turbo or Duo Turbo are the options recommended."
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T16:00:13.000Z",
          "Titre": "Max was able to guide me in order to…",
          "Contenu": "Max was able to guide me in order to get my device working again. It helped to discharge it completely and charge it again. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Duenas",
          "Nb_Reviews": 2,
          "Date": "2021-08-08T02:28:37.000Z",
          "Titre": "Mike assisted in getting my WiFi to…",
          "Contenu": "Mike assisted in getting my WiFi to work.  However, my screen does not show the plan I purchased which is the $380, 365 day 100 GB plan."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T15:09:03.000Z",
          "Titre": "Northern Ontario Cottage connected :-)",
          "Contenu": "Northern Ontario Cottage connected :-)This device and plans are perfect of my remote northern Ontario cottage."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A McLeod",
          "Nb_Reviews": 3,
          "Date": "2022-05-18T00:46:47.000Z",
          "Titre": "Horrible Customer Service/ Repair",
          "Contenu": "Update: 5/13/2022After my initial post on Trustpilot a representative reached out to me and satisfactorily resolved the problem. Thank you Trustpilot and the representative who reached out to me to resolve the issue.  —————————Great device. Horrible customer service! I have had my device for years. My charging port needs to be replaced. I went through Glocal Me’s website and inquired about an out of warranty repair. Instead of having me ship my device to them for a diagnosis and quote they were pressuring me to buy a new device. I declined and they kept repeating the same thing. I asked if they had a service and repair center. They said yes. I told them I’m willing to pay for the repair. I asked for a location to mail my device to or provide me with an authorized repair center near me. I was told they had no authorized locations in the US; however, I just found one in New York. Again they were pressuring me to buy another device. I declined again and asked for a supervisor. I was told all were on vacation and I would have to wait a week until they return. I will never buy another device or continue to refer clients to them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher De Poy",
          "Nb_Reviews": 2,
          "Date": "2021-07-19T13:23:24.000Z",
          "Titre": "Download speeds have been spotty at…",
          "Contenu": "Download speeds have been spotty at times and streaming of movies has been consistently interrupted, sometimes for minutes at a time."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T22:10:55.000Z",
          "Titre": "Easy to use.",
          "Contenu": "Easy to use.Good to use it when you go to overseas trip. I used this when I went to Italy, Germany, Austria and Czech. I did not have problem."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 2,
          "Date": "2020-10-12T17:27:34.000Z",
          "Titre": "Nice tool for business travellers",
          "Contenu": "Nice tool for business travellers. It's still having room for improvement, like stability of data transfer, but manly it is very useful."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Turgay Imrencler",
          "Nb_Reviews": 5,
          "Date": "2021-07-05T17:58:47.000Z",
          "Titre": "It is only english oder Chinese no…",
          "Contenu": "It is only english oder Chinese no other languages available. Permanent advitersment. Data packages at least for Germany too Werk."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T20:19:55.000Z",
          "Titre": "It’s good with the 30 days plan but if…",
          "Contenu": "It’s good with the 30 days plan but if you purchase every day it’s really expensive and the data go real fast.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T19:48:34.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, great customer service. Data packages get depleted too quickly. Just reading on the net is getting too expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 3,
          "Date": "2021-02-24T12:54:16.000Z",
          "Titre": "Better than the Rest",
          "Contenu": "I think between SkyRoam, Roamingman and GlocalMe...GlocalMe is the best in terms of quality, tech support, cost and reliability."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 2,
          "Date": "2020-11-03T10:38:33.000Z",
          "Titre": "your support is good most of the time",
          "Contenu": "your support is good most of the timethe battery is not enough the language keeps turning to Chinese it is hard to find your way"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T10:54:38.000Z",
          "Titre": "The Internet is not strong enough for…",
          "Contenu": "The Internet is not strong enough for international calling sometimes I get dropped calls and reconnecting to the Internet."
        },
        {
          "Note": 4,
          "Lieu": "HR",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T19:26:45.000Z",
          "Titre": "Internet service worldwide",
          "Contenu": "Internet service in Europe, US, Canada, Hong Kong and Singapore is very good, but in China, Middle East and India is not so good."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-25T09:07:14.000Z",
          "Titre": "In Aqaba Jordan,was not connecting to…",
          "Contenu": "In Aqaba Jordan,was not connecting to Jordan network,so I couldn't use mid east package. Instead I had to buy Israeli pass"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-10T06:29:25.000Z",
          "Titre": "Great gear",
          "Contenu": "Great gear. In my case not enough signal strength to enable high download rates and no option to connect external antennas."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "heer Roelofs",
          "Nb_Reviews": 2,
          "Date": "2020-09-26T10:25:27.000Z",
          "Titre": "I bought a Glocalme G3 last year and…",
          "Contenu": "I bought a Glocalme G3 last year and traveled with it in China for a month, in Hong Kong for a week and in New-Zealand for four months. Glocalme Always gave me an optimal connection with a local  provider, even in the middle of nowhere. Not having to find out myself  which provider offered  good connections in a particular area and not having to buy multiple sim cards was very convenient. I just turned on the Glocalme hotspot and we were able to use 2 mobile phones and two tablets simultaneously every time. I have occasionally also  used it as  a spare battery to recharge my phone. Topping up my bundle on line was convenient too. Glocalme has a good choice  in bundles of  varying validity times and sizes for  the different  countries and area's. I can recommend it for all travelers.It may not be your cheapest option but it is convenient and trustworthy when you travel far away. I absolutely recommend using the Glocalme G3.  But remember to also get a good quality VPN subscription before you leave! Hans Roelofs, The Netherlands. Sept. 26 2020."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KTYRELL",
          "Nb_Reviews": 2,
          "Date": "2021-03-05T21:38:14.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. The device came fully charged and I was able to speak with a customer service representative in seconds."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "GlocalMe customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T13:03:03.000Z",
          "Titre": "Pretty easy to use",
          "Contenu": "Pretty easy to use. Worked well using it in ihr trailer to watch Netflix, which used up our data fairly quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trucker Tre",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T12:49:04.000Z",
          "Titre": "Very Satisfied Customer",
          "Contenu": "I would give 5 stars if data lasted a little more than 30 days. I would still recommend this service to others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer Victoria Col",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T03:11:39.000Z",
          "Titre": "I dont understand when you buy a 365…",
          "Contenu": "I dont understand when you buy a 365 days but you don't get that many days. Can you explain how it works?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Shelgren",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T19:03:22.000Z",
          "Titre": "5 Star support",
          "Contenu": "I lost a device with data plans and when I linked the replacement device they disappeared.  I contacted support and within minutes Elaine had found the lost data plans and transferred them to my new device.  Friendly, helpful, professional, knowledgeable and smart."
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Billy Badminton",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T20:12:12.000Z",
          "Titre": "Had a problem with the device as we…",
          "Contenu": "Had a problem with the device as we couldn't connect to the WiFi.  Spoke with Lucas who talked us through the issues and it turned out we had registered the device to my wife's email but the data package to mine!? After Lucas explained what to do it all worked perfectly."
        },
        {
          "Note": 5,
          "Lieu": "SC",
          "Pseudo": "Burridge",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T12:23:54.000Z",
          "Titre": "This has to be the most useful travel…",
          "Contenu": "This has to be the most useful travel tool ever. It’s an absolute dream to use - simple and efficient. The app makes very clear what packages are available and at what price.,Then, you simply hook up and use your very own portable wifi. Just LOVE IT!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara Gutierrez",
          "Nb_Reviews": 3,
          "Date": "2023-10-29T18:07:00.000Z",
          "Titre": "Diana, Thank you!",
          "Contenu": "Ive been a customer from GlocalMe where the network may not always work depending on the country. Ive encountered multiple issues with the data in this company and everytime i reach out, the support is not as helpful as i much i expect considering how expensive their devices are for a hotspot. Now, today ive had multiple issues and reach out to their customer service and came across Diana. Diana was the first agent that really went to find a solution for my issue.  Felt inmense gratitute as she saved me a lot of frustration! Thank you Diana."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "FloMaster",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T12:39:37.000Z",
          "Titre": "Support as it should be.",
          "Contenu": "I was very pleased with my recent contact to the support team. I accidentally activated a new device with the wrong account but Diana helped me internally with the transfer of the included data balance to the correct account. Friendly, quickly & straight forward, as it should be."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JR",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T15:49:04.000Z",
          "Titre": "During my travels in Europe",
          "Contenu": "During my travels in Europe, I really a trustworthy internet connection for my job. To my surprise, even in the far-off countryside of Ireland, I managed to find reliable Wi-Fi. Plus, whenever I had any issues and had to reach out to their customer support, they were always super fast and helpful."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Wayne Gooding",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T15:27:49.000Z",
          "Titre": "Great customer service on the road",
          "Contenu": "I have used GlocalMe in Europe, Asia and North America, for the most part without problems. Customer service on the road, though not much needed, has always been fast and efficient. Thanks Lucas for your speedy help while I was in Tokyo recently to correct a problem when my device, though still working, presented with a lock screen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rae Childs",
          "Nb_Reviews": 4,
          "Date": "2023-10-10T21:04:41.000Z",
          "Titre": "To Be A Professional Digital Nomad Or Not To Be",
          "Contenu": "I didn't want to indulge myself and buy one of the most expensive items out there. I wanted to pull myself back and say I didn't need the 5g. But here I am abroad, teaching online, in a foreign country, where both the hotel wifi and the local sim card I bought, failed one day. I used my Glocal Me Numen Air, with a 4g GM plan for the first time and it worked clear as day. It then saved me again the next day when the same thing happened. Extremely pleased. Thanks for saving my job. Go big or go home!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Carmen Roy",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T15:27:04.000Z",
          "Titre": "As soon as Elaine came on her shift at…",
          "Contenu": "As soon as Elaine came on her shift at 17:44 everything became easy. She first reviewed the chat string. Then she showed me how to find my phone imei. Then she accessed my account, forwarded my request to Clink. The next day I received an email giving me an extra 10%off my data package which was on sale again at a lower price."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "JeremyHRC",
          "Nb_Reviews": 9,
          "Date": "2023-09-22T13:09:12.000Z",
          "Titre": "Super satisfy",
          "Contenu": "I used my glocalme for 6 years nowsuper Efficient wherever I am but The masterpiece is the customer service, that makes THE big difference with others sellerMy last experience with Diana was super clear, quick and efficient.They now how to keep clients !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marlana",
          "Nb_Reviews": 3,
          "Date": "2023-09-22T16:15:25.000Z",
          "Titre": "Fantastic service",
          "Contenu": "Fantastic service and truly wonderful customer service. Any time I have questions or if I need help with something, they’re quick to answer and help out. I am super pleased with everything from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T14:05:18.000Z",
          "Titre": "Excellent Customer Support",
          "Contenu": "Excellent Customer Support! Diana helped me with corrections on my account to my data plan and did everything quickly and without any hesitation! It's great to have this Numen Air device for travel, but the great support that comes with it is also an unexpected plus!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brian Fysh",
          "Nb_Reviews": 3,
          "Date": "2023-06-05T14:20:55.000Z",
          "Titre": "\"Must Have\" Travel Companion",
          "Contenu": "Since retiring, my wife and I are doing more traveling than ever...and GlocalMe goes with us wherever we go. Reliable service and it is much cheaper than paying for an extended cellphone plan. We have used it in North America, all over Europe and in the Islands. We have the Duo Turbo and the Sim card comes in handy where Glocal service isn't provided. It also serves as our cottage Wifi as service is not available in our area ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Penners",
          "Nb_Reviews": 11,
          "Date": "2023-05-10T03:25:51.000Z",
          "Titre": "Excellent Customer Service:  Fast and Focused…",
          "Contenu": "I had a little trouble having my iPhone talk with the new G4 Pro from GlocalMe.  My iPhone recognized the network but couldn't connect.  G4 Pro had a way to connect with Tech Support, and Elain helped solve my problem within 5 minutes, even while a GlocalMe device upgrade was happening.  I'm not a techie at all, but I was able to follow setup and get this device working well, with Elain's quick support, in little time.  I'm road testing this in Singapore and Japan, but so far it seems to work great - faster service than my cellular service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kerry McCulloch",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T21:32:48.000Z",
          "Titre": "Farro was wonderful",
          "Contenu": "Farro's customer service was wonderful (the product itself, I'm not so certain). During my last work travel experience, I had an issue with my Duo Turbo where the physical SIM card stopped working, despite still having data. I wanted to test the hotspot before my next work trip and Farro set me up with 8GB of North America data for me to try my hotspots to ensure they were working. So far the hotspots work excellently with the data purchased from GlocalMe and have not worked all that well using a physical SIM card.... I'm hoping this next work trip goes more smoothly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thai-m Traveler",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T22:28:31.000Z",
          "Titre": "Glocal online customer service is excellent",
          "Contenu": "I think that Glocal online customer service could be one of the easiest and best customer service I have had in recent years. I had a few questions about one of my coupons and wanted a little clarification on having multiple packages for a single country and the terms in which they would trigger/expire so I reached out to the support team via the android app and was connected with Lucas. Lucas was was extremely helpful and was able to   provide me with a clear and concise yet detailed explanation my packages would work, and when each would kick in. On top of all of that he was able to provide me with a replacement coupon code since the one I had intended to use has recently expired! Over it was a very help and pain free experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carmela A.",
          "Nb_Reviews": 4,
          "Date": "2023-04-10T13:09:26.000Z",
          "Titre": "Customer agent ELAINE is very helpful. Excellent service.",
          "Contenu": "Customer agent ELAINE is very knowledgeable and helpful. She didn't stop until my issues were solved. Glocalme service is excellent, plus the portable wifi has a strong signal when i was in Australia. We used 5 devices and never had a problem with the connections, even my husband was impressed how fast the wifi is...and their plans are cheaper than Solis."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "George",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T21:25:16.000Z",
          "Titre": "Really responsive- These guys are always on the end of the…",
          "Contenu": "These guys are always on the end of the live chat for help when you need. Diana answered my query immediately today and I was sorted within minutes! Glocalme has been fab for me quickie I’ve travelled around Europe for 5 months."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Pointyendpreferred",
          "Nb_Reviews": 4,
          "Date": "2023-08-04T00:46:12.000Z",
          "Titre": "Every time I have needed Support from…",
          "Contenu": "Every time I have needed Support from Glocalme, it has been quick, efficient and friendly. Max fixed my issue just now in minutes. I wish I had contacted Support earlier instead of just getting frustrated!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mrs. Ali",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T05:07:08.000Z",
          "Titre": "Great Device and Customer Service",
          "Contenu": "I have been using this device for a few months now, and I absolutely love it. It come in handy when traveling. Whenever I reach out to support, I receive outstanding customer service without any delays. Farro was extremely kind, helpful, and responsive. My issue was resolved in no time."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Ana Mcculloch",
          "Nb_Reviews": 3,
          "Date": "2023-04-13T08:20:40.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, always chat available.. Diana and Farro are the best! The other agents sometimes not willing to help or give us wrong information.. Technical support need to understand that sometimes error occurs and we let us down.. I use also Skyroam so I have both experiences .."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Bausk",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T02:28:05.000Z",
          "Titre": "Awesome tech support!",
          "Contenu": "Just needed some tech support as I hadn't used my device in awhile. They answered the online chat within a minute and I was connected to Diana. She was excellent in helping me via chat to get my device working. Going to be traveling more now that Covid is behind us and will be using my GlocalMe more. Love the device and especially the great customer service they provide!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jennifer Mancell",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T07:09:46.000Z",
          "Titre": "Great service and tech support",
          "Contenu": "We have been using GlocalMe during our travels for 2 years to date, through Canada, the US, the UK and New Zealand. We have rarely experienced any problems but on the couple of occasions we have had difficulty connecting the online service has been quick, efficient and effective. Thanks to Elaine and the tech support for quickly solving our issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emm Gee",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T13:51:27.000Z",
          "Titre": "Good customer service",
          "Contenu": "Convenient, pretty easy to use service.  What is actually outstanding is the customer service.  I’ve had to reach out twice with small issues and both times were solved quickly and easily.  Once over email, and another time using the chat feature.  Diana on chat was quick and pointed me in the right direction to get my question answered.  Thanks Diana!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Georgia",
          "Nb_Reviews": 3,
          "Date": "2023-06-04T00:27:07.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I purchased DuoTurbo and customer service have been very responsive immediately from pre purchase to post purchase. Shout out to Cara (pre purchase) and Elaine (post purchase). Will provide a review update when I start using their service data in the US and part of Europe in the coming days."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Roman",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T14:21:47.000Z",
          "Titre": "Works great! And IF - they have a great support!",
          "Contenu": "The product is awesome in general... with such a nice and small device you can provide an internet connection through WiFi for up to 8 devices. It´s easy to configure, easy to use and it´s great that you can buy data for so many countries. Most of the time we´re travelling in a group from 2-4 people (everyone with smartphone and laptop) and so we can share this connection on trips and out of the hotel where there´s normally internet through hotspots.Even when you have some issues, the helpdesk from GLocalMe is awesome (especially Diana!) and can fix any problems really quick and friendly.Thanks - the world was in need for that product!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Amanda Cox",
          "Nb_Reviews": 6,
          "Date": "2023-10-19T13:18:28.000Z",
          "Titre": "Excellent support",
          "Contenu": "Excellent online support and patient advice to resolve an issue I couldn't have understood myself. Wonderful service from Diana. Gives me confidence for using my router and this service abroad."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. Clark",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T05:34:38.000Z",
          "Titre": "Resolution 👍",
          "Contenu": "Resolution 👍Many individual hidden steps would not have been reasonably navigated.Likelihood of days effort unsuccessful was gratefully avoided in literally a moments effort by 'Diana' to successfully readily immediately migrate five different packages to my new replacement device.I'm saved so much frustration and so very grateful for this and every time I've been able to lean on glocalme for help.    Thank you much,    Mr. Brett Clark"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesus Bernal",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T13:44:25.000Z",
          "Titre": "This is my first time using this…",
          "Contenu": "This is my first time using this service.I was able to travel into 2 countries without loosing service and with consistency.My real concern was traveling into some areas with low Internet access. Not rural but close enough, I was able to keep the consistent level of internet access at all times! I was impressed.Will use this again on my next trips."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenya DuHaney",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T07:16:39.000Z",
          "Titre": "I accidentally converted my data into…",
          "Contenu": "I accidentally converted my data into points. Jenny was able to help me she'd figured out the issue and had me up and running in no time.  She was very patient while assisting me. All your employees should be like that. Thank you once again, Jenny."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nick",
          "Nb_Reviews": 2,
          "Date": "2023-06-26T11:52:36.000Z",
          "Titre": "Contacted support (online chat)",
          "Contenu": "Contacted support (online chat). Was answered very quickly by Mike who resolved my issue in a very efficient and timely manner. A bit too early to comment on the product yet, but the customer support was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T08:58:27.000Z",
          "Titre": "Jenny provided excellent customer…",
          "Contenu": "Jenny provided excellent customer support on chat. She is knowledgeable, helpful, and patient. I am a novice when it comes to this technology and Jenny very patiently walked me through, step-by-step, to get my account, device, and iphone connected. Thank you so much Jenny!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samantha",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T05:48:17.000Z",
          "Titre": "Mike’s amazing!",
          "Contenu": "I was dealing with really slow internet speed, maybe because I barely got this device today, but I spoke to customer service about it. I got connected with Mike and he was super patient and amazing. He fixed the issue with tech and I’ve got super fast wi-fi now. Thanks again, Mike!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melanie R.",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T03:21:23.000Z",
          "Titre": "I am new to the GlocalMe Family and this is my first time trying to use my GlocalMe Device",
          "Contenu": "This is my first time trying to use my GlocalMe device. I was so confused and tried several times to connect it on my own, so I did an online chat and Elaine was a godsend. She got me connected in no time and I love that she was so knowledgeable and patient with me. I was so excited to see that my device is working like a charm. You rock Ms. Elaine!! Thank you for your help and patience with me! You are a great asset to this company! They are lucky to have you!"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T11:15:56.000Z",
          "Titre": "Unbelievable Customer Service - thx ELAIN!",
          "Contenu": "Got an issue with my data plan, because I have to cancel my trip to Italy. Asked the support team what to do:Once again i was surprised by the outstanding customer oriented (and unbelievable quick & easy) service!Thank you - made my day 🤗"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T01:39:21.000Z",
          "Titre": "I accidentally locked my self out of…",
          "Contenu": "I accidentally locked my self out of the device and Diana was able to resolve my issue within minutes, saving valuable time on my trip!  This was fantastic support.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LC",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T22:09:57.000Z",
          "Titre": "Five stars all around",
          "Contenu": "The whole experience was easy and great. Diana was especially fast and helpful, she responded and resolved my issue in under five minutes which I find very impressive! Thank you to all and especially Diana."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Ari",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T15:39:48.000Z",
          "Titre": "Jenny and Lucas were wonderful in…",
          "Contenu": "Jenny and Lucas were wonderful in helping me register my ID when I arrived in HK and had trouble registering in order to activate my data plan. In this age when AI takes over chat functions , it's wonderful to be assisted by a real person in real time."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Jens",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T16:54:23.000Z",
          "Titre": "Customer Service Chat (Mike)",
          "Contenu": "Had a chat with Mike from Customer service. He directly solved my topic when activating my free data package directly during the conversation! Also he answered my questions. Very good, thanks Mike!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "RB",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T11:14:47.000Z",
          "Titre": "U3 Device Wouldn’t Connect…",
          "Contenu": "I arrive in Germany and my U3 hotspot wasn’t working. I was able to use the online support and Jenny was awesome! She provided the best customer service I’ve had in a long time. Got my hotspot working and took the time to ensure everything was functioning properly. Superb service! Thank you Jenny!!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Greg Whittle",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T05:45:31.000Z",
          "Titre": "Diana assisted me to claim an extra data offer. Excellent Service",
          "Contenu": "I chatted with Diana to claim an offer of extra data that was offered when I purchased my G4 Pro through Amazon.The data was immediately made available to my device and is ready to go upon my arrival in North America.Great work and very efficient"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Walter",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T07:54:36.000Z",
          "Titre": "Issue Resolved",
          "Contenu": "I had an issue where my UPP Puck would not connect to the internet even though there was a package available. I visited the online website and chatted with Lucas. He was able to resolve the issue. Thank you Lucas for the help. Especially when I'm abroad and needing the Puck."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Regie Gerlus Masse",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T01:36:01.000Z",
          "Titre": "Great customer service",
          "Contenu": "Needed tech support to enable a sim on my new device. Mike helped and I was able to enable it in less than 10 minutes. Should have started there instead of wasting 1hour alone. Satisfied client and would recommend this company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T21:24:39.000Z",
          "Titre": "Awesome customer service!",
          "Contenu": "Literally just got my second hand G4 powered up and ran into issues. Diana was so fast in responding, you’d think she was in the same room!  Thanks Diana!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamba Lamin",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T08:14:24.000Z",
          "Titre": "What I experience as far as customer…",
          "Contenu": "What I experience as far as customer service is concerned is you people are excellent and superb. Stephen your worker exercise a lot of patience and time to give me head up. I became confused but he took his time to let me know that they are the best. Stephen,you work with people and love to see their problems solved. Keep it up. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jena Pang, concert pianist",
          "Nb_Reviews": 4,
          "Date": "2023-06-06T16:29:45.000Z",
          "Titre": "I have been using a G3 Glocalme since…",
          "Contenu": "I have been using a G3 Glocalme since 2017. It has been wonderful when travelling abroad or for using in the UK where i live. Since the pandemic i haven’t used it but recently went on a weekend away and bought data and tried to use it. For some reason it wasn’t loading webpages and just didnt seem to work so i ended up using hotel wifi. I thought maybe my device was outdated with all the 5G products now. So i contacted Glocalme online about my experience and was messaging with Lucas to ask whether i needed to update my device to a new 5G. He was very helpful and gave me a free data plan to test my G3 again in the UK. It is working fine so possibly it was the area i was in up North that didnt have good wifi reception but i have used my G3 all over the world previously. Anyways, i will see how i get on but i wanted to say thank you to Lucas for his helpfulness."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Joel",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T00:26:16.000Z",
          "Titre": "Who needs a phone plan anymore",
          "Contenu": "Glocalme not only offers a pretty great service, but their customer service is also very fast and helpful.I admit I was skeptical before I got my device (the UPP) and wondered if it would really work as described. Especially since I bought mine as part of an offer where the device is free if you just pay $200 in advance for your future plan purchases... which you would eventually have to pay for anyway. It seemed too good to be true. But I took the chance, and now having used my device all over the world, I'm very happy with it. Who needs a phone plan anymore. Big thanks to Lucas for answering my support question in under a minute and also for the 15% discount!"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "CB",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T09:52:38.000Z",
          "Titre": "GlocalMe's support is super fast",
          "Contenu": "GlocalMe's support is always so fast and reliable. They did help me re-activate and upgrade my old U2 device that I bought years ago and didn't use in the last couple of years. It wouldn't connect to a network at all. Thanks to Diana and Farro and their support, I can use the device again and am good to go."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bianca",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T09:01:08.000Z",
          "Titre": "Lucas was an excellent support in…",
          "Contenu": "Lucas was an excellent support in getting my device going again. He connected me with the correct questions and answers and was able to get me connected to my plan. I look forward to using my device on a daily basis."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mumu",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T04:41:51.000Z",
          "Titre": "Customer Service, Jenny is great!",
          "Contenu": "I just got a device today and noticed it doesn’t have the free 8 GB on it so I contacted the customer service on online chat, Jenny, who was helping me and added the free 8 GB on my device immediately. Thank you, Jenny for your great service!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corey",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T08:23:08.000Z",
          "Titre": "Stephen was thorough",
          "Contenu": "Stephen was thorough, patient and helpful. I appreciate his help throughout the upgrade process of my U3 device. He made sure my problem was resolved. I'd be happy to go to him for support again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamara M",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T05:13:41.000Z",
          "Titre": "I had a great experience get my new…",
          "Contenu": "I had a great experience get my new device started, upgraded, tested and ready for my trip.Jenny has been such a great help guiding me with instructions and able to answer all my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Pleasant",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T15:51:08.000Z",
          "Titre": "Support is Everything and Glocalme has it!!",
          "Contenu": "The only thing better than the product itself is the support team at Glocalme.com.  As much as I wanted to use the very efficient unit, my traveling abilities came to a sudden stop the day my unit was delivered.  I had to return it for a refund.  No problem!  Great people to work with! Refund was received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddie S.",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T20:50:05.000Z",
          "Titre": "I just bought my second Glocalme - great service",
          "Contenu": "I just bought my second Glocalme product.  They are great to stay connected when traveling.  Just contact their text support and got great assistance from Max."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Ana Luisa Alcalá",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T00:41:44.000Z",
          "Titre": "Diana is fantastic",
          "Contenu": "Diana is fantastic! She helped me solve all my doubts, excelent service!"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "CT",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T08:11:56.000Z",
          "Titre": "Diana was amazing and very patient",
          "Contenu": "Diana was amazing and very patient. She helped me get my pocket wifi working! Thank you, I can start enjoying my trip!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angie",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T04:10:46.000Z",
          "Titre": "I have truly enjoyed having access to…",
          "Contenu": "I have truly enjoyed having access to internet when I needed it. I have moved and got the internet I needed. I chatted with Diana and she was prompt with her service provided to me and helped me for the near future. Thank you Diana."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bobby cabello",
          "Nb_Reviews": 3,
          "Date": "2023-03-14T17:09:57.000Z",
          "Titre": "Mike was wonderful I love my device he…",
          "Contenu": "Mike was wonderful I love my device he helped me get my minutes back he was quick he was fast he answered right away this is really good service I love it thank you"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Sincere Yip",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T12:51:59.000Z",
          "Titre": "Mike the trustpilot has been really…Very good customer service!",
          "Contenu": "Mike the trustpilot has been really helpful in navigating me to go through all the process for real name registration. He’s very knowledgeable on the subject I have query on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T16:55:32.000Z",
          "Titre": "Lucas was very professional and prompt…",
          "Contenu": "Lucas was very professional and prompt in assisting me with my plan and updating my device. I am looking forward to using my device inn Europe.  Very happy customer!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Colin Ralph",
          "Nb_Reviews": 4,
          "Date": "2023-07-07T15:54:42.000Z",
          "Titre": "Mike  was was very prompt",
          "Contenu": "Mike  was was very prompt and responsive, quickly solved my issue, and gave good advice about prevention if the issue resurfaced. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T18:00:44.000Z",
          "Titre": "Diana gave me clear and concise…",
          "Contenu": "Diana gave me clear and concise direction.I started the device and was ready to travel in a short time.No frustration in set-up, excited to use my device.Thank you, Diana"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T01:41:19.000Z",
          "Titre": "Chat Consultant Mike",
          "Contenu": "Just completed a chat with Mike who assisted me with appropriate link to complete the login and password reset issues I was having difficulties with.  He was very helpful in resolving the issues! Kathleen"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SKO Greengoods",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T17:21:50.000Z",
          "Titre": "Had a serious problem trying",
          "Contenu": "Had a serious problem tryingto connect new business phone to my glm wifi,chated with Lucas he fixed problem in a flash..great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pete Peterson",
          "Nb_Reviews": 3,
          "Date": "2023-06-07T17:06:33.000Z",
          "Titre": "Diana was great",
          "Contenu": "I was having trouble getting a refund for unused data pack. Diana was extremely helpful in getting me the refund as I was booking for another country. Thanks Diana"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniella",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T07:05:21.000Z",
          "Titre": "Diana help me after hours understanding…",
          "Contenu": "Diana help me after hours understanding the process of getting connected and how to make purchases. She was a life saver.  Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Rae",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T04:14:25.000Z",
          "Titre": "Diana is very helpful!!",
          "Contenu": "Diana was so helpful in helping me setup my GlocalMe for travel!! She was very patient even though I was confused on how to login through email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristy",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T17:25:29.000Z",
          "Titre": "I was having trouble setting up my…",
          "Contenu": "I was having trouble setting up my Glocal device so I used the online chat. Mike responded quickly and answered all my questions so that I was able to get everything figured out. It was quick and easy once he explained everything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T10:25:05.000Z",
          "Titre": "Lucas was patient and kind with my slow…",
          "Contenu": "Lucas was patient and kind with my slow tech self!  I appreciate their time tonight and help w/ visual pictures."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nimah",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T19:31:28.000Z",
          "Titre": "Just got my device and activated it",
          "Contenu": "Just got my device and activated it, requesting the 8 Gb free data package was super easy and Diana the agent was very helpful and efficient!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Marianne",
          "Nb_Reviews": 4,
          "Date": "2023-05-12T00:29:19.000Z",
          "Titre": "I started on online chat",
          "Contenu": "I started on online chat, and within seconds, Mike was on the line.  I was having issues with my G3 telling me I was out of balance even though I had just purchased a package.   Mike had me try a couple of things.  The second one fixed the issue."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Silky",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T17:50:42.000Z",
          "Titre": "My network connection problem solved",
          "Contenu": "My network was not connecting but Mike did a great job in helping solve the problem.👍 thank you 🙏"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Purple Mist",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T09:59:29.000Z",
          "Titre": "Mike has amazing customer service",
          "Contenu": "Best customer service i have ever received, asked multiple questions and got help with all of them no issues."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Frank Martens",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T14:32:08.000Z",
          "Titre": "Glocal me perfect customer support by Lucas",
          "Contenu": "Their custom support is perfect and they react directly and really help you to solve your issues.In special Lucas he is the best  ! ! !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "markel",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T15:43:59.000Z",
          "Titre": "Customer service",
          "Contenu": "Customer service is speedy and very Helpful. Diana helped me with data questions and then helped me access the data plan on my device. She really is awesome! Thanks again Diana!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sonya",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T05:38:25.000Z",
          "Titre": "Quick and courteous.",
          "Contenu": "I had an issue with my computer buffering while using my hotspot and I contacted the company.  Customer Service was great and Mike solved my problem very quickly.  Great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janette Aminoff",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T15:02:08.000Z",
          "Titre": "Excellent support",
          "Contenu": "I received outstanding support for a technical issue. It was a simple problem but I could not solve it. Diana was very patient and helpful."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gerald Epstein",
          "Nb_Reviews": 14,
          "Date": "2023-06-25T12:05:26.000Z",
          "Titre": "Great support",
          "Contenu": "Diana - the representative, has just patiently helped me through setting up for an Africa trip next week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aileen Wetzel",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T19:52:48.000Z",
          "Titre": "Lucas provided great service",
          "Contenu": "Lucas was very helpful in letting me know my options for packages for travel to a remote part of the world. Pleasant, helpful, great experience."
        },
        {
          "Note": 5,
          "Lieu": "IM",
          "Pseudo": "Radovan",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T12:25:54.000Z",
          "Titre": "Very kind and fast in supporting with…",
          "Contenu": "Very kind and fast in supporting with my question and requestProblem fixed in very short time.Very professional All for 10 * for ELAINE"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Burke",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T03:30:50.000Z",
          "Titre": "Mike helped me and within a few minutes…",
          "Contenu": "Mike helped me and within a few minutes my problem was solved (trying to figure out if the hotspot was charged)."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Svana",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T19:48:39.000Z",
          "Titre": "The signal is good",
          "Contenu": "The signal is good. Very easy to change network provider. The customer service team are very nice, Mike help me solve my problem smoothly."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Gabriele Springer",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T11:09:18.000Z",
          "Titre": "Lucas has helped perfect",
          "Contenu": "Lucas has helped perfect, because my english language is not perfect, but he knows, what I want.Thanks Lucas"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trey",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T02:24:12.000Z",
          "Titre": "Great Service",
          "Contenu": "Elaine was very helpful. Responded to my inquiry within seconds and helped add my extra 8GB plan to my account. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T21:58:38.000Z",
          "Titre": "Good provider for affordable hotspots…",
          "Contenu": "Good provider for affordable hotspots and international internet service. When I had a problem activating a data package, their support was super fast responding and helping me out by chat. Lucas provided excellent support and got me up and running again! 👍🏻"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SKO Greengoods",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T03:30:43.000Z",
          "Titre": "Upgraded phones and had problems…",
          "Contenu": "Upgraded phones and had problems bringing my golome app over Stephen was great solved problem in record time.."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Kairi Nagamura",
          "Nb_Reviews": 2,
          "Date": "2023-03-18T17:37:16.000Z",
          "Titre": "Old device could not registered. (Updating firmware)",
          "Contenu": "Customer Service Representative \"Elaine\" supported updating my old glocalme device by email. Her explanation was easy to understand, courteous, fast response. Solved problem within 30min. I was very happy with her service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FilmJ",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T17:07:48.000Z",
          "Titre": "Lucas did a great job of explaining…",
          "Contenu": "Lucas did a great job of explaining things and providing support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B Tech",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T16:43:55.000Z",
          "Titre": "Dianna was great",
          "Contenu": "Dianna was great. Knew EXACTLY what she was doing. Deleted duplicate account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T07:02:03.000Z",
          "Titre": "Old device failed",
          "Contenu": "Old device failed, purchased new then data expired.Diana helped to get account credited"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cyndi",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T04:04:37.000Z",
          "Titre": "Device would not update data.",
          "Contenu": "Was having issues with my device not updating with new data.  Lorraine, was fast, kind and courteous. She fixed the issue and I was very happy with her service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Dury",
          "Nb_Reviews": 6,
          "Date": "2023-10-05T16:04:38.000Z",
          "Titre": "DIANA helped mw with a problem with my…",
          "Contenu": "DIANA helped mw with a problem with my GlocalMe usage account and she was MAGNIFICENT"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T01:11:59.000Z",
          "Titre": "Just purchased this",
          "Contenu": "Just purchased this, and it goes smoother than I thought. Online assisting team Diana is very helpful. Will start to use and see."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Cris",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T18:16:58.000Z",
          "Titre": "Great customer service",
          "Contenu": "I was planing to replace my G4 device to a Numen 5G. Lucas was patient and helpfull, guided me where and how to avail the device. Great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Bailey",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T15:56:18.000Z",
          "Titre": "Elaine is amazing",
          "Contenu": "Elaine is amazing! Her calm and patient nature walked me through each step. I could not have done this without her! A true GEM!I am a travel agent and will refer clients to your company all because of the wonderful service from Elaine! Job well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T23:39:59.000Z",
          "Titre": "Had an issue and customer service rep…",
          "Contenu": "Had an issue and customer service rep Lucas was awesome.  Thank you again. Glocalme service is good 👍🏾."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gilles",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T01:32:09.000Z",
          "Titre": "I Had a problem with my device G3",
          "Contenu": "I Had a problem with my device.  Simply chat with Diana, and she solved quickly my problem and answer rapidly to my request. 100% satisfied"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "E.H.",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T11:06:19.000Z",
          "Titre": "Diana was super fast and efficient in…",
          "Contenu": "Diana was super fast and efficient in getting my issue fixed. Wonderful customer service.  Thank you for having such a great customer service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Linda P",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T05:20:11.000Z",
          "Titre": "Diana was great",
          "Contenu": "Diana was great.  Answered all my technical questions promptly and gave me recommendations on how to operate my 2 hotspots within the same account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T23:04:06.000Z",
          "Titre": "Wherever you are, Glocalme is there for you.",
          "Contenu": "I have been a Glocalme customer since 2016 while in Fiji. I have used my portable Wifi over the years and had no complaints. More recently, I updated my unit to the Duo Turbo with Glocalme in anticipation of working on Semester at Sea (2023) and needing a portable Wifi while I was traveling to many countries (and being out at sea) and dependent on Wifi for my job. Many of us on the voyage needed reliable Wifi, but I was the only one with a Glocalme Duo Turbo unit and experience with this company. While on a ship, we went from Dubai to India to Kenya to Jordan to Croatia and further. Whether we were out at sea or in port, Glocalme made sure I had Wifi - and it did not cost me a fortune, in fact, it was incredibly affordable. Once I got back to the US, I had to be in a remote part of Michigan where Wifi access was poor. I did not think that in the US the Glocalme service was an option, but it was. And so I bought a 30 day package and I am using my computer, streaming, downloading files and feel very supported, here in Michigan. Just today I texted with Diana (a real person) and she helped me fix some issues which were not Glocalme issues, they were my Settings issues. And she gave me a discount code so I could further reduce my costs. I cannot say enough good things about this company. I live and work in the US and in over 90 countries in the world. There is nothing like Glocalme. Their products work, their prices are very competitive, and their support personnel are amazing. Thank you, Glocalme. I owe my professional life survival to you!!"
        }
      ]
    }
  ]
}