{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "goayo.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debra Evans",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T23:15:07.000Z",
          "Titre": "Have not noticed any improvement using…",
          "Contenu": "Have not noticed any improvement using the product"
        },
        {
          "Note": 2,
          "Lieu": "EE",
          "Pseudo": "Jovana",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T12:07:49.000Z",
          "Titre": "Marketing is great",
          "Contenu": "Marketing is great, and your research on the page.in real life, i have used it for 2 months consecutively (religiously) and i have not noticed a difference. Very expensive device..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Philip Larratt-Smith",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T01:59:35.000Z",
          "Titre": "Never got my key for the app"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nikki Ford",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T18:30:49.000Z",
          "Titre": "Still no Android app",
          "Contenu": "Too early to notice potential therapeutic benefits. However there is no app for Android; the app feature was thr selling point over the competitor. If it actually launches, I'll update my rating. Arms on glasses are a bit too long for me so the glasses slip down easily, but I do have a small head so they probably fit most adults fine"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kelly harrington",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T01:06:10.000Z",
          "Titre": "Customer Service Redeems Reputation Sale went through after it had been…",
          "Contenu": "Sale went through after it had been cancelled a week prior, which was aggravating…However, reimbursement is forthcoming and customer service was quickly on it, so that raised a 1⭐️ rating to a 3⭐️⭐️⭐️"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Kathy",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:24:09.000Z",
          "Titre": "Good customer service",
          "Contenu": "Happy with the contact and quick response"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonny HotCakes",
          "Nb_Reviews": 2,
          "Date": "2021-09-17T12:11:04.000Z",
          "Titre": "Alex was very helpful and efficient…",
          "Contenu": "Alex was very helpful and efficient helping get a replacement AYO due to a battery issue. I would have rated exchange a 5 if the replacement AYO shipping could have been expedited."
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "Valeri Petrov",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T11:49:50.000Z",
          "Titre": "Quick response and delivery",
          "Contenu": "Quick response and delivery. The product is very good. On the flip side, it was not clear the new Android app is still not ready so I had to struggle with  the old version. But the support I got from the company after that was timely and helpful."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rowan",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T09:48:06.000Z",
          "Titre": "On time and as advertised",
          "Contenu": "The order was received promptly and was as described.  I chose the basic no app version and love the simplicity.  Open the arms, place on face and light is on for 20 minutes. Light is not overwhelming and they fit over glasses too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colleen F.",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T02:59:53.000Z",
          "Titre": "Great Experience",
          "Contenu": "I was skeptical if this device would do anything but decided to make the investment for my health (reputable sources recommend getting bright light in the eyes first thing in the morning). For context, I have very low energy in the morning/trouble getting out of bed and I'm usually tired all day. Ayo to the rescue! I'm really happy to report a significant improvement in my energy levels after just 2-3 days of using this! It also helps to adhere to a set schedule (bedtime/waking) to achieve a more balanced circadian rhythm. The glasses are lightweight, well-built, and shut off automatically. The light is bright but not unbearably so, as I've read some other similar devices are. The app is helpful but I don't think it's a necessity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:13:09.000Z",
          "Titre": "New product AYO+",
          "Contenu": "Very refreshing to have Alex Dimitrov reach out and contact me via email with more details on the AYO+ product.   Customer support is lacking these days and Alex and his company are making a difference.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L. Russell",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T01:34:19.000Z",
          "Titre": "I am now on my 3rd pair of glasses",
          "Contenu": "I am now on my 3rd pair of glasses from AYO. It's been a great experience in general (mostly just issues with the app) and the glasses really help when the days get shorter. Every time I have had to reach out to their support team I get a response within 24 hours and from someone who knows what they are talking about. I always get my issues resolved and quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jordan J",
          "Nb_Reviews": 5,
          "Date": "2023-12-02T15:50:34.000Z",
          "Titre": "Love the V2 model!",
          "Contenu": "I was an early adopter of the original V1 model and loved it, but V2 is even better.  The LEDs are brighter and now include a red only option at the end of each session for eye health.  The move to USBC for charging was greatly needed.  Love the new app as well.  No messing around with connecting, it just works!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Strehle",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T19:33:37.000Z",
          "Titre": "Alex in customer service was great",
          "Contenu": "Alex in customer service was great! I ended up purchasing a replacement for my unit that broke and it’s a little different from my original but works great! It really helps me get my sleep schedule back on track! Love AYO!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thea Sabartinelli",
          "Nb_Reviews": 3,
          "Date": "2023-11-12T21:05:55.000Z",
          "Titre": "I had problems after purchase",
          "Contenu": "I had problems after purchase, but reached out over email. It took a few emails back and forth but all was fixed. The team is very helpful and responsive to feed back. They responded quickly and kindly even when I got frustrated."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Katherine Somers",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T10:56:59.000Z",
          "Titre": "Love my AYO glasses",
          "Contenu": "Love my AYO glasses. Wearing them has made a huge difference to my mood, sleep cycle and overall well-being. Two years into my purchase I had a small hiccup and contacted the company. Alex (Co-Founder and chief Commercial Officer) went above and beyond with the most amazing customer service I have ever received. A fabulous product and a company with integrity who truly care about service and quality products. Having my AYO glasses is a priority for me."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Hervé",
          "Nb_Reviews": 5,
          "Date": "2023-12-06T08:36:12.000Z",
          "Titre": "Very respectful and helpful people.",
          "Contenu": "Very respectful and helpful people.Quick service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AYOOOOOO",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T17:59:40.000Z",
          "Titre": "Sleek app",
          "Contenu": "Sleek app. Well-made and high-quality product. I got noticeable results in energy and mood improvement from the very first use!"
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Mr Healthy Johnny",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T13:50:36.000Z",
          "Titre": "A Promising Start to Better Sleep and Energy!",
          "Contenu": "I have been using AYO for over a month now and have just purchased the matching Circadian Health App last week. And I must say it has been a wonderful and positive experience for me!I can now wake up before alarm clock (Actually I don't need alarm clock anymore) and I have noted a boost in my energy level, especially in afternoons. It's great to see a product that actually delivers on its promises.For me I am especially excited about the Circadian Rhythm features, which are crucial for good sleep and health. It is refreshing to see a product taking a unique approach to this aspect of health. Very glad to note the scientific backing and collaborations, that make the whole experience feel more satisfying and secure.While AYO Circadian Health App is still in early access and has room for improvement(I want to see more options for customization of goals, notifications, etc.), the potential is undeniable!I can't wait to see how this product evolves. Highly recommended! 👍"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Hasan Tasdemir",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T21:08:58.000Z",
          "Titre": "Important part of my morning routine!",
          "Contenu": "Since I developed a winterdip I've searched remedies to get me through these wintermonths. Besides taking sufficient amounts of Vitamin D, and taking light therapies, the AYO is part of my morning routine. The moment I wake up and wash my face I put on the glasses and make myself a coffee and breakfast. When I'm done with my coffee and breakfast the glasses turn off by themselves and I'm ready for the day. It's a comfortable and easy to use product that is beneficial for a positive and good start of the day. Good support when you have questions too.Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Maria Cuijpers",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T10:29:17.000Z",
          "Titre": "De Ayo lite was binnen 5 maanden…",
          "Contenu": "1-6-2023I have been enormously pleased with the accurate and excellent service of goayocom. I had initially enjoyed the Ayolite for 4 month and understood when the frame broke, that I had an elder version of the glasses. After my contact with goayocom, I was sent the newest version of the glasses immediately and they kept in touch with me till the glasses were delivered at my address. The service is splendid and friendly. The glasses are very helpful indeed. I am very glad I am able to use them again. 15-4-2023De Ayo lite was binnen 5 maanden gebroken. Hierdoor kon hij niet meer aan en uit gezet worden. Tot nu toe wil de verkoper (titan-commerce.com, mindtecstore.com, ipnetshop.de) niet helpen met reparatie.Now in contact with Ayo support international. They promise replacement by new better version plus extra for inconvenience."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Erica",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T18:29:43.000Z",
          "Titre": "Perfect to kickstart you circadian rhythm",
          "Contenu": "Perfect to kickstart you circadian rhythm without getting in the way of your morning routine. Especially useful during the darker seasons when there is not much sun, or if you work from home and don't have time to go out for some natural circadian light. AYO app is a great complementary to the wearable as it allows you to gain more insights into your personal circadian rhythm, such as your chronotype, sleep debt, social jet lag, etc. I warmly recommend you get it together with the wearable."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Pavel",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T13:45:41.000Z",
          "Titre": "Radiant Wellness Must-Have!",
          "Contenu": "This product has revamped my well-being. It is both stylish and comfy, and it seamlessly blends into my day. The gentle blue light therapy is like a mood and energy makeover in minutes. If wellness is your goal, these glasses are a must-try!"
        },
        {
          "Note": 5,
          "Lieu": "ME",
          "Pseudo": "Johny",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T09:20:25.000Z",
          "Titre": "Nice energy-boost wearable",
          "Contenu": "AYO is a cool looking wearable that is very convenient and easy to use. I usually carry it with me to work and wear it in the office for 20 or 30 minutes. It makes me feel much more energized and focused. I sometimes wear it while commuting, as it takes me around 25 minutes to my work, so it matches with the 20 minutes AYO session nicely. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Sabo",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T15:46:16.000Z",
          "Titre": "Apple-like product!",
          "Contenu": "Out of the box the product feels like something from Apple!  The glasses work and feel great, I would highly recommend for anyone experiencing sleep issues especially during the winter and also especially when traveling to different time zones.  5 Stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Scheinfeld",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T12:55:45.000Z",
          "Titre": "Filled with appreciation ...",
          "Contenu": "I had a few questions about using the Ayo under various conditions. The support rep was prompt in responding (not always the case these days), answered all my questions completely (again, not always the case these days), and helped me in the ways I needed help. I love my Ayo device and sure do appreciate the fact that the Ayo team truly cares about their customers and the results they get from using the device. 👍 😀"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie F.",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T22:33:31.000Z",
          "Titre": "I have used the AYO light for years",
          "Contenu": "I was recently in the beta group to test the app for AYO. It was a great experience. I like the new features, and love the wearable light. I have been using the AYO light for years. I have problems with seasonal affective disorder and clinical depression. The light is part of a preventative life style to naturally treat these issues, and has worked wonders for me. I use the light everyday. It’s especially effective for me in the darker winter months. I would recommend to anyone who faces the same challenges with SAD."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Loreen Buss",
          "Nb_Reviews": 3,
          "Date": "2023-04-20T14:27:02.000Z",
          "Titre": "I’m thrilled with my AYO light glasses",
          "Contenu": "I’m thrilled with my AYO light glasses. They were super easy to order and arrived promptly!  I have been sleeping noticeably better since  I started wearing them in the morning. The app is fairly basic but I see a lot of potential with it. Overall, my dealings with AYO have been terrific!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Tsvetislav Georgiev",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T10:35:45.000Z",
          "Titre": "Ayo helps me during the dark months in Sweden",
          "Contenu": "I have been using Ayo for years and have been very happy with it.I have been living in Sweden where darkness is predominant during the winter months. Using Ayo in the mornings and late afternoons has been part of my coping mechanisms. Things I appreciate about Ayo:- slick design and a nice case that I use when traveling (people are always curious when they see me wearing the glasses in the plane :D) - the feeling of energy after use (be it placebo or real)- balances my circadian rhythm, waking up in the dark mornings without an alarm- easy to useImprovement points:- still using the old app, can imagine the new one is fixed: the app can be \"buggy\" sometimes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T19:26:14.000Z",
          "Titre": "As effective as 10,000 lux lamps",
          "Contenu": "I started suffering from the SAD when I was 23. Since then, I used several light therapy lamps, which had helped me a lot to easy up some of the SAD symptoms during the dark winter days. Six months ago, I bought AYO, and I must say, it is by far the best light therapy product for SAD I've ever used. It is light, very comfortable to wear, and gentle on your eyes. What I find most amazing, is the effect of the light, which is pretty much the same as that of 10,000 lux of a light therapy lamp. Warmly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Yolandi",
          "Nb_Reviews": 5,
          "Date": "2023-04-18T10:29:40.000Z",
          "Titre": "Sunshine in your pocket",
          "Contenu": "Last year December I decided to exhange my daylight lamp for an AYO. I wanted to be able to go about my day while getting my therapy.This was the best choice I could have possibly made. Not only was this the best winter I have had in the Netherlands since moving here from South Africa, but the customer service team is fantastic! See, at first I was dissapointed, because I bought an activation code for the Android app that was not ready. I mailed customer service and since then was proactively updated on the app by Alex. It is now all up and running.Alex and team I applaude you! Thank you for providing me with sunshine in my pocket and a smile on my face!"
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Pavel Kolev",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T16:26:25.000Z",
          "Titre": "A worthy product",
          "Contenu": "The support was great, the device is extremely easy to use and well thought in terms of user experience. I didn't expect the box where you keep the device to be so cool. At first I experienced no results but after a week of usage the results came and now I bring it on with me everywhere. I consider getting another pair so I can keep one at the office and one at home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Biochem PhD Graduate",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T04:10:05.000Z",
          "Titre": "Harvard scientist who had trouble with irregular sleep after moving to Boston",
          "Contenu": "I have relocated to the US from Europe and experienced non-continuous sleep. I found Ayo online and went for it. That was the best decision to improve my sleep. After using it a couple days, I am already noticing significant improvements. I can sleep until the morning and feel much more energetic. I highly recommend Ayo to anyone experiencing irregular sleep patterns because it will help you!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sandra",
          "Nb_Reviews": 1,
          "Date": "2021-09-20T10:01:48.000Z",
          "Titre": "Great product & customer experience!",
          "Contenu": "I had and continue to have a great experience with GoAyo. I am very happy with the product, which works as described, and gets me through the long and dark winters. The one time I had an issue, the customer support team responded immediately and sent me a brand new replacement - free of charge. Definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 6,
          "Date": "2023-12-08T15:19:11.000Z",
          "Titre": "This product really works",
          "Contenu": "This product really works. I have been using it for years for SAD."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Jeroen Dekker",
          "Nb_Reviews": 3,
          "Date": "2023-01-11T15:31:33.000Z",
          "Titre": "Very satisfied with my Ayo",
          "Contenu": "Very satisfied with my Ayo. I work shifts and it helps me with the time changes. When I work the early shift I put it on when I get up and I’m energetic going to work. I also wear them when I come home and feel more energetic again for the evening. When I work late or night, I wear it before going to work and feel more energetic while working. I also had some questions which were answered fast and satisfying by costumer support. Great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MIGUEL",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:15:53.000Z",
          "Titre": "Product is intuitive to use and works…",
          "Contenu": "Product is intuitive to use and works as expected. Customer service is second to none."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Maye",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T17:47:23.000Z",
          "Titre": "AYO makes bright light therapy work for me!",
          "Contenu": "AYO wearable bright light therapy glasses are the best! I notice the benefits of bright light therapy within 1 day of beginning use. I fall asleep easier, sleep more soundly, wake up easier, and have more energy during the day. It also seems to make my mood more resilient. Bright light therapy has always been challenging for me to implement in my daily routine because I don’t spend time sitting in one place. By making a wearable, AYO has made it simple and easy for me to do. And the positioning of the light just above my eyes seems like it’s more efficient and consistent than just sitting near a light. Plus it doesn’t feel too bright and make my eyes feel overstimulated. This is my second AYO wearable. The new model has a few updates that make it even better than the first! Starting a session is as simple as opening the glasses and wearing them for 20 minutes. That simplicity has made it even easier for me to get into a routine of doing the therapy every morning and any other time I could use a boost. Well done, AYO!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sonja D",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T22:12:38.000Z",
          "Titre": "I really loved my product sadly a piece…",
          "Contenu": "I really loved my product sadly a piece of the plastic broke off from it sometime in the summer and it became inoperable. We were unable to locate my order information. However they were very flexible about that and replaced it anyway!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Vladislav Fedulov",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T13:47:56.000Z",
          "Titre": "Good product for a busy work-life balance",
          "Contenu": "I got recommended blue light therapy by a friend of mine, after I was struggling with sleep and grogginess for a while.They have been working really well for me over the last weeks and significantly improved my sleep tracking parameters and productivity at times when my energy levels seem to be fading away. I do like wearing them in the morning, while still getting ready for work and have some downtime for myself. They seem to help me get in optimal mood and state before my busy schedule for the day starts. The glasses stay and feel comfortable when wearing them (you can easily adjust the nose piece), something that was particular important for me when choosing what product to buy.The app is nicely done and I like that I am able to choose specific routines to follow, as well as have reminders for light exposure (something I did not get enough of previously while being in the office).Also, had to reach out to their customer support about some questions around the app. They were very responsive and were immediately able to help out."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Aaron",
          "Nb_Reviews": 10,
          "Date": "2023-12-02T16:19:36.000Z",
          "Titre": "Fast and prompt response to my queries."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Jackie",
          "Nb_Reviews": 3,
          "Date": "2023-01-30T16:41:55.000Z",
          "Titre": "So far, it’s been great!",
          "Contenu": "I’ve had my Ayo wearable for several months now and that’s been the winter I have felt at my best best, both mentally, and physically. I dread winters due to the short days and lack of sunlight and, therefore, I tend to feel low on energy and mood. After listening to many of Andrew Huberman’s episodes, I became so fascinated with health optimization. I learned that light, alongside sleep, nutrition and exercise, is fundamental to overall health and performance. Since then, I have been very conscious and experimenting with all kinds of products. I am using different trackers (e.g. Oura) and have seen the positive impact Ayo has had on my sleep and performance during the past months. I am also enjoying the app, which is beautiful although a bit limited at the moment. The team assured me that new features are coming soon, Apple Health integration is the one I am particularly interested in. Subjectively, I am also feeling much sharper, more alert and in better mood than previous winters. I have recommended this device to all of my health-conscious friends already and look forward to utilizing it more in the months to come."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 6,
          "Date": "2023-03-24T16:06:04.000Z",
          "Titre": "Best treatment for Seasonal Affective Disorder",
          "Contenu": "I have used the Ayo glasses for many years and have 4 pairs! They are so effective for the treatment of seasonal affective disorder! I have referred this product to many friends, family, and colleagues!!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "klant",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T11:25:13.000Z",
          "Titre": "Very good support & the glasses are a life saver with 2 kids;)",
          "Contenu": "Very good support and customer service! And the glasses are great, i wear it everyday and it is allmost a life saver;) with a newborn and a toddler! The glasses are very easy to use and you can just do other things in the morning while wearing it. I really feel a difference when not using it! I really recommend AYO!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-01-09T13:27:11.000Z",
          "Titre": "Good support, product works",
          "Contenu": "Timely delivery, and customer support gave me a discount I forgot to apply as well as answering a question about when the Android app will be available (by February 2023, they said). The glasses work as promised for keeping my circadian rhythm in line with my preferred times to start and end the day."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rvo",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T12:04:48.000Z",
          "Titre": "More effective than I imagined it could be!",
          "Contenu": "Faster than expected delivery. Surprised by how effective the product is at improving my sleep."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annelise",
          "Nb_Reviews": 7,
          "Date": "2023-06-14T12:57:24.000Z",
          "Titre": "This company goes over and beyond for…",
          "Contenu": "This company goes over and beyond for customers and the product is saving me from a major jet lag experience abroad. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kiyanna Macey",
          "Nb_Reviews": 3,
          "Date": "2023-02-10T04:06:40.000Z",
          "Titre": "Life Changing",
          "Contenu": "After using AYO for 2+ weeks now, I can say with 100% confidence that they work wonders for me! My sleep quality and energy levels are on a whole new level, and not sure how to fully describe this but I feel healthier. I’ve been an night owl my whole life and waking up early in the morning was a major pain, especially during the winter time. Moreover, as I am working from home, I could not get myself to follow a good morning routine (…snoozing the Alarm clock 3-4 times was normal for me) Since COVID-19 hit I have tried to work more on my health and sleep, especially reading up on best practices and trying them out. Eventually i stumbled up on Huberman (HubermanLab podcast) and realized how important it is to get 20-30 minutes of morning sunshine into your eyes within 1-1.5 hours after waking up to maintain a healthy circadian rhythm. I try to get as much sunlight every morning but during the winter this is almost impossible, so thats when these glasses came to my rescue. I use AYO whenever I am unable to get the much-needed circadian light from the sun in the morning, which is most days in winter. For me, these glasses are life changing, as I am finally able to maintain a correct circadian rhythm, good quality sleep and high energy during winter days. Thanks to AYO I believe this winter will be the first one in many in which I won’t experience SAD and winter blues. Could not recommend them more!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jared Lehmann",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T18:34:40.000Z",
          "Titre": "Great support and the product is top…",
          "Contenu": "Great support and the product is top notch. They replaced my broken glasses quickly and the AYO are better designed than Luminette."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DONNA SAUNDERS",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T15:50:01.000Z",
          "Titre": "What a wonderful company",
          "Contenu": "What a wonderful company!  They are fast and friendly and gave me a whopping 50% off on a new AYO..Thanks a million.Donna"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DONNA SAUNDERS",
          "Nb_Reviews": 3,
          "Date": "2023-09-28T18:52:07.000Z",
          "Titre": "This is such a wonderful company",
          "Contenu": "This is such a wonderful company.  They are fast and friendly and gave me 50% off on a new AYO..how great they are!  Donna Saunders"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Elias Frank",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T12:24:30.000Z",
          "Titre": "I could not have wished for better supprot",
          "Contenu": "I just wanted to quickly share the experience that I had with the AYO customer service. Spoiler: it was the best experience I ever had, with any customer service.I wrote them a message some weeks ago, that time in desperate need for help. A few days earlier, I tried on the AYO glasses from a friend. At that time there were also other friends around and after wearing them for a while, I casually put them back on the table.The next day, though, the friend came to me, telling me, that she had found her glasses broken the other day. I was shocked. I was sure, that I did nor break them, while wearing and also not while putting them back on the table. But unfortunately, it was undeniable, that her glasses were broken. As I was the last one, who had used them, I had to take the responsibility. And so I tried to fix them. But no phone repair store, nor any optician could/wanted to help me.So I reached out to the AYO service. I explained them my situation and asked them for help. And long story short, after showing them a proof of purchase, they told me that they will send my friend a new (even updated) pair, for free!! Even though the glasses were out of warranty.I'm truly amazed and very grateful for AYO's generosity.As I wrote in the beginning, this was the best experience that I ever had, with a customer service. Thank you again AYO Team!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Robert Oslie",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T19:37:50.000Z",
          "Titre": "Excellent",
          "Contenu": "Great product and excellent fast customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "michael sandy",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T13:15:44.000Z",
          "Titre": "lots of tech product support from co…",
          "Contenu": "lots of tech product support from co owner of co.love new unit improvements"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M Herrero",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T21:09:26.000Z",
          "Titre": "Great service",
          "Contenu": "Our first Ayo worked great until one of the temples broke. However, Ayo sent us a new pair free of charge. The new one works just as well."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Hristo Iglev",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T13:10:25.000Z",
          "Titre": "This is an excellent company with…",
          "Contenu": "This is an excellent company with excellent service! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LD",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T17:16:45.000Z",
          "Titre": "Great company",
          "Contenu": "Great company. Good customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karine hrechdakian",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T17:57:05.000Z",
          "Titre": "Quick and helpful responses"
        }
      ]
    }
  ]
}