{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "goroostr.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary McGhee",
          "Nb_Reviews": 2,
          "Date": "2022-11-03T16:52:49.000Z",
          "Titre": "This sure felt like bait and switch to me",
          "Contenu": "GoRoostr made a good offer for my MacBook Pro, and they got great reviews here.  So when I got ready to sell it, I chose them over all the other companies I'd looked at.When they received my MacBook, they emailed me that they'd found some serious problems with it:  the touchbar and camera didn't work.  Those had been working fine, at least until I reformatted the hard drive the night before I shipped it to them.  I Googled and found some quick and easy software fixes that were recommended for both issues--change a setting, reset the SMC and the NVRAM, etc.  I forwarded them those links.GoRooster replied that they'd tried all that, nothing had worked, and now the computer was overheating (another new problem I'd never had with it).  They said they suspected problems with the logic board.  They told me they'd still buy it, but they dropped their offer by 60%.  I told them, never mind, just send it back to me.It took me less than an hour to get the touchbar and camera working, by resetting the NVRAM--a simple trick, and one of the suggestions I'd sent them.  The computer wasn't overheating--not even close (it’s my lap it was sitting on, so I think I would’ve noticed).  It was working fine, no problems that I could find.GoRoostr also sent the MacBook back to me with a login password that it didn't have when I shipped it to them.  I had to reformat the drive and reload the OS--again--before I could do anything with it.And when I'd originally shipped my MacBook to GoRoostr, I spent $20 on a heavy-duty laptop shipping box with a special foam insert to designed to protect it.  They sent it back to me in a different box, used, thinner and flimsier than the one I'd used, and padded with wads of paper that probably cost them 10 cents.  I had to go out and buy more packing materials before I could ship it to another company who wanted to buy it.And that second company I sent it to?  They found nothing wrong with my MacBook, and promptly paid me the full amount they'd offered (considerably more than GoRoostr's last offer)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "L X",
          "Nb_Reviews": 1,
          "Date": "2020-02-29T05:19:58.000Z",
          "Titre": "Bait and switch",
          "Contenu": "Bait and switch. Offered me a special upgrade after I sent them photos of my pristine hardly used macbook pro. The sent me a list of issues and over $100 less. I was in a $$$ pinch and needed to take the deal. I will sell on my own next time and make 2-3 hundred more."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Ber",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T20:26:30.000Z",
          "Titre": "Selling my old broken MacBook was a…",
          "Contenu": "Selling my old broken MacBook was a smooth process! Only took off one star because of the expensive packaging FedEx required me to use for shipping which took off about 30% of what I earned from the sale."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabbie Cappiello",
          "Nb_Reviews": 1,
          "Date": "2020-05-20T15:36:57.000Z",
          "Titre": "Easy selling",
          "Contenu": "Would recommend this company for selling Mac products. Only complaint is shipping isn’t super speedy. Other than that, very satisfied with my experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T17:08:58.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, I had to hunt for the right box to ship my laptop though, would be nice to get a suggestion for that.  Other than that great!"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "conor",
          "Nb_Reviews": 10,
          "Date": "2018-12-28T13:04:32.000Z",
          "Titre": "best experience all over i sold my…",
          "Contenu": "best experience all over i sold my laptop and got the best price than market was really hassle free and easy, thumbs up to them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mwoods",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T20:26:46.000Z",
          "Titre": "service was great only downfall would…",
          "Contenu": "service was great only downfall would be having to use fedex to ship"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc Escapa Riera",
          "Nb_Reviews": 1,
          "Date": "2015-05-16T16:58:30.000Z",
          "Titre": "Great service, I'm sure it'll get even better over time",
          "Contenu": "I was very satisfied with the process. I would only improve 1 step: You say that we should package the laptop with bubble wrapping, which sounds like a painful process. However, when I got to FedEx, they told me they could only send laptops with their laptop-shipping box at $16. Luckily I hadn't bought any specific box or bubble wrapping, otherwise I would have had to throw it away. If you make your messaging about the wrapping clearer, it can be a smoother experience for future customers.\r Thanks GoRoostr!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin Klein",
          "Nb_Reviews": 1,
          "Date": "2015-07-29T14:33:51.231Z",
          "Titre": "Pretty easy",
          "Contenu": "They were upfront with the costs and how much they would pay. Received they check 4 days after delivery which is really fast. I would use them again. They do not offer as much as other sites but this was almost no hassle. My only con is how they handle shipping. Unlike other services that provide packing material, you are responsible for getting it there in one piece. So when hey quote you, factor in 15 bucks that you will need to spend out of pocket for the packing. I would of rather just gotten less money and got the packing material from them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy8",
          "Nb_Reviews": 1,
          "Date": "2014-06-23T18:45:37.000Z",
          "Titre": "Very fast and true quote",
          "Contenu": "Everything worked out great with GoRoostr.  My only recommendation would be to not use Paypal because GoRoostr does not pay the $15 processing fee with PayPal, that comes out of your money.  I would suggest waiting for a check if you want your full quote."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DF **",
          "Nb_Reviews": 1,
          "Date": "2014-06-14T18:46:49.000Z",
          "Titre": "Does what it says",
          "Contenu": "The whole process went exactly according to plan and the payout was fair.\r Label printing process was a little bit confusing and had to drop $15 on a laptop shipping box at the FedEx store, but this was only a minor hassle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexander Soifer",
          "Nb_Reviews": 2,
          "Date": "2016-06-07T19:55:52.000Z",
          "Titre": "very smooth experience, price could be higher",
          "Contenu": "my experience as extremely smooth.  received payment in the expected timeline for my laptop.  the fees could be higher but the company needs to make a profit and takes the hassle out of craig listing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Macee Kensinger",
          "Nb_Reviews": 1,
          "Date": "2015-02-12T19:11:48.000Z",
          "Titre": "Quick and easy",
          "Contenu": "I got a great price for my computer that was completely fried and useless to me, I got the quote, shipped it the next day, and my check arrived within the week. overall very pleased. :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bee C",
          "Nb_Reviews": 1,
          "Date": "2014-05-24T14:03:55.000Z",
          "Titre": "Quote price dropped $10 in just one day, otherwise painless.",
          "Contenu": "Process is easy. Quick way to sell your Mac. The check I received was for my original quote price. From quote, to clean, to package, ship, and deposit-- about 7 day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Johnny",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T19:38:39.000Z",
          "Titre": "Great place to sell old electronics!",
          "Contenu": "Easy to send in and easy to work with!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard K.",
          "Nb_Reviews": 1,
          "Date": "2014-09-29T21:47:58.000Z",
          "Titre": "Pleasant Experience--very quickly responded, very speedy turn around.",
          "Contenu": "Pleasant Experience--very quickly responded, very speedy turn around, pleasant to work with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "corrie morjica",
          "Nb_Reviews": 1,
          "Date": "2014-09-04T17:26:51.000Z",
          "Titre": "zippity zop puddin pop",
          "Contenu": "Would recommend. Such money. Wow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael garcia",
          "Nb_Reviews": 2,
          "Date": "2017-02-07T23:14:58.000Z",
          "Titre": "5 star",
          "Contenu": "very professional company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan G.",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:46:38.000Z",
          "Titre": "A+++++ Electronics Buyers!!",
          "Contenu": "Fantastic experience and great trade-in value.  Lightning fast payment.  The guys at GoRoostr were super quick in reviewing my MacBook and getting my payment out.  No himmicks, no heartburn.  Straight forward.  Loved the experience, thanks guys! A+++++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:09:11.000Z",
          "Titre": "best price and experience",
          "Contenu": "i looked at a lot of sites that buy your old phone and this one offered the best price. the whole experience was quick, easy, seamless, and exactly as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:47:29.000Z",
          "Titre": "Very easy transaction",
          "Contenu": "Very easy transaction, no issues and the best pay out compared to MANY other sites. Much needed for the holidays, thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J.S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:42:19.000Z",
          "Titre": "I'll be using this company's services again.",
          "Contenu": "The process was very simple It went exactly how they said it would go. I sent in my old mac and I got paid within a business day of the device arriving. Easy. I'll be using this company's services again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T01:42:46.000Z",
          "Titre": "Quick & easy process",
          "Contenu": "This was a quick and easy process! I was very happy to get something for my 7-year-old laptop that suddenly stopped working. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa D",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:41:43.000Z",
          "Titre": "Would Recommend",
          "Contenu": "Easy process with no funny business. Money received as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley N.",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T02:55:07.000Z",
          "Titre": "Thanks for buying my old computer",
          "Contenu": "Thanks for taking my old labtop!!! I can’t believe how easy it was. All I had to do was fill out my info online, print the shipping label, drop off at fedex, then I got paid via zelle in 2 business days. I’m definitely impressed by the quick and efficient service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T20:23:39.000Z",
          "Titre": "Very simple",
          "Contenu": "Very simple. Received a email when computer was received on a Thursday afternoon, money was sent the following day. Seamless process!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:30:02.000Z",
          "Titre": "They are an easy way to sell electronic…",
          "Contenu": "They are an easy way to sell electronic devices.  The whole process was simply and they are very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T17:17:31.000Z",
          "Titre": "I'm Impressed",
          "Contenu": "Another company offered a higher price for my old phone, but claimed after receiving it that it was scratched, and significantly reduced the offer price. I had it shipped back, then went to GoRoostr.The process was simple and fast, and I had the promised price paid to me promptly. I would definitely use the company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "I Z",
          "Nb_Reviews": 5,
          "Date": "2023-12-01T07:08:16.000Z",
          "Titre": "Awesome Company for selling Your Apple…",
          "Contenu": "Awesome Company for selling Your Apple Products to, whether they are new or used. GoRoostr is a great company to do business with. They pay extremely fast and they are very reliable. They paid me the same day, that they received my MacBook Pro. I can’t recommend GoRoostr enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:13:28.000Z",
          "Titre": "It was great and easy process",
          "Contenu": "It was great and easy process. Only thing is I wish they would have offered more for the laptop. But it’s ok. I wasn’t going to fix it and it was taking up space."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T20:28:52.000Z",
          "Titre": "Fast and sufficient service",
          "Contenu": "I must say I was skeptical but NOW I’m a believer lol. Great service and communication. I had no problems getting my laptop to them and once it was received they let me know immediately. I got turned away from several pawn shops for my 2018 mackbook because it was too old but Goroostr quoted me a great price and delivered. I highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amadeus",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:39:51.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Easy, fast and everything went as in the description. I had a very good experience with GoRooster"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T04:19:31.000Z",
          "Titre": "Quick service and followed through on…",
          "Contenu": "Quick service and followed through on amount promised. Very satisfied! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allyson Shick",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T05:56:50.000Z",
          "Titre": "Highly Recommend!",
          "Contenu": "So incredibly easy to answer a few simple questions, pack up my device, ship it off, and within a week, money in my bank! Amazing experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID C",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T18:24:39.000Z",
          "Titre": "Fair offer processed quickly",
          "Contenu": "Made a fair offer, send shipping label (via email), and processed transaction VERY quickly upon receiving my laptop (2019 MacBook Air). Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:13:45.000Z",
          "Titre": "Very quick on responding to questions…",
          "Contenu": "Very quick on responding to questions and quick payment. I would definitely use them again and recommend them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "keyla vega",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T20:08:13.000Z",
          "Titre": "smooth sailing throughout!",
          "Contenu": "I received my money even though I had not set up my email through zelle. Everything went smooth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Carbaugh",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T21:04:08.000Z",
          "Titre": "Excellent Reaource",
          "Contenu": "Such an easy resource to use. Fair valuation and easy return process. Legitimate business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Very Satisfied Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T17:38:43.000Z",
          "Titre": "Quick and painless!",
          "Contenu": "The process was easy, transparent and extremely quick. They let me know when they received the item and also when to expect payment. It was even faster than expected. Payments are more than fair. Great service and will 100% use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl Py",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T19:33:45.000Z",
          "Titre": "I was concerned……………",
          "Contenu": "I was concerned because I had never heard of them versus the big online buyers of Mac products. However, they surprise me with their fair offer and quick processing. I wouldn’t hesitate to use them again. thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T18:56:32.000Z",
          "Titre": "Easy process",
          "Contenu": "Easy process, competitive trade in value for old Macs, fast payment!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T18:52:52.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service, and quick payment. The best price I've received as well! I accidentally sent in a return package and they helped me send it to the right place."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon R",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:48:02.000Z",
          "Titre": "GoRoostr is Awesome",
          "Contenu": "GoRoostr was a great choice to sell my MacBook Air to. They gave me a very fair amount and made it an easy, fast exchange! Communication was excellent as well. Thank you !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T16:57:51.000Z",
          "Titre": "I had a fantastic experience",
          "Contenu": "I had a fantastic experience! My daughter accidently spilled water into the keyboard on her new Macbook Air. Went to Apple and there was nothing they could do.  I found GoRoostr online thinking someone would buy it for parts. They gave me a quote online after answering a few simple questions. I shipped it to them on Monday (they provided the shipping label), they received it on Wednesday and they Venmo the money on Thursday. Everything was fast and easy.  I highly recommend them!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T23:25:06.000Z",
          "Titre": "Seamless experience!",
          "Contenu": "Seamless experience from the online quote to getting paid. They offered the best price on my used MacBook Air and promptly paid the quoted price. Definitely recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Morgan Flores",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T18:58:43.000Z",
          "Titre": "First time using GoRoostr",
          "Contenu": "First time using GoRoostr - sent in my 2018 MacBook that would not fully start up anymore (including original charger) and was updated on the process every step of the way. Shipping label was provided as well which made it even easier for me. I actually received the full quoted payment amount within a day of them receiving my laptop. Very impressed, thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erika",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T17:22:45.000Z",
          "Titre": "EASY AND RELIABLE !",
          "Contenu": "At first I was just looking for somewhere to sell my Macbook. Took a chance on this company after seeing a few reviews. They seriously had the biggest offer I received ANYWHERE (fr I went to like all the pawn shops,FB, you name it). Form is easy to fill out for a quote and they pay for your shipping if you decide to sell. Took 3 or so days to get to them but they sent payment literally the next morning after they received it for the full quoted amount. sent emails through the the process too. Got my payment through zelle but they offered through pay pal, venmo and check too I think!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:15:12.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Fast and smooth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T17:16:47.000Z",
          "Titre": "After getting a new MacBook Pro",
          "Contenu": "After getting a new MacBook Pro, I wanted to sell my old one. I found GoRoostr in a Google search and decided to give them a try. I was nervous but GoRoostr proved to be a great company. I had emails at every step of the process and always knew what was happening. Payment hit my account as described and I'm looking forward to doing business with GoRoostr in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sudeep Unnikrishnan",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T07:20:55.000Z",
          "Titre": "GoRoostr rocks as always!",
          "Contenu": "I've used GoRoostr multiple times in the past and have always had a fantastic experience with them. The level of professionalism is evident right when you first start a quote. From clear, concise instructions, to extremely prompt acknowledgement of receipt and disbursement of funds, this experience is SO MUCH BETTER than Apple's own trade in programs.Thank you guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kayla Black",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T17:47:41.000Z",
          "Titre": "BEAUTIFUL EXPERIENCE",
          "Contenu": "Wonderful experience. Easy quoting process. I shopped around and they definitely give you the most for your products at GoRoostr. They were super communicative during the whole process, had an easy shipping process and let me know when they received the device personally. They sent me the money just as promised very quickly after processing my device. Very trustworthy! Very satisfied and highly recommend!!!!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Kelli the Traveler",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T20:07:43.000Z",
          "Titre": "Straight Forward and Fast!",
          "Contenu": "From the quote to the payment, this was an excellent experience! Quote was accurate (use the serial #), pre-paid shipping label included, and such a fast turn around. I received emails in each step (\"We received your item\", \"We are processing your item\", etc) and got my payment via Venmo within 2 days of them receiving the item. Not to mention the best price around - Best Buy and even local repair guys wouldn't offer what I felt the item was worth, and GoRoostr proved me right! Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T17:29:12.000Z",
          "Titre": "Legit experience!!!",
          "Contenu": "At first I was sceptical of using them. I saw a lot of reviews speak pretty positive of their experience, so I figured why not try. I have to say wow they did a fantastic job. They do a good job communicating with you and ensuring you get your payment. I received payment very quickly to. I would definitely recommend using them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T19:37:27.000Z",
          "Titre": "Rapid processing and payment",
          "Contenu": "Quoting online is easy and packaging instructions are clear. Dropping off at Fedex sites is convenient. Only took a few days to receive quoted price via Venmo. A much better deal than giving it back to Apple :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jax",
          "Nb_Reviews": 3,
          "Date": "2023-09-08T14:55:13.000Z",
          "Titre": "Quick painless procedure ..was paid…",
          "Contenu": "Quick painless procedure ..was paid what I was quoted which was more than Apple was going to give me. Computer received yesterday, payment issues this morning by 830a"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Jones",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T18:33:24.000Z",
          "Titre": "I received a very fair offer",
          "Contenu": "I received a very fair offer. The process was very easy, and I got payed very quickly. I had an A+ experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken K",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T16:21:15.000Z",
          "Titre": "This was about as perfect…",
          "Contenu": "This was about as perfect an experience as I could have asked for. In just over a week after starting the process, I had a check in-hand for my old iPhone for the amount originally quoted. I got updates from GoRoostr along the way, letting me know what was happening, next steps, etc. Definitely recommend! Thanks guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 4,
          "Date": "2023-03-08T01:18:59.000Z",
          "Titre": "GoRoostr made everything super easy",
          "Contenu": "GoRoostr made the whole experience of selling my old MacBook Pro super easy. I really appreciated being able to get an accurate quote based on the unit's serial number. The pricing was fair, a shipping label was promptly sent, and payment was within a day after it was received. Great company to work with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A. Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T23:59:32.000Z",
          "Titre": "Awesome SERVICE",
          "Contenu": "At first I wasn’t too sure if I did the right thing by mailing my expensive MacBook to a company I had no verbal communication with.  But as soon as I mailed it I called and spoke to someone who confirmed that once the computer is received they would contact me.  The communication was superb.  They even honored my request with no questions asked. They definitely exceeded my expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patty C",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T21:16:42.000Z",
          "Titre": "Found Go Rooster online",
          "Contenu": "Found Go Rooster online.   Printed the shipping label, packed up my computer and dropped it off at FedEx.   Received my Venmo payment today.   Easy peasy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROGER BERG",
          "Nb_Reviews": 5,
          "Date": "2019-04-17T16:40:26.000Z",
          "Titre": "GoRoostr is the BEST buyer of used Macs !",
          "Contenu": "GoRoostr is the BEST buyer of used Mac product !  Don't even waste your time looking at anyone else thru Google search.  GoRoostr.com is a wonderfully simple web site.  The quote, shipping, and rapid payment process easy as advertised.  Their great supportive communication is indicative of a SUPERB business.  Go see for yourself... GoRoostr will EXCEED your expectations.  Highly recommended !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jordan",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T21:30:27.000Z",
          "Titre": "Great first time experiment",
          "Contenu": "I was skeptical at first. But did some research and found reviews here and on the BBBs website. I spoke to Jon and Steve and both were very professional and informational. They communicate as soon as your phone a mage arrives and you receive payment the second it’s finished being processed. Will definitely come back again in the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JTB",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T19:26:36.000Z",
          "Titre": "Awesome all the way around",
          "Contenu": "Awesome all the way around. Transaction was seamless. They answered any questions I had. I was notified immediately when they received my product and payment transaction was quick. 5 Star operation! All the way around! I would highly recommend and I will be using again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sidh",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T19:25:59.000Z",
          "Titre": "I’ve been a repeat customer for a…",
          "Contenu": "I’ve been a repeat customer for a reason. There are many sites or places where similar services are offered but none are as fast, responsive and caring.. trust me I’ve been around the block. Just don’t change please.. do as you do (even if lesser than others) but customer service is a must where this place excels. Thanks again. See you soon"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T15:11:35.000Z",
          "Titre": "GoRoostr provided really clear communication",
          "Contenu": "GoRoostr provided really clear instructions prior to shipping my computer. They also provided prompt communication when they received the item and when they finished processing the item. In all, I had money in had in less than a week!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T17:14:07.000Z",
          "Titre": "Great company",
          "Contenu": "This was easily the best experience I’ve ever had trading in a device. The quote was accurate and I received payment within 24 hours of the package arriving at their facility. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel P",
          "Nb_Reviews": 2,
          "Date": "2022-12-29T02:33:05.000Z",
          "Titre": "Trustworthy and Dependable",
          "Contenu": "I’m happy to write this review :) I researched and talked to about 5 different companies to sell my laptops too. I had 8 of them to sell. The number 1 thing I was looking for was trustworthiness. I wanted to make sure I found a legit company that would give me a horror story that I read about people’s experiences with other companies. Not only did I actually get the money I was quoted, it was a streamlined pleasant experience. Stop reading other reviews and just trust me that I’ve done the research and had a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T04:03:01.000Z",
          "Titre": "Quickly Paid Me What They Said They Would",
          "Contenu": "I sent in a functioning, fair condition 2015 Macbook Pro that had a very swollen battery. GoRoostr said they'd give me $109 for it when most places were offering around $70 or $0 for it. They sent me a prepaid shipping label, processed the laptop within a day of receiving it, and quickly sent me my money to my PayPal account. I was a little hesitant to use this service at first but I believe they are trustworthy and after this positive experience I would use them again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T18:30:12.000Z",
          "Titre": "Accurate, honest, quick process!",
          "Contenu": "Easy process to sell my computer, quote was honored as expected. No hassle and quick turnaround with a deposit directly to my PayPal. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Williams",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T17:11:57.000Z",
          "Titre": "As Advertised",
          "Contenu": "Literally everything went smoothly and the directions for sending my device were super easy to understand. After that, all that was promised was delivered. Couldn’t be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katharine Parker",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T21:25:42.000Z",
          "Titre": "Super easy!",
          "Contenu": "I had a MacBook that didn't fully work anymore and did some research on who might buy it and found GoRoostr! Filling out the form online was super easy and the whole process, from printing out the shipping label and shipping it out to working with the team to process my computer and receiving the payment, could not have been more simple. Will definitely be using this service with future devices!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "I Z",
          "Nb_Reviews": 5,
          "Date": "2023-05-12T05:42:02.000Z",
          "Titre": "Great Company with lots of 5 star…",
          "Contenu": "Great Company with lots of 5 star reviews. I sold them my MacBook Pro, they paid me really quickly, the price that they quoted me. Hassle free process and they pick up the phone quickly when I called them and responded to my email quickly. Pleasure to do business with GoRoostr. I highly recommend them to anyone looking to sell anything Apple related. They definitely have a future Customer out of me. I was going to sell my MacBook Pro to another company but I’m very happy that I sold it to GoRoostr."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JasonD",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T16:40:26.000Z",
          "Titre": "Streamlined and Simple Sale of Laptop",
          "Contenu": "The instructions were clear and I received my money as quoted within 2 business days after my laptop was received.  I also received very helpful email updates along the way.  Very wonderful customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie T",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T20:59:21.000Z",
          "Titre": "I am super happy with my experience…",
          "Contenu": "I am super happy with my experience with GoRoostr.  They let me know that they received my laptop and the next day issued me the total amount of the quote that was issued when I submitted my request.  The followup, ease, and quick turnaround was fantastic.  I also got much more than I would have going through Gazelle.  10/10!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel R.",
          "Nb_Reviews": 2,
          "Date": "2023-05-11T19:38:02.000Z",
          "Titre": "Very fast processing time",
          "Contenu": "Very fast processing time. Paid quickly through Venmo and paid the exact price they quoted. The experience was more than satisfactory and would definitely sell more items in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristi",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T04:20:16.000Z",
          "Titre": "One day the motherboard and battery…",
          "Contenu": "One day the motherboard and battery failed on my 2016 Apple Mac Book Pro 15\".  Apple gave me the estimate to fix it and it was half of what it would cost to buy a new laptop.  Instead of recycling the laptop at Apple I found GoRoostr from a Google search.  I entered in all my laptop information and was told I would receive $161.  After filling in all the laptop information; I received an email with a prepaid FedEx packing label.  I  packed up the laptop with bubble wrap and a few days later I received an email asking to confirm my phone number is linked to my venmo.  Once I confirmed my cell is linked to my venmo account; I received the payment for exactly $161.  This process was easy and receiving $161 is better than giving it to Apple to recycle.  Definitely a good experience and I highly recommend people to do the same with their non-working laptop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T01:17:04.000Z",
          "Titre": "Easy Money!",
          "Contenu": "Got exactly what I was quoted!Very fast and efficient!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "joe",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T17:52:24.000Z",
          "Titre": "great experience for first time user",
          "Contenu": "great experience first time using GoRoostr, though i have used other similar sites many times. straightforward fast and easy, offered the highest price for my mac amongst a few other competitions, and i got updates every step of the way from when it got dropped off, to received, to evaluated, and sent the full payment within two days of receipt : )"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryon",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T20:08:01.000Z",
          "Titre": "Fast payment and great customer service!",
          "Contenu": "Received my payment the next business day just as they said! Sent my MacBook Pro in with the device in the same condition as I said it was. I got my full offer. I spoke with Steve, the manager when I called before I sent the computer in. I was skeptical and not sure if it was a scam when I called I spoke with Steve and he made me a shirt and made me feel comfortable. 5 out of 5 ⭐️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jane Bash",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T19:19:41.000Z",
          "Titre": "Highly Recommend! Best way to sell your Apple products",
          "Contenu": "It was my first time using the service. I sold two MacBooks and the experience was super smooth. I especially love the communication from the team every step of the way. It offered me peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T20:45:11.000Z",
          "Titre": "Seamless experience",
          "Contenu": "Sold my Macbook Pro after they quoted me a good price to buy it. Very easy process and they even provided a shipping label. Processing was fast and only took a day once they received it. Got my money that same day via Zelle. Seamless experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert S.",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T05:10:34.000Z",
          "Titre": "You did everything you said you would…",
          "Contenu": "You did everything you said you would send me a ticket to send the tablet to you. ya'll check it out see if it passes and then put $105 in my PayPal account. Your service was absolutely best I ever had to do business with anyone. Just like clockwork.Thank you for your service.Robert Snelling"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T17:16:56.000Z",
          "Titre": "Super easy and FAST",
          "Contenu": "Super easy and FAST. I emailed about a promo code and got a response almost immediately."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Waldenberger",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T21:25:50.000Z",
          "Titre": "Received email right away once received…",
          "Contenu": "Received email right away once received was paid next day fantastic service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T22:21:54.000Z",
          "Titre": "Great job",
          "Contenu": "Fast efficient way to sell Apple products . Way to go . Definitely will be back"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miriam C.",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T23:04:31.000Z",
          "Titre": "Excellent and trustworthy",
          "Contenu": "Excellent and trustworthy. They were quick and paid me my quoted price. I’ve tried Phobio before and it was a nightmare/borderline scam. I’ll definitely be sticking with GoRoostr in the future. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sunny",
          "Nb_Reviews": 2,
          "Date": "2020-05-27T16:57:18.000Z",
          "Titre": "While I was sad to see my MacBook Pro…",
          "Contenu": "While I was sad to see my MacBook Pro go so early, it just was not worth the estimated $500.00 minimum quoted by Apple and Geek Squad when it failed to turn on. I searched a few places I could turn it in and GoRoostr had the best payout. They also had quick answers and great service. I highly recommend GoRosstr should you be in the position that I found myself in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roy Marden",
          "Nb_Reviews": 5,
          "Date": "2023-09-27T17:24:13.000Z",
          "Titre": "GoRoostr is truly best in class...",
          "Contenu": "GoRoostr is truly best in class...not just because the prices offered are highly competitive, but because the customer service is second to none.I recently upgraded from an iPhone 12 Pro to an iPhone 15 Pro Max. I did my due diligence on a variety of companies who buy used Apple gear, and, with the exception of one (whose reviews are sketchy at best), GoRoostr offered as much if not more than its competitors. I was not surprised, as this has been my experince with GoRoostr over the years, selling a variety of Apple products.But what truly sets GoRoostr apart is its customer service. Before I actually placed my \"order\", I emailed them with a question, and got a responsive, courteous, friendly email back nearly immediately. With the GoRoostr-provided FedEx shipping label I dropped the iPhone package at my local FedEx store on Monday afternoon. It arrived the very next morning (Tuesday) at GoRoostr, where I received an email receipt from them that they received the package, and it would be evaluated and I would be made an offer by the close of business the very next day, Wednesday. I received an email from them on Wednesday morning that they had completed the evaluation, and immediately paid me in full by PayPal. So, in less than 48 hours, I went from wiping an iPhone, to shipping it, it being received, evaluated, processed, and paid. All the while GoRoostr remains in communication, with courtesy and respect.There are any number of companies out there who buy Apple products. But GoRoostr is second to none. When I (inevitably) have Apple products to sell, I will be working with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T22:01:04.000Z",
          "Titre": "The best and  Only place to sell",
          "Contenu": "Seamless, professional, efficient and painless. Start to finish this was an amazing transaction and if I should need to sell any other devices in the future this is my only stop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Avgardella",
          "Nb_Reviews": 2,
          "Date": "2023-06-03T17:42:30.000Z",
          "Titre": "Better than expected",
          "Contenu": "Better than expected! Offered top dollar. Processing was easy and the service was faster than expected! I will use this service again. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brinson Davenport",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T00:59:15.000Z",
          "Titre": "Absolutely Blown Away",
          "Contenu": "The team was exceptionally communicative, and I was fearful this was all a scam.  As promised, less than a day after receiving my Macbook the money was sent to my account!  Amazing experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jocelyn Garcia",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T19:53:40.000Z",
          "Titre": "Seamless experience",
          "Contenu": "The process was very easy just had to fill in the details, print out a shipping label and send my computer on its way. Never had issues and no complaints on service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margarita DeJesus",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T18:00:15.000Z",
          "Titre": "I was skeptical at first but it was the…",
          "Contenu": "I was skeptical at first but it was the quickest experience ever and I got the money super fast!!!! Best experience ever will work with this site again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vincent J. DiBiase",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T18:53:26.000Z",
          "Titre": "Great Experience.  Best offer for my MAC By FAR!!!",
          "Contenu": "Best offer for my MAC By FAR!!!  Great Experience.Easy to send the product.Quick receipt of the product.Quick payment direct through Zelle.Others said they would offer me the highest price, but no one offered as much as Roostr."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David  Ball",
          "Nb_Reviews": 1,
          "Date": "2020-05-20T17:17:06.000Z",
          "Titre": "GoRoostr is Great!",
          "Contenu": "Nothing but great things to say about GoRoostr. This was the second time, I've used them to sell a MacBook. Everything went perfectly. I received an email when they received the laptop and one the next day when they reviewed it and sent my check, with a tracking number. They gave me the best price on the internet and I received my check three days after they received my laptop. Choose GoRoostr, best prices and best customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Swan",
          "Nb_Reviews": 4,
          "Date": "2023-08-21T15:28:52.000Z",
          "Titre": "Very happy first time customer",
          "Contenu": "I have never sold a used computer to a company like this and was happily surprised by how easy and honest the process was."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GTBATT",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T17:48:56.000Z",
          "Titre": "Notified immediately upon receipt of my…",
          "Contenu": "Notified immediately upon receipt of my laptop.  Explanation of possible delay, but no more than 1 business day, due to employee illness.  Payment issued on original schedule, not delayed, as quoted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cycling Texan",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T20:20:55.000Z",
          "Titre": "Easy to deal with and quick payment",
          "Contenu": "Easy to deal with and quick payment! A great way to get rid of old tech and keep as much as possible out of the landfill."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denasia Pompey",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T18:33:45.000Z",
          "Titre": "Quick & Easy!",
          "Contenu": "Quick & Easy!! Beginning to end of transaction went very smooth, it was also an extremely fast process. Will be the go-to again if an electronic breaks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexis Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T19:57:34.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! They let me know when they received my device and what to expect. My payment was processed quickly and effortlessly. 10/10."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Hamza",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T20:14:50.000Z",
          "Titre": "Quick and easy way to sell old computer",
          "Contenu": "Straight forward website experience and fast service. I sent in my old MacBook Air and received my money the next day. The GoRoostr representative's emails were polite and told me exactly what was happening in near real-time. Great experience, highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T17:51:38.000Z",
          "Titre": "Genuine and Amazing",
          "Contenu": "They gave the exact amount for the quote. They were super fast and responsive. The entire process was extremely easy and simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karie Martinez",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T17:57:37.000Z",
          "Titre": "This is my second time selling my…",
          "Contenu": "This is my second time selling my gadgets to GoRoostr...effortless way to to make a buck on used gadgets. Quick response when you submit request. Also just as quick to receive payment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaitlin McCall",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T18:21:57.000Z",
          "Titre": "They were so great to work with; received full amount quoted",
          "Contenu": "They were so great to work with. I looked at a few options and chose GoRoostr based off their reviews and I am pleased to add my own great review. The process was seemly, everyone was so polite and I received the full amount that was quoted to me!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kylee Rivera",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T23:22:24.000Z",
          "Titre": "They were honest and true to what they…",
          "Contenu": "They were honest and true to what they do and I received my money so fast. I really appreciate this company I will definitely sell to them next time if I have too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esther Brooks",
          "Nb_Reviews": 1,
          "Date": "2020-05-08T17:18:39.000Z",
          "Titre": "Easy,Honest and Quick",
          "Contenu": "The entire process was straightforward and easy. I was given a check for the exact amount quoted and my check was mailed the same day and I was given a tracking number so I knew where my check was at all times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sejal Karavadia",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T19:07:03.000Z",
          "Titre": "Awesome Customer service and experience",
          "Contenu": "Everyone on the Roostr team from my first phone was so cordial and helpful. They were very prompt on each of the steps and wrapped everything up in less than a week after I sent my daughter's MacBook to them. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "stacie Price",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T18:15:42.000Z",
          "Titre": "They gave me the highest offer for my…",
          "Contenu": "They gave me the highest offer for my device and it was a quick turnaround , very easy process and kept me updated I would def recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Cassell",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T17:19:59.000Z",
          "Titre": "The process was so easy and my laptop…",
          "Contenu": "The process was so easy and my laptop sent in was processed within a day, definitely will sell back to roostr on the future if need be!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elias Sandoval",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T18:50:30.000Z",
          "Titre": "The process was smooth and easy and…",
          "Contenu": "The process was smooth and easy and they pay the fairest amount in the industry.would definitely recommend them to my friends, family and anybody out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Letty G",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T17:41:10.000Z",
          "Titre": "Very fast process",
          "Contenu": "Very fast process, I got paid next day after delivery. I strongly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emilio",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T19:52:26.000Z",
          "Titre": "Impressively fast and straightforward",
          "Contenu": "Impressively fast and straightforward, from quote to shipping. Best value I have found in my benchmark for my Macbook Pro."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug M.",
          "Nb_Reviews": 3,
          "Date": "2020-04-30T18:37:02.000Z",
          "Titre": "Twice a customer!",
          "Contenu": "This is the second time I’ve used GoRoostr. They are fast, professional, and more than fair in their offer. I will be using them again the next time I upgrade my technology."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shash S",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T19:48:23.000Z",
          "Titre": "simply amazing and quick pay",
          "Contenu": "I was skeptic at first but these guys are legit. Very good price to my MacBook and quick payment (1day) after reception of device"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JefF",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T20:27:43.000Z",
          "Titre": "Great Company!",
          "Contenu": "Very smooth, lots of communication, friendly people to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elliott Johns",
          "Nb_Reviews": 1,
          "Date": "2020-05-23T21:15:35.000Z",
          "Titre": "I had no issues with goroostr",
          "Contenu": "I had no issues with my goroostr experience And now I have $350 from an MacBook air  I didn’t need to spent on a computer that’s right for me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fabian",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:06:52.000Z",
          "Titre": "Best in the business!",
          "Contenu": "Excellent communication, extremely competitive quotes, and a streamlined process that could not be easier!!  Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Conan",
          "Nb_Reviews": 1,
          "Date": "2020-05-22T19:09:10.000Z",
          "Titre": "Very fast and professional company",
          "Contenu": "Very fast and professional company. I was a little skeptical at first, but I was impressed when I received quick responses and a fast payout!"
        }
      ]
    }
  ]
}