{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "gpstrackit.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Faciane",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T15:28:07.000Z",
          "Titre": "Poor customer service",
          "Contenu": "The initial training is too scattered. It should be a step by step process. When an instructor states halfway through training that this step should be done first there is a disconnect. Secondly calling in multiple times and put on callback system and not getting called back 4 times is not a positive response of product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T02:44:19.000Z",
          "Titre": "Not what expected when it tracks miles",
          "Contenu": "Doesn’t get the information 24/7 on specific trucks. We only want it for summary miles report but that is to broad for the information given and the miles report is to much information."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jared huyett",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T20:56:58.000Z",
          "Titre": "There request a video doesn't work and…",
          "Contenu": "Their request a video doesn't work and their support provides no help just bad and conflicting excuses. The whole point of a system like this is to get video of accidents that occur - system didn't capture fender bender and request a video could not retrieve video. Numerous calls and requests to support provided no help. Even recent random video requests don't work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jodi",
          "Nb_Reviews": 1,
          "Date": "2015-05-20T20:06:50.913Z",
          "Titre": "Horrible",
          "Contenu": "We switched our company to GPS Trackit and we will be cancelling it very soon as it's horrible. Their app never works and always crashes so you have to be on a computer in order to look up any of your vehicles, then most of the time you look up a vehicle it shows it being live yet the ping was from 45 min to an hour ago so the guy isn't anywhere near where it shows since it's always behind and never current. Worst GPS service I've used of the 5 or 6 that I've seen."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Paul",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T18:53:53.000Z",
          "Titre": "Lots of problems with this company",
          "Contenu": "Lots of problems with this company. Seems like every few months they do some update that makes the software about useless for months on end. They don't follow through very well on issues and they don't communicate well either. Might be best to look elsewhere for reliability."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa Jo",
          "Nb_Reviews": 5,
          "Date": "2018-02-07T15:18:22.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible!  They are extremely nice over the phone but are nothing but empty promises.  Their products do not function properly and when you call for help they will give you all the promises you want to hear but offer no actual solutions.And if you want a refund? Good Luck! Two Months later and one open BBB complaint and I am still ignored.  Will now have to escalate it to my Credit Card company and open disputes.  I do not recommend this company for anything.  If you are searching for ELD I would suggest Keep Truckin or Omitracts Best of Luck to anyone willing to dive into this unorganized and incomprehensive mess of a company!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darrell Pickens",
          "Nb_Reviews": 1,
          "Date": "2015-10-05T21:54:13.000Z",
          "Titre": "Only 2 out of 7 units worked",
          "Contenu": "Unfortunately, my experience over the past 3 years has been horrible. We've had 7 units and never have all worked 100% at the same time. In fact currently only 2 out of the 7 are working as I write this. I've spent 100s of hours on the phone with tech support, deinstalling, shipping units back, reinstalling only to continue to have issues. Tech support usually needs the unit back to troubleshoot which then requires more downtime and labor for us. So even after having their own certified installer reinstall all of our units we still continue to have the same problems on these units. Asked to cancel service and now they want me to pay $150 cancellation fee for each unit even though the units are not currently working and haven't for close to a year with all the issues we've had. Buyer beware with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erica Ochs",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T17:58:46.000Z",
          "Titre": "STAY AWAY FROM GPSTRACKIT",
          "Contenu": "Product failed in all 3 of our company vehicles. GPS Trackit refused to send us replacement equipment. We canceled our services. They have continued to charge us or the service 5 months later. We have filed fraud with our bank to get the charges stopped. Stay as far away from this company as you can!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Connie",
          "Nb_Reviews": 1,
          "Date": "2015-05-20T21:15:40.000Z",
          "Titre": "GPS Trackit APP on Iphone POOR",
          "Contenu": "I have GPS Trackit because i love the App. The App has been down for over two months.  Because of this, we are looking for another tracking company for our trucks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J Lillie",
          "Nb_Reviews": 1,
          "Date": "2017-09-05T16:29:07.000Z",
          "Titre": "Unsatisfactory Service & Unreliable Product.",
          "Contenu": "We have 3 GPS devices that our goal was to track mileage reimbursement & employees. The sales people at Fleettrackit promised me if we were ever dissatisfied with the product we could cancel at any time, no cost to us as long as we mail back the devices; I still have his email. We've had 3 solid months of the devices breaking down and not tracking miles, turning themselves off and on repeatedly while people are driving, alerting that they are unplugged when they are not, not tracking the correct time, etc. A few weeks ago one of the devices texted 450 alerts to my phone in an hour because we unplugged one so we could send another back. I always do exactly what the IT guys tell me to & when they can't fix it over the phone they send out a REFURBISHED unit (at their recommendation). Then I have to pay to send the broken one back and lose at least a week of mileage tracking. Most recently when I asked to end our contract the customer service supervisor suggested that they weren't really broken as they refurbished them and then sent them off to someone else and they worked. (Definition of refurbished?) When our original contract expired GPStrackit hassled me continuously to renew and I ignored them b/c even then I was questioning the service. They then went around me to the company president to renew the warranty...he renewed it, not realizing that he signed up for 3 years of unreliable service.  When I asked them to honor our original agreement I was informed the company was bought out and the sales guy that sold me the service no longer worked there so we would be fined and penalized if we broke the agreement. Then they tried to upsell me another product and I'm sure another binding service agreement with it.  These devices are now known in our company to be unreliable for tracking mileage, we can't use the alerts and the reports are mediocre at best. I have to export them to xcel and clean them up weekly.  I'm disappointed and frustrated with both the customer service and the devices. I wish I would've gone with any of the others tracking companies I had researched. I hate doing reviews and I'm trying to be fair. I gave them the opportunity to fix it and they wouldn't."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose Martinez",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T22:07:33.000Z",
          "Titre": "We were moved to a new platform but it…",
          "Contenu": "We were moved to a new platform but it is not working."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Wegrzyn",
          "Nb_Reviews": 1,
          "Date": "2018-02-14T01:54:43.000Z",
          "Titre": "9 months of frustration",
          "Contenu": "This complaint is generated for the \"ELD\" side of this company.  We have used this company's satellite tracking services since 2005 and have had stellar performance from those systems.  Additionally at no time have we experienced any 'rude' conduct, however we now submit the following experience(s) as being unacceptable, unreasonable and potentially exposing our firm to unlawful conduct as defined by Federal Motor Carrier Safety Administration.Federally mandated hours of service reporting via Electronic Logbook Devices went into \"phase in\" effect December of 2017.  We as a company purchased products to comply with the regulations December of 2016!  One full year before the mandated start period.  We gradually phased in a truck or two monthly to insure we had a fully debugged fleet before the December 2017 date. Beginning in July of 2017 and carrying forward to today's date has been a literal nightmare regarding the functioning of these devices and more importantly the inability of their technical services to make these units 'work'.  Our fleet consists of large truck year models 2004 to 2017 and we are experiencing as many problems with the latest models as the older model trucks.So far, just the professional man hours spent trouble-shooting, updating, upgrading, reinstalling, having units return from the field for this fix or that fix, send screen shots of reported problems, etc., has quadrupled our initial multi-thousand dollar outlay.As stated in a previous post, there were promises and assurances made by GPS Trackit that have never been followed through on.  In our case, these were not one-time issues, but presently number at 20 plus.  We are still experiencing problems that were first reported to the company in July 2017 AND still exist today despite numerous assurances from the company that \"this will be fixed\".  Today, I have 2 trucks properly functioning and 13 that are in violation of the requirements set forth in 49 CFR 395.  Should a roadside inspection occur, our company could be held responsible for the failures of GPS Trackit to correctly function/report. Federal law specifically places the burden of compliance on THE MOTOR CARRIER (US) to comply.  The most glaring deficient is the system does not function automatically as required by statute, but rather our drivers must physically enter data into the system.  The log can be manipulated EVEN WHILE THE VEHICLE IS IN MOTION.  The ability to 'data entry' while the vehicle is in motion is strictly prohibited by the Federal Regulations and GPS Trackit should lose their FMCSA product endorsement over this issue, as they have known about this since July of 2017. Right now this Company has put us into a  Catch-22 position. GPSTrackit is either unable or unwilling to deliver a merchantable product AND regulators will find that we are not complying with all the requirements imposed by the hours of service safety regulations thereby exposing us to D.O.T. monetary fines and harm to our safety score.  Those in the trucking business know that purported safety violations remain on your record for three (3) years and affect your ability to do business and buy affordable insurance. Therefor we are presently examining what remedy would best serve our interest.As of this writing, there is no way we can endorse this firms Electronic Logbook Device rating greater than one star.  For those who have given this system 5 stars we can only say - We Wish We Were You."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donalyn Brouty",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T18:42:58.000Z",
          "Titre": "I had signed up for all classes then…",
          "Contenu": "I had signed up for all classes then was told I only needed two of them.  I attended the first, which was informative but the 2nd one was a question and answer class and only one question was answered.  I feel like I should have had more information."
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "Christian Andresen",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T12:41:07.000Z",
          "Titre": "+ GPS tracking that works decent",
          "Contenu": "+ GPS tracking that works decent+ Can set up Zones+ Power saving when home+ Scoreboard+ Light Weight+ Charges fast- All Zones have equal notification sound so you cant tell if its on a dangerous road, home, or just going from one part of the neighbourhood to another without having to check the phone all the time. Stressfull. - The GPS can jump to a location on the map when your animal is indoor/stuck inside some place to a wrong location and not register when it has left the place. Found my cat home one time when it said it was in a garage across the road. - No security warning if your cat is in a dangerous zone for the cat nor you. You have to manually go in to the app and start the sound on the GPS to try to scare your animal away and off when its off the road. And back on if he goes back. And off again if it returns to the road. - No power saving when battery is low so if it goes empty you can only see its last location. If it has left that location then good luck finding your animal if it has walked further from that. Gets a two star cause it works decent as a tracker, can hang sometimes, and has no safety mechanics to warn or if the GPS goes empty. Battery ok."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T01:20:58.000Z",
          "Titre": "Something is wrong with the way my…",
          "Contenu": "Something is wrong with the way my system is working It took a while to convince the rep it was not user error, I sent a video of what I was doing. He said he would start a ticket but I have no ticket tracking at this point 1 hour later"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Linda Amon",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T17:03:53.000Z",
          "Titre": "I am asking for a do over",
          "Contenu": "I am asking for a do over. The communication with your  instructor was poor. Could not hear her. She did not cover how to log in for access to the system. Luckily I am familar with GPS so I will work through it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 1,
          "Date": "2015-02-09T20:32:15.000Z",
          "Titre": "Highly Unlikely to do business again with company",
          "Contenu": "Not happy with their willingness to back their product. Having issues with the units not being durable, and was informed their product is Water Proff, but in reality, it is just Water Resistant"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2021-01-21T13:25:41.000Z",
          "Titre": "If you only care about reports, sure go ahead",
          "Contenu": "Bottom line up front: If you don't care about customer service and the user experience, this will do the job. Honestly, I found myself asking if this company actually exists at times. There are 3 phases I want to highlight:First, once they sell you their product, you are all alone. I understand that the sales team cares more about making their sales but they actually disappear once you sign the dotted line. Second, it's really surprising how every representative I spoke to does not pay attention to detail. When I first purchased the device, I attended their information session and had requested for the document via email, but I had to remind them couple of times to get a follow up from their team acknowledging that they \"forgot\". Also, in the process of closing my account, I had to speak to 4 different representatives who all told me different status updates. Funny enough, they all agreed on one thing: the other representatives were wrong. Lastly, when I finally received the return label, my address was completely incorrect so when I called back to have it fixed, I had to spend the first few minutes to convince the representative that I wanted to have it corrected. I understand that once the item gets to where it needs to, the FROM address does not really matter, but it's about professionalism and doing things the right way. She was definitely reluctant to assist and hung up as soon as she said, \"okay, I sent you the email\". Third, this is probably the most irritating one. Their user experience is TERRIBLE. Their mobile app would have been better if they didn't create one. You can read their reviews on the app store. They ignore all the reviews about the lags and how it freezes but they try to sell you with \"you can also track your vehicles using our wonderfully designed mobile app\". If they had any bit of integrity, they cannot claim that their app is working. It really does not work. I am not exaggerating when I say this. The app does NOT work. And they know it. And no, it's not my phone. Many of my colleagues who happened to use GPS Track It experience the same issue. Anyway, even their web design looks very outdated and looks as if they kept their pre-alpha version. All that said, if you really don't care about any of the customer service or the user experience, and you simply care about exporting a report then this will get the job done. For me, I value professionalism but this company does not.*EDIT*They charged me even after confirming that I have no outstanding balance and that I will not be charged since I closed my account before the billing date. I will definitely dispute this but just the lack of attention to detail from the start to end is so frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rhonda",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T22:16:10.000Z",
          "Titre": "Needs more first-time user information",
          "Contenu": "Maybe I misunderstood the goal of today's session, but I needed more information relating to setting up our system for first-time use. We were 38 min. into my video recording of the session when we were instructed to click on ACCOUNT first in order to set up TAGS, DRIVERS, and USERS."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T16:49:46.000Z",
          "Titre": "Very hard platform to navigate",
          "Contenu": "Very hard platform to navigate not as simple as other GPS tracking company,great customer service, great support but you need to do something on your own very difficult."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dwight Parrott",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T20:25:45.000Z",
          "Titre": "It is difficult to navigate",
          "Contenu": "It is difficult to navigate. We have trouble with the ELD units that plug into the trucks. I have to call to get the quarterly mileages."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jackson County School District #4- Phoenix",
          "Nb_Reviews": 2,
          "Date": "2023-03-22T01:34:01.000Z",
          "Titre": "The program is a good program but the…",
          "Contenu": "The program is a good program but the training has been pretty hit-and-miss not covering the topics that I need."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Verified Customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-29T19:06:10.000Z",
          "Titre": "Generally good but…",
          "Contenu": "The export functionality is good but not being able to modify it and import it leaves little use. Reports seem to show no vehicles meet the criteria more often than not when I can view the data in question per vehicle on the map or status pages."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rod Brumlow",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T16:55:36.000Z",
          "Titre": "I was looking for more of a one-on-one…",
          "Contenu": "I was looking for more of a one-on-one learning. I did learn a few things, but the pace was way too fast and having to use the message bar is so impersonable in asking questions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2015-02-11T15:34:39.000Z",
          "Titre": "Gps System. Tablets.",
          "Contenu": "We love the GPS system But the tablets & apps need to be updated with\rsome type of notification when a messages has been received."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike Acord",
          "Nb_Reviews": 1,
          "Date": "2015-05-22T16:46:06.779Z",
          "Titre": "average",
          "Contenu": "troubles with systems not working properly.\rdoes not give true engine hour readings for rental tractors."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T01:46:10.000Z",
          "Titre": "Interesting Webinar but I felt it…",
          "Contenu": "Interesting Webinar but I felt it perhaps could have been more interactive with attendees and allow for better discussion between guests"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick ( Minit Maids)",
          "Nb_Reviews": 3,
          "Date": "2023-09-20T17:55:10.000Z",
          "Titre": "Training was too fast and not customized",
          "Contenu": "The training was very fast and it did not customize the training to our situation with 8 cars for our maid service  No way to question things except by chat. Learned some things that we can use for landmarks etc but not being able to have a two way conversation was a little disappointing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T16:14:17.000Z",
          "Titre": "Good to work with",
          "Contenu": "Start up and installation of the guides have been okay, I've learned a lot through the webinar's they provide. There are a few bugs throughout the system and it has hindered the overall performance of the system, they have been quick to fix them. As far as everything else is going it's working like they said it would."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeannette Cottrill",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T22:29:23.000Z",
          "Titre": "Roman does most of the time receive our…",
          "Contenu": "Roman does most of the time receive our \"Stop Idle Report\" in the correct format and timely.  But just to make you aware, the report usually never comes if a holiday falls on Monday (same day we get report) and this last week it was not formatted correctly and was useless.  We have turned in a work order for this issue, I hope Monday 10/3 report for current week will be correct."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eleta Ramsey",
          "Nb_Reviews": 2,
          "Date": "2022-08-30T22:37:31.000Z",
          "Titre": "It was very informative and exciting to…",
          "Contenu": "It was very informative and exciting to see what the cameras will allow us to see and check. I was very amazed at the ability to request a clip at a certain time and will be able to see what is going on with our trucks. And that it will help confirm what drivers say if there are mechanical issues etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T18:15:59.000Z",
          "Titre": "Im having trouble with the not seeing…",
          "Contenu": "Im having trouble with the not seeing the full drop down when Im on my dashboard, I dont event have the option to chat with support team on my dashboard."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T01:51:07.000Z",
          "Titre": "Presentation was a little too fast and…",
          "Contenu": "Presentation was a little too fast and it need to be put in a more better order. If creating tags need to be completed first then that’s where it needs to start. Other than that the presenter did a great job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AMB",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T15:26:02.000Z",
          "Titre": "employees are great",
          "Contenu": "The people I ask questions to are willing to find the answers for me which I appreciate.  Unfortunately, the software is not capable of doing what I'm hoping for.  So 5 stars for the employees and 3 stars for the software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Horton",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T21:34:38.000Z",
          "Titre": "Just beginning with the software at…",
          "Contenu": "Just beginning with the software at this time.  The representative for GPS Trackit was very knowledgeable and ran the class efficiently."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Whitehead",
          "Nb_Reviews": 2,
          "Date": "2016-11-08T14:50:21.000Z",
          "Titre": "Update to Prior Review",
          "Contenu": "Updated:  After posting my negative review GPSTrackit reached out to me to discuss my dissatisfaction.  I think it was simply a matter of getting up the chain of command to the right person.  The person I spoke with took responsibility for the promises that were made to us and had the custom report designed for us entirely at their cost.  The report is exactly what we wanted and I couldn't be any happier.  I would give them 5 stars but I am grading them down for the prior problem.  I am now 100% satisfied with the product and service.  We were looking to upgrade our GPS systems in our trucks.  GPSTrackit was recommended to me by our Verizon Business Rep.  After talking with the GPSTrackit Rep and going through a demo with him, I sent him copies of the reporting that I was provided with my current system and was important to me.  He told me no problem with them providing me the same reports I needed.  I ordered their system along with tablets from Verizon and expensive mounts from a third party provider.  After using the product for a period of time I asked about when I would get the report I had been promised.  They said it would cost $3,000 for them to custom design the report.  I said but my Rep Omar promised me.  They said Omar no longer works for them.  Beware of false promises."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T20:34:25.000Z",
          "Titre": "The only issue that I would say is that…",
          "Contenu": "The only issue that I would say is that for my company is that its difficult to change drivers at the the spear of the moment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "erik rheinisch",
          "Nb_Reviews": 1,
          "Date": "2016-04-19T22:55:00.000Z",
          "Titre": "GPS Trackit does exactly what is supposed to.",
          "Contenu": "I have been very happy with their services. As I have had questions or issues they promptly addressed them.  Michelle is wonderful and has done a great job taking care of my needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WARD COOLEY",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T16:31:54.000Z",
          "Titre": "Lots of info at once",
          "Contenu": "Lots of info at once - maybe too much. The platform does appear fairly easy to use and the install was very easy."
        },
        {
          "Note": 4,
          "Lieu": "HN",
          "Pseudo": "Josue Pineda",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T21:08:37.000Z",
          "Titre": "Really good portal and training",
          "Contenu": "Really good portal and training. I enjoyed Mrs. Brewer zoom training. Portal seems very user friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T17:04:04.000Z",
          "Titre": "Custom Reporting coming soon???",
          "Contenu": "Needed more functionality and custom reporting but my rep was very helpful in answering questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Billingsley",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T06:54:42.000Z",
          "Titre": "Training",
          "Contenu": "I like the one on one training. The person was very good but I think that you need vides for the driver in spanish just not in english."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Davis",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T22:47:22.000Z",
          "Titre": "Just got start with the new system",
          "Contenu": "Just got start with the new system.  Finish my first class.  Lot of good information."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T00:47:02.000Z",
          "Titre": "Did great",
          "Contenu": "Did great, was very clear spoken. Wish it went over maintenance tab more but great for a entry lesson."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2015-02-09T20:29:54.000Z",
          "Titre": "Excellent",
          "Contenu": "Tons of Data and option, easy to use interface, and great customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T22:32:10.000Z",
          "Titre": "Informative and to the point",
          "Contenu": "Informative and to the point."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S. Bollinger",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T22:46:41.000Z",
          "Titre": "Webinar - Usage of Cloud Software",
          "Contenu": "Very informative and helpful.  Excellent response to questions during the webinar."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hudak Infrastructure Repair",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T22:45:24.000Z",
          "Titre": "Very informative"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "tracey green",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T21:07:47.000Z",
          "Titre": "very interesting and helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danny Patterson",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T18:09:14.000Z",
          "Titre": "Good presentation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabriella Angel",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T00:09:50.000Z",
          "Titre": "Good presentation"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:04:19.000Z",
          "Titre": "I enjoyed the straight forward training…",
          "Contenu": "I enjoyed the straight forward training aspect. Not a lot of wasted time. Short to the point and informative. The speaker spoke clearly and concisely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donalyn Brouty",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T18:20:48.000Z",
          "Titre": "Wardwell Construction",
          "Contenu": "Savannah did a great job training one on one with Wardwell Construction in Orland, ME.   Once I explained out operation, what she gave as instructions made sense.  It is great knowing that information is available on line and by contacting the company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Kuykendall",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T16:09:05.000Z",
          "Titre": "DKR Training Session",
          "Contenu": "Savanah led a great training session and helped up answer all questions we had. We're really looking forward to the roll out in January of the new features!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trina Fields",
          "Nb_Reviews": 4,
          "Date": "2023-11-15T01:55:03.000Z",
          "Titre": "We at Community Forward have been…",
          "Contenu": "We at Community Forward have been looking for someone to hook up with for the GPS tracking and you guys were the best after looing around for a few weeks. Not only are you guys reasonable but we had the option to do a zoom to understand what we are dealing with. So thanks for that"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Trautmann",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T14:40:28.000Z",
          "Titre": "Five star company with great products and support.",
          "Contenu": "Always receive five-star support from Trevor Hoyle.  He is responsive and resolves our issues stemming from our recent migration to a new platform.  All of the team at GPS Trackit are awesome to work with.  It's rare in an era of short staffing to receive great Support and Service.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T23:16:53.000Z",
          "Titre": "Eric did a great job going through…",
          "Contenu": "Eric did a great job going through basic information's about GPS Trackit! I was amazed at what this could do!  Unfortunately this is too much information for my position, I do sales and it will be easier for me to reach to the driver  ( by a phone call )to see what is ETA will be. I'm sure my company will benefit more out of this. My needs are different, I get calls from my customers to see where their delivery is at,  we are a local bakery ( with seven 24 feet box truck )doing fresh daily delivery.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lester Mills",
          "Nb_Reviews": 2,
          "Date": "2019-07-29T23:05:13.000Z",
          "Titre": "Works as promised",
          "Contenu": "GPSTrackit and more recently Fleet GPSTrackit have performed very well for us. There have been a few moments when we wondered about our data, (Truck temporarily lost signal, ELD stopped talking to the tablet, etc) but we have NEVER loss any data with these guys. The connection between the truck was never lost and we caught up in a few minutes. Tech support has been very helpful and responsive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Graco Roofing and Construction",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T16:18:35.000Z",
          "Titre": "The Beginning Stages",
          "Contenu": "We've only begun the process, the team of specialists to help us get started have been wonderful, helpful and informative. Will know more as we get units installed and make this thing run."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Hemingway",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T05:38:30.000Z",
          "Titre": "Juan and team at GPS trackit are…",
          "Contenu": "Juan and team at GPS trackit are outstanding! Professional, responsive, customer service oriented all! Their products are second to none, useful for our growing business easy to install and manage, affordable. You will be pleased working with GPS trackit! Five stars"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill Katusky",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T20:36:41.000Z",
          "Titre": "Professional",
          "Contenu": "Samatha seemed very well trained, knowledgable, rehearsed, organized, experienced, etc....no \"ummmmm's\", no hesitations, etc.  It was a tiny bit fast for me, but I am totally new to this & a bit inexperienced in general with computers.  I will take this course one more time before the advanced."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darryl",
          "Nb_Reviews": 1,
          "Date": "2015-02-09T21:01:37.000Z",
          "Titre": "Excellent job! Great products!",
          "Contenu": "Entire staff does an excellent job!\r Sales Rep, Billing and Tech. Support, all do an excellent job.\r Items are addressed immediately and always to a satisfactory outcome.\r Great products, easy to install, reliable and do what the company says that they will do.\r Would recommend GPSTRACKIT to anyone needing a tracking solution.\r Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alicia Pacini",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T23:28:16.000Z",
          "Titre": "Daniel",
          "Contenu": "Daniel, our Account Executive, has been super helpful and responsive. He has gone the extra mile to ensure that we are getting what we need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "nick ma",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T10:40:18.000Z",
          "Titre": "GPS Test Tool--Good app for satellite information visualization!",
          "Contenu": "Good app for satellite information visualization!GPS Test Tool (Gnss Viewer) is a simple and easy-to-use GPS tool on Android system, it supports automatic detection of GPS on Android devices,you can check the GPS reception in your area and update AGPS data for faster fix times,whilst being able to view other GPS and sensor data.It supports GPS, GLONASS, GALILEO, SBAS, BEIDOU and QZSS satellites.GPS Test Tool has nine different functions:1.Number of GPS satellites2.Satellite signal strength3.Your current speed, heading and altitude are shown as text4.Show your GPS coordinates5.Compass function6.The time in your current time zone 7.And UTC time, etc.8.View the output of NMEA data9.Save NMEA satellite dataCoordinate Grids supported by GPS Test Tool:OSGB, UTM, MGRS, USNG, CH1903Datums supported by GPS Test Tool:WGS84, NAD83, NAD27, ED50, AGD66, AGD84, SAD69 plus moreThe GPS Test Tool is quite powerful, the most important thing is that there is no in-app purchase and it is completely free.googleplay search GPS Test Tool (Gnss Viewer)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred E",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T22:38:01.000Z",
          "Titre": "This company is awesome in every sense…",
          "Contenu": "This company is awesome in every sense of the word their customer service and support is great. The product they offer is hands down the best that I've worked with everything from sing me out locations of employees to recovering stolen vehicles in less than an 30 minuets.  They even reached out to me that tell me they had changed their rate plans and I could save money without sacrificing any service or refresh rates on my existing units. I'm very happy with the service and will continue to be a satisfied customer going forward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Robles",
          "Nb_Reviews": 1,
          "Date": "2016-04-05T07:15:48.893Z",
          "Titre": "Great customer service!",
          "Contenu": "To whom this may concern,\r Our firm has been using the GPS service for several years now and we have nothing but great things to say about it. The customer service is absolutely my favorite part of working with the GPS system. When we need parts, new unit's or have questions, within minutes everything is taken care of. Melissa Fuentes is our customer service representative, and she is absolutely great to work with. She is extremely professional and courteous with all my needs, I can't say enough about her and I truly do appreciate her help whenever we need it. I have no negative feedback to provide but the word excellence! We will be life time customers and thank you for all yalls help!\r Justin Robles \rVP of Marketing \rRobles 1 Demolition \rSan Antonio, TX"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glen Goldstein",
          "Nb_Reviews": 1,
          "Date": "2016-04-20T19:14:29.000Z",
          "Titre": "Ongoing Customer Service & Training",
          "Contenu": "I wanted to go out of my way to praise an exceptional employee by the name of Michelle Grace. We have been dealing with GPSTrackIt for some time now and I have yet to come across an employee as thorough and exception as she has been. Her training and explanations have been great and resourceful. Michelle has been a tremendous help thus far and I am honest when I say she is wonderful. Thank you for all your help thus far Michelle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "THIS & THAT TRANSPORT",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T00:02:43.000Z",
          "Titre": "GPS Trackit has been nothing but…",
          "Contenu": "GPS Trackit has been nothing but wonderful thus far. Technical support got me up and running on a Sunday. The training seminar I attended was awesome. The instructor took her time explaining the fundamentals of the website and the Driver app. Way to go!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy Foote",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T22:35:46.000Z",
          "Titre": "I really liked the LIVE webinar",
          "Contenu": "I really liked the LIVE webinar! The presenter was very good. I appreciate getting the recording of the webinar because there was A LOT in there. This is my first time managing GPS Trackit so I need to review it a couple more times, at least. After that I think I can use the \"help\" tab or call customer service for help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin O'Neil",
          "Nb_Reviews": 1,
          "Date": "2016-04-05T17:27:57.000Z",
          "Titre": "Full Featured Service with Amazing Support.",
          "Contenu": "We have been using GPStrackit for about 4 years now.  Knowing where our crews are at any given moment is a must and all the additional features and reporting make life much easier especially tracking vehicle maintenance this has eliminated massive excel spreadsheets a big plus.  These reports save us time and money.  They are always updating the services that they offer and any time we have a question, need support or to place an order they are always super responsive, helpful and if we ever have a issue it is always resolved in a timely manner.  I would most define"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dominick Esposito",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T17:38:01.000Z",
          "Titre": "Your team have been nothing but…",
          "Contenu": "Your team have been nothing but extremely friendly and helpful on any request I've made! Training session was well worth the time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra Clauser",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T00:56:13.000Z",
          "Titre": "Very reliable and affordable",
          "Contenu": "We have been using GPS TrackIt since about 2017.  We have liked them from the start.  They were more economical than all the other brands and other brands tried to say they would not be reliable then.  They have worked great and their customer support is great along with any technical issues.  They are very helpful and always there to help.  In these times that is hard to find.  Great customer service and a reliable gps for our 26 truck fleet.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Prime Utility Construction",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T15:15:57.000Z",
          "Titre": "Excellent",
          "Contenu": "you guys did grate on showing us how to use the website, excellent training session"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Osterman",
          "Nb_Reviews": 1,
          "Date": "2016-04-06T16:00:25.000Z",
          "Titre": "Great Service",
          "Contenu": "I've used GPS Track-it to manage my agency's fleet of vehicles for 4 years now. Any troubleshooting or training, they've been available and on time with follow-ups. Also understanding as our fleet grew and budgets changed to work with me to keep our clients and staff safe without compromising quality. Very helpful and understanding, and their product is super easy to use (love that it's web based so I can access it on my phone, iPad, Laptop, etc.) especially love automating reports and alerts, and adjusting as needed so i can 'set it and forget it.\" The data their product sends is perfect for following up on speeding, accidents, unsafe driving, and even more importantly tracking mileage to schedule routine maintenance (oil changes, tire rotation, etc.)\r A lot of the features are easy enough to figure out with a little time to play around, but their YouTube tutorials and help desk staff are more than enough to go from zero to proficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck Arnold",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T21:05:05.000Z",
          "Titre": "GPS Trackit is an awesome company",
          "Contenu": "GPS Trackit is an awesome company. Whenever I have had any questions, I call or chat with one of the reps and I get instant answers as well as the answers are always right. We use them for our GPS fleet tracking which is always up to the minute/second! We also use them for our fuel tracking which is right on target."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fleet Admin",
          "Nb_Reviews": 2,
          "Date": "2022-08-02T22:37:30.000Z",
          "Titre": "Responsive Account Manager",
          "Contenu": "Daniel Alvaran has been extremely helpful and responsive, since he's been assigned to manager our Agency's account.   Past experiences were not great at all, but he's more than made up for it and his responsiveness is appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil Hohl",
          "Nb_Reviews": 2,
          "Date": "2022-07-14T18:34:49.000Z",
          "Titre": "Issues with Integration",
          "Contenu": "Had issues with integration of our fuel cards and with the help of our account manager and the development team they were able to get the integration completed and works exactly as wanted and was told it would work.  Great team to work with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T14:44:24.000Z",
          "Titre": "8 years and counting...",
          "Contenu": "We have been using GPS Trackit for 8 years now... and we are extremely happy.. The system is great and the help we receive from system going down on our end to resetting the tracking in our vehicles to just questions... the staff is fantastic.. here's to 8 more years, and beyond. Thank you GPS Trackit!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 1,
          "Date": "2015-02-16T20:49:52.000Z",
          "Titre": "Love this service...I have used others and this is the best.",
          "Contenu": "The customer service is the best.  I have used other tracking services and they did not seem to care about me as a customer.  I could never get a hold of anyone.  At gpstrackit I always speak to a live person who takes care of me right away.  Luckily it's rare that I ever have to call but when I have I am not disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 3,
          "Date": "2023-07-14T14:54:47.000Z",
          "Titre": "Savannah did an Excellent Training",
          "Contenu": "Savannah did an Excellent Training, answering all of my questions, and some that I didn't know I had!I am now beginning to feel more comfortable with this system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phillip",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T21:11:45.000Z",
          "Titre": "Camilo did a great job",
          "Contenu": "Camilo did a great job! He took his time and demonstrated examples of each feature in the system for our customer. Well done. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T15:53:19.000Z",
          "Titre": "Really a great piece of software and a…",
          "Contenu": "Really a great piece of software and a great team of people. You just do not get this level of customer service and product reliability and product functionality anymore. How refreshing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JUDY K",
          "Nb_Reviews": 2,
          "Date": "2022-07-26T19:55:14.000Z",
          "Titre": "Great Company!",
          "Contenu": "We have been using GPS Trackit for several years and have been very pleased with their products and service.   We use their GPS units and cameras. They have excellent customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T19:39:07.000Z",
          "Titre": "Training - GPS Trackit",
          "Contenu": "Savannah was knowledgeable of the GPSTrackit Program. She was on time, patient, and kind. Savannah provided pertinent answers and explained the system thoroughly. I am more comfortable using GPS Trackit. Thank you very much, Savannah."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Sweigart",
          "Nb_Reviews": 1,
          "Date": "2016-04-19T17:02:50.000Z",
          "Titre": "Excellence in truck tracking!",
          "Contenu": "We are a mid size company, and GPS Trackit has helped us to implement cast saving measures with the easy to create and use reports. the Tracking software is very reliable and we have tested out the accuracy of the locator. The staff is very knowledgeable and will train you on any part that you would be unfamiliar with. I would recommend this company to anyone looking to increase profitability and decrease downtime."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Jackson",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T18:28:59.000Z",
          "Titre": "A welcome exception",
          "Contenu": "I deal with the tech industry quite a bit due to my role at our company and I have to say most of my experiences are less than stellar.  In particular, I avoid tech support from most of our vendors unless there's absolutely no way I can address the issue myself.  Most of the time, I can solve my own problem quicker than I can drill through the layers of lower tier screeners.All that in the way of background.   So far, your company has been far better.  I've had occasion to talk with your tech folks several times.  Short or no wait times, call backs when they say they will (not normal), and quick solutions.  We have one potential hardware issue, but it's being worked actively. The software seems easy to use and was not difficult to get basically set up.  I was especially pleased to see that all the devices we ordered were pre-loaded and by using VIN lookup, I had to do very little in the way of configuration.  Not what I expected!I complain loudly about the generally poor tech support/service I run into all the time so I figured I should say something when it exceeds  expectations.Keep it up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T00:30:45.000Z",
          "Titre": "Trainer was knowledgeable and spoke…",
          "Contenu": "Trainer was knowledgeable and spoke clearly. She reminded us that they were there for anything we needed on Care."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alicia Lindsey",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T21:23:14.000Z",
          "Titre": "Zoom training for GPS Trackit",
          "Contenu": "The zoom training for the GPS Trackit was very informative. The admin answered all questions and went through every page on the dashboard. This is a wonderful program!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T15:07:33.000Z",
          "Titre": "I've just received training on how to…",
          "Contenu": "I've just received training on how to operate my system in my fleet and it was truly amazing. The representative took her time in explaining everything I needed to know in detail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Chappel",
          "Nb_Reviews": 1,
          "Date": "2016-06-24T22:20:49.000Z",
          "Titre": "Five Star Service!",
          "Contenu": "This day in age, it seems that great customer service is harder and harder to find.  Heck, even good customer service has taken a back seat to the need to add Quantity to the Rolodex, instead of quality.  This is not the case with the GPS Track It team.  From the day our company sat down for a demo of the extensive products and services offered, GPS Track It has been quick to answer our questions, been attentive to our needs and adjustments, and amazingly quick to respond to emails and calls when the occasional issue does arise, usually due to human error on our side.  We signed on with them a little over 6 months ago, and couldn't be happier!  We have a fleet of just under 100 trucks, in 6 different states, so the tracking of each truck, and new E-Log monitoring of every driver can be difficult.  GPS Track It makes it a breeze.  Anyone looking for GPS Service needs to check into GPS Track It.  My company has been with 3 different GPS providers over the course of the past several years, and none have compared to the service that GPS Track It has provided.  Do yourself a favor, and look into them, you'll be glad you did."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dee Slaght",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T14:46:04.000Z",
          "Titre": "The training was very informative.",
          "Contenu": "The training was very informative. The training video's are so nice, and knowing that I can go back and review if I have questions.  Thank you for the excellent training."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seth",
          "Nb_Reviews": 1,
          "Date": "2022-05-20T19:04:08.000Z",
          "Titre": "Attentive Staff",
          "Contenu": "Jennifer, Isabella and the other folks I've worked with have been great and helpful, they are quick to respond and help us try to get what we need out of a tracking service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T15:47:50.000Z",
          "Titre": "Very Informative! Must take this training.",
          "Contenu": "How to use your software, was explained to our company needs.  Savannah was a great instructor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fleet Admin",
          "Nb_Reviews": 2,
          "Date": "2022-10-06T19:52:52.000Z",
          "Titre": "Extremely Responsive Account Manager",
          "Contenu": "Daniel has been very helpful and responsive to ensuring that our Agency has the upgraded gps units needed.  His assistance has been greatly appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Tumblety",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T20:25:31.000Z",
          "Titre": "Luke Tillisch has been great!",
          "Contenu": "Luke Tillisch has been absolutely phenomenal. I was ready to be done working with you folks... he listened and addressed the issues. He is prompt and does what he says. Great team member you got there!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T21:09:40.000Z",
          "Titre": "Informative training",
          "Contenu": "Informative training. The software is very user friendly. Reports are easy to generate and tracking is made easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse Flood",
          "Nb_Reviews": 1,
          "Date": "2016-04-18T17:50:12.000Z",
          "Titre": "Awesome service",
          "Contenu": "The service I received was on point every time. All my questions were answered with incredible efficiency and accuracy. I believe I have the information and understanding to complete most any task within the 3 programs we use. A++ rating for the customer service and company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delani Stacks",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T18:32:59.000Z",
          "Titre": "My account manager Isabella is the BEST!",
          "Contenu": "My account manager Isabella has made me love this company, she is so responsive, always figures out an answer to my questions, and is such a joy to talk to and work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T21:14:21.000Z",
          "Titre": "The trainer was very helpful",
          "Contenu": "The trainer was very helpful, had a great attitude, and she made sure I understood anything she was explaining. Answered all my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristina",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T01:14:30.000Z",
          "Titre": "Great presentation",
          "Contenu": "The topics covered were applicable to functions I need. The pace was good - not to fast, but not dragging. Very informative and easy to follow"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad Katemann",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T23:04:42.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Jennifer Walden has provided timely, professional and thorough customer service to help us upgrade our cameras & provide a future roadmap. Impressed so far and excited to continue working with GPS Trackit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pam Randall-County of Modoc",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T21:46:46.000Z",
          "Titre": "I learned far more than we had even…",
          "Contenu": "I learned far more than we had even planned on using the devices for.  It was a great experience.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T20:42:11.000Z",
          "Titre": "What a platform and such a great…",
          "Contenu": "What a platform and such a great teacherY'alls platform is so complete! The teacher was so knowledgeable and friendly it just made the session a ton of fun!Thank you!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rick",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T01:58:03.000Z",
          "Titre": "needed help and got it",
          "Contenu": "I'm new here and everyone has been so very helpful. I can call in and ask for help and get it without fail.  nice, easy to talk to people that really want to help. They walk me through the steps to get the help I need and explain to me in a way that doesn't make me feel crazy for calling in and asking in the first place. So glad I made the switch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan M",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T15:11:58.000Z",
          "Titre": "Extremely Helpful",
          "Contenu": "Today’s call was extremely helpful as it covered all bases. I wanted to focus on the intial set up of everything and my trainer made sure that happened."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Britney Hafen",
          "Nb_Reviews": 1,
          "Date": "2016-04-05T17:32:35.000Z",
          "Titre": "Awesome Customer Service",
          "Contenu": "I love the customer service here. They are easy to work with and get things done quickly. Always willing to help even if it is just a little questions. They have great people in their customer service! Everything runs smoothly and I hardly ever have any problems. They make it simple for me to understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T22:13:39.000Z",
          "Titre": "I enjoyed the overview",
          "Contenu": "I enjoyed the overview. I have limited access to the program, but will review the recorded version of overview. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AllSeason Solar",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T21:31:46.000Z",
          "Titre": "Savannah was very helpful answering our…",
          "Contenu": "Savannah was very helpful answering our questions and helping us get in touch with the correct people"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JPSI",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T16:28:24.000Z",
          "Titre": "Our company has used GPS Trackit for a…",
          "Contenu": "Our company has used GPS Trackit for a couple years now and we love it!  Most recently, a vehicle was stolen and we were able to locate and retrieve it right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer  Donnal Armstrong",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T18:01:39.000Z",
          "Titre": "GPS TRACKING",
          "Contenu": "This is one of the best programs I have ever used. it's great for any Company that has a fleet of trucks.from Maintenance to registration the training is great and easy to learn."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T22:29:20.000Z",
          "Titre": "Training via Zoom Today",
          "Contenu": "Zoom Training The training zoom meeting was very helpful. It looks as though the software will be simple to navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Krista",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T20:30:52.000Z",
          "Titre": "Well done",
          "Contenu": "These classes are always helpful and thorough. I feel as though the instructors are always happy to help and knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monique Batteast",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T22:33:49.000Z",
          "Titre": "So far was easy..I stayed for the main…",
          "Contenu": "So far was easy..I stayed for the main focused that I needed to know..then I got off but when I needed an answer she responded fast.. she was on point as always..ty for the teaching  a beginner like me. 5 🌟  stars"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margie Boone",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T20:38:39.000Z",
          "Titre": "Live experience",
          "Contenu": "What was beneficial to me was the fact that I could watch what was being done instead of just listening."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wade Shaffer",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T15:04:06.000Z",
          "Titre": "Very in depth!",
          "Contenu": "Very in depth on items that most don't take the time to explain. It says a lot when you take the extra step to explain your product. The way that they were talking you could tell that they really believe in their product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina Wrzesinski",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T01:13:24.000Z",
          "Titre": "The presenter offerred to send me a…",
          "Contenu": "The presenter offerred to send me a recap video so I can replay things and get better acquainted with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Hayes",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T19:28:30.000Z",
          "Titre": "Great experience",
          "Contenu": "This was an awesome presentation that helped me learn alot about the GPS Trackit system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T16:36:33.000Z",
          "Titre": "The teacher was attentive and patient",
          "Contenu": "The teacher was attentive and patient.  She described things well and made sure things were understood."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T23:33:41.000Z",
          "Titre": "Thorough and Easy to Understand",
          "Contenu": "Everything was very thoroughly explained and in an accessible manor. I liked the bit of humor that was thrown in, as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabriella Angel",
          "Nb_Reviews": 2,
          "Date": "2022-06-30T17:33:53.000Z",
          "Titre": "Daniel Baza was amazing",
          "Contenu": "Daniel Baza was amazing, very patient, informative, he went above and beyond in educating me on dashcam, and some features on the software as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Coronado Mfg",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T22:24:24.000Z",
          "Titre": "Excellent presentation",
          "Contenu": "Webinar host did a great job of presenting the information in very easy to follow format."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Davies",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T17:16:43.000Z",
          "Titre": "Savannah was very knowledgeable and…",
          "Contenu": "Savannah was very knowledgeable and helpful. She answered all of our questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-13T21:32:58.000Z",
          "Titre": "They are there to answer any questions",
          "Contenu": "They are there to answer any questions. So far my experience has been great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K Nowlin",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T01:52:25.000Z",
          "Titre": "Very easy to use system and for the…",
          "Contenu": "Very easy to use system and for the price you get way more than expected. Great all-around service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T15:31:41.000Z",
          "Titre": "Very great service",
          "Contenu": "Very great service, everything was explained in very good details. The people are really nice and patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T18:38:40.000Z",
          "Titre": "Fast to respond they resolve issues…",
          "Contenu": "Fast to respond they resolve issues quickly good service with the products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beverly B.",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T22:29:46.000Z",
          "Titre": "Very easy to follow as she explained…",
          "Contenu": "Very easy to follow as she explained things."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T14:05:47.000Z",
          "Titre": "great information being presented and…",
          "Contenu": "great information being presented and questions were answered quickly and in full detail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trifecta Landscaping",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T17:16:59.000Z",
          "Titre": "Great job, very helpful!",
          "Contenu": "Great learning course. In-depth, feature-focused on company needs. Savannah made a very extensive software seem so easy to navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Koon",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T21:02:07.000Z",
          "Titre": "First ELD Training with GPSTrackIT",
          "Contenu": "My experience was super and helpful  Super company and super support team and glad my company uses your products"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Angie",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T23:23:29.000Z",
          "Titre": "Top-Rated Customer Service",
          "Contenu": "The best Fleet management solution with the highest customer service levels!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Loisi",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T20:27:43.000Z",
          "Titre": "Eric was great explaining everything",
          "Contenu": "Eric was great explaining everything. Very thorough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "American midwest Towing and Se",
          "Nb_Reviews": 2,
          "Date": "2022-05-11T17:02:53.000Z",
          "Titre": "Savana was very informative and nice as…",
          "Contenu": "Savana was very informative and nice as well as patient. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reginald Ward",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T20:33:58.000Z",
          "Titre": "It was a really good class of…",
          "Contenu": "It was a really good class of everything she made it really simple an easy to understand"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pleshette Sturtevant",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T21:49:38.000Z",
          "Titre": "Extremely informative",
          "Contenu": "Extremely informative. Really wanted it to last longer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T18:12:49.000Z",
          "Titre": "Trainer was very informative and…",
          "Contenu": "Trainer was very informative and answered all questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T16:07:34.000Z",
          "Titre": "Savannah answered all of our questions…",
          "Contenu": "Savannah answered all of our questions and was incredibly helpful and thorough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allison",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T00:17:59.000Z",
          "Titre": "Online Training",
          "Contenu": "Online training was very beneficial and informative.Savannah was very thorough so few questions were needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Bracken",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T22:04:43.000Z",
          "Titre": "Sean in tech support is spot on…",
          "Contenu": "Sean in tech support is spot on awesome!!!! Always helps me out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mona Pierro",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T14:26:17.000Z",
          "Titre": "Team members were very quick with…",
          "Contenu": "Team members were very quick with responses and very helpful.  Thank you very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T21:14:58.000Z",
          "Titre": "very good training",
          "Contenu": "very good training.  Easy to understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "E&A Trucking inc.",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T17:02:21.000Z",
          "Titre": "Good and politee service. Excelent presentation all steps for using ELD.",
          "Contenu": "Good and polite service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil Hohl",
          "Nb_Reviews": 2,
          "Date": "2022-08-16T21:14:33.000Z",
          "Titre": "Very understandable",
          "Contenu": "Very understandable. Easy to follow along."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T17:53:49.000Z",
          "Titre": "Director of Human Resources",
          "Contenu": "Presentation was well done"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Cahelo",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T17:35:09.000Z",
          "Titre": "Lots of great information- thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T01:10:20.000Z",
          "Titre": "Facilitator was very knowledgeable and…",
          "Contenu": "Facilitator was very knowledgeable and professional. Easy to talk to and made this experience wonderful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley Smith",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T11:16:50.000Z",
          "Titre": "The class was thorough and informative"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Harris",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T02:11:15.000Z",
          "Titre": "Process has been great  so far",
          "Contenu": "Process has been great  so far. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trademark Exteriors",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T23:57:24.000Z",
          "Titre": "awesome job guys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T17:16:21.000Z",
          "Titre": "Great response time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Bergstresser",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T01:07:45.000Z",
          "Titre": "Knowledge of trainer"
        }
      ]
    }
  ]
}