{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "gunnar.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Igor",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T01:08:24.000Z",
          "Titre": "The product itself is great! However...",
          "Contenu": "The product itself is great. This is my second eyeglasses from GUNNAR. I trust this company because I can see only these glasses reflect so much blue light.The first eyeglasses I bought more than a year ago and I had no single issue with it. The one star is for not perfect company's business processes: 1) I received my eyeglasses today with the AMBER 75% blocking blue light lenses, but I ordered AMBER MAX 98%. 2) In order tracking I was asked to upload three photos for PD, which was not necessary in the end."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:07:00.000Z",
          "Titre": "Your sales are misleading if you say a…",
          "Contenu": "Your sales are misleading if you say a pair of glasses is in the $20 bucket than that is what it should be.  I canceled my entire order because I feel you mislead customers.  You might as well be used car salesman your company lacks integrity by mis advertising.  How can anyone trust your products when you mislead people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ren Caballero",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:55:09.000Z",
          "Titre": "Wrong tint and the right eye has the…",
          "Contenu": "Wrong tint and the right eye has the wrong prescription. I can't use the glasses provided and I want my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean M",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T00:46:09.000Z",
          "Titre": "Mysterious byzantine shipping calculations",
          "Contenu": "I had to back up step-by-step through the purchase process, then step back through it SEVERAL times in order to understand why my shipping was sometimes free and sometimes not.  Shipping costs should be clearly explained, instead of the sale process requiring the customer to experiment and gather data in order to understand those costs.  Worst purchase experience I've recently had to endure."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa Burt",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:16:55.000Z",
          "Titre": "Where is my order and where is the…",
          "Contenu": "Where is my order and where is the email confirming my order?  I was charged on my credit card but no follow up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katelynn Collatt",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:29:24.000Z",
          "Titre": "Never came and no one is emailing me…",
          "Contenu": "Never came and no one is emailing me back"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T02:20:46.000Z",
          "Titre": "Almost $100 total shipping costs",
          "Contenu": "The glasses are good, but in total it was just under $100 in charges to have 1 single pair of glasses delivered to my house. On top of that, they actually try to get you to pay \"insurance\" the guarantee their triple boxed glasses will arrive safely. As if that's not already expected.Good product, absolutely abusive shipping charges. Would not recommend unless you can buy them in store. They also like to spam your inbox if you have any communication with them, but that was easily fixed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffery Fletcher",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T00:05:32.000Z",
          "Titre": "I was quoted 3-4 day delivery and it’ll…",
          "Contenu": "I was quoted 3-4 day delivery and it’ll be 8 days by the time they arrive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Thrush",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T03:00:28.000Z",
          "Titre": "No Communication No Customer Support",
          "Contenu": "No communication during the order process from start to finish. Asked at end of week three for a status update. Next day the status changes to completed and shipped, I get a tracking email. I have received the glasses and I have been trying to get a frame change because they're prescription and can only get a frame change. I have been waiting for a total of six weeks for a reply from their non-existent customer service. I have submitted two requests and no communication. The reason for my frame exchange request is how severe the curve of the lens/frames are. Don't even get me started on how thin, absolutely thin the frames are."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Andre",
          "Nb_Reviews": 1,
          "Date": "2022-04-23T20:18:12.490Z",
          "Titre": "Worst customer service ever",
          "Contenu": "Worst customer service ever, hands down! First wrong glasses were delivered, then they provided me with RMA, but there was no export invoice attached, and it was stopped by Fedex. Despite multiple emails and chat, nothing was done, no response from customer service. Now I am stuck without glasses. I cannot remember dealing with any worse company than this one"
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Seigmenn",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T23:36:58.000Z",
          "Titre": "Terrible support, use's paywall.",
          "Contenu": "Terrible mailing support service. Locked their MW2 code behind a 60$ Paywall and told me there was no other way to acquire it besides cashing out. while scalpers resell them for 30-45$ online. Other companies like Kontrol Freek have no problems giving theirs out, not locking it behind some paywall. This gave me the incentive to buy their products afterwards just because of their hospitality."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "oscaromarjp",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T16:48:49.000Z",
          "Titre": "You offered me a good discount and then…",
          "Contenu": "You offered me a good discount and then it was a regular 20% off discount you give to everyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Parrott",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T22:04:47.000Z",
          "Titre": "From initial order to shipping…",
          "Contenu": "From initial order to shipping notification took over a month. That is beyond poor. Since I needed glasses fairly asap, I ordered from another vendor and had them in a WEEK. My inquires were met by some scripted process babble from support. I know BS when I hear it, because I do it myself at work. Hopefully, when the glasses arrive they will change my life and the wait was well worth it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christy Chan",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T01:42:03.000Z",
          "Titre": "I ordered the non-prescription glasses",
          "Contenu": "I ordered the non-prescription glasses. Yet I received a pair that has magnification.  This gives me headaches.... I already wear contacts and have 20/20 vision.  The undesired magnification makes the glasses useless / non functional for me.  I have not heard back from the company on how they will replace the glasses with the ones I actually ordered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AJS",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T17:52:19.000Z",
          "Titre": "No Customer Service",
          "Contenu": "No Customer ServiceI was emailed a 20% off discount for a first time customer.It didn't work.I emailed and called Gunnar and got absolutely no response.I was able to find a 15% off coupon online.At that point I was so frustrated I bought the cheapest pair they offered.Had it worked as they described or had somebody from the company contacted me to sort it out, I would've bought more expensive glasses and, perhaps, gotten two pairs.Their loss.Hopefully it's my gain.We'll see.I'm not feeling terribly confident."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael De",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T18:55:50.000Z",
          "Titre": "I received a pair that were slightly…",
          "Contenu": "I received a pair that were slightly bent. After reaching out to 2 representatives and submitting a warranty claim. I have yet to get a solid response or the next steps to receiving a replacement pair. The best i’ve gotten so far was to put the frames under warm water and bend them. It’s been since Dec 23 from my first email. It’s now Jan 11"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Paul",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T16:58:53.000Z",
          "Titre": "Didn’t respond to message about…",
          "Contenu": "Didn’t respond to message about canceling order.  Sent order anyways.  When I returned order it took multiple emails.  Then charged me return fees.Return fees are from the 1990’s.  Lame customer service and poor processes."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Vlad Risevets",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T19:32:08.000Z",
          "Titre": "Unable to contact FEDEX shipping",
          "Contenu": "Unable to contact FEDEX shipping. They did not send me the necessary documents and do not respond. It is also impossible to enter your profile on their website. A very negative experience and the distance that it happened, the package is in the country, but I can’t get it because of such a service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "theodore scriber",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T15:32:55.000Z",
          "Titre": "Was supposed to get 20% off purchase…",
          "Contenu": "Was supposed to get 20% off purchase from an email. I didn't get it, asked Customer Service. Gave me some run around that my purchase wasn't eligible. Asked where does it say that in the offer. Didn't get a response after that second question. I will return when I receive them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Li Yang",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T18:22:17.000Z",
          "Titre": "I don't need 10 emails telling me I…",
          "Contenu": "I don't need 10 emails telling me I have an order coming, on the way, telling me I have something in the cart after I have ordered. Just let me order once, send the confirmation email with the tracking information and be done with it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Alt",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T23:51:52.000Z",
          "Titre": "Never received two pair of blue light glasses…",
          "Contenu": "Ordered two pair of blue light glasses for eye strain.  Order never arrived even though tracking info said delivered.  Delivery info on tracking label had the wrong City in the address.   I contacted support and explained the situation, and confirmed the address I provided was infact correct and differed from the address they put on the shipping label.  Despite this error on their end,  Terry Albea of support refused to help, told me to file a claim with USPS and that I should have purchased insurance.  This was $150 order, so not a small amount.  Better luck next time I guess. Hopefully the credit card will refund as the company has refused.  I am filing a chargeback.    BUYER BEWARE.re:  Terry's response should tell you everything you need to know.  The order was lost or delivered to the incorrect address.  This company is in the business of shipping goods to customers who purchased.  They will take no responsibility for lost or missing deliveries.  You have been warned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T05:09:16.000Z",
          "Titre": "Received glasses that look nothing like…",
          "Contenu": "Received glasses that look nothing like the website pictures We’re supposed to have an anti reflective coating on both sides, has the opposite, both sides are blue and reflective"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JeffB.",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T01:34:27.000Z",
          "Titre": "I used to recommend these glasses to everyone, but no more after this year",
          "Contenu": "There was very little communication about my order. Support gave me the “within our processing window” excuse for why it took over a month for my glasses to eve ship from ordering. There was no online status updates besides unfulfilled. An now my glasses will not be here until almost 6 weeks after I made the order. I have ordered Gunnar prescription glasses for around a decade now and the process’s has never been this bad. Where I normally ordered them, with my optometrist, stopped carrying Gunnar after being a fan of them due to the horrible business support and extreme lag time between order and fulfillment of prescription glasses. I have loved Gunnar glasses and recommended them to anyone I know but have since stopped recommending them and will probably not order from Gunnar again because of the poor response on these."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jimmy",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T16:52:32.000Z",
          "Titre": "When it came to ordering Gunnar’s",
          "Contenu": "When it came to ordering Gunnar’s, it was not what I expected. I went through the prescription glasses and chose a style/frames I liked and wanted. But after waiting a few days and uploading my prescription, I received an email that my choice was not appropriate for my prescription. I was given an excel sheet to choose an appropriate frame and out of the five listed for my prescription, only two were actually available on the site. I do not understand how my options were extremely limited when there was not a disclaimer to notify me of specific prescriptions per frame/style. Otherwise, I would not have bothered to attempt to purchase from Gunnar Optiks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordon",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T01:49:00.000Z",
          "Titre": "Only received half my order",
          "Contenu": "I only received half my order but on the tracking it said delivered.  I used to get my gunnar glasses from Amazon but tried buying from the website instead.  Big mistake on my part, apparently."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bradley Wheeler",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T15:31:31.000Z",
          "Titre": "It’s hard to say what went right",
          "Contenu": "It’s hard to say what went right. Gunner lost my order. I had to remind them that I had already paid and they should also give me some glasses. The additional gift that was sent was not prescription, which makes no sense if the rest of your order is prescription.  Almost a month later and I’m still waiting to receive the glasses that I had to work directly with support to have sent.  The support folks are OK though.   It’s  the only good part of this experience."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Alexandra Vaynshteyn",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T10:31:16.000Z",
          "Titre": "worse experience ever",
          "Contenu": "I have no words to describe how unsatisfied I am with your service! It was the last time that I have ordered from you and I am going to make sure that no Israeli ever will buy from you ever again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Schiltz Matthew",
          "Nb_Reviews": 2,
          "Date": "2023-06-09T07:37:28.000Z",
          "Titre": "Not Worth the Expense or the plastic",
          "Contenu": "Poorly explained features had me end up with a magnification on my glasses that caused me discomfort and vision issues. They have yet to issue my refund."
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Aa",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T22:56:14.000Z",
          "Titre": "It said that the shipping would have no…",
          "Contenu": "It said that the shipping would have no taxes, but they were half the price of the glasses."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vlad Gavrila",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T22:05:10.000Z",
          "Titre": "RMA is not resposive!",
          "Contenu": "Ordered online 2 pairs, received my order in a couple of days. Decided they do not fit my needs and asked for a return. Someone reached out to confirm if I want to return both pairs. Replied to the email to confirm and nobody ever got back to me (followed up every few days with no response) - even opened a new ticket and still no response!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dustin Logston",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T01:30:19.000Z",
          "Titre": "Frames feel cheap",
          "Contenu": "Took longer than expected. Got them for $200 glasses they are not good quality. I had higher expectations for them and I was completely let down. I feel like I’m going to break them. Tried to reach back out to exchange them but never heard a word from them, they sit on the face weirdly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jaime Pocasangre",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T15:25:42.000Z",
          "Titre": "The did not get my prescription right, NOT EVEN CLOSE!",
          "Contenu": "The did not get my prescription right. Not even close!!!!!! It has been 2 months since I ordered my glasses and I still have not got them back. It took one month to receive the wrong pair, a week to get any hep from them and we’re going on 3 weeks since I sent them in to fix the issue and still last I checked they hand even started to make the new pair, they had received them but not started the replacement. I will not purchase from them ever again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stanley McCracken",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T19:13:32.000Z",
          "Titre": "I ordered glasses that were supposed to…",
          "Contenu": "I ordered glasses that were supposed to be clear lenses. They have a shade to them so whenever I put them on and look at something that is supposed to be white it looks a shade of yellow or brown."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dante Ferrer",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T17:02:42.000Z",
          "Titre": "ORDER #3164 / False Advertising",
          "Contenu": "ORDER #3164I did not have a great experience today because I submitted the request with my info to join in the GUNNAR website and I was sent the “Welcome Code” to use on my first order. However, when I tried to use the code… the system would NOT recognize the code. I tried multiple times with no success. After I moved forward with the order, I wrote an email to GUNNAR Support. At this time, I have not received a response. My email stated the following:“GUNNAR Rep - I am wringing because I tried to use the code listed in the Welcome email below but the system/website would not recognize the code listed below (WELCOME20NP). I did process my order since I did not want to miss the purchase of there 2 glasses I'd like to request help with using this % off code. Thank you,.: DF ”I would love to hear how I can be reimbursed for the system not recognizing the code GUNNAR sent me. I feel this is false advertising to lure customers to your website by providing a discount code and then forcing them to pay full price."
        },
        {
          "Note": 1,
          "Lieu": "CR",
          "Pseudo": "Carlos Villalta Figueroa",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T19:24:04.000Z",
          "Titre": "You pretty much cut contact with me up…",
          "Contenu": "You pretty much cut contact with me up to the point you sent the package, which delayed me being able to let the courier company know that the shipment was coming, you also sent me two shipping tracking numbers and only one of those worked."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Engerman",
          "Nb_Reviews": 2,
          "Date": "2023-03-03T17:09:23.000Z",
          "Titre": "My computer glasses were over…",
          "Contenu": "My computer glasses were over compensated and are unusable. It is taking forever to get resolved and I would just like a refund now"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kyle Howard",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T22:44:46.000Z",
          "Titre": "Address misunderstanding",
          "Contenu": "I had my correct address and after a few weeks I was emailed saying you guys couldn't send my order until I had a building number even though I gave you a building number in the first place."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "H.S.",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T00:18:15.000Z",
          "Titre": "Coming in a week later then expected…",
          "Contenu": "Coming in a week later then expected and not even offered expedited shipping or discount or anything. Terrible."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Itamar",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T18:02:49.000Z",
          "Titre": "Terrible experience - don’t recommend",
          "Contenu": "Unhelpful customer service with terrible attitude and no desire to assist.Conflicting statements between the service reps and the guidelines on the website regarding shipping times, CS says 2-4 weeks typically, website’s shipping page says up to 10 days typically.Awful turnaround times for prescription orders, promos that don’t work and require you to contact CS to have a special one granted to you, and the absolute worst:After a long conversation with customer service who blatantly tells me that I’m wrong in stating that they are delayed in my order (which is more than correct according to their website), I state everything that was wrong on their side and she ends up wishing me a good day.As a customer of years with more than several pairs of glasses, including my family, I can say with confidence that after an experience like this I won’t be buying from them any more."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "blaiser",
          "Nb_Reviews": 2,
          "Date": "2023-02-23T21:57:05.000Z",
          "Titre": "Everything that could possibly go wrong…",
          "Contenu": "Everything that could possibly go wrong did and continues.  The website says BOGO on Black Friday and it only purchased 1 pair. i had to call back for the second pair.  I bought clear lenses and you shipped amber. Support told me they don't have clear only amber and the website is wrong.  i tried to send back and was told they do have clear they were wrong and will ship clear. they shipped amber. I tried to return and had to call for weeks to get someone to respond, nobody every picks up the phone or returns calls. I was told to send them back and they will update and call. that was 3 weeks ago and still no tickets, emails, nor response. It has been over 3 months now and i still can't get my new glasses and have to wear my old broken gunnar pair.Response:  If every effort was made in a timely response, why has it taken 3 months and i still don't have glasses?  Why does your homepage sell \"Clear\" glasses with the description \"Clear GBLF 35 -For discreet protection without the amber tint\" then after you purchase explain to me \"the clear lenses have an amber tint?\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick Wood",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T17:57:09.000Z",
          "Titre": "Paid for father shipping just shipped…",
          "Contenu": "Paid for father shipping just shipped yesterday, won't get it before Christmas"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Madeleine Palmer",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T03:57:45.000Z",
          "Titre": "I paid for express shipping and it’s…",
          "Contenu": "I paid for express shipping and it’s not going to be delivered in time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Miguel Serrano",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T21:36:25.000Z",
          "Titre": "This is the 3rd pair I have ordered",
          "Contenu": "This is the 3rd pair I have ordered. I used a 15 percent off coupon this time.  Then the next day instagram has a 20 percent off coupon ..  I’m sad 😢"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mario Sanchez",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T20:37:04.000Z",
          "Titre": "Super very bad",
          "Contenu": "Bad, I paid for 2 day shipping and it has been a week. I have not been reimbursed either…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Freshwater",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T23:31:40.000Z",
          "Titre": "f*** you",
          "Contenu": "I will never use this company they love to spam all-day total joke"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "N/A",
          "Nb_Reviews": 2,
          "Date": "2023-01-24T18:13:36.000Z",
          "Titre": "Unfortunately I received the incorrect…",
          "Contenu": "Unfortunately I received the incorrect lenses and the tracking information on my order was received “after” I had already received the incorrect order…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cassandra Much",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T21:30:12.000Z",
          "Titre": "When my purchase was auto refunded",
          "Contenu": "When my purchase was auto refunded, there was no indication as to what the reason was. I had sent in about 3 or 4 inquiries to get an answer. I also wish that there was some indication as to the max prescription strength permitted for these types of orders. It would have saved me so much time when I was in the selection process."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jeanette cordova",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T16:02:55.000Z",
          "Titre": "Sorry I ever did",
          "Contenu": "Sorry I ever did. Do your homework before purchasing compare them to game advantage and you will look away . These glasses don't serve much purpose. I canceled almost instantly paid 15 dollars for fast delivery.  Got a text saying 4 to 6 weeks gamer advantage  2 day delivery tor 3$"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T19:11:58.000Z",
          "Titre": "Only part of my order was filled",
          "Contenu": "Only part of my order was filled. I was told the shirt wasnt in stock when it was listed for sale online. I sent an email that wasnt responded to for weeks and followed up with a voicemail that also wasnt responded to. When I finally got in contact, my fair request was not granted. Disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T12:55:44.000Z",
          "Titre": "I received them in the mail with a scratched lens",
          "Contenu": "I received them in the mail with a scratch on the left lens. It’s really small but very noticeable when I am playing competitiveFPS games. I called support and left a voicemail including my order number and still haven’t gotten a response. It’s been over 2 weeks….."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2021-08-22T03:23:00.000Z",
          "Titre": "Too many issues to mention",
          "Contenu": "No spring, distracting logo etched to lens to start. The real reason I can't use these is: A blue glare on the insides of the lens. No matter how I wear them, when I look at any light source it creates a blue halo effect inside the lenses. I find this ironic, since they are supposed to filter blue light. I have 3 other pair of similar glasses and none of them have this effect. And they all cost 1/10 the price."
        },
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "Pavle Nikolic",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T14:39:00.000Z",
          "Titre": "Just bunch of issues with glasses.",
          "Contenu": "Just bunch of issues with glasses.Blurriness, feeling sick while and after using them.Smokey effect on them, I guess because of wearing headsets, even thoe they are made for em.All in all, in my personal experience, overall really bad pair of glasses, but a lot of people do love them, so I am assuming it’s something to do with me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "XL",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T05:31:21.000Z",
          "Titre": "Worst customer experience",
          "Contenu": "Do not buy from here unless you know how to fill in a glasses prescription form and send it \"properly\". There is no directions whatsoever and after countless emails and replies with links to the help center, which is where i got the email from, it kept sending me back to the same place. To bad i had to learn by wasting $300 with nothing even being delivered. That's right i still don't have my glasses after a month in a half. I don't even want them anymore, i just want a refund, and even fighting for that is hard."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ADAM NOLAN",
          "Nb_Reviews": 1,
          "Date": "2021-06-25T17:09:37.000Z",
          "Titre": "Defective glasses and radio silence.",
          "Contenu": "I received defective glasses, and they have ignored all of my communications. Be careful, if anything is wrong with your order they will just ignore you and keep your money.UPDATE: they replied here saying they would get in touch 'ASAP'. That was a lie, they care about their image enough to reply to reviews but not actually fix the issue."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ryan Burke",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T17:57:26.000Z",
          "Titre": "Shipping did not arrive as expected and…",
          "Contenu": "Shipping did not arrive as expected and the fees added on upon delivery were not properly communicated.  Also Gunnar used their own contact center phone number instead of my contact number so FedEx couldn't call me to inform me of the charges.  100% dissatisfaction and I'm contemplating getting a refund. Not a happy customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brenda Melendez",
          "Nb_Reviews": 1,
          "Date": "2021-10-21T18:02:54.000Z",
          "Titre": "Very bad customer service!",
          "Contenu": "First of all, I never received an email with my order confirmation or with the tracking number after it was shipped! Second of all, I emailed them about canceling my order (since I didn’t receive anything, and I found it cheaper someplace else), and they never replied back! Very dissatisfied!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wish to remain anonymous.",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T21:04:30.000Z",
          "Titre": "I found your website very difficult to…",
          "Contenu": "I found your website very difficult to navigate.  Called for help and the person I spoke with had trouble getting us on the same page.  I finally took a chance and ordered some glasses that I hope work out well.  I even left a phone message to be called back.  That didn't even happen! Bad experience for me.  My order isn't here yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dissatisfied customer",
          "Nb_Reviews": 3,
          "Date": "2021-03-11T21:07:29.000Z",
          "Titre": "Terrible customer service & haven't received purchase",
          "Contenu": "I've called, emailed, & left several messages on customer service's voicemail. There's no one returning my inquiries. I ordered my glasses on 2/16/21 & still haven't received the glasses. Nor has anyone responded to me. I'm filing a complaint to my bank & with whomever necessary? In order to get my refund as it's become obvious at this point, I am not getting the glasses?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "very frustrated return buyer",
          "Nb_Reviews": 1,
          "Date": "2021-03-04T17:51:11.000Z",
          "Titre": "Order never showed up, no one answers phone or calls back ++",
          "Contenu": "Order never showed up... called 4 times and had to leave message before someone called me back.  Then shipped the wrong item.  I have already left 2 messages to return the item and get the correct item and no one has called me back.The only good employee there is KENNY in terms of customer service.  This is the last order I will place with them and I've bought several glasses throughout the years."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "rm",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T23:38:39.000Z",
          "Titre": "I sent two frames in to have new rx…",
          "Contenu": "I sent two frames in to have new rx lenses installed.  identical (though different vintage) gunnar frames.  I paid for one and followed up immediately with an email to arrange to pay for the second since that wasn't an option on the website.  Weeks and weeks of waiting a week at a time to get a reply from support only to have glasses that are the wrong lens color and so hyper-reflective that I cannot see through them for the reflections on the inside - they simply present at though I'm trying to look through filthy glass (they've been cleaned over and over.)And again radio silence on support."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "L delany",
          "Nb_Reviews": 2,
          "Date": "2021-02-18T20:51:40.000Z",
          "Titre": "Very Disappointed-Twice",
          "Contenu": "Received first pair of glasses & they were crooked & couldn’t easily be fixed. It took 2 emails and 2 calls to customer service and after a week they ent me a new pair. The second pair was equally as crooked. I have again called customer service & emailed and no one has gotten back to me. When you call customer service, I have only gotten voicemail.I am very disappointed with the experience and lack of service at Gunnar."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AJ",
          "Nb_Reviews": 1,
          "Date": "2021-01-16T18:35:45.000Z",
          "Titre": "i contacted gunnar regarding a small…",
          "Contenu": "i contacted gunnar regarding a small issue with my order, i had purchased 2 glasses and one came with a small scratch. i just wanted to replace it but just get a automated email telling and not getting back to me. i have always had good products from gunnar but the one time i have an issue i am very disappoined with the customer service. just wanted to get a replacement for one of the glasses but its like pulling teeth"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EA",
          "Nb_Reviews": 1,
          "Date": "2021-04-23T15:32:41.000Z",
          "Titre": "Poor Customer Support",
          "Contenu": "I've tried to contact the number on the \"Not Happy? Give us a call!\" card that came in the box several times over the last few weeks, and my voicemail messages have been unreturned.  I wouldn't recommend GUNNAR Optiks, considering that even when you run into minor issues, no one is willing to assist."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 1,
          "Date": "2021-02-06T14:11:56.000Z",
          "Titre": "Just wasn’t as effective as I thought…",
          "Contenu": "Just wasn’t as effective as I thought it would be. They also don’t have an amber max option with no magnification, so every amber max lens option has magnification to it, causing unnecessary eye strain.Edit: I’m only interested in the amber max option with no magnification, but all amber Max’s have magnification so I’m not interested in any other options unfortunately, instead I’d like to begin a return.Edit #2: they don’t offer return shipping so there’s THAT"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zi",
          "Nb_Reviews": 1,
          "Date": "2021-08-07T15:17:54.000Z",
          "Titre": "I received broken glasses & no replacement.",
          "Contenu": "I received broken glasses after paying for over night shipping so my total was $93. I contacted support and they told me that I would receive an replacement within 2 days. The replacement never came! Now I have to call them back. Except this time I don’t want a replacement I want a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jorge Maranto",
          "Nb_Reviews": 1,
          "Date": "2021-02-21T17:02:04.000Z",
          "Titre": "Order Never Received",
          "Contenu": "I still have not received my order. For some reason my glasses never shipped. I spoke with customer service who stated they would send the glasses via 2-day shipping but they never provided me with a tracking number and I never received the glasses. I contacted customer support again and they didn't even bother to respond."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Haben",
          "Nb_Reviews": 1,
          "Date": "2020-12-21T23:14:59.000Z",
          "Titre": "I am giving it a 1 start because I",
          "Contenu": "I am giving it a 1 start because I bought the Gunnar glasses as a gift but never received them. So now I am short a present and my money is gone. I reached out but haven’t heard anything back yet. Hopefully this can be sorted out. Will send update.It’s not that I didn’t receive it in time. It’s the fact that I never received it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brett",
          "Nb_Reviews": 2,
          "Date": "2021-05-11T16:39:20.000Z",
          "Titre": "Clown Glasses",
          "Contenu": "Clown Glasses. I ordered the Menlo glasses and once received opened the box to find out they are gigantic frames. Something only a clown would wear. Extremely disappointed. This is the 3rd set of glasses I've ordered from Gunnar and have been disappointed in. Sad, I really want to like them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Todd Carnes",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T01:37:04.000Z",
          "Titre": "I have not received my order",
          "Contenu": "I have not received my order. So, if you are asking for my opinion on the order already, I would have to say poor. Lacking essence. Ephemeral. Maybe we should ask customers for their opinions after they have received the product.Editing my review that was originally posted on Feb 21, 2021. It is now 3/7/2021 and I have not received my order nor heard from anyone at Gunnar. It is starting to seem like I will not be getting the product I purchased and have little confidence I will be able to get a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Ren",
          "Nb_Reviews": 1,
          "Date": "2021-03-13T00:23:14.000Z",
          "Titre": "I did not like the style and color of…",
          "Contenu": "I did not like the style and color of the glasses. I send an exchange request email and send it back to the address which is for returning on Feb,16. Now it is March 9th. Send a second email with no response at all. Eventually, I got the glass on Match 12th. No glass box and valentines box."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Haverda",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T17:38:25.000Z",
          "Titre": "Soooooo long to get these",
          "Contenu": "Soooooo long to get these, took 6 weeks. Web site stated 2-3 but mine was well over a month. Decided to get these when my current pair broke, should have used a local service that gets them done in hours versus a month and a half…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Juan C",
          "Nb_Reviews": 1,
          "Date": "2021-02-23T21:14:07.000Z",
          "Titre": "I purchased my glasses last week…",
          "Contenu": "I purchased my glasses last week Thursday yet still have not shipped i got my tracking but yet no movement what so ever , i called in spoke to customer service was great very polite nice and he said he would look into it hope to get then asap before friday if , not i will request a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Regina Malm",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T16:33:16.000Z",
          "Titre": "Fit is bad and called and haven’t heard…",
          "Contenu": "Fit is bad and called and haven’t heard back from them.  I bought 4 glasses that worked great for husband and my 3 boys.  I bought more expensive pair for myself and they actually so uncomfortable and hit ny lashes and i have none.  Buy their cheaper pair at $20 frames are more flexible and better looking they $79 pair is waste of money no curved to hook on ears and inflexible so you cant do anything to make them fit better.  The lenses seems to magnify somewhat and not consistently I didn’t ask for readers or anything.  Very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Matt Maloney",
          "Nb_Reviews": 1,
          "Date": "2020-11-27T19:15:40.000Z",
          "Titre": "Whereabouts of my Gunnar Glasses",
          "Contenu": "I've called your hotline twice regarding the whereabouts of the non-prescription Maverick glasses that I ordered. I've had no response yet and the hotline goes straight to voicemail. Please contact me at your earliest convenience at 519-476-2890.Thanks,Matt Maloney"
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Manuel T",
          "Nb_Reviews": 1,
          "Date": "2021-01-20T14:32:31.000Z",
          "Titre": "Very poor customer service",
          "Contenu": "Very poor customer service! First they charge you huge extra amount for the delivery. Then they even wanted me to pay extra taxes at the arrival, which was no where mentioned!Be cautios with this shop. And then they don´t even refund you your money. Manuel T."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Massoud Pourzamani",
          "Nb_Reviews": 1,
          "Date": "2021-10-10T05:28:54.000Z",
          "Titre": "The customer was good but the quality…",
          "Contenu": "The customer service was good but the quality of glasses are way below standard. I don’t know where they make them, I assume China which that alone can speaks volume in regards to Gunner Optix priorities. Profit over Quality."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T23:17:16.000Z",
          "Titre": "You charged me for shipping",
          "Contenu": "You charged me for shipping; glasses are ok."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Lucariello",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T14:54:23.000Z",
          "Titre": "Ordered $400 pair of glasses and a $5…",
          "Contenu": "Ordered $400 pair of glasses and a $5 case. Case was sent, glasses included on tracking for case. Package arrives, only case with “Glasses ship separately” note inside. Receive email asking for review of service. Still waiting on glasses. Check website, wait up to 4 weeks for lenses due to COVID, now I’m in the last week trying to contact ANYONE in their support department and none of the emails work to respond to, they keep getting kicked back. Long story short, I was sent a case and then asked to review services a month before my lenses are supposed to arrive. Haven’t gotten the glasses yet. Here’s the review, I’ll update it once I hear from Gunnar about my lenses."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hunter",
          "Nb_Reviews": 1,
          "Date": "2021-04-04T17:33:28.000Z",
          "Titre": "No Updates Whatsoever",
          "Contenu": "Purchase made, acceptance of package has been waiting for a week from Gunnar. So 1 star due to me still not even knowing if the glasses are on their way. No package, no updates, just sitting here wondering if I just got ripped off."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Leif",
          "Nb_Reviews": 3,
          "Date": "2022-02-28T18:02:58.000Z",
          "Titre": "I made an order but after 8 days it is…",
          "Contenu": "I made an order but after 8 days it is not sent,I got an email from suport that they had questions but no questions askeedI then filed a suport case but no reply..Worst experience ever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick Ankney",
          "Nb_Reviews": 2,
          "Date": "2020-11-23T01:07:31.000Z",
          "Titre": "Ordered a pair of reading glasses and…",
          "Contenu": "Ordered a pair of reading glasses and over a month later, and 4 direct contacts, I finally just asked for my money back. Maybe the Covid crisis has really hit the business (which I hope not) but anyways good luck ordering from them."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "eduardo valentin rojas malacar",
          "Nb_Reviews": 1,
          "Date": "2020-12-27T18:28:01.000Z",
          "Titre": "290013",
          "Contenu": "Order Number: 290013 \tOrder Date: November 27, 2020 I received my incomplete order, I need my glasses with an enigma prescription, everything else of the order arrived well, how can you solve it? thanks     atte: eduardo rojas"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Keegan Price",
          "Nb_Reviews": 1,
          "Date": "2021-06-07T18:13:31.000Z",
          "Titre": "$69 for the glasses $30 for shipping…",
          "Contenu": "$69 for the glasses $30 for shipping and another $30 for duties. I just don't understand how shipping to Canada is $30 dollars for a pair of glasses , I would have bought 3 pairs if they weren't $130 a pair"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dissatisfied customer",
          "Nb_Reviews": 3,
          "Date": "2021-03-09T23:28:59.000Z",
          "Titre": "Where's my purchase?",
          "Contenu": "It's been over a week since my completed purchase & there has been no communication or updates to the status of my order. Where is my purchase? Please contact me directly because I have not received these glasses."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "IE6087",
          "Nb_Reviews": 3,
          "Date": "2020-12-20T09:55:34.000Z",
          "Titre": "Wow Unexpected",
          "Contenu": "Well I bought the gunnars and even did the USPS Priority... it’s been late since the 18th (now the 20th of December) and I’m still without them. I’m blaming USPS delivery. Once I receive them I’ll actually give a review"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex Beltran",
          "Nb_Reviews": 2,
          "Date": "2021-09-19T03:46:47.000Z",
          "Titre": "these glasses are not big enough",
          "Contenu": "these glasses are not big enough, although the lense quality  is very nice, I wish I could get the Large Size instead of these regular sized ones.  I a 6 foot 1 inches in hight, and weigh 220 lbs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill Van Deren",
          "Nb_Reviews": 1,
          "Date": "2020-12-08T15:12:49.000Z",
          "Titre": "Don't buy from the website, shipping takes FOREVER. Buy from Amazon",
          "Contenu": "Don't buy from the website. Go to any other retailer to buy your Gunnars. Gunnars.com charges for shipping and I ordered11 days ago and still waiting for them. Should have bought on Amazon and got 2 day shipping."
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Kyle St.Clair-Wright",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T11:40:36.000Z",
          "Titre": "Fed-Ex painfully unprofessional",
          "Contenu": "It is a shame to knock Gunnar like this, but their shipment choice is also part of the experience. My Fed Ex deliverer decided that it wasn't worth his time, as he simply notet me as not being home in the system, despite my actual staying to wait for him. He also did not leave a note, nor did I recieve notification via Email, after having signed up for it. The best part was customer support though. I waited a few minutes 5-6 before being connected. Then, I heard the phone being held, then put down. The person on the other end then continued to type on their keyboard. I waited for 10 more minutes shouting Hello etc. into the phone...without avail.  I could only recommend Gunnar if you know your Fed-Ex - Guy or Lady etc."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alfonso Harris",
          "Nb_Reviews": 2,
          "Date": "2021-02-23T23:34:04.000Z",
          "Titre": "I was supposed to receive my product 3…",
          "Contenu": "I was supposed to receive my product 3 days ago. There is no indication on when it will arrive. I realize that this is on shipping, not Gunnar. Nonetheless, not having the product in hand is disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maggie",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T13:19:25.000Z",
          "Titre": "They’re too big for a female Assassin’s Creed fan.",
          "Contenu": "These glasses are too wide and too long for a female fan of Assassin’s Creed.  It was disappointing.  Plus they already had a scratch on them before I even tried them on.  I’m sorry but very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tricia Farner",
          "Nb_Reviews": 1,
          "Date": "2020-12-29T20:51:24.000Z",
          "Titre": "Completely unimpressed and have…",
          "Contenu": "Completely unimpressed and have requested for a return and refund and no communication back. 3 emails and no replies. Quality is not good and now I'm stuck because the company is refusing to reply."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Michael Stanick",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T18:29:29.000Z",
          "Titre": "Had the exact same order last time came…",
          "Contenu": "Had the exact same order last time came no problem. This time FedEx wanted $17 extra dollars before delivering....so it cost almost half as much as my order. THAT'S F@#%ING PATHETIC!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Darville",
          "Nb_Reviews": 1,
          "Date": "2021-03-13T14:57:42.000Z",
          "Titre": "I purchased my glasses over a month ago…",
          "Contenu": "I purchased my glasses over a month ago and still have not received them.  I have tried calling multiple times as well as left multiple voicemails and no one has answered or contacted me back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kang",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T22:30:11.000Z",
          "Titre": "Never Delivered the Order",
          "Contenu": "It had been a whole week and I had received no notification of my package's progress. In fact, upon looking through package tracking, it had not even left its first location."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 2,
          "Date": "2021-02-11T01:13:35.000Z",
          "Titre": "Why would you send a review when I…",
          "Contenu": "Why would you send a review when I haven't even received the product.  You might want to hold off sending a review request until AFTER the consumer has received the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOHN BOSCIA",
          "Nb_Reviews": 1,
          "Date": "2021-01-13T17:12:20.000Z",
          "Titre": "WASTE OF TIME & MONEY",
          "Contenu": "Did not like the glasses at all. They make the screen on my computer brighter than it was before I put them on? I had to squint twice as much. A complete waste of time and money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jan T",
          "Nb_Reviews": 2,
          "Date": "2021-06-20T15:48:12.000Z",
          "Titre": "My glasses are not consistent with my…",
          "Contenu": "My glasses are not consistent with my prescription and the right lens is way off. I’ve left a message at the Customer Service number but no response. Very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CS",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T21:26:22.000Z",
          "Titre": "Customer Support not responsive",
          "Contenu": "I've written to customer support three times about updating the shipping address (the wrong state got auto-filled) and have not heard from anyone and its been nearly a week."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rose",
          "Nb_Reviews": 1,
          "Date": "2021-04-24T12:48:03.000Z",
          "Titre": "I've contacted Gunnar several times via…",
          "Contenu": "I've contacted Gunnar several times via e-mail and phone asking for assistance in selecting the proper prescription glasses and never heard back. Very disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Simon Whitehouse",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T14:41:47.000Z",
          "Titre": "Received my pair of glasses quickly…",
          "Contenu": "Received my pair of glasses quickly but, noticed the lenses are magnified, like reading glasses. Completely worthless for what I’m using them for. Would return if I could"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian Stutz",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T03:39:58.000Z",
          "Titre": "Service issues",
          "Contenu": "Good experience at first, but the glasses were flawed and the process of fixing the issue should have been easier"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T20:49:36.000Z",
          "Titre": "The label only was created.",
          "Contenu": "The label only was created, but is not shipping yet. I did the purchase last Monday. Today is Wednesday and is not information available to check the status."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kimberly",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T18:01:18.000Z",
          "Titre": "It is taking too long for my glasses to…",
          "Contenu": "It is taking too long for my glasses to get to me. The three-week waiting period is not obvious and much longer than any other vision store. I needed the glasses quickly to prevent migraines and could have had something weeks ago if I had gone with another company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Dippold",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T00:37:31.000Z",
          "Titre": "Earlier orders better",
          "Contenu": "Earlier orders betterI've ordered several classes, prescription, blue blockers, and sunglasses. loved them all, the last set seems to have a dizzying effect or telescopic in reverse... (same prescription as other orders) not sure why. I've been too busy to inquire and just used my old glasses, again same prescription. Love the frames, hopefully when i have time i can inquire about what went wrong or change the lenses to something better. may just go elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Popiak",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T13:14:43.000Z",
          "Titre": "I was very disappointed in the entire…",
          "Contenu": "I was very disappointed in the entire online ordering experience. I applied for the discount code to be send to me. It arrrived over 12 hours later.I went ahead and ordered at full price because I desperately needed to replace my other Gunnar glasses originally bought at Game Stop.After paying full price I got a notice for shipment that will arrive 6-7 days after purchase. Holy smokes. I will now suffer a full week of migraines and pain for full price glasses while they slowly transit from CA to GA. I love the product but will go out of my way to purchase through a reseller in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J random",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T17:30:51.000Z",
          "Titre": "Website format difficult",
          "Contenu": "Website format difficult, nearly impossible to understand whether glasses would fit on wider heads like mine.   I know there’s a lot of information there, but it’s not digestible for decision making.   That last part is super important."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luis Montalvo",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T21:57:39.000Z",
          "Titre": "Close call",
          "Contenu": "I would have done a 5 star review but i almost fell for bug in the website. I was being redirected to paypal and then back to the website and good thing i decided to look at the price because all the sudden it went from a 120$ purchase to a 400$ price. So somehow between the rederection, something happen that my ordered was multiplied by 3. So please be careful, checkouts are speedy now in days and this could have been a stressful situation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laz",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T03:00:59.000Z",
          "Titre": "Beware of lens",
          "Contenu": "The frame is sturdy but the lens give me a headache. They have a slight zoom on them and also some distortion occurs. Not to mention walking with them on causes dizziness. I cannot keep them on for a long time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T22:34:52.000Z",
          "Titre": "I wanted to purchase through Amazon",
          "Contenu": "I wanted to purchase through Amazon, they seemed to have faster shipping as opposed to Gunnar except they didn't offer this one style I wanted.  Also tracking is easier through Amazon in their overall portal.  Instead of a 3-5 day turn around I'm getting it in 10 days."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nelson I Amaro",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T02:17:32.000Z",
          "Titre": "Slow to deliver",
          "Contenu": "The company failed to meet delivery time twice.I placed my order on 05/14. The fulfillment was expected to be completed by 5/30. On 05/30, they promised a tracking number. It is 06/12, and I barely got my tracking number. I'm disappointed, and upset because I asked for a cancellation multiple times."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John McLovin",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T08:15:20.000Z",
          "Titre": "Terrible Ordering Experience",
          "Contenu": "After being able to order there was no way to track my order. I never received a confirmation email but I did receive 3 emails after being charged saying I still had items in my cart and did I want to continue my purchase. I tried to create an account but it keeps telling me to follow the steps to complete in the email that I still have never received. At this point all I know is my card was charged but who knows if the purchase was really made or if I’ll actually receive anything. I guess I just have to wait and see if a mysterious package shows up one day."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Don L",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T02:44:51.000Z",
          "Titre": "Payment toGunnar or or acknowledgment of order did not occur",
          "Contenu": "When I submitted my payment to Gunnar, there was no indication of progress, nor any indication that my order was actually submitted.I’m very concerned about future business with Gunnar optics because they are based in California.In my view working with a company based in California is risky. For example, I have to purchase a special insurance policy just so my package won’t be stolen or if it is that there is reimbursement.This is not a good way to do business and I’m very concerned about future business with Gunnar, because of where they are located."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "aaron green",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T17:54:30.000Z",
          "Titre": "These glasses don’t function well, subpar quality",
          "Contenu": "Paid $90 for the intercept version smh. Frames feel like $20 vans sunglasses, logo on side is cheap plastic. There’s a blue glare when blocking “blue light rays” and the outdoor tint barely works. The only thing I like is the shape of the glasses and the amber color works."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "G. Francis",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T15:30:01.000Z",
          "Titre": "hopefully the glasses are as nice as they claim..",
          "Contenu": "Well I signed up for emails and got a 20% off promo code that said it could be used on my first order. Then at checkout it said that the promo code could not be used. No fine print stating why.. Straight BS**UPDATE**Customer service reached out and honored my 20% off. Awesome customer service and response time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alicia Vasquez",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T01:28:05.000Z",
          "Titre": "I received the glasses a month ago",
          "Contenu": "I received the glasses a month ago, I have written several emails with the purpose of changing the frame of the glasses because the ones I purchased are very heavy, they told me that they are going to send an email so that I can send them to you and until today I have not received, please send me the address and I can get the desired change!!  Thank you for your cooperation in this situation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T17:54:59.000Z",
          "Titre": "Just buy directly from them.",
          "Contenu": "This is no way a knock on the brand.  Their checkout experience was not great.  I made a purchase.  I wanted to cancel the transaction that was made less than 5 minutes before, to pick up another 2 pairs.   The fact that I could not, just made a negative impression.  This after, I ordered a pair from them on Amazon, and I was sent a used pair. Short and Sweet: Glasses Great! Customer Journey not so great."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Oakes",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T17:49:09.000Z",
          "Titre": "Disappointed first time customer.",
          "Contenu": "I like the glasses that I received but they took longer than expected to arrive. Also, the coupon that I was sent for my birthday was not accepted and the free case that I was offered (and was on my order) was not sent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jayveer Shah",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T20:19:37.000Z",
          "Titre": "New welcome customer discount code…",
          "Contenu": "New welcome customer discount code didn’t work.I did reach out to their support but the code they gave has exclusions! I’m still awaiting a response."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Firdausi Mulsid",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T22:22:03.000Z",
          "Titre": "The reason I rated 2 stars is I tried…",
          "Contenu": "The reason I rated 2 stars is I tried to use the code WELCOME20NP for me to save 20% as advertised in your homepage, but it did not work. I tried it in multiple browsers with no avail."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2022-12-29T21:48:11.000Z",
          "Titre": "Order mixing being corrected",
          "Contenu": "Initial order was all mixed up, but Gunnar is making it right. Deeply appreciate the personal customer service. Thanks Terry."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Isela Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T19:44:49.000Z",
          "Titre": "I am not happy about paying $10 for…",
          "Contenu": "I am not happy about paying $10 for exchanging my glasses which were to big."
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "Harald",
          "Nb_Reviews": 6,
          "Date": "2023-03-22T11:05:48.000Z",
          "Titre": "2 much spam in my mail",
          "Contenu": "2 much spam in my mail. Had already ordered, buy had like 10 mails simce I was about to order something else too."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Clarence Mckiever",
          "Nb_Reviews": 3,
          "Date": "2023-05-31T02:45:20.000Z",
          "Titre": "I haven’t gotten my glasses yet until…",
          "Contenu": "I haven’t gotten my glasses yet until than y’all get to stars"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Cansu Cetintas",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T08:24:46.000Z",
          "Titre": "I like the glasses but why didn’t you…",
          "Contenu": "I like the glasses but why didn’t you notice that I had to pay custom fee which is 26 $ Ca . It cost me a lot."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BRIAN CERVERA",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T20:00:39.000Z",
          "Titre": "I wanted to put the code for the free…",
          "Contenu": "I wanted to put the code for the free case but it wouldn’t let me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rx glasses buyer",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T12:00:15.000Z",
          "Titre": "Rx issues",
          "Contenu": "I have been a Gunnar Optiks fan for many years now and have always bought my computer glasses from Gunnar Optiks.  I recently had a problem with an rx order and was told someone should be back with me within 1-3 business days.  We are now on business day 10+ and it’s a disappointment to me."
        },
        {
          "Note": 2,
          "Lieu": "AZ",
          "Pseudo": "Akshin Goshgarly",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T21:59:36.000Z",
          "Titre": "I ordered one pair of ( Haus ) model…",
          "Contenu": "I ordered one pair of ( Haus ) model and the one of lenses are bigger than different. So sad about this can t return glasses because our post services are bad and they can deliver only on 3-4 weeks and its expensive. Great customer service but poor quality. ( First time buying )"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T00:45:21.000Z",
          "Titre": "I like the style of the glasses and the…",
          "Contenu": "I like the style of the glasses and the tint of the lens but they give a slight magnification and it really hurts my eyes. I don't need actual glasses and my vision is fine but when I put on these glasses it is extremely obvious to me that there is some magnification.  It's very slight and it's probably 1.05x or 1.1x but it really hurts my eyes and makes them totally unusable for me"
        },
        {
          "Note": 2,
          "Lieu": "UA",
          "Pseudo": "Serhii Chernysh",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T20:08:48.000Z",
          "Titre": "The worst experience with shipping",
          "Contenu": "I had the worst delivery experience through FedEx.Please do not use this company to deliver your goods to Ukraine.There is no FedEx in my country, but we have a subsidiary of FedEx TNT Express which charges twice as much for customs clearance as customs duties and taxes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J Stone",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T13:29:28.000Z",
          "Titre": "Like the style, too much glare on camera",
          "Contenu": "I like the style, fit, and tint of the glasses. However, these glasses have an incredible amount of glare on Zoom... so much that meeting participants can see my entire screen reflected in detail in each lense. I should have considered this before buying, but didn't see a glare \"feature\" pointed out anywhere."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allan",
          "Nb_Reviews": 3,
          "Date": "2021-11-06T15:13:56.000Z",
          "Titre": "Production description did not indicate…",
          "Contenu": "Production description did not indicate that the frame is of a matte construction. I had to look at several photos to try to ascertain the material, but to no avail. Unfortunately I did not want to order any glasses with matte frame construction and will have to return the glasses."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jodi H.",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T15:11:12.000Z",
          "Titre": "\"Clear\" Lens Are No Longer Clear",
          "Contenu": "The glasses I ordered (Haus) were ones I'd ordered in the past. I enjoyed them so much, that I couldn't wait to get a spiffy new pair. Unfortunately, the \"clear\" lens I ordered still had a bit of an amber tint to them. Glasses I ordered in the past haven't been like this, so I can only guess they changed their \"clear\" lens. It's not a look I enjoy, so I'll only be wearing these glasses when I'm not on camera or out in public. Very disappointing."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "John M",
          "Nb_Reviews": 1,
          "Date": "2021-01-23T19:36:05.000Z",
          "Titre": "Careful if ordering from Canada",
          "Contenu": "Careful if you are ordering and you live in Canada. There is a $30 shipping charge when you purchase online, but what they don’t tell you is upon delivery the driver requests an additional $23 for duties. Ended up paying the same in shipping as the glasses cost almost. If I had known about the extra charge I would not have purchased. They should inform Canadian buyers of these extra charges, but they don’t. Not transparent. Product itself is fine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mack Lee",
          "Nb_Reviews": 1,
          "Date": "2020-09-30T20:29:11.000Z",
          "Titre": "Declining quality of glasses",
          "Contenu": "I feel that the quality of Gunnar glasses has declined in most recent purchase. I bought a second pair of Onyx Intercept. My first pair is great but this time, the frame felt uniquely brittle. Also the lens does not sit within the frame correctly, as it seems to slide around unlike my last pair that I bought 6 months ago. I think the only thing that I do like is the quality of the lens."
        },
        {
          "Note": 2,
          "Lieu": "RO",
          "Pseudo": "Vlad Roman",
          "Nb_Reviews": 2,
          "Date": "2021-03-23T14:07:27.000Z",
          "Titre": "Not for me",
          "Contenu": "I have bought the Torpedo - Onyx - Amber and after using them for 30 minutes in overwatch my eyes and head start to hurt .First thing i noticed is that the eyeglasses distort a bit and you will have a curved image . I think the headache is from the +0.2 diopter that they added but there is no way i can know if the pair i bought has a diopter because there isn't anything specified on the product description .Waste of money for me . I will give them 2 stars because of the ok-ish build quality"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stefano T\\",
          "Nb_Reviews": 1,
          "Date": "2020-10-29T14:12:21.000Z",
          "Titre": "Good product but broken lens",
          "Contenu": "The product itself serves its purpose and I like the glasses. The issue is that both lenses at the top edges have the same, identical crack/break in them. This appears to be a defect as the lens have not been dropped or misused in any way. I keep them in the pouch when not in use. I reached out to customer support but it has been 4 business days and I have not received a response.The reason for the low rating is due to the lack of response from Gunnar."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher Wilson",
          "Nb_Reviews": 2,
          "Date": "2020-07-19T16:31:22.000Z",
          "Titre": "The website has the look a feel of an…",
          "Contenu": "The website has the look a feel of an old flash site. The selectors were busted I some cases. The listing would show two colors and if you pick the unavailable one and go to the product page, it'll tell you to select a lens, but you can't. It produces an erroneous messy. The products good, so either business people are interfering with look and feel of you need to find good web designers/developers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "H. Gupta",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T19:31:50.000Z",
          "Titre": "I wanted to return the Gunnar I bought…",
          "Contenu": "I wanted to return the Gunnar I bought for my daughter and order another one from Gunnar's site. There was no easy way for me to do it. I left voice mails which no on responded to.The Lens themselves are fine but the customer service function does not exist."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patricia Aceves",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T17:51:31.000Z",
          "Titre": "Slow shipping process.",
          "Contenu": "The glasses took almost a month to arrive. We never had a tracking number to see how was the process going. The glasses came without case, which is supposed to arrive later from an email they sent a few days before the glasses arrived. We wrote a couple of emails to see how was the process or why it was delayed but never had a prompt reply. It was a birthday gift and it arrived super late (with no case)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Madison",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T17:34:23.000Z",
          "Titre": "I've so far have waited a week to get…",
          "Contenu": "I've so far have waited a week to get the order processed. Now it's currently still waiting to be picked up by USPS. Not sure what's going on. I sent an email to support to get an update, but no one responded to me. I get things are a little hectic right now, but just a quick email back and let me know what's up would have been nice. Hopefully they will come in later this week."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brendan B.",
          "Nb_Reviews": 1,
          "Date": "2020-05-13T12:53:02.000Z",
          "Titre": "First time GUNNAR customer.",
          "Contenu": "I purchased the TORPEDO bundle, and honestly, the glasses aren't what I expected. They have a very cheap plastic feel. Including the lenses. (If you've ever worn safety glasses, that's how they feel.) I've had my eye on GUNNARS for quite some time, and I expected something of higher quality. All together this pair of glasses cost me $105 but feels like it's worth $10-$15 at Walmart. :("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David E. Weekly",
          "Nb_Reviews": 2,
          "Date": "2022-02-28T00:08:05.000Z",
          "Titre": "Don't Get Prescription Gunnars.",
          "Contenu": "I ordered prescription Gunnars. Responses back took a week+ to arrive and were abrupt to the point of being rude. I still haven't received my glasses. I don't think I'd recommend that others get prescription Gunnars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Bowers",
          "Nb_Reviews": 2,
          "Date": "2020-05-20T15:31:21.000Z",
          "Titre": "Your product is acceptable.",
          "Contenu": "Your product is acceptable, but your emails are horrendously annoying.You also offered me multiple offers for discounts for having purchased some of your glasses.People don't buy 20 pairs of glasses, they only need one. So either you are just spamming me with illogical offers or you expect people to want different pairs, which would suggest there's something wrong with them, or you expect less than satisfactory responses."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 2,
          "Date": "2020-04-03T21:36:39.000Z",
          "Titre": "Honestly not worth the price.",
          "Contenu": "Honestly not worth the price.Pros: Look stylish         Feel comfortable when using headset for extended period of time.Cons: Really flimsy frame          Not sure if they work, eyes seem the same w/ or w/o them.Overall:  The price doesn't justify the use of these.   Seem like any gun shooting safety glasses with yellow tint I've used before for way less."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2020-06-04T02:42:02.000Z",
          "Titre": "Hope fate is on your side",
          "Contenu": "I wanted to see if I could change my order about an hour after I hit buy.  I called and ended up with an answering machine.  I left my number as requested.  Never heard back.  I suspect their customer service policy was copied straight out of Atilla the Huns diary.  Think hard about the order before you hit buy.  Cuz after that, it’s up to the Gods."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fardaus",
          "Nb_Reviews": 1,
          "Date": "2020-03-25T22:26:26.000Z",
          "Titre": "Received wrong item",
          "Contenu": "Ordered for natural focus glasses but I received an item with magnification. Their customer service was professional and helped me with the exchange process but the time it takes to receive an exchange item which takes a week is basically my time wasted for an item that i was eagerly waiting for. I wish i could give a higher rating but I am just a little angry/sad"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Barber",
          "Nb_Reviews": 1,
          "Date": "2019-06-15T21:22:01.000Z",
          "Titre": "I bought these glasses because i bought…",
          "Contenu": "I bought these glasses because i bought the same kind without prescription, and i liked them so i got them with my prescription. They're great except that the outside of the lens is way thicker than the rest of it, and because it's curved it creates a weird looking parallax on my face when you look straight on. Making my eyes and sure if my head look away smaller than they are :("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T03:23:32.000Z",
          "Titre": "My Experience",
          "Contenu": "The order was processed and delivered very quickly, however, the quality of the glasses was not what I expected for the price.  The lenses work well enough, but the frame seems to be very cheaply made and delicate, I feel like I might break them simply by picking them up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Javan Gore",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T02:32:00.000Z",
          "Titre": "Paid $30 dollars for the over night…",
          "Contenu": "Paid $30 dollars for the over night shipping. Ordered it early Saturday morning(I know their business days are Mon.-Fri.) So it should have got sent out Monday and should have arrived Tuesday. It didn't get sent out until Tuesday and we received it Wednesday. And we didn't receive an item we ordered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jung Kim",
          "Nb_Reviews": 1,
          "Date": "2020-04-01T05:05:25.000Z",
          "Titre": "Love Gunnar optiks",
          "Contenu": "Love Gunnar optiks haven’t gotten my glasses yet but they sure made it pleasurable and reassuring that I’m with a great customer service based team. I’ve forgotten the discount and not even in a blink of an eye they helped me get it discounted and now I’m happy. You go GUNNAR optiks favorite place to shop"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 1,
          "Date": "2019-11-21T16:54:51.000Z",
          "Titre": "Great styling, but avoid the readers.",
          "Contenu": "The focal length for their reader versions seem to be quite off.  I have other readers, but I don't need to be anywhere near as close to the text to see.  For computer glasses, they really should be focused about 14 inches out or so.  So, sadly I had to return mine.  Unfortunately, returns are taking a very very long time.  My glasses were received by them more than two weeks ago, but still no notice of a refund in spite of multiple emails back and forth about the 'accounting office'"
        },
        {
          "Note": 2,
          "Lieu": "PL",
          "Pseudo": "Wayne Armstrong",
          "Nb_Reviews": 10,
          "Date": "2022-11-19T08:25:18.000Z",
          "Titre": "Happier and healthier eyes!",
          "Contenu": "Happier and healthier eyes!However, I do have a complaint as the lenses weren't clean on arrival, and despite the fact that they cleaned up well, there are defects on the lenses which have proved to be a constant irritation. Not worth shipping them back due to the costs involved. Disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adam Cook",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T22:12:18.000Z",
          "Titre": "Some how the product was sent to the…",
          "Contenu": "Some how the product was sent to the wrong address. I am working with Gunner to fix this but this being COVID times I am sure it will take sometime to work out. I should not fill out the review yet but this might help someone see that something went wrong and it would be cool if they fixed it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronsen Cunningham",
          "Nb_Reviews": 1,
          "Date": "2019-08-23T18:14:47.000Z",
          "Titre": "False promises",
          "Contenu": "So my glasses have came in and they were supposed to have a prescription on them. It came with a prescription but only in the dead center. And I was told that the Rx department was gonna reach out to me shortly. it's almost been 2 days now and I keep asking if you know they might have the wrong email on file but, They say it's fine. I love the company and love the products. But, I wish they wouldn't tell you something if it wasn't going to be what's actually going to lead to false promises."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andre Kaminski",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T19:26:07.000Z",
          "Titre": "The glasses I received were incorrect…",
          "Contenu": "The glasses I received were incorrect (reading rather than computer). Although initial response time to my query was relatively fast, after that I was not able to get any follow up information"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Olin Fields",
          "Nb_Reviews": 1,
          "Date": "2019-06-17T18:07:00.000Z",
          "Titre": "Prescription is basically unusable",
          "Contenu": "Prescription is basically unusable, I can't seem to focus my eyes properly and the strain is worse than it was before.  I understand  purchases are non-refundable and I get why, but it's unfortunate.  I knew I was taking a chance ordering something like this online.  Expensive lesson."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Brindamour",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T00:21:50.000Z",
          "Titre": "My order was for two pairs of glasses",
          "Contenu": "My order was for two pairs of glasses, I only received one. I do love them, but it's only half of what I've already paid for. Would give a 4 to a 5 otherwise, though much of the issues may not be under the company's control, but part of the pandemic situation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2020-06-21T16:49:17.000Z",
          "Titre": "The glasses are rather cheap feeling…",
          "Contenu": "The glasses are rather cheap feeling for the price paid.  I also tried and tried to find out where they made these.  I took a chance, but once the glasses came the temple said they were made in China, I could not find this information on their website or any review about the company and product.  Live and learn I guess and do more research.  I post this just to let others know the country of origin for those interested.  I have only used them for a couple of days, but I would have gone with the lighter clear tint and the inability to adjust the nose bridge is a negative."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Matt Hickey",
          "Nb_Reviews": 2,
          "Date": "2019-07-23T23:53:11.000Z",
          "Titre": "Poor customer service",
          "Contenu": "While the product I received the RPG glasses are great. They were shipped to the wrong city initially and when I contacted FedEx they said Gunnar could request a refund for the shipping and duty. I contacted Gunnar to get them to do so and they still haven't done anything about it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "-G",
          "Nb_Reviews": 1,
          "Date": "2020-05-09T23:26:29.000Z",
          "Titre": "Received Phenom with lens out of frame…",
          "Contenu": "Received Phenom with right lens not in frame, floating around during shipping.Placed lens back in frame and it was out of tolerance enough to to move .75mm (Laterally) after frame was tightened Had to register glasses to start any process to remedy (this is issue because they were purchased from the Gunnar website AND entering information for out of box failure is not in my information security interest).Once registered, to get fixed/replaced would have had to coordinate and pay for return shipping.No longer worth my time and effort- taped and into garage toolbox they go."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thuan Nguyen",
          "Nb_Reviews": 1,
          "Date": "2019-10-24T23:03:46.000Z",
          "Titre": "Smelly Glasses",
          "Contenu": "The pair of glasses I got came in a box that smelled really bad when I opened it. I also have a problem where I can see my own reflection through the lenses and it is very distracting. Otherwise, the prescription was correct and it fit well... after I cleaned the smell off."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Devin Olewski",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T20:48:46.000Z",
          "Titre": "They sent me the wrong frame size",
          "Contenu": "They sent me the wrong frame size. *Edit* Additionally they glued my frames together and the glasses look completely different from the view on the website. No money back guarantee… I can definitely see why now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher Campanelli",
          "Nb_Reviews": 1,
          "Date": "2021-01-27T15:45:33.000Z",
          "Titre": "Love the glasses, but not for lengthy use.",
          "Contenu": "I love the glasses first and foremost! Some of the greatest blue light filter lenses I’ve used. I work with a computer day in and day out and don’t need prescription glasses but use the pair I got from you all. I also wear them while playing my Xbox. With all that said, I cannot wear these glasses for longer than an hour or two without my ears hurting and it becoming unbearably uncomfortable! I initially thought it was just a “breaking in” issue and overtime wouldn’t be any further concern. The longer I use the glasses, the more I find myself taking them off and not wanting to put them back on which entirely defeats the purpose of purchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zech",
          "Nb_Reviews": 1,
          "Date": "2019-12-27T17:28:56.000Z",
          "Titre": "Still waiting for an itemized receipt",
          "Contenu": "I have ordered almost the exact same product before and requested an itemized receipt for insurance purposes and received it very quickly, however this time, I have put in at least 2 separate requests for an order I placed over a month ago with no response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "WARREN WEEDEN",
          "Nb_Reviews": 1,
          "Date": "2020-01-01T15:08:06.000Z",
          "Titre": "I ordered a bad RX version of the glasses…",
          "Contenu": "I ordered a RX version of the glasses and my vision is very blurry.   My first time ordering online and I don't know if it is the glasses or my eye doctor made a mistake (been with him for 15 yrs)   At the moment I payed $200 for glasses I cannot use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dayron Hernandez",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T21:28:34.000Z",
          "Titre": "Not happy with my order",
          "Contenu": "I ordered a pair of glasses through Gunnar and they came damaged. The right lens is popped off and I’ve called multiple times and no answer and left multiple voicemails and no one has answered me. I was really looking forward to using the glasses."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Amanda Young",
          "Nb_Reviews": 1,
          "Date": "2021-03-04T21:37:27.000Z",
          "Titre": "Shipping costs $29.95, Plus additional $22.50 FedEx costs",
          "Contenu": "shipping fees are outrageous ($30.00) plus another $22.50 for FedEx shipping costs.as were from Canada, we had to pay the exchange rate plus additional shipping fees.  The glasses were only $79.99 US + $29.95 (via FedEx International Delivery) which came to $109.94 US, converted to $154.00 CAN.  Then had to pay the additional $22.50 FedEx costs.  Why did we have to pay the additional shipping costs?  this was not indicated when purchasing the glasses.  The exchange & shipping was more than the actual glasses themselves.Not pleased & would request a refund of the additional shipping costs as $29.95 US is more than enough to ship a small pair of glasses."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sean Weeden",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T20:38:40.000Z",
          "Titre": "No confirmation email..",
          "Contenu": "I rate it 3 stars because I didn't get a confirmation email from my order. The only way I could tell my order went through is because I can see the funds pulled from my account"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Hall",
          "Nb_Reviews": 1,
          "Date": "2021-01-03T01:59:40.000Z",
          "Titre": "Was not expecting such a difference in magnification",
          "Contenu": "I was not prepared for the magnification.  I often have to consult written notes and texts while using my computer for work, and the magnification of the glasses quickly gave me a headache to the point that I had an upset stomach."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "james",
          "Nb_Reviews": 1,
          "Date": "2020-11-30T22:10:57.000Z",
          "Titre": "So far we've gotten 4 emails promoting…",
          "Contenu": "So far we've gotten 4 emails promoting new products and asking for reviews. 0 emails that include a receipt, tracking information, order status, etc. At least let the ink dry on my current order before bombarding me with spam!"
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Amichay",
          "Nb_Reviews": 1,
          "Date": "2020-06-30T14:32:45.000Z",
          "Titre": "It didn't help me at all... my eyes still hurt.",
          "Contenu": "My eyes always dry and hurt while using computer \\ watch TV.I tried these glasses but unfortunately it didn't help me at all and using them made my eyes hurt even more.I purchased and tried both the 35 (clear) and the 65 (amber)lens."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Isaac Mack",
          "Nb_Reviews": 1,
          "Date": "2021-01-13T23:52:06.000Z",
          "Titre": "To be honest everything was good except…",
          "Contenu": "To be honest everything was good except the glasses . The plastic looks good but thr built quality and stuff is not what I expected.  It feels cheaply done the pictures make them look different for a 120 dollars and I feel at most I would pay is 75 to a minimum of 50 dollars . They bend so much and creek. The lenses part is not very stable on the ends of them to thr frame . They have so much gap between them. I'll still use them but they work so yeah . I won't tell you to look else place they have a good selection and its probably just the ones I picked didn't suit my thoughts fully on what I expected.  I'm sure there other ones are alot better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jk",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T04:45:33.000Z",
          "Titre": "Defective product.",
          "Contenu": "Defective product.The glasses do help with the glare but the hinges on one of the glasses we ordered don't open fully making them almost impossible to use.  Considering the cost of the glasses this kind of shoddy product is inexcusable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vin",
          "Nb_Reviews": 1,
          "Date": "2020-09-28T18:12:15.000Z",
          "Titre": "Good product but terrible customer service.",
          "Contenu": "Spoke to a reb before purchasing my Gunnars, Before I made my purchase I had asked if there were any specials or promotions going on. I was informed that there were none. So I made my purchase and literally a few hours I was being targeted advertised 10 - 20% off my purchase on social media and other website ads. These werent some weird 3rd party adverts they were directly from Gunnar so I tried to cancel my order so I could reorder them (all this within 24 hrs mind you) and I was told that there is no way to cancel my order but a return label could be sent to me at a cost. Which at that point is pointless.Good product but dont rely on their reps."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Matthew",
          "Nb_Reviews": 2,
          "Date": "2019-12-18T21:44:33.000Z",
          "Titre": "Eh,changed my mind!",
          "Contenu": "Glasses came the next day after it was shipped. I am impressed with the glasses. The glasses fit very well and they're comfortable. I no longer get headaches and my eyes don't feel tired anymore. Customer service needs work tho. After wearing the glasses for 2 months, the lenses broke and I have tried contacting customer service and they're not responding back to me. I have paid $109 for these glasses and they're not doing anything. They don't even care about their customers...I'm very disappointed. I will make sure this review goes to people and make sure my family and friends do not buy from your site."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T20:35:59.000Z",
          "Titre": "Be more specific for international shipping",
          "Contenu": "Didn't like how I had to pay $20 shipping and then they charged $20 again for import and duties fees. It was not on the website I thought $20 was the flat fee. In the future it would be nice to see estimated duties as a maximum."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2021-03-13T00:46:48.000Z",
          "Titre": "Don't hold your breath...",
          "Contenu": "They didn't ship my order until I called 3 weeks after placing my order. At checkout they notify you that there could be a week delay before shipping due to COVID. Although they shipped my glasses after I called, they blamed the post office even though I could see from the tracking that the post office was never given the package (only the shipping label was created). They said I could keep the both pairs if they arrive...right. Don't expect to receive your glasses after ordering.This is my first day wearing the glasses and they do seem to reduce eye strain. I would recommend they don't spam my email asking for reviews before they had even given me the product I paid for."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Mel",
          "Nb_Reviews": 3,
          "Date": "2021-05-13T14:42:27.000Z",
          "Titre": "Having trouble reading screen text",
          "Contenu": "The frames I ordered are too narrow for my face (I don’t remember having size options). And unlike my last pair (probably from 2013), I’m finding reading text on screens through these Gunnars to be very difficult."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ADAM K",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T15:40:10.000Z",
          "Titre": "I order the teen version and they are…",
          "Contenu": "I ordered the teen version and they are still way too big. Can only wear them for a little at a time before I start to get an optical headache. They are good for night driving but for computer work, not so much."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shannon Johnson",
          "Nb_Reviews": 1,
          "Date": "2020-03-09T14:05:58.000Z",
          "Titre": "Too Narrow",
          "Contenu": "The lenses are fine, but the frames are too small (too narrow at the temple). I saw that this was a common issue once I realized how much they were hurting and looked at more of the negative review, but this was not until after I had already purchased them and tried to wear them for a few weeks. They ultimately cause me headaches due to being too tight. I am a woman with a fairly small to average size head so do not see how most people could possibly wear these. I purchased the Cruz and wish I had realized this issue in time to return them. Ultimately these ended up being a waste, and I am reluctant to purchase any others from Gunnar due to the sizing issues."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Maria Chrisna Ampo",
          "Nb_Reviews": 4,
          "Date": "2019-10-19T14:41:09.000Z",
          "Titre": "I cannot actually review this because i…",
          "Contenu": "I cannot actually review this because i made a mistake in my order..i wanted to get an eyeglass without magnification but i ordered the one with magnification. I cannot bring it back because i need to pay again for the shipment back"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ellen",
          "Nb_Reviews": 1,
          "Date": "2020-06-28T02:03:34.000Z",
          "Titre": "Not 100% reflection and glare free",
          "Contenu": "I was hoping to get anti glare and anti reflection glasses, because other computer glasses was very reflective both from outside and from the inside. Although Gunnar glasses are advertised as anti reflective, they are not 100% reflection and glare free. I have a window in the back, and the light coming from behind reflects from inside the glasses and I see reflections of my own eye and light area coming from the window. They are maybe 30% less reflective than regular $20 computer glasses. Quality of the glasses is good, much better than my $20 glasses, they don’t slip. They are on the wider side, a bit wider near the temples than I would expect, but don’t  look too wide."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "eddie",
          "Nb_Reviews": 1,
          "Date": "2020-05-04T20:59:40.000Z",
          "Titre": "Its exactly a month, still no product.",
          "Contenu": "There's nothing else to say. Bought a month ago, promised multiple times the item had been shipped and still don't have it in my hand. The amazing part? This company is headquartered like 35 minutes from my house..."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Kristen F.",
          "Nb_Reviews": 7,
          "Date": "2021-03-12T07:48:10.000Z",
          "Titre": "Shipping to the EU is not worth it",
          "Contenu": "It’s a shame to have to give these glasses a 2 star review. While they are decent the company’s policy in shipping to the EU is ridiculous. I paid an initial shipping cost of 30 euros to get them shipped to Germany, then one week later I received another bill from their courier asking for another 30 euros as it passed through the UK. I was never told this upfront at the time of purchase, therefore, had no choice in the matter. I ended up paying 60 euros in shipping costs. I could’ve bought another pair of glasses for that price. The transparency is not there, and this company does not engender trust. I wrote to customer support and was told “we try to be upfront”, well, you failed at “trying”. Disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NICK MASTURZO",
          "Nb_Reviews": 1,
          "Date": "2020-05-20T03:19:54.000Z",
          "Titre": "The glasses are great but the customer…",
          "Contenu": "The glasses are great but the customer service is ridiculous. Emailed and called and still no reply. They charged my account four times one of which was the actual charge and only refunded me one out of three of them."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Douglas Binet",
          "Nb_Reviews": 2,
          "Date": "2020-09-06T17:03:56.000Z",
          "Titre": "Very poor customer support",
          "Contenu": "Purchased haus reading glasses sept 1st. for full price ($99.99usd). one day later, Sept 2nd i receive an email from gunnars regarding a sale, get 2 pair for $95.00.I contacted gunnars and asked if they would honor this sale given i purchased my glasses 1 day prior without any knowledge of the upcoming sale. I was willing to pay shipping on the second pair. Unfortunately, gunnars support didn't find me, as a repeat customer, valuable enough to even respond to my request. This is a good example of how to take a loyal customer and treat them with disrespect. Good job gunnars. Because I do like gunnars i am giving this a 2 star rather than a 1 star which is what i feel like giving at the moment."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Ammy",
          "Nb_Reviews": 1,
          "Date": "2019-08-02T21:20:04.000Z",
          "Titre": "I bought three Gunnar",
          "Contenu": "I bought three Gunnar ( dark ale, division 2 and Infinite ) all together for me and my siblings. These glasses are only good at slight magnification, that is why I am giving two star otherwise, they don't really help much as they are suppose to block the glare too along with the blue light of computer and other digital screens. But after wearing the glasses the glares are always their and that causes strain. I would not suggest anyone to buy these. Not only the poor quality glare protection, it actually increases it. I ordered it from US to India. They did charge me the shipping cost but they did not mention it on the box which lead to increased import fee by custom."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kayla Renken",
          "Nb_Reviews": 1,
          "Date": "2019-10-17T15:32:56.000Z",
          "Titre": "Send a confirmation email and tracking…",
          "Contenu": "Send a confirmation email and tracking with the order. I have nothing from this company and have no idea when and if I even will be getting my order. But the money already was processed so none of that makes any sense."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T18:05:01.000Z",
          "Titre": "No glasses...yet",
          "Contenu": "As of this time I have not gotten my prescription glasses.  Was told 4 weeks.  Got an email saying they were off to the lab and allow 2-3 more weeks.  3 weeks elapsed.  I get a tracking number.  Package arrives.  It's just a 2nd item, a case, that I ordered, no glasses.  I reach out to customer service, get automated email to allow 3-5 business days to respond.  Meanwhile the website says my order is completed, no further status.  For all I know this might sort itself out tomorrow.  But who knows?Prescription glasses seem to pose a communication and order status problem for Gunnar.  Has not been a delightful experience and surely not cost effective for Gunnar with all the support \"churn\" it causes."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Laura VanDyk",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T19:38:58.000Z",
          "Titre": "slow",
          "Contenu": "Made my purchase online then I was ignored until I questioned where it was 13 days later and it still wasn’t shipped. It is now shipped but not yet received. Now they ask for a review. Here it is."
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Ivaylo",
          "Nb_Reviews": 23,
          "Date": "2019-12-15T20:10:14.000Z",
          "Titre": "Would not recommend buying - hidden fees and duties",
          "Contenu": "The glasses are fine, but the problem is the transparency, shipping and the whole handling process with the import taxes. Bought 2 items on Black Friday with a discount code that gave 15%, but then the shipping to EU was more or less the same amount as the discount, which is fine, but the problem arrived a couple of days after I received the package. I got an invoice from FedEx with import duties of 25% AND 15% administration fee AND around 5% tax on the fee. This is just genius considering there was NO VISIBLE information on Gunner's website about any processing or import fees, even after I have specified the shipping address to be the EU. I would never buy Gunnar glasses again even though they are fine and I will avoid FedEx in general."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lars Lundquist",
          "Nb_Reviews": 1,
          "Date": "2020-08-21T23:02:55.000Z",
          "Titre": "Not a fan of the tint",
          "Contenu": "Not a fan of the tint. The actual glasses them self are top quality but between that and the small amount of magnification I wasted my money. They hurt more to wear than not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "carrie Bishop Kern",
          "Nb_Reviews": 1,
          "Date": "2020-02-07T17:11:11.000Z",
          "Titre": "Very slow return policy still waiting",
          "Contenu": "The people that I dealt with were very nice but I'm giving only two stars is because of the process and hassle to get my refund back to me which I still haven't gotten."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alberto Rojas",
          "Nb_Reviews": 1,
          "Date": "2020-05-10T17:28:10.000Z",
          "Titre": "Bad costumer service (Covid19) !!!",
          "Contenu": "I bought an available product and they wasn't send u til a week later, they never answered my email and i still waiting my lenses. I can't talk about the product yet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rishabh Jain",
          "Nb_Reviews": 2,
          "Date": "2020-09-02T20:30:25.000Z",
          "Titre": "Good for long distance but not for reading",
          "Contenu": "It attaches well, and is good for long distance viewing but for not good for reading as the hinges that attach to the glass come in the line of sight and cause discomfort"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julio Colunga",
          "Nb_Reviews": 1,
          "Date": "2019-08-15T19:03:14.000Z",
          "Titre": "two stars because I feel dizzy and get…",
          "Contenu": "two stars because I feel dizzy and get headache when I use it for a long period of time (+1 hr) and I lost some details on images but I think that could be \"normal\""
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Juan Manuel Albalate Gurriz",
          "Nb_Reviews": 3,
          "Date": "2021-07-09T19:00:12.000Z",
          "Titre": "Prescription not accurate due to the…",
          "Contenu": "Prescription not accurate due to the curve of the lens in this model. I have a different gunnar model with the same exact prescription which I use daily."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Iggy Castillo",
          "Nb_Reviews": 3,
          "Date": "2021-09-08T20:01:34.000Z",
          "Titre": "you sent them out quick",
          "Contenu": "you sent them out quick, which is great, but I don't feel like they help me at all, actually, I feel like my eyes are more strained with them."
        },
        {
          "Note": 2,
          "Lieu": "GT",
          "Pseudo": "Aherrera",
          "Nb_Reviews": 2,
          "Date": "2021-03-14T01:25:41.000Z",
          "Titre": "I wanted to add another item to the…",
          "Contenu": "I wanted to add another item to the order before shipping, but It is not possible. I wrote to ask for help, but they answered after my order was shipped."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2021-09-17T10:04:28.000Z",
          "Titre": "Not worth the money",
          "Contenu": "Not worth the money.  The glare on these glasses for gaming in a dark room is terrible.  I will not be buying another pair.  regret my purchase"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T02:47:48.000Z",
          "Titre": "Why don't you offer the full array of…",
          "Contenu": "Why don't you offer the full array of lens options for all of your frames? I found a frame that i liked, but it only came in clear tint when i needed amber. Even worse, i found frames with amber tint lenses, but natural focus was not an option!! I imagine most people are wearing these over contacts or don't have corrected vision and do not want a prescription. \"Gunnar Focus\" is useless, as those of us needing a prescription would likely have specific needs. At least offer non-prescription natural focus lenses to fit all your frames. Offering all lens tints for all your frames would make a lot of sense too. I expect a third party seller not to have all options, but not the manufacturer site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Blankenship",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T00:28:47.000Z",
          "Titre": "Ordering glasses",
          "Contenu": "During the process of ordering glasses the cost of shipping went from $4.95 to $8.95 without any explanation. I know that it's not a lot, but at least some kind of explanation would have been nice and being on a fixed income every penny counts these days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T16:56:40.000Z",
          "Titre": "The website constantly showed the pop…",
          "Contenu": "The website constantly showed the pop up for email entry to give 20% off first purchase. While the offer is great, the constant pop ups on each page in the browser tab made it quite frustrating and almost left the site altogether. The virtual try on also didn't properly work with the glasses types and kept glitching out. Regardless, still purchased a pair because of need however I advise some adjustments be made to the constant and annoying pop up and improving virtual try on"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T21:41:44.000Z",
          "Titre": "Was it OK?",
          "Contenu": "Website easy to navigate, prices seemed high but when glasses arrive I'll be able to see what the quality of the product is. Did I get what I paid for?  Virtual try on did not work well, glass es were the correct model but they were not the color that I chose."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cassell",
          "Nb_Reviews": 3,
          "Date": "2023-03-15T23:50:56.000Z",
          "Titre": "Glasses Lost, took forever",
          "Contenu": "Poor communication.  Took over 45 days to get my prescription glasses and they were \"lost\".  Lots of headaches to get them redone.  That being said this was an anomaly.  I have purchased dozens of glasses from gunnar without issue.  Oh and Gunnar why did you send female child glasses as my mystery box, you clearly have my measurements lol"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T19:24:28.000Z",
          "Titre": "When using the website",
          "Contenu": "When using the website. I was annoyed by the filters. I tried to look for Rimless and SemiRimless and the result was zero. I selected just the Rimless and seperately the semiRimless. If you are going to have a filter like that and allow selectable filter options that are no combined or additive filters. Then the selection should change to force only one option instead of allowing multiple selection. Other than that, I love the Glasses. I had broke the frames of my previous set. These will be the second set in 13 years because they are durable."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "javier esteban cardozo macias",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T14:05:06.000Z",
          "Titre": "please add a description, uruguay",
          "Contenu": "please add a description that people shipping to uruguay must pay another 50~ usd to get the package since they reckon it as a optic glass like if it was a prescription one istead of as regular glasses.im sad, not towards you but towards the uruguayan scamming system. i could bought another pair that i need for me for this amount.will try to buy from amazon or to give it on hand by myself instead of trusting a delivery system even if it is the 30~ usd from gunnar.besides that nothing to say against the glasses, good as always."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alan Maldonado",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T20:25:34.000Z",
          "Titre": "Filters don’t work on site",
          "Contenu": "My only complaint were the filters on the site that either don’t work or don’t have many options to filter which makes shopping frustrating. For example i can’t filter by frame color or even lens type. If I wanted to find some glasses that had the “amber max” lens I would have to click thru each pair to see if it was available. Fortunately I was able to get help thru the online chat feature and the rep that helped me was really helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Martin",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T17:40:30.000Z",
          "Titre": "You should base your free shipping…",
          "Contenu": "You should base your free shipping offer on the subtotal of the order, not after applied promo codes and discounts. Cost me another 9$ because I used the welcome code for signing up for emails."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 5,
          "Date": "2023-03-30T14:24:59.000Z",
          "Titre": "This was my second time buying…",
          "Contenu": "This was my second time buying prescription Gunnars. I've been using Gunnar's glasses since 2009. The first time around, service was great. I knew what was happening. Gunnar staff were responsive when I asked a question. This time, in buying a backup pair, the customer service was sadly lackluster. I asked two questions, the first of which was never answered, and the other question I had to ask multiple times. So, I must ask a third question: Is customer service a dying art form?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Oregon Buyer",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T21:05:20.000Z",
          "Titre": "The website would freeze when I would…",
          "Contenu": "The website would freeze when I would make a selection on the Product Information Page for a specific style.  The pages weren't responding after every click and I would have to refresh.  I think there is good information on the site, huge opportunity for better response time between clicks.  I haven't received the product yet so can't review that yet but excited about the collaboration pairs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thom P",
          "Nb_Reviews": 3,
          "Date": "2023-06-30T20:10:01.000Z",
          "Titre": "Discount code not working",
          "Contenu": "You emailed me a 20% discount code when I signed up for your newsletter.  Didn't mention any restrictions.  When I applied code to my purchase, it would not accept.  Therefore rating of 3."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Viktor",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T14:37:58.000Z",
          "Titre": "Fast and easy shipping, but still some big issies",
          "Contenu": "Fast and easy shipping. Payed about 100 € for the Stark blue light filtering glasses, they look really cool, bit in my opinion they are not in the good quality I was hoping to. I would rather prefear to pay double of the price and have a really good quality. The secend thing I really disslike is, the cool looking etui and everything else except the glasses, have a very strong smell, like it is some kind of cheap chinese cancer causing material.If this will be changed, I am definetelly ordering again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Axdragon",
          "Nb_Reviews": 3,
          "Date": "2023-04-11T22:08:25.000Z",
          "Titre": "Good product, checkout a little confusing",
          "Contenu": "For the most part this was a good experience. I liked the selection of styles and found a pair I liked. I have a older design that seems to be discontinued but found one very similar. My biggest issue was at checkout. As I filled out my information I used the auto-fill and got the shop app prompt for a verify code. As soon as I entered code it seemed to skip Gunnar checkout and go to shop app checkout. I was not able to enter the welcome first purchase discount code. I went ahead and completed the purchase.  Just a little frustrated couldn't get the discount."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "nj",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T21:53:02.000Z",
          "Titre": "Really expensive",
          "Contenu": "The prescription options are, frankly, stupidly expensive. But nobody else makes prescription glasses with explicit design decisions aimed at people who wear headphones all the time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zac",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T23:25:35.000Z",
          "Titre": "They Don't Honor Their Discounts",
          "Contenu": "I haven't received the glasses yet but am hoping they live up to the hype. My issue is the discount code I was sent directly from Gunnar. Which apparently wasn't allowed to be used once I went to pay. Showed the discount in the cart until I tried to process payment. Don't send a code if you're not going to honor it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chuck Hoffmann",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T23:42:24.000Z",
          "Titre": "Glasses are pretty expensive",
          "Contenu": "Glasses are pretty expensive, but good quality. Chat support was quick and responsive. Disappointed that I received 2 codes to use for my purchase, one for a discount and one for a free case but was then told I could not use both."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CG",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T01:28:43.000Z",
          "Titre": "Too many emails",
          "Contenu": "Too many emails. I’ve received more promotional emails from you than shipment emails. I’ll most likely return them based off your marketing tactics."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Robert Sylvain",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T19:20:44.000Z",
          "Titre": "Rough up frame",
          "Contenu": "Got a prescription pair of the maverick. When I first open the box I noticed the frames were twisted, so I figured I would just put them back. As I tried to untwist them the one screw striped the thread and came out. So to fix I had to take a longer screw(to grab deeper threads) from another pair to bring the frame back together.So yeah, I love the blue light filter but the lenses were not ground down enough and were forced to fit frame.After half hour of bending this and that, they are mostly straight."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen Burrows",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T02:09:04.000Z",
          "Titre": "Thank you, Terry",
          "Contenu": "First, I would like to say that the customer service is pretty good, I would like to thank Terry for his constant communication and care for my issues, mostly for dealing with me and my lack of understanding in certain parts of the process. The shopping experience was okay, I ordered a pair of glasses and, unknowingly, there were two in my cart. Instead of the cart saying \"Hey, your price is double what you're expecting\" you find out later when you're putting in your payment options. Granted, the two frames in the cart was my fault, but the price said $250 (which was the starting price of the frames I chose) regardless. Also, a little more clarity on how long an order takes to be shipped would be great. I'm thinking 7-10 business days, but in reality it could take up to three weeks for your order to be processed and ready for shipping. Upon writing this review, I have not received my glasses, so I can't really speak much on the product itself, but I'm expecting those to come in tomorrow, after nearly a month after ordering them."
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Osama AlSharif",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T21:45:58.000Z",
          "Titre": "Website needs improvement",
          "Contenu": "So many options with so little information about what suits me better. Also lack of comparison between products on the portal.. sizes aren’t clear and the guideline isn’t helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike Schlitt",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T17:07:22.000Z",
          "Titre": "Frames cheaply made and uncomfortable.",
          "Contenu": "I use a computer and phone and tablet very often during my typical work day. I definitely need a pair of Gunnar glasses. I have a stigmatism in one eye so I decided to opt in to the corrective vision lenses as well. When I first put them on and I walk around or turn quickly they really throw off my balance, like they are affecting my peripheral vision. Also for $200 (which is the price I would pay for actual corrective lenses) I expected the frames to be less \"cheaply\" made. Not impressed with the frames at all unfortunately. This is the second pair of Gunnar glasses I have purchased. My original pair from years ago I gave to my oldest son for his gaming. I don't wear them nearly as I thought I would because the frames are also not very comfortable, they squeeze my head and give me headaches from long periods of wear-time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Inna B",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T19:34:10.000Z",
          "Titre": "I still didn't get my order",
          "Contenu": "I still didn't get my order , it is already 8 days. Only today it was shipped. I have to ask customer service about this issue. I don't know about quality, previous pair I should return because of magnificence 0.2 (i didn't know that) and eyelash marks on the lenses."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "brennan",
          "Nb_Reviews": 2,
          "Date": "2023-01-31T17:38:29.000Z",
          "Titre": "Decent haven’t recieved in game content…",
          "Contenu": "Decent haven’t recieved in game content for mw2 calling card for special edition glasses yet not sure when that will come ?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T21:48:18.000Z",
          "Titre": "Great glasses in a way but not $100…",
          "Contenu": "Great glasses in a way but not $100 bucks worth.  Better options out there for 50 bucks and lower . Honestly Amazon $20 bucks worth just as good you’re paying for branding."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karl Hall",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T03:47:44.000Z",
          "Titre": "I tried to use the 20% off my \"first…",
          "Contenu": "I tried to use the 20% off my \"first order \" but it wouldn't work at the time it keep saying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom B.",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T02:21:39.000Z",
          "Titre": "You want honest comments here you go",
          "Contenu": "You want honest comments here you go.  The coupon for the back to school was done incorrectly.  It state ALL glasses site wide*.  Now with the asterisk there are exceptions but you can not find them anywhere, so I started to choose products that came up when I selected the coupon, the interceptor 2 pair, and the $25 mystery box.  When I applied the coupon it said it could not no problem be done.  I tried talking to a customer rep online and they stated that these products were promotional items.  I asked where did it say that say that these were not part of the deal and why did they pop up on page one, when you selected the coupon?  No answer.  I then sent an email to you customer service department, Kenny replied and stated that I was right, the asterisk should have been explained better and been easier to find.  He did give me a coupon to use so I could still get my items, so I am to upset with him just with how the sale was done.  Please in the future have a better explanation for asterisk items and do not include them when customers select the coupon.  This made it very confusing, thank you.Got a reply and they said they changed the site to make it easier to find the products not available on the coupon and it still does not show up anywhere I could find.  Also, the promotional item are still on the first page when you select the coupon, tell me how this is not confusing.  I bought your products, but this is way to confusing to your customers trying to use this coupon, sorry if I am an honest person trying to help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JRR",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T18:59:15.000Z",
          "Titre": "OK site",
          "Contenu": "overall as expected but the \"virtual try-on\" was a bit glitchy when using it.  Not as smooth as other sites."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Delivery",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T21:24:47.000Z",
          "Titre": "Pretty good.",
          "Contenu": "Discovery was a little difficult, also I would have preferred the glasses I purchased be available in the Amber Max tint as opposed to just regular Amber."
        },
        {
          "Note": 3,
          "Lieu": "PR",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T22:40:51.000Z",
          "Titre": "I paid for Route service but the…",
          "Contenu": "I paid for Route service but the tracking number received is not working."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan Shaul",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T04:15:44.000Z",
          "Titre": "Where’s the case?",
          "Contenu": "I missed the case.  A simple pair of readers costing more than $100 should come with a protective case…not a baggie."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Carlson Aranzaso",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T01:17:56.000Z",
          "Titre": "My glasses have a crack out of the box",
          "Contenu": "My glasses have a crack out of the box. Box was intact so most likely it was damaged during assembly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nico Patrick",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T02:59:16.000Z",
          "Titre": "All models should be available in…",
          "Contenu": "All models should be available in natural focus?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "C.C.",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T17:38:41.000Z",
          "Titre": "Odd to request a review before the purchase object arrives, but sure, I'll give it a shot.",
          "Contenu": "First time using this trustpilot site, but the wording seems to be to review the entire shopping experience rather than just the product itself. Sorry if this gets to be \"too\" detailed but I'd rather go through it to lay everything on the table rather than just state the highlights (such as extreme positives or negatives) and let people think those are the only things that happen.My experience with purchasing a Gunnar Optiks glasses involved first chatting via the \"contact us\" page, asking about the ability to remove the \"gunnar\" logo thats printed directly on the glass, and about which particular glass I might want. Removing the logo is a no go it seems, which is a bit disappointing but they did point me in the direction of what seems like the right glasses. Everything about this interaction was perfectly fine and I have no complaints. So, I actually went through Amazon to purchase the ones I wanted. Turns out some versions on Amazon are \"only X in stock\" including the one I purchased. Odd, but fine, it is right after the holidays after all. Only problem though, is that when the package arrived, I actually received the incorrect glasses. So, in requesting for a \"replacement\", I found out that apparently because Amazon shows it as low stock it can't be \"replaced\" it can only be \"refunded\" and with no way of communicating through Amazon to the seller (Gunnar I presume). I applied for a refund and had to send those other glasses back. Oh well. Annoying, more than anything.While I had those glasses I did get to test them out a little bit though, and I did like the concept from them. I did find out after receiving them that the pictures on Amazon and also on Gunnar's own website contain images that have versions of the glasses that have no \"made in China\" sticker/tag on them, which was interesting to see is on the actual glasses. Felt like an attempt to hide where the glasses were made from unless someone particularly searched for the information which is admittedly available on Amazon if I'd looked, but I didn't see it anywhere on Gunnar's site after looking. Probably tucked away somewhere. A little shady, but at this point, who isn't selling items from China and trying to making it seem like they are local, am I right?I did decide to purchase the glasses I \"actually\" wanted through Gunnar's website instead of hoping it doesn't get screwed up from/through Amazon again. I had made a cart and purchased it essentially immediately, but I did end up hitting a seeming bug in how the website works; the website probably wouldn't have known my email address if I hadn't purchased, but I was pinged a few times in my email about \"items in my cart\" over the next few days. Nothing too untoward, but an issue to point out.And obviously, as the title states, the review was sent to me before the item even arrived, despite it being tracked.Overall, I think a 3 star review is a bit of a \"harsh\" choice, but apt. Nothing was particularly \"bad\", just a bit awkward because of the number of little things that had added up over the process.Edit in response to the reply: The email bringing me to the \"review\" only stated that it was in response to my \"Shopping Experience\" so it can obviously be very hard to tell which particular \"experience\" is intended to be reviewed. Someone might want to make it more explicitly clear what the intent of the review is supposed to be if it is supposed to be about one specific event."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SeaHuntAg",
          "Nb_Reviews": 1,
          "Date": "2022-04-03T17:09:49.000Z",
          "Titre": "The quality of the frame and lens was…",
          "Contenu": "The quality of the frame and lens was good.  I really liked the fit and finish.  My only issue was with the reflection of my eye on the inside of the glasses which was very distracting.  A good anti reflective coating would make this a 5 star product.  It may not be an issue for some but I couldn't get used to the reflection."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "dani",
          "Nb_Reviews": 2,
          "Date": "2022-03-23T01:51:28.000Z",
          "Titre": "no response from customer service",
          "Contenu": "The glasses seem to be good quality.  But they were too wide.  I called the phone number provided in the box but never received a response...If the phone lines don't work, maybe don't have an answering machine that accepts messages and don't add the customer support phone number on a separate card placed inside the box?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John M.",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T17:31:02.000Z",
          "Titre": "The shopping experience was fine, but the advertising seems false.",
          "Contenu": "The shopping experience was fine, except the item I chose (Enigma frame, Amber Gunnar Focus lens) was advertised as anti-reflective. It is 100% not anti-reflective. I think if I had a 4k webcam, I'd be able to take a picture of me reading a webpage and actually read the webpage in the image of my glasses. That's how reflective these things are."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clayton Ownes",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T18:09:34.000Z",
          "Titre": "The site was very laggy and glitchy on…",
          "Contenu": "The site was very laggy and glitchy on the iOS system. It also had me reput my payment information several times in because I got my address wrong and it did not properly display this. It would say your payment did not go through or something, then would not indicate where on the site the information was wrong, for example I accidentally put 700 instead of 770 on my address and had no specific notification on it was wrong or not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nima",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T17:19:53.000Z",
          "Titre": "Problems ordering",
          "Contenu": "The first attempt to buy them got my credit card charged immediately, but the website prompt an error on my postal code. This lead to me having to check with them to remove the charge,Next day, the charge was no longer in my card and I redid the order. I'm still waiting on the glasses to arrive with my prescription."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Beeth",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T17:30:15.000Z",
          "Titre": "They didn’t have the color frames for…",
          "Contenu": "They didn’t have the color frames for the lenses I wanted. :/"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul D",
          "Nb_Reviews": 4,
          "Date": "2022-01-27T22:31:24.000Z",
          "Titre": "the pair i ordered were too strong",
          "Contenu": "the pair i ordered were too strong.  i need a 2.5 not a 3.0 so will be exchanging.  I own a pair of gunnars and the old pair is much lighter in weight than the new pair.  I leet you know when i exchange how i like them.UPDATE _ Terry, your emails are not coming thru to me at ALL>  none in my spam etc. Try using a real email program, like outlook where i can reply to it!  This NO REPLY is not efficient.     The trust pilot comes thru from you but no others from Gunnar or Trust Pilot.  there must be a bug in your progam."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Gunnar Liljas",
          "Nb_Reviews": 2,
          "Date": "2021-06-12T22:18:42.000Z",
          "Titre": "Plasticky but otherwise OK.",
          "Contenu": "Pros: The Fedex delivery to Sweden war super fast.Packaging was niceThe prescription seems to have workedThe design is spot on.Cons:The frames are really plasticky and doesn't feel any more premium than the reading glasses I bought at the gas station.The progressive lenses are not nearly as good as the ones I have in my other glasses. A lot more distortion and a less smooth transition. Granted, those glasses cost more."
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Andres Cardona",
          "Nb_Reviews": 2,
          "Date": "2021-07-06T17:24:27.000Z",
          "Titre": "Took a lot of time to be delivered",
          "Contenu": "Took a lot of time to be delivered, and the silicon cover on the right was not properly glued, so it just come off everytime... certainly not what one is expecting from gunnar, and made in china, the cost may be a tiny fraction of the sell anyway, here we got the quality, i'm an old customer but the quality of this last ones is regular..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angie",
          "Nb_Reviews": 1,
          "Date": "2021-02-04T08:44:18.000Z",
          "Titre": "arm length too long",
          "Contenu": "Being able to see the glasses on your face is pretty helpful. The glasses themselves are all actually for a man's head in my opinion as the arms are way too long and do not rest on my ears like they should at all. I have to go get them adjusted by over an inch because they fall off my face otherwise. I don't have a small head either so this is  super unusual for reading glasses for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SKNGuest",
          "Nb_Reviews": 3,
          "Date": "2021-08-03T20:44:34.000Z",
          "Titre": "Premature Review for Items Not Received.",
          "Contenu": "Update:Items have been received. Representative was available on the site this time to respond to my inquiries. Friendly and provided the information I needed. Great representative when able to get a hold of someone. Also received an email in response to my review a couple weeks having these new glasses. Happy with product and representatives reaching out to confirm all is well with product.Previous Response:I called customer service though no response. No return call when left a message. Still haven’t received items."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ali",
          "Nb_Reviews": 1,
          "Date": "2020-10-26T22:29:17.000Z",
          "Titre": "No Free Returns and Expensive",
          "Contenu": "Glasses are nice but they're a little flimsy- for their price i expected a sturdier build. Returns are not free so be sure you like the pair / style before purchasing- kind of hard to gauge even with their virtual try-on. I was going to exchange my pair for a new one because i didnt like the style but not worth it with having to pay return shipping again in case i dont like the new pair either."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2020-09-21T13:34:06.000Z",
          "Titre": "Customer service could be better, actually it could exist at all.",
          "Contenu": "I accidentally ordered four pairs of glasses when I only needed three. Immediately upon hitting the send key for the order I left two messages in two different areas of the website to get ahold of you to change the order. It’s been a week since I’ve ordered we’ve had the glasses a few days and I still don’t have a response from anyone. That’s the only reason you’re getting the marks you are."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Caron",
          "Nb_Reviews": 1,
          "Date": "2021-01-03T01:45:24.000Z",
          "Titre": "Weak Plastic Frame? TBD",
          "Contenu": "Love the Cyber model glasses however, I am let down with the plastic frames, they appear whimsical/cheap and easy to break.Previously, I purchased my 10 year old son a pair for his computer usage at home and school. The model he owns retails $29.99 and the frames are equally weak. I guess my expectations were greater for a more durable frame.Great price, they work VERY well for blue light reduction and I would recommend to others only if the frame was stronger."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RowdyFan",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T16:48:24.000Z",
          "Titre": "The lenses are very helpful",
          "Contenu": "The lenses are very helpful.  They make looking at the tablet, phone, etc. less tiring on my eyes.  I'm on these devices too much.Having said that, the frames are nothing to rave about.  They don't even have spring hinges.  For the price paid, the frames need an upgrade.  That is why I'm only giving 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Blake P.",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T17:13:42.000Z",
          "Titre": "Glasses slide down my face constantly",
          "Contenu": "Glasses work well enough. They collect dust and fingerprints like crazy. They also slide down my nose very frequently - I have a larger nose than normal so I never have this problem. I would’ve preferred if the part that sits on your nose were not melded into the frame, but instead have separate nose pads so you can adjust the fit accordingly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Khai Le",
          "Nb_Reviews": 1,
          "Date": "2020-09-11T15:18:43.000Z",
          "Titre": "Not only did they send us the wrong…",
          "Contenu": "Not only did they send us the wrong product (from a different order), when i called to have them send me the right order, they then dropped the ball again and forgot to place the order to have it sent again. I called several days after and it was then they finally sent me the correct one. I understand times can get busy and they were super nice about it but it was a frustrating experience! They otherwise do have some awesome products!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gabe",
          "Nb_Reviews": 1,
          "Date": "2020-08-26T23:49:55.000Z",
          "Titre": "They get the job done.",
          "Contenu": "There’s nothing extravagant here. They get the job done. There’s a slight “magnifying” effect with these that my $10 dollar blue light glasses as well as my $150 dollar Ray-Bans don’t have. Also no hard case included. That’s extra. Not a huge selection of styles which is a major downside! Just a lot of square frames at the end of the day. But the slight magnification is my biggest complaint. Very odd but maybe it’s just my eyes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lili",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T19:58:52.000Z",
          "Titre": "I was optimistic...",
          "Contenu": "I was optimistic...I sent an email inquiring about which glasses have a wide fit, the response never came and a week later I decided to order what I thought would be wide fit computer glasses. They fit tight and I can only wear them for a little bit. I think the lens are great they do help but I wish I would have received a response for the email I sent so that I could have made the right choice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Oscar Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2020-06-08T23:10:51.000Z",
          "Titre": "You sent me lenses wipes for glasses I…",
          "Contenu": "You sent me lenses wipes for glasses I dont even have yet and never provide an updated time for the glasses arrival nor a potential shipping code. Order was marked as delivered by your company so I can only pray now that I get the glasses I spent three hundred dollars on. ----Was reached out to by customer service, received glasses but one lense is so warped it causes massive discomfort until you subconsciously ignore it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Gibson",
          "Nb_Reviews": 1,
          "Date": "2020-08-01T19:21:38.000Z",
          "Titre": "Good glasses, poor customer service",
          "Contenu": "I really like the glasses I received, and at a decent price. Unfortunately, I received one of the two pairs missing a logo bar on the side. After multiple emails with customer service I still haven't received the piece to super glue on myself or a replacement pair. Good thing I'm working from home, I won't be able to wear them out missing a piece. Overall, I'm still happy with the glasses, but the customer service dropped the ball."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glen Chapman",
          "Nb_Reviews": 1,
          "Date": "2020-04-24T14:09:52.000Z",
          "Titre": "this is my second pair i’ve bought from…",
          "Contenu": "this is my second pair i’ve bought from gunnar and this time around i’m really not happy with it. everything’s good besides when it arrived there was a really deep scratch on the left lens. so that’s my only problem, which is the worst problem you can have when it comes to glasses. it’s so deep i can see it when i wear them. stuff happens i get it, but still isn’t cool spending all that money on a damaged product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stryse",
          "Nb_Reviews": 2,
          "Date": "2020-06-09T18:15:33.000Z",
          "Titre": "Mobile Experience for Submitting Prescriptions could be improved, but otherwise a happy customer",
          "Contenu": "Honestly, it was a real pain to submit the order with the prescription because I needed to attach photos so they could do a mesurement. I have no webcam and the mobile site experience from my phone leaves much to be desired for this piece.I managed, but its a user experience that could use improvement as not everyone is that tech savvy.  Otherwise, pretty happy. Just patiently awaiting my actual glasses. (Got the add-ons shipped seperately.)"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Lang Tov",
          "Nb_Reviews": 1,
          "Date": "2020-03-18T11:02:51.000Z",
          "Titre": "Surprising price change",
          "Contenu": "I saw the price tag for the Razer glasses which was $100. So I added to cart then went to checkout. Except when I got to checkout, the 100 was in US and it had shipping fees. This meant the glasses just doubled in price. If only the website had translated the price from US to the customers locations unit of price, then this surprise would be avoided. Overall however was average"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan D.",
          "Nb_Reviews": 2,
          "Date": "2022-01-11T01:04:00.000Z",
          "Titre": "The lenses are darker than I expected",
          "Contenu": "The lenses are darker than I expected, and darker than the $6 pair they replaced, but I'm assuming that is better for my eyes.  They are certainly more comfortable!  I don't believe they actually block blue light so I returned them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Omar Plummer",
          "Nb_Reviews": 2,
          "Date": "2020-03-08T18:13:06.000Z",
          "Titre": "The frames require more flexibility",
          "Contenu": "The frames require more flexibility. They break easily and you cant get them fixed quickly. If you can it's hard to find a place that will do it quickly. For the price, they should be at a protection level of 95 on all the products. Blu rays are everywhere and we all need as much protection as possible. Otherwise, they are very helpful and do reduce eye tearing when you use a screen protector for double protection."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J.",
          "Nb_Reviews": 2,
          "Date": "2020-11-09T07:13:14.000Z",
          "Titre": "Gaming/sleep holiday bundle",
          "Contenu": "Gaming/sleep holiday bundle is what I bought, and I like it for its bluescreen blocking effectiveness......my problem however is that these are very uncomfortable with headsets that go over the ears, unlike the old gunnar glasses that I have, these new ones are uncomfortable.They work as intended, just uncomfortable"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Guillaume",
          "Nb_Reviews": 1,
          "Date": "2020-02-16T19:54:40.000Z",
          "Titre": "Fast and good delivery",
          "Contenu": "Fast and good deliveryI had some problem with extra fee for delivery, they told me that it's written somewhere that this isn't their problem (probably true, didn't verify), but I guess I'm used to use big company like Amazon, who take care of everything, tell you \"You need to pay x$ and that's it\" instead of the \"We do the minimum and you might have a surprise at the end\"Good product"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AWeeks",
          "Nb_Reviews": 2,
          "Date": "2019-12-22T22:22:09.000Z",
          "Titre": "Poor customer service, Good Website",
          "Contenu": "Tried calling to check and order and spent roughly 10 minutes on the phone with an automated system that got me no where. After the 10 minutes the system hung up on me, and I had to call back to once again get no help from an automated answering system. The only reason I’m given three stars is because the website was fairly easy to navigate and gave a lot of information about each type of glasses"
        },
        {
          "Note": 3,
          "Lieu": "GE",
          "Pseudo": "Seno Meria",
          "Nb_Reviews": 3,
          "Date": "2020-02-28T20:57:54.000Z",
          "Titre": "The reason I am writing the \"POOR\"…",
          "Contenu": "Before you purchase, note one important thing. Most GUNNAR eyeglasses doesnt have 10 cent-costed rubbers on the frame :i.imgur(dot)com/1RCXdKo.pngand they are not comfortable when I used them for hours with headphones (because they make more pressure on plastic onto ears).  There needs to be some soft/rubber materials.In other aspects, I cant say anything."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Jones",
          "Nb_Reviews": 1,
          "Date": "2020-12-16T19:34:24.000Z",
          "Titre": "Duplicate or ????",
          "Contenu": "I ordered new glasses, the next day, I got an email stating that my 'cart' was not complete.  I followed the link and completed the order.  Gunnar duplicated my order and sent me 2 pair of glasses.  I guess I will just keep them both, but this was kind of shady.  Buyers beware if this happens to you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 3,
          "Date": "2019-12-12T07:23:43.000Z",
          "Titre": "Great glasses, ok customer service.",
          "Contenu": "My order was lost for awhile in a former employee's email, which somehow they never got access to before they left.  Tried calling a few times after that got straightened out, always went to voicemail.  No response from CS, until the day after it had finally shipped.  The customer service agents were pleasant and knowledgeable, but near impossible to contact.  Might be a bit understaffed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tiffany Davis",
          "Nb_Reviews": 3,
          "Date": "2020-02-24T14:54:02.000Z",
          "Titre": "Blue Light blockage is good; facial fit, not so much",
          "Contenu": "The glasses work from a computer standpoint, and they look good on my face, but they are clearly made for men (pro tip: you can't just stick female faces on your website to sell products: it would help a lot if the products actually WORK for women). They are very loose on the sides of my face and over my ears; one hard sneeze or cough and they'll fly off my face. I'll have to take them to an eyeglass shop and see if they can be adjusted."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2019-08-26T22:19:17.000Z",
          "Titre": "Received Scratched Lens",
          "Contenu": "I'd love to give a higher review, but at this point I cannot. The glasses are great, truly, except I received a pair with about a 3/4\" scratch on the inside of the left lens right in front of my eye.I have contacted support almost the minute I opened them (Saturday 08/24 - I don't expect a call/email till Monday+) and will update this review when a we come up with a solution."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mike wazny",
          "Nb_Reviews": 1,
          "Date": "2019-08-29T19:47:56.000Z",
          "Titre": "I like that your glasses block the blue",
          "Contenu": "I like that your glasses block the blue light and protect my eyes but the reason I made my recent purchase is because I had to pairs of glassed the broke. On the first one that broke it was the hinge which was plastic and I know you have corrected that by making it metal now. the second one the plastic frame broke on the top around the lens. I do like the glasses so I ordered new glasses to replace the 2 broken glasses."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trevor Johnson",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T00:49:43.000Z",
          "Titre": "Misleading product or I am dumb *shrug*",
          "Contenu": "Great customer service.  Product is disappointing.  Not sure if I misunderstood the point of the Amber-React tint, but they certainly don’t work as sunglasses.  The image showing each tint is extremely misleading.  Nevertheless, for use in front of a screen, they are great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tony G.",
          "Nb_Reviews": 1,
          "Date": "2021-01-16T18:41:06.000Z",
          "Titre": "Good to see through, will reflect your screen image",
          "Contenu": "Great packaging, quality frame and lens.  Lens is better than lesser cost units I’ve tried in the past.  I am disappointed in the anti-reflective coating.  I upgraded to these for that purpose, and they are no better.  If that is not important, then these are certainly good computer glasses."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Twig",
          "Nb_Reviews": 1,
          "Date": "2022-02-05T13:26:00.000Z",
          "Titre": "I checked the one day shipping",
          "Contenu": "I checked the one day shipping, however it charged/ordered ground shipping. Not a huge deal but I went back and looked and it won't update when I try it again. Not sure if this is a touch. Excited for the glasses though."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "ET",
          "Nb_Reviews": 1,
          "Date": "2020-01-31T03:01:09.000Z",
          "Titre": "Overpriced",
          "Contenu": "I'm not sure the FPS is worth its price, to be honest. Build quality is average, and it's not like I'd wear it out on the streets or anything. It's light, but if you're wearing headphones over it, you're gonna feel it anyway. Really dislike the nose pads - they're not as adjustable as intended."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thornton Wilder",
          "Nb_Reviews": 4,
          "Date": "2021-05-09T19:45:18.000Z",
          "Titre": "Lenses Wonderful, Frames Dollar Store Quality",
          "Contenu": "The lenses are wonderful. Functionally the glasses were just what I was looking for. But for $100 I had expected the frames to feel sturdy and of higher quality. These frames feel like they came from the dollar store. But again, I am overall satisfied with my purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 2,
          "Date": "2019-10-04T19:08:35.000Z",
          "Titre": "Too much lens reflection, otherwise good",
          "Contenu": "These glasses definitely seemed to reduce eye strain but the lenses are highly reflective on both sides and very distracting to look through. Tiny images of the room and windows around me are reflected right back in my eye.  This only goes away if I cup my hands around the outside of the glasses to make sure no light enters on the sides.The tint and the slight magnification were relaxing and helpful to reduce eye fatigue, but for the price they should offer anti-reflective coating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryar Bush",
          "Nb_Reviews": 1,
          "Date": "2019-10-05T17:22:12.000Z",
          "Titre": "The product is amazing but the…",
          "Contenu": "The product is amazing but the experience to order the product was sub-par. It took me an hour to order it because every time I left the cart I’d have to retype all my information again. Would like to see an updated website. The product itself has been excellent and have helped me avoid headaches and not strain so much!"
        },
        {
          "Note": 3,
          "Lieu": "ID",
          "Pseudo": "James Tang",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T11:43:14.000Z",
          "Titre": "They sent Wrong prescription glasses…",
          "Contenu": "They sent Wrong prescription glasses and they promised to send a new Prescription glasses with Right Prescription. And they sent the New Prescription Glasses and you know what, the prescription is still wrong!! not as much as previous one but still wrong. This can cause migrain and headache!! I don't recommend GUNNAR Prescription as they don't make the glasses pricisely right to the prescription, I never had problem with inaccurate prescription from other brand like Essilor. So this is really bad experience from GUNNAR Prescription glasses that is quite expensive! I don't really use the glasses as it has wrong Prescription."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jarek Panowicz",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T00:03:59.000Z",
          "Titre": "Love the products frame, in all.",
          "Contenu": "Cool product enough, to where id like wear them more often, but the acent 65 35 is tooo to dark! Id probably get a different pair next rime if they werent a lirtle costly. Ill probably return this set if nothing else!  Should have more magnification as well! Also the hugs the back a little tightly!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "michael Arredondo",
          "Nb_Reviews": 1,
          "Date": "2020-05-05T16:55:10.000Z",
          "Titre": "I ordered my glasses almost a week ago…",
          "Contenu": "I ordered my glasses almost a week ago and just yesterday I got a tracking number but no info on the carrier or a potential delivery date. I know times are tough right now but I have ordered many other products from other companies and have either received them or atleast have a date to expect them."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jareth Cook",
          "Nb_Reviews": 1,
          "Date": "2020-05-08T16:17:02.000Z",
          "Titre": "Haven't received the glasses yet but…",
          "Contenu": "Haven't received the glasses yet but I'm sure they will be good.I just had one thing I wish it had a price conversion for internationals or even just actually have the USD shown as I'm Australian and didn't realise it was US so thought I was spending $80 ended up spending like $140"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brittany",
          "Nb_Reviews": 2,
          "Date": "2019-11-26T14:38:28.000Z",
          "Titre": "Not cost efficient",
          "Contenu": "The frames are nice and seem to be of decent quality however, wearing them causes a dizzying effect for me. They created more eye strain while working on a computer and caused a headache. The small frames are still very loose and do not feel secure. I feel that these glasses are not worth the $80 I spent on them. This is my own individual case and should not be a deciding factor on someone else's purchase as their experience may be completely different. Ordering was simple and shipping was within reason."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melvin",
          "Nb_Reviews": 1,
          "Date": "2020-10-17T16:06:06.000Z",
          "Titre": "Glasses fit great and I like them but…",
          "Contenu": "Glasses fit great and I like them but cleaning cloth was not in box like the advertisement said and the glasses were covered in some kind of white dust. Not sure what dust was. Overall I’m am happy with my purchase. Was just those two minor things that I have to nitpick about."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randall Terry",
          "Nb_Reviews": 1,
          "Date": "2019-10-18T04:01:55.000Z",
          "Titre": "Love the glasses but I did not like the…",
          "Contenu": "Love the glasses but I did not like the fact that you guys shipped the wrong glasses and I had to wait for you guys to ship out the right ones until I shipped the wrong ones back to you.  Should have been in the mail carriers hands on the way to my house immediately.....but they are sleek glasses!!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Will Shaw",
          "Nb_Reviews": 1,
          "Date": "2019-07-21T15:40:16.000Z",
          "Titre": "Mixed results",
          "Contenu": "My first pair of glasses I got the Trooper frame with the amber lenses two years ago.  I have been very happy with those glasses.  I decided to get some clear lenses, so I chose the PPK frame with clear lenses.  I am considerably less happy with these glasses.  They get reflective glare spots from every light source and do not hug my face very well.  Every time I look down they fall off my face.  So I have mixed emotions about Gunnar right now.  I was really hoping these glasses would be as good as my last pair."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SlyHooliganPlays",
          "Nb_Reviews": 2,
          "Date": "2020-05-08T18:33:25.000Z",
          "Titre": "Virtual Try-On circa 1997",
          "Contenu": "In your augmented reality ‘Virtual Try-on’ feature, all of your glasses look like they were created in Microsoft Paint. Snapchat glasses filters look better in every example I've seen. I’ve purchased 4 pairs in the past, so hopefully the ones I ordered are up to the same quality!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Some Guy",
          "Nb_Reviews": 1,
          "Date": "2019-07-25T17:44:35.000Z",
          "Titre": "Glasses",
          "Contenu": "Glasses?  5/5.  Love these.  But they totally ignore insurance.  For my $300 purchase, I got $80 back from insurance, and that capped out my insurance for the year.  I'd have gotten 2 pair of $400 prescriptions had I not wasted my insurance benefit on gunnar.  When I asked which insurance companies they work best with, nobody had any clue or any desire to find out.  If you're paying out of pocket, you'll have a great experience.  If you're going to try to use your vision insurance, expect a 1/5 experience with Gunnar."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T16:24:58.000Z",
          "Titre": "The glasses are stylish",
          "Contenu": "The glasses are stylish, classy, and comfortable. They do protect my eyes. However, when I'm watching something with a dark background on the computer screen the glasses cause there to be ghost images on the screen. Not very cool. Also there is some kind of reflection but I don't know where it's coming from but it's like there's two small blue lights in both the right and the left lens. Pin hole size but they're definitely there at times and I don't understand that. That is why I'm giving it rating of 3 stars"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dustin",
          "Nb_Reviews": 2,
          "Date": "2022-01-21T12:53:09.000Z",
          "Titre": "All was well",
          "Contenu": "All was well. I did however hear GUNNAR offers a 5% discount to veterans at checkout via ID.meUnfortunately I did not see that option anywhere, so I don't believe that actually offer a veteran discount."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Meg WI",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T18:28:01.000Z",
          "Titre": "Product transparency",
          "Contenu": "Made in China... Tried to find out this info on the website before I sent my order, but figured I would take the chance.  Not trying to be racist or whatever society calls it now, but I am trying to be an American patriot, since I'm 3rd generation American born and proud of my country. Besides that, they're good glasses. Lightweight, comfortable, and I did notice my eyes felt a bit better after just a couple days of use. I would just suggest being more forthcoming about where your product is manufactured since you advertise being started in America by a husband and wife.. You make it seem like this is an american product but it is, in fact, not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lacie Broten",
          "Nb_Reviews": 1,
          "Date": "2020-02-18T18:27:44.000Z",
          "Titre": "Nonprescription lenses have magnification",
          "Contenu": "Glasses are cheap in quality, they feel like something you can get at a department store. They are stylish. Main problem is they have a slight magnification even on the nonprescription lenses. They caused headaches for me instead of relieving them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cody",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T13:31:44.000Z",
          "Titre": "Uncomfortable and misaligned hinges",
          "Contenu": "Quality of the frame at the hinges is poor and misaligned. I'm not sure how effective they are, as I can't wear them with my headphones. The plastic is hard and thick, which increases the pressure pushing on my head with headphones on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2020-04-19T23:06:21.000Z",
          "Titre": "Unusable but solid glasses",
          "Contenu": "The glasses seem great honestly, but they are so tight on my head that they are useless. I have a bad headache after 5 minutes with them on because they squeeze my temples. Hopefully I can get a refund. Other than that, the glasses seem solid."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2020-12-12T04:21:36.000Z",
          "Titre": "I wish I could review them",
          "Contenu": "I would love to review my product but I haven’t received them yet. I would be glad to change this review once they show up but usps is taking their time getting them here. How long do I wait for reporting a lost package with you?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "zoom for days",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T20:19:38.000Z",
          "Titre": "The glasses are GREAT - However …",
          "Contenu": "The glasses are GREAT! The frames are so cute and they block the blue light so well; however, I wish they had come with a hard case to protect them, which I feel like should have been included given the price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dario Petronzio",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T14:04:38.000Z",
          "Titre": "Cheap Plastic Frames, but great customer service",
          "Contenu": "Gunnar Order #240825$200+ Enigma Prescription GlassesPurchased in 10/19, ~18 months later, stress marks in the frame, which were initially just unsightly, finally broke and rendered the frames useless. I've never had a $3 pair of reading glasses break in this manner, let alone a $200 pair. I keep this in a temperature controlled area, they never leave my apartment, and the worst stress they've been exposed to is being on my face when I've fallen asleep in them.  The lenses were great but it's hard to use them without frames.UPDATE: Gunnar Customer Service reached out and replaced the frames for free, shipping 2-day expedited. I appreciate them standing behind their product."
        },
        {
          "Note": 3,
          "Lieu": "EE",
          "Pseudo": "Indrek",
          "Nb_Reviews": 1,
          "Date": "2020-07-19T09:45:19.000Z",
          "Titre": "Shipping is too expensive",
          "Contenu": "It can’t be anywhere near 5stars, because i had to pay double of it’s price because of shipping. Not anywhere is mentioned that I have to pay another 20$ for toll fee if buying from Europe. There isn’t any compensation for it aswell."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Itamar Gat",
          "Nb_Reviews": 1,
          "Date": "2020-06-27T18:59:45.000Z",
          "Titre": "Disappointed",
          "Contenu": "Ordered a pair of readers with clear lens but unfortunately the lens has a yellow tint. Had to return them and pay for the shipping.The company seem to not care one way or another why I was returning the glasses. I was never asked."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fr Wood",
          "Nb_Reviews": 2,
          "Date": "2020-06-02T17:04:41.000Z",
          "Titre": "Great glasses but...",
          "Contenu": "Great glasses but very difficult to ascertain frame size without opening the description of every pair of glasses.  This metric should be searchable.  Also, provide all lens options for each frame (i.e., 98% amber in Haus frameset)."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Miguel Angel Madero Soto",
          "Nb_Reviews": 1,
          "Date": "2022-01-22T05:06:29.000Z",
          "Titre": "I ordered prescripcion lenses",
          "Contenu": "I ordered prescripcion lenses. I wanted to find easy and clear information on everything that i would need to do regarding the prescription information needed, especialy ordering from another country. It was kind of difficult!  Took me a while to go ahead and order, hoping that everything would go smooth. I order in the past gunnar lenses (no prescriptions) and the delivery was terrible since the lenses arrived from the shipping all wracked. You were kind enough to replace them. This time I order a hard case as well, hoping that you put my glasses in there, before you send them to my country. I hope you can or at least make sure they are well kept in a hard, solid package.Other than that i Must say that I LOVE Gunnar Glasses style, looks, protection, etc..  it is just amazing. Thank you!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John C",
          "Nb_Reviews": 2,
          "Date": "2020-05-07T15:42:43.000Z",
          "Titre": "I reached out to support immediately…",
          "Contenu": "I reached out to support immediately after placing my order and never heard anything back. I still haven't heard anything back. I needed to make a change to my order that shipped FIVE DAYS AFTER I REACHED OUT TO SUPPORT. You had plenty of time to fix the issue I have. Now I have a product on its way to my house that will very likely need to get shipped back.I'm so disappointed.EDIT: A day after posting this review a customer service representative reached out to me to help resolve my issue. I have received a pair of glasses and began wearing them today. I'll update this to three stars while I test the glasses and will report back if my review changes."
        },
        {
          "Note": 4,
          "Lieu": "CR",
          "Pseudo": "Christian Sibaja",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:33:24.000Z",
          "Titre": "I cant give  you 5 stars because the…",
          "Contenu": "I cant give  you 5 stars because the site was not letting me make the \"buy\" cuz u guys have sold out ur free package on 1rst buy, wich i had forcefully drop from cart.. sad cuz i wanted it.. anyways i spent like 30 mins on that fail buy issue. Depending on how good these glasses are ill probably buy more.. the rest is all good."
        },
        {
          "Note": 4,
          "Lieu": "CR",
          "Pseudo": "MELVIN SANCHEZ GONZALEZ",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:49:49.000Z",
          "Titre": "The purchase was almost perfect.",
          "Contenu": "The purchase was almost perfect.My first order was canceled due to security issues that I understand. By the time they told me it was too late and I couldn't take advantage of the offers.With my second order everything went wonderfully.By the way, excellent customer service via chat.Thank you so much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T19:16:00.000Z",
          "Titre": "The ordering process was a bit…",
          "Contenu": "The ordering process was a bit disappointing. I thought I had a bonus (a free case), but that turned out not to be for my region. I’ve ordered two additional pairs and now have a total of five pairs - that is if my family would stop “borrowing them” lol. Great computer glasses."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tanner",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T23:02:54.000Z",
          "Titre": "HOLY SPAM EMAILS BATMAN",
          "Contenu": "Most of the experience was great. The CS rep who emailed back and forth with me was prompt and helpful. The time it took to get my glasses made sense. Ordering and the website are intuitive and good.As soon as I confirmed my order I started receiving at least one email a day regarding deals about purchasing pairs of glasses. Early black Friday deals specifically. Now, I paid full price for my glasses. I'm not a baby. I know sometimes sales happen after you place an order. The company doesn't owe me any kind of sale price on my purchase or anything. It was bad luck.Did they have to bombard me with email, after email, after email regarding these sale prices and offers on new pairs of glasses when I didn't even have the glasses I ordered in hand yet?! Seems like a bit of an oversight. My recommendation would be to delay the email blasts until after the ordered items have shipped."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabby",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T20:44:55.000Z",
          "Titre": "Overall good experience shopping",
          "Contenu": "Overall good experience shopping. I would like to have the option to sort my options by Bestselling, Price, Customer Preferred/Reviewed, etc. I haven't received them yet, so I can't speak to the quality, but I've heard nothing but good things about them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Ray",
          "Nb_Reviews": 4,
          "Date": "2023-07-04T23:10:29.000Z",
          "Titre": "Doctor recommended",
          "Contenu": "Gunnar optics was recommended to me by my eye doctor because I needed amber glasses to help me see better while driving day and especially nighttime. My order will arrive in a day or two.  Would like to have seen on your web site a category of glasses directed toward Anytime/Driving.  Hard to find your glasses that assist with anytime wear and driving in your web categories of Computers, Gaming, etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James DiBlasi",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T19:12:31.000Z",
          "Titre": "Tracking number issue (Resolved)",
          "Contenu": "Item was flagged as shipped on August 7th via email notification, USPS shows label was created and then cancelled on same day. After 3 days I reached out to support and they quickly confirmed that the item was indeed shipped and provided a new tracking number."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derrell Clark",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T14:06:26.000Z",
          "Titre": "It would get a 5 star if they didn't…",
          "Contenu": "It would get a 5 star if they didn't have the logo on the left lenses."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donivan Berthold",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T02:22:27.000Z",
          "Titre": "I love my glasses and how they look",
          "Contenu": "I love my glasses and how they look. I was dissatisfied with the communication since I received a confirmation email and hadn’t heard from them since. I downloaded the “Route” and “Shop” app and neither had shown anything until 2 days before it arrived. Simple miscommunication that I got way too angry about. As the company grows I hope they can consider some kind of “progress update”, if it’s even possible, for the impatient hot heads like me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stew Pidasso",
          "Nb_Reviews": 3,
          "Date": "2023-08-26T22:29:04.000Z",
          "Titre": "GOOD PRODUCT",
          "Contenu": "I love my new glasses except for one thing,The lenses were not balanced. I have only one eye so glasses with prescription just one one side draws attention to that fact by not having the same or any magnification on that side.  I guess I could have stressed that a little better."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph LeBlanc",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T13:13:56.000Z",
          "Titre": "Incomplete Order, But Support Was Very Helpful in Correcting It",
          "Contenu": "I received my Stark Industries model glasses, and so far, I have noticed significant reductions to digital eye strain that I was experiencing at the end of the work day, however I did not receive the lens cleaner kit that I ordered along with it. ~$10 add-on, but still makes my order incomplete.Glasses get 5-stars from me, they do what they are designed to do. However, I have to give the service a 1-star review since this was my first experience purchasing from this company and my order was not completely fulfilled, despite the tracking info saying otherwise.Review Edit: Changing review to 4-stars after Gunnar Support reached out and sent me a replacement lens cleaner kit at no cost to me thanks to the Route protection plan I purchased. Angela S. was very quick to respond and polite."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wave",
          "Nb_Reviews": 1,
          "Date": "2022-11-05T00:41:58.000Z",
          "Titre": "Sexy glasses for a non sexy man",
          "Contenu": "I really liked the option to try on glasses virtually, my only issue is that the color doesn't change depending on what you pick, it's always the Amber coloured lense instead of clear for instance. (Even when clear is selected) If that could be changed that'd be great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SweetP",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T22:55:47.000Z",
          "Titre": "Tech Issues aside, everything else was top notch",
          "Contenu": "Shopped at gunnar.com for some glasses and had trouble with the virtual try-on feature. I didn't want to buy without trying, so I emailed customer support. They suggested I try using my phone instead of the computer browser. That worked and I purchased my lenses with no problems. I got several emails after purchase reminding me to buy what I left in my cart (which was nothing) so that was annoying. Support was understanding and fairly quick. I got my glasses in a couple of days, and they're great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J G",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T21:12:55.000Z",
          "Titre": "Professional customer service and a couple suggestions for improvement",
          "Contenu": "Angela professionally handled a partial fulfillment of my order. One item went out of stock, and I was informed there was no way to keep it open as a backorder or be notified when the item was back in stock. To improve the experience, both of these options should be considered for future implementation. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Overly",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T21:17:10.000Z",
          "Titre": "1st Gunnar purchase",
          "Contenu": "Negatives-Shipping took way longer than I expected. The 2 day shipping is a bit misleading when the product takes weeks to make. I wasn't expecting 2 day turn around, but I wasn't expecting 30 days either-no ability to call in and make changes. I entered the wrong PD and was concerned it was going to production before I could correct. I had to send an email and wait for a responsePros-The frames and lenses are high quality. So far they were worth the wait.-My insurance covered most of the cost (they are out of network)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AARON OLIVAS",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T15:45:14.000Z",
          "Titre": "Overall website is good I just think…",
          "Contenu": "Overall website is good I just think that there needs to be more pics of the glasses and higher resolution photos. Some of the color ways only have a single photo from the front. When you don't have the physical object in front of you more pictures to look at help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Praveen",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T21:51:53.000Z",
          "Titre": "I expected at least a box to store my…",
          "Contenu": "I expected at least a box to store my glasses or cleaning cloth. I ordered a prescription glasses which was so costly (than normal ones) but no accessories were given to maintain. The make and fitting were very good though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Tepper",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T21:55:07.000Z",
          "Titre": "Great Product and experience!, Hopefully a matte finish will come soon to the gaming glasses.",
          "Contenu": "Everything was great!.. but one item was not in stock and it is kind of a bummer.  The clear lens was available in other frames but not the clear, which doesn't make sense as they are the same lenses and size just different frames.  I also wish you had frames in a matte finish."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andres Ramirez Fuentes",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T08:01:00.000Z",
          "Titre": "Everything was Ok! except for one detail.",
          "Contenu": "The product quality is awesome as Always. Excellent product, brilliant design, and fair value. The problem that I see is the tracking process. I paid, and I could not see any progress on the website, I just had to wait without any feedback about time or ETD. It was worrying not to be able to know what happened to the purchased product."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Adrian Zguri",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T10:01:34.000Z",
          "Titre": "I love these glasses",
          "Contenu": "I love these glasses. Have been wearing them since 2013 and never had eye strain.The only downside that i have now is the reflection on video calls. The party at the other side of the camera can see what is on my 2 screens from the glasses.Beside this, I can only recommend them, either for gaming or working on the pc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherry Q",
          "Nb_Reviews": 11,
          "Date": "2023-08-31T23:10:11.000Z",
          "Titre": "I really love these glasses",
          "Contenu": "I really love these glasses - super stylish and I believe they work because I don’t feel the burning eyes or eye strain while using my devices or watching TV - I just wish I could have better sizing but I can live with that given all the benefits!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julian Castillo",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T02:17:44.000Z",
          "Titre": "Better alternative than buying gunnar prescription glasses",
          "Contenu": "The Clip ons are great. I bought Prescription glasses from gunnar, but right now I am having a problem with them... distorted areas, causing headaches, and just not usable.I bought the clip ons because I needed a blue light filter on my glasses ASAP. They work great! Although how they attach to your glasses could be better. It doesn't fit on to my glasses perfectly (I have thick frames) but it stays on still.I took one star off because they look like they break EASILY. VERY EASILY"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bigtexis",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T23:01:19.000Z",
          "Titre": "I love the gamer glasses",
          "Contenu": "I love the gamer glasses, these glasses haven't arrived yet. The only Reason that I gave 4 stars instead of 5 stars it's because I ordered these glasses and they were on back order. The problem with that is that I didn't know that it was a back order so I was looking forward to receiving them sooner. I will Do an update Once I receive the Tony Stark game and glasses. As far as all the other gaming glasses that I purchase from this company, they are awesome. I get these glasses for myself and for my youngest son who is also a gamer. Thank you so much And keep up the good work. If you are looking for great glasses To protect your eyes then Look no further, These glasses will definitely meet your expectations"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Wilcox",
          "Nb_Reviews": 8,
          "Date": "2023-03-22T09:18:09.000Z",
          "Titre": "The glasses received were exactly as…",
          "Contenu": "The glasses received were exactly as described in the pictures on the website, the right size and beautiful color. I am very satisfied with it, good quality and fast delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T22:05:23.000Z",
          "Titre": "lenses are great",
          "Contenu": "lenses are great. The biggest difference is my eyesight is better and my eyes can go for a longer time. my only issue is the frame is a bit short for my head and im not sure if there was an option to get an extended frame. otherwise greast product and looks good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Haist",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T20:12:23.000Z",
          "Titre": "i havent recieved my specs yet",
          "Contenu": "i havent recieved my specs yet, but the buying process was easy and when i didnt have all the information the rep who reached out to me was helpful and prompt"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mr. Christl",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T23:12:59.000Z",
          "Titre": "Shipped on time as Gunnar promised.",
          "Contenu": "I have to admit I have not tried the computer glasses yet, but they  showed up right on time just as Gunner  Promised they would."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noah",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T20:04:36.000Z",
          "Titre": "Great design. Look like Tony. But Tony could afford better quality frame materials.",
          "Contenu": "The design of the glasses are great. Gunnar sun lenses are stellar for my eyes.The case is nice too.My only gripe is with the quality of the frame itself. They feel flimsy and cheaply made. Unless you are the huge marvel or Tony stark fan, I would pass on these due to the price. You'll get more for your buck with the Maverick frame, (They don't feel flimsy in the hands)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don Varenhorst",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T00:47:08.000Z",
          "Titre": "I was hoping to get a discount code for…",
          "Contenu": "I was hoping to get a discount code for the purchase. I get the emails but unsubscribe because I can only buy glasses once a year.... I'm just not that rich... I wish I could get the emails that have discount codes only."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan Ninneman",
          "Nb_Reviews": 2,
          "Date": "2023-04-22T17:18:08.000Z",
          "Titre": "Relaxed eyes",
          "Contenu": "My eyes feel the freshest they have felt even after a long work day in front of a computer or hours of gaming"
        },
        {
          "Note": 4,
          "Lieu": "OM",
          "Pseudo": "Mahmood",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T11:35:23.000Z",
          "Titre": "It is flexible and fast to find what…",
          "Contenu": "It is flexible and fast to find what you want exactly but as some of the products are new you may not find it in general Gunner glasses and sunglasses safe my eyes really"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A",
          "Nb_Reviews": 4,
          "Date": "2023-06-12T17:01:54.000Z",
          "Titre": "Overall a good/easy ordering…",
          "Contenu": "Overall a good/easy ordering experience.  Until I receive my order, this is the update so far."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Karimy Schenfeld",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T21:57:13.000Z",
          "Titre": "Great Product",
          "Contenu": "Great Product with a good Price."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "PlagueRoot",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T23:34:46.000Z",
          "Titre": "It took a long time",
          "Contenu": "It took a long time, was sometimes confusing. They are good glasses and have been very helpful. They are quite light though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard S Lewis",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T04:46:33.000Z",
          "Titre": "Easy to find what I needed",
          "Contenu": "Easy to find what I needed, but should explain better what each item is for in the preview."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Haaziq Chundrigar",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T04:35:17.000Z",
          "Titre": "Quick and informative responses",
          "Contenu": "The actual order was a bit slower to ship out than I expected, but the response from the customer service about the status of the order was very quick and informative."
        },
        {
          "Note": 4,
          "Lieu": "DO",
          "Pseudo": "Ubaldo Perez",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T23:01:28.000Z",
          "Titre": "Fast and easy shopping experience.",
          "Contenu": "I was looking for reading glasés with fixed measures. Found it here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul McTeigue-Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T01:24:27.000Z",
          "Titre": "“Sometimes you gotta run before you can walk.”",
          "Contenu": "Look phenomenal, works well, could be more comfortable"
        },
        {
          "Note": 4,
          "Lieu": "PE",
          "Pseudo": "Daniel Inouye",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T21:52:36.000Z",
          "Titre": "Highly recommended products",
          "Contenu": "Good products, good quality for daily usage."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carrie Leeper",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T00:20:10.000Z",
          "Titre": "You can see the blu blocking difference",
          "Contenu": "Very thorough."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Natalia G",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T00:27:13.000Z",
          "Titre": "No Order Confirmation",
          "Contenu": "This is the first company that doesn't send an order confirmation via email and there's no tracking on the package. Luckily it arrived within a week but a real lack of communication with the customer on the order. I just received my order so I'll see how the glasses turn out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Barker",
          "Nb_Reviews": 5,
          "Date": "2022-01-18T15:38:53.000Z",
          "Titre": "Gunnar Optiks offers great glasses",
          "Contenu": "Gunnar Optiks offers great glasses. However, the reading glasses section was a little lacking this time. I did buy the kids glasses for gaming however, I ended up going elsewhere for mine as I need readers. I have been with Gunnar for years, I just don't like the styles available for readers. Sad, they produce quality glasses at ok prices. They just have not kept any styles old folks might like."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Ryan Mellado",
          "Nb_Reviews": 2,
          "Date": "2021-12-10T19:36:56.000Z",
          "Titre": "Came Late - Had a Defect",
          "Contenu": "I bought a pair of gunnars. They arrived about 12 days later on 2-day shipping only to have a cut on the lens near the logo on the inside of the lens. Had to put in a ticket or something similar and they responded that day and even sent new ones via priority shipping within about 2 days. First time in a while where ive experienced a business own up to a mistake/issue so promptly. Kudos."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roy",
          "Nb_Reviews": 3,
          "Date": "2022-03-24T15:52:51.000Z",
          "Titre": "I have a big head",
          "Contenu": "I have a big head. So I need glasses with arm length of 145mm minimum. And I couldn't find anything that fits the requirement. So I bought one and hope that it won't fall off when I lean down. Otherwise I will have to return it.Please provide options with longer arm lengths.Otherwise I really love the designs of the products. Would have bought more expensive and cool looking one if there were more size options.Edit: the glasses don't fall off and despite being on the smaller side for me wearing them wasn't uncomfortable. Would buy again from here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katie",
          "Nb_Reviews": 2,
          "Date": "2021-10-29T20:10:36.000Z",
          "Titre": "Absolutely love being able to \"preview\"…",
          "Contenu": "Absolutely love being able to \"preview\" what the glasses would look like on me. I changed which ones I actually got from what I originally wanted to get :) The one gripe I had was having to leave the preview window to change which glasses I wanted to preview. It didn't seem to load a new selection from within that window. It would also be cool if it would temporarily save an image so you can easily compare different glasses you've tried on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim Pittsburgh PA",
          "Nb_Reviews": 1,
          "Date": "2022-02-25T15:19:27.000Z",
          "Titre": "Great glasses!",
          "Contenu": "Everything from looking through all the styles to ordering them to receiving were great.  I particularly liked how you could virtually try on the frames to see how they look on you.  I noticed an improvement the first time I wore them. My eyes weren't nearly as tired when I wore them.  However, there is one thing I believe can be improved upon; the weight of the glasses.  I work in front of two monitors from anywhere between 8 hrs - 10 hrs per day.  These glasses become very cumbersome heavy as the day wears on. Hopefully this can be addressed with future designs."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Todd Batrynchuk",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T07:50:50.000Z",
          "Titre": "The Vertex Amber Max glasses arrived",
          "Contenu": "The Vertex Amber Max glasses arrived. However, there is a Canada customs charge of $10 associated with the purchase. After having paid $29 USD for shipping alone for glasses priced at $50 USD. According to support staff, there is no USPS option for Canada. There should be. Since this would offer a lower shipping rate and avoid any Canada Customs fees."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samantha Nowlan",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T00:45:01.000Z",
          "Titre": "The glasses looked and felt great…",
          "Contenu": "The glasses looked and felt great overall. They definitely work great for computer time. My only minor issue was the lenses were curved causing more distortion in my proessives then I expected or liked. However, a quick adjustment at my optometrist and all became clear."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Greable",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T18:55:55.000Z",
          "Titre": "The blue light blocking glasses are…",
          "Contenu": "The blue light blocking glasses are less expensive than most places. And they definitely work!! I bought 3 pairs; one Sun, Amber and Amber Max all in the Onyx frame. The only reason for 4 out of 5 stars is the icons / logos they place on the upper side of the left lens. They are in my eye line and make me think they are dirty or I am seeing something. Unfortunate they felt the need to place these icons on the lenses that cannot be removed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DT",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T01:12:26.000Z",
          "Titre": "Get the aviator style glasses; you won’t regret it!",
          "Contenu": "Absolutely LOVE the glasses! They look even better in person and I love the frame on them too. I bought the aviator style. I would have given a 5 star review, but I noticed that the lens slightly zooms everything in. I don’t wear prescription glasses, so I noticed this slight change. Tomorrow will be my first time wearing them to work (I work on a computer all day) and I’m excited to see how I adjust to wearing them for several hours at a time and how I feel afterwards."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heather Butikofer",
          "Nb_Reviews": 3,
          "Date": "2022-01-15T00:42:14.000Z",
          "Titre": "Finally a company with some customer service",
          "Contenu": "From my phone there was no option to chat with anyone so I filled out the contact question form and no one got back to me. Once I found out there was chat available on the computer my experience improved greatly. The chat person was very helpful. She helped me get ahold of an RX guy that was also very helpful. I am very impressed with the price and the fact that my script could be filled. I have tried multiple companies and they were unable to fill my script, or wanted $700 for 35-45 % blue blockers. Can’t wait to recieve my glasses, never thought I would say that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kyle a.",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T15:34:31.000Z",
          "Titre": "Good, but TOO yellow",
          "Contenu": "Honestly, there's nothing wrong with them. They're pretty good at blocking blue light, they're durable (I went camping, got slapped across the face with them, and even slept on them -- they're still not bent or broken), and they look good on me. My only reason for taking off one star is that the amber is too yellow; I feel like Johnny Depp in Blow or something. Wish I would've gotten the clear ones instead."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Taisiia Liakhova",
          "Nb_Reviews": 2,
          "Date": "2021-10-31T05:00:01.000Z",
          "Titre": "I am having my first pair of Gunnar…",
          "Contenu": "I am having my first pair of Gunnar Rush for a week. Wearing it after 4pm, when it is growing dark outside during the Fall. I feel the difference, it is much easier to look at my screens in the glasses even though I set the nightshift warmth mode. I will keep using them. After I placed the order, I kept browsing the site and, out of blue, I received a pop-up message offering a discount if I subscribe to Gunnar's. I wish I could get that discount notification before submitting my order. Keep an eye on such a discount ;)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "eric depa",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T21:00:01.000Z",
          "Titre": "These have the best optics I've found…BUT...",
          "Contenu": "These have the best optics I've found so far, BUT they ruin it by engraving their name into the lens causing the most unbearable distraction. To the point I may not be able to keep waring these glasses. What the hell were you thinking!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marco Segura",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T17:24:22.000Z",
          "Titre": "Item arrived a day earlier than…",
          "Contenu": "Item arrived a day earlier than expected, this is my second pair and I love them (will be exchanging them for a different pair that fits my style a bit better and their return policy is awesome)Edit: Their exchange policy IS good, but the exchange process if not up to current standards, no shipping label provided, and the process takes about 2 weeks, not really customer friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Lefont-Woolls",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T17:21:09.000Z",
          "Titre": "Helped with my headache",
          "Contenu": "This has really gotten rid of my headaches. I've been having them every single time I've used my computer but now they're almost completely gone. My only complaint about these clip-on amber gunners they interfere with my peripheral vision, they are way too close my glasses focal point. I could try to bend the metals with some pliers but I would fear breaking. A suggestion I have if possible is there should be ones that come with legs at different distances for different glasses gaps or some sort of adjustability."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Williams",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T21:06:24.000Z",
          "Titre": "Would recommend",
          "Contenu": "I think the glasses so far are very well made and they took a little to adjust to the color but they make everything look a lot nicer. I also think that the care in the way it was shipped and packaged was a nice thing to see. The only thing that I wasn’t able to find were different size frames but other than that they are great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cary Bunker",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T14:30:01.000Z",
          "Titre": "I have 3 pairs and really am impressed…",
          "Contenu": "I have 3 pairs and really am impressed with the lenses. Prescription Enigmas are the best for me because of the matte onyx finish and the tight fit. Vertex are the worst for me because of the gloss onyx finish is slippery and they will slide off my face. I did not realize Vertex were gloss onyx or I would not have ordered them so replaced them with Enigmas with the RX transitions lenses and love them. Best glasses I have ever purchased overall but rather expensive too. Highly recommended once you find what fits properly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David C",
          "Nb_Reviews": 2,
          "Date": "2021-04-19T15:23:40.000Z",
          "Titre": "Love the Intercept, but the clip-on is just okay",
          "Contenu": "The 'intercept' are great glasses and fit comfortably! The 'clip-on amber' is a tad short so when I clip them on to my glasses there is a break toward the bottom of the lens that make it feel like I'm wearing bifocals. Other than that the amber is a great tint and works well for working in front of a computer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick Michailides",
          "Nb_Reviews": 1,
          "Date": "2022-01-26T20:22:58.000Z",
          "Titre": "This will be my second pair of GUNNAR…",
          "Contenu": "This will be my second pair of GUNNAR glasses. My first pair had a lot a milage on them and ended up needing to be retired. I bought rhese because I was getting excruciating headaches while working on the computer. I was skeptical but they truly work."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "ALI",
          "Nb_Reviews": 1,
          "Date": "2021-05-09T21:21:03.000Z",
          "Titre": "I want to give you a five stars, but...",
          "Contenu": "I want to give you a five stars, because I think you're good! But I had a problem with the shipping. The shipment was cancelled without notifying me. In addition, when I contact with you to solve it, there was no strong argue for stopping my order and this make some delay to my order. However, I want to say thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2021-04-08T00:51:46.000Z",
          "Titre": "The lens quality has changed my life",
          "Contenu": "The lens quality has changed my life. I work on computers all day, and that caused me headaches and eye fatigue. Now it's much better. I got so much relief. The one downside is the glasses are too big. When I tried the Menlo glasses on via the website, the glasses looked like they would fit great. In reality, they are too big for my head size, but they fit in the bridge.  I'm happy with them because of how great they make me feel after a long day of screen time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sunder Arun",
          "Nb_Reviews": 2,
          "Date": "2021-01-19T19:47:36.000Z",
          "Titre": "It by default comes with a small power…",
          "Contenu": "It by default comes with a small power and that causes discomfort for some and for exchange or return they don't send return label. You have to pay for it. The customer services take many days to respond and they do not respond to calls.Update on Jan 19 2021: Customer Service provided the label for return and replaced the Glass      with 0 power. Appreciate Customer service and the product performs as claimed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sean R.",
          "Nb_Reviews": 1,
          "Date": "2021-02-14T15:02:07.000Z",
          "Titre": "So far pretty good",
          "Contenu": "So far pretty good. Seems to really enhance all the txt on my phone and seems to make a big difference when reading long emails. Only downfall is I really like these glasses and spent almost $50.00 on them, so I wished they came with a hard case to protect these great glasses, instead of a soft case. Great Glasses!🤓👍🏻"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "August Baltutat",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T03:01:20.000Z",
          "Titre": "That’ll do.",
          "Contenu": "They’ll work for now.  I like Gunnar overall as a brand for the lens quality above all.  The structure of my last pair was okay, but the nose pieces got bent and one of the pads fell off.  Also the cool neon green coating flaked off quite a bit.  This pair is just solid black so I’m not expecting to happen this time.  The frames feel a bit small for my face but they aren’t uncomfortable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug B",
          "Nb_Reviews": 1,
          "Date": "2021-01-25T18:40:44.000Z",
          "Titre": "Was skeptical at first whether or not…",
          "Contenu": "Was skeptical at first whether or not these glasses would do the trick. I find that I often use my iPad after dinner and watch Netflix as well, but would have trouble falling asleep. After a week of use, I found myself getting drowsy earlier which was exactly what I wanted. The yellow lenses take some adjustment and seem to be a bit more hazy than a normal set of glasses (lens quality?) but they definitely do the trick in reducing the blue light spectrum."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raymark Cabildo",
          "Nb_Reviews": 1,
          "Date": "2020-10-27T21:21:42.000Z",
          "Titre": "Good to Great Glasses",
          "Contenu": "Great computer glasses overall. I bought this because I was looking for more quality glasses instead of replacing cheaper and flimsier glasses from amazon. Time will tell if it holds up, but it's reduced my eye strain significantly and I squint a lot less. 1 star deduction because it smudges more than I'd like, and it's tight on my head, though I do have a bigger head than most."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M. W.",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T20:30:21.000Z",
          "Titre": "Easy purchase and shipping. Gift buyers beware of Branded packaging.",
          "Contenu": "Purchasing and Shipping went quickly and smoothly! The frames are REALLY thin and flexible, so I'm waiting to see how well they hold up. NOTE: I bought these as a Christmas present for my husband, but the package comes super branded and there is no option for discrete/gift packaging. So when he got to the mailbox before me he found out what one of his \"larger\" presents was. Kind of disappointing on my side. Other than that, impressed so far!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2021-03-30T16:19:30.000Z",
          "Titre": "Need more details about the glasses so easy to choose the right fit.",
          "Contenu": "They work alright I'm not sure if it's supposed  to but I had a glare on the inside. I might have bought the wrong type because  my eyelashes hit the lens and it's very annoying. I'll have to try out a different  pair ill end up giving  these to a friend. Just wasn't the best fit for me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JShaw",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T17:09:34.000Z",
          "Titre": "The glasses are well made",
          "Contenu": "The glasses are well made, fit well and perform as advertised.  I have been satisfied with Gunnar glasses in the past and the quality level continues to be excellent.  I did feel that not including a hard case with glasses of this quality takes away from the positivity of the experience.  However, overall the product is excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vudooz -VudooVII Gaming",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T15:35:50.000Z",
          "Titre": "Excellent purchase",
          "Contenu": "Love the glasses, excellent for gaming!.  I would have given 5 stars but some better padding on the temples is needed, while the current thin design is fantastic for gaming headphones, some kind of thin foam/rubber padding on the inside of the temples would make them feel 100% better. Otherwise I am very happy with the purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 4,
          "Date": "2021-02-08T23:02:10.000Z",
          "Titre": "The glasses are great, one flaw",
          "Contenu": "The glasses are great!  I wear them all the time when on my two 24\" monitors for work.  They make my eyes so much more comfortable.  My only complaint is that they smudge very, very easily.  My eyelashes brush the inside of the classes a little and the glasses immediately pick up the oil on my eyelashes and it blurs the vision.  None of my other non-coated glasses do this.  (I wear glasses all the time.)  I got the Gunnar lens cleaner, but it's a PITA to have to clean them every hour or so."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2021-06-07T13:30:14.000Z",
          "Titre": "Really helpful",
          "Contenu": "I have the clip on’s and the only reason I gave it 4-stars instead of 5-stars is I wish they were stronger (Amber) for my particular need. But I definitely notice a difference and I bought a pair for my father as well. He said they made a difference as well and wears them all day!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2021-01-09T19:20:53.000Z",
          "Titre": "I like the glasses",
          "Contenu": "I like the glasses, would give 5 stars but my cleaning wipes was not in my order. I had to contact them they are supposed to be sending them but I haven't received a tracking number yet. I understand that mistakes happen tho and as long as they send them soon I will be satisfied and would recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Smith",
          "Nb_Reviews": 4,
          "Date": "2021-11-19T18:27:05.000Z",
          "Titre": "Not bad",
          "Contenu": "Edit:The support team reached out to me and offered to replace my glasses and if i still wasn't happy, I'd get my money back guaranteed. I shipped it in and got my new pair within a couple of weeks. My old pair may have been defective in hindsight and I am now happy with my new pair of blue blockers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ameer Smith",
          "Nb_Reviews": 1,
          "Date": "2021-02-13T17:02:44.000Z",
          "Titre": "I ordered the Intercept version of the…",
          "Contenu": "I ordered the Intercept version of the glasses. They work as well as advertised. The only issue i have is that i have a large head, so the glasses squeeze a little on my head. I feel pressure above the ears. So i cant wear them for several hours without a break. Good glasses otherwise"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B.O",
          "Nb_Reviews": 1,
          "Date": "2021-01-10T15:53:25.000Z",
          "Titre": "Great Glasses, Just 1 Personal Problem",
          "Contenu": "The Lenses Were Great Really Helped Reduce Eye Strain ,The Only Problem I Found Was A Personal 1 I Think, But Its Kinda Hard To Get The Glasses Positioned Good Since The Sides Go Straight Back, But Its Not That Big Of S Issue If You Youse Headphones They Help keep The Glasses Up In Place."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cristina Capella",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T17:38:19.000Z",
          "Titre": "Great glasses for reducing blue light fatigue",
          "Contenu": "I am very happy with my purchase. The frames are very stylish and the lenses have a nice yellow hue to block out blue light. I find that I have had less headaches when wearing them to work on my computer for long hours. The only reason I did not give this product 5-stars is because the frames are a bit heavy. Over the course of the day I become fatigued by wearing the heavy frames since they pinch the bridge of my nose and the tops of my cheeks. I didn’t have the chance to try them in before I purchased them or not I would have gotten a smaller lighter frame. However, they do the trick and work nicely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mammoth",
          "Nb_Reviews": 2,
          "Date": "2020-11-10T20:57:48.000Z",
          "Titre": "Intercept eyeglass is OK, but sheadog is excellent",
          "Contenu": "I ordered intercept eyeglass for wearing while working on computer. They are very good except the frame. The frame constantly presses on the side of the head and ear and causes pain. The eye glass with metal frame (model: sheadog) ordered from Amazon looks excellent though and deserves 5 star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gloria Gibson",
          "Nb_Reviews": 2,
          "Date": "2021-02-23T15:21:08.000Z",
          "Titre": "The glasses are good quality",
          "Contenu": "The glasses are good quality, the packaging they came in was wonderful, having cleaner and a cloth in the box was a nice touch, and the lenses appear to be doing their job eliminating eye strain. The only thing that could be better is if they were Made in the USA instead of China."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hill",
          "Nb_Reviews": 2,
          "Date": "2022-03-01T08:01:49.000Z",
          "Titre": "I love the virtual try-on feature",
          "Contenu": "I love the virtual try-on feature. Very helpful for online shopping. Though it has some problem with loading when used on a tablet, using it on PC was pretty flawless other than sometime it doesn't load the lens."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rafael Sanchez",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T02:16:04.000Z",
          "Titre": "Clip-on",
          "Contenu": "Delivery was great, the materials are good quality. I got the clip-on to use on my glasses unfortunately since my frame is a bit bigger the clip-on doesn't fit as well as it should, still my eyes are resting better, i might other glasses after i take my eye surgery. Keep up the good work!"
        },
        {
          "Note": 4,
          "Lieu": "UY",
          "Pseudo": "Nahuel",
          "Nb_Reviews": 1,
          "Date": "2021-07-25T16:45:03.000Z",
          "Titre": "The shipment arrived really fast",
          "Contenu": "The shipment arrived really fast! 3 days and i live in south america. The glasses have been prety good so far hope that they last me a while. I will give them 5 stars if they have free shipping over a 100usd instead of 150, anyways, pretty good experience!."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Averi",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T03:00:57.000Z",
          "Titre": "So far, I'd recommend",
          "Contenu": "It's comfortable and I definitely see a noticeable change. Haven't had it too long, so I'm not sure how amazing it is just yet. But I can for sure see the difference when I have them on and off."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Francisco Manrique",
          "Nb_Reviews": 1,
          "Date": "2020-12-06T15:49:04.000Z",
          "Titre": "Nice experience, recommendations about product information",
          "Contenu": "I find the virtual try-on really nice. Nice website.I think there should be any numbers about different measures such as the height of the rims or the length of the bridge so that it is possible to have any idea how to expect from the product as if it is actually going to fit or not."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Nicholas Beauchamp",
          "Nb_Reviews": 1,
          "Date": "2021-01-20T15:29:19.000Z",
          "Titre": "Really great blue light glasses that…",
          "Contenu": "Really great blue light glasses that are constructed extremely well.  I am having slight eye strain with them that I think is associated with the magnification, especially when viewing light sources that are a few feet away from me.Could just be an issue with me though!"
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Abdulrahman Alfaqih",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T00:00:21.000Z",
          "Titre": "I didn’t receive the shipment yet but…",
          "Contenu": "I didn’t receive the shipment yet but working with fedex shipping company and letting your customers dealing with their poor services is a bad experience for me.I’m hoping that my glasses will be good.Update: I received my glasses and the material feels good with nice fit. The screen color look more calmer, overall nice glasses.I just have one concern about the usage of the glasses, does the gammer glasses can be used for computer and phone or its not recommended i hope you mention that because their is two categories in your website and it’s a bit confusing. Nice glasses nice service 👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle Zablocki",
          "Nb_Reviews": 5,
          "Date": "2020-12-22T13:34:56.000Z",
          "Titre": "Gunnar Optiks..",
          "Contenu": "Gunnar Optiks... AWESOME. But, I still haven't received my glasses yet, probably due to the holiday season. But Gunnar Optiks ordering process is excellent and very easy to use. My order is due any day now and I'm looking forward to my new computer reading glasses."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2021-02-08T22:38:24.000Z",
          "Titre": "Decent",
          "Contenu": "Ordering was super easy and my glasses arrived insanely quick. The glasses themselves I'm pretty happy with. Not as high quality as I was expecting but I guess you get what you pay for. Overall a decent experience but not blown away by the glasses themselves."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Simmons",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T15:17:29.000Z",
          "Titre": "3 days of use, already noticing a week of difference",
          "Contenu": "I've only had them for 3 days but I can tell the difference already. My eyes don't dry out, my screens don't irritate my eyes like they used to, and the transition aspect is a huge help outside. I bought the clear lenses with sunglasses transition. The lenses do have a slight amber tint, but that was to be expected. The transitions will take about 5 mins to full darken and between 5 and 10 mins to lighten back up. Overall I love them. I do wish they didn't have the logo on the lens but it isn't in the way of my view so no too much of an issue there."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kay Strange",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T23:28:33.000Z",
          "Titre": "Had problem with website first time I…",
          "Contenu": "Had problem with website first time I tried to order. Was little worried as card number had been put in twice. but nice young lady helped me on \"chat\" and was resolved. Have  the glasses and all good.thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mae Missana",
          "Nb_Reviews": 1,
          "Date": "2020-11-17T19:15:05.000Z",
          "Titre": "Great pair overall, but smudges way too easily",
          "Contenu": "The glasses fit really nicely and look good! I feel like my eye strain isn't as bad when wearing these glasses. They're light and don't really cause the sides of my head to hurt, but they do slide down my nose often (I have that problem with most other glasses anyways)The only downside is that the lenses smudge incredibly easily. Like, so easily that all I have to do is blink to make a smudge. Luckily this pair came with the cleaning solution and lens cloth as part of the holiday pack, but it can get annoying to constantly take my glasses off to clean smudges off."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2020-12-08T15:13:36.000Z",
          "Titre": "Almost a great experience",
          "Contenu": "Disappointed that I paid $29.95 in shipping as part of the purchase, then Fedex charged me another $15.03 in shipping before they would deliver the package!The product itself was packaged nicely and is high quality, so 1 star doc is only due to shipping debacle."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Arno van Osch",
          "Nb_Reviews": 5,
          "Date": "2020-11-01T23:26:06.000Z",
          "Titre": "shipping was incredibly fast",
          "Contenu": "shipping was incredibly fast, even faster than is written on the site. still getting used to the glasses, but they fit very comfortably. currently they feel like they make the strain on my eyes worse, but i think that's just because i'm not used to them yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noel Mole",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T16:19:24.000Z",
          "Titre": "Love the glasses, but",
          "Contenu": "Love the glasses, however the intermediate distance I was expecting for my prescription turns out to be a mere 2-3 foot distance. This makes them useless for anything other than sitting at my computer or reading, can't watch TV or drive while using them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marilyn Simkins",
          "Nb_Reviews": 1,
          "Date": "2021-04-19T18:08:58.000Z",
          "Titre": "GREAT QUALITY DIGITAL EYEWEAR",
          "Contenu": "GREAT QUALITY DIGITAL EYEWEAR.  Good service overall, with some pending improvements needed in order to make it easier to contact the company via Online Chat, Telephone, for questions, follow ups, or concerns.  Email based customer service is good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon W.",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T15:19:05.000Z",
          "Titre": "Overall it has helped my eyes not feel dry/sore",
          "Contenu": "Overall it has helped my eyes not feel dry or sore after looking at a screen for extended periods of time, but I have notice it can cause a bit of a headache while wearing them, probably just due to my eyes adjusting to them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edwin Hume",
          "Nb_Reviews": 2,
          "Date": "2020-12-12T23:17:14.000Z",
          "Titre": "Acquisition was handled quickly and…",
          "Contenu": "Acquisition was handled quickly and professionally.  Anticipated that the modification of the picture by the glasses would be more pronounced.  Time will tell if it helps the eyes.  Product construction was very good.  Will see if the lens scratch easily."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "For_The_Biscuit",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T05:55:47.000Z",
          "Titre": "I like them, but they hurt a little.",
          "Contenu": "If you wear headphones 24/7 like I do, then don't by these. It's that simple.  Unless you have pads that are made for glasses or maybe super soft foam. Also they don't sit on my ears, bc they squeeze my head and just kinda float on my head.  Bc of that I do get some minor pain and cant wear them for more than a couple hours, so I only wear them for a couple hours before bed.With that out of the way, I really do like these glasses.  They have definitely helped with night time eye strain, and they have helped me with falling asleep.  Plus I think they kinda look hot on me.  That being said I like them, but your mileage may vary."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Spengler",
          "Nb_Reviews": 1,
          "Date": "2021-03-18T00:20:57.000Z",
          "Titre": "Great products",
          "Contenu": "Great products! I bought a pair a few years back and decided to purchase another. There was initially a shipping problem but I contacted customer service and they sent out an expedited package which arrived quickly. I am happy with that service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bronzebeard",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T01:17:45.000Z",
          "Titre": "Easy order! Amazing Selection! Welcome to the GUNNAR Family!",
          "Contenu": "I love how easy it was to order my new glasses! They have many options available and lots of sweet gaming collaborations! My number one reason is for buying GUNNAR glasses is, I have a heavy RX script and after getting turned down by others, GUNNAR has welcomed me and was able to fill my RX, THANK YOU SO MUCH!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Moe",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T22:34:24.000Z",
          "Titre": "Excellent quality glasses",
          "Contenu": "Gunnar has a very good selection of high quality glasses at very reasonable prices, specially if you could get them when they are on sale."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Xavier Buchanan",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:26:07.000Z",
          "Titre": "I had an issue with my order..",
          "Contenu": "I had an issue with my order. I will admit, mistakes were made by the Gunnar support team-But overall, in the end the team resolved my issue and provided me everything I needed in the end to have a great experience.If you have an issue with support, be patient and diligent and in time the issue will be resolved. The product is fantastic, reasonably priced, and an especially great deal during promotions or sales."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ameer ahmad",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:55:49.000Z",
          "Titre": "Quality products",
          "Contenu": "I’m happy with all my orders. I’m definitely a BIG fan of Gunnar products. The styles are amazing & fits my face to perfection. Loved every items I’ve purchased & I am ordering for gifts during the holidays…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason S",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T14:51:53.000Z",
          "Titre": "A healthy way to work",
          "Contenu": "Gunnar gave me an affordable option on glasses to alleviate the headaches and fog I was getting from being in the office all day staring at a computer.  I no longer have any brain fog, blurry vision or headaches thanks to the Gunnar's and I get compliments on them all the time!  Thanks Gunnar!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Allard",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T22:00:33.000Z",
          "Titre": "I'm giving a green/5 star because at…",
          "Contenu": "I'm giving a green/5 star because at this stage, all I've received is a shipment containing the foldable cardboard box (glasses holder) and the wipes. If I could give any feedback here, it would be nice to get the package together, as one shipment. I got all excited thinking my (prescription) glasses were here, but that's a few weeks off. No big deal, I am patient and don't expect anything - esp custom prescription glasses - to be rushed. Other than the 'free gift' box, I'm still waiting for the glasses (the main part) of this order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler Kesy",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:34:21.000Z",
          "Titre": "Great experience and purchase overall",
          "Contenu": "Very fast and streamlined. I saw a deal from an email I received and jumped all over it. The price matched the one from the email. Checkout went smoothly as well no hiccups or extra steps or things to sign up for great process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taylor Allen",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T10:17:22.000Z",
          "Titre": "A Great Experience with a Reputable Company",
          "Contenu": "Gunnar Optiks made ordering my glasses quick and efficient, even getting my prescription glasses to me faster than I expected. They kept me very informed about the whole process and packaged everything very well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "heather harster",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:52:06.000Z",
          "Titre": "Easy ordering",
          "Contenu": "I haven't received the glasses yet, but after I ordered them I was notified that they  shipped within an hour.  The website is easy to navigate and check out was seamless.  Great experience so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jade",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T09:32:22.000Z",
          "Titre": "Well made, trustworthy and reliable",
          "Contenu": "This is my 2nd purchase as the first time was great too. I trust Gunnar for computer glasses above all other brands, they’re very well made and they ship out fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sung Kim",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T21:11:03.000Z",
          "Titre": "Price is right",
          "Contenu": "Price is right! Great product. Highly recommend. Very satisfied with purchase!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Lyon",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T00:06:52.000Z",
          "Titre": "Easy and Organized",
          "Contenu": "It was easy to search and take a look into what I felt would be the best fit for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathaniel Scheidler",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T03:23:43.000Z",
          "Titre": "I am a massive believer",
          "Contenu": "I am a massive believer in your products. Since I started wearing Gunnars, my sleep has markedly improved. I have promoted your product directly to people telling me about their sleep issues, and on social media. I'm flat broke, so your Thanksgiving sale was a huge relief to buy a pair of 1.5x... I consider the full price to be more than fair though, and this is now my 5th pair that I have purchased for myself (wearing a pair of no-magnification over my prescription glasses as I write this!)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:19:30.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. These are the best reader/computer glasses I have ever had.I also broke a pair after almost two years and found customer support resounding quickly and to be very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catharine Shelby",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:51:43.000Z",
          "Titre": "The ease of ordering and I got a free…",
          "Contenu": "The ease of ordering and I got a free gift card!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DVK",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:17:20.000Z",
          "Titre": "smooth as silk",
          "Contenu": "Everything went as smooth as silk, except the unexpected extra charge for shipment management."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "drake",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:57:10.000Z",
          "Titre": "Great product, convenient website",
          "Contenu": "Like the products, they work well, the website does and is easy to navigate, the same was easy to navigate as well, I do wish you would make safety rated glasses, I am a machinist and on computers all day, either programming the cnc machine or running it, all uses a screen and I hate moving back and forth from gunnars to safety glasses, if I could have both in one, that would be amazing. other than that thank you for having great products keep it up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaems Vasquez",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T16:18:59.000Z",
          "Titre": "My order was shipped to the wrong…",
          "Contenu": "My order was shipped to the wrong location. Customer service made the process easy to fix."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T02:56:16.000Z",
          "Titre": "Product Review",
          "Contenu": "These frames and lenses are outstanding in every way. I ordered the Vertex frames with Amber lens tint and Natural focus (who would ever but \"Gunnar focus\"???). I wear these all day, they are comfortable and prevent migraines. I even started wearing these at night to see if they helped with the awful blue laser headlights. They really do, no more glare or headlight migraines! The amber lenses do not darken the field of view hardly at all even at night. I'm getting a second pair so i can keep on in my car. I can't recommend these enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DanH",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T21:47:31.000Z",
          "Titre": "Experience counts",
          "Contenu": "Find my glasses was easy and check out was a breeze. Liked learning about the company - in fact the company's history is what convinced me to buy from you."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stewart  MacLean",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:35:57.000Z",
          "Titre": "easy to order",
          "Contenu": "easy to order, nothing else needs saying"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ian Sanders",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:15:30.000Z",
          "Titre": "Love the brand and love the aviators I…",
          "Contenu": "Love the brand and love the aviators I received hoping there will be different color of lenses for the aviators maybe black frames with red lenses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G Norcross",
          "Nb_Reviews": 5,
          "Date": "2023-12-04T22:03:20.000Z",
          "Titre": "Easy to find exactly what will work…",
          "Contenu": "Easy to find exactly what will work best especially buying for someone else. These are a gift. I know it will be quality I can trust."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:57:22.000Z",
          "Titre": "Gunnar's shop was easy to navigate",
          "Contenu": "Gunnar's shop was easy to navigate, and I found what I wanted quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cori",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T03:18:37.000Z",
          "Titre": "Amazing start to finish!",
          "Contenu": "Quick and easy process, awesome product, helped with my migraines so much and super comfortable to wear!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EJ T.",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T17:45:20.000Z",
          "Titre": "Timeless quality. Great performance.",
          "Contenu": "The glasses I chose feel like great quality and did not disappoint. I’ve had Gunnar’s now for about 8 years and they are still making a great product. The website is also very user friendly, not to mention the live chat option with an employee that can assist you with any questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelvin Perez",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T22:01:48.000Z",
          "Titre": "Give it a go Its a bit pricey but worth it",
          "Contenu": "Great Pair of Glasses very happy with everything The Gunnar vision also does not impair sight helps alot with eye relief and as well as looking super stylish I would opt for the shipping insurance sometimes things happen and for a couple extra dllrs you can insure your shipment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T21:14:08.000Z",
          "Titre": "Great service !",
          "Contenu": "Great service !! I love it so much. The eye glasses are amazing. I would buy another pair. Thank you so much !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HKR",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T20:57:17.000Z",
          "Titre": "5 Stars",
          "Contenu": "Shipping date was accurate, glasses came as ordered, they help my eyes 100%, used to have watery eyes in endgame of Battle Royales and now my eyes feel as fresh as before I started screen time. Thanks Gunnar"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wally Jimenez",
          "Nb_Reviews": 3,
          "Date": "2023-10-28T20:24:23.000Z",
          "Titre": "I love my new glasses",
          "Contenu": "I love my new glasses. Not only do I use it for gaming, I’m a city bus operator working the Night Shift. The high beams from on coming traffic and the blue lights from the light poles was causing me insomnia, eye pain and headache. With my new glasses all of those issues are gone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "shane",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:44:59.000Z",
          "Titre": "A+ +++",
          "Contenu": "Nice glasses, I would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A Silva-Sadder",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T23:36:28.000Z",
          "Titre": "Great customer service",
          "Contenu": "Customer service answered all my pre-purchase questions and helped me get everything ordered. I received and wear my glasses daily, which were replacements for the exact same pair I had been wearing for several years but had become too worn and banged up.  They also helped with spare notepads. I have several pairs of Gunnars (now 4), including custom sunglasses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T21:47:27.000Z",
          "Titre": "Performance.",
          "Contenu": "First off : Aesthetics of the product I chose.2: performance, my friend let me use his one night while on a long session on COD ,and they shined !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pablo Andres Aguirre gonzalez",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T13:51:44.000Z",
          "Titre": "Good fast shipping",
          "Contenu": "Good fast shipping, Beautiful glasses"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Sullivan",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T15:03:20.000Z",
          "Titre": "Gunnar is awesome",
          "Contenu": "Great company - products are high quality and customer service is top notch. I’ve purchased a few pairs of blue light glasses over the last ~10 years and my favs are always Gunnar.On the website, virtual try-on is really cool and useful. It would be cool to be able to filter the options by frame material. I may also buy prescription glasses sometime soon, but my prescription is very high, so it would also be useful to filter the options by prescription range too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph G",
          "Nb_Reviews": 13,
          "Date": "2023-09-29T05:45:27.000Z",
          "Titre": "This is my 4th pair of prescription…",
          "Contenu": "This is my 4th pair of prescription computer glasses from Gunnar and I am not disappointed! I used to care what they looked like but the only person that see’s me wearing them is my wife but hey they look cool and I can see! The best thing is they are Gunnar glasses and I can Game for hours a day and my eyes don’t even feel like was looking at the computer monitor for 5 minutes. Awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ty Smith",
          "Nb_Reviews": 4,
          "Date": "2023-09-28T20:34:47.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Terry Albea in your customer service department made all the difference. I had bought a pair of your glasses from an unauturized seller on Amazon.  Terry went of their way to help me resolve my issue even though it really should have been all Amazon. Terry has a true \"Above and Beyond\" spirit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "xia",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T18:21:26.000Z",
          "Titre": "For prescription purchase",
          "Contenu": "For prescription purchase, I was missing a document and Angela guided me to finish that step.  She was very responsive and easy to work with.For your website, I would recommend that you speed up the search resultsI waited for a good deal on prescription glasses for a year.  I hope you guys have more deals more often on prescriptions.  my insurance does not cover it all Look into partnering with more insurance providers so that we do not have to pay out of network costStart including hard case with all the purchases.  hardcases are a must for frequent and not so frequent travelers I have not recieved the product yet, but I own 3 other gunnar products and I am satisfied. I will add more comments once I try out the new product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ruben corral",
          "Nb_Reviews": 3,
          "Date": "2023-07-22T05:30:46.000Z",
          "Titre": "Great results require faith in experience.",
          "Contenu": "My initial shipment was shipped accidentally to an address other than where I reside. But the great work by (Terry Albea (GUNNAR Support) and your lab staff promised a replacement set of prescription glasses, which arrived today...impeccable, I love the finished product. Thank you very much; money well spent."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Soyeon Jung",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T07:56:32.000Z",
          "Titre": "Sophisticated design matching to most shape of face",
          "Contenu": "I purchased this Infinite model two times for myself, and my mother and young brother also have it. The Gunnar glasses are very very helpful to reduce eye strain caused by long-term use of computer. Also, the design and matte black colored frame is sophisticated. I hope the Infinite model is renewed with the titanium frame of light weight."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert K",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T18:40:38.000Z",
          "Titre": "Gunnar Has Great Customer Service When There Is an Issue",
          "Contenu": "I had an issue with Intercept  blue light blocking glasses- the temples were crooked. I informed Gunnar about the problem. They immediately sent me a new pair of glasses which met all my expectations. Well done Gunnar!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew Macken",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T20:18:19.000Z",
          "Titre": "These are the best readers / blue light…",
          "Contenu": "These are the best readers / blue light glasses I’ve ever worn. They look great and are super comfortable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T17:28:58.000Z",
          "Titre": "THE Eyewear you need protecting your eyes from screens",
          "Contenu": "First, these products are second to none. These are THE blue light glasses to get when you're spending long hours in front of a screen. The designs are fantastic, the quality is superior and the customer service and incredible. Gunnar will continue being the company I go to when I need Eyewear, and I can't wait for my sunglasses to arrive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yvette",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T21:55:56.000Z",
          "Titre": "Good and easy site to use",
          "Contenu": "Good and easy site to use. Quick shipment. My Grandson will be excited!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T01:34:44.000Z",
          "Titre": "in depth detail of optics(ratio of…",
          "Contenu": "in depth detail of optics(ratio of blocked blue light),use,size and dimensons of frame  and customer reviews."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T20:23:45.000Z",
          "Titre": "Fast service",
          "Contenu": "Service was really fast. Glasses are top quality and I can tell how they help my eyes. I spent 10h on average on front of my computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seyun Hong",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T02:30:34.000Z",
          "Titre": "Truly relaxing experience to my eyes.",
          "Contenu": "A nice product with fine-tuned lenses, lightweight and durable frame coming with quick delivery service is why I gave them 5 stars. Hope they make more products with frame width of 140 or more for Asians."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas McCurdy",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T16:57:48.000Z",
          "Titre": "had an admin problem with applying a…",
          "Contenu": "had an admin problem with applying a discount code.  angela from support helped me right away.  very kind.  im a big fan of product, and even bigger fan of gunnar people and service.  thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Loskota",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T00:32:40.000Z",
          "Titre": "Customer service was good",
          "Contenu": "Customer service was good - it will be easier next time since I will use my account to order. I really like my new glasses - they are very comfortable and don't hurt my nose.  It was very important I got those new glasses for my job - always think of LUMEN Technologies for your high-speed, tier 1 internet needs, cybersecurity, ddos, ipvpn, ptp, and voice center needs - we are here for you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin Lipman",
          "Nb_Reviews": 6,
          "Date": "2023-07-28T17:20:53.000Z",
          "Titre": "BEYOOOOND the best customer service I've ever gotten!…",
          "Contenu": "BEYOOOOND the best customer service I've ever gotten!  Terry Albea was INCREDIBLY helpful, and took care of everything with extreme patience, kindness, and EXCELLENCE in EVERY way!  What a great company you are, and I SOOOO appreciate your amazing service!  I look forward to receiving my order and recommending your company to everyone I know.  Thank you SO much!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Breona Paz",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:59:01.000Z",
          "Titre": "Easy to order and great values."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T20:52:33.000Z",
          "Titre": "Iron Man would be proud",
          "Contenu": "Ordered a pair of Stark Industries blue lens sunglasses as a gift for my daughter on Tuesday and they were delivered today (Thursday), fantastic service and delivery.They are great, so much so that I’ve ordered a second pair for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spencer Wright",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T19:29:51.000Z",
          "Titre": "Loved the Black Friday sale",
          "Contenu": "Easy to navigate website and the Black Friday 20/30/40$ sale was amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sean dickson",
          "Nb_Reviews": 3,
          "Date": "2023-04-11T01:01:57.000Z",
          "Titre": "Amazing glasses",
          "Contenu": "Amazing glasses, before these lenses I’d get migraines quite often but not since I started wearing their lenses.  I’ve bought like 6 pairs from them by now.  I don’t wear anything by anyone else either anymore.  Their customer service is excellent as well if you have to deal with them.  I’m a disabled veteran and it’s hard for me to deal with customer service but they were really nice and made it easy.  I couldn’t recommend a better company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curtis Royal",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T22:13:56.000Z",
          "Titre": "Gunnar’s a Go!",
          "Contenu": "First off Customer service is an A++. And the fit and feel are great. Definitely would recommend and I definitely will be back for more. Got the cod coverts coming back for the cod tactical and them loyalty black panthers in due time. Awesomeness!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 4,
          "Date": "2023-06-13T22:32:05.000Z",
          "Titre": "I was searching for Gunnar clip-ons",
          "Contenu": "I was searching for Gunnar clip-ons, and received messages a couple of times telling me that they would be in stock soon. And they have been re-stocked.The process of ordering went wonderfully well - especially the part where I was shown how the clip-ons would look on my prescription computer glasses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexie Zachariades",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T23:29:11.000Z",
          "Titre": "The best glasses I've ever owned.",
          "Contenu": "These might be the best pair of prescription glasses I've ever owned. They are super lightweight and I chose the transitions lenses. I only wish they fit inside my motorcycle helmet. I'll definitely be getting a 2nd and maybe a 3rd pair."
        },
        {
          "Note": 5,
          "Lieu": "BH",
          "Pseudo": "Saud A.Aziz",
          "Nb_Reviews": 2,
          "Date": "2023-05-20T19:48:49.000Z",
          "Titre": "Quality and Speed",
          "Contenu": "I've been using Gunnar Optiks products for years; and I'm very satisfied with the quality of their products and speed of service. My items shipped to my international location in no time. I'm also happy with their prices which remained largely unchanged throughout the years; all of this keeps me coming back when I need a new set of glasses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ian Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T19:05:53.000Z",
          "Titre": "Product selection was easy and…",
          "Contenu": "Product selection was easy and straightforward. I appreciate the measurements of the glasses in the information sections. Both lens size and temple measurements greatly helped me with my decision."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Royce",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T22:03:01.000Z",
          "Titre": "Good Experience at Gunnar!",
          "Contenu": "I love Gunnar, they have a nice staff team to fulfilled my question and useful information on why to choose them and why their blue light glasses are better. To find the perfect glasses for you, it's all in the product list. Super easy to navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PARAMESWARA SIRIGIRI",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:51:35.000Z",
          "Titre": "This is my second order from the last 4…",
          "Contenu": "This is my second order from the last 4 years. Great glasses for eyes.This time I got a very good price. The main thing is these are real glasses not synthetic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RePete",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T21:18:51.000Z",
          "Titre": "Numerous product options.",
          "Contenu": "There is a great selection of products available. The images of the products provided a good representation of each model. The descriptions of each model were clear and informative. All of this made making up my mind very easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kellen “Ghost Killer” Walburn",
          "Nb_Reviews": 5,
          "Date": "2023-09-26T00:00:03.000Z",
          "Titre": "Get a pair of blue light glasses. You'll thank yourself immediately",
          "Contenu": "I stare at a screen all day for work and school, and I relax in the evenings playing video games. So my life kind of revolves around bluelight right now. I was getting pretty constant eye strain and headaches. I decided to get a pair of these to give them a shot. Now I can't stop using them. All the strain and headaches just vanished."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edgar Borne",
          "Nb_Reviews": 3,
          "Date": "2023-05-28T17:09:55.000Z",
          "Titre": "I forgot an important detail on my…",
          "Contenu": "I forgot an important detail on my order and they contacted me to clear it up on my World at War frame and prescription order. We got the matter corrected and the glasses have gotten me compliments from all who see them. They work very well and I an very happy with the product and customer service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "C Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T03:05:52.000Z",
          "Titre": "You get what you pay for… and then some.",
          "Contenu": "I’ve been getting protective eyewear from Gunnar for a few years now and so far they do not disappoint. Customer service is always available and ready to help out if you have issues with the product. They are constantly improving their products and always up to speed with the latest technology."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Edward",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T18:19:24.000Z",
          "Titre": "Sign of a successful purchase",
          "Contenu": "My experience with purchasing glasses went well! I had a great outcome, with the lenses having the correct prescription and the glasses being comfortable. It's especially beneficial that I feel my eyes are more rested when wearing them for long workdays. That's definitely a sign of a successful purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ian Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T02:51:44.000Z",
          "Titre": "No more headaches at work!",
          "Contenu": "I picked up a pair of these from a tech store in person a couple of years ago, and they've immediately helped with the headaches I'd get working in IT. So helpful, that my partner wanted a pair, so I purchased a second pair for them and got a mystery box pair as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Westphal",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:16:09.000Z",
          "Titre": "Communication,answered all of my…",
          "Contenu": "Communication,answered all of my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Imperato",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T21:12:14.000Z",
          "Titre": "Great experience!",
          "Contenu": "Easy checkout and detailed layout of product and description. Perfectly laid out website to find the best product to fit my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2023-09-12T17:32:17.000Z",
          "Titre": "Love the glasses & customer service!",
          "Contenu": "Love the glasses they help with dry eyes and headaches. I've been a customer for a while and will be. Had a pair I didn't like because of personal reasons and they exchanged them no problem."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joan Persaud",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T20:42:45.000Z",
          "Titre": "Gunnar's glasses are well put together in all respects. Turnaround time is excellent. It is very easy to communicatewith seaff and they take the time to provide updates throught out the process.",
          "Contenu": "Gunnar makes proper glasses-they fit well' they follow the prescription to the letter. The client is always kept in the loop from beginning to end with timely messages of what is going on. The cost is reasonable and the product is exceptional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Harrington-Colon",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T18:09:30.000Z",
          "Titre": "I looooove these products and wear them…",
          "Contenu": "I looooove these products and wear them all the time. just ordered a backup just in case something happens to one of my two pairs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Estera Bradley",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T13:50:02.000Z",
          "Titre": "so far",
          "Contenu": "I haven't received my purchase yet and would like to leave a review once I get my glasses. Up to this point the selection is great and appreciate the price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzan C",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T18:08:53.000Z",
          "Titre": "Easy to change order",
          "Contenu": "After I ordered, I changed my mind about lens tint.  I reached to your contact site and got an immediate response that It would be taken care of."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "barbara chamorro",
          "Nb_Reviews": 3,
          "Date": "2023-06-17T19:03:25.000Z",
          "Titre": "Great glasses work for prolonged computer use.",
          "Contenu": "Great glasses work as intended. Definitely recommend one of these for any that sit in front of a computer screen for long hours. Took about three weeks to receive product if you buy a prescription pair, so keep that in mind. 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerrick Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T19:30:40.000Z",
          "Titre": "Game changing!!!",
          "Contenu": "So before these glasses, my eyes would hurt and I just couldn’t focus. After getting Gunnar Optics, it’s allows me to play longer without my eyes hurting one bit. I truly Recommend Gunnar Optics!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis T. Gates",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T14:47:26.000Z",
          "Titre": "Purchasing was easy",
          "Contenu": "Purchasing was easy.  I purchased the first time 4 years ago and the process was more difficult and confusing.  This time was easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T17:07:33.000Z",
          "Titre": "Pretty user friendly",
          "Contenu": "Pretty user friendly, easy to navigate and chose the right style, I also love the fact that you have options on how much protection you want."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bret",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T18:16:58.000Z",
          "Titre": "The online chat was very helpful",
          "Contenu": "The online chat was very helpful. They answered all of my questions about lens types and comparing different frames, which helped me make an informed buying decision."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David B",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T18:01:37.000Z",
          "Titre": "Ease of use and selection were…",
          "Contenu": "Ease of use and selection were incredible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason S",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T15:47:35.000Z",
          "Titre": "Gunnar's rock!",
          "Contenu": "Easy to use purchase on website.  Good sales!  2nd time I've bought Gunnar's.  They truly work to keep away the brain fog and headaches from staring at a computer all day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Earnest Averill",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T02:04:37.000Z",
          "Titre": "Durability, longevity,",
          "Contenu": "They were very helpful when it came down to finding out when I was getting my glasses I have gotten glasses before I had them three years no damage they were awesome. Can’t wait to get my new pair."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARK",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T19:28:45.000Z",
          "Titre": "Product review and order process was…",
          "Contenu": "Product review and order process was easy and quick."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Vadym Hrachov",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T18:02:20.000Z",
          "Titre": "I've tried different glasses brands but…",
          "Contenu": "I've tried different glasses brands but Gunnar the only brand that helps me with my eyes problems."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Soumaya Abdelatif",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T02:25:03.000Z",
          "Titre": "I ordered prescription glasses for my…",
          "Contenu": "I ordered prescription glasses for my son online and everything was perfect. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Jones",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T13:25:16.000Z",
          "Titre": "Easy website and process",
          "Contenu": "Easy website and process, fast shipping. Love the reading glasses, the quality and clarity are amazing!!! Will be buying more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ricky Lawson",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T23:35:28.000Z",
          "Titre": "Easy to read and understand",
          "Contenu": "Easy to read and understand, good selection, decent prices and nice discount with WOODY."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Drumm",
          "Nb_Reviews": 3,
          "Date": "2023-04-18T22:06:55.000Z",
          "Titre": "My Third Pair",
          "Contenu": "This is my third pair of Gunnar Glasses.  Although my last pair cracked above one of the lenses, I had worn them for three years, and had no problem buying a new pair.  The ordering process was great and delivery came with no issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 4,
          "Date": "2023-04-18T00:50:45.000Z",
          "Titre": "GUNNAR lens cleaner is the best",
          "Contenu": "GUNNAR lens cleaner is the best there is. It cleans eyeglasses wonderfully well. I use it for my computer glasses, regular glasses, and sunglasses.  Customer service was helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T13:40:57.000Z",
          "Titre": "Great quality for price",
          "Contenu": "Great service from Gunnar. Easy to navigate site and glasses shipped out quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:59:55.000Z",
          "Titre": "Quick response to a question I had…",
          "Contenu": "Quick response to a question I had about their eye wear. Everything else went great."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Konstantinos Boumpoukas",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T17:18:15.000Z",
          "Titre": "You can find all the information you…",
          "Contenu": "You can find all the information you need about every pair of glasses you want to check out in their site. Makes your job very easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CM",
          "Nb_Reviews": 3,
          "Date": "2023-06-27T23:35:35.000Z",
          "Titre": "Great glasses. My eyes thank you!",
          "Contenu": "I like the online try on using the camera. I think a broader selection of reading glasses might be nice but overall I am a big fan. These are my fourth pair of Gunnar's. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jan-Erik Soderstrom",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T19:46:54.000Z",
          "Titre": "Virtual Try On is a time saver",
          "Contenu": "Really love the Virtual Try On option, makes it much easier to shop for glasses when going online, made the whole experience much easier and less of a headache, if all glasses could have this it would be amazing"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Klant",
          "Nb_Reviews": 3,
          "Date": "2023-09-13T20:54:01.000Z",
          "Titre": "Customer service email resolved issue quickly!",
          "Contenu": "I forgot to put in the discount code and customer support were able to help me without issues thank you so much! I was worried. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clyde Boyce",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T20:18:54.000Z",
          "Titre": "Good quality glasses",
          "Contenu": "Good quality glasses. I use em for work and whenever I use my computer or play video games. Starting to plan to get another pair soon"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Kerley",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T23:54:15.000Z",
          "Titre": "Took the extra steps",
          "Contenu": "Took the extra steps, even called me, when there was a processing issue. I wish every company took care of their customers this way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Fleming",
          "Nb_Reviews": 5,
          "Date": "2023-08-27T04:14:55.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "The customer service has been fantastic. I really appreciate the long period for getting lenses replaced - makes me feel a lot better about ordering these online."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maribel",
          "Nb_Reviews": 3,
          "Date": "2023-05-24T18:16:11.000Z",
          "Titre": "This was a gift for my son",
          "Contenu": "This was a gift for my son.  The sight was helpful with the information they gave me to make a decision. It was also easy to reach customer service, since I was not familiar with this product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kal Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T05:51:17.000Z",
          "Titre": "Great glasses",
          "Contenu": "Great glasses. I wear them daily and even forget I have them on since I don’t wear glasses, because they are so light that I forget I have them on. This is my second pair."
        }
      ]
    }
  ]
}