{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "harddiskdirect.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "steven T",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T07:47:43.000Z",
          "Titre": "Untrustworthy seller, avoid! Their response is also a lie!",
          "Contenu": "Refused to fulfill order after taking over a week to verify my order (had to provide my property tax bill, phone number, and drivers license). After I completely verified myself Ryan from Harddiskdirect said they were refusing to fulfill the order and cancelled the order on me, it took 3 weeks to get a refund from them! Wouldn't trust them at all, especially not with any server equipment that is mission critical, they will leave you in a bad position.The update below is also a lie. They cancelled my order, and never asked me to pay extra freight. They said they had the wrong price on the website and refused to fulfill the order. DO NOT TRUST THESE LIARS!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tseyenkhorol  Jigjidsuren",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T19:29:36.000Z",
          "Titre": "They haven’t sent my package because of…",
          "Contenu": "They haven’t sent my package because of the address or something. I still didn’t know why I couldn’t buy something through my address."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Sana Afzal",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T13:49:18.000Z",
          "Titre": "Very slow customer support waiting time…",
          "Contenu": "Very slow customer support waiting time of live chat is too long no after sales serive"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Keller",
          "Nb_Reviews": 5,
          "Date": "2023-10-28T01:47:24.000Z",
          "Titre": "Bad Service",
          "Contenu": "Ordered the drive cage on October 11th. It's October 27, I'm STILL waiting for it. Sent email, on October 27th and STILL waiting for a response."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Rick",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T12:49:56.000Z",
          "Titre": "Buy elsewhere",
          "Contenu": "Buy elsewhere. Once you try to buy you get the message that the current stock has been sold but they have another option which cost 1,5x the original amount. Numerous mails and calls for what should be a easy transaction. Unprofessional, un-ethical and maybe even fraudulents"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Pace",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T06:11:16.000Z",
          "Titre": "Calling and asking for a copy of my…",
          "Contenu": "Calling and asking for a copy of my credit card and driver's license is a scam.  When I refused, the order was cancelled but I was not notified of the cancellation until I followed up about the order.  Stay away from this website."
        },
        {
          "Note": 1,
          "Lieu": "KZ",
          "Pseudo": "Assan Abayev",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T13:42:18.000Z",
          "Titre": "DON'T RECOMMEND",
          "Contenu": "We submitted a request (September 5, 2023) for 02J54F - 5 pieces, FGVGG - 5 pieces, Bruce William contacted us, received a proforma invoice from him, paid 100%, Bruce sent us the goods, but we received only part goods, Bruce shipped only part of the goods without agreement with us, we only found out that only part of the goods arrived when we cleared the goods through customs, more than a month has passed, we cannot get the shipping date for the other half of the goods. His answer that 'soon' does not suit us. It turns out that we are faced with fraud on the part of your company. When we paid for the invoice, all the goods were in stock, only part of this product was shipped to us without agreement with us, we asked for a refund, but we cannot get our money back, they ignore us. I do not recommend buying goods here, this company is a scammer, we have all the correspondence with Bruce and his colleagues, now we are suffering losses because we were unable to deliver the goods to our customer on time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Dewitt",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T22:03:37.000Z",
          "Titre": "My order was not honored, pressured to upgrade…",
          "Contenu": "My order was not honored and was called (pressured) to upgrade to a much more expensive version of the item I ordered (which I didn't do).  Very shady business practice.  I will look elsewhere going forward."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gavin Miller",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T17:03:10.000Z",
          "Titre": "Shady Business",
          "Contenu": "An item I wanted was on sale for ~60 dollars and I purchased it. I filled out my information and my address even showed up in the website form's autocomplete. The order was confirmed, card was charged the amount. A few days later you guys contact me needing my identification to confirm my listed, suburban, US address and that the item was now priced ~150. I canceled the order. If the charge remains on my card a couple more days I'll report it as fraud. I'm also posting this story on social media."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Manish Malik",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T08:00:35.000Z",
          "Titre": "order placed and paid on 30-08-2023.",
          "Contenu": "order placed and paid on 30-08-2023.material was in stock before placing the order and soon after the order was placed it is our of stock and still not shipped.Even after 12 days ,it is showing order status as  processing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will G.",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T17:46:37.000Z",
          "Titre": "Purchased Item for $150",
          "Contenu": "Purchased Item for $150, however I was advised that the item at $150 was not in stock, but an exact identical/compatible item was but they would only sell it to me for $440. Classic example of bait and switch, absolutely outrageous business practices. Will never purchase anything from these guys again as the prices may just be too good to be true to lure you in."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JIM VAUGHN",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T06:09:44.000Z",
          "Titre": "Overpriced",
          "Contenu": "Overpriced, refurbished speakers!! I didn't notice the \"refurbished\" part until after I ordered. Got genuine Apple speakers for less than half what I paid for these \"refurbished\" speakers. The refurbs were in a plastic bag, thrown in a box with no packing material. The ebay speakers arrived well packed in anti-static envelopes in laser cut foam packing. There is visually a huge difference between the refurbs and the genuine Apple from ebay. Save your time and money!! Speakers aren't that easy to change."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don’t buy from these guys",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T21:31:00.000Z",
          "Titre": "Purchased a “refurbished” item from the…",
          "Contenu": "Purchased a “refurbished” item from the company. They first offered to upsell me to a “new” item from their “overseas warehouse” I opted for the “refurbished” item. When it arrived they had not even taken the time to clean the bird poo off the item (an outdoor item) nor enclosed a power injector (claiming that even the new item does not include one…horse poo). Additionally there was no padding in the box, so the item was just rattling around in the box during transit.Can I leave no stars?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick Yadon",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T16:44:48.000Z",
          "Titre": "Your product did not work with my…",
          "Contenu": "Your product did not work with my printer, and I have asked for a return label, but your company will not take my return!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John  Clark",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T18:18:14.000Z",
          "Titre": "Fishy to me.",
          "Contenu": "Allegedly couldn’t verify my address. They wanted a picture of my drivers license and credit card. I’m not going to give photos of info. I have never heard of that. Sounded fishy!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "matthew kaveney",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T18:38:43.000Z",
          "Titre": "Confirmed product was in stock before…",
          "Contenu": "Confirmed product was in stock before ordering. Found out order was cancelled after receiving credit on my card. Never received an update after several attempts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JR",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T21:37:04.000Z",
          "Titre": "Tried to make me pay 4x as much for an item",
          "Contenu": "They listed an item as in stock. But when I placed an order, they emailed me the next day saying that the item isn't in stock after all, but they happen to have another product (of the exact same SKU) at 400% of the original price.If you've encountered this as well, consider reporting them at reportfraud.ftc.gov."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Williams",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T14:29:11.000Z",
          "Titre": "Missing parts",
          "Contenu": "I ordered 2 ssd server drives with caddies and only one drive arrived with the caddy.  I sent an email to support on 8/31 and haven't heard from them yet.  I need the caddy to expand the storage of one of my servers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T21:28:17.000Z",
          "Titre": "I ordered an IBM RDX cartridge that I…",
          "Contenu": "I ordered an IBM RDX cartridge that I thought was new. (The price was for a new one) I received a Lenovo RDX cartridge that was dated 05/2016 and it was obviously used. Instead of indicating the product was refurbished on the product description you had to open a detail link that said it was refurbished. They're just another scam company sending out used products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Erickson",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T17:28:19.000Z",
          "Titre": "Shady business",
          "Contenu": "The rep was very nice, and the price was good compared to other stores but my deal breaker was when they wanted a photo of my ID and wouldn’t say what info they wanted off it. I canceled my order and they did thankfully give me a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ljube",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T15:36:32.000Z",
          "Titre": "Ordered on the website...the specs for…",
          "Contenu": "Ordered on the website...the specs for the SCSI Hard Drive i was looking for were wrong.. they corrected the pin numbers when i called but still it showed the Drive is NEW. The price was $170. I ordered and received a refurb dated Hitachi 2009. Checked other sites - same drive same vintage was under $40.Called this Company the only thing they could say:WE ARE SORRY or in translation you got screwed...I understand price difference but 400% is intended scam..My advice: Do not buy anything from them before checking 3 other suppliers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Lovas",
          "Nb_Reviews": 2,
          "Date": "2021-10-02T12:34:39.000Z",
          "Titre": "Shoddy company",
          "Contenu": "Shoddy company, poor communication and absolutely the worst after sale service I've experienced in my life. DO NOT DO BUSINESS WITH THIS COMPANY. They sold me the wrong product and will not take care of it. After I told them that \"restocking fees\" are a scam and poor business practice, they have not answered a single email. What kind of BS is that? A business ghosting it's customers like a teenage boy does to his girlfriend. I can't believe any company in this day and age treats customers this way.EDIT: After their response below, still nothing from them. Nothing but lip service. They say customer satisfaction is their top priority but it obviously isn't. They have not reached out to me to try and fix the situation. So, I stand by my original review.Shoddy company with poor business practices and no ethics whatsoever. DO NOT BUY FROM THIS COMPANY!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D.",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T01:56:34.000Z",
          "Titre": "Unethical Support Team",
          "Contenu": "Placed an order at a given price, was emailed about a \"sudden\" price adjustment at 2x the cost. I replied to their customer support email stating \"nice scam, cancel the order\". A support representative by the name of \"Ryan Miller\" proceeded to make an unethical remark given my name and assumed ethnicity. Happy to share this email exchange with anyone that requests it. I was given the full refund, but the way a company's support team interacts with their customers (even if the customer is being obnoxious) is incredibly revealing about a company's practices and sales methodology. Purchase from this company at your own risk."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terrance Rucker",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T21:49:55.000Z",
          "Titre": "Unfulfilled Order",
          "Contenu": "I have not received an update on the status of this order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edward Pizzo",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T22:22:55.000Z",
          "Titre": "Not to be trusted.",
          "Contenu": "1st video card comes used and full of dirt and dust inside the fan blades with my camera zoomed in you can see it was warn down and used.2nd video card also used but it was ripped out of a computer and the tab was cut off and grinded flat to make it look new. the cover was removed and fan blades cleaned to make it look new. if you didn't have it just tell me you dont have one.  ill never use your company ever again.  so please dont ask for a referral from me. This company can not be trusted they deal in used parts which is absolutely fine I would be happy to know up front. But trying to pass  10 year old equipment off as new sorry thats a slimy and so i would never trust them ever again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Van Ness",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T14:34:39.000Z",
          "Titre": "Purchased product AIR-PWR-50",
          "Contenu": "Purchased product, but never received it, even after multiple calls to 2 people.After review and contacting the company again, my money was refunded."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mohammed",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T18:47:49.000Z",
          "Titre": "the product was listed on your site and…",
          "Contenu": "the product was listed on your site and after buying it the team reached out to let me know it is no longer available. worst service ever."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sophie Evans",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T14:45:57.000Z",
          "Titre": "Unethical company and doing worst…",
          "Contenu": "Unethical company and doing worst business. They send orders to suppliers and then cancel for no reason when supplier arranges the stock. NEVER WORK WITH THIS COMPANY."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arthur Rosario",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T17:36:51.000Z",
          "Titre": "The order was unfulfilled with no…",
          "Contenu": "The order was unfulfilled with no follow-up.  I wasted a whole week on this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stay away",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T06:00:18.000Z",
          "Titre": "Bait and switch tactic",
          "Contenu": "Bait and switch tactic. Recommend to stay away."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Carter J Harkness",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T20:46:58.000Z",
          "Titre": "Kevin was RUDE and MEAN and not picking…",
          "Contenu": "Kevin was RUDE and MEAN and not picking up what I was putting down..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Toni Falcone",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T20:53:13.000Z",
          "Titre": "Wasted 6 weeks. Lies. Lies. Lies.",
          "Contenu": "Wasted 6 weeks.  Told me they had stock overseas which they did not.  Eddie would tell me he would call me back and then dodge my calls.  SHADY."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FREDRICK OLEARY",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T03:31:21.000Z",
          "Titre": "You are not one of my vendors and I…",
          "Contenu": "You are not one of my vendors and I have not done business with you or have done in the past."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hieu Le",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T21:43:22.000Z",
          "Titre": "Ordered was placed 1.27.23",
          "Contenu": "Ordered was placed 1.27.23.  Over a week and no update on order or shipment."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Carolina Guajardo",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T04:35:55.000Z",
          "Titre": "lousy service",
          "Contenu": "lousy service, they ship used parts they sell them new but they are not"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Игор",
          "Nb_Reviews": 1,
          "Date": "2019-01-11T04:37:57.000Z",
          "Titre": "They sell printers that cost 200$ for…",
          "Contenu": "They sell printers that cost 200$ for 1200$."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 7,
          "Date": "2022-12-21T03:37:29.000Z",
          "Titre": "Didn’t work",
          "Contenu": "Didn’t work, misleading advertising"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Balaji",
          "Nb_Reviews": 1,
          "Date": "2020-12-30T08:41:15.000Z",
          "Titre": "Not worth to do business"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shaun Watson",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T21:34:53.000Z",
          "Titre": "Said they could not find my address and…",
          "Contenu": "Said they could not find my address and then asked to send pictures of credit card and license via email to confirm. Although they did say to cover the last 4 digits of the credit card number, I still cancelled the order for even suggesting to send to them via email."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FLEX",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T19:22:22.000Z",
          "Titre": "The printer advertised was not…",
          "Contenu": "The printer advertised was not functional. They informed me one week after ordering it. I purchased the printer from another seller. I am not satisfied with hard disk direct and can not recommend them."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-22T21:25:59.000Z",
          "Titre": "Unusable- The part that arrived was incomplete as…",
          "Contenu": "The part that arrived was incomplete as per the picture they displayed, the server required a network card which was pictures but not included. When asked to purchase this additionally they could not supply, got half a part that didn't work and could not be made to work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Griffiths",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:18:50.000Z",
          "Titre": "No help at all",
          "Contenu": "No help at all..Update:Thanks for the reply. You're right, the issue was ultimately resolved after multiple emails and a threat of a credit card charge back for fraud. I've since received the ordered parts, but the path to get there was tiresome."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald Kline",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T04:39:20.000Z",
          "Titre": "Computer too old for card",
          "Contenu": "The one thing we did not talk about was the age of my computer.  Apparently my computer was manufactured before some date around 2016 such that this video card will not work in my computer although later versions of same HP computer will work with the card."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glenn Pate",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T14:02:50.000Z",
          "Titre": "The battery module we bought was…",
          "Contenu": "The battery module we bought was unusable.HDD did follow up with me after the review and have agreed to refund the purchase.  It would have gone better if they had checked the device before it was sent to be sure we weren't wasting our time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Al Terry",
          "Nb_Reviews": 2,
          "Date": "2023-01-15T22:28:39.000Z",
          "Titre": "Can't remember their names",
          "Contenu": "The first person I chatted with when I was going to order this board, was going to give me a healthy discount, I explained to him I was waiting for the person to bring me a credit card, to pay for this. When I went back to order the board, another person came on and said the deal was off. I told him about the other guy's offer and he still said the deal was off. He finally in the end took off $10. I wasn't happen, but need the board. I paid for it and waited for it to arrive. Upon inspecting the board, no items installed yet, I noticed some bent pins on the board where the CPU goes, is going to make  the board non- working. I have requested another board exchange and am currently waiting a response."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt C.",
          "Nb_Reviews": 3,
          "Date": "2022-12-13T22:01:14.000Z",
          "Titre": "I liked that they had the product…",
          "Contenu": "I liked that they had the product because it is hard to find, but I didn't like the hounding of my credit card and my Driver's license and then trying to tell me that wasn't enough to verify my damn address to send what I ordered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T20:43:22.000Z",
          "Titre": "Sales and Support, very good indeed",
          "Contenu": "Aman, our sales rep is very willing to assist in locating the necessary items to fulfill our needs. The entire team works hard to make sure we get what we need and they back up the product with great support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vladimir  Mikhelson",
          "Nb_Reviews": 3,
          "Date": "2023-08-11T15:51:13.000Z",
          "Titre": "Everything  works as expected, was: Still waiting for the shipment of my…",
          "Contenu": "Still waiting for the shipment of my order. Communication with sales was perfect.The shipment arrived at the end of July 2023. Everything worked out of the box, with no surprises.Now ordering another piece of equipment. Sales is very responsive, and easy to work with.Leaving four (4) stars as the original shipment was kind of slow. 4.5 should have been my choice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Professor C",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T17:02:03.000Z",
          "Titre": "I ordered a MOBO W/CPU",
          "Contenu": "Customer Service representative Mr. W. Richardson worked diligently to assist me with hardware compatibility problems.  Mr. W. Richardson did not quit, he persevered performed his due diligence, researched the hardware, sought advice of other experts and eventually, after what seemed like too many weeks,  Mr. W. Richardson found a solution that worked.  Any company that advocates the work ethic and integrity of a person like Mr. W. Richardson is a company that will be very successful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B. Reynolds",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T20:33:17.000Z",
          "Titre": "I think you get what you paid for!",
          "Contenu": "I think you get what you paid for.  HDD supplies hard to find end of life replacements and is honest about the results you should expect. They have sources and methods that the average purchaser has no access to, and deliver what they promise.  \"Eddie\" especially has the right service attitude and I will do business with him again. HDD is lucky to have him!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melvin Wolf",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T23:17:07.000Z",
          "Titre": "A Good Product",
          "Contenu": "The product looks and performs as expected (so far).  It was provided at a reasonably competitive cost to other online services, varying between the new and refurbished options.   Tech support was provided prior to ordering to ensure the product would be compatible.  There were some issues with the shipping process.  After placing the order, it was discovered that overnight delivery would not be an option.  Hard Disk Direct refunding the shipping fee instantly.  I was told the order would take 5 to 7 days for delivery - it arrived in 6.  I was told I would be kept posted and would receive a tracking number - neither were true. Overall, I would use there services again.  I don't believe the issues surrounding this order would be repeated and the product is what was needed."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Paul Turbide",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T14:02:04.000Z",
          "Titre": "I had a great service with your…",
          "Contenu": "I had a great service with your compagny, the omly thing is the custom fee (Canada) and freight cost, that makes it expensive, but I know that it is out of your control."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Austin Pryor",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T19:27:45.000Z",
          "Titre": "I bought a refurbished optical drive",
          "Contenu": "I bought a refurbished optical drive. It arrived today, eight days after order placed, so a little slow. Item was a little pricey, but worth it if it works and lasts. Too soon to say on that score. Staff seemed professional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "dwight",
          "Nb_Reviews": 4,
          "Date": "2023-08-13T07:33:39.000Z",
          "Titre": "this is the second big ticket item I've…",
          "Contenu": "this is the second big ticket item I've ordered have no complaints at all unit run great  . but it would of been nice with a factory manual thanx  dwight"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rod Baylor",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T01:59:35.000Z",
          "Titre": "Representative was able to correctly identify RAM required",
          "Contenu": "Representative was able to correctly identify module for my computer. I installed it and it improved performance. Delivery took a little longer than expected, but it was worth the wait."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeremy Brown",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T19:28:15.000Z",
          "Titre": "They had a hard-to-find product",
          "Contenu": "They had a hard-to-find product. Even with the industry mark up. They were still half of what other suppliers' cost. I received my order on time. When I opened the box, it had shipped with the wrong power supplies. 2 emails later the right one's ones were in route. and received a couple of days later even with it being the holidays."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J.R. Hallman",
          "Nb_Reviews": 2,
          "Date": "2022-12-18T16:51:33.000Z",
          "Titre": "had the disk I needed",
          "Contenu": "had the disk I needed, shipped it swiftly. They could be a little better communicating the process as I had to email if thry even got my request."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger C",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T01:44:38.000Z",
          "Titre": "Bob Ferguson is great",
          "Contenu": "Bob Ferguson is great!  Always looking for the rare spare parts we so desperately need.  He is quick to complete the order and ship it out!  Thanks Bob!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JFI",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T17:35:16.000Z",
          "Titre": "Had what we needed and the whole…",
          "Contenu": "Had what we needed and the whole purchasing process went smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T18:41:43.000Z",
          "Titre": "Gave me the right product and shipped overnight",
          "Contenu": "HDD gave me the product I needed, and went out of their way to get it to me overnight!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bhavya Kochar",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T15:14:46.000Z",
          "Titre": "On time delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PIN HSUN CHENG",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T22:30:33.000Z",
          "Titre": "Nice support and keep promise…",
          "Contenu": "Nice support and keep promise materialize!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Garman",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:47:40.000Z",
          "Titre": "I received my order faster than I…",
          "Contenu": "I received my order faster than I expected. Product was very close to what I wanted, but certainly what I can use for the intended purpose."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel C. Lurie",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:40:39.000Z",
          "Titre": "Outstanding Communication & Customer Service",
          "Contenu": "Cannot say enough good things about how this purchase went.  They contacted me through chat while I was looking at my cart, confirmed they had what I wanted in stock, expedited shipping to me at their expense, and ensured the product made it to my house, and worked.  Communication and customer service was simply stellar, and way beyond my expectations.  Could not be happier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hugo Bledoeg",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T00:46:49.000Z",
          "Titre": "When I turned to Aman Rehman from Hard…",
          "Contenu": "When I turned to Aman Rehman from Hard Disk Direct I immediately got a positive response on my customers problem. There was never a problem getting it right.Good seller to give a referral.  Thumbs up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddie Rivera",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T06:53:15.000Z",
          "Titre": "Responsive and attentive",
          "Contenu": "Folks at this shop have been super responsive and attentive to getting our needs met. When one of our arrays needed a hard disk on an emergency they bent over backwards to make sure we had what we needed. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Curtice",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T20:33:27.000Z",
          "Titre": "We had some trouble with order fixed!",
          "Contenu": "We had some trouble with address validation, and my email server was not working so my response emails were not getting delivered. After a call to the company, I reordered the parts and got them delivered! Excellent help and support to get it done. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LEM",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T16:58:04.000Z",
          "Titre": "I never hardly leave reviews",
          "Contenu": "I never hardly leave reviews, but this time I am because I noticed quite a few negative reviews about not receiving their product. I give you guys a 100% 5 star! I messaged Hector about what I needed on the built-in chat on their website before ordering. I received the 8 GB RAM stick two days after ordering it. This was your free delivery option, no extra paid to have it quick! I Will do business here again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony  Golubiewski",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:21:16.000Z",
          "Titre": "Order got messed up",
          "Contenu": "Order got messed up, but corrected quickly.  Great service, Great prices.  Quick response.  Will use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KinT",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T17:33:50.000Z",
          "Titre": "Good product, fast processing, will buy again",
          "Contenu": "Good product, paid for fast shipment but the order processing portion is fast too.Products are rough up on the edges, but this is pre-owned, it meets the expectations.Packaging was bare minimum, maybe ECO friendly, but not appropriate/adequate to my opinion. It could be much better.Overall experience is 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T17:52:20.000Z",
          "Titre": "My experience with Hard Disk Direct was…",
          "Contenu": "My experience with Hard Disk Direct was great. They shipped the drive I needed right away and it arrived the next day and is working as expected. The drive was well packaged and it actually arrived a day sooner than promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dan",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T13:53:50.000Z",
          "Titre": "problems addressed",
          "Contenu": "fed ex would not leave my package at the front counter. i was never left a tracking number so i emailed support and never received a reply. i tried leaving a voicemail and still have not heard back. i have no idea where my package is at and i need it for a projectAfter leaving the above review i was contacted by customer support who went above and beyond to make things right"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DW",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T15:16:22.000Z",
          "Titre": "Exceeded Our Expectations!",
          "Contenu": "We received the part we ordered sooner than expected.  A rep from HDD reached out to make sure we got the part and asked if we had any issues installing it.  They were quick to respond and offer tech support during the process.  This experience greatly exceeded my expectations!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra Hawkins",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T19:18:39.000Z",
          "Titre": "MS. SELINA MATTHEWS, ACCOUNT MANAGER",
          "Contenu": "WOULD LIKE TO EXPRESS OUR COMPLETE SATISFACTION WITH AN EMPLOYEE OF YOUR COMPANY MS. SELINA MATTHEWS. SHE ASSISTED  OUR COMMAND WITH A PURCHASE REQUIREMENT THAT WAS EXTREMELY URGENT;  SHE GOT RIGHT ON IT MAKING SURE THE  EQUIPMENT WAS AVAILABLE, TESTED AND SHIPPED OVER NIGHT.  BECAUSE OF MS. MATTHEWS EXPERTISE AND EFFORTS OUR TECHS WERE ABLE TO COMPLETE THE EMERGENT TASK WITHOUT ANY ISSUES.   WE WANT TO THANK HER AND TO LET HER KNOW SHE IS AN EXAMPLE TO FOLLOW. THANK YOU"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antony",
          "Nb_Reviews": 3,
          "Date": "2023-09-07T17:11:25.000Z",
          "Titre": "Great place to purchase your hardware!",
          "Contenu": "This is a great place to purchase your hardware for your IT services. They have a great customer service that will have you online during your purchase until you receive your product.  I am more than happy with their service. You will not regret it if you purchase from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al Terry",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T06:33:51.000Z",
          "Titre": "Mother Board",
          "Contenu": "I purchased a pre-used motherboard from Hard Disk Direct and upon receiving it, I noticed a defect on the board upon opening the box. I contacted support and Wayne Richardson sent me another board right away.I recommend this site for your computer needs. I also got a reduced price when I first ordered the board. They were very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy Edmonds",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T00:20:02.000Z",
          "Titre": "Good Experience",
          "Contenu": "Had an excellent experience working with Brad Atkins to resolve my problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T02:54:13.000Z",
          "Titre": "Great service, good person.",
          "Contenu": "Actually, FedEx failed to deliver in timely manner.  It took (2) deliveries for them to decide I had not moved.My initial experience with the purchase was great.  The service and continued follow-up that I received from Justin Brown was exemplary. He kept in contact with me and I believe he made the difference handling the snafu until the product was finally delivered.He made me feel like he cared about your success and my satisfaction. It is nice to find someone on the phone that doesn't create more distance.Out of respect for your guideline, I will say I don't know Justin, except for this sale. He represents your company well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Scherer",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T19:54:51.000Z",
          "Titre": "Hard Disk Direct saved the day!",
          "Contenu": "We were looking for a power supply for an Old HP computer to get a machine up and running again. Hard Disk Direct had the part listed, then Hector confirmed they had it and got it out to me next day air. They saved the day! A great experience and Hector was very helpful with my odd shipping request. Will use them again when I need PC parts."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Riley",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T22:04:04.000Z",
          "Titre": "Had the critical part we needed",
          "Contenu": "We ordered a critical part for a server that was hard to find due to age. There was a failure on the first refurbished item, but they rushed out a replacement right away, and we are now in a stable state. Zoey was a great help, coordinating the immediate replacement and delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T18:42:49.000Z",
          "Titre": "Sent the wrong part number, but was helpful in the end",
          "Contenu": "Sent the wrong part number: the part I requested did not match the part specified on the invoice, in the last two characters.  I spoke to Wayne on the phone and he said that the part is compatible.  I explained my use case to Wayne that requires a specific die revision.  Wayne offered to find me the exact part in their inventory."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T16:39:36.000Z",
          "Titre": "5 stars for Zoey",
          "Contenu": "5 stars for Zoey!  Had a problem with a stick of memory and she was very helpful and pleasant. Sent another stick immediately when I requested it, no questions asked. I will do more business here!"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "M B",
          "Nb_Reviews": 7,
          "Date": "2022-12-22T23:50:59.000Z",
          "Titre": "Great Global Hardware Provider - ask for Bob",
          "Contenu": "We are a company in the Middle East that needed spares for a network update/upgrade project.  Despite reports to the contrary, the journey to the cloud still requires hardware onsite. We were searching worldwide for parts and finally found the two groups of adapter cards we needed at Hard Disk Direct. We reached out to the generic sales email at Hard Disk Direct, and Senior Account Manager Bob Ferguson replied. He was quick with the quote, offered us a discount to bring the order within budget and enabled the purchase method that suited our needs. Despite the 11-hour time difference, he came back to us promptly. Mr. Ferguson coordinated with his shipping department and the shipper to get the order out quickly, well packed and with the correctly filled out VAT/Customs forms. That enabled the spares to reach us without additional fees or delay. It was an excellent experience and we will work with Mr. Ferguson and Hard Disk Direct again. Thanks for the great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B. Rimoldi",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T00:16:23.000Z",
          "Titre": "Great Company for Outsourcing Material",
          "Contenu": "Great company and sales person that I've been working since finding HDD.  Whenever I have problems finding a material part, I can always rely on Eddie to provide support in finding what I need.  He's an awesome sale's person who is reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Irina Kotzabaldiris",
          "Nb_Reviews": 2,
          "Date": "2021-02-24T21:50:07.000Z",
          "Titre": "The electric supply of the Gilbarco…",
          "Contenu": "The electric supply of the Gilbarco system  computer that controls my business outside at the dispensers and inside the store burned out. The search on Google gave me stores that did not had the part number. On Amazon no luck. The only company that had the part number is Hard Disk Direct that save my business from being closed 5-6 days or more. The customer service was incredibly fast ,knowledgeable, kind, offering overnight delivery. After I talked to Customer Service of Hard Disk Direct all the problems were resolved. I am giving 5 stars and recommending it for specialized computer parts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Kercher",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T18:46:59.000Z",
          "Titre": "Your sales staff was the difference",
          "Contenu": "Your sales staff was the difference. They were very helpful in resolving a minor mis understanding. It was quickly resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin B.",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T21:36:14.000Z",
          "Titre": "Outstanding product",
          "Contenu": "I was incredibly pleased with the condition of the motherboard I received. It was everything I hoped it would be--clean and no signs of mishandling. I did the installation the very next day and couldn't be happier with the result. My 2009 Asus G72GX has been given a new life! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Courtney Lowe",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T01:58:43.000Z",
          "Titre": "Hector gets a 10/10",
          "Contenu": "This was the best customer service chat experience I have ever had. Give Hector a raise. He was professional and super helpful in a time urgency for me and really saved the day. 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T02:07:15.000Z",
          "Titre": "Great support to ensure I was picking…",
          "Contenu": "Great support to ensure I was picking the right product online. Wasn’t expecting that. I was pretty sure I was ordering the right product but it was cool ensuring I got it right and that they indeed had it in stock in real time. Works fine. My friend is super pleased as taking it to a “we fix it” store was going to be price prohibitive and they couldn’t even guarantee they could make it happen. He owes me…big time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Sprague",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T15:51:24.000Z",
          "Titre": "Selina and her entire team have always…",
          "Contenu": "Selina and her entire team have always gone above and beyond to source and ship components that are not only difficult to find, seldom available worldwide.Thanks to HDD for the great service and we look forward to a successful 2023!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc A Solomon",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T23:59:58.000Z",
          "Titre": "helpful despite having to return",
          "Contenu": "I had the wrong info from my computer company about the item purchased. The item was not compatible with my system and needed to be returned. I did have to pay a bit of a restocking charge but since this was neither their fault nor mine, they worked with me to make it an acceptable and not punishing me for it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Omar Gadir",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T17:53:46.000Z",
          "Titre": "Very responsive and good follow up",
          "Contenu": "Very responsive and good follow up. When I contacted Hard Drive Direct I do not have the full  information about my part . Eddie was  very cooperative and quick in finding the missing information. His follow up and execution  was immaculate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Marroy",
          "Nb_Reviews": 3,
          "Date": "2023-03-02T19:07:04.000Z",
          "Titre": "Very responsive to my issue",
          "Contenu": "The hard disk I purchased could not be used in my laptop. When I explained the situation to the company they offered to give me a full refund, even though that was not their policy. I appreciate their responsiveness to my issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Stallard",
          "Nb_Reviews": 3,
          "Date": "2023-10-03T22:16:48.000Z",
          "Titre": "Fast, got what I ordered, and they had what I needed",
          "Contenu": "Web site was simple to navigate, they had what we needed and it was fairly painless to get things ordered.  Arrived in good shape, packaged well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JW Wood",
          "Nb_Reviews": 1,
          "Date": "2021-06-11T22:55:01.000Z",
          "Titre": "This company Rocks",
          "Contenu": "This company Rocks! The chat feature online is the bomb! Very Professional and their prices are competitive. Thanks to Hector and Ben, what a great experience buying from those guys!  Thanks Hard Disk Direct!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Hubert",
          "Nb_Reviews": 3,
          "Date": "2023-07-26T22:30:09.000Z",
          "Titre": "In their warehouse today; in your hands tomorrow!",
          "Contenu": "Saw the part online; called and got Ryan who quickly confirmed the part was in stock and made arrangements to get it to me as quickly as possible!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dinka",
          "Nb_Reviews": 3,
          "Date": "2022-10-07T14:34:29.000Z",
          "Titre": "I recommend Hard Disk Direct for all…",
          "Contenu": "I recommend Hard Disk Direct for all PC-related accessories, including covers, adapters, and batteries. Their outperforming products are second to none; I received my RAM from their store, and it's working perfectly. I appreciate their services and rate them five stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Hall",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T17:35:09.000Z",
          "Titre": "Arrived in two days by USPS with free…",
          "Contenu": "Arrived in two days by USPS with free shipping, although 1600+ miles.  Installed disk and firmware right away the printer works again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T14:54:28.000Z",
          "Titre": "Good communication, product and service!!!",
          "Contenu": "I ordered a hard to find part from HarddiskDirect which they had in stock. They shipped it quickly as promised in good quality packing so it arrived un damaged, great guys to work with. I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber Wise",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T16:10:00.000Z",
          "Titre": "Amazing service and follow up",
          "Contenu": "Amazing service and follow up! Ryan and team have been a pleasure and very wonderful! I work with many suppliers and HDD is a standout! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T00:07:02.000Z",
          "Titre": "Hard Disk Direct were quick to respond…",
          "Contenu": "Hard Disk Direct were quick to respond to my question and issue and Wayne was incredibly helpful the entire process! I would certainly buy from this company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T18:14:43.000Z",
          "Titre": "Selina and her team at Hard Disk Direct…",
          "Contenu": "Selina and her team at Hard Disk Direct are outstanding. They came highly recommended by one of my coworkers and haven't disappointed. Great customer service, competitive pricing and willing to check on multiple options for support."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Shah",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T10:49:44.000Z",
          "Titre": "Dedication",
          "Contenu": "My transaction was smooth and managed by knowledgeable people at Hard Disk Direct. I would have picked up the wrong part at a high cost but Ryan saved me. Thanks, HDD team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn Stanford",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T17:06:10.000Z",
          "Titre": "Sales person was very friendly and…",
          "Contenu": "Sales person was very friendly and helpful.  Good communication vie phone and email.  Part I ordered arrived on time.  Thanks for a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Braun",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T00:38:59.000Z",
          "Titre": "I was able to order specific revision…",
          "Contenu": "I was able to order specific revision codes of parts I needed instead of just what they had.  All the parts were exactly what was ordered.  The cable sets were shipped a bit later but looked new and were exactly what was required."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Massicot",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T22:35:26.000Z",
          "Titre": "My customer service rep was on top of…everything",
          "Contenu": "My customer service rep was on top of my order from quote to shipment w/o any hiccups."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oscar Carmona",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T23:58:49.000Z",
          "Titre": "Saved the day!",
          "Contenu": "After many other contacts we tried, they made it happen to us finding the appropriate drive for the appropriate system in an Enterprise environment. Not even extended warranty support were able to find the drive we needed. Great communication too with Eddie and James."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve NRS Law",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T22:24:12.000Z",
          "Titre": "Great company to work with",
          "Contenu": "Great company to work with. Had exactly what I needed to perform our server upgrade. Justin provided great customer service and is very knowledgeable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Merrill Bryan",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T17:06:06.000Z",
          "Titre": "Great working with HDD",
          "Contenu": "Great working with HDD! They always provide prompt attention to our requests and work on pricing for larger orders as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yelena Demidenko",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T22:39:38.000Z",
          "Titre": "Wonderful service",
          "Contenu": "Wonderful service! We were able to get our parts delivered at the promised time :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Crocker",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T20:05:23.000Z",
          "Titre": "Easy to find what I needed",
          "Contenu": "Easy to find what I needed.  Great prices and fast shipping.  Always a good experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael  Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T23:00:04.000Z",
          "Titre": "Awesome Customer Service",
          "Contenu": "Awesome Customer ServiceFazz was amazing got a part even when his own resources found it to be DOA. He found another one and had it the next day to me next the morning!!! A+++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russ Moser",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T15:38:34.000Z",
          "Titre": "Great Prices and Prompt Shipping",
          "Contenu": "Great Prices and Prompt ShippingBob Ferguson was great to work with in getting the drives shipped to us.  He provided excellent customer service.  We will use Hard Disk Direct again for our drive needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan Wengerd",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T11:52:10.000Z",
          "Titre": "Quick and professional service",
          "Contenu": "Someone was on the chat right away to help me, and was there till the order was complete. Down to earth but very professional. To say nothing of the speed which we got the product, was impressive. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Laizure",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:22:43.000Z",
          "Titre": "Everything went as it should",
          "Contenu": "Everything went as it should. Thinks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Guzman       Jr.",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T00:53:05.000Z",
          "Titre": "Received exactly what I had purchased!",
          "Contenu": "Received exactly what I had purchased!Received it in a timely manner!It was packaged in a careful manner!Easy to install and works great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "chris byrne",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T04:57:29.000Z",
          "Titre": "I was in desperate need of memory that…",
          "Contenu": "I was in desperate need of memory that I couldn't seem to find anywhere but the team at Hard Disk came through for me.Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Mazarella",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T02:29:02.000Z",
          "Titre": "Great customer service",
          "Contenu": "Sales person was very helpful. Went out of his way to accommodate my request and offered technical assistance. They seem very committed to customer service."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Geovana",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T18:48:47.000Z",
          "Titre": "10/10 Recommend",
          "Contenu": "The entire process was pretty simple and our rep really helped with everything. It was a pretty easy purchasing process overall."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Mills",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T17:43:57.000Z",
          "Titre": "Had the right part!",
          "Contenu": "Had the right part!It worked!They communicated shipping status!They followed up!Very happy with the service I received!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Tschorn",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T21:12:48.000Z",
          "Titre": "I got a live body in the chat who made…",
          "Contenu": "I got a live body in the chat who made sure thee part I needed was compatible  -- and it was! Very helpful for a first-time customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dave trubey",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T21:17:05.000Z",
          "Titre": "I originally received the wrong power…",
          "Contenu": "I originally received the wrong power supply they were very quick in to replacing it with the right one"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Friss",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T02:05:30.000Z",
          "Titre": "Super Responsive, Very Helpful & Outstanding Customer Service",
          "Contenu": "It's Super easy to give Hard Disk Direct a 5-Star rating! I would definitely recommend this company to my friends, family and co-workers! I initially found the vendor from a POC at Dell and I'm so thankful that I did! I have had nothing but Exceptional experiences with this company and more specifically with a Sr. IT Consultant! They are Excellent Communicators, Very Responsive, Professional, Competent, Positive and Friendly! l work with many Sales Representatives regularly and unfortunately, I've only found a limited number of them that provide Great customer service! Usually I have to email them multiple times and it takes too long for them to satisfy my requests, if they can at all. This is Definitely Not the case at Hard Disk Direct! This Sr. IT Consultant is a Unicorn, someone that from day 1 has Always been honest, hard working, helpful, on top of their job and really taking the initiative for building a Fantastic customer service network! They have been assisting me with part availability and providing pricing since April and it's a breathe of fresh air knowing that I'm in good hands and can trust that they are going to do what they say they are going to do! The turnaround time is absolutely top notch! I can tell that they really are putting forth their Best effort and care about their job and assisting others! I Greatly appreciate Hard Disk Direct and all of the time, effort, cooperation and assistance that I've received since discovering this company!!! All thanks to SM, this Sr. IT Consultant who really shines, is doing wonderful things to help her company and truly makes people's jobs around them more enjoyable! Thank you for Everything that you do!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Benedikt Jost",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T22:05:01.000Z",
          "Titre": "That is how it should be :-)",
          "Contenu": "Good shop, fair pricing, excellent performance in shipping overseas, nice communication.If i forgot something, it's on me :-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vern Torres",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T18:03:57.000Z",
          "Titre": "Our rep -Wayne Richardson",
          "Contenu": "Our rep : Wayne Richardson               Customer Support ManagerWayne was amazing to work with!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Phelps",
          "Nb_Reviews": 5,
          "Date": "2023-01-06T05:23:16.000Z",
          "Titre": "Fast service. They shipped the same day I ordered.",
          "Contenu": "I was able to complete the purchase as a guest and they shipped within hours of placing the order. It arrived in 2 days and it was playing within minutes. Good job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Miller",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T15:33:26.000Z",
          "Titre": "Very happy with Hard Disk Direct",
          "Contenu": "Rep was very helpful selecting the correct chips.  Had a problem with the billing which was clickly resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Grisanti",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T00:06:59.000Z",
          "Titre": "I had a hard drive go bad because of a…",
          "Contenu": "I had a hard drive go bad because of a recent power failure.  Ryan and his team got me a replacement the next day."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Fox Technology LLC",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T18:20:06.000Z",
          "Titre": "Very helpful sales team",
          "Contenu": "Very helpful sales team . Been great upto now. And we hope for good future opportunities. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IT Manager",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T16:00:46.000Z",
          "Titre": "Hard drives for my older server were…",
          "Contenu": "Hard drives for my older server were available, at a reasonable price and shipped promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Rodriguez",
          "Nb_Reviews": 3,
          "Date": "2023-01-12T22:00:33.000Z",
          "Titre": "Server HDrives",
          "Contenu": "The shipment of the Cheetah Hard Drives was great!   Cannot comment on the drives as my IT Guy has not installed them yet?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liviu Sandu",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T03:47:48.000Z",
          "Titre": "Selina and her team always delivers!!!",
          "Contenu": "Selina and her team always delivers. It has been great support form them in any of our needs.Thank you for being around when need it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "OAKDALE I.E.",
          "Nb_Reviews": 1,
          "Date": "2021-01-13T18:58:02.000Z",
          "Titre": "GREAT CUSTOMER SERVICE BY FAZZ!",
          "Contenu": "FAZZ HAS BEEN A PLEASURE TO WORK WITH. HE PROVIDES QUICK REPLIES, HE IS EASY TO GET IN TOUCH WITH AND HE IS WILLING TO WORK WITH YOU.  I DEFINETLY LOOK FORWARD TO DOING BUSINESS WITH HIM IN THE FUTURE."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Michalakeas",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T17:32:17.000Z",
          "Titre": "Helped me select the correct RAM…",
          "Contenu": "Helped me select the correct RAM modules. Quick delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Lemoin",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T20:20:46.000Z",
          "Titre": "Not sure of the exact date",
          "Contenu": "Not sure of the exact date, but everyone I spoke with was professional and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mildor Violon",
          "Nb_Reviews": 1,
          "Date": "2021-01-13T03:06:50.000Z",
          "Titre": "Great service thats for sure",
          "Contenu": "Great service thats for sure. I purchased 6 disks. I received one disk which broke fast, but as soon as I told Steven from HDD, it was quickly replaced. Love the direct help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Conner Winn",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T20:24:09.000Z",
          "Titre": "Replaced my order",
          "Contenu": "They were out of stock for what i ordered and replaced it with something better for the same price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antoni Sawicki",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T04:04:23.000Z",
          "Titre": "good price",
          "Contenu": "good price, fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CR Beauregard",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T03:52:41.000Z",
          "Titre": "Excellent service excellent packaging",
          "Contenu": "Excellent service excellent packaging. Delivered on time quickly and just what we needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MS",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T20:59:48.000Z",
          "Titre": "Top-level customer service and…",
          "Contenu": "Top-level customer service and communication, helped us out of a plant outage emergency. Gina was amazing!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joan Haworth",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T21:17:51.000Z",
          "Titre": "Always Great!",
          "Contenu": "The staff at HDD are always great to deal with and shipping is fast and accurate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Williams",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T18:12:41.000Z",
          "Titre": "Delivery was fast and solved my issue",
          "Contenu": "Delivery was fast and solved my issue. Will definitely buy again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LH",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T19:48:01.000Z",
          "Titre": "Great service from Ethan",
          "Contenu": "Great service from Ethan!  We had to return a faulty product and he processed the return promptly!  Thanks Ethan!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard Colburn",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T21:55:56.000Z",
          "Titre": "Great Service",
          "Contenu": "The Representative who assisted me went out of his way to help me get a compatible power supply for a monitor that required an unusual power supply"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "David Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T21:14:39.000Z",
          "Titre": "Great buying experience",
          "Contenu": "Great buying experience! Tracking # was informed on time, product of great quality"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T02:23:13.000Z",
          "Titre": "Bryan was very helpful in resolving my…",
          "Contenu": "Bryan was very helpful in resolving my power source dilemma."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David C",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T16:14:59.000Z",
          "Titre": "Fast customer service follow-up",
          "Contenu": "Appreciate the quick reply to any questions I have."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2019-10-21T14:46:51.000Z",
          "Titre": "Very fast and reliable website online…",
          "Contenu": "Very fast and reliable website online store. I will buy from them again in the future.Thanks team. Keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "INTOSYS  SA  DE  CV",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T17:41:21.000Z",
          "Titre": "congratulations",
          "Contenu": "hi ,  the service  in all  is  good  ,  good  delivery time ,  i looking for  a vendor   is  fast .good  work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B Privat",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T16:39:55.000Z",
          "Titre": "Selina is very easy to work with!",
          "Contenu": "Selina is very easy to work with! Gave all of the information up front and was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Louis A Acosta Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T13:42:43.000Z",
          "Titre": "The order was delivered immediately and…",
          "Contenu": "The order was delivered immediately and worked perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark  Farabaugh",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T17:11:00.000Z",
          "Titre": "we got drives we need and agent was…",
          "Contenu": "we got drives we need and agent was polite and knowledgeable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOSE N RAMIREZ",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T02:33:11.000Z",
          "Titre": "it was very easy to place my order and…",
          "Contenu": "it was very easy to place my order and i got help with my part number. really like it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leah",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T18:46:43.000Z",
          "Titre": "The representative that chatted with me…",
          "Contenu": "The representative that chatted with me online was very helpful and super nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jack steinmetz",
          "Nb_Reviews": 3,
          "Date": "2023-08-23T18:35:55.000Z",
          "Titre": "Expensive  but great service and no…",
          "Contenu": "Expensive  but great service and no issues"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T18:39:28.000Z",
          "Titre": "Order arrived very quickly and…",
          "Contenu": "Order arrived very quickly and performed as expected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil Gray",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T17:43:21.000Z",
          "Titre": "Hard Disk Direct",
          "Contenu": "They were quick and paid a great deal of time oncustomer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EDUARDO GUTIERREZ",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T17:22:10.000Z",
          "Titre": "Wayne help me through all the process…",
          "Contenu": "Wayne help me through all the process and he kept me updated all time It was great. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas MacBriar",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T05:43:10.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, protective packaging, exactly as ordered."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Alberto Izaguirre",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T01:35:00.000Z",
          "Titre": "Great Experience over all",
          "Contenu": "Service, logistics, pricing, all in one place"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Aleksandr  Lukashevich",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T09:39:01.000Z",
          "Titre": "Thank you for prompt response and fast…",
          "Contenu": "Thank you for prompt response and fast service. All went well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T15:32:24.000Z",
          "Titre": "Product shipped timely and correctly",
          "Contenu": "Product shipped timely and correctly. Good pricing."
        }
      ]
    }
  ]
}