{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "hellomobile.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shawn “Made by America” S",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T21:58:22.000Z",
          "Titre": "Do NOT waste your money on this company…",
          "Contenu": "Do NOT waste your money on this company period! I pay for unlimited for the past 3 months and they have shut off my network every time I hit 17 gb. If you use a lot of internet while on the road, I highly suggest you, your family and friends do NOT get this scam company! They all read from the same exact script, they will play games with you and make you run around for hours, to find out that nothing will be done! F this company I pray that someone she’s the existence out of this scam company. I am on the go everyday, when I gigs hits 17, I can no longer use my maps or anything, huge F to this sad scam company do NOT waste your time, and money on these commie clowns."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Derek T",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:26:42.000Z",
          "Titre": "Don't waste your money I have unlimited…",
          "Contenu": "Don't waste your money I have unlimited service with them and my data is running at 0.10 kbps after only using 5gb of data .  Plus there customer service is almost useless"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Red Pill Drip",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:23:35.000Z",
          "Titre": "Terrible service tbh, slowwwwwwww",
          "Contenu": "Only get this service if you are mainly using your phone for calls. The service sucks here in Connecticut. My apps don’t even load because of how slow the internet is. It takes me 20 minutes to load one video or app. Ridiculous. Might as well pay more than to waste your time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T16:42:58.000Z",
          "Titre": "This service is almost worthless",
          "Contenu": "This service is almost worthless. The times that incoming calls go to voicemail, or just plain disappear can't be counted, but they are many. When I attempt to place outgoing calls, I frequently get a \"service unavailable\" note in red, or the call just goes nowhere. Even when the call does connect, it usually takes a long time to connect. Considering the number of calls that complete in a month, this service is very expensive, even at $5 per month.   Again, this service is nearly worthless. If there was a zero star option, I would mark it thus."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daveed Hallman",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T12:18:17.000Z",
          "Titre": "I open a account on Nov 22 for $5",
          "Contenu": "I open a account on Nov 22 for $5, absolutely worse plan for me, tried to change to $25 plan a few days later, said I must wait til Jan 22 before I could switch so here I wait for nearly 2 months so i can have a plan that will benefit me. Makes nonsense to me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T04:40:59.000Z",
          "Titre": "Hello Mobile unlimited international is…",
          "Contenu": "Hello Mobile unlimited international is a scam and false advertising . It is not really unlimited. You can only call first 10 numbers international for a month. For any other calls you need to recharge and pay extra"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "April from",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T16:50:25.000Z",
          "Titre": "Service sucks",
          "Contenu": "This service and the phone is worthless. I got it for my 11 year old and it sucks. This will be my last month with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PikaJaws",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T20:55:06.000Z",
          "Titre": "\"Unlimited Talk and Text\"",
          "Contenu": "\"Unlimited Talk and Text\" yet they take away my texting about a week into my billing cycle. There is nothing unlimited about their unlimited Talk and text. You're basically just using your talk and text til they decide to shut it off for the rest of your cycle. For some reason they seem to love me and take my texting away within about 5days into my billing cycle leaving me unable to text for 25days!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T07:00:22.000Z",
          "Titre": "Due date is too inconvenient and there is no customer service to help.",
          "Contenu": "The rate is reasonable enough but there is no customer service to speak to it is all automated I realized I activated my plan on the wrong day of the month. I don't want to pay any bills on that day so I am not keeping a plan I can't pay. I didn't like this treatment. I want my phone bill due on a certain day not just dt any day I wish I had not activated my plan. I will not be activating with any phone with you until I get the day of the month I can pay my bills. If this isn't settled by dec 6 then I'll quit that s company  it is unacceptable for me I dould never have hot this plan of I knew this even at five dollars!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry M",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T01:36:03.000Z",
          "Titre": "Unable to order new service",
          "Contenu": "I tried to order new service using two different web browsers on my PC, but the web page for doing so does not work.  After waiting for almost 15 minutes for online chat support, all I was told was to use a table of phone instead.  Apparently, this company does not want not customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Metin Isik",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T18:43:31.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service and extra charge for eSIM. Wasting time and money. If you want to switch to Hello Mobile think one more time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Johnny B Goode",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T19:50:58.000Z",
          "Titre": "Poor performance",
          "Contenu": "My phone goes to \"Searching\" or \"Emergency calls only\" mode off and on, many, many, many times throughout the day. Called in Hello Mobile support several times and they couldn't help. Tried every possible fix to remedy the situation w/o any results.  Moved my HM sim-card to an identical phone .. same result! I am curious if any other subscribers have a similar experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelli Bartlett",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:49:22.000Z",
          "Titre": "I don't get any service anywhere I go",
          "Contenu": "I don't get any service anywhere I go. I can't make a phone call or see the phone call whenever I'm inside my house or anywhere on my property. I also can't even use my own phones internet connection while I'm away from Wi-Fi. I don't understand why I even pay for this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shawn “Made by America” S",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T06:07:29.000Z",
          "Titre": "Hello mobile rips customers off",
          "Contenu": "Since I have been with this company for several months now, every month on the exact same days, my network will not work because this scab company shuts off peoples network. They all say the same exact crap reading off a script and act as if they nothing about it. I pay for unlimited everything and by the 25th of every month my network would not be working except for regular text and phone calls. I am done with this scab company ripping people off, i pay for unlimited, i should have unlimited all the way until my bill is due to refill. I highly do NOT recommend this scab company."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T20:20:43.000Z",
          "Titre": "very bad! Caution!",
          "Contenu": "very bad! There is no customer service, they do not answer or handle. The company promises things in its advertisements and it does not deliver, there are many problems with the lines. Not recommended at all! Caution!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T04:22:51.000Z",
          "Titre": "Delivery of product takes so long time",
          "Contenu": "Delivery of product takes so long time. Every next day I receive an email saying something is wrong/missing. Furthermore, the carrier is amazon and I didn’t know that. On the day of arrival I checked the order status which said delayed shipping and need to update address and contact with amazon. I hope I won’t have such kind of issues in future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ericka F.",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T00:51:36.000Z",
          "Titre": "Unimpressed",
          "Contenu": "So far this company is not impressive at all.  Price looks good but it has been over a week and I have not received my SIM card yet.  Customer service is not helpful so far, asking me to be patient.  Could not call because my account number was not recognized and had to go through live chat, which is most likely a robot."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mr N.",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T19:56:31.000Z",
          "Titre": "Your customer service is BAD!!!!",
          "Contenu": "Your customer service has never been great but it's actually gotten worse. I'm trying to get a new sim card and telephone number but it seems Hello Mobile wants to bill me for a month of service before I actually receive said sim (even though my old account wasn't active for well over a year!). I initiated a chat to find out why and was asked to provide my address AFTER it was already provided and then the rest of the conversation remained unanswered as if the agent took a bathroom break. Nope."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aminu NYAMALI",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T19:54:56.000Z",
          "Titre": "Is really quiet unfortunate despite my complaint no response my…",
          "Contenu": "Is really quiet unfortunate despite my initial hope, trust and belief for Hello Mobile all was put to the bin. Even since my sim card was delivered by Hello Mobile,and after reactivation of my sim card never got service. I'm still in great shock till date, despite my several complaints to Hello Mobile no response as to address my challenges of no network on the sim card delivered.  I still hope looking forward in resolving this issue.  Regards."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "National Motor Co.",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T16:59:43.000Z",
          "Titre": "Hello mobile no more! Thanks T-Mobile",
          "Contenu": "Hello mobile started having an issue for the last 3 weeks with data. On unlimited plans the speed went down to .87 download and .85 upload. This is like back in early 90s internet. Ordered 2 more separate unlimited SIM cards and tried on 2 different phones with same results. Customer service SUPERVISORS are literally reading possible bologne causes from a paper (very obvious) I think since T-Mobile went up on prices of their packages, hello mobile customers are getting punished by being put all the way down on T-Mobile mvno priority list."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leo",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T03:43:30.000Z",
          "Titre": "i was so disappointed",
          "Contenu": "i was so disappointed, they just shipped 1 sim on my 2 lines order, they said that they shipped the 2 lines in one package but after i got the first sim, and call/chat to follow up the 2nd sim, they just said to resend the 2nd sim after 7 days, They charged me for 2 lines even I activated only the 1! so unfair!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Prefer Not to Use my Name",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T22:31:45.000Z",
          "Titre": "Nothing but SPAM calls and SPAM texts",
          "Contenu": "I put in the new Hello Mobile SIM Card and I immediately started getting a slew of spam telephone calls and spam text messages.  This started literally within 10 minutes of the SIM insertion and continued constantly.   I went to the Hello Mobile chat to see what could be done, but was told that they reused phone numbers, and I could switch without charge only once, and thereafter it would cost me $5 to change again.  I asked them to close my account as the service was more an annoyance than a convenience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-09-13T17:43:47.000Z",
          "Titre": "Awful people, company & service",
          "Contenu": "Unhelpful, uncooperative, inept, incompetent, scammersSent a phone I didn't orderCharged me for it, then wanted me to pay for the return3 hours on chat & phone calls later, they e-mail a USPS shipping label & ask that I leg it to the post office after they sent it by UPSRefused to have UPS pick up the misdelivered item or credit my account until returnDo not do business with them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SRE",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T22:37:38.000Z",
          "Titre": "I have called multi times to setup a…",
          "Contenu": "I have called multi times to setup a new account with 2 lines-every time I call, I get a different answer. I finally spoke to a supervisor who helped me order the Sim cards, but told me I can’t order the phones until I get the Sim cards. These phones are for my grandchildren‘s birthday which is in a week and I don’t know what to do if someone could call me at 847-962-2022."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T19:04:32.000Z",
          "Titre": "At some point I had five lines",
          "Contenu": "At some point I had five lines. Later I downsized to 3 lines. Even though those two other lines were ported to another carrier and the lines of course had no consumption of data or calls or texts, I still got charged for five lines during the following two months. When asked for credit, they said that they couldn't give me one. A other time, I spoke to a costumer representative to ask why the internet was so slow amd they said it was because I had probably reached the limit which according to them was 18 gb. When I checked my account, I had used only 10gb. I'm definitely looking for other mobile carries."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T22:49:46.000Z",
          "Titre": "Warning id10ts @ work",
          "Contenu": "What went wrong happened last month when I had time to fix a card getting near it's expiration. I called and talked to a couple of different support folks trying to resolve the issue and was told 'do not worry about it'. Now that payments have failed due to the expired card I must take time to setup the new card! I've spent twice the necessary time to fix the issue and now you Id10s want to know what went wrong. Wake up and do your job boneheads!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Uniontown PC",
          "Nb_Reviews": 4,
          "Date": "2023-09-19T14:08:01.000Z",
          "Titre": "No customer support",
          "Contenu": "No customer support. Recently lost all cell phone connectivity with hello mobile, but multiple requests to customer support have gone unanswered after a couple of months now.  I still have no cell service with hello.  Will be closing my account and have already started moving to a different provider who provides customer support when needed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T00:14:28.000Z",
          "Titre": "Genuinely one of the worst service…",
          "Contenu": "Genuinely one of the worst service providers out there. the customer service agents are great at making you want to switch to a different provider and so is the service itself. The \"Unlimited\" plans are actually just 20 GB whether you choose the 25 dollar one or the 40 dollar one. spend your money wisely"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Allen",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T03:51:14.000Z",
          "Titre": "no service low signal unable to receive calls when roaming",
          "Contenu": "low signal no service unable to receive calls while roaming dropped calls maybe need more towers in eastern nc i would not recommend to anyone . The customer service is very helpful and do a great job"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Antonio",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T14:03:22.000Z",
          "Titre": "My SIM card order has been at a…",
          "Contenu": "My SIM card order has been at a standstill with no progression on delivery since 9/29 and they say it’s still in the wit of delivery. You can guess that item has been lost. Why not just ship me a new one instead of making me wait. Not a good first impression. Bad customer experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amelia Voss",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T02:46:27.000Z",
          "Titre": "I already have a hello mobile sim card",
          "Contenu": "I already have a hello mobile sim card, I don't need to create more e-waste and anyways I needed a phone to work sooner. When I tried contacting support about getting me set up sooner they just hung up on me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T01:15:14.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Very disappointed, you deleted my number from my account even after explainlng to you, and after all the trauma you caused me you gave me a new number with a different area codemy name Chaya Braun  347 385 8954  old numbernew number 845 406 2645"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T21:20:21.000Z",
          "Titre": "I have the unlimited plan",
          "Contenu": "I have the unlimited plan, but the network speed was limited to 2G or 3G network after I spent some data (do not know how much), but it is not a temporary thing. You won't have high network speed in your next cycle. Your speed is limited forever. I am considering changing to other carriers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T01:07:53.000Z",
          "Titre": "The bad one I have ever used",
          "Contenu": "After I switch to HELLO MOBILE for the 2nd month, I didn't get the 2nd month for free. I tried to call the customer service center, but the one who answer my phone said I didn't apply for that when I transfer my number to HELLO MOBILE. However, as you see, everyone can have the 2nd month free discount because their AD always mention that.VERY BAD experience so far. AND I choose the unlimited plan but it was not. Its wi-fi sevice is very slow and the signal is bad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Krunal Chaklasia",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T19:23:30.000Z",
          "Titre": "eSIM is not supported from many years",
          "Contenu": "eSIM is not supported from many years. Because of this reason I can't bring new iphone 14 or iphone 15 to HelloMobile. Everytime I ask customer service they say, it is not supported but will be supported soon. But god knows when. It is cheapest option though."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oleh Polehenkyi",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T23:58:21.000Z",
          "Titre": "The support employee asked me for the…",
          "Contenu": "The support employee asked me for the address 10 times and each time I wrote it down. Each time he said that he would not communicate with me until I gave the correct address. I gave the correct one. And my Internet speed is also very slow. I am very dissatisfied."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T17:22:22.000Z",
          "Titre": "I pay for unlimited service and 4 days…",
          "Contenu": "I pay for unlimited service and 4 days prior to my “re up” my phone calling/receiving portion of my service went down and did not come back up until my monthly payment was due. I was assured it was no fault of hello mobile and that it was my phone but it wasn’t."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shaghayegh",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T21:04:49.000Z",
          "Titre": "slow internet connection even at the beginning of the month!!",
          "Contenu": "My internet only works at the beginning of month and for the rest of the month it is so slow and now even at the beginning of my payment it’s not working well and too slow ! I should add that it wasn’t like this last year and I never had problem with that but lately I’m not satisfied at all !"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Zachary Jacques",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T02:45:15.000Z",
          "Titre": "The SIM card didn’t work on my iPhone…",
          "Contenu": "The SIM card didn’t work on my iPhone 5s, despite the site compatibility checker saying it would after I entered my IMEI number. The phone just says the sim is not compatible, even after following the instructions as given by the mailer and their site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mr Yum Yum",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T22:14:05.000Z",
          "Titre": "I was lied to on 09/26/23 that a free…",
          "Contenu": "I was lied to on 09/26/23 that a free SIM card was being sent to me. I found out today it wasn't. I've been waiting a week for no good reason. I even got a confirmation # 228212717 in an email from Hello Mobile. After 9 days of waiting I messaged one of your clueless representatives today that said oh u have to pay first. So why wasn't I told this 9 days ago?? If ur customer svc is this awful I can only imagine how bad the phone service will be... Looks like it's good bye to Hello mobile and on to Mint Mobile thanks 4 nothing 👍"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bhaskar Allam",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T03:43:21.000Z",
          "Titre": "No Network",
          "Contenu": "There is network at all at my office location, Everett, WANo Network at all, couldn't make at least one call from my office location"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T14:40:42.000Z",
          "Titre": "Tech support is terrible",
          "Contenu": "Tech support is terrible The service is inexpensive and works most of the timeWhen it doesn’t work you will be on hold for hours and not get a resolution, then call back and spend additional hours on the phone reexplaining the problem to 5 different people"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T19:11:10.000Z",
          "Titre": "Hello Mobile stole my money",
          "Contenu": "Hello mobile has been charging me for a line that was ported to another carrier for over one year.  When I finally noticed add called them they refused to refund me even though they acknowledge that the number was ported over an year ago."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hello Mobile customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T17:59:33.000Z",
          "Titre": "Stay away from Hello Mobile Network, worst experience ever and horrible service",
          "Contenu": "One of the horrible service I ever received from Hello mobile, very very poor horrible network, call drops multiple times, call won’t connects that easily. I will not recommend this network to my worst enemy also."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T15:58:47.000Z",
          "Titre": "zero network service available in 3…",
          "Contenu": "zero network service available in 3 mile radius of my house.  I live in downtown coral springs,fl. First month . Cant use the phone. I am moving to another company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hellos Akdik",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T17:06:53.000Z",
          "Titre": "Already told the rep but from…",
          "Contenu": "Already told the rep but from experience I KNOW as a company you only care about your ratings not what works for customers but what works for the company dressed in a fake what works for the customer packaging theme. All corporations suck and I mean that in the very literal sense they suck their customers dry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T00:21:56.000Z",
          "Titre": "Very pathetic customer service",
          "Contenu": "Very pathetic customer service. I have an issue where data is not working on my phone and every time I contact the customer care, they force me to go through the troubleshooting steps before transferring to the tech support. The troubleshooting steps are repeated every time - they are check sim number, check device compatibility, ask if phone has liquid damage, network reset, software update, manual puc configuration, device hard reset. After this they transfer the call to tech support who will raise a ticket and then ask us to wait for 48 hrs. Even after a week there is no response. Then when we contact customer care, they force us through the same checks again to transfer to tech support who will ask us to  power off and power on.  Then they’ll ask us to dial a number to check if it’s successful, then to access fast. com to check if internet is accessible. It was not. Then network settings are updated. this is repeated over and over again like a broken record. No option to request for escalation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T11:33:26.000Z",
          "Titre": "I have been a Hello Mobile customer for…",
          "Contenu": "I have been a Hello Mobile customer for quite a few years. Service has been good but the customer service is horrible. I recently brought two more phones to my plan and ever since that time the service has gotten worse for all 4 phones. Data is extremely slow and doesn’t work sometimes. Texts not going through. Trying to work with customer service has been a nightmare. They have a script they have to go through with each phone though the issue is affecting all 4 phones. I plan to try one more time to get the issue fixed and then I’ll be going to Mint Mobile."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T00:18:26.000Z",
          "Titre": "You stole $44.95 from my church",
          "Contenu": "You stole $44.95 from my church. We were trying to get a phone line set up for a homeless family. They sent the money to my PayPal account, and 1st when I place the order it said my address was already associated with an account.  WRONG!!! I order a phone for my sister back in February and the address it was sent to should be the one for that phone (which is probably why she could never get it activated) and then when that was sorted out, I place the order, y'all took the money, I received no receipt to send over to sign Church, for the purchase the phone, and when I contacted your online agent they said their is not record of the purchase. But the money has come out. Y'all are thieves. You stole from a church. I really think God has a special place for people who do stuff like this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T23:36:21.000Z",
          "Titre": "Zero coverage in my house and work",
          "Contenu": "I have zero coverage in my house and work. I cannot use my phone at all. The SIM card got delivered late, the 09/09 after almost a week of purchasing. I couldn't activate the SIM card because I have no coverage at all. I was twice chatting with a representative they walk me through the exact same steps both times. It took an hour! And nothing is fixed.Also, the billing cycle started before I even had the SIM card. On the website appears that way and they say it's not. There is a lack of honesty in coverage and billing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JAMES PRICE",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T21:23:41.000Z",
          "Titre": "HIT OR MISS",
          "Contenu": "Service is always hit or miss even in the city , and text messages are always a day or two or even sometime 3 days late . Sometiimes I go days without being able to make a call .  So not happy , with as many cell towers in the country service should be alot better but its not ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T05:16:37.000Z",
          "Titre": "Poor delivery service",
          "Contenu": "I called to follow up on my new sim delivery 7 days after I ordered them only to be told that me order was in the queue.  In other words it wasn't even being delivered yet and with no delivery date in sight."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vip",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T03:01:43.000Z",
          "Titre": "Very bad customer care",
          "Contenu": "Very bad customer care . They dont know what they are doing . I got disconnected from service and no action were taken. Now i dont have the sim active and im forced to take service from another provider."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill J. Lucas",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T02:25:35.000Z",
          "Titre": "Customer Service has absolutely no idea…",
          "Contenu": "Customer Service has absolutely no idea what they are doing. Out of the country and has no ability to fix anything. They claimed they would open a ticket and the issue would be fixed. Absolutely NOTHING was done"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T00:41:16.000Z",
          "Titre": "There is literally no customer service…",
          "Contenu": "There is literally no customer service to speak of. There are times when the service works and others (many) where it does not. And this is in an urban location with plenty of reception."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T02:23:40.000Z",
          "Titre": "very slow shipping service",
          "Contenu": "i changed plans to hello and shut my previous plan thinking that my hello sim would arrive withen a day or two. it's been a week already and it still hasn't been shipped."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Irina",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T02:25:36.000Z",
          "Titre": "I am not happy with the service because I was wrongly charged and the rep said they can't give me my money back.…",
          "Contenu": "I am not happy with the service because i was charged by deception from a closed account more than once and I was told my money can't be returned to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Schwakhofer",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T04:06:02.000Z",
          "Titre": "2nd line not able to receive voice mail messages",
          "Contenu": "The problem that I had is still there, so it has not been resolved.  My added line to my account(wife's phone) is not able to receive voice mail messages. The prompt says it is not available and it has to be a problem from Hellomobile.com's answering service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "disappointed",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T15:05:53.000Z",
          "Titre": "in and out internet. not worth it",
          "Contenu": "in and out internet. don't have it when you need it. couldn't get one card to work. taxes and fees are included in the quoted prices. didn't give the full name for a phone i purchased so it was hard to get accessories ahead of time. The hot pepper Serano phone is worthless. They make it really hard to send the phones back or I would have kept trying. Customer service is REALLY BAD, not helpful you have to ask the same question more than 4 times to even get them to answer. you can't ask a few things at a time. lots more of disappointing things and experiences."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Denise Saraceno",
          "Nb_Reviews": 3,
          "Date": "2023-09-15T06:30:45.000Z",
          "Titre": "payment and website issues",
          "Contenu": "You tell me payment went through then I get an email saying it didn't and a refund is on the way. You won't let me delete a card that is no longer good and I don't see how to make a new one the card to use from now on. At least you didn't just turn my phone off without warning as you did in the past."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jane Roosa",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T00:53:18.000Z",
          "Titre": "Your chat agent didn't \"listen\" to any…",
          "Contenu": "Your chat agent didn't \"listen\" to any of what I said my issue was. It was condescending to assume that I hadn't followed the steps to place my order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SS",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T12:13:12.000Z",
          "Titre": "Had a phone working fine for years",
          "Contenu": "Had a phone working fine for years. Don't know what went wrong. It stopped being able to call out and was not being recognized by the service. Could get calls and messages but data and incoming calls would no longer work. MANY hours on with techs to tell me my phone was \"waiting for an update.\" Phone was too old for updates. Never got the phone working with Hello again and moved it to Mint."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T17:32:43.000Z",
          "Titre": "Ludicrous refund policy",
          "Contenu": "Your policy to not allow refunds for overpaying, even for lines that no longer exist, is just absurd. Like, complain to BBB level absurd."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T23:21:44.000Z",
          "Titre": "Network/Internet poor",
          "Contenu": "The network is very poor! Internet doesn’t work everywhere, and very slow connection. Also, the customer service is poor, should improve the customer care services. Representatives don’t have sufficient knowledge, they should improve their communication skills as well as knowledge!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T20:35:17.000Z",
          "Titre": "You false advertised delivery of my…",
          "Contenu": "You false advertised delivery of my device.  Also your already counting service period against my plan and I don't even have the device. Worst phone company I've ever dealt with. Over a week since ordered and you still haven't even shipped device."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristen Bello",
          "Nb_Reviews": 3,
          "Date": "2023-10-02T00:38:16.000Z",
          "Titre": "My credit card which is usable(no…",
          "Contenu": "My credit card which is usable(no problems) was not accepted. A message on the site told me that the info was wrong. I checked it and couldn't find anything wrong. Neither chat nor a direct call got me anything but a waste of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T20:49:53.000Z",
          "Titre": "Started this process on Wednesday finished on Friday",
          "Contenu": "Started this process on Wednesday, Could not get to the process order button to work.  unchecked the use bill as shipping and it started to work.  bye the time i figured that out I had removed the phone that I wanted to have with the new service and could not add it back.  why cant one get a service and a new phone at the same time.  The flow of the sight lets you think that it can happen.  then a warning should come up on activating the account that you should have a phone and the sim card in your hands at the same time.  Lets hope that the service works as expected.  It was just the process to get this far.  The wait and try again later, use a different browser.. use a diffrent device, clear the cookies.  if the cookies are causing such a difficult time for the customers why even use them things."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T17:56:10.000Z",
          "Titre": "Yes I was told before I purchased 2 SIM…",
          "Contenu": "Yes I was told before I purchased 2 SIM cards and service that they pulled on every tower and worked excellent in my area. But they don’t so now I want to return them and go somewhere else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T09:26:07.000Z",
          "Titre": "Their online self service is terrible",
          "Contenu": "Their online self service is terrible. If you turn off auto-pay, you cannot turn it back on. Additionally you cannot modify or delete existing credit card payment methods."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Anu Agrawal",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T08:47:05.000Z",
          "Titre": "I asked to remove one line ( out of…",
          "Contenu": "I asked to remove one line ( out of total 2 lines)  from my account but it has still not been removed. The number has been ported out already. I called and emailed but I am still getting charged for 2 line with no number associated with it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T04:44:49.000Z",
          "Titre": "This company needs to act PROPERLY",
          "Contenu": "There are two issues with this company.  1) This company makes changing the card I use for autopay very difficult.  I tried to change it last month, and it did not change, then THEY get upset with ME for not paying, even though they flat out refuse to allow me to change the card I use.  Also, 2) when they send out EAS alerts, they alert me in the form of a loud siren that is causing me to panic.  I have told this company multiple times to stop the siren, but they totally ignore me and act indignant.  This has nothing to do with my phone, as other cell providers previously on the phone I am using did not use a panicky siren.  They need to stop.  These people need to learn how to act."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T09:16:51.000Z",
          "Titre": "Don’t slow down someone’s data speed 2…",
          "Contenu": "Don’t slow down someone’s data speed 2 weeks before their bill is due, and if someone pays their bill ahead of time restart the data speed. Lost 2 weeks of work do to not being able to get on line."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dion",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T05:03:12.000Z",
          "Titre": "The problem was not solved",
          "Contenu": "The problem was not solved. I still don't have data working on my phone or my wife's phone. The plan now is to move off of hello mobile ASAP due to lack of a solution.Get this, the solution given was for me to wait till the beginning of the month because the towers do maintenance at the end of the month and once the start of the month comes then everything will start working. Not sure this is a viable solution since I have to wait 3 days(WITHOUT A WORKING PHONE!!!) to see if this works. I wasted about 2.5 hours on the phone with support and still don't have a working solution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T04:13:09.000Z",
          "Titre": "They overcharged and billed for for a line that was ported…",
          "Contenu": "They kept billing for a 2nd line that moved to a different provider. I’m pretty sure this against FTC rules to bill for a line that doesn’t exist. no other prepaid company does this sleezy stuff."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T17:54:24.000Z",
          "Titre": "Their unlimited plan is limited",
          "Contenu": "Their unlimited plan is limited. If you reach a certain amount of data, they will cut off your data service eventhough you are on unlimited plan."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T08:11:41.000Z",
          "Titre": "It’s working fine only with us call",
          "Contenu": "It’s working fine only with us call , out of country calls are not connecting or if connect’s, while in call it says please dial a valid number and call gets disconnected"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Schneider",
          "Nb_Reviews": 3,
          "Date": "2023-10-28T17:48:45.000Z",
          "Titre": "Absolutely awful customer service",
          "Contenu": "Absolutely awful customer service. I was given canned answers that did nothing to help with my problem. I installed the new sim card and went out to run some errands. I get no service at home, so I wanted to test the service where it would be available. I had full bars in town, and was able to use the data and text, no problems.I then tried to make a call. The call immediately dropped and the bars showed empty. Within a minute, the bars were back to full. I tried again, with the same result.I tried both the chat, and calling customer service. The chat person insisted that the problem was I had not \"turned on wifi calling\" in order to make calls *while at home where I have no service.* which is not at all what I wanted. She did not seem to comprehend my repeated explanations that the phone was dropping calls in areas with FULL BARS OF SERVICE.The telephone representative wasn't much better. I had to give him an address in town. Where I have service. To get him to check coverage- which he confirmed what I had already explained that I had FULL SERVICE in that area. He then proceeded to take my IMEI number... and tell me that the phone \"isn't compatible\" with the network. Even though the checker on the website says the phone is fine, and I was able to partially access the service- data and text, with the phone. It is only calls that were dropping.I'm canceling this and will absolutely not be recommending Hello Mobile to anyone. I have used several pay-as-you-go services in the past and have never dealt with this level of incompetence."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "haji",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T01:06:12.000Z",
          "Titre": "this company is the worst ever i seen…",
          "Contenu": "this company is the worst ever i seen my live the internet suck the cal quality suck and customer service is bad they can’t help you and they still saying do you need help"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sanjuanita Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T04:54:55.000Z",
          "Titre": "Wait too long for my order and don’t…",
          "Contenu": "Wait too long for my order and don’t trust you by tracking  the order came after 3 days and have to buy to other company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mohammed Hatouane",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T18:55:03.000Z",
          "Titre": "It been 3 month the internet is not…",
          "Contenu": "It been 3 month the internet is not working how it use to be I’m not sure when they say unlimited what that means"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T13:18:58.000Z",
          "Titre": "I told not to charge me for five line…",
          "Contenu": "I told not to charge me for five line because last month we canceled one but no one took care of my email and you still charged me for five lines."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "V. Tilley",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T03:26:32.000Z",
          "Titre": "Customer Support not trained",
          "Contenu": "No one seems to know why I cannot set up voicemail. They put me on hold, only to come back and say they have escalated. It never goes anywhere and I still don’t have voicemail"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T22:38:37.000Z",
          "Titre": "the cell service is really bad I'm only…",
          "Contenu": "the cell service is really bad I'm only still with your company because its cheap but I'm sure still looking  even if i have to pay more"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T12:51:51.000Z",
          "Titre": "I cannot do auto pay with my credit…",
          "Contenu": "I cannot do auto pay with my credit card. I called customer service for many times. I have been asked to mail Money order every time. Also, my phones are 5G and still I cannot get 5G network in my area. I am at big city and get good 5G signals."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T00:23:33.000Z",
          "Titre": "All time caller id is not working",
          "Contenu": "All time caller id is not working. Everyone got call as a restricted number rather than actual mobile number."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T21:46:15.000Z",
          "Titre": "Constant issues with app not letting me…",
          "Contenu": "Constant issues with app not letting me login in. Sending like 2p sim cards cuz of it. Its just ridiculous at this point"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joel knopfler",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T16:08:44.000Z",
          "Titre": "I really have trouble with the service I'm not sure if the service is the issue or my phone is not a good condition",
          "Contenu": "My service is really bad most of the time I have to make airplane mode on and off almost every text is not being sent I'm not sure if the service of the problem or my phone is a problem"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T22:53:01.000Z",
          "Titre": "In 5g world net speed is still like…",
          "Contenu": "In 5g world net speed is still like 2g.. Also netwrk quality is too bad. You wont hear other person properly and clear but yeh price is good enough"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T03:41:15.000Z",
          "Titre": "There is no data connection/ no…",
          "Contenu": "There is no data connection/ no internet at all. I am planning to change from hello mobile plan to another one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victoria",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T19:07:09.000Z",
          "Titre": "SCAMMERS",
          "Contenu": "Please DO NOT use Hello Mobile!! I’ve paid $159.99 for a phone and plan and received nothing but 2 SIM cards. I haven’t received my phone. I called and was told it was damaged during shipping. They haven’t shipped a replacement. I was told I will get a refund when they receive the package back. It was NEVER delivered to ME! I would like to have my money or the phone!!! I don’t have either!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AJ",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T01:46:52.000Z",
          "Titre": "Very poor customer service",
          "Contenu": "Very poor customer service. Not at all knowledgeable. They don’t care about customers. Horrible"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "steven a",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T16:31:41.000Z",
          "Titre": "wrong information",
          "Contenu": "I checked with Hello to see if my phone was compatible was told yes. I ordered the sim and recieved it in a few days when installed my phone showed me my new number. When I tried to activate  the phone showed no sim"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T21:58:24.000Z",
          "Titre": "Most of the time",
          "Contenu": "Most of the time, the signal is weak, and sometimes I lose it completely, so that it is unable to send WhatsApp messages."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MikNich",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T04:03:09.000Z",
          "Titre": "The Internet is very bad",
          "Contenu": "The Internet is very bad, it doesn’t work anywhere at all! There is no Internet!!! Never connect to this network!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aleemoddin",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T13:34:49.000Z",
          "Titre": "Wrong information",
          "Contenu": "Wrong information, all they want is to sell Sim cards.I dont have an option to give negative stars so gave 1."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T06:59:10.000Z",
          "Titre": "When I call the customer service I…",
          "Contenu": "When I call the customer service I wanted some information for port my no she talked around 30 minutes she did not support me and buymistake she activated my hello simcard card which I don't wanted now so they are untrained just wasting time never ever buy this simcard again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T02:40:53.000Z",
          "Titre": "Problem with data",
          "Contenu": "After 4 years continue using this plan i am getting slow data now going to change asap"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T14:52:36.000Z",
          "Titre": "I'm disappointed with the service…",
          "Contenu": "I'm disappointed with the service because you sold my phone # and I get 20 or more spam phone calls a day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ozkan Balaban",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T01:13:33.000Z",
          "Titre": "customer service sucks",
          "Contenu": "I lost my sim card.  Even though they verified me on the phone they did not change my address. they did not give me my pin code verbally so I could port out.  Even though they did not send my replacement sim card they charge my account for monthly service. How was I supposed to use it without sim card"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T04:04:30.000Z",
          "Titre": "I am so worried that my SIM Card/Phone…",
          "Contenu": "I am so worried that my SIM Card/Phone has not yet started even after a week. I am worried when I may get a new phone line!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T01:08:16.000Z",
          "Titre": "Cannot change account holder name",
          "Contenu": "Account holder name got changed to the person whose credit card was used as payment!! There was no way to change account holder name even though the account was never started in credit card payers name."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robbie",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T18:08:09.000Z",
          "Titre": "I placed an order for my service and 5…",
          "Contenu": "I placed an order for my service and 5 days later my sim has not shipped, so I called customer service.The agent I spoke with told me it's because my payment had not gone through even though I got a confirmation on the website that I had been charged, and my credit card also showed I had been charged.After putting me on hold, he came back and said that I had indeed paid, and it had been charged, but I have still not gotten any word on when, or if my sim will be shipped.If they have this much trouble just sending a sim, and customer service is confused, I'm not sure I want to use \"Hello\" for service even if I ever get the sim card."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "wouldn’t you like to know",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T17:13:00.000Z",
          "Titre": "Awful service w/awful website services",
          "Contenu": "I don’t understand why you guys are sending me another SIM card I don’t need one but your website wouldn’t allow me to remove it from bill or my monthly payment.. I get the worst service I’ve ever had from any phone company from your guys phone company.. everything is slower than slow I’m gonna try one more month with you guys and if the service is still really bad or awful I’ll go back to my old cell phone company because your guy’s service beyond sucks.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Raju",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T22:35:31.000Z",
          "Titre": "Network is poor in Birmingham",
          "Contenu": "I found the poor network around Birmingham. It doesnot support well in many places.It should improve a lot to do like At N T"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T15:15:13.000Z",
          "Titre": "Internet improve",
          "Contenu": "Guys I'm sorry but when it comes to the internet it sucks 😔 the magic of having a network that provides you with connection is feel that no matter where you go, you can trust that websites going to load, and your social media feed too. But I can't remember one single time this happened. Slow and frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T14:31:17.000Z",
          "Titre": "cheap price, cheap sevice",
          "Contenu": "It's really cheap service, so it's very hard to get their sim card, it's always on the road."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "R L",
          "Nb_Reviews": 2,
          "Date": "2023-10-15T22:27:18.000Z",
          "Titre": "I received the sim very quickly but my…",
          "Contenu": "I received the sim very quickly but my data is so slow.  I tested on two iPhone and Android device and still the download and upload speed is sooo slow.  I will not recommend the service to anyone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Brown",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T17:17:32.000Z",
          "Titre": "Place order button not working.",
          "Contenu": "I couldn't get the \"place order\" button to work. I called support and \"chat\" as well. All I got was try another phone or try another card. All boxes were filled appropriately but that pay button would not activate. I tried 4 different days and many different attempts each day. Also an odd box wanted \"unit\" type and suggestions were up, down, front ,back, box etc. For my home I chose other.  I don't know many people living in a box."
        },
        {
          "Note": 2,
          "Lieu": "TR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T20:44:42.000Z",
          "Titre": "The service is very very poor at times…",
          "Contenu": "The service is very very poor at times couldn't make any phone calls nor receive any calls. Constantly breaking out or dropping calls. Internet is horrible as well. Customer service is another story need live person and better service definitely."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "customer coco",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T10:39:55.000Z",
          "Titre": "Proceed with caution",
          "Contenu": "I think the idea of hello mobile which is why I hit the bullet and made the purchase, but they emailed me immediately after I did where they still had not yet had a chance to trial the product, let alone then having notifying me of shipment… So read the other reviews with caution. That’s all!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T04:50:50.000Z",
          "Titre": "To get more notifications  about paying the bill it's my 3rd time changing new number BC  that was sending me a  one time notification",
          "Contenu": "I like being a hello mobill member but they need to send more notifications  to reminde to pay the bill"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "E.S.",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T05:03:49.000Z",
          "Titre": "I don't understand the plans",
          "Contenu": "I don't understand the plans. The plan is unlimited everything but there is really a limited on data. I don't know why companies say one thing but do something totally different."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shashidhar Bodla",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T04:53:59.000Z",
          "Titre": "Worst Customer centricity",
          "Contenu": "Hi, My experience was worst. I felt why did I transfer to Hello mobile from existing vendor.After I transfered my number to Hello mobil, my number stopped working and customer service agent is not abe to solve and not ready to involve the technical team.Everytime same steps repeating with no result. it is rigid"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RFID",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T18:41:51.000Z",
          "Titre": "The phone has a setting for wifi…",
          "Contenu": "The phone has a setting for wifi calling, but customer service states that wifi calling is not included. With wifi calling, txt/sms is received when on Airplane Mode and wifi connected, but with Hello that doesn't function. Voicemail doesn't connect by pressing 1 or *86"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lynn Customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T19:15:31.000Z",
          "Titre": "Quick and easy to complete the purchase…",
          "Contenu": "Quick and easy to complete the purchase process.  The only glitch was Hello Mobile's inability to arrange autopay on my credit card. It just wouldn't accept my preferred card but instantly accepted another.Getting the service activated has been an ongoing issue. After my number was ported the phone wouldn't connect and it's been nearly 2 weeks while I wait for Hello Mobile to fix a \"network problem\". All the while I have been without service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa L.",
          "Nb_Reviews": 3,
          "Date": "2023-09-22T16:35:44.000Z",
          "Titre": "They don't have 5G so don't buy a 5G…",
          "Contenu": "They don't have 5G so don't buy a 5G phone because it's useless. They have data constraints so use WIFI as much as possible. Try not to need assistance or troubleshooting cause good luck! Basic service for a basic price. Good for grandma."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles Costa",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T00:18:14.000Z",
          "Titre": "I was thrilled with it until I realized…",
          "Contenu": "I was thrilled with it until I realized the battery on the phone only lasts a couple of hours. This is a problem, it's for my dad and he is disabled. He is not able to connect it to the charger alone and he hardly uses the phone, the battery should last days"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "larry, tahoe realty.co    1 800 824-6373",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T08:08:53.000Z",
          "Titre": "Difficulties signing up.",
          "Contenu": "Difficulties signing up.Charged for unnecessary sims (3) & line use that was never activated (2).Please review notes & advise.Larry 530 3141097 thank you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T02:48:18.000Z",
          "Titre": "“Unlimited” data at your own risk.",
          "Contenu": "Hello Mobile claims it offers unlimited data, and yes I’m aware that most “unlimited” data plans cover up to about 20-30gigs used before it throttles down speeds.A few months ago, I used about 5 gigs, and my data was completely turned off for the remainder of the month.  For 4 more months after that, my data was down throttled after about 5 gigs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T21:35:17.000Z",
          "Titre": "Not happy at all",
          "Contenu": "Not happy at all.  Lost both my phone numbers when I didn't update the expiration date on credit card.  It was the supposed last day but nope.... Turned them off no warning.  Tried to reinstate the numbers but wouldn't allow that.  Had to buy a new sim.  Really I'm not thinking I will stay with you guys long.  Shopping for another company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T15:39:20.000Z",
          "Titre": "Needs to check up the apn for Android…",
          "Contenu": "Needs to check up the apn for Android phone I got late text message and email and I already done everything on my phone to make work right but still doing the same change to brand new android phone still doing same fix that apn system losing my patience with this crap."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nahian",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T16:27:52.000Z",
          "Titre": "Internet Issues",
          "Contenu": "I have a 4GB line, however after using about 2.5 GB my internet slows down significantly and I can barely use my remaining data. In addition, in some places I get 5G signal but still my internet takes too much time to load."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T05:54:12.000Z",
          "Titre": "Inadequate service.",
          "Contenu": "Every phone on the account is constantly getting the message \"Carrier has disabled voice calls\". I pay for unlimited on every line, this is unacceptable, I'm tempted to move our phones to Mint mobile."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T04:32:44.000Z",
          "Titre": "Very poor network connection indoors or…",
          "Contenu": "Very poor network connection indoors or outdoor also. Connectivity is main concern. If this is improved it will be better experience.”"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T22:44:18.000Z",
          "Titre": "My SIM card came cancelled",
          "Contenu": "My SIM card came in and when I called to help get it activated they said it had been canceled. Now I’m waiting for another one"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelley Smart",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T11:34:42.000Z",
          "Titre": "Stand behind your promises please‼️",
          "Contenu": "I am extremely disappointed in Hello Mobile. I took my time researching Cell Phone Companies for the best deal in what you got for your money and I choose Hello Mobile. I started new service with Hello Mobile on July 1st. You advertised By one month get one month free. That is the reason I changed over to Hello Mobile. Then I received a message saying my account was going to be charged $40. I then called and talked to a rep and then a Supervisor , she assured me my account would not be charged anything.Due to your special. Well come to find out my account had already been charged $40 on August 3rd. The supervisor literally lied to me. All I want from Hello Mobile is to stand behind your promises. And give me a credit for my 1 month free. Thank you, Kelley Snart"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adnan",
          "Nb_Reviews": 4,
          "Date": "2023-08-26T16:11:22.000Z",
          "Titre": "Not an accurate system when you check a…",
          "Contenu": "Not an accurate system when you check a device comparability shows you good working and after you purchase then finding out it dose not work with this service it’s frustrating and too many call drops about the data better not to talk about. I’m using this company only to keep my number while I’m traveling for lower price"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank Griffin",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T20:27:46.000Z",
          "Titre": "My only issue is with the connectivity…",
          "Contenu": "My only issue is with the connectivity service. I can wait forever or it times out when I try to go to a website. There is not a strong enough signal yet the bars on my phone are saying four or five bars for signal and I can't get anywhere. Very frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Skyler",
          "Nb_Reviews": 3,
          "Date": "2023-09-20T04:03:10.000Z",
          "Titre": "I've been with Hello Mobile since March 20th 2021",
          "Contenu": "I've been with Hello Mobile since March 20th 2021, and the only customer reward I've received from them is a free second month of data, which I received after first joining the mobile service. It's now September 19th 2023. So this happened 2 years ago. I have not seen a customer reward since. I really wish Hello Mobile would reward their loyal customers more, with maybe another free month of data or maybe a gift card as a thank you. I also wish that their network speed would improve. My speed really began slowing down back in November of 2022 and I was nowhere near my data limit. Now, whenever I browse using my mobile plan, it sometimes takes a decade for webpages to load or to play a YouTube video. I found out that US Mobile offers a free $25 prepaid card to their first time customers that they can use toward their monthly bill. So that means this company gives money to customers who might not even stay with them or become a loyal customer. I can't even get a reward like that from Hello Mobile and I am a loyal customer who pays every month. I wish Hello Mobile would do even better than US Mobile and offer their loyal paying customers a $25 or maybe even a $50 Visa gift card. That would be nice and it would help a loyal customer spread the word and recommend Hello Mobile. It's a bit confusing how first time customers using another mobile service gets treated better than a loyal customer who uses Hello Mobile."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Yash",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T17:14:50.000Z",
          "Titre": "Mobile data is very slow after 1st 2…",
          "Contenu": "Mobile data is very slow after 1st 2 weeks of payment . We have 2 lines and both experience same issue with mobile dataWe have reached out to customer care multiple times and It is very frustrating to be part of this at this moment"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pravin",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T03:47:38.000Z",
          "Titre": "Poor Network Quality",
          "Contenu": "Hello Mobile network falls off frequently and is not reliable when we travel. .planning to switch to a better network soon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T18:13:19.000Z",
          "Titre": "Network coverage is not good"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T02:18:37.000Z",
          "Titre": "The data speed is a main issue",
          "Contenu": "The data speed is a main issue. I have family plan unlimited data. And I called many times about this issue And Tec support keeps saying. Data speed is not guaranteed...."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BigAbba",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T21:46:25.000Z",
          "Titre": "Often no dial tone...",
          "Contenu": "In various places in my town, Lakewood NJ (08701) I often cannot even get a dial tone, and so then I cannot make any calls."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mr. P",
          "Nb_Reviews": 3,
          "Date": "2023-09-15T20:18:31.000Z",
          "Titre": "Probably the most affordable cell…",
          "Contenu": "Probably the most affordable cell service around. $5 per month for unlimited call/text with 500MB data is hard to beat. I haven't had any issues with call/txt reception. The 2nd month is also free which is a nice little bonus. They also didn't outright cancel my service when my credit card info changed but I forgot to update the payment info on their site. However they didn't notify me either about the payment issue. I had to contact them.Unfortunately that's where all the pros end. Everything else is pretty subpar. Their website is very basic and some things have issues; I changed my password and it took like 15 min. for the changes to go through. I could still login with my old password for that period which could be a potential security issue.Customer service is unsurprisingly lacking and their reps noticeably stick to a script. Their mobile app had a dangerous security issue a couple years ago allowing anyone who had your phone number to access your personal info, account no., history of calls/text, without any password. Even after being notified it took them months to act on this. They didn't even fix the issue they simply disabled the app. Extremely negligent and irresponsible. I'm not sure if they re-released the app but I wouldn't take the chance of using it.Wifi calling does not work on Hello Mobile. This was confirmed by their customer service. Although one person I talked to said it did work for them on their iphone so Idk. I use a moto phone.Data usage is hard capped I believe.If all you need is dirt cheap calling and txt messaging  then you might consider this. If you want more features (like wifi calling and probably a lot of others) and value good customer service this is absolutely not it. The negligence with their mobile app and site's functionality is also troubling and tells me they don't place high priority on security.  I'm giving this service 2.5 stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T02:43:06.000Z",
          "Titre": "Coverage is not that good",
          "Contenu": "Coverage is not that good. Spotty signals."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T05:02:34.000Z",
          "Titre": "Too long to dispatch and deliver the…",
          "Contenu": "Too long to dispatch and deliver the sim .. also the marketing was for $5 per month but while buying it shows only $10 option"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Olena Khyzhniak",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T22:06:57.000Z",
          "Titre": "Quality equals price",
          "Contenu": "1. mobile internet is very bad. 2. a huge amount of spam, and calls from the robot are marked with a flag, which means they were checked by the operator, so  Hello mobile sells their phone numbers to spammers. I'm giving two stars only because of low price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T15:52:52.000Z",
          "Titre": "SO YES",
          "Contenu": "SO YES, THE PRICE IS OKAY....BUT YOU NEED TO KNOW WHAT YOU PAY FOR. INTERNET IS, AT BEST, 2ND GENERATION IT FEELS LIKE. SO UNLESS YOU CAN USE A GOOD WIFI AT ALL TIMES, YOU WILL STRUGGLE..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T21:51:33.000Z",
          "Titre": "Long delay to receive text…",
          "Contenu": "Long delay to receive text (verification code from bank).  Weak signal around my home."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T22:11:10.000Z",
          "Titre": "Unlimited",
          "Contenu": "Unlimited is not unlimited at all. It is a cheap marketing scam intended to bring more customers. Pathetic move."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T22:12:14.000Z",
          "Titre": "My mobile data hasn't worked properly…",
          "Contenu": "My mobile data hasn't worked properly in months if I'm not on wifi it is horrible I have called multiple times nothing has been done to fix the issue  or anything else for my troubles for not having my mobile data working properly"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "سامي",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T21:03:49.000Z",
          "Titre": "Internet service been trouble lately…",
          "Contenu": "Internet service been trouble lately very weak hope to see it improved soon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T16:22:38.000Z",
          "Titre": "Clarity oh hearing the person I am…",
          "Contenu": "Clarity oh hearing the person I am speaking to is very poor.I get cut off in mid conversation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CMH",
          "Nb_Reviews": 2,
          "Date": "2023-08-24T12:34:03.000Z",
          "Titre": "You never get a second chance to make a first impression. You failed.",
          "Contenu": "The sign up/sign in/create account was so horrible. I felt like I was going in circles on your website.i was sent something about free service for life, s government plan. Now I see that’s not the case. I’m getting the very basic plan & it’s still $10 & no unlimited data. I don’t know why I’m surprised. I’m disappointed, really. This carrier move is not what I expected, by far. Wow! False advertising? Just a way to reel in customers? Shopping for a phone shouldn’t be that difficult. You should have two separate links for Apple & Android. I don’t wanna look at phones I don’t want. I’ve never owned an Android & never will.I have Stage IV breast cancer & I may be a little grumpy, but there are sooo many Androids & OLD iPhones. I’m not wasting anymore time than is absolutely necessary.  Think of your customers. Their time is valuable, too. It’s like going to look at Mustangs & the salesman keeps showing Corvettes. What’s the point? Not looking for Corvettes. You got him there & you’re ready to try the upsell. Click bait? I should have known it was too good to be true. I’d like someone to call & explain this to me. Thanks CMH 404-993-9634after 12:00 Noon EST"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T05:38:52.000Z",
          "Titre": "My network is not 5 G"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T01:46:01.000Z",
          "Titre": "Unclear information given",
          "Contenu": "Neither the website nor the agent made it clear that these plans do not come with a phone. Those need to be purchased separately."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alton Chan",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T09:18:08.000Z",
          "Titre": "No 5G",
          "Contenu": "I got a new iPhone 13 Pro Max during Thanksgiving 2021 and was looking forward to the 5G connectivity. Today is Feb 3, 2022, the connectivity is still 4G/LTE. Called numerous times to Customer Service, they always have something to blame or tell me to wait a little bit longer for the 5G Service coming to my area. I live in the Dallas, Texas area for crying out loud!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2022-09-28T18:22:43.000Z",
          "Titre": "OK til it wasnt",
          "Contenu": "As a mom on a budget I loved Hello Mobile’s multi-line price. $55 for 3 “unlimited” lines is pretty darn good. What wasn’t good was the spotty coverage and the slow speed, but I went along with it until my phone just stopped working one day. Turns out that, without my permission, they just ported out my number?! And when I say the customer service was useless that’s an understatement no help at all so I said goodbye. And to top it off, weeks later I got an email saying my old number had been ported back to Hello-are you kidding me?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "shayan maroufi",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T07:58:18.000Z",
          "Titre": "I give it 2 stars",
          "Contenu": "I give it 2 stars. One extra star because they had one of the cheapest deals. But overall it sucked. My mom had been using hello mobile for almost 2 years and finally, she switched to another carrier. During these 2 years, she faced 3 issues. The first 2 times, all of a sudden her simcard stopped working but they sent her a new simcard. The last time that she decided to go with another carrier was because as much as she tried her payment didn’t go through! They couldn’t help us. Especially nowadays when you have a busy life you must have a working phone otherwise you may lose many important phone calls."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "The Monk",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T22:24:12.000Z",
          "Titre": "Pathetic customer care service.",
          "Contenu": "Sent email, messenger, insta message but no response. Called waiting 34min and eventually got disconnected. It's been 48 hrs. There is no way to reach their customer care. If their CEO family members got made to wait like this and no reply like this for services then that idi**t d**k CEO will learn the lesson. I hope his family gets blocked with all the services they use so they can learn the lesson."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "EVA PARRISH",
          "Nb_Reviews": 6,
          "Date": "2023-09-08T18:07:22.000Z",
          "Titre": "CHAT n Cstomer service just a waste of time",
          "Contenu": "Service is very poor and CHAT customer service is just a waste of time NO help what's so ever!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Petr",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T20:06:50.000Z",
          "Titre": "I can't change anything on my account",
          "Contenu": "I can't change anything on my account, including a new credit card.  you have slow data.  I am looking for a new company.  Thank you."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T18:50:28.000Z",
          "Titre": "You do not care about my business",
          "Contenu": "You do not care about my business.  You were willing to let me leave your company because you which goes out whenever it feels like it and then I be stuck trying to find my way home.  This sucks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nick M.",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T12:20:59.000Z",
          "Titre": "I signed up for Hello Mobiles…",
          "Contenu": "I signed up for Hello Mobiles introductory $5/mo plan about 3 months ago.  I received the sim card and activation was pretty straightforward.Unfortunately this is nowhere near the case when attempting to either upgrade my current plan, or get another line of service.  Their system will not let you.  I had spent no less than 5 or 6 total hours of my time with their support, and they are unable to solve the problem.Their website keeps telling me my address in invalid despite having used the same address for over the past 10 years.  This was also the same address my credit cards are billed to, and it's the SAME address where Hello Mobile mailed my first sim card, ironically.This company cannot seem to solve this problem and it's impossible to change my existing plan, order a new one, or do anything related to an order.  I've never had these problems with any other wireless or phone provider. Ever."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hayden",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T09:31:47.000Z",
          "Titre": "Internet or lack there of",
          "Contenu": "i pay for unlimited but i can’t even use search engines 15 days into my subscription because y’all slow stuff down it’s really annoying having to connect to local businesses internet to get my job done"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T02:57:21.000Z",
          "Titre": "I barely get any signal",
          "Contenu": "I barely get any signal around Hesperus Co. Where I will be staying for a while.  Also Wifi calling only works maybe 10% of the time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T16:10:16.000Z",
          "Titre": "Poor internet",
          "Contenu": "It was not made evident that internet service would be so slow and sparse."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T15:30:56.000Z",
          "Titre": "Internet is súper slow",
          "Contenu": "Internet is súper slow. The obly good Thing is that works with other phone brands that are not iphone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Konigsbac",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T23:54:00.000Z",
          "Titre": "Wi-Fi calling was enabled for a minute…",
          "Contenu": "Wi-Fi calling was enabled for a minute and then it did not work. I have not been able to use Wi-Fi calling for the last two months."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T05:47:30.000Z",
          "Titre": "Even I have 4gb data",
          "Contenu": "Even I have 4gb data, I’m only able to use 25 percantage of it. Will soon switch to other network."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T15:47:29.000Z",
          "Titre": "International plans",
          "Contenu": "It would be helpful if you had an international plan"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T18:26:07.000Z",
          "Titre": "I can not make call from inside of my…",
          "Contenu": "I can not make call from inside of my house nor receive calls. Can you fix the problem?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Octaviano",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T23:54:48.000Z",
          "Titre": "I got the unlimited account but the…",
          "Contenu": "I got the unlimited account but the internet is horrible super slow"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T18:57:40.000Z",
          "Titre": "Internet signal is weak most of the…",
          "Contenu": "Internet signal is weak most of the time when travel outside"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer Nezar Alazzawi",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T16:27:22.000Z",
          "Titre": "My line data is very bad and in the is…",
          "Contenu": "My line data is very bad and in the is unlimited but it's limited..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T00:36:22.000Z",
          "Titre": "Service drops everywhere",
          "Contenu": "Service drops everywhere, speeds are slower"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T21:20:29.000Z",
          "Titre": "The network coverage is too poor in my…",
          "Contenu": "The network coverage is too poor in my area in Syracuse City."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maciej",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T20:38:17.000Z",
          "Titre": "Not able to change my address..",
          "Contenu": "Not able to change my address... poor internet connection"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T18:05:16.000Z",
          "Titre": "My phone never has data",
          "Contenu": "My phone never has data. My phone has to be attached to WiFi so if I go somewhere then I can’t use my data. I have to find a place with free WiFi to use my phone. And it’s just not my phone. It’s every phone on this line."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T18:18:15.000Z",
          "Titre": "Lots of unnecessary call",
          "Contenu": "Lots of unnecessary call. Signal very low."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lucy",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T01:57:34.000Z",
          "Titre": "It drops calls/ and internet slow why",
          "Contenu": "Why is my internet slow and drops calls. So times can't get my calls."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T03:24:54.000Z",
          "Titre": "My SIM card was not processed as…",
          "Contenu": "My SIM card was not processed as promised. I checked again and was told a new SIM card has been processed now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T20:35:59.000Z",
          "Titre": "Reception is not good in my zipcode…",
          "Contenu": "Reception is not good in my zipcode 20619"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T13:48:52.000Z",
          "Titre": "Bad coverage",
          "Contenu": "Bad coverage Massages works only with wi-fi"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fred Visser",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T15:30:22.000Z",
          "Titre": "I can't get even 4G where live now",
          "Contenu": "I can't get even 4G where live now! To make a phone I have to leave my house. I have to a mile from my house to make a phone call!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Prasad Vasam",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T22:06:30.000Z",
          "Titre": "The representative is not understanding…",
          "Contenu": "The representative is not understanding my requirement and said he would, but not done what I had requested."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T07:47:33.000Z",
          "Titre": "long wait times on phone",
          "Contenu": "long wait times on phone heavy accented representatives"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Max",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T03:53:40.000Z",
          "Titre": "No esim available",
          "Contenu": "No esim available. Newer phones using esim only features."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T05:26:08.000Z",
          "Titre": "Bad service",
          "Contenu": "Bad service, very slow internet, predatory practice when it comes to adding credits for international calls."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T13:58:52.000Z",
          "Titre": "not stable no  customer service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Venky",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T00:00:45.000Z",
          "Titre": "Data speeds are very slow",
          "Contenu": "Not enough coverage. Data speeds are very very slow."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelly Jo Engquist",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T18:17:40.000Z",
          "Titre": "1 out of 3 sim cards took over a week…",
          "Contenu": "1 out of 3 sim cards took over a week to recieve."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T17:48:52.000Z",
          "Titre": "It said, unlimit data, but actually, that was not, according from your staffs, only 7.0 gb data in high speed. After using over 7.0 data speed, I am not able the internet, because of low speed data",
          "Contenu": "The unlimited data plan that is not true"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T15:20:26.000Z",
          "Titre": "signal strength is spotty and slow",
          "Contenu": "signal strength is spotty and slow, not what they claim"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vitaly",
          "Nb_Reviews": 2,
          "Date": "2023-08-26T02:26:30.000Z",
          "Titre": "Quality of service are very low."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Yevgeny",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T19:05:52.000Z",
          "Titre": "Very slow internet !!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T20:49:08.000Z",
          "Titre": "Improve quality of service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff wilson",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T23:44:26.000Z",
          "Titre": "The only thing is the data speed is…",
          "Contenu": "The only thing is the data speed is very slow."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T05:13:57.000Z",
          "Titre": "Internet speed is very poor",
          "Contenu": "Internet speed is very poor. Speed very slow"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie Sandoval",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T15:59:26.000Z",
          "Titre": "No signal in many areas",
          "Contenu": "No signal in many areas. The call dropped ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gigi Lee",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T16:30:54.000Z",
          "Titre": "Internet is not truly unlimited"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T00:50:31.000Z",
          "Titre": "Didn't work on phone 📱",
          "Contenu": "Didn't work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T14:38:03.000Z",
          "Titre": "Data does not work",
          "Contenu": "Data does not work. No esim"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T02:45:58.000Z",
          "Titre": "The service sucks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T19:54:53.000Z",
          "Titre": "Data is so slow",
          "Contenu": "Data is so slow. Phone and text work well."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T15:04:42.000Z",
          "Titre": "Poor response from customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ruben Rebollar",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T03:49:55.000Z",
          "Titre": "The data is bad and having trouble"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David P",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T19:02:21.000Z",
          "Titre": "Bad coverage"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T06:11:18.000Z",
          "Titre": "Won't let me change my address"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jaszmine Santiago-Hall",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:17:48.000Z",
          "Titre": "T-Mobile vs. Verizon towers + price",
          "Contenu": "Unfortunately the company uses T-Mobile towers and the service is great as it could be but if they was to use Verizon towers their services would be fantastic. I will say this that I use about 20 gigs of data andy connection with the company is still going strong. The price is great & reasonable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pinoko Yeoh",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T01:33:11.000Z",
          "Titre": "Could not disable voice mail",
          "Contenu": "Even it's a very smooth process port my number to Hello Mobile. I was surprised to find out Voice Mail function was enabled this morning.  Tried all suggestions/ methods and spoke to 3 Hello Mobile reps, I was told it's a phone hardware issue while T-Mobile confirms it's a network issue.While I was with Net10 using the same phone, I could easily turn off voice mail options.  It has been a hell with Hello Mobile."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carmen Steele",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:54:49.000Z",
          "Titre": "Calls mostly go to voicemail",
          "Contenu": "Calls mostly go to voicemail. I always find myself returning calls or missing important calls."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Burgess",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T15:25:29.000Z",
          "Titre": "The price is great compared to Verizon",
          "Contenu": "The price is great compared to Verizon. But, compared to Verizon, the places I need it to work, not so great."
        },
        {
          "Note": 3,
          "Lieu": "EC",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T02:53:37.000Z",
          "Titre": "The website had problems with multiple key aspects",
          "Contenu": "The website had problems with the shipping address for the SIM card. After selecting another address I was able to proceed in placing my order. Shortly thereafter I received an e-mail saying they had problems with my credit card. Not off to a great start."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan Scalf",
          "Nb_Reviews": 3,
          "Date": "2023-09-09T18:39:58.000Z",
          "Titre": "Changing cell providers",
          "Contenu": "My son got married and wanted to move his phone number to the provider his wife uses because she had better service.   We went through the steps and could never get his number ported to the new provider.    This is very poor customer service and makes me wonder if we need to move the remaining lines.   We started with 4 lines and are now down to 2 lines due to poor service and no help except through the darn chat bots which is poor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debra Clark",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T16:21:06.000Z",
          "Titre": "Switched from Cricket after many very…",
          "Contenu": "Switched from Cricket after many very satisfied Years of Service..  Simply to try to Cut back during these Difficult Financial Years ! Have now been with Hello Mobile for 3-4 months...Lots of Bumps to be Resolved by Hello Mobile Yet. I Certainly hope it Continues though because I want to Like Hello Mobile for their reasonable Cost and Eventually reliable Service??!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randi Johnson",
          "Nb_Reviews": 6,
          "Date": "2023-10-24T17:54:09.000Z",
          "Titre": "Everything slow",
          "Contenu": "I put the order in last Thursday but got a confirmation the following Tuesday, even though when I chatted on Monday it was in the system.  The chat was of no help since she couldn't give me a clue when the simm card would be shipped.  Still waiting for it to get shipped after 5 days. Good thing this is only a backup phone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "A Satisfied Customer",
          "Nb_Reviews": 3,
          "Date": "2023-09-16T20:30:45.000Z",
          "Titre": "Give Value but with Limitations.",
          "Contenu": "500 MB of data and unlimited calls and text for $5 is a good deal.  Despite what the coverage map shows, there are areas of no coverage within a mile of my home.  And there is limited coverage in my own house.  I had a flat tire in February and needed to contact AAA.  There was no coverage where my car was parked and I had to walk in the cold to find minimal coverage.  Hello Mobile is OK as a 2nd phone; but my Spectrum coverage is much better and that's my primary phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T00:42:27.000Z",
          "Titre": "I had trouble setting up the sim card",
          "Contenu": "I had trouble setting up the sim card, the instructions were pretty easy to follow, I punched in all information from the pamphlet into the phone, I had trouble with service, I played around sending text messages to my boyfriend's phone, I had to speak with customer service... after some trial and error and testings they said my phone was not compatible with their service. I said that's not true, I punched in the IMEI number before purchasing a sim card and it said the phone was compatible. Meanwhile, the text messages are coming thru whole I'm talking to customer service. My area has terrible reception no matter what service provider. But customer service keeps telling me to replace the phone. Otherwise, their plans are priced perfectly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:38:43.000Z",
          "Titre": "All is fine except internet speed",
          "Contenu": "The only problem is the internet speed. It is unstable. Sometime it drops for the weeks until the new period starts. And the worst in these cases are helpless customer support. They try to restore and reset the connection that takes huge amount of time, but there is nothing wrong with the connection - the only reason for slow internet speed is artificial lowering of speed from your side. But for some reason no one can tell what amout of GB is maximum for the unlimited plan before the speed will be lowered. That's my biggest concern. And this problem appears a number of times a year. There was no any problem on July and August, but for the half of May and June the speed was lowered to 0.01 mbps."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T08:42:29.000Z",
          "Titre": "Wasted setup time because a duplicated SIM order",
          "Contenu": "I received the SIM card just a few days after placing the order, which was really nice. However, when I inserted it into my new phone, it didn't work. I called the support team and reviewed all the standard procedures to escalate the issue to the next tier. Eventually, I was connected to a second-tier support agent who seemed to be more knowledgeable than the first one. After reviewing the issue, he explained that the SIM was invalid due to a duplicate order. Apparently, they had sent a second SIM after the first one had already shipped, and the new number was assigned to the second SIM, making the first one invalid. It took me about two hours to figure all of this out, and I really wish I had known to ignore the first SIM from the start. In the end, the second SIM worked just fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Natalie Miiller Rogiers",
          "Nb_Reviews": 3,
          "Date": "2023-10-06T04:09:43.000Z",
          "Titre": "It would be nice to get a deal on a new…",
          "Contenu": "It would be nice to get a deal on a new phone for being a customer for over 3 yrs now. I'm having to use my tablet as my phone becuz I can't afford a phone that's unlocked that I can afford at the moment. Love the unlimited $25 plan and had it the whole I've had your service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T07:37:46.000Z",
          "Titre": "A few months back",
          "Contenu": "A few months back, at the end of the month my data would slow down so much I couldn't even text or use the dam phone, really made me mad, like you were holding me hostage. When you say unlimited data mean unlimited data, then you will get more stars!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Skyler",
          "Nb_Reviews": 3,
          "Date": "2023-08-11T14:25:52.000Z",
          "Titre": "The service is decent",
          "Contenu": "The service is decent. I just wish that the service wouldn't slow down my speed when I get close to 2GB out of my 4GB data plan. Webpages won't even load up. I also wish that Hello Mobile would offer some rewards to their loyal customers, like me. I've been a customer with Hello Mobile since March 19th, 2021. Maybe Hello Mobile can give their long time customers some incentives or free unlimited data for one month for being a valued customer. Something along those lines. Maybe even a gift card for being a good paying customer. I think that would help loyal customers spread the word so that Hello Mobile can attract new customers, because they'll want to join in on those customer rewards."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Miss",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T21:59:12.000Z",
          "Titre": "It works, but read on...",
          "Contenu": "3.5 stars. Fast SIM delivery, but a chat in early September revealed that new account setup could only be done from a lap- or desktop. It was maddening (!!) to get no error online that said so and then to only learn the deal --after-- wasting a bunch of time and stress trying to order via mobile and tablet--which was all I had at the time! It took the dogged persistence (spread across 2+ weeks) of personal attempts, a 40-minute support call and 2 chat sessions to activate my Hello Mobile account on an Alcatel Axel 5004R + number both unlocked from AT&T. Signal strength inside my WDC home is weakish. At times calls take 5-10s to connect. Or, they fail, get dropped, and I have to retry 3-5X. What happens when I travel is yet to be seen... **H-O-W-E-V-E-R**, I do not regret the choice. The techs who dealt with me did their best and were cool. For the savings and seems-OK-enough reliability, my high-ish tolerance can take it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T23:29:27.000Z",
          "Titre": "The signup process was pretty simple…",
          "Contenu": "The signup process was pretty simple but I was not able to copy paste my password into the password field. I use a password manager and I don't want to type my randomly generated 64 character password."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T05:44:49.000Z",
          "Titre": "Service and reception are good",
          "Contenu": "Service and reception are good. But unlimited plan data is not unlimited, have a cap on it. Be careful not to used up your data, you will be sorry if you do. The speed will be ridiculous slow, as slow can not even use your gps, if you lucky enough you still can send a text and don’t even think of browse on the internet. I do understand the cap, but I expect they allow you to use the gps at least."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T01:15:55.000Z",
          "Titre": "Hello mobile don’t give guest break",
          "Contenu": "Hello mobile don’t give guest break, when you travel to overseas for a month or two, you still need pay your bills, they can’t hold your numbers, this need improve."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Candace",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T01:13:44.000Z",
          "Titre": "Mobile data experience is poor",
          "Contenu": "My service has had some recent issues. My calls and texts have awesome reliability however, recently my mobile data connection has been terrible. I can hardly browse when I'm not on Wi-Fi. Fortunately my map still works but if I need information on the go, the mobile data is suddenly unreliable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Celio Palacio",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T04:06:29.000Z",
          "Titre": "Some times I cannot respond a phone…",
          "Contenu": "Some times I cannot respond a phone call. The incredible amount of commercial on the screen are difficult to remove. When I get trough, the call is gone.Thinking about switching companies soon if this does not change."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T17:15:43.000Z",
          "Titre": "Service is sub par but the price is great!",
          "Contenu": "My hotspot used to work and now it does not fir some reason. I have the same plan that I used to have. The coverage is less par than other carriers and my data can get very slow and my wife loses hers sometimes even though we have unlimited data. The only reason I stay with hello is because the price is very good and I like to bring over my own phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T12:03:28.000Z",
          "Titre": "Billing address and shipping address…",
          "Contenu": "Billing address and shipping address needs to the same which is not convenient in my situation and I’m sure there’s other people that would agree with me. Also there is no option for eSIM. I wan to use my iPhone 14 but it does not have a physical SIM so I have to use an older phone that has a slot for physical SIM."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Perry Petermaxx",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T06:36:21.000Z",
          "Titre": "glitchy and unpredictably irregular…",
          "Contenu": "glitchy and unpredictably irregular servicecheap is great, but wouldn't mind paying more for something less sketchynow that Verizon has \"visible\", I'm afraid \"HELLO Mobile\" is going to lose customers"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T19:11:40.000Z",
          "Titre": "Recycled Numbers causing large spam call and message volume",
          "Contenu": "Due to recycled numbers, getting a lot of spam calls. Otherwise, it's alright so far. Really affordable for sure."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tica",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T12:39:41.000Z",
          "Titre": "Wifi use only",
          "Contenu": "I’ve had the service 2 months now. The service works great on wifi but without wifi I can barely ever get good enough service to use my gps or social media. If I start my gps on wifi it’s good to get me where I need to go but if I’m already out and about it takes forever or just never loads the map/directions l. Same with searching or social media. There are a few places I’ve noticed that I’ve had all my bars/5g but very few. But I’ve searched everywhere and this is the cheapest service you can get."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "walldodger",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T16:10:16.000Z",
          "Titre": "works great... except in my home",
          "Contenu": "love the price, even had two lines.....BUT could never connect when  I am inside my home, walk outside , no problem, still o cheap, hate to give it up, plus have had that number for over 12 yrs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "partschurn",
          "Nb_Reviews": 4,
          "Date": "2023-09-01T02:10:10.000Z",
          "Titre": "Why one per address?",
          "Contenu": "In general, Hello is good.  What is bad is that only I can get service.  Seems to be limited to one account per mailing address.  Makes no sense to me.  I always worry about a business whose operation makes no sense."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T16:34:22.000Z",
          "Titre": "The ordering process has become difficult",
          "Contenu": "The ordering process has become difficult. No confirmation was received. I had to get someone on chat to get it resolved. They asked for the IMEI even though I had to order a phone I had not purchased then."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sekar",
          "Nb_Reviews": 3,
          "Date": "2023-08-24T16:47:57.000Z",
          "Titre": "Customer Support needs to be improved",
          "Contenu": "Customer Support needs to be improved, still, we need to get a direct customer support number. I have purchased the unlimited data plan, really I did not get unlimited data, Certainly, it does not work, even we can even send messages or work with Whatsapp."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tino",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T05:39:03.000Z",
          "Titre": "Great for Calls and texts, very slow internet",
          "Contenu": "Service with Hello mobile suddenly became a lot slower over the past few months. I worked with the tech department on it and the speed seems significantly sluggish."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PG",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T18:32:22.000Z",
          "Titre": "Great rates, but no option for extra data after 5GB",
          "Contenu": "Great rates and quick support when we need it. I had 2 lines with \"Hello\" (myself and my wife). However, due to my job, I use a little more data than my wife (between 6-8GB). As soon as I reached 5GB, \"Hello\" slowed down my data to the point that nothing was loading. I'm willing to pay extra if I have the option to purchase additional data or a more advanced plan with up to 10GB."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim Smith",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T01:51:07.000Z",
          "Titre": "stuff needs to change",
          "Contenu": "i don't like that you have to make it like you are making a new order just to pay a monthly phone bill, also the fact that you cannot have multi line plans"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T01:20:26.000Z",
          "Titre": "The service & Internet is bad for the…",
          "Contenu": "The service & Internet is bad for the last 2 weeks until we pay the bill again..We are getting ready to leave soon if something is not done. It is suppose to be unlimited it seems its not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T08:23:36.000Z",
          "Titre": "Don't like data speed limit!",
          "Contenu": "Love the price.  The quality of communication is satisfactory, the coverage is not good everywhere.  But most of all I don't like limiting the speed of the Internet without any reason.  Immediately after refill account, the speed is still normal, and then it gets smaller and smaller, until it is very low, less than a megabit, although unlimited Internet is declared without discussions of restrictions after using certain traffic."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T02:28:31.000Z",
          "Titre": "For any questions you ask for too many…",
          "Contenu": "For any questions you ask for too many information to identify your guest.Sometimes the system is such slowly, data not working."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ayanso fufa",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T15:47:51.000Z",
          "Titre": "The Price Hello mobile is great and…",
          "Contenu": "The Price Hello mobile is great and affordable. But the network gone suddenly. One day I was using my phone GPS to drive 2 hrs away from my home. The network stops and couldn't use my phone GPS. Luckily my car has got GPS and I went back home. YouTube stop working after 5GB, while the deal is unlimited. These problems should fixed. However, thank you for your service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T19:28:33.000Z",
          "Titre": "No network",
          "Contenu": "When we outside we don’t get mobile signal also no network to access internet. Not as fast as other networks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jean D Rugamba",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T18:47:50.000Z",
          "Titre": "Very affordable service",
          "Contenu": "Greatly affordable service, but sometimes I can’t use internet even though I have data and calls sometimes are not good.I also think you should update your app! It looks like it was made ages ago and has been abandoned"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T20:39:35.000Z",
          "Titre": "Coverage map is incorrect",
          "Contenu": "The service works good, where it works.  The coverage map is extremely off, does not work in a majority of the areas I'm at. The coverage map shows that it is available."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bharath",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T21:45:01.000Z",
          "Titre": "Internet speed slows down",
          "Contenu": "Internet speed slows down and does not work properly at the end of the month or once we cross 4 GB for unlimited plans"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T14:19:28.000Z",
          "Titre": "The amount of data is now capped at 5…",
          "Contenu": "The amount of data is now capped at 5 GB. After 2-3 weeks each month, our phones basically have no internet. I tried to call and message Hello Mobile about this and I get no answer or response."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T16:08:36.000Z",
          "Titre": "Service is very spotty",
          "Contenu": "Service is very spotty . Most of the time I have to reset network settings , to get my phone to work even when it says full bars and LTE . Price is alright . Think mint mobile is cheaper , just don’t know how good there service is . Always takes days to weeks to get a reply from customer service. Had service for years and just surrendered to the fact my phone only works a quarter of the time ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T12:57:46.000Z",
          "Titre": "I had been having troubles wen people…",
          "Contenu": "I had been having troubles wen people called me. The call goes to the voice mail. Even whe the phone shows full service.Calls over wifi is not supported.The internet speed varies between billing cycles. I keep in the company becouse is cheap."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Damien Hartley",
          "Nb_Reviews": 6,
          "Date": "2021-12-28T07:24:31.000Z",
          "Titre": "Work",
          "Contenu": "It's not perfect and there are definitely issues like a 15gig limit on the unlimited plan which is not clearly disclosed. The redeeming factor is thst the cheapest plan is only $5 so it's work it just to have an extra telephone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T13:38:22.000Z",
          "Titre": "everything is great except the…",
          "Contenu": "everything is great except the internet. Internet is very weak and runs out quickly. although it is written that it is unlimited, but in reality it is not so."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T13:22:26.000Z",
          "Titre": "Data goes slow",
          "Contenu": "I pay for unlimited data plan, but around on the day of 20th of the month, the data goes very slow, most of the time i cannot use the internet... Very upset about this"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T17:58:12.000Z",
          "Titre": "Good thing is i can call overseas but I…",
          "Contenu": "Good thing is i can call overseas but I cannot use my phone in canada&mexico and the reception is really bad in many areas and ive signed up for the unlimited plan but after certain limit it goes to really slow that i can even do simple email"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T15:23:46.000Z",
          "Titre": "At the beginning",
          "Contenu": "At the beginning, the connection is good, but after 1.5 months, it seems like the reception some times good some times bad."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T20:21:30.000Z",
          "Titre": "Not getting good service in my area I…",
          "Contenu": "Not getting good service in my area I have to go outside to a certain area just to make a call"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T00:53:20.000Z",
          "Titre": "I like the price of the service but I…",
          "Contenu": "I like the price of the service but I feel like the data rates get bogged down and my  phone is slower than ever. Also, even when it says I have 5G and full bars I can barely get any service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer Tony",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T10:57:08.000Z",
          "Titre": "Data gets very slow",
          "Contenu": "Unlimited isn't unlimited buffer a lot if I can't work it out might have to change to a better alternative"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lauren alleman",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T03:07:35.000Z",
          "Titre": "I think you guys are very reliable",
          "Contenu": "I think you guys are very reliable. I always had good connection. Your customer service agents are very helpful and friendly. I like that as well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T20:10:18.000Z",
          "Titre": "Cell phone reception is poor",
          "Contenu": "Cell phone reception is poor, and many building facades have no reception or are weak."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Santucci",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T15:37:50.000Z",
          "Titre": "Good but not perfect.",
          "Contenu": "Great price. Easy to use/setup. Can't always make or receive calls in locations that I'm expecting to be able to and should have service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T16:39:12.000Z",
          "Titre": "Your call center is the problem",
          "Contenu": "Your call center is the problem. Some of the call center staff have very difficult accents. This make it a problem when trying to get asnswers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T22:56:03.000Z",
          "Titre": "mixed opinions but it is too early to tell",
          "Contenu": "Getting set up on the hello mobile site was super easy. I ended up getting a new number even though I have had the same number for close to 20 years give or take but I am no longer in the state that my old number was from. I have had my hello mobile phone for less than a week and here is my honest opinion:The phone: Beings I broke my old phone ( samsung galaxy a51) I needed something fast and cheap. I ended up getting the Hot Pepper serrano3 phone and honestly I 1000% HATE the phone but it was what I could afford just to get me by until I can afford a better phone. The phone itself is very touchy and unresponsive a lot of the time especially if I am trying to look at my bank accounts, bus app, or uber. I have had to take the battery out multiple times a day and restart the phone. Just today (November 21,2023) It rebooted itself while I was trying to get my crew app that I use for work going after I was sent the link Sunday night ( it literally took that long for me to get the text message for the link). I don't know if it is the service OR the phone. IF you need a starter phone that is for the very basic needs of making calls and taking calls its okay at best but wouldn't advise getting this phone if you like to play games on your phone and for social media purposes. I hope to get a new phone soon because I am about to toss this phone out a ten story building window. Maybe with time it will cooperate but in the mean time the Hot Pepper Serrano 3 is not a phone I would get ever again.The service:I made a phone call earlier and while I was on a call somehow my phone dialed the number again which was weird again it may be the phone itself. I will say the sim card worked right away after inserting it into the phone but I wasn't quite impressed with the quality of the sim card ( cheap flimsy plastic) when the sim card from my old phone was metal ( guess I just got to get used to that) The data seems to be fine for the most part however I am in situations where I use wifi most of the time. To start i got the 15 dollar plan which for the time being is enough until I renew the service in which I may go with a different plan for the simple fact that I do use the transit app for my area to catch the bus and I need something with a lot of data for that reason or reasons if I am out of a wifi accessible area. The call that I did make however was rather clear. The other issue I seem to have is not receiving text messages right away. For verification codes it comes in okayish but again the text my manager sent to my phone with a link to my crew app took about a day and a half. Again I don't know if it is the phone or the service. I know it has only been a handful of days so only time will tell if things will improve or not but I am hopeful it will because I like the concept of Hello Mobile and if the service works better than this super. I am also considering that the phone is a 4glte phone and not 5g so that may have something to do with it so maybe with a better phone the service will improve. I am not going to discredit them just yet especially since the plans are really affordable. My boyfriend's daughter just ordered a sim card for a bring your own phone plan through Hello Mobile. When she gets it we will see if she has better service or if the issues are still the same. I know my review isn't exactly fair since I am a new customer BUT I will give a new review once I have had the service a little longer. I will say that having the second month free is really cool and your account is very easy to navigate through. If you do end up getting a phone through Hello Mobile I will say go through all the apps and get rid of what you know you won't use. I had to with the Serrano 3 because it has very limited space. that is the other reason I want to get a better phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T00:09:38.000Z",
          "Titre": "We never get proper network…",
          "Contenu": "We never get proper network outside.Also data plan doesn't work when outside"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bekki.",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T17:52:24.000Z",
          "Titre": "At least once a month I loose…",
          "Contenu": "At least once a month I loose phone/text service.  It will last anywhere from 8 hours to 3-4 days.  This also means that GPS quits.  Very inconvenient.  The most recent was last Sunday, 9-17-23."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T06:32:35.000Z",
          "Titre": "My line was deactivated after sending…",
          "Contenu": "My line was deactivated after sending me only one email notification and am unable to port my old line to my new line."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dale",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T19:55:45.000Z",
          "Titre": "No customer service",
          "Contenu": "Phone works great. If you need to make a change, like to drop one line out of many you can't. Chat doesn't work, Customer service phone doesn't work. Email not answered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T13:39:00.000Z",
          "Titre": "I got $25 unlimited but it's a scam! There is limit after 2 g of use",
          "Contenu": "I decided to check them out because of unlimited for $25 . They never could give me exactly numbers when will it slow down as some reps say 15 g and some say after excessive use of data.. I decided to see what is real story behind the $25 unlimited.  The porting my # to them was pretty simple but still when calling 611 said my service past due but my service paid off for 2 months.  I started testing Speed with my s21Ultra I got up to 100 mbps. But it was only until I reached 2g of use of data and then it dropped to 5-7 mbps speed.. I even called them but they use support team who does same network reset but nothing happened until I reached 5g of data used.. then the speed dropped to 1mbps. And I assume it will drop even more soon ... I guess their $25 plan is just not really unlimited 4 or 5 g plan as they put limit pretty quick on it. The support service is horrible as you can't hear them as they talk out of bathroom or in airport... I hope it will help you to decide"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T18:37:50.000Z",
          "Titre": "I reactivated my account and had to get…",
          "Contenu": "I reactivated my account and had to get a new phone number with the same account number, does not make since"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T05:10:38.000Z",
          "Titre": "Honestly I'm being generous kind giving you…",
          "Contenu": "Honestly I'm being kind giving you three because I have yet to hear from anybody else they said they're going to get back to you within one business day but it's been 2 weeks and three or four emails at least with no response so as far as the service or the actual plan I have no idea cuz I haven't got it yet"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Deep",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T19:19:15.000Z",
          "Titre": "Unlimited data but data is not working",
          "Contenu": "Unlimited data but data is not working. If works very slowly. Please don’t cheat to customers. Thanks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tuan Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T02:00:05.000Z",
          "Titre": "The data bigger is will be okay for me.",
          "Contenu": "The data bigger is okay. I can transfer to another supplier when I need more data."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yousef",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T12:54:17.000Z",
          "Titre": "Hello, Mobile locked hotspot.  I can't use it on my laptop! Why??? Already I used it for years. It is possible for me to switch to another career.",
          "Contenu": "Hello, Mobile locked hotspot.  I can't use it on my laptop!Why???Already I used it for years.It is possible for me to switch to another career."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "proloy",
          "Nb_Reviews": 5,
          "Date": "2021-12-11T03:49:25.000Z",
          "Titre": "economical service with T-Mobile line and 5g capabilities",
          "Contenu": "good price, international calls don't connect all the time but domestic calls are on TMobile tower. 5g capabilities are a plus. But again it's TMobile. So in sub urbs and rural area it don't work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Innocent Polimice",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T11:41:06.000Z",
          "Titre": "I'm  still getting very slow internet…",
          "Contenu": "I'm  still getting very slow internet if the internet is  slow the service is bad"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Taz",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T18:06:07.000Z",
          "Titre": "Coverage is not that great",
          "Contenu": "Coverage is not that great. plus LTE connections throttle also"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T15:56:28.000Z",
          "Titre": "Good prices on plans",
          "Contenu": "Good prices on plans, need to add Hot spot and Tethering with data service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rumon P.",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T03:12:24.000Z",
          "Titre": "Unable to retrieve my account and…",
          "Contenu": "Unable to retrieve my account and telephone number  That I had it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T22:27:17.000Z",
          "Titre": "I like that I have good service at…",
          "Contenu": "I like that I have good service at home. I would like better service on my travels, I would love to have service every where 🙂"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ben W.",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T03:41:58.000Z",
          "Titre": "Fair",
          "Contenu": "It's cheap but Aldso unreliable. I got what I paid for so a fair deal in my opinion."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jesus",
          "Nb_Reviews": 5,
          "Date": "2023-10-19T00:07:50.000Z",
          "Titre": "my original phone number 915-274-6772…",
          "Contenu": "my original phone number 915-274-6772 was canceled due to nonpayment I was in the hospital getting knee surgery done and wasn't able to use my phone or have emails due to medication I was taking for pain, after I came out of the hospital phone number was canceled so I try to make a payment was told I had to make a new application and was told I would get my original phone number reactivated with new sim card. well received your simm card with a totally different phone number called 3 times to reativae my old number 915-274-6772 and was told my account was under review why do you know I just want to my old number reativated okay is it that hard to do?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Juan",
          "Nb_Reviews": 3,
          "Date": "2023-09-21T04:12:07.000Z",
          "Titre": "The address where I live does not have…",
          "Contenu": "The address where I live does not have good signal. Otherwise all good!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T03:24:05.000Z",
          "Titre": "I like about calling",
          "Contenu": "I like about calling, texting,and Data service, however customer service needs to improve on the billing and payments process,credit card and PayPal payment, I have to enter my credit card number more than once, payment doesn't work,it was inconvenient for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T01:07:58.000Z",
          "Titre": "Spotty coverage."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anibal",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T23:57:15.000Z",
          "Titre": "I rate 3 star because you internet…",
          "Contenu": "I rate 3 star because you internet service is bad"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T13:41:19.000Z",
          "Titre": "I'm still trying to get my phone number…",
          "Contenu": "I'm still trying to get my phone number transferred."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kent",
          "Nb_Reviews": 4,
          "Date": "2023-10-08T17:12:22.000Z",
          "Titre": "The service was off and on for the…",
          "Contenu": "The service was off and on for the first while that we used it. It is now getting better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roberto",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T16:57:38.000Z",
          "Titre": "Don't forget the satisfaction of customers with the macro of your services",
          "Contenu": "The charging system to my card is punctual and without delays, but the customer service and the internet service is very depressing..!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tammy Ortman",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T20:29:50.000Z",
          "Titre": "It ran out of wifi 😐 I just don't know…",
          "Contenu": "It ran out of wifi 😐 I just don't know if I like that.but otherwise I guess it's ok"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T03:16:13.000Z",
          "Titre": "sometimes it is going to massage and…",
          "Contenu": "sometimes it is going to massage and can not connected"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim Griffin",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T22:02:21.000Z",
          "Titre": "Did the company go out of business",
          "Contenu": "I was with hello mobile 3 years in July while on vacation my phone was shut off I was on automatic pay and plenty of credit to debit they didn't debit in May for what ever reason borrowed a phone called them several times but it constantly disconnected got home went with metro pcs and shut down the credit card they had on filr"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T16:16:03.000Z",
          "Titre": "Service is not adequate in zipcode…",
          "Contenu": "Service is not adequate in zipcode 18424 in Pennsylvania"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tina Farrington",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T15:41:57.000Z",
          "Titre": "I’m Still Waiting On Hello Mobile 5G…",
          "Contenu": "I’m Still Waiting On Hello Mobile 5G When Will Customer Experience The Upgrade?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Heather Griff",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:57:49.000Z",
          "Titre": "Good prices"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T19:40:50.000Z",
          "Titre": "I like the service but some of the…",
          "Contenu": "I like the service but some of the places there is no network at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tyson Fernald",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T17:18:44.000Z",
          "Titre": "Sometimes the service cuts out",
          "Contenu": "Sometimes the service cuts out even when it says I have full bars"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T19:04:51.000Z",
          "Titre": "To fart hard once a day",
          "Contenu": "I don't  like there is no telegraphing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David march",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T00:38:04.000Z",
          "Titre": "Nice when it works",
          "Contenu": "Liked the prices. And website.  But many times it has no reception. In new york."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NKB",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T15:39:52.000Z",
          "Titre": "network",
          "Contenu": "improve the network signal. in the main city's.but worth for money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T12:43:00.000Z",
          "Titre": "Internet dam low after 3rd week of…",
          "Contenu": "Internet dam low after 3rd week of every month"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T00:17:31.000Z",
          "Titre": "Lost most calling",
          "Contenu": "Since March, I've lost most calling service to my phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T22:42:01.000Z",
          "Titre": "Calls are not connecting properly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T18:58:11.000Z",
          "Titre": "Your Ethernet service is very bad"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ebadul",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T01:09:21.000Z",
          "Titre": "Network problem is the major concern…",
          "Contenu": "Network problem is the major concern and sometimes internal connection is very slow"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T20:26:15.000Z",
          "Titre": "The unlimited data plan for 25/ month…",
          "Contenu": "The unlimited data plan for 25/ month is a joke"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lawrence",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T01:20:06.000Z",
          "Titre": "I have issues forwarding things"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ulises T",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:43:28.000Z",
          "Titre": "Very a affordable service company you…",
          "Contenu": "Very a affordable service company you got free calls México but you don't get free text to Mexico$20 unlimited I got two lines"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amaka Ijeh",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:33:00.000Z",
          "Titre": "It is the only network I have had that…",
          "Contenu": "It is the only network I have had that gives me uninterrupted data for a long time for an affordable price. Coverage is also consistent everywhere."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T17:41:36.000Z",
          "Titre": "Good pricing on three lines bundled",
          "Contenu": "Good pricing on three lines bundled. Have been a customer for years now. The price is the total price with no added taxes or fees. Support is reasonable as long as you to go through their tiered process usually using chat. Phone support is a bit more difficult to obtain but can be done during regular business hours for those willing to wait. Overall a good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Chavarria",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T18:23:17.000Z",
          "Titre": "Save your Money",
          "Contenu": "Hello mobile saved me hundreds of dollars. It’s low cost for the exactly same service that I was paying close to two hundred a month for. The line quality and coverage are fantastic. The one downside, customer service needs some attention. Twice I’ve emails them a question about my service. Both times my questions went unanswered. Overall they are a good company, with a great product, at a great price. I’d recommend them to anyone that wants to save money on their mobile devices"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jack Burns",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T14:36:52.000Z",
          "Titre": "I've had a backup (aka burner phone)…",
          "Contenu": "I've had a backup (aka burner phone) with Hello Mobile for several months now at $5/mo. The Android phone that I purchased thru them was $20. Everything has been smooth since getting past the initial setup which was a little vague b/c I had to request a SIM card separately to activate my phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana Suarez",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T22:44:04.000Z",
          "Titre": "Price is great for one or family plan…",
          "Contenu": "Price is great for one or family plan please add hotspot free and better 4g service in Orlando Fl  5g is great service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "zoidberg knows a clown",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:11:00.000Z",
          "Titre": "Cheap and calls don't drop",
          "Contenu": "Cheap and calls don't drop. Texts always send great. The Internet connection usually has problems now. It didn't at first but now its incredibly slow but it's still okay. Worth the price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RICHARD RAMOS",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T05:29:08.000Z",
          "Titre": "Decent service at a great price",
          "Contenu": "Decent service. Great deal for 3 lines. Definitely not bad at all. Depends on your area, ymmv"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Skyler",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T08:06:30.000Z",
          "Titre": "Pretty Reliable Service",
          "Contenu": "So far the service is pretty reliable and the plans are affordable. The data speed has improved over time. When I first joined, the speed wasn't as fast as it is now. Very reliable network."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T07:57:26.000Z",
          "Titre": "The initial setup was simple",
          "Contenu": "The initial setup was simple. I chose Hello Mobile for my second phone line, the service is pretty good and suitable for my needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jin Jin",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:39:18.000Z",
          "Titre": "This is probably the cheapest…",
          "Contenu": "This is probably the cheapest all-in-one package you can find. This is the best option if you don't use a lot of network data."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gerald T. Blomeyer",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T14:32:07.000Z",
          "Titre": "This has worked better than it did when…",
          "Contenu": "This has worked better than it did when I first went with Hello Mobile. I don't have the problems that I had in the start. No reason not to use Hello Mobile."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marwan Karaki",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:09:13.000Z",
          "Titre": "Working fine for our Au Pair",
          "Contenu": "Working fine for our Au Pair. Does what is expected"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abhinav Ancha",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:22:17.000Z",
          "Titre": "Everything goes great but sometimes the…",
          "Contenu": "Everything goes great but sometimes the service is a bit low."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T15:29:35.000Z",
          "Titre": "Overall a great cell service",
          "Contenu": "Overall a great cell service. The service could be a bit stronger because it sometimes gets spotty. But it's usually just fine. You can't beat the value for the price!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Alemany",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:25:27.000Z",
          "Titre": "Good service little blotches here and…",
          "Contenu": "Good service little blotches here and there but over all very satisfied"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T23:00:19.000Z",
          "Titre": "Used online chat to resolve a problem…",
          "Contenu": "Used online chat to resolve a problem and it worked well"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kent",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T00:41:14.000Z",
          "Titre": "Service is just what we need for a…",
          "Contenu": "Service is just what we need for a seldom used cellphone. Works well for us."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hamza AFTIS",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T13:26:50.000Z",
          "Titre": "This is my 4th year with Hello Mobile",
          "Contenu": "This is my 4th year with Hello Mobile, Very good pricing and the service is fair."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:26:38.000Z",
          "Titre": "I recently switched to Hello Mobile",
          "Contenu": "I recently switched to Hello Mobile, and overall, my experience has been fairly positive. Here's a breakdown of my thoughts on the service:Pros:Affordable Plans: Hello Mobile offers competitive pricing, making it an attractive option for budget-conscious users. The plans provide a good balance of data, talk time, and text messages at reasonable rates.Coverage: The coverage has been reliable in most urban areas, and I haven't experienced any major issues with dropped calls or poor signal quality. However, it's essential to check the coverage map to ensure it meets your needs in specific locations.Simple Activation Process: Setting up the service was straightforward, and I appreciated the ease of activation. The SIM card arrived quickly, and I was able to start using the service without any significant hiccups.Customer Service: While I haven't had many issues, the customer service I've encountered has been responsive. They addressed my inquiries in a timely manner and were generally helpful.Cons:Data Speeds: The data speeds can be inconsistent, especially during peak hours. Streaming or downloading large files may not be as smooth as with some other providers. It's essential to manage your expectations regarding data speed.Limited International Features: If you frequently travel internationally, Hello Mobile might not be the best choice. The international features are somewhat limited, and roaming charges can add up quickly.App Functionality: The mobile app, while functional, could use some improvements in terms of user interface and features. It lacks some of the conveniences provided by larger carriers.Hidden Fees: Keep an eye out for potential hidden fees that may not be immediately apparent when signing up. Some users have reported unexpected charges that weren't clearly outlined in the initial plan details.In conclusion, Hello Mobile is a decent option for individuals seeking a budget-friendly phone plan with reliable coverage in most areas. While it may not have all the bells and whistles of larger carriers, it serves its purpose well for those who prioritize affordability. However, there's room for improvement in terms of data speeds, international features, and app functionality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debyani",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T00:59:07.000Z",
          "Titre": "Affordable price and network is good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Brin",
          "Nb_Reviews": 5,
          "Date": "2023-10-17T21:42:34.000Z",
          "Titre": "But I don't want a new SIM card...",
          "Contenu": "The procedure to renew my  number was confusing. All I wanted to do was renew my number but the only selection included a new free sim card. I didn't need a sim card. After about 15 minutes of looking for a way to renew without sim card, I just clicked on the one selection. The confirmation page after I clicked on it still included sim card, but the email sent to confirm the order did not show sim card. very confusing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vishwjeet Sharma",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:42:27.000Z",
          "Titre": "Its good specially their 5 or 10 dollar…",
          "Contenu": "Its good specially their 5 or 10 dollar plans. That helps saving lot of money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brother Moondog",
          "Nb_Reviews": 5,
          "Date": "2023-09-01T17:36:53.000Z",
          "Titre": "Good and getting better.",
          "Contenu": "It's hard to find a better deal, pricewise, than Hello mobile.  Most amazingly, unlike every other cell phone carrier I have ever dealt with, they haven't pulled any shady business practices so far.  I didn't like that they use \"T\" towers because \"T\" has the worst coverage in my area, but it is improving. In fact only recently \"T\" erected a tower a half mile from my house and my signal went from one bar 4G to five bars 5G."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Basker G",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:55:53.000Z",
          "Titre": "Good price n service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Claude",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T16:11:25.000Z",
          "Titre": "Easy to set up, wish they offered e-sim…",
          "Contenu": "Use of the website was straightforward and easy. I do wish there was an option to do an e-sim instead of waiting for a physical sim to arrive in the mail. As for the service the $5 plan is an amazing deal for someone who just needs an emergency phone and/or is ok to just use the phone on WiFi for browsing. Will have to see how coverage is."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T18:40:06.000Z",
          "Titre": "Getting the my old numbers",
          "Contenu": "My conection was disconected because of credit card issue. and i reached to reactivate by paying pending amount. customer service made me pay amount but said there is no option to get the my originumber back give me a new number. i had toescalate to management to get my old numbers allocated to me. it was done. it could be good if level 1 agent have some education about it. but my issue was resolved at end so i give 4 ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T17:49:58.000Z",
          "Titre": "It has a good customer support team",
          "Contenu": "It has a good customer support team.  It's easy to check to see whether your phone is compatible to its network.  The guidance to install a sim card and activate the line is clear and easy to follow.  Lastly, the monthly subscription fee is great and very competitive to other carriers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maxi",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T13:45:14.000Z",
          "Titre": "Best for low data users who is in T-Mobile network coverage areas.",
          "Contenu": "I've been using Hello mobile as my telephone provider for last two years I highly recommend it for low data users.Now let's talk about the unpleasant experience, because it runs on T-Mobile network, network is great in most areas but in upstate NY if Hello mobile could give us in poor T-Mobile network spots roaming on other networks like AT&T, then I and all my friends would rate it 10/10 instead of 4/5.Thanks Hello mobile"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T14:55:49.000Z",
          "Titre": "Cheapest price",
          "Contenu": "Cheapest price, really unlimited data. No slowing of speeds. More lines, more savings. International calling available and free. But they don't have Wi-Fi calling. Although they are T-Mobile mvno. That is the only thing missing. I would give them 5 stars otherwise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marvin",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T20:37:10.000Z",
          "Titre": "It's great service with very low cost",
          "Contenu": "It's great service with very low cost. Highly recommend hello mobile.There is only one thing that with international calls, the call goes through different numbers most of the times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geert Janssen",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T22:02:13.000Z",
          "Titre": "Cheapest Mobile Plan, but...",
          "Contenu": "Hello Mobile offers a decent plan at the lowest prices in the market. What is bugging me is that although international calling and texting are advertized, these services seem not to work. An call will tell me \"Insufficient funds\" and texts will not get send.Still I find this the best provider for emergency phones that are only occasionally used."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T14:18:54.000Z",
          "Titre": "Happy, but not...",
          "Contenu": "I am pleased with the service and the affordability. The only complaint that I have is they advertise Hot Spot can be added service, but I haven't been able to add it. I've tried calling and speaking with a representative and online... no one at Hello Mobile can explain why. Very Frustrating!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dr Mcpherson",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T06:15:19.000Z",
          "Titre": "I signed up with my existing phone…",
          "Contenu": "I signed up with my existing phone number for the new number on the Sim card. How come it wasn’t transferred when I signed up for bringing my own number with me and in fact its from T-Mobile which you’re a part of so it should’ve been straightforward."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T17:43:15.000Z",
          "Titre": "I love hello mobile",
          "Contenu": "I love hello mobile and I want to do 5 starts !! however 99%service is great once a while lost connection in some areas few times for seconds not long.. but is easy convenient and very affordable overall I'm glad I use hello mobile is a really good !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenan Umit Dinckan",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T08:09:18.000Z",
          "Titre": "Representative didn’t know the phone…",
          "Contenu": "Representative didn’t know the phone was locked and it was not responding the SIM cardI want to purchase a flip phone, but I tried my credit cards not one them works.I called also my bank they said that your system is blocking my credit cards"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T18:02:42.000Z",
          "Titre": "I'm retired and Hello mobile is just right for me.",
          "Contenu": "I'm retired and I hardly use my cell phone anymore. However I wanted to maintain a reliable cell phone and service for emergencies. I live on a fixed income now so I wanted something very inexpensive also. Hello mobile fills the bill for me. My 5 dollar plan gives me what I need."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EVA PARRISH",
          "Nb_Reviews": 6,
          "Date": "2023-12-09T14:45:07.000Z",
          "Titre": "Pretty good Co",
          "Contenu": "Pretty good Co. Service overall good. Being with this Co for a few years now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom H",
          "Nb_Reviews": 2,
          "Date": "2023-08-26T23:13:45.000Z",
          "Titre": "Data hard cutoff. Low price.  OK reliability.",
          "Contenu": "Main problem I found is on limited data plans, when you run out it doesn't switch to 3G it just stops.  Also you can't refill your data by phone after your data is used up you have to go online.  Also I had a second line with plenty of data left on it and I couldn't switch it to this main  line.Great Motorola  phone for low dollars!  Had charging problem 6 mo in but it was just fuzz around the deep (non electrical)edges of the usb-c connector did I cleaned out with a sharp toothpick dipped in alcohol."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Brown",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T16:09:26.000Z",
          "Titre": "Super happy that I switched from T-Mobile",
          "Contenu": "For the price, I would give it five stars.  For good internet connection, I'd give three, so I'll give it a four, However, it does use T-Mobile's towers and that isn't quite a five star network yet.  Since switching from T-Mobile, I've been saving $100 plus every month.  I just wish that I could get the T-Mobile startup off of my phone since I'm no longer with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AJAY",
          "Nb_Reviews": 5,
          "Date": "2023-09-21T15:57:30.000Z",
          "Titre": "Basic service at a great price.",
          "Contenu": "This is a low frills basic service that is super affordable.I have never really had to contact customer service because I have never had any issues, which in my book is a huge plus, because who wants to spend an hour of their day on the phone trying to get a problem resolved?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T17:57:46.000Z",
          "Titre": "The $5 Basic Plan is Great",
          "Contenu": "The $5 unlimited talk, text and 500mb plan is hard to beat. It must be the best in the whole wireless industry. I use this as my back up phone. I love the international calls to the UK. The only cons is customer service. Their representative most of the time are hard to understand, they dont speak English very well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Israa M",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T21:25:42.000Z",
          "Titre": "I like being a customer in Hello Mobile",
          "Contenu": "Good options for lines, affordable prices, cooperative agents in the customer service and good mobile service and data but it's not widespread nor strong enough to cover all areas of my city. I loose the signal when I drive in some rural areas."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pete",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T01:28:42.000Z",
          "Titre": "Hello Mobile's value-to-cost ratio can't be beat",
          "Contenu": "Cost firstmost. Also the service seems to be pretty much rock solid, althogh I've occasionally experienced a call suddenly dropping out (usually during an extended call). Otherwise although customer service is readily available, I have found their help not solving one of the problems I had - I was finally able to remedy the problem independently. But over all, I'm quite happy with Hello Mobile's service and the plan I'm on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vandi",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T08:39:59.000Z",
          "Titre": "My experience",
          "Contenu": "Sometimes Hello Mobile is not capable of transmitting 2 or more megabytes of data regardless of the time of day! Unlimited data? Yes. Carry large? No! This happens frequently"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T03:05:57.000Z",
          "Titre": "Great and affordable plans",
          "Contenu": "Great: very affordable price and I see Hellomobile plans are one of the best and cheapest charges that include good amount of internet data and unlimited calls/text to all over US and unlimited international calls to over 60 countries. Not great: customer service couldn't resolve any issues when it comes to payment or network issues as they keep asking documented questions and same answers.Also not able to see full phone numbers in the log calls on their website. International Roaming does not work and no option to upgrade for roaming."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laura Williams",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T03:30:33.000Z",
          "Titre": "Fantastic Budget Mobile Plan!!",
          "Contenu": "I have been a customer for a short time but so far so good (3 months) - hence the 4 star rating out of 5. I have not experienced a problem with service.  If you are looking for a budget mobile service, Hello Mobile is the answer.  There are different tiers to fit your budget which I love.  I dont spend hour upon hour on my phone like some people do. I do play video games but do it on my laptop at home mostly. I dont need a 50 dollar plan per month - quite the opposite.  Plus, if my phone usage would increase for whatever reason, I can very easily graduate my service to the next tier without any hassel.  Finally a truly affordable mobile telephone plan.  I live in Pittsburgh, Pennsylvania."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:34:50.000Z",
          "Titre": "Wouldn't allow billing and shipping…",
          "Contenu": "Wouldn't allow billing and shipping address in different states. We're trying to get plan for son away at college. Now we have to wait for sim to come in mail and then mail it to him. Very inconvenient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RANJITH THANGAVEL",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T15:28:04.000Z",
          "Titre": "Very cheap Network- Worth for money",
          "Contenu": "I like Hello mobile. Because i have paid only$5 per month. it's very cheap."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adrian Gonzalez Fuentes",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T22:01:27.000Z",
          "Titre": "Best service",
          "Contenu": "Very good service and price is awesome."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T07:12:49.000Z",
          "Titre": "Straightforward basic setup",
          "Contenu": "All great, fast shipping, easy to activate. Couldn't make WiFi calling work on my iPhone and couldn't find a solution online, too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hendri Purnawan",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T17:37:44.000Z",
          "Titre": "Easy account access and good network",
          "Contenu": "Easy online account access with the ability to BYOD. Good network coverage, but sometimes calls don't make it through until after several retries. Text message seems to be more reliable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CB",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T19:01:48.000Z",
          "Titre": "Unlimited Data",
          "Contenu": "I was told I would have unlimited data with my plan when I joined HelloMobile.  However, I was later told by Tech Support that my data limit was 18GB.  This contradicts the terms of your $25/mo. plan promotion & appears to be misleading.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ms C",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T03:45:24.000Z",
          "Titre": "Good cell reception!",
          "Contenu": "I’m satisfied with the service. I gave 4 stars because they were unable to port my number I’ve had since 2003. Making phone number changes is like getting married and changing my name I have to let everyone know. What a headache!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PG",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T05:55:09.000Z",
          "Titre": "Good until 5BG data",
          "Contenu": "Everything was great until the moment I had a little over 5GB for the month and you slowed down my data to the point that nothing was opening. That move forced me to remove one of my lines and transfer to another provider."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T20:13:39.000Z",
          "Titre": "some places here in amsterdam",
          "Contenu": "some places here in amsterdam, fulton ville, hagaman,ny dont get signals..and i' m not able to coonect nor contact!tha otner features are fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Verified Customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T18:24:25.000Z",
          "Titre": "Great service for the price with one flaw!",
          "Contenu": "Hello Mobile is great for the price I pay, however there is a flaw. The network is not that great in my neighborhood. Even when I am outside the house, I have difficulties in using data. My VoIP calls keeps getting dropped. I am right in the middle of the town right next to businesses."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aj",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T15:45:47.000Z",
          "Titre": "It's good for the price I pay",
          "Contenu": "It's good for the price I pay, sometimes I got amused by the network coverage where TMobile and others struggle.But I gets too much scam calls, call drops,and the quality of call is not that great.sometimes we don't receive the calls even."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Villarreal",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T07:07:20.000Z",
          "Titre": "Phone service is good but..",
          "Contenu": "Phone service is good. Only problem I had was when I moved my sons line to another carrier. Two months after I was still being charged for the service even though the line was moved. Luckily I noticed and called them to stop charging my bank."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T16:31:51.000Z",
          "Titre": "a little better directions for non-mobile users!!",
          "Contenu": "Everything was great until the time I had to make the phone work. I am not a mobil phone user. When they gave the instructions to set up the phone, the phone did not say what the directions said to look for in settings so I was totally lost."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Sunil",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T05:46:56.000Z",
          "Titre": "Affordable price",
          "Contenu": "Pros: Very affordable price and good network. Can call to 60 international countries for free.Cons: Unable to send text msgs to international. Customer support won't be able to resolve payment failure issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T22:40:25.000Z",
          "Titre": "Must have Wi-Fi calling is great the plan the…",
          "Contenu": "Everything is great the plan the texting the calls but you must have Wi-Fi calling difficult to use unless you're in a high single area you must activate Wi-Fi calling I know many other people who said that about this you need Wi-Fi calling and you got it locked up"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T06:14:14.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, - Don’t miss the payment, otherwise after grace period you might loose your number."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robinson Labuga",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T06:50:27.000Z",
          "Titre": "Process",
          "Contenu": "Process. Access signal strength except that data plan is not cumulative so I gave only 4stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Irvine",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T03:19:23.000Z",
          "Titre": "Very smooth process in becoming a Hello…",
          "Contenu": "Very smooth process in becoming a Hello customer. No hidden fee. Total $5 exactly as advertised. Looking forward to starting my service with Hello"
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T20:06:02.000Z",
          "Titre": "With some flows",
          "Contenu": "With some flows, I.e. delayed connection, prequent unavailable network signals, I was satisfied with hellomobile because of the low price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lance",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T20:14:50.000Z",
          "Titre": "Great clear connections and unbeatable…",
          "Contenu": "Great clear connections and unbeatable price. I tried to sign up for a second line and could not due to bot problems.So I had to go to another provider for line 2, which costs me money.So only 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T22:25:25.000Z",
          "Titre": "Very cheap and affordable prices! For college students!",
          "Contenu": "Very cheap phone plan for my American phone number. Way better than Google Fiber! Where were you when I was search for cheaper phone plans that did not lose service last year."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nerys",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T21:58:38.000Z",
          "Titre": "Decent service good price",
          "Contenu": "Services good The price is fantastic and consistent support is not that great but you come to expect that with a lower price support cost money overall very pleased with the service.My one drive is being called a liar because the support person who didn't want to admit they screwed up but that's an individual motion to person issue not a corporation overall I hope :-)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Varun",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T23:34:55.000Z",
          "Titre": "Great Pricing",
          "Contenu": "Great Pricing. But network connectivity needs improvement and data could be slowed but should be unlimited"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark W.",
          "Nb_Reviews": 4,
          "Date": "2023-07-31T21:24:05.000Z",
          "Titre": "Had the hardest time transferring…",
          "Contenu": "Had the hardest time transferring number from old carrier. Other than that, Hello has been a pretty good carrier, no complaints."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T13:57:34.000Z",
          "Titre": "Overall I cannot complain about my…",
          "Contenu": "Overall I cannot complain about my service.Would like to not lose connection at times though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luvly",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T09:21:08.000Z",
          "Titre": "A great experience",
          "Contenu": "The reception distance away from the city makes it worth it, I also like how it is easy to work around their website when I need to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T21:23:16.000Z",
          "Titre": "Service is good when wifi connection is…",
          "Contenu": "Service is good when wifi connection is live but sometimes without wifi -the Data plan is not working properly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anish John",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T02:47:56.000Z",
          "Titre": "The service working good most of the…",
          "Contenu": "The service working good most of the time, and it is very competitive price.  Sometimes call to India drops all of a sudden.  On the whole the service is good,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geneva",
          "Nb_Reviews": 4,
          "Date": "2023-09-30T17:44:57.000Z",
          "Titre": "STILL HAVEN`T GOT IT GOING HAVE WIYFI…",
          "Contenu": "STILL HAVEN`T GOT IT GOING HAVE WIYFI BUT CAN`T MAKE CALLS OR TEXT. THE CUSTOMER SERVICE WAS VERY PATIENT AND DID HER BEST BUT STILL DON`T WORK .GENEVA"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T20:29:43.000Z",
          "Titre": "Problem with incoming calls",
          "Contenu": "Had a problem with incoming calls during sometime because the company has switched to 5G and I had 4G smartphone then the network was back to work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T00:50:38.000Z",
          "Titre": "Having no issues is what make its…",
          "Contenu": "Having no issues is what make its great.  The only (issue) is that there are area that I receive no signal but its the same with Tmobile as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MarcelRichard",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T10:18:10.000Z",
          "Titre": "Very good experience so far",
          "Contenu": "Very good experience so far. I am still strictly observing how everything is functioning..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T17:16:11.000Z",
          "Titre": "The phone service itself is great and…",
          "Contenu": "The phone service itself is great and coverage is good too.  Getting sim cards is fast and easy. But sometimes the customer service is not up to par.  It seems like they can't hear you when you talk."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brittani higginbotham",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T09:45:59.000Z",
          "Titre": "It is an amazing service but i switched…",
          "Contenu": "It is an amazing service but i switched to unlimited and only got one more gig of data . Its truly not unlimited its about 5 gigs but after 2 it slows wayy down"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jaison",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T19:36:26.000Z",
          "Titre": "Services is all good",
          "Contenu": "Services is all good except that the data on unlimited plan is low and you get slower speed after few days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wahida Misha",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T03:17:04.000Z",
          "Titre": "about Intl call",
          "Contenu": "I need to make international call to Bangladesh but can't do it right now, otherwise it is good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KHAN/MOHAMMAD SAIFUDDIN",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T18:54:59.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anna K",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T01:15:12.000Z",
          "Titre": "price is great",
          "Contenu": "price is great, so far customer service ok, just the service area sometimes is weak signal"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 4,
          "Date": "2023-10-21T01:41:21.000Z",
          "Titre": "I appreciate that I was able to go over…",
          "Contenu": "I appreciate that I was able to go over on my billing. I had to fix an issue with my card account."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Spider Man",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T15:46:54.000Z",
          "Titre": "every good and good price point",
          "Contenu": "every good and good price point, but data speed need to increase to atleast min 5 mbps and  have esim for watch directly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Loretta",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T18:52:02.000Z",
          "Titre": "Great service.",
          "Contenu": "Easy to set up. Solid phone signal. Great prices. Would have liked a local number or to port my old number, but it wasn't possible. Oh well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "P. W.",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T02:45:55.000Z",
          "Titre": "Reliable",
          "Contenu": "Hello Mobile has been one of the most reliable services I have ever had. And I thank you for that. I use the phone mostly as a second line for calls and text. The data service is what makes or break you and that has been what counts. So far so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T21:58:33.000Z",
          "Titre": "Never cut off the customers service on bill day or any day!",
          "Contenu": "The experience has not happened yet so I'll give a review for that when it happens."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T21:27:19.000Z",
          "Titre": "Online website is pretty good just had…",
          "Contenu": "Online website is pretty good just had a little hard time by the payment wasn’t that clear"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "fish love",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:25:46.000Z",
          "Titre": "Very good net work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T01:45:39.000Z",
          "Titre": "Good service and price is reasonable.",
          "Contenu": "Good service and price is reasonable.My only problem is that I don't receive MMS on both lines I have with Hello."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "uriel",
          "Nb_Reviews": 5,
          "Date": "2023-09-01T04:32:13.000Z",
          "Titre": "Good prices but they started charging…",
          "Contenu": "Good prices but they started charging for plan changing witch is very inconvenient"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beach Comber",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:48:38.000Z",
          "Titre": "Service works for a low price"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyler Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T21:39:37.000Z",
          "Titre": "My service is consistent",
          "Contenu": "My service is consistent. I'm always able to make calls and texts, my download speed for my data is good, and it's cheap."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Davis",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T19:22:41.000Z",
          "Titre": "I like the price of it and how it's set…",
          "Contenu": "I like the price of it and how it's set without hidden costs the only thing is they say unlimited and I think after 15 GB you have to buy more or just wait till it recycles to the next month which is not a huge deal but it's not really explained when you get the service but I'm extremely happy with it other than that"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GANP",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T00:10:40.000Z",
          "Titre": "Hello makes our life easy.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherron Neal Putman",
          "Nb_Reviews": 5,
          "Date": "2023-10-10T21:46:33.000Z",
          "Titre": "I would have given it a 5 but it would…",
          "Contenu": "I would have given it a 5 but it would not accept my Amex for my order. I finally had to use Amazon"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T08:24:15.000Z",
          "Titre": "Cheap reliable phone plan",
          "Contenu": "Cheap reliable phone plan, only minor issues when making calls."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karkhanawala & co.",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:49:06.000Z",
          "Titre": "When I moved from India ...",
          "Contenu": "When I moved from India , I have been using other network...and it was very expensive for me. So i heard about HelloMobile and this is the best network i have come across very affordable and excellent service.Network is awesome ,price is awesome what else is needed...High recommendation for everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Xavier Gomes",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T01:19:34.000Z",
          "Titre": "This is exactly what i needed......",
          "Contenu": "This is exactly what i needed......I have been using other network and it was very expensive for me. So i heard about HelloMobile and this is the best network i have come across very affordable and excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aman Sinha",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:15:53.000Z",
          "Titre": "Good pricing and network",
          "Contenu": "Good pricing! Have been a customer from last month. The price is the total price with no added taxes or fees. Support is reasonable as long as you to go through their tiered process usually using chat. Phone support is a bit more difficult to obtain but can be done during regular business hours for those willing to wait. Overall a good experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Berg",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T00:30:53.000Z",
          "Titre": "Exactly what I need",
          "Contenu": "I have California life line but when I moved my reception was really bad. I'd have to search for signal and then get my call dropped in middle of calls and forget about incoming calls. I felt unsafe not being able to reliably call out. Saw a add for Hello and ordering a $5 sim was the best choice I ever made. For me it's very reliable and I feel safe once again. THANKS HELLO MOBILE.  Your a life saver giving me something aforable and reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "saikrishna panchala",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:24:53.000Z",
          "Titre": "I really feeling so happy that Hello…",
          "Contenu": "I really feeling so happy that Hello mobile is providing such a wonderful service at very low price. I can make international calls for free to more than 60 countries and I got my second month subscription for free. I love this service and I added my friend to my line. He is so happy now so he can call his parents in India for free of cost.Thank you Hello Mobile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mendy nissen",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:50:20.000Z",
          "Titre": "I tried the rest now I tried the best",
          "Contenu": "I tried the rest now I tried the best. This company is honest with their prices. Their service and support is much better then the more expensive companies. Mendel Nissen"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rakesh Pandey",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T12:54:00.000Z",
          "Titre": "Good pricing",
          "Contenu": "Good pricing! Have been a customer from last month. The price is the total price with no added taxes or fees. Support is reasonable as long as you to go through their tiered process usually using chat. Phone support is a bit more difficult to obtain but can be done during regular business hours for those willing to wait. Overall a good experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Schwakhofer",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T22:40:06.000Z",
          "Titre": "Great Company with more than fair prices",
          "Contenu": "Hello Mobile has provided good service at a more than competitive price. Only problem encountered is no service in mountain areas which would be the same for any provider."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Morris",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:22:39.000Z",
          "Titre": "Senior Adult Approved!",
          "Contenu": "We are senior adults and really appreciate the quality and value of HELLO MOBILE! The network and billing process goes smooooooth every month for years now! We are pleased to call HELLO Mobile our mobile provider!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Quan Le",
          "Nb_Reviews": 5,
          "Date": "2023-12-16T02:44:11.000Z",
          "Titre": "Great Wireless Carrier",
          "Contenu": "Great Wireless Carrier! I really mean it! Nice, quick, and simple process to sign up and transfer numbers! Either physical or eSim option make it a seamless transition!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Rezendes",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:44:46.000Z",
          "Titre": "I was paying $40 a month from another…",
          "Contenu": "I was paying $40 a month from another carrier and not even getting unlimited text, talk and data. That was so long ago, I can't even tell you how much data was allowed; maybe 3 or 5 gig ⁉️🤔Anyways, unlimited everything for $25 dollars still can't be beat‼️I don't even bother looking elsewhere anymore⁉️If you can find a better deal please let me know‼️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vikas",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T02:54:26.000Z",
          "Titre": "Excellent service so far",
          "Contenu": "Excellent service so far, i never had any issues related to data or network. Best part is plan starts from $5 which no one is providing in market."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Kachin",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:37:40.000Z",
          "Titre": "I am a first time customer and I am so…",
          "Contenu": "I am a first time customer and I am so happy with my service so far. Everything has been easy and top notch from the sign up to the activation. I had originally ordered an E-sim but then found out my phone wasn't eligible so I called to cancel and then remembered that I have a different unlocked phone. It didn't have E-sim but it could use a sim card. The rep was so helpful in understanding my situation and getting it all ordered hassle free and there was no additional charge even though I believe there is normally. I received my sim in less than a week. I popped out my old sim and popped in the new one with that nifty sim tool that was included. I didn't need to do anything else and it was working instantly. I have perfectly clear calls, excellent reception, high speed 4g in the model phone I have. This has been the best experience I have ever had with a carrier overall.Highly recommend 5 out of 5Thanks Hello Mobile"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shapoor Akbari",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T18:08:27.000Z",
          "Titre": "Hello Mobile Network",
          "Contenu": "Hello Mobile Network, I appreciate the seamless connectivity you provide.Thank you, Hello Mobile, for your reliable and affordable services.I value the clarity and quality of calls on the Hello Mobile Network.Hello Mobile, your customer service has been consistently helpful and responsive.I appreciate the straightforward and transparent billing system you offer.Thank you for the competitive data plans that suit my needs, Hello Mobile.Hello Mobile Network, I commend your user-friendly mobile app.I'm grateful for the extensive coverage your network provides.Kudos to Hello Mobile for keeping me connected wherever I go.Thank you, Hello Mobile, for making communication hassle-free and enjoyable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yoga Narasimha Rajesh c",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T07:36:10.000Z",
          "Titre": "best ,awesome and reliable company for…",
          "Contenu": "best ,awesome and reliable company for a person or family that need to safe some money in cell bills. I am saving more than other mobiles ,comparing my previous monthly payments with over companies. Now I paying $85.00 including taxes every month for 5 lines. I am so happy and recommend Hello Mobile to any family. Good look! RC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andre",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:50:27.000Z",
          "Titre": "I love Hello Mobile the price is…",
          "Contenu": "I love Hello Mobile the price is unbeatable, and the service is great I have two line and about the have a third. I also recommend Hello Mobile to all my family and friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Machado Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T02:18:35.000Z",
          "Titre": "Hello Mobile - No Issues - Excellent Service.",
          "Contenu": "I am very happy that I have hello mobile service on my phone. The very Low price and great service provided by hellomobile is excellent. I am using Hellomobile for More than 2 years. And I told my friends to go with Hellomobile. I never face any problem with HelloMobile. Works great for me. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin Disher",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:13:53.000Z",
          "Titre": "It’s been amazing I love this it’s very…",
          "Contenu": "It’s been amazing I love this it’s very affordable and it’s amazing I never get drop calls or any thing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James W.",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T08:53:17.000Z",
          "Titre": "$5/Month Plan Is A Great Value",
          "Contenu": "So, let me clarify from the start. I do not use Hellow Mobile for my primary personal phone line. However, their $5/month plan for unlimited calls, unlimited texts, and 500 MB of data is perfect for my use case. I have 2 of these $5/month plans - one each for 2 backup phones / kids phones. This is the best price for what I wanted and I’ve been using Hello Mobile since April of 2021. So far it has worked exactly how I need!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel N",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T10:20:15.000Z",
          "Titre": "Im new and satisfied",
          "Contenu": "New customer here and I am very satisfied with the mobile service of hello mobile. No more stress of paying a bill that gets bigger each year, no more issues thinking how much data i have left, and no more contracts. Best part can bring my wife over for further savings for the same service if not better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richardson Contractors",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T15:20:48.000Z",
          "Titre": "Hello Mobile is a reliable and the cheapest company for…",
          "Contenu": "Hello Mobile is a reliable company for person or family that need to safe some money in cell bills. I am saving more than 60% comparing my previous monthly payments with over companies. Now I paying $85.00 including taxes every month for 5 lines. I am so happy and recommend Hello Mobile to any family. Good look!  RC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Federico",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T09:10:53.000Z",
          "Titre": "Very reliable connection",
          "Contenu": "Not only is hello mobile reliable, but its also very good at getting connection where many won't or can't. I currently have 2 different service companys and often find that when my at&t sim cant connect , my hello mobile will."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Hua",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:38:28.000Z",
          "Titre": "I have been with Hello Mobile for more…",
          "Contenu": "I have been with Hello Mobile for more than a year now. I am very satisfied with the service and price. I got 2 lines for unlimited data. 40$/month in total, no hidden fee, even including tax. I can call my parents in China as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alayni Krista Pandalor",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:45:29.000Z",
          "Titre": "Great company",
          "Contenu": "Pricing is soo so nice and the customer service is fantastic.  My only complaint was if you wanted to change plans you had to be sent a new SIM card and couldn't use your phone for two weeks.  But they have fixed that now because they listen to customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T19:16:37.000Z",
          "Titre": "Best affordable phone plan ever",
          "Contenu": "Hello Mobile is fantastic for what it is. They just enabled eSim so you can run a second phone number off your iphone. This is the cheapest and most effective way to do this– even second phone number apps cost more than their base plan, and they are usually just VoiP lines."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chidera Alo",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T01:25:38.000Z",
          "Titre": "Affordable plan for everyone",
          "Contenu": "Hello Mobile is the perfect plan for students especially the international students because of its economic benefits. It’s a game changer with a plan as low as $5. Anyone can literally afford this plan.Thank you Hello Mobile for making life a lot easier for me here in the USA and for considering people’s status in your service plans."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean Young",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:10:34.000Z",
          "Titre": "Hello Mobile service has been great",
          "Contenu": "Hello Mobile service has been great.  No issues with service.  They have great plans and you get big discounts with multiple lines of service.  Recommend to all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "uriel",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T09:05:28.000Z",
          "Titre": "cheapest prrice for a line without…",
          "Contenu": "cheapest prrice for a line without contract 5$ with 500mb of internet and unlimited txt and callls very helpful when u cant pay the unlt everything price wich is also only 25 bucks. would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Calvin Mugabo",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T02:48:40.000Z",
          "Titre": "I started using hello mobile from…",
          "Contenu": "I started using hello mobile from Texas, I moved to Maine and thought I will loose the network, even there, it is still the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colleen Ghirardi",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T22:58:28.000Z",
          "Titre": "I have had my service for about 4 years…",
          "Contenu": "I have had my service for about 4 years or more and I love it. I have an IPhone that I own and unlocked. It works perfectly for me. I never have issues with my connection away from WiFi either. I love that I can use ESIM service when I leave the USA since I travel to Europe often. I have 2 lines and we are both very happy with unlimited everything for $40 a month for 2 lines. No complaints!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:54:17.000Z",
          "Titre": "Amazing",
          "Contenu": "I have had this service for almost a month and I love it. The service is of high quality and very affordable. I have no complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mihoko",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T21:40:59.000Z",
          "Titre": "The best price in the market",
          "Contenu": "Our family member 4 people are using the family plan for 3 years. It's a very reasonable price and reliable. We are so grateful for it. We want to keep continue to use it and never thought to change another carrier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:18:48.000Z",
          "Titre": "Great services",
          "Contenu": "Love the services been using for awhile. Have no problem with services in town or out of town"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T15:42:31.000Z",
          "Titre": "Excellent service and great price for 2…",
          "Contenu": "Excellent service and great price for 2 lines. I'm always sharing my mobile service provider info with family and friends. I switched because of the great price, but I never have connection problems like I did with the service provider I had before Hello Mobile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Bui",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:17:56.000Z",
          "Titre": "I love hellomoile because the piece is…",
          "Contenu": "I love hellomoile because the piece is a fraction of a cost compare to any other cellular company plus with a highly fast speed service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Gracey",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T13:26:14.000Z",
          "Titre": "Long Time Satisfied Customer",
          "Contenu": "I have been a customer since November, 2020; it is a very reliable and easy business to deal with. No problems. Haven't used customer service because I have had no issues! I would highly recommend this business for your mobile phone needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adeleye Aleilo",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:11:02.000Z",
          "Titre": "Hello mobile network is the best and…",
          "Contenu": "Hello mobile network is the best and free call to many international countryIt’s affordable price with good network"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phoua Thao",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T07:53:09.000Z",
          "Titre": "Hello Mobile made it easy to message…",
          "Contenu": "Hello Mobile made it easy to message and call my loved ones. Hello Mobile is an affordable and stable service that I highly recommend! I will continue to build my family phone lines here and you should too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "vivi",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T18:28:36.000Z",
          "Titre": "Affordable prices and stable services are very good, and we will recommend them to more people to use",
          "Contenu": "I don't have many phone calls, but I need internet traffic. The affordable price of HelloMobile is very friendly, and I hope it can continue to be maintained. I have recommended it to many friends and hope to have a referral reward system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Varun",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T08:04:34.000Z",
          "Titre": "Better than the best",
          "Contenu": "First of all the least expensive & affordable plans in the market including taxes .. that’s a bonus.Plans for all kind of usage . Have been using for years and never had a network problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanaja",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T15:22:23.000Z",
          "Titre": "I never thought HelloMobile provides…",
          "Contenu": "I never thought hello mobile provides such a great services. I was using T-Mobile service. There was a signal problem always, but hello mobile signal is very strong. I compared hello mobile pricing monthly charges with other service providers, it is far better than the Verizon AT&t and other services. So I got a new number from hello mobile to use their services. Even I am happily able to call to 60 countries with no charges. Hello mobile provides 500 MB data unlimited talk and text just for less than $10 that saves a lot of money in a month. I would like to Port my other number also onto hello mobile. I am very happy to use hello mobile I would like to let my friends and family members to use hello mobile service because it is affordable much cheaper and a great customer service. Their response is very quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Calvo",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:06:53.000Z",
          "Titre": "Great so far!",
          "Contenu": "So far hello mobile has been great and the service is on par with the top cellular companies"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darlene",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T02:06:15.000Z",
          "Titre": "Happy with service",
          "Contenu": "I love it because they send you message when payment is due and as of today I havent dropped a call or lost signal  . very happy with the service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tara Wright",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:27:35.000Z",
          "Titre": "Wonderful service",
          "Contenu": "I like hello mobile because I find it a great service for my kids to use at a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "abraham alvarez",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T07:59:09.000Z",
          "Titre": "Hello Mobile is a great mobile…",
          "Contenu": "Hello Mobile is a great mobile platform. Previously, I have so much problems with another brand that got so many issues with data. But hello mobile works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Weaver",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:34:42.000Z",
          "Titre": "Port so fast I missed seeing it happen.",
          "Contenu": "First time I ever had a phone company port a number before I even managed to log into my account to activate the sim, generally it takes an act of god to get this type of thing done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cristy S",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T15:25:42.000Z",
          "Titre": "Love Hello Mobile",
          "Contenu": "Love Hello Mobile! Affordable business phone that gives all the value of a major telecom company! Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dustin diaz",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T15:21:25.000Z",
          "Titre": "Great so far no problems with my…",
          "Contenu": "Great so far no problems with my service and very reasonably priced for what I needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Browne",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T15:45:17.000Z",
          "Titre": "I use my phone to call relatives in…",
          "Contenu": "I use my phone to call relatives in Ireland. It works just fine for a great price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Hereira",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:20:32.000Z",
          "Titre": "Great sei",
          "Contenu": "I have been with their company for over 3 years, great service and it won't break your bank!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T00:33:27.000Z",
          "Titre": "Best budget phone..............or I…",
          "Contenu": "Best budget phone..............or I must say best phone service I have received in past 8 years! I have used about 5 different providers so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mila",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:01:54.000Z",
          "Titre": "I enjoy my mobile service",
          "Contenu": "I enjoy my mobile service, never had problem with them and I love that it's so affordable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Li",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T01:09:28.000Z",
          "Titre": "I like use Hello Mobile!",
          "Contenu": "I like use Hello Mobile!Great service ,Good price. Good signal.Thank you Hello Mobile! Happy New Year!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tpops",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:02:06.000Z",
          "Titre": "Affordable and Good Service",
          "Contenu": "Cheap, affordable, and good service in one mobile company. Perfect if you're from Canada and travel a lot to the United States and need an American number."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lemlem Abebaw",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T07:49:33.000Z",
          "Titre": "Hello Mobile: Reliable & Affordable",
          "Contenu": "Hello Mobile impresses with reliable connectivity and budget-friendly plans. Their service offers seamless usage and a user-friendly interface. Customer support is responsive, and their affordability stands out. While coverage might vary, Hello Mobile remains a solid choice for quality on a budget."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sergio arvizu",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T22:40:59.000Z",
          "Titre": "Until now the signal and reception are…",
          "Contenu": "Until now the signal and reception are best there is nothing bad in the service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Li",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T23:40:20.000Z",
          "Titre": "I like Hello Mobile!",
          "Contenu": "I like Hello Mobile!Price is good , service is good, signal is good. Will continue use Hello Mobile! Thank you !Happy New Year 🎊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:04:55.000Z",
          "Titre": "It is the best service I ever had I…",
          "Contenu": "It is the best service I ever had I recommend u to everyone in my family friends"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ale C.",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T15:43:23.000Z",
          "Titre": "Good affordable service",
          "Contenu": "The service is great and it's super affordable. I love Hello mobile because honestly it has helped me to save a bunch of money on my bills. 💕"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Lei",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T04:25:38.000Z",
          "Titre": "The monthly cost is cheap",
          "Contenu": "The monthly cost is cheap. The service is great. Especially for international phone calls. IT IS FREE!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liv Elns",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T14:11:08.000Z",
          "Titre": "Mobile has the cheapest most affordable…",
          "Contenu": "Mobile has the cheapest most affordable rate for a beginner’s (student) first phone line."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "undefined",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T22:38:00.000Z",
          "Titre": "This has been a great experience",
          "Contenu": "This has been a great experience! Very affordable prices and good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dent",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T14:28:17.000Z",
          "Titre": "Great pricing with no fees or taxes…",
          "Contenu": "Great pricing with no fees or taxes added to the pricing. It makes no sense not to make Hello Mobile your cell phone carrier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lemlem Abebaw",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T22:25:40.000Z",
          "Titre": "Great Deal",
          "Contenu": "Hello Mobile stands out for its reliability and affordability. Their service provides seamless connectivity and an intuitive interface, ensuring a smooth user experience. Their responsive customer support and cost-effectiveness are notable features. Despite potential coverage variations, Hello Mobile remains a strong option for quality service within a budget."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sai Pamidi",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T23:03:39.000Z",
          "Titre": "Hyy I am an international student I am…",
          "Contenu": "Hyy I am an international student I am using hello mobile from last 8 months it was really very helpful to me and cost was to low and I an using international calling unlimited you can't this kind of deals in any network."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Anthony Eric",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:39:04.000Z",
          "Titre": "The best among all affordable plans",
          "Contenu": "The best among all affordable plans. Price includes taxes and fees. Connectivity is great and I think it uses TMobiles network.No complaint at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raja Jaladurgam",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T22:28:34.000Z",
          "Titre": "Best mobile service which is budget…",
          "Contenu": "Best mobile service which is budget friendly with diverse plans to suit individual preferences.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T02:52:35.000Z",
          "Titre": "I think the service is great",
          "Contenu": "I think the service is great. I have no problem getting through to customer service. They are quick to resolve my issue. They offer exactly what i want and need. No one else out there beats their prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Hancock",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:49:49.000Z",
          "Titre": "Two unlimited lines for $40 a month",
          "Contenu": "Two unlimited lines for $40 a month. Can't beat that! I've had it for 3 months and haven't had a single problem with data or voice. I'm pleased so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Knight",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T16:03:08.000Z",
          "Titre": "Best Value",
          "Contenu": "I've had Hello mobile for several years, and I love it! Uninterrupted service with great coverage wherever I go! Highly recommend..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dustin diaz",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T14:41:10.000Z",
          "Titre": "Very affordable I was able to bring my…",
          "Contenu": "Very affordable I was able to bring my own device easy setup iv had no problems with service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Konstantinos Kapsokavadis",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:02:55.000Z",
          "Titre": "Great service",
          "Contenu": "Great service! I had never issues with the service and the representatives I spoke with. Calls, texts and data always work perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sairam cherukuri",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:12:22.000Z",
          "Titre": "Hello Mobile is very Affordable and…",
          "Contenu": "Hello Mobile is very Affordable and reliable Network with no Contracts where you can choose your Plans according to you needs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maggie",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T22:42:07.000Z",
          "Titre": "HelloMobile is great!",
          "Contenu": "I've used HelloMobile for several years, and I've never had a single problem with it. The price is great too. When I tell people about it, they think it's too good to believe. 🤷"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Cristian Romano",
          "Nb_Reviews": 9,
          "Date": "2023-11-16T06:04:03.000Z",
          "Titre": "The best mobile network in US",
          "Contenu": "The best mobile network in US, the price include tax and fees, about my test up to 7 Gigabytes the network is good, after slow down bit it’s unlimited. Voice and messages perfect bait the wificalliing isn’t active yet. We waiting the eSIM feature. Thanks Hello mobile!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hello",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T05:44:32.000Z",
          "Titre": "Embracing Connectivity: Why I Love Hello Mobile",
          "Contenu": "I love Hello Mobile for several reasons. Firstly, the reliable nationwide coverage gives me peace of mind, ensuring that I stay connected wherever I am in the US. The free international calling to over 60 countries is a fantastic perk, allowing me to stay in touch with friends and family abroad without worrying about additional charges.The option to keep my current phone and number with Hello Mobile is convenient, and the 'Always On' guarantee ensures that I can always send texts and make 911 calls even if I run out of minutes or data. The total online support is a standout feature, providing assistance without the need for physical storefronts, resulting in cost savings that are passed on to the customers.Additionally, the Wi-Fi Auto-Connect™ feature is a smart way to maximize my wireless plan by automatically connecting to one of the 10 million nationwide Hotspots, helping me save on data usage and costs. Overall, Hello Mobile offers a comprehensive and affordable wireless experience, making it my preferred choice for staying connected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Orlando Medina",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T21:35:33.000Z",
          "Titre": "Its inexpensive",
          "Contenu": "Its an inexpensive service that does the job 👍🏼"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "stleon07",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T02:52:13.000Z",
          "Titre": "Great Value!",
          "Contenu": "I get great service, the plan is flexible and I haven't really had trouble with it. Completely worth the price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raju",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:42:30.000Z",
          "Titre": "Excellent service and very affordable…",
          "Contenu": "Excellent service and very affordable price. I love Hello Mobile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Velilla",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:21:55.000Z",
          "Titre": "Best Service for Hello! Mobile",
          "Contenu": "I have no problems with Hello! Mobile Service lately."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Panchal",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T13:57:35.000Z",
          "Titre": "\"Hello Mobile has an Exceptional Service and Reliability Over Five Years",
          "Contenu": "I've been a loyal customer of Mobile for five years now, and their services continue to exceed my expectations. The network reliability is outstanding—I've experienced minimal disruptions in connectivity, even in remote areas. The range of services offered by Hello Mobile is impressive. The data plans are very competitive,  also cater perfectly to my needs. The customer service team is responsive and genuinely helpful whenever I've had inquiries or needed assistance. I highly recommend Hello Mobile to anyone seeking a reliable network, great data plans, and exceptional customer service. My consistent positive experience over the years solidifies hello Mobile as my go-to choice for mobile phone services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "omar",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T12:52:57.000Z",
          "Titre": "it was great with hello mobile service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Serhii  Kutishenko",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T19:41:39.000Z",
          "Titre": "Grate company",
          "Contenu": "Grate company - grate service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "F F",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T01:20:41.000Z",
          "Titre": "A STEAL!",
          "Contenu": "It's affordable, great talk and text and amazing 5G service keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raja Jaladurgam",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T13:09:17.000Z",
          "Titre": "This is the best budget friendly mobile…",
          "Contenu": "This is the best budget friendly mobile service with good network across united states"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anurag Trivedi",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T08:12:33.000Z",
          "Titre": "It's been a great experience with Hello…",
          "Contenu": "It's been a great experience with Hello Mobile. It's best Reliable and the most affordable mobile network"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley Cirwithen",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T09:13:13.000Z",
          "Titre": "Unlimited for 25 a month is unbeatable",
          "Contenu": "Unlimited for 25 a month is unbeatable. Saved me tons of money"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Balaji Praneeth",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T08:14:33.000Z",
          "Titre": "Service is excellent..",
          "Contenu": "Service is excellent... No doubt , no network issues for effort and cost"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Yujiro",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:01:46.000Z",
          "Titre": "I get more for less money",
          "Contenu": "I get way more data then my previous cell company for less money. Really liking it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dhiraj Gautam",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T08:17:11.000Z",
          "Titre": "Great service and plan",
          "Contenu": "Great service and plan. There is data cap and no overage on it. Have plan set for my kid, cheapest $5 service which no one could compete."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy S",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T16:40:07.000Z",
          "Titre": "… \"Hello Mobile: Seamless Coverage, Budget-Friendly Plans, No Strings Attached\"",
          "Contenu": "Hello Mobile offers an impressive combination of reliable coverage, budget-friendly plans, and a transparent approach with no strings attached. The network coverage ensures a seamless communication experience, while the affordable plans starting from $5/month cater to cost-conscious users without compromising quality. The absence of hidden fees or contractual obligations makes Hello Mobile a straightforward and appealing choice for those seeking a hassle-free mobile service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ajeet",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T23:23:50.000Z",
          "Titre": "It has good network coverage and cheap."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bahaeldin mahmoud",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:50:50.000Z",
          "Titre": "It’s good for kids I have 3 lines for…",
          "Contenu": "It’s good for kids I have 3 lines for my 3 kids just paying $15 monthly which is good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Namon",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T15:39:15.000Z",
          "Titre": "The 5.00 plan was great for me because…",
          "Contenu": "The 5.00 plan was great for me because I don't have to make very many phone calls. My phone got stolen and thanks to Hello Mobile, they sent me a new sims card free of charge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Balaram Ghimire",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:00:21.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. I loved it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "검정",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:38:04.000Z",
          "Titre": "Great carrier",
          "Contenu": "Great carrier. Reliable n trust to its services. Well connected to customers as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "V",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:46:08.000Z",
          "Titre": "cheaper than any other brand",
          "Contenu": "cheaper than any other brand, same coverage, just perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Knight",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T15:29:20.000Z",
          "Titre": "Best Value!",
          "Contenu": "Mypersonal experience is continued great service and coverage!Keep up the good work 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doretha Gilmer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T14:28:39.000Z",
          "Titre": "I really like the affordability of…",
          "Contenu": "I really like the affordability of Hello Mobile.  I have referred several friends and family members."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cicel MAmvura",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:32:24.000Z",
          "Titre": "Can’t beat the prize for unlimited…",
          "Contenu": "Can’t beat the prize for unlimited data, call, and text."
        }
      ]
    }
  ]
}