{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "homesafe.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry Simpson",
          "Nb_Reviews": 2,
          "Date": "2023-12-30T03:31:00.000Z",
          "Titre": "Tarbale company",
          "Contenu": "The çomuacation is terrible I tried for a week to get a simple washer fixed or replaced. The contractor you had come out sent in all the paperwork needed My representative would not call me back. You are the worst company I have ever worked with...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fred Jepsen",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T01:09:38.000Z",
          "Titre": "I’m left with the feeling that I have been lied to and put off at every turn.",
          "Contenu": "I’ve sent a long letter with some receipts to let you know how I feel, but in short I feel that the system got so bogged down, that I couldn’t trust anything told me by either HomeSafe or Armis."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mayola Nash",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T23:29:52.000Z",
          "Titre": "Not explaining beforehand",
          "Contenu": "Not explaining beforehand, the company Policy on claim and being denied payment for a job already  completed and paid for. It should have been handle in a better way. Disappointing. Concern customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-12-09T09:03:07.000Z",
          "Titre": "ARMIS HOME SAFE ARE RIP OFF",
          "Contenu": "They are procrastinators! It took from the middle of September until now to finally pay something to me. 3 months on an AC problem. And I'm still arguing with them about it. Trying to get reimbursement what is fair.  Their BBB rating is negative! They refused to replace anything on my AC unit until I complained. They are still not paying me what the plan says. They say the compressor is out and will replace that. Due to their procrastination I had to get the unit changed. Then they wanted to ask for the old parts. They're gone. I'm terminally ill I can't wait 30-60 days for them to approve the claim. Consequently, my system is the old r22 freon. No one will touch the compressor replacement! At that point you have to change to the new style. They didn't even want to replace the circuit boards that are pitted and burnt! They tried to find out any excuse not to pay up! I'm still trying to get a hold of upper management and I can't! I want to talk to the VP! No make that the CEO. Forgot, they lied to the BBB to get out of stuff! Don't waste your money on them. They now make you pay $120 per call!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 3,
          "Date": "2023-11-19T17:52:19.000Z",
          "Titre": "Seems like they don’t understand if you…",
          "Contenu": "Seems like they don’t understand if you live outside a city and can’t get someone to drive out and check out your problem then send them a email and wait for a response to fix the problem. Small businesses don’t have this kind of time or resources to send emails and wait for response to fix the problem. I have been paying for this service for years and try to use it and every obstacle they can think of to stop getting it fixed.  I just paid for the service from my pocket.  This Warranty is probably good for someone in a populated area. But if you live away from a populated region you are likely to be on your own."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Howell",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T01:47:30.000Z",
          "Titre": "It took the adjuster five (5) days to…",
          "Contenu": "It took the adjuster five (5) days to approve the replacement of a microwave.  The proposed replacement microwave had less features and the cash offer was $149.00 less than the actual replace cost."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allen Heide",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:40:41.000Z",
          "Titre": "Was given one contractor ,who has yet…",
          "Contenu": "Was given one contractor ,who has yet to call to set ujp appointment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CATHY S Davis",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T04:03:16.000Z",
          "Titre": "Unqualified repair person",
          "Contenu": "4 different things stopped working on my dryer and no matter what I said he kept saying nothing was wrong. But I ended up paying $49 for his inability to do his job."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FRANK",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T20:59:51.000Z",
          "Titre": "After two weeks of waiting for an…",
          "Contenu": "After two weeks of waiting for an answer .I called to inquire and the person I spoke to couldn't find my contact information or service information So I just canceled our contract for nonpormance on your part."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ESTHER FARNSWORTH",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T02:08:44.000Z",
          "Titre": "Hard to believe!",
          "Contenu": "When I read all the details of their contract which was all on their favor and not much for the customer ie: if they came to fix any of the appliances that appliance became their property….So I cancelled."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry Nichols",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T06:26:18.000Z",
          "Titre": "Took my money",
          "Contenu": "They drug out. Weekly, the info they needed. After 6 wks, they Denied my claim saying i had rusted coils. My a/c person said that they are using as an excuse, that all a/c units have rusted coils unless they are brand new.  I have recently found out from another Home Warranty Company, that they PAY claims like that everyday.  So, you guys, got my money and stabbed me in the back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JUDY",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T21:53:21.000Z",
          "Titre": "Not satisfied",
          "Contenu": "I used this so that when something happened it would be at least partially paid for. My tech sent pictures of my air conditioner and showed the condition it was in and your company paid NOTHING! I canceled the house part."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOHN",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T19:33:55.000Z",
          "Titre": "Horrible first experience with…",
          "Contenu": "Horrible first experience with HomeSafe.  Their recommended electrician would not deal with HomeSafe.  He said he would repair the problem but I would have to pay him upfront and then worry about being reimbursed by the warranty company.  Then he charged me $750 to replace two circuit breakers!  After weeks of going back and forth with HomeSafe and the electrician, I finally got a check for $226.00.  Homesafe  said it was because the repairs were needed due to weather which is not covered by my warranty.  Yet they agreed to “pay me for parts and labor.”  Well that’s all there was, parts and labor.  Doesn’t make sense.  Then my bank did not honor the check right away, they waited 10 days to deposit the funds into my account because according to Capital One Bank, there was a high risk the check would be not be honored.  Finally I did get the $226.00."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janet Murdock",
          "Nb_Reviews": 4,
          "Date": "2023-09-28T21:06:43.000Z",
          "Titre": "Armis is the GRAND CHAMPION",
          "Contenu": "Armis is the GRAND CHAMPIONOF WAIT TIME FOR THE CUSTOMER AND SERVICE PROVIDER. I DONT BELIEVE CUSTOMER SERVICE IS IN YOUR VOCABULARY. WE TRIED EVERYTHING TO GETINFORMATION TO YOU.  MY SERVICEMAN WORKS FOR A LIVING HE DOESNT HAVE TIME TO BE PUT ON HOLD FOF AN HOUR AND THEN TO SPEAK WITH A PERSON THAT CANT ANSWER QUESTIONS.  WHEN YOU GET TO THE PERSON YOU GIVE INFORMATION TO......IT JUSTWAS INGNORED.  I WAS STANDINGRIGHT THERE, IT WAS ON SPEAKER PHONE.  THE SERVICEMAN GAVE ALL THE SERIAL NUMBERS AND MODEL NUMBER AND THE PROBLEMS AND WHAT THEY NEEDED TO DO.  NOTHING WAS DONE.  THE EXCUSE WAS THEY DIDNT GET A PICTURE OF THE aC unit.  It shows nothing. A picture of a Beautiful AC unit.  I've never seen such trickies to get out of paying forRepairs.  WOW."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wanda Mount",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T20:58:28.000Z",
          "Titre": "Receipts have not been reimbursed",
          "Contenu": "I forwarded receipts for maintenance that was done to appliances in my home 8 Sep 2023. I have not received reimbursement or information on my reimbursement as of yet. I called Home Safe on the day the maintenance was being done and was told to forward the receipts and I would be reimbursed once the receipts were reviewed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOHN",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T23:02:44.000Z",
          "Titre": "Coverage for furnace was denied for a…",
          "Contenu": "Coverage for furnace was denied for a ridiculous reason.  The heat exchanger had multiple in it. Denied because it rusted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tess Fullard",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:39:12.000Z",
          "Titre": "horrible service",
          "Contenu": "horrible service...no one ever came out to fix my unit.  Take your money and don't care when its time for  a service call"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arthur Appleton",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T19:51:26.000Z",
          "Titre": "Have not received a package and nothing…",
          "Contenu": "Have not received a package and nothing ordered. All I did was pay our monthly bill. We have not used your services as of yet. Can’t rate you now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jean Severns",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T00:02:17.000Z",
          "Titre": "Home Safe/Armis Very Poor Customer Service!",
          "Contenu": "This company. does not have proper protocol in place for follow up.  Between Home Safe & Armis there is not good communication.  It's extremely frustrating as a customer to be told that you can NOT speak to a supervisor.  Home Safe may sell you your contract & take your payment out of your account but after that they really are of no help.  Not only could I not be connected to a supervisor, I was told that the prior person I spoke to works from home so he had no supervisor & the lady I spoke to said, \"My supervisor just went home\".  The supervisors apparently work for both Home Safe & Car Shield.  When a supervisor finally called me & left a message w/a number to call him back at iit was for Car Shield & the person stated that they could not help me.  I cannot get a straight answer from anyone.  I am so upset & frustrated to be treated this way.  Ive read my contract.  They sure never skip a beat taking out my money each month...but they are not in a hurry to follow up in their so called 24-48 hour period.  This review won't make a difference to this company, (which is sad) but it has helped me to explain my frustrations...hopefully someone will try & help me.  I also have waited a month for $150.00 payment that was to new mailed to me.  Thus far three different time they have gone back an d fourth stating yes, no and now yes they will pay me but no one has called me to get my information."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WOODS",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T02:32:59.000Z",
          "Titre": "The young lady I talked to was…",
          "Contenu": "The young lady I talked to was wonderful but dealing with the company was a bad bad experience they wasn't honestly taking care of their my situation so that's why I canceled"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ROSE",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T02:55:57.000Z",
          "Titre": "So disappointed in this company",
          "Contenu": "So disappointed in this company! I guess being a widow with no help with the contract! I feel very cheated"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert TEMM",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T21:33:07.000Z",
          "Titre": "Read contract fully",
          "Contenu": "Encourage clients to look for your LOOPHOLES in the contract on their covered item."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill Nash",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T22:53:30.000Z",
          "Titre": "Fraudulent Company",
          "Contenu": "On my first claim with the company, I had a washing machine that was less than 3 years old. It had an internal seal that failed, allowing water to leak into the transmission, causing the appliance to fail. Home Safe claimed there was rust inside the appliance, as if that would be some kind of neglect on my part, and refused to pay. After dealing with several people and managers in the company, I was eventually able to get them to pay the claim. I should've canceled then, but I foolishly stuck with them.A few months later, my water heater went out. The claim was submitted on a Saturday, and I was able to get the plumber out that same day. I found the plumber, not Home Safe. The estimate was submitted that evening. I received an email asking for more information on Monday, which was promptly responded to and sent in that same day. Their own policy is to approve the claim within 24 to 48 hours. I never heard back from anyone, so I called back several times over the course of the workweek. I was told the adjuster had either left early or had not come into work yet. When the adjuster finally called me on Thursday just before 5 pm, he actually straight up lied to me. He told me that he had requested additional information on Monday after receiving my email. He said he left a voicemail with me and the plumber. Neither one of us had any missed calls from the adjuster. He said he needed to know what caused the tank to rupture and precise pictures of the crack in the tank showing the leak. Anyone who knows anything about a water heater knows that once the tank ruptures, no plumber in their right mind would attempt to disassemble the water heater and repair the leak or determine where exactly it cracked. But that is exactly what the adjuster at Home Safe expected to happen. He said that without a reason why the tank ruptured and precise pictures of the leak location, he could not approve the claim. This is not unlike the power company asking me why did lightning strike the transformer down the street and cause your power outage? Were you able to get pictures of the lightning striking the transformer at that precise moment in time?30 Oct 2023 We have worked out a mutual settlement agreement. The details of which I am not allowed to share."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "YOLANDA",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T22:41:31.000Z",
          "Titre": "To pay claims in a timely fashion and on the spot in an emergency situation!!!@@",
          "Contenu": "To pay claims in a timely manner and in a emergency situation prior to 24-48 hrs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Billy Stubbs",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T19:57:55.000Z",
          "Titre": "chk your recorded line."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T20:46:39.000Z",
          "Titre": "Cancelled subscription."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "clifford oliver",
          "Nb_Reviews": 4,
          "Date": "2023-10-05T00:35:30.000Z",
          "Titre": "Not good............................"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Margarita  Fonseca Philbrick",
          "Nb_Reviews": 2,
          "Date": "2024-01-04T04:24:53.000Z",
          "Titre": "Didn't want to paid at all the repairs I just waiting my money paid honesafe",
          "Contenu": "Didn't want to listen about the claim send all the pictures they request and they even send a plumer to check it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill Wolfe",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:22:46.000Z",
          "Titre": "As I said before",
          "Contenu": "As I said before, the representative that handled my call was excellent and most helpful but, the fact that I have to wait maybe another week to have my leak in my shower repaired isn’t something I am happy about. I thought I call and explain my problem and I then call a service person to come and fix the problem when he comes, but I have to wait for a estimate from him submitted to your company for approval first is not something that makes me happy. I pay you monthly than another $65. To wait for my  shower to be repaired. When I call for service I am wanting the repairs to be completed at that time and not to make another appointment for service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "HARRIS",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T02:33:50.000Z",
          "Titre": "Unhappy Client.",
          "Contenu": "Was given the run around about plumbing getting covered. Estimator came out, took pictures. Never heard back from anyone but homeSafe made sure they took out my monthly payment on time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Li Zheng",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T18:28:42.000Z",
          "Titre": "I had the original part from the…",
          "Contenu": "I had the original part from the manufacturer and your company refused to pay the claim so I cancelled your plan. Simple as that!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PATRICE ROBERTS",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T12:26:53.000Z",
          "Titre": "going through the barrage of candidates…",
          "Contenu": "going through the barrage of candidates trying to find someone compatible to work with you was a deal breaker for me"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BRYAN",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T03:55:20.000Z",
          "Titre": "Having a middle man between my request…",
          "Contenu": "Having a middle man between my request and completing the job. Lots of leg work and took almost a month for my problem to be fixed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Cafazzo",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T21:42:03.000Z",
          "Titre": "You denied payment on accessories that makes my air conditioner work so that it shut down before it freezes up and requires a large repair bill.",
          "Contenu": "You denied payment on an assoss"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sally",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T04:39:25.000Z",
          "Titre": "Carshield collections very aggressive.",
          "Contenu": "Credit card used to pay monthly fee compromised. Homesafe asked to delay due until new card issued. Reluctantly agreed and commenced to send multiple reminders daily. Within a week payment was made and harassment was stopped. However they did no t cancel account as threatened."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KathyB",
          "Nb_Reviews": 5,
          "Date": "2023-11-28T23:32:13.000Z",
          "Titre": "HomeSafe did not cover a pending repair…",
          "Contenu": "HomeSafe did not cover a pending repair that will be needed in a few years.  I found another vendor that DOES cover this type of repair on the heat exchanger."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hugh Matthias",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T01:11:46.000Z",
          "Titre": "Not enough info on companies used",
          "Contenu": "A little no information as to worker/companies that you use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "debra rocke",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T05:07:16.000Z",
          "Titre": "My claim has not been resolved yet!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BROWN",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T20:14:44.000Z",
          "Titre": "Mixed reviews",
          "Contenu": "You all have paid and closed out 2 different incidents but yet to send us our $65 each incident for the reimbursement of part of the initial diagnosis. Definitely unhappy about the one decision not to pay anything towards the washer diagnostics review."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JADELYN",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T02:53:42.000Z",
          "Titre": "One of your agents was able to help me",
          "Contenu": "One of your agents was able to help me, but they had the wrong appliance. Place the second agent did not want to help me at all. The third agent helped me a little bit, but did not give me an appliance place."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PENNY",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T05:07:15.000Z",
          "Titre": "You advertised",
          "Contenu": "You advertised. A free month but your salesperson didn't mention it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AFSF05",
          "Nb_Reviews": 9,
          "Date": "2023-12-02T03:16:12.000Z",
          "Titre": "Customer Service …",
          "Contenu": "I keep getting this request but I don't recall having a recent interaction with Home Serve.   Anyway we are pleased with Home Safe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Fox",
          "Nb_Reviews": 2,
          "Date": "2023-12-30T21:02:14.000Z",
          "Titre": "I'm new but great customer service",
          "Contenu": "I'm new have not used the services yet"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Violet Hardy",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T06:27:48.000Z",
          "Titre": "Rememberence",
          "Contenu": "I didn't have to wait for only a second for the answers to my question and the situation was solved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NAOMI",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T00:23:58.000Z",
          "Titre": "The first time my agent was amazing and…",
          "Contenu": "The first time my agent was amazing and was all and my best insterest and stay in touch. This is the  secound time and I never head from any agent, and all the services was not cover without an explanation from carshield."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T02:55:11.000Z",
          "Titre": "Quick Review",
          "Contenu": "I am interested in the services of this company and I pray they are as good as I was told. The timing was horrible,  but I am believing that the services will be wonderful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ODELLA LEE",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T00:36:08.000Z",
          "Titre": "My first experience was not very…",
          "Contenu": "My first experience was not very good,because it not completely explain about the process you need to do prior to having the work done. So I paid for for my repairs. Now I what to do.              Thank You          Odella Lee"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Geiger",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T23:59:57.000Z",
          "Titre": "I have not yet had need for the service…",
          "Contenu": "I have not yet had need for the service however i am only commenting on the people i worked with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "williamp boffa",
          "Nb_Reviews": 5,
          "Date": "2023-11-21T22:18:05.000Z",
          "Titre": "After initial resistance and multiple…",
          "Contenu": "After initial resistance and multiple exchanges, HomeSafe honored the contract as expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clintell Washington",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:08:02.000Z",
          "Titre": "It was the courtesy of the people that…",
          "Contenu": "It was the courtesy of the people that assisted me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig Shogren",
          "Nb_Reviews": 3,
          "Date": "2023-10-02T22:26:05.000Z",
          "Titre": "Do you supply periodic reports",
          "Contenu": "Do you supply periodic reports? If yes how often."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Mora",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T15:14:12.000Z",
          "Titre": "Customer response",
          "Contenu": "Customer service thus far very responsive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GREGORY CONRAD",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T06:57:33.000Z",
          "Titre": "Nice",
          "Contenu": "The girl was very nice and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pearletha Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-12-31T15:26:51.000Z",
          "Titre": "The representative was very…",
          "Contenu": "The representative was very Professional understanding.  I called to change my automatic payment card account last 4 numbers because I had been Scam.  The representative added my updated account and ask me would I like to make my payment early.  I was very relieved because I didn't want the company to try to withdraw from a account that the last 4 number had been change and have problems processing it.  Thank to that kind caring understanding representative for taking care of Mt problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellen Hollender",
          "Nb_Reviews": 1,
          "Date": "2023-12-26T01:05:45.000Z",
          "Titre": "The rep was very pleasant",
          "Contenu": "I'm just joining but as far as the reviews goes it seems like this is what I'm looking for in case I need any home repairs.You have a choice to call someone out for a repair or contact homesafe I choose letting them to send someone out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Cooper",
          "Nb_Reviews": 3,
          "Date": "2024-01-01T03:16:56.000Z",
          "Titre": "Customer service",
          "Contenu": "Customer serviceIt would be helpful if yo spell my last rightDavila"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucille Gordon",
          "Nb_Reviews": 1,
          "Date": "2024-01-03T22:57:17.000Z",
          "Titre": "The individual that I spoke to was very…",
          "Contenu": "The individual that I spoke to was very though and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAMES",
          "Nb_Reviews": 2,
          "Date": "2023-12-31T05:09:03.000Z",
          "Titre": "I have only had Home Safe for a short…",
          "Contenu": "I have only had Home Safe for a short time and I have not had to use it yet . Everything in my house is working fine so if I ever have to use it then I will know more of how to write the experience I had . Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron McClure",
          "Nb_Reviews": 3,
          "Date": "2023-12-28T14:57:22.000Z",
          "Titre": "It was very easy to update my records",
          "Contenu": "It was very easy to update my records. I called the telephone number and the Customer Service Rep took care of everything! It was nice to speak with a real person!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beverly Mitchell",
          "Nb_Reviews": 2,
          "Date": "2023-12-23T02:36:12.000Z",
          "Titre": "Customer service the knowledge of the…",
          "Contenu": "Customer service the knowledge of the representative and patience. so far I have not had to call for any repairs, to see if they are true to there word."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "emily english",
          "Nb_Reviews": 4,
          "Date": "2023-12-26T13:55:49.000Z",
          "Titre": "The people sounded like they Friendly and knowledgeable",
          "Contenu": "The people sounded like they were knowledgeable and friendly. They help me out when I needed to cancel the account. The price was too much for me to continue.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Mundras",
          "Nb_Reviews": 1,
          "Date": "2023-12-31T21:01:16.000Z",
          "Titre": "I was able to accomplish what I set out…",
          "Contenu": "I was able to accomplish what I set out to accomplish"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Viola Sharpe",
          "Nb_Reviews": 3,
          "Date": "2023-12-22T17:15:48.000Z",
          "Titre": "You responded quickly to my need for my…",
          "Contenu": "You responded quickly to my need for my garage not opening. You gave me the steps fir the process. However, I did not have to use your service. It was off track & the co. did not charge me & just said Merry Christmas!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Moore",
          "Nb_Reviews": 2,
          "Date": "2023-12-30T15:09:57.000Z",
          "Titre": "…good job",
          "Contenu": "The agent on the phone did a very good job of explaining the program."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katheryn Williams",
          "Nb_Reviews": 4,
          "Date": "2023-12-24T02:45:54.000Z",
          "Titre": "I am satisfied with the outcome of my…",
          "Contenu": "I am satisfied with the outcome of my payment for the claim filed on the property."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wilhelmina Pace",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:12:36.000Z",
          "Titre": "I don't  know  yet I was informed by…",
          "Contenu": "I don't  know  yet I was informed by AEP that they will no longer do it so they told me to call homesafe I trust in your company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Pattillo",
          "Nb_Reviews": 4,
          "Date": "2023-12-31T18:07:57.000Z",
          "Titre": "Homesafe has a reasonable rate",
          "Contenu": "Homesafe has a reasonable rate! I have not used it yet but I have it in case I need it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda DePaula",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T16:48:46.000Z",
          "Titre": "WE LOVE HAVING HOMESAFE",
          "Contenu": "WE LOVE HAVING HOMESAFE. WHEN WE CALLED THEY WERE EVERY UNDER STANDING. IT IS NICE TO KNOW THAT WE CAN GET THINGS REPAIRED ON OUR HOME AND NOT WORRY ABOUT WAITING UNTIL WE HAVE THE MONEY. WE ARE ELDERLY AND DIABLED AND THIS WORKS WONDERFUL FOR US."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RON",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T05:51:40.000Z",
          "Titre": "Ha how to have a problem solved a problem with the air conditioner…",
          "Contenu": "Had a problem with the air conditioner called you guys up finally got somebody to do the work since you guys in the estimate and everything was hunky dory from there thank you home safe"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy A Whalen",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T14:27:27.000Z",
          "Titre": "Customer website would be nice",
          "Contenu": "The agent answered my questions however I wonder if there is a website where we can logon to and view our policies and to make claims if we have to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Foster",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:18:06.000Z",
          "Titre": "It was very easy to get a real person…",
          "Contenu": "It was very easy to get a real person in customer service. Forest was very friendly and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy H.",
          "Nb_Reviews": 1,
          "Date": "2023-12-28T23:11:11.000Z",
          "Titre": "New Customer Experience",
          "Contenu": "Services were explained to my satisfaction allowing me to make the decision to enroll in the company feeling comfortable and confident."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gloria Mikula",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T20:01:48.000Z",
          "Titre": "Prompt and knowledgeable",
          "Contenu": "When I have had to call for repairs everyone has been so helpful and prompt.  The staff is very informative and very nice on the phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hubert Bagley",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T20:27:24.000Z",
          "Titre": "Great friendly service",
          "Contenu": "Great friendly service. Very helpful kind and courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica Finnell",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T10:36:36.000Z",
          "Titre": "I just called them with a question &…",
          "Contenu": "I just called them with a question & everything is fine. I haven't use the service yet, but it seems like a good home warranty so it's giving me peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barton Daigle",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T14:38:03.000Z",
          "Titre": "You cover everything that is important…",
          "Contenu": "You cover everything that is important that needs to be covered in the house. Thank you for your good work and for your coverage of my home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Saint Dobie Jr",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T16:54:06.000Z",
          "Titre": "I have not use it for any repairs.",
          "Contenu": "I have not use it for any repairs. The rate I gave is based on what home safe climb to do. I hope that they do what they climb. Once I file a climb then I can give a honest opinion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Carrethers",
          "Nb_Reviews": 2,
          "Date": "2024-01-02T23:17:02.000Z",
          "Titre": "Great customer service",
          "Contenu": "The customer service I was excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annie Coley",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T21:34:58.000Z",
          "Titre": "The Customer Service is very good.",
          "Contenu": "My experience with HomeSafe is that my monthly premiums are fixed to my income as a Senior, and affordable.  I don't have to go out and pick out appliances and have them delivered.  The customer service has been great, and it doesn't take long for my replacement or repairs to take long to complete."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy James",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T00:37:32.000Z",
          "Titre": "Great Service",
          "Contenu": "The customer service rep., she explained everything and listened to my concerns. Thank you for everything and this survey.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SANDRA EILAND",
          "Nb_Reviews": 4,
          "Date": "2023-10-04T20:59:43.000Z",
          "Titre": "Follow up was a little slow/only for a few days.",
          "Contenu": "Follow up was a little slow, however, plumbers have a heavy schedule.  K&S Plumbing came and noted the pipes were needing attention.  An appointment was setfor Thursday, Oct. 08."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WOODWARD",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T00:54:27.000Z",
          "Titre": "I'm in love with my new washer My old…",
          "Contenu": "I'm in love with my new washer My old one could not be fixed they are great you guys help me in so many ways I will recommend this company to everyone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JACQUELINE",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T18:32:03.000Z",
          "Titre": "you are not helpful with the elderly in…",
          "Contenu": "you are not helpful with the elderly in providing the the help they need I put in to get my stove fixed and I still am waiting on some one to help find somebody to fix it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel Henshon",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T18:39:17.000Z",
          "Titre": "so far I had to find my own service…",
          "Contenu": "so far I had to find my own service provider, but your response to my claim was very good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Temika Gettys",
          "Nb_Reviews": 4,
          "Date": "2023-10-09T19:33:18.000Z",
          "Titre": "I haven't had use it yet however",
          "Contenu": "I haven't had use it yet however, the professionalism of your staff is amazing always there to assist when I have a question.  Keep up the great work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:43:16.000Z",
          "Titre": "I like to set up you set up with other…",
          "Contenu": "I like to set up you set up with other companies to get the job done and also maybe you can have the guy that fixes things have a little bit more computerized stuff that's going through their phone for signing and paying and when we signed we have our rebate automatically sent back to us but everything else is great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ralph W Simek",
          "Nb_Reviews": 3,
          "Date": "2023-10-17T14:41:28.000Z",
          "Titre": "The ease of signing up was great 👍",
          "Contenu": "The ease of signing up was great 👍. The agent that I spoke with was knowledgeable and she was able to give me answers to all of my questions ( all with reasons for signing up now)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Penny",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T10:48:30.000Z",
          "Titre": "Very helpful and explained very well",
          "Contenu": "Very helpful and explained very well.  I would like to have a copy of the contract emailed to me so I can download on my computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald Landman",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T13:45:43.000Z",
          "Titre": "When the time comes.",
          "Contenu": "I haven't needed to use Home Safe as of yet, but we used Car Shield. If Home Safe will be as good as Car Shield we will be In good hands. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-10-10T01:12:36.000Z",
          "Titre": "Main issue was that no one would accept…",
          "Contenu": "Main issue was that no one would accept Armis. We had to pay upfront but we were reintroduced. Thank goodness we had enough to pay"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PARAMORE, SYDNEY",
          "Nb_Reviews": 3,
          "Date": "2023-10-10T22:59:52.000Z",
          "Titre": "We had a freezer stop working and they…",
          "Contenu": "We had a freezer stop working and they approved very quickly to have someone come and look at it. The first repair was approved and paid in a good timely matter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TOM MYRON",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T20:19:49.000Z",
          "Titre": "Aent helpful",
          "Contenu": "Agent was very helpful.  Very nice and patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JUSTICE",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T20:48:45.000Z",
          "Titre": "They are a good good company",
          "Contenu": "They are a good good company. I enjoy being with them, so always there to help answer any questions you might have and I love being with him. Thanks, LJ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carole Reilly",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T06:27:59.000Z",
          "Titre": "Cancelation.my person I spoke to was very helpful…",
          "Contenu": "The person I spoke to was very helpful and understanding about my problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis Swain",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T10:03:11.000Z",
          "Titre": "The adjuster was very professional and…",
          "Contenu": "The adjuster was very professional and prompt. In and out in no time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Brown",
          "Nb_Reviews": 3,
          "Date": "2023-10-09T19:39:07.000Z",
          "Titre": "Just signed up so I have no personal…",
          "Contenu": "Just signed up so I have no personal experience to report as yet and frankly I hope I never will."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ENOS",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T23:58:09.000Z",
          "Titre": "I received the services I needed and…",
          "Contenu": "I received the services I needed and payment was made at time of service which helped things go smoothly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esther Hicks",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T20:50:49.000Z",
          "Titre": "One Happy Customer",
          "Contenu": "Whenever I put the claim in they responded and told me what to do. I called a plumber and Homesafe took care of everything. I would recommend Homesafe to anyone. If you join Homesafe you will not be sorry. It pays off in the long run."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T22:43:47.000Z",
          "Titre": "Representative was kind and patient in…",
          "Contenu": "Representative was kind and patient in resolving my issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ZULEMA",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T09:10:51.000Z",
          "Titre": "wait on then they will fix the heater",
          "Contenu": "wait on then they will fix the heater ,you are on top of it that is great and fast on respond Thankyou"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHRISTINE L ESTEVES",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T18:42:25.000Z",
          "Titre": "Professional",
          "Contenu": "Professional. Let me take care of my problem with the air conditioner immediately with my company.  They reimbursed me promptly of the difference of my deductible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SUPINSKI JR",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T21:43:00.000Z",
          "Titre": "The ease of filing the claim as well as…",
          "Contenu": "The ease of filing the claim as well as the courteous professional people working there"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carmelo Bascetta",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T22:26:22.000Z",
          "Titre": "service representative…",
          "Contenu": "Your customer service representative provided information necessary fore to determine the best course of action on how to resolve my issue. Not sure about the date."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beverly Hensley",
          "Nb_Reviews": 1,
          "Date": "2023-12-27T21:56:24.000Z",
          "Titre": "Very helpful and very professional"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RENDA HARWELL",
          "Nb_Reviews": 6,
          "Date": "2023-12-17T03:49:09.000Z",
          "Titre": "Ease of speaking with Representative",
          "Contenu": "Ease of speaking with Representative,  all questions answered, respectful,  friendly and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela Shaw",
          "Nb_Reviews": 5,
          "Date": "2023-10-09T22:02:13.000Z",
          "Titre": "the young lady who handled my call…",
          "Contenu": "the young lady who handled my call today was knowledgeable, professional & extremly helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roberta Surette",
          "Nb_Reviews": 25,
          "Date": "2023-10-12T21:47:17.000Z",
          "Titre": "Your company is the best you give me…",
          "Contenu": "Your company is the best you give me the right kind of people and the job gets done. I couldn’t ask for anything better thank you.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Barnett",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T00:59:34.000Z",
          "Titre": "The rep was able to help me right away",
          "Contenu": "The rep was able to help me right away. Explain the process &why. Very polite too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MONTGOMERY",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T17:27:40.000Z",
          "Titre": "It was a conversation about checking to see about my account.",
          "Contenu": "I haven’t had to use my account as yet.  I’ll know more when something breaks or stops working and I have to call them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Harwell",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T01:13:35.000Z",
          "Titre": "Taking care of their customers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Donovan Sr",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T20:18:04.000Z",
          "Titre": "I got to talk to a real person."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Horace Privette Jr.",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T21:06:08.000Z",
          "Titre": "Fast work",
          "Contenu": "Fast work , nice customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula Gerrol",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T03:51:01.000Z",
          "Titre": "Answered all my questions",
          "Contenu": "Answered all my questions. Had good manners. Made me feel safer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAMES",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T11:52:02.000Z",
          "Titre": "Home safe",
          "Contenu": "Home safe Handle our claim with little trouble they took care of us Didn’t have to jump through hoops to file and get our check. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHRISTINE L ESTEVES",
          "Nb_Reviews": 3,
          "Date": "2023-11-26T22:16:47.000Z",
          "Titre": "Professional and easy to work with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAWN Wilkins",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T02:07:16.000Z",
          "Titre": "Quick turnaround",
          "Contenu": "Quick turnaround! I made a claim, adjuster came a few days later, check was in the mail. New Roof Complete! It was truly that simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BACOT",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T14:46:44.000Z",
          "Titre": "Haven't had to use you yet",
          "Contenu": "Haven't had to use you yet.  hopefully won't have to ever need you.  But,  if I do, will expect first class work, etc.KATHLEEN"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Flakester",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T02:40:59.000Z",
          "Titre": "They were easy to contact and Updated…",
          "Contenu": "They were easy to contact and Updated my file quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-30T15:46:46.000Z",
          "Titre": "Thanks for everything"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Clark",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T07:09:26.000Z",
          "Titre": "Everything was perfect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis Pedraza",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:53:59.000Z",
          "Titre": "Great service",
          "Contenu": "Great service! Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Hewitt",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T23:44:23.000Z",
          "Titre": "Things were explained in detail"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T14:19:51.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHERYL",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T20:44:51.000Z",
          "Titre": "Ability to choose an experienced…",
          "Contenu": "Ability to choose an experienced contractor and direct payment to the contractor makes this a win win"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ANNIE PENN",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T23:54:10.000Z",
          "Titre": "Listen to your issues and very good…",
          "Contenu": "Listen to your issues and very good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T18:44:22.000Z",
          "Titre": "The response was quick and easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T23:10:00.000Z",
          "Titre": "was very impressed w/Jennifer and her…",
          "Contenu": "was very impressed w/Jennifer and her ability to be understood and informative helpful suggestions a true asset to your corporation"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "telshirley",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T17:47:24.000Z",
          "Titre": "Everyone was very knowledgeable and…",
          "Contenu": "Everyone was very knowledgeable and kind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny BOHANNON",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T13:08:58.000Z",
          "Titre": "Fast and easy very polite and good job"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BETTY STOVER",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T18:37:07.000Z",
          "Titre": "very helpful",
          "Contenu": "the man i talked was very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melvin Davis",
          "Nb_Reviews": 3,
          "Date": "2023-12-31T19:21:41.000Z",
          "Titre": "Very professional"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beverly Sexton",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T16:13:01.000Z",
          "Titre": "have use youall yeat"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LH",
          "Nb_Reviews": 3,
          "Date": "2023-10-02T20:26:04.000Z",
          "Titre": "Still working on this project =)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Meyers",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T22:10:47.000Z",
          "Titre": "Courteous done in a timely manner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oliver Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-12-28T21:45:47.000Z",
          "Titre": "Refrigerator  repair"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hobert Harden",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T22:34:04.000Z",
          "Titre": "All questions were answered and I was…",
          "Contenu": "All questions were answered and I was happy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Desena",
          "Nb_Reviews": 3,
          "Date": "2023-10-10T17:25:50.000Z",
          "Titre": "A quick response to my request",
          "Contenu": "A quick response to my requestThank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Green",
          "Nb_Reviews": 2,
          "Date": "2023-12-27T18:00:33.000Z",
          "Titre": "Very professional"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T01:00:39.000Z",
          "Titre": "Customer service Jason was very helpful…",
          "Contenu": "Customer service Jason was very helpful polite and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Virginia",
          "Nb_Reviews": 16,
          "Date": "2023-10-02T21:06:04.000Z",
          "Titre": "The person on the phone was very nice…",
          "Contenu": "The person on the phone was very nice and handled everything.   Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LINDA",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T20:39:33.000Z",
          "Titre": "Well the payment amount is very cheap…",
          "Contenu": "Well the payment amount is very cheap which is good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betsy Finch",
          "Nb_Reviews": 5,
          "Date": "2023-11-22T03:56:20.000Z",
          "Titre": "I like it a lot, I am glad I have your service.",
          "Contenu": "I like it a lot. Every one is so nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GARRETT",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T14:32:18.000Z",
          "Titre": "Service",
          "Contenu": "Very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2023-10-03T01:53:55.000Z",
          "Titre": "No hassle",
          "Contenu": "No hassle.  Prompt payment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T06:44:36.000Z",
          "Titre": "The female representative was…",
          "Contenu": "The female representative was outstanding"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curtis Mayfield",
          "Nb_Reviews": 3,
          "Date": "2023-10-02T23:02:55.000Z",
          "Titre": "Service was fast and easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T03:36:47.000Z",
          "Titre": "You were great Thank you!",
          "Contenu": "You were great! Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hector G",
          "Nb_Reviews": 3,
          "Date": "2023-10-11T22:03:16.000Z",
          "Titre": "customer service answered my questions…",
          "Contenu": "customer service answered my questions satisfactorily!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Sawyer",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T00:44:44.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "Great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edna Myatt",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T19:45:13.000Z",
          "Titre": "not at this time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gertrude Rosalyn Logan",
          "Nb_Reviews": 5,
          "Date": "2023-10-21T03:23:16.000Z",
          "Titre": "Excellent Customer Service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T21:08:54.000Z",
          "Titre": "The overall plan and cost.",
          "Contenu": "Communication, integrity, honesty!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blondena",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T02:59:19.000Z",
          "Titre": "Customer service",
          "Contenu": "Customer service.  Excellent"
        }
      ]
    }
  ]
}