{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "hubstaff.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Lucas",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:51:26.000Z",
          "Titre": "hubstaff its crashing on linux",
          "Contenu": "hubstaff its crashing on linux, you dont support wayland and every time that a screenshoot its taken all my work its stoped and have this sound of a picture being taking. maybe you should be clear and say that your product its not working on linux"
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "NOT TRACKING",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T15:51:45.000Z",
          "Titre": "hahahahah your live chat person…",
          "Contenu": "hahahahah your live chat person promised me they would look into why my staff members apps were not tracking her hours and your customer service team would email me, well I got no email, no follow up, soo I CANCELLED YOUR SERVICE after many years of using it, goodbye there are many other options soo I'm not gunna miss your overpriced system!"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Ibrahim Zahoor",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T20:05:28.000Z",
          "Titre": "Hubstaff support is worst",
          "Contenu": "I have been using Hubstaff from 3 years now, I have reported a bug 2 months earlier which was with clickup integration. I have been struggling since 2 months with the support to fix that but finally I also found out whats gone wrong and how it can be fixed but I'm not getting any positive response from support."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Kashyap",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T20:30:39.000Z",
          "Titre": "Hubstaff Need To Update Payment Policy…",
          "Contenu": "Hubstaff Need To Update Payment Policy !I Work For White Meridian Company For 1 Week and At Payment Time Company Owner (Avneesh Mishra) Kicked Me Out And Shared $469 Payment Invoice (3 Days Before Kick Me Out)But Payment Not Received In My Account, My Total Payment Is $1200 And Hubstaff Support Is Not Helping Me On This.And My Company Owner Blocked Me From Every PortalHow Payment Invoice Is Paid Without any Transaction Id ? How Can I Track This Transfer? And Who Will Help Me On This ? Company Scammed Me And Other 5-6 Candidates l. Hubstaff Not There For My Payment Issue. ( They Say Organisation Owner Is Authorised For This ) So How Can Anyone Work Or Recommend This Platform Without Any Security !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cadebra",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T15:49:43.000Z",
          "Titre": "Very disappointed!!!",
          "Contenu": "For more than a week, I have been unable to work because of a technical issue with my time tracking app, and they are unable to fix it. They also do not have a timeframe for when the issue will be resolved."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Ekaterina Reyzbikh",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T23:08:32.000Z",
          "Titre": "I've had a deeply unsettling experience…",
          "Contenu": "I've had a deeply unsettling experience with this application. Despite clear terms, I was charged an amount surpassing what was agreed upon. When trying to address the issue, it seemed like the support system is designed to deflect rather than assist. While I eventually reached a higher-level manager, the ordeal shed light on potentially deceptive billing practices that I believe are aimed at extracting more money from users. For small businesses, like mine, trust is paramount. It's disappointing to see corporations resort to such tactics. Users deserve transparency and respect, especially when it comes to billing. I'd advise potential users to be wary."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Fisher",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T08:20:24.000Z",
          "Titre": "It's a Corporate. Run Away!!",
          "Contenu": "Customer support at its worst.Never once I've come across a company that \"acts\" like they care, but in reality they tell you to Bug off.They don't give a damn about the terrible experience you face with the product, especially the billing.There are far better products out there. Stay Away."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Paresh Thummar",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T07:16:02.000Z",
          "Titre": "Worst customer care experience and policy",
          "Contenu": "I purchased a subscription service and I have been using service last 10 months for my organization.I have recharged my organization account for 1 year after discussing it with their customer care executive.After completing 3-4 months they charged me $391 automatically. I contacted them and they told me there was some mistake on their end and refunded me. Meanwhile, I have to suffer a currency conversion charge from my bank due to their technical fault and they refused to cover the lossNow I do not want to continue this service and want a refund remaining amount of 2 months.They denied it and told me it was not possible. they did not clarify it when I was subscribing. they are forcing me to consume balance by using their service.and the worst thing is that they reply after 4-5 days on every query. I have been discussing this for the last 20 days and they have not properly responded."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T23:22:29.000Z",
          "Titre": "*ZERO* Accountability Across Customer Service Team",
          "Contenu": "I contacted Christopher McHale (T1 Support) from Hubstaff back in June 2023 to disable billing for 4 old accounts that weren't being used. After quite a bit of back-and-forth emails, the issue was resolved, with all 4 accounts being disabled.Fast forward to September 2023, I found out that these 4 old accounts were reinstated as billable Users, despite manually downgrading each account to non-billable Project Viewers. I tried following up with McHale to understand what went wrong, even though this was resolved back in June. He responded with vague details about Hubstaff moving me from an old plan to a new billing structure, despite never giving authorization to be moved to a new plan on my account. After this email, I never heard from McHale again, even after following up with him in 4 separate email threads.I don't think it's my job to chase after a support representative to respond to my emails, so I emailed Jared Brown (CEO). Brown acknowledged my issue and informed me he would look into my billing issue internally before getting back to me. As I'm writing this, 12 days have passed since I received Brown's last email thread (October 16).The conclusion I've reached is that this is a company with ZERO accountability across internal departments. They're quick to send you templated email sequences about product features and add-ons, but they will absolutely turn their back on you if you have a genuine concern about your account."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Michaela",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T00:42:03.000Z",
          "Titre": "Terrible experience",
          "Contenu": "This experience with Hubstaff is terrible. First, there was a problem with Pay, and now there's an issue with verification. I had already received my payment, and now they are asking to verify my account again. I don't know what's going on. Fortunately, I have PayPal as an option, so I can request my pay to be sent there."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Manos Seferidis",
          "Nb_Reviews": 7,
          "Date": "2022-06-03T11:41:29.000Z",
          "Titre": "Experienced freelancers look elsewhere",
          "Contenu": "Your profile gets accepted when copy/pasting content with poor grammar and errors from other freelancers' profile. However when you try to edit your About Me page to reflect your actual skills and background, it gets rejected.No support whatsoever. So you have to make guesswork and hope someone in India will accept what you've written even if that person has no clue about your industry."
        },
        {
          "Note": 1,
          "Lieu": "TW",
          "Pseudo": "Paul Gallagher",
          "Nb_Reviews": 4,
          "Date": "2023-05-15T07:40:52.000Z",
          "Titre": "I used Hubstaff for about 3 months, but got billed for 2 years.",
          "Contenu": "I tried using Hubstaff for a while, but it was very confusing to use. Difficult to get useful reports, etc. So we stopped using. We disabled tracking on all employees. Fast forward 18 months and accounting noticed we are still being billed monthly even though the account is inactive. In order to stop billing, you need to completely \"archive\" the company. Which means, you lose access to ALL the data you had tracked. So, you need to keep every employee, past and present on the Hubstaff plan, at $7/month indefinitely in order to keep the data history. Really sketchy way for Hubstaff to make money."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Mohamed Azzam",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T08:47:25.000Z",
          "Titre": "They have suspended our account because…",
          "Contenu": "They have suspended our account because of a mistake in their billing  system even though all payments were processed, one payment failed and in retry, it workedafter the payment was processed the account was still \"Suspended\" and asked for updated payment info!the card is working, updating the payment multiple times but the account is suspended, and their support takes more than a day to responseour remote employees stopped logging time for two days and we have to search for another alternative till they activate the account I think it is not reliable and they are not taking the businesses stability seriously"
        },
        {
          "Note": 1,
          "Lieu": "UZ",
          "Pseudo": "Aziza Israilova",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T07:45:26.000Z",
          "Titre": "There have been so many issues with the…",
          "Contenu": "There have been so many issues with the payment and their support. We have been billed for some other stuff besides subscription. When I asked why, they couldn't explain. I reached support several times. Even after paying the bills the account was not activated. It was an awful experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T15:26:18.000Z",
          "Titre": "This place has awful management and…",
          "Contenu": "This place has awful management and customer service. Igor, Zach, Patryja are all awful people to speak to. please use a different system where your needs are actually taken care of. Really wanted to use this system but the customer service is awful. Ogbe A was the only person who was helpful. He deserves a raise."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Nicolas Pépi",
          "Nb_Reviews": 25,
          "Date": "2023-08-24T16:24:28.000Z",
          "Titre": "Scam invoicing",
          "Contenu": "Even if you pay for a yearly plan, you may be charged again if they decide to upgrade plans.They keep on adding features that we don't need and don't ask for, and then charge us for them.I've been charged for members that left.Hubstaff is a real scam.There are other similar services around, please check!!!"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Shae Robinson",
          "Nb_Reviews": 7,
          "Date": "2020-09-17T20:47:19.000Z",
          "Titre": "SCAMMY SOFTWARE!",
          "Contenu": "Worst ever thing developed only to eat employees salaries and wages. I don't know who are the evil minds behind its creation. This software hangs up in the middle of work. Takes no screenshot when you work, and your employer keeps barking at you that we are deceiving and chilling in all those hours. When we check it, its actually crashed.so whos fault is it?the employee who is continuously working for hours in trusting this software that it is recording its work?the evil employer who want to micromanage every single click of their workers?Or this scammy software makers?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CJG",
          "Nb_Reviews": 4,
          "Date": "2022-08-12T16:34:53.000Z",
          "Titre": "There members area is constantly down",
          "Contenu": "There members area is constantly down.  Like literally down right now. You know, the thing that we pay money to access?  The order page is working fine though of course.  Hubstaff doesn't care about it's customers.  Look for another platform."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joey",
          "Nb_Reviews": 2,
          "Date": "2023-04-15T18:29:06.000Z",
          "Titre": "This company is a scam",
          "Contenu": "This company is a scam, o never used their service yet was charged over a year. I asked for a refund which took over a week to receive an answer and was only refunded 1 month for service I never used or done anything with. No one to talk to over the phone and lack of staffing is terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karlen Paset Kleinkopf",
          "Nb_Reviews": 2,
          "Date": "2019-10-02T04:57:39.000Z",
          "Titre": "Deceiving pricing practices - DO NOT RECOMMEND!",
          "Contenu": "We have been using Hubstaff since 2015; their pricing practices are deceiving, as they charge per user; however, we did not realize that their pricing is NOT dynamic.  You choose a plan and then you pay for that number of users whether or not you even have that many active or even inactive users in your system.  We originally had 15 users, but that was years ago.  We only had 8 active and were still paying for 15 users for the last couple years.  If you use Hubstaff, be sure to monitor your plan closely.  They refused to refund our overpayment."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Samuel",
          "Nb_Reviews": 2,
          "Date": "2019-10-11T19:27:19.000Z",
          "Titre": "1984 in 2019",
          "Contenu": "I work remotely because I don't like the constrictive work environment. Now there's a service to bring the horrors of the modern office to your home - Hubstaff.The software works fine for what it is. But goddamn guys, you dun goofed it for all of us. Thanks (I'm positively soaked in sarcasm)."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Gonçalo",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T13:07:14.000Z",
          "Titre": "Just horrible, taking a step back in human rights",
          "Contenu": "The app is super intrusive and leads me to be less productive. I don't eve think it complies with confidentiality law as it will just randomly take a screenshot of my whole screen. I use my personal whatsapp a lot for work so if a personal message pops up there you go it might take a screenshot and send it to the company I am working for. Really awful software - one of the worst experiences I have ever had using a digital product."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "rc",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T00:42:08.000Z",
          "Titre": "Inhumane Application",
          "Contenu": "This is the saddest application I have ever encountered in my whole life, your work is basically based on how you click the keys and how you move your mouse pad. It is an anti-employee system, it does not give you time to rest, read, write, etc. There were times that I have to read and jot down notes because by nature of my work, I have to do it, suddenly it was not tracked because I wasn't \"active\" for the app and said it was idle. I only have at least a total of allowable 8 hrs to work, and the accumulated hours I need to review work is 3 hours, imagine how 3/8 of your work just passed uncompensated because of this application as me being idle, which is not in reality. This is really sad, its features were so strict it forgot that humans were not robots. If you were a good employer and you wanted to keep your employees fine, please don't be like this app. Remember, your employees are your treasures, not the other way around. Be kind."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Hyring",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T08:26:26.000Z",
          "Titre": "Worst Support Team & Billing",
          "Contenu": "Worst Infrastructure. Servers go down and support is pathetic. They reply very vague and response time is very drastic. Card gets declined every now and then and they remove the discount plan as they like."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Susk Dick",
          "Nb_Reviews": 1,
          "Date": "2020-11-06T12:33:27.000Z",
          "Titre": "Worst thing that has happened to me in…",
          "Contenu": "Worst thing that has happened to me in a ten-year career! You're in luck if your employer isn't a nosy person)) who sticks his nose everywhere. I was less fortunate. Hubstaff is already an overkill, we are not slaves and companies must look at the results, and not delve into dirty laundry of its employees. I wish that your company will quickly come to fiasco and I belive that some good reason will apear soon. And also I wish you that many people around the world sue you. Cheers!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Princess",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T21:07:34.000Z",
          "Titre": "I'm having a bad experience with Hub…",
          "Contenu": "I'm having a bad experience with Hub staff. I try to work but I have no work. I contacted support and they told me to contact my manager or boss directly I have no idea how to do that. So I'm currently not able to work and earn money which is really stressing me out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sheiva",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T19:40:20.000Z",
          "Titre": "You cant cancel",
          "Contenu": "If I could give them a 0 I would. Good luck canceling with them. They make it impossible and then they still charge you. I wanted to cancel my subscription FOUR days before trial ended. No option to do it on their website. You have to contact them. When you do, ofc you dont get an immediate response. When you get a response, they still dont cancel it for you. They give a bunch of explanation and still ask you if you want to keep the plan! When you respond NO, by the time they cancel your plan, your subscription has gone through and they charge you for the whole year! This is absolute FRAUD! This type of business behavior should not be allowed!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Shadi",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T18:47:17.000Z",
          "Titre": "Moving to new S/W",
          "Contenu": "Testing the software for 4 months now. Issues with QBO, technical support have not addressed the issue. We are moving to a new SW."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chelsea",
          "Nb_Reviews": 1,
          "Date": "2019-10-20T20:15:31.000Z",
          "Titre": "I am very upset that Hubstaff was…",
          "Contenu": "I am very upset that Hubstaff was taking screenshots of my desktop without my consent. No where from the homepage to the point of downloading the app does it explicitly inform you that that is what it is doing. I only found out by chance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tara",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T18:46:12.000Z",
          "Titre": "I personally do not like using a timed…",
          "Contenu": "I personally do not like using a timed tracker at my job, but alas, it's what I have to do to stay employed."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Krunal Pandav",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T14:02:14.000Z",
          "Titre": "Such bed data management in hubs taff i…",
          "Contenu": "Such bed data management in hubs taff i was assign but it i was not get ticket in hubstaff windows application i loss my more then two hours."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Joyeeta Nag",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T17:48:08.000Z",
          "Titre": "This would be another follow-up email…",
          "Contenu": "This would be another follow-up email on the status of my payment. Tomorrow, I will speak to my bank and see if there are any delays on their end. However, I am a little disappointed with the entire turn of events. 1. Firstly, I had to live chat 3 times with 3 different people who gave me 3 different solutions and versions of issues causing this delay. 2. Secondly, I was told repeatedly that it will arrive by X date \"latest\" and it hasn't yet reached my account. Since I've been a user of my bank account for quite some time, I am very sure that any STRIPE payments or other gateways DO NOT take more than FIVE days to process any payment they receive. So now, I want a detailed explanation of what is going on and why I am constantly receiving false commitments when it's pretty clear that none of you have the slightest idea of what the processing time usually is. I have dealt with foreign clients throughout my career and I haven't faced such issues with ANY other platform. I will have to take action if I'm not sent:1. A detailed analysis of what went wrong with communication on your end. 2. Detailed information with visual proof of where the payment currently stands on your end. The payment from my second pay period has been processed and I'm yet to receive my first one after two whole weeks of back and forth emails. There has also not been, on your part any assurance that actually had a basis in the reality of the situation. Every Time I've been assured, I have been disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T14:18:25.000Z",
          "Titre": "pos company",
          "Contenu": "pos companyfirst they charged 150$ for a free trial i canceled, and then they refunded then, only for a week later to charge me again."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T17:17:14.000Z",
          "Titre": "Not a very good system and doesn't do a…",
          "Contenu": "Not a very good system and doesn't do a lot of basic features that someone would need in this software."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris Hollins",
          "Nb_Reviews": 11,
          "Date": "2020-03-02T09:07:32.000Z",
          "Titre": "Still Charged after Cancellation. Refused to Refund. Bad App on Android",
          "Contenu": "I started using Hubstaff after struggling to get my time sheets complete. I found that the app wasn't what i needed to solve this problem. So I followed the instructions on the portal to try and cancel the subscription at the end of June expecting there to be a 30 day cancellation period and not be recharged. I was charged until November when i realized that i was still being charged on my credit card statement. I rang American Express and disputed the charges and put a stop to any future charges. I have now spent many hours probably 40 hours trying to get the charge of £33.96 refunded. I received a email from Tyler Sellhorn - Director of Customer Experience after I gave poor feedback but still have not received a refund. I have had to send a email to support constantly for the last 2 months will little movement either way. Hubstaff had advised that my account was not cancelled but moved to a \"free\" account. If it is a free account why have i continued to be charged. I am disappointed i ever signed up.Hubstaff did offer me 40% discount or a month free trial if i came back. But after lack of response from Tyler Sellhorn and the refusal to refund the charges i don't feel this is a trust worthy company to work with.The software for Android was very limited and did not record the correct times. I moved to SmarterTime for Android which is much better, has better functionality and is also free of charge."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joey",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T22:52:37.000Z",
          "Titre": "Refund",
          "Contenu": "Was told refund would be done in 24 hours and it’s been a week since I have received any word about my refund."
        },
        {
          "Note": 1,
          "Lieu": "EE",
          "Pseudo": "Priit Urm",
          "Nb_Reviews": 5,
          "Date": "2019-10-14T12:49:52.000Z",
          "Titre": "Did do a Subscription for Hubstaff to…",
          "Contenu": "Did do a Subscription for Hubstaff to try it out more on a Premium plan. Turned it was not 10 USD/per month if you have one user you are billed min 2 users and 20 USD per month."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Akshay kumar R",
          "Nb_Reviews": 1,
          "Date": "2019-09-06T03:51:32.000Z",
          "Titre": "my worked time is not saved for the…",
          "Contenu": "my worked time is not saved for the past one week and i have worked lot of time putting lots of effort who gona pay for that."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Princess",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T20:05:15.000Z",
          "Titre": "i raised an issue Friday last week and…",
          "Contenu": "i raised an issue Friday last week and i still don't have a resolution"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Emma",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T07:46:32.000Z",
          "Titre": "i submitted a query and never recived a…",
          "Contenu": "i submitted a query and never recived a reply on that"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Val Aaron Fiott",
          "Nb_Reviews": 1,
          "Date": "2019-09-27T11:05:11.000Z",
          "Titre": "What a mess",
          "Contenu": "What a mess!  Stay far away from this messy, bizarre website. Nothing works and their support is TERRIBLE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wilkerson",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T03:55:23.000Z",
          "Titre": "The actual billable hours I'm billed by…",
          "Contenu": "The actual billable hours I'm billed by app is off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stratton",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T21:29:04.000Z",
          "Titre": "We asked for a refund last week and…",
          "Contenu": "We asked for a refund last week and have yet to have it processed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mayer Freedman",
          "Nb_Reviews": 1,
          "Date": "2019-10-21T00:54:03.000Z",
          "Titre": "I am not doing something correct",
          "Contenu": "I am not doing something correct.  I need some help here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fatih",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T01:04:54.000Z",
          "Titre": "I Do not recommend"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Atlas",
          "Nb_Reviews": 1,
          "Date": "2019-10-04T18:07:21.000Z",
          "Titre": "this program is confusing and crappy"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Marco",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T10:25:47.000Z",
          "Titre": "The app is always unresponsive."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Vic Bukhantsov",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T20:04:47.000Z",
          "Titre": "Annoying support",
          "Contenu": "Annoying support, buggy integration with Jira, considering to move out"
        },
        {
          "Note": 1,
          "Lieu": "AM",
          "Pseudo": "Sahak Hakobyan",
          "Nb_Reviews": 2,
          "Date": "2019-10-10T11:15:12.000Z",
          "Titre": "the organization is suspended and I…",
          "Contenu": "the organization is suspended and I cant calculate my time way?"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "J Grant",
          "Nb_Reviews": 1,
          "Date": "2019-10-09T20:12:51.000Z",
          "Titre": "Not user friendly",
          "Contenu": "Not user friendly, everything is over  the place. Wat the heck"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Maher",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T14:16:03.000Z",
          "Titre": "I just did not like it."
        },
        {
          "Note": 2,
          "Lieu": "KE",
          "Pseudo": "FLORENCE",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T15:39:00.000Z",
          "Titre": "daily Job application",
          "Contenu": "Indicate the account auto-refresh for daily job applications."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "ThomasG",
          "Nb_Reviews": 3,
          "Date": "2023-07-07T21:26:24.000Z",
          "Titre": "spying and annoying software",
          "Contenu": "spying and annoying software, but its not their fault that there is demand for such things so i dont put a whole blame on themthe 2 rating is because it does what its supposed to do, but you should increase the power user has over his dataemployers have no right to force you to comply with screenshoting, following what websites you visited etc... but hubstaff gives them ability to force certain features and when you try to disable them on your end, timer wont start because for example screenshoting is REQUIREDremove that option, give people way to choose what is shared"
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "Frenchie",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T09:38:39.000Z",
          "Titre": "I've been assisted by 'Josh D from…",
          "Contenu": "I've been assisted by 'Josh D from Hubstaff' and was not satisfied with the service he provided. He didn't get the details early or probe to get the correct details on the situation, which made the case even longer than usual! He just concludes and assumes!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donna Cope",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T16:18:30.000Z",
          "Titre": "The app performs really well",
          "Contenu": "The app performs really well. Disappointing is the continual pop up screenshot. Understandable it has to do it's job but it is frankly a distraction along with all the other popups. Maybe they could get it to take the screenshots in the background."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Lingham",
          "Nb_Reviews": 1,
          "Date": "2019-08-26T20:41:36.000Z",
          "Titre": "Support is never around when you need a…",
          "Contenu": "Support is never around when you need a question answered. Only have a self-help portal and ticket submissions. Would be nice to have a live agent to chat with that can direct you or resolve issues rather than waiting 24hrs for answers that don't always match the questions."
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "Michael Kubler",
          "Nb_Reviews": 1,
          "Date": "2019-08-23T05:05:06.000Z",
          "Titre": "Hubstaff just didn't do what we wanted…",
          "Contenu": "Hubstaff just didn't do what we wanted it to do.We have ended up with Clockify instead as the Hubstaff time tracking app on Windows Desktop is very rigid. It doesn't let you easily pause / resume or change the start time.I've used a few time tracking apps before and my boss asked me to use Hubstaff. But I was so frustrated with it that we only lasted a week before moving to something else. I now have to migrate my hours over to the new app.Still, it's a matter of perspective. I wanted something a bit more flexible as I'm a developer. But maybe if you run a call center or something, then the rigidity of Hubstaff will be beneficial to you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie K",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T18:05:17.000Z",
          "Titre": "Hubstaff has support that reads scripts…",
          "Contenu": "Hubstaff has support that reads scripts that lead you to believe that they are listening to your feedback but I have found that they are just scripts. They will send you to the next level of support and then the same rep will let you know that the next level said sorry they can't help. Then the script lets you know that you should not worry they are letting some other teams know about your feedback. I have had the same experience every time I have spoken with them. They make changes that you may or may not like, and force the update on everyone. They do not have the ability to toggle these changes on or off. It feels like a company with one developer and 20 people to tell you that they will let them know you are having a bad experience with the changes."
        },
        {
          "Note": 2,
          "Lieu": "MD",
          "Pseudo": "Rezgar Cadro",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T14:44:49.000Z",
          "Titre": "No respect to customer operations. Deflective Support.",
          "Contenu": "My experience with Hubstaff was as bad as of the other reviewers. I paid for a yearly subscription and about 6 months in have decided to unlink my credit card to prevent unintended payments in the future. Within a few hours the account was forcibly moved to a free plan, disrupting all time tracking and integrations.Hubstaff Support told me it was as intended and they wouldn't restore our paid subscription unless the card is re-linked. Which pissed me off to be honest as their technical/internal decisions should have no effect on the obligation to provide the service that was paid for.To avoid disrupting operations I had to re-link the card.Given the disrespect to customer operations, I requested account cancelation and a refund for the remaining period, intending to move to a different vendor, which was again rejected referring to their \"policy\" along with some nonsense explanation, not addressing the issue at hand.At no point has anyone at Hubstaff acknowledged the  problem and expressed any intention to fix it. They did offer me 7 extra days of subscription as compensation though, to be fair, but at this point all I wanted is to move on from Hubstaff."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Vijayan Ganesh",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T16:08:10.000Z",
          "Titre": "Not yet supporting Wayland display…",
          "Contenu": "Not yet supporting Wayland display server. As a Linux OS user and this Wayland is more secure and performant than X.org server. It would be nice if you provide support for Wayland.Also sometimes the HS application freezes and the timer is not records the worked time. Today HS freezed for 2 hours and 43 minutes. I requested my agency to add that worked time manually.Initially given 3 stars but now reducing the rating to 2 stars because of freeze and not tracked the worked hours.---14-Feb-2023:Update after logged in Wayland server for 1day, Hubstaff desktop app behaves very abnormal it still not take the screenshot. I'm using 1.6.12-da9418f3. Reached to the support team and they said tech team will follow up in the email.---14-Feb-2023:Hubstaff really confusing me through double communication. Here they say they start supporting Wayland but tech support emailed me to switch to X11 display server because Hubstaff not yet supporting Wayland. In conversation always Hubstaff support said because Wayland not supporting screen capturing feature but I already said twice to them that Wayland supports screen capture using pipewire and many well known application providing their support to Wayland for e.g. OBS studio, Zoom and Ksnip---14-Feb-2023:Finally it is not about whether you are supporting Wayland or not it is about don't confuse the application users by saying mixed information in different channels---14-Feb-2023:I'm using Wayland in Gnome.ps -e | grep tty                                                             2854 tty2     00:00:00 gdm-wayland-ses   2858 tty2     00:00:00 gnome-session-b"
        },
        {
          "Note": 2,
          "Lieu": "HN",
          "Pseudo": "Hoxton",
          "Nb_Reviews": 1,
          "Date": "2019-10-01T06:14:35.000Z",
          "Titre": "Is a door open for companies to invade…",
          "Contenu": "Is a door open for companies to invade your privacy"
        },
        {
          "Note": 2,
          "Lieu": "LK",
          "Pseudo": "Demini Dilhara",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T04:46:14.000Z",
          "Titre": "lot of issues in timer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T00:24:20.000Z",
          "Titre": "Unable to move time from one organization to another...",
          "Contenu": "While Christopher tried his best to help me resolve my issue, he was limited due to the system functionality.I recently moved over to a new organization (still using my same log in information from the previous organization) but am not able to add the time from the old one manually without getting a conflict error. Thankfully I still have access to the old organization since I will have to process one last invoice for the time I cannot move over. Very frustrating."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Rengelle A. Bandoy",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T00:25:11.000Z",
          "Titre": "Areas for Improvement",
          "Contenu": "Giving Hubstaff wiggle room to upgrade flexibility in timestamp recognition: 1) if VA logs in about a minute or two earlier and logs out on time, it should not be tagged as an 'abandoned shift'. 2) To be able to have the option to either input or recognize rest days so as not to tag VA for non-attendance. 3) Ability for VA to amend other US-based time zones."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Heather Taylor",
          "Nb_Reviews": 4,
          "Date": "2023-02-15T03:29:08.000Z",
          "Titre": "Hubstaff Experience",
          "Contenu": "I dislike not being able to enter hours into the timesheet ahead of time e.g., public holidays, annual leave.Hubstaff is not intuitive and slow to load.  Whenever I change pages, it takes at least 10-15 seconds to download.  Given I go between pages a lot, 10-15 seconds per pages really adds up.  It means I have to have Hubstaff open in several tabs and then go between the tabs.The support team are great and respond quickly to our concerns and requests.  Their advice is usually helpful and mostly results in issues being quickly resolved.Reports are fairly easy to extract although I don't understand why the excel format is offered in csv and not xlsx.  Whilst I can save changes, the formatting doesn't save and we send the reports to clients."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Phifer",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T17:49:52.000Z",
          "Titre": "The app doesn't always work",
          "Contenu": "The app doesn't always work, the location service is odd on how it produces information and when it is on and when it is off.  The screen shots work well, but the time tracking has it's own set of problems.  The software should be able to recognize when it is being cheated at some level."
        },
        {
          "Note": 3,
          "Lieu": "BD",
          "Pseudo": "Monir",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T23:27:46.000Z",
          "Titre": "How to arrange it and the complete the…usa🇺🇸my dream job, construction site helper or labour.  💯i am a very simple man. So plz pass me company documents necessary system support government signat.",
          "Contenu": "How to arrange it and the complete the success about my self a USA job, i dont know. But am her try for my own self my dream usa job. I have no skill, i elts,no degree, no point etc.  I need a job emergency benefit full free construction site helper worker or labour. I have my older company CV work paper bank paper by with a electronic flight ticket copy. Monir hosan gazi Pc//143 From🇧🇩Bangladesh.I lost my older passport and know her arrange it a new digital e passport B00714591. This is my own email👇👇W/ap+8801861372451👈mobile"
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Eva",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T17:10:46.000Z",
          "Titre": "My account got SUSPENDED on weekends",
          "Contenu": "Initially, my experience with Hubstaff was smooth until I encountered an unexpected suspension of my account. This occurred despite having an active subscription. What added to the frustration was that this incident happened over the weekend, when I attempted to reach out to their support, but to no avail, since their support isn't available on weekends.Consequently, my team members were unable to log in and track their working hours until the following Monday. This situation prompted me to explore alternative time tracking solutions, ones that provided accessible support even on weekends.As a result, we essentially enjoyed an unplanned break over the weekend and were back to business as usual come Monday, Eastern Standard Time.During this downtime, I stumbled upon a new time tracking tool that also includes video screencasting. This tool has proven to be particularly beneficial for freelancers like myself, as it allows me to view and review their activities during their shifts. This feature has been instrumental in minimizing downtime and discouraging any slacking off."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Evette Langham",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T14:41:09.000Z",
          "Titre": "I understand that it is necessary but I am just not a fan.",
          "Contenu": "I'm not too fond of the timer reminder that pops up when I am in a meeting.  I have to make sure I fidget with my mouse to keep it at bay.  I have once hit the wrong button by mistake and lost my time.  I know that time can be manually edited but that is an extra step to have to reach out. I completely understand that it is necessary but I am just not a fan."
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "amjad pervaiz",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T02:58:37.000Z",
          "Titre": "Azan Computer Networks Rawalpindi",
          "Contenu": "Hi I am Amjad Pervaiz ,I have 06 years experience in different departments of organization i.e. Administration, Human Resource, Business & Operation Coordination Quality Management and  Finance  prepare all information as per requirement in Power Point Presentations preparation and MS word books / data typing PDF file converted into MS Words files, MS Excel Data typing, Data analysis Entry/Data Processing, Matching, Daily weekly Monthly Quarterly & Annual statements like Target/Goal settings, Target/ Goal Achievements, Budgets requirements, prepare in table form Diagram and graphics, Expert who knows the value of time, very hard working and always delivers the work on time. My Motive is to make my employer happy without adding additional charges. If you are looking for data entry or search work, I am the Right person for you. available 24-7. a trusted Freelancer I provide leads for ---100% Verified Asian, UK, USA, Of-365 leads --- 100% Verified Business Emails for any Industry and all kinds of emails you request for, will be available.Regards,Amjad PervaizFrom Pakistan+92 301 7427151"
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "paulina",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T22:45:07.000Z",
          "Titre": "its not working properly",
          "Contenu": "its not working properly, it stops anytime and i think is runing then I go to check on time and i realized it has been stoped for the past minutes"
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Shang Tuquero",
          "Nb_Reviews": 1,
          "Date": "2019-10-07T13:23:20.000Z",
          "Titre": "-keyboard and mouse clicks do not…",
          "Contenu": "-keyboard and mouse clicks do not necessarily translate how productive freelancer is-percentage does not apply really well to prove someone's productivity; what if someone is reading, watching videos or taking down notes using pen and paper"
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "MJ",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T04:47:17.000Z",
          "Titre": "Employer's Perspective",
          "Contenu": "We are still working on editing some features that are applicable to our company, we do a lot of changes to avoid receiving notifications such as abandoned, missed, or late shifts of our employees. HubStaff application is user-friendly but it takes time to fully navigate it, recommended for start-up companies."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James McConnell",
          "Nb_Reviews": 1,
          "Date": "2019-09-28T20:03:37.000Z",
          "Titre": "It works but has a very clunky…",
          "Contenu": "It works but has a very clunky interface. Hard to figure out what I owe my employees. Not intuitive."
        },
        {
          "Note": 3,
          "Lieu": "EG",
          "Pseudo": "QosQos",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T23:29:15.000Z",
          "Titre": "Your server is going into the hole of…",
          "Contenu": "Your server is going into the hole of s***"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Santhosh Kumar B. E santhosh k",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T18:53:54.000Z",
          "Titre": "Best websites in hubstaff",
          "Contenu": "Hi Sir/Madam. I am santhoshkumar. In very trusted website."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Chavansai",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T07:15:06.000Z",
          "Titre": "Great",
          "Contenu": "Basically it's a good website"
        },
        {
          "Note": 3,
          "Lieu": "EG",
          "Pseudo": "Matar",
          "Nb_Reviews": 1,
          "Date": "2019-10-02T07:11:42.000Z",
          "Titre": "stop taking snapshots from my laptop"
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T15:45:38.000Z",
          "Titre": "difficult to navigate especially the…",
          "Contenu": "difficult to navigate especially the screeshots and reports sections"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Salil",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T11:27:28.000Z",
          "Titre": "Pricing on a higher side considering…",
          "Contenu": "Pricing on a higher side considering Indian currency."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "marylou cruz",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T18:54:35.000Z",
          "Titre": "hard to navigate"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ahmet.AGCA",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T08:00:07.000Z",
          "Titre": "a Greatful Year",
          "Contenu": "Obviously, our staff working in the office in the company and our staff working remotely use the application. To be able to track the working performance and duration of the staff, to see and report its analysis, we use these features frequently and you are very successful in this regard. Thank you very much."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "ratnesh",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T09:32:10.000Z",
          "Titre": "Good so far",
          "Contenu": "Good software to track work for companies. My experience is good so far, but the logic of the activity is debatable as the tasks that need a lot of thinking, there will be very little activity. My work involves coding and for it you need to think about the algorithm before implementing, which results in less activity."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Lawrence",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T08:58:04.000Z",
          "Titre": "Ok time attendance software"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helen",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T15:11:34.000Z",
          "Titre": "It's an excellent service with good…",
          "Contenu": "It's an excellent service with good support. My only criticism is that the basic user information is a little hard to find. That is, I had to ask for help on how to find cumulative totals for a project. I received an answer promptly. I have found a way to go back to a project after taking a break, but I'm betting it is not the most efficient. So a simple section explaining these very easy tasks would be useful. Otherwise, it is great."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Joravic",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T00:48:45.000Z",
          "Titre": "The most rewarding part of my job I learned how to manage calls and time effectively.",
          "Contenu": "The best part of my experience that made me great is that I learned how to become flexible on helping clients with different concerns and problem. On my job it requires multi-tasking. While we're taking phone calls, there are some clients waiting for their calls to be answered. Most of the times we are queuing so, from there I learned how to manage time effectively by helping clients concern in a fast way to provide accurate information and solutions problems. All information that we provide is necessarily documented before the end of the call and we ensure that all tasks are completed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa Bacheler",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T22:37:45.000Z",
          "Titre": "Making things easy for a company of 1",
          "Contenu": "I enjoy the customization available with Hubstaff. As solo entrepreneur/freelancer, it is important that I can track my time, and track exactly what tasks I work on for a given length of time. And, if I ever forget to start the timer, it's super easy to hop in and add the forgotten time punch. And creating invoices directly from the site, sending them to my client, AND having my PayPal account linked so they can easily pay their invoices has made my life even easier."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Mzolisi",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T07:44:30.000Z",
          "Titre": "It is good but not perfect",
          "Contenu": "It is good but not perfect. The customer service is effective and straight to the point. But there are still some things that can be improved. The refresh button on the app does not work when there are internet issues. Which does not make sense, I would like to think that the \"refresh\" button syncs up the online data with the offline data. But what happens when you're offline? Why doesn't the timer run until the app is able to sync with the cloud data, but instead of starting over, it updates it.There's a place for \"Add a task\" but does not tell you when you don't have permission to add your own. Why can I still see the feature if I cannot access it?Tooltips would also be nice if you don't want to remove the feature but at least inform the user they won't be able to add a task."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Saeed",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T03:44:37.000Z",
          "Titre": "My team and I recently started working…",
          "Contenu": "My team and I recently started working with Hubstaff. People at Hubstaff are patient and try to resolve the problem. I will be happy to keep sharing my experiences as time goes by."
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Rodrigo Price",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T03:05:36.000Z",
          "Titre": "I received help",
          "Contenu": "Though help finally arrived, it took me at least 3 tries on different tools on your platform, to get a reply from anybody. After that, the staff member was really helpful."
        },
        {
          "Note": 4,
          "Lieu": "GH",
          "Pseudo": "Raymond",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T09:52:03.000Z",
          "Titre": "Hubtaff the money bank",
          "Contenu": "I have read and understand hubtaff, this upps can let you make easy money at anyway you found yourself.so please download the app and start making your money now."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Jeffere Mante",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T08:53:31.000Z",
          "Titre": "Reflect time tracked in ClickUp",
          "Contenu": "If it can send time tracked data to corresponding ClickUp task, like how completing status is done, it would have been perfect."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Jared James Pimentel",
          "Nb_Reviews": 1,
          "Date": "2019-10-14T19:20:32.000Z",
          "Titre": "It is a great Time Monitoring tool. But...",
          "Contenu": "It is a great Time Monitoring tool. But I hope the idle time gets a minimum of one hour instead of 40 minutes because sometime it is not necessary to use the computer while working and it gets tiring to see that the timer stopped because you forgot to use the computer."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Rubab",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T21:19:22.000Z",
          "Titre": "I have an experience in customer…",
          "Contenu": "I have an experience in customer dealing and teaching1 year teaching experienceAndSome months passed as a sale girl"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lyfe Scrypt",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T04:58:24.000Z",
          "Titre": "Need some changes but overall it's a lot better than other companies",
          "Contenu": "UI Design it's not perfect.I think it would be amazing if you develop some key functions and features for better results."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Neil Murray",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T20:59:28.000Z",
          "Titre": "Hubstaff is great alternative to Upwork",
          "Contenu": "We had used Hubstaff for some of our staff for years but recently found that recruiting new staff via Hubstaff Talent is a great alternative to Upwork.Unfortunately the Hubstaff Talent App is limited & buggy and Hubstaff Talent Support is very slow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Myss Miranda Walters",
          "Nb_Reviews": 2,
          "Date": "2019-08-30T04:35:41.000Z",
          "Titre": "I am loving it",
          "Contenu": "I am loving it. However, there are quite a few things that aren't intuitive and areas where you could make changes to make it even better. If there were a way to have a time tracker switch to start a task from an email kind of like Toggl and ClickUp do, that just makes sense... the switching between the base dashboard and the tasks dashboard could be easier, a way to set a pay period - like right now, I can't find a way to set my billing cycle, and I am afraid to approve any time sheets because I don't want to lock myself out from tracking more time for the month (I bill in cycles of the 11th-25th and 26th-10th. I can't find anywhere to set that). If you could include Square as a billing/payment option, and if you could partner with Clickup - oh my god I would sing your praises and throw my money at you. It's these little tweaks and adjustments that would make you the system I've been looking for my WHOLE LIFE! Just saying. I am a power user and a super nerd, so if you ever want feedback, I'm happy to supply it."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Basit",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T12:37:18.000Z",
          "Titre": "May experience in 1 month I read in…",
          "Contenu": "May experience in 1 month I read in class 11 i am join for your company I have a get money"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason XX",
          "Nb_Reviews": 14,
          "Date": "2019-06-08T16:29:04.000Z",
          "Titre": "This is a fantastic company",
          "Contenu": "This is a fantastic company. There is some room for improvement with some of their products but overall, its really a great too for helping to tun my small business."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T02:27:05.000Z",
          "Titre": "Priti- chat support",
          "Contenu": "Priti- chat support, was very helpful & very polite. Ty"
        },
        {
          "Note": 4,
          "Lieu": "IQ",
          "Pseudo": "Sirwan",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T10:52:14.000Z",
          "Titre": "I really wanted to depend on your…",
          "Contenu": "I really wanted to depend on your product the not being able to exclude WhatsApp and other social media apps and websites from the screenshots was a deal breaker for me"
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Yurii.Boiko",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T12:42:08.000Z",
          "Titre": "almost great",
          "Contenu": "almost great. Issue just that i can't set when my working day endfor example i would likw to have end of dat 3am at nightso when i starting work in next day - i will see 00 on timernot prev yesterday time when i worked after 00:00 in my local time"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Shoukat ali soomro",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:40:46.000Z",
          "Titre": "Hubstaff",
          "Contenu": "Good experience on hubstaff"
        },
        {
          "Note": 4,
          "Lieu": "PE",
          "Pseudo": "VMP'S Custome Service",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T22:27:57.000Z",
          "Titre": "Thanks to Hubstaff",
          "Contenu": "Thanks to Hubstaff, part of the equipment was improved in terms of production percentages, thanks to which we were able to make progress on other projects."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "May",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T13:01:42.000Z",
          "Titre": "The customer support's response was…",
          "Contenu": "The customer support's response was great. But I think the problem lies with the system itself. It crashed on its own and I think you should look into it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cadebra",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T18:17:19.000Z",
          "Titre": "They took their time to help me solve…",
          "Contenu": "They took their time to help me solve the issue but it was solved anyway"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peace",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:44:57.000Z",
          "Titre": "Detailed information answered with patience and precision.",
          "Contenu": "The information I was given was very detailed and made me understand why my issue keeps recurring."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Gian Floriddia",
          "Nb_Reviews": 2,
          "Date": "2023-05-26T16:45:34.000Z",
          "Titre": "Great tool",
          "Contenu": "Great tool, sometimes the UX is not super clear... but luckily there is a super good Customer Service!"
        },
        {
          "Note": 4,
          "Lieu": "VE",
          "Pseudo": "heilyn",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:28:30.000Z",
          "Titre": "EXCELENT I LIKE VERY VERY GOOD"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sam Yehia",
          "Nb_Reviews": 5,
          "Date": "2023-08-24T08:46:58.000Z",
          "Titre": "Great app with project management",
          "Contenu": "Great app with project managementEasy to use Support very responsive."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Haroon",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T08:41:51.000Z",
          "Titre": "Its helpful and informative",
          "Contenu": "Hubstuff is very useful for on line working in future."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Joana",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T03:07:33.000Z",
          "Titre": "The issue was resolved though I was…",
          "Contenu": "The issue was resolved though I was able to resolve it on my end. Hoping for faster responses in the future."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Waniya",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T07:22:50.000Z",
          "Titre": "I thing that this company has very…",
          "Contenu": "I thing that this company has very simple rules.and it will be fun to work online here.and also its a very good opportunity...."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Shashank Yadav",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T22:37:49.000Z",
          "Titre": "Easy to Find Work for Freelancers!",
          "Contenu": "Providing Freelancers a Great place to work and provide Quality Workers for the one who hired Freelancers."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Lucero",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T05:08:03.000Z",
          "Titre": "Hubstaff is friendly",
          "Contenu": "Hubstaff is friendly, but to be honest, I need more time to handle it to request time off."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lizz R.",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T04:08:20.000Z",
          "Titre": "So far so good",
          "Contenu": "It was an easy process and the admins are helpful and make sure important information is quickly available"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Nazrul Tapadar",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T08:29:25.000Z",
          "Titre": "Hi ,The important and happiness thing…",
          "Contenu": "Hi ,The important and happiness thing is that whenever I wanted to logged in and connected to chat with Hubstaff Representative or officer they are so positive to provide good answers and ask further for any query."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Farah",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T11:38:22.000Z",
          "Titre": "They give fast respond when the apps…",
          "Contenu": "They give fast respond when the apps have a trouble, overall good!"
        },
        {
          "Note": 4,
          "Lieu": "LU",
          "Pseudo": "Anna Rose",
          "Nb_Reviews": 3,
          "Date": "2021-09-20T04:24:13.000Z",
          "Titre": "Nice tool implemented for remote logins…",
          "Contenu": "Nice tool implemented for remote logins to work more easily and efficiently.  We recommend it for all your employees and workforce management."
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Kapcsolat Livestudio",
          "Nb_Reviews": 1,
          "Date": "2019-08-19T07:12:49.000Z",
          "Titre": "The product is just fine",
          "Contenu": "The product is just fine, the only weak spot is the mobil app. Its meant to use for \"workers\" not for supervisors."
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Enneka",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T02:58:18.000Z",
          "Titre": "Hubstaff Glitch",
          "Contenu": "Effective response time"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Kathyrene Joie Relativo",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T13:12:27.000Z",
          "Titre": "unable to access the link to create an…",
          "Contenu": "unable to access the link to create an account"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Yago",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T15:26:16.000Z",
          "Titre": "Super helpful and useful!",
          "Contenu": "It is easy to use and it is super helpful and handy!"
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Arif Mustaffa",
          "Nb_Reviews": 1,
          "Date": "2019-08-29T00:23:43.000Z",
          "Titre": "HONEST REVIEW",
          "Contenu": "It is great app, but font looks quite small for Linux OS."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Makavie",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T08:34:58.000Z",
          "Titre": "It is just okay for me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Damilola Abe",
          "Nb_Reviews": 1,
          "Date": "2019-10-01T03:21:50.000Z",
          "Titre": "Nice order of dates and times"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T04:54:12.000Z",
          "Titre": "Works great",
          "Contenu": "Works great, easy to use and works great"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Talha",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T11:45:39.000Z",
          "Titre": "Good...",
          "Contenu": "Good.... really appreciate"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Francis",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T15:13:24.000Z",
          "Titre": "Timely resolution"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Saud",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T08:39:11.000Z",
          "Titre": "Quick resolution",
          "Contenu": "I talked with Paolo on customer support chat, he is very polite."
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T11:19:50.000Z",
          "Titre": "The live chat is prompt and the…",
          "Contenu": "The live chat is prompt and the assistance was accurately provided."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Maria",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T02:30:10.000Z",
          "Titre": "I wanted to express my gratitude for…",
          "Contenu": "I wanted to express my gratitude for your prompt resolution of my email issue. Everything is working perfectly now. Thank you for your quick and effective assistance!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "João",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:41:53.000Z",
          "Titre": "Very Good",
          "Contenu": "It was quick and efficient"
        },
        {
          "Note": 5,
          "Lieu": "VE",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T17:45:12.000Z",
          "Titre": "Amounts Owed Report Doubts",
          "Contenu": "The Rep. was cordial and answered all my questions/concerns regarding the generation of this report and how to set it up on my profile."
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Emmah",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T13:52:26.000Z",
          "Titre": "Quick response which is great and the…",
          "Contenu": "Quick response which is great and the application is not much complicated"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:47:56.000Z",
          "Titre": "Quick fix",
          "Contenu": "They did not take long to fix my hubstaff available holiday and vacation hours. They were really fast to be honest."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Ali",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T02:48:33.000Z",
          "Titre": "Excellent Assistance",
          "Contenu": "Very fast response and was able to resolved the problem"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Erwin",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T12:31:06.000Z",
          "Titre": "The help was prompt and direct",
          "Contenu": "The help was prompt and direct. Mercy the agent is knowledgeable and had all the answers to my question."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Francis",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T08:57:32.000Z",
          "Titre": "Paolo Goes the Extra Mile",
          "Contenu": "Paolo gave the solution straight away. Plus he gave extra tips/knowledge about report times being affected by selected time zones. So he went the extra mile. I appreciate that."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Cherrie",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T03:14:11.000Z",
          "Titre": "Timezone difference time tracking issues",
          "Contenu": "My message got across immediately to customer support rep. When I was asked to show the dashboard of my app I vouldn't because I was on mobile, the support provided a screenshot instead. Then the clarification began there. It was much less hassle on my part because I didn't need to elaborate everything. ☺️"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T13:51:07.000Z",
          "Titre": "Martin was great! 5 stars",
          "Contenu": "Martin was super helpful. I wish him a great day. He deserves a promotion. He explained everything well and he was very quick to act upon the situation. I hope to get my refund very soon and I thank him for helping me with my ordeal."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Nini",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T20:29:18.000Z",
          "Titre": "this will be really 5 if you can…",
          "Contenu": "this will be really 5 if you can resolve this issue and bring back my lost hours since last week when u stated it was my fault though it was not"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittany",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T20:29:44.000Z",
          "Titre": "Fast Problem Solving and Assistance!",
          "Contenu": "Fast Problem Solving and Assistance!Jean asked great questions to understand my issue, then took time to investiagate before coming back with instructions and a visual (screenshot) of what I needed to do in order to fix my issue. Very friendly and made sure I didnt need anything else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dwon",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T08:00:22.000Z",
          "Titre": "You record time accurately and respond…",
          "Contenu": "You record time accurately and respond as fast as possible when there is a problem."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ritesh Kumar Sharma",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T09:59:31.000Z",
          "Titre": "Ritesh Kumar Sharma",
          "Contenu": "My name is Ritesh Kumar Sharma, since many years I have been doing web development and data entry work, I have done all the courses in Great Learning Academy with certificate. I get the job done very quickly and accurately and I charge less"
        },
        {
          "Note": 5,
          "Lieu": "SR",
          "Pseudo": "Conchita Pansa",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T11:17:47.000Z",
          "Titre": "Talita went the extra mile",
          "Contenu": "Talita reached out to me after I was informed about my account and offered extra service of which I was very satisfied with. Thank you much."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Picci gaming",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T22:57:57.000Z",
          "Titre": "We use cookies to personalize content…",
          "Contenu": "We use cookies to personalize content and ads, to provide social media features, and to analyze our traffic. We also share information about your use of our site with our partners in social media, advertising, and analytics. By continuing to use our website, you accept the use of all cookies. You can always access and change your cookie preferences in the footer of this website."
        },
        {
          "Note": 5,
          "Lieu": "VE",
          "Pseudo": "Thomas R",
          "Nb_Reviews": 2,
          "Date": "2023-06-03T08:09:35.000Z",
          "Titre": "Tracking employee activity",
          "Contenu": "I recently had the opportunity to utilize Hubstaff, and I am thoroughly impressed with the level of support and the clear insights it provided for our business. As someone who has used various tools in the past, I can confidently say that Hubstaff stands out from the crowd.One of the standout features of Hubstaff is its quick response time. Whenever I had a question or encountered an issue, their support team was prompt in addressing my concerns."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Amanuel",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T14:41:37.000Z",
          "Titre": "Hubstaff is great because",
          "Contenu": "Hubstaff is great because it help bring transparency to the remote job I do. it tracks activity, time  and takes 3 screen shots every 10 minutest which is great for companies to see what is going on with the remote worker. as a employee I have used the desktop software( both windows and Linux) and they are light wight. can be easily run even on old computers.  and there customer service is wonderful."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Mabi",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T19:36:44.000Z",
          "Titre": "Jean was very hands on and ensure that…",
          "Contenu": "Jean was very hands on and ensure that my issue was resolved unlike Daphne who just read and not comprehend the question that is why it took so long"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Mian",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T23:13:03.000Z",
          "Titre": "Hubstaff is reliable online website",
          "Contenu": "I came to this platform for finding online free job. As free online job is more comfortable for me because my Father is paralysed since 7 years and I spend more time at home. Hubstaff give me very reliable site for working from home. And I can select job according to my time, hourly, part time, and full jobs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "petunia",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T05:08:28.000Z",
          "Titre": "Hubstaff is such a great and innovative…",
          "Contenu": "Hubstaff is such a great and innovative platform. They have literally thought of everything when it comes to team workspaces. I highly recommend hubstaff to anyone who wants an efficient platform to work with their team to transfer data and record data. They also offer their own freelancer program"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Increased",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T20:49:27.000Z",
          "Titre": "Invoice Requesting",
          "Contenu": "Invoice RequestingGreat! We received a response after two days and it was what we are looking for."
        },
        {
          "Note": 5,
          "Lieu": "HN",
          "Pseudo": "Lou",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T18:04:08.000Z",
          "Titre": "The ticket system worked like a clock",
          "Contenu": "The ticket system worked like a clock! The support staff was helpful in acknowledging the issue and offered suggestions to avoid recurrences."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Markus",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T08:49:05.000Z",
          "Titre": "great tool, spot on support!",
          "Contenu": "quick, friendly, patient support. the product is great, UX a bit weird, but once you figured things out, your employee productivity goes through the roof!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "awaisimad",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T07:02:50.000Z",
          "Titre": "Well great response from hubstaff"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "GeeDub",
          "Nb_Reviews": 3,
          "Date": "2023-04-18T13:10:53.000Z",
          "Titre": "Hubstaff makes managing remote workers easy",
          "Contenu": "We've been using Hubstaff to manage remote workers. It has been a great product and we don't ever worry about paying and managing staff, or if they're actually working. Hubstaff takes care of everything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T15:41:20.000Z",
          "Titre": "Hubstaff Support ... On-Time & Spot-On!",
          "Contenu": "Just getting started with Hubstaff Tasks and needed some immediate coaching to setup our structure correctly. Instant response on Chat that not only stopped me from doing something incorrectly, but opened my eyes to other possibilities.Well done, Hubstaff!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Manny Arce",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T03:37:14.000Z",
          "Titre": "App is easy to navigate",
          "Contenu": "App is easy to navigate. Has resourceful information. Can keep track of progress and much more."
        },
        {
          "Note": 5,
          "Lieu": "SV",
          "Pseudo": "Jaime E. Portillo",
          "Nb_Reviews": 3,
          "Date": "2023-07-20T08:45:42.000Z",
          "Titre": "A company that listens!",
          "Contenu": "Hubstaff provides support, which is a step forward compared to companies of greater size that have automated bots or extensive Wikis where a freelancer spends valuable time searching for an answer. Thank you Hubstaff!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bridget",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T05:06:31.000Z",
          "Titre": "My experience with hubstaff has been…",
          "Contenu": "My experience with hubstaff has been great, when you have problems with your work they get right to it. Also the feed back is perfect when submitting technical issues, there the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emma",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T16:16:49.000Z",
          "Titre": "10/10 recommend",
          "Contenu": "Customer service is above and beyond. whenever i have a question i chat and its answered in literally 5 seconds. also the website is very helpful. i can keep track of my remote employee to the t. i get a screenshot every 10 min of his work and thus can make sure everything is done. Thank you Hubstaff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deven Bhagwandin",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T22:45:44.000Z",
          "Titre": "Excellent Support with Additional Materials to Educate Me",
          "Contenu": "Hubstaff support was great to work with. They helped me fix my issue, educated me on how to avoid it in the future, and provided additional materials for more information."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T03:40:19.000Z",
          "Titre": "I wish I could give more than five stars",
          "Contenu": "As someone with a pretty extensive knowledge base in troubleshooting software, I had already gone through many of the steps to resolve my own issue before contacting support. I was very pleased that Jean did not try to imply that I needed to \"do it again\" or that we needed to \"start from the top\" as I have seen many CSR / Support reps do (especially in the IT world). I needed to get my app functional so I could get to work and I was thrilled that after reading through everything I had tried, Jean was able to promptly advise of the resolution. Jean was courteous and polite throughout the entire chat (another thing not often found in software support) and I wish I could give more than five stars for the assistance I received today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Niels",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T14:32:46.000Z",
          "Titre": "Excellent Support",
          "Contenu": "I'm on a free plan and had problems connecting to my account using the new desktop app.I contacted support through the chat applet, and my request was resolved in a matter of minutes. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Dennis Morris",
          "Nb_Reviews": 3,
          "Date": "2023-04-11T03:55:25.000Z",
          "Titre": "Excellent Service from Hubstaff",
          "Contenu": "As I stated in my previous message, Daphne promptly and professionally responded to my concern, her message explaining the entire situation in detail.  This means, before writing me, Daphne carefully looked into my concern so that her response could be so very helpful, and then she took the time and effort to write such a response, and did so in short time.  Absolutely excellent!"
        },
        {
          "Note": 5,
          "Lieu": "VE",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T23:49:22.000Z",
          "Titre": "Response was inmediate!",
          "Contenu": "Response was inmediate!I love the way they give support. Straight to the point. Issue was fixed during the following hours. Next day I could keep working normally."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T21:51:01.000Z",
          "Titre": "The customer experience journey was a…",
          "Contenu": "The customer experience journey was a seamless one. Support was able to walk me through and went extra mile to provide a help link for an out of scope dilemma."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Sheila",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T19:29:51.000Z",
          "Titre": "It tracks my hours spent working on a…",
          "Contenu": "It tracks my hours spent working on a project. Being new to this app and having a great support team in Hubstaff is all I needed to connect a few missing dots to working seamlessly."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "chefHugo",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T10:37:04.000Z",
          "Titre": "I've been an international chef for…",
          "Contenu": "I've been an international chef for many years I've been to several countries I really liked this app it gives me certainty about the work and hours done"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Mario",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T20:00:08.000Z",
          "Titre": "Fast response from the live chat…",
          "Contenu": "Fast response from the live chat support team."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Charlotte",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T18:54:28.000Z",
          "Titre": "Bryan is very swift responding to my…",
          "Contenu": "Bryan is very swift responding to my concern. It has been solved in less than 5 mins."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T20:55:31.000Z",
          "Titre": "Christopher was who helped me with the…",
          "Contenu": "Christopher was who helped me with the issue I had and he was very quick to resolve the issue and email when it had been taken care of as well."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Jakub",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T07:46:20.000Z",
          "Titre": "I worked for great company which used…",
          "Contenu": "I worked for great company which used Hubstaff and beside that I was against it the program in general is good. It works exactly as intended, support was always ready to help."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "amjad pervaiz",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T20:41:41.000Z",
          "Titre": "Data Entery",
          "Contenu": "Hi I am Amjad Pervaiz ,I have 06 years experience in different departments of organization i.e. Administration, Human Resource, Business & Operation Coordination Quality Management and  Finance  prepare all information as per requirement in Power Point Presentations preparation and MS word books / data typing PDF file converted into MS Words files, MS Excel Data typing, Data analysis Entry/Data Processing, Matching, Daily weekly Monthly Quarterly & Annual statements like Target/Goal settings, Target/ Goal Achievements, Budgets requirements, prepare in table form Diagram and graphics, Expert who knows the value of time, very hard working and always delivers the work on time. My Motive is to make my employer happy without adding additional charges. If you are looking for data entry or search work, I am the Right person for you. available 24-7. a trusted Freelancer I provide leads for ---100% Verified Asian, UK, USA, Of-365 leads --- 100% Verified Business Emails for any Industry and all kinds of emails you request for, will be available.Regards,Amjad PervaizFrom Pakistan+92 301 7427151"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Catherine",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T15:31:32.000Z",
          "Titre": "Aligning Pay period",
          "Contenu": "I was able to confirm from the support that the pay period needs to be corrected, it was a seamless transaction."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Maven",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T03:57:27.000Z",
          "Titre": "Josh provides a clear instruction on…",
          "Contenu": "Josh provides a clear instruction on how to submit timesheet. Very Professional."
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Anita",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T12:29:07.000Z",
          "Titre": "Appreciate the Support assistance",
          "Contenu": "Hi, truly appreciate the Support assistance. Thank you very much!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jocelyn",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T04:19:01.000Z",
          "Titre": "Helpful, quick and responsive",
          "Contenu": "Helpful and quick."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Manoj",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T04:24:46.000Z",
          "Titre": "Nice experience",
          "Contenu": "Highly effective in tracking"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T21:50:55.000Z",
          "Titre": "Customer support works hard to makes…",
          "Contenu": "Customer support works hard to makes sure everything is working when payroll issues arise. Had an issue with a PayPal payment going out of my account and not going to an employee but they are investigating it and taking it serious."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Abhishek",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T18:29:16.000Z",
          "Titre": "User Friendly",
          "Contenu": "The platform is very much user friendly, easy to track working hours."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Voris",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T15:31:15.000Z",
          "Titre": "Great Support by David",
          "Contenu": "David assist me faster and find a solution within a minute, I have a great experience with his support and I didn't need to wait for hours again"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Divina",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T12:23:05.000Z",
          "Titre": "Accuracy",
          "Contenu": "Accurate in the number of hours I work. Time consuming. Reliable"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Eunice",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T06:07:00.000Z",
          "Titre": "The agent discussed the ideas and…",
          "Contenu": "The agent discussed the ideas and information as per my inquiry.  Friendly and understood the subject.  5 stars to your rockstar customer support agent :)"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Louise",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T16:20:58.000Z",
          "Titre": "Mercy was great and made sure to ask…",
          "Contenu": "Mercy was great and made sure to ask questions and use diagrams to make sure that we were on the exact same page about my question."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Mariazelle",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T04:31:23.000Z",
          "Titre": "Very helpful support group",
          "Contenu": "We had an amazing experience with the support team at Hubstaff. Very helpful indeed! Thank you and keep it up!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Liezl",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T13:05:55.000Z",
          "Titre": "They see to it my issue is resolved in…",
          "Contenu": "They see to it my issue is resolved in a timely manner. Helpful and very understanding. More power."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Lyka",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T15:44:11.000Z",
          "Titre": "Very nice",
          "Contenu": "Very nice, my concern resolved fast 🤗 thanks for accepting me.❤ Now I'm able to work from the comfort of my room🤗 must try too ❤❤❤❤❤😇"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T21:41:32.000Z",
          "Titre": "Your teammate Orlin exemplified…",
          "Contenu": "Your teammate Orlin exemplified excellence in customer support. He was professional and courteous throughout the process of resolving my password issue; I immediately felt in good and caring hands and was confident my issue would be resolved to my satisfaction. My impression of Orlin was quickly justified with his prompt resolution of my issue. Orlin's superior customer support showed again with his follow-up to make sure my issue had been resolved to my satisfaction. Top marks to Orlin across the board."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Yvett",
          "Nb_Reviews": 6,
          "Date": "2023-09-29T13:41:37.000Z",
          "Titre": "So far so good",
          "Contenu": "Just joined and the customer service rep really helped me to understand various aspects of Hubstaff"
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Nguyen-Trong",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T18:21:15.000Z",
          "Titre": "I received the support at once I…",
          "Contenu": "I received the support at once I contacted you. You also explained more detail in order to ensure me to solve the issue."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sage",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T13:59:41.000Z",
          "Titre": "I have found Hubstaff to be effective…",
          "Contenu": "I have found Hubstaff to be effective and timely in every way."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jaie",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T04:13:33.000Z",
          "Titre": "Got all the help I needed",
          "Contenu": "Got all the help I needed. Mercy took the time to answer all the inquiry points (and there were a lot of them), leaving no question unanswered."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Szczepan",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T10:55:13.000Z",
          "Titre": "Always helpful",
          "Contenu": "Always helpful. Since many years. If I would in a future work somewhere outside Gravity Global, I would love to work with you guys :)"
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Bobby",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T00:07:27.000Z",
          "Titre": "Great service,",
          "Contenu": "Great service,. The timer keeps record of the time spent working on the projects,,. And the support team has also been helpful."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T07:50:00.000Z",
          "Titre": "Paolo",
          "Contenu": "Your agent, Paolo was able to present facts to my query and showed all possible sides for the problem/situation I asked..."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Rahul",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T14:50:27.000Z",
          "Titre": "Good Company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Baila",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T20:27:11.000Z",
          "Titre": "I wealth of valuable information is…",
          "Contenu": "I wealth of valuable information is made available to me on the platform. Everything is easy to navigate and locate."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Pamela",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T07:53:34.000Z",
          "Titre": "Daniel was very fast and accommodating",
          "Contenu": "Daniel was very fast and accommodating, sharing links that will direct me to what I needed to be changed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T15:08:34.000Z",
          "Titre": "You guys just shine!",
          "Contenu": "You guys just shine.  Prompt customer service that doesn't sacrifice quality & rapid iterations that don't sacrifice user experience.  Keep rocking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vivian",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T17:22:10.000Z",
          "Titre": "My time has always been accurate and…",
          "Contenu": "My time has always been accurate and the one time I had a problem, it was quickly resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T14:57:56.000Z",
          "Titre": "Fast response time",
          "Contenu": "Fast response time, issue resolved with ease. Knowledgeable chat agents."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Chena",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T20:22:38.000Z",
          "Titre": "Always speedy response from Hubstaff…",
          "Contenu": "Always speedy response from Hubstaff peeps"
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Mohamed Maamoon",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T14:04:12.000Z",
          "Titre": "Excellent tool to gain a better visibility on the productivity of remote teams",
          "Contenu": "Hubstaff gave us a better capabilities to manage the productivity of remote teams and to early detect productivity downtrends on employee and team levels."
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T09:19:05.000Z",
          "Titre": "Excellent Service",
          "Contenu": "My issue was resolved promptly and excellently"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jhon",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T16:46:09.000Z",
          "Titre": "I just wished your support can reply as…",
          "Contenu": "I just wished your support can reply as fast as possible for urgent concerns."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erica",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T18:14:05.000Z",
          "Titre": "Prompt Responses",
          "Contenu": "The prompt responses and being able to be connected to an agent quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenna",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T01:01:30.000Z",
          "Titre": "Very helpful reps",
          "Contenu": "Orlin was very helpful and went above and beyond to help me out"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "PRASHANT PANDEY",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T16:07:10.000Z",
          "Titre": "Until now my experience has been great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marisol",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T00:52:16.000Z",
          "Titre": "My question was addressed without…",
          "Contenu": "My question was addressed without hesitation even if it was probably a silly question."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Roi Geeks",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T01:55:10.000Z",
          "Titre": "Time tracking",
          "Contenu": "Hubstaff is what a remote agency needs to track what the employees are"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tosha",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T19:19:36.000Z",
          "Titre": "It was great and simple to receive the…",
          "Contenu": "It was great and simple to receive the info I requested, and all my questions were answered."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Tom Campbell",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T15:55:58.000Z",
          "Titre": "Easy to use",
          "Contenu": "Hubstaff is new to me but easy to use. Customer service is really helpful and fast"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Aashir",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T01:10:41.000Z",
          "Titre": "This is amazing work app I have very…",
          "Contenu": "This is amazing work app I have very interesting this work thank you much"
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "Yiresse",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T06:48:15.000Z",
          "Titre": "track easily activities,",
          "Contenu": "Able to track easily activities, fast and good support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie Rambacher",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T03:42:27.000Z",
          "Titre": "Thank you Josh",
          "Contenu": "Thank you Josh! I figured out my issue. I was using my personal instead of work email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernadette",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T07:32:27.000Z",
          "Titre": "Claims Representative",
          "Contenu": "Get help! I had the best help.  All the information I needed was given to me."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jean",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T22:36:10.000Z",
          "Titre": "Very Helpful",
          "Contenu": "It helps greatly on managing a virtual team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rainer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T18:11:27.000Z",
          "Titre": "Excellent and fast support",
          "Contenu": "Excellent and fast support! Great product!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Olabode",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T23:20:49.000Z",
          "Titre": "The fact I can use it to track time",
          "Contenu": "The fact I can use it to track time , manage projects"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Catherine",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T14:08:24.000Z",
          "Titre": "Very helpful and provided the…",
          "Contenu": "Very helpful and provided the information in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Maria",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T22:59:48.000Z",
          "Titre": "Great",
          "Contenu": "Great job. The representative was kind"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:19:57.000Z",
          "Titre": "I loved that I got my answer right…",
          "Contenu": "I loved that I got my answer right away.   I did not have to wait."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phillip",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T04:03:11.000Z",
          "Titre": "Josh was terrific",
          "Contenu": "Josh was terrific. Give him a 20% raise. Thank you. On second thought give him a 30% raise. Thank you for your kind attention."
        },
        {
          "Note": 5,
          "Lieu": "SR",
          "Pseudo": "Conchita Pansa",
          "Nb_Reviews": 2,
          "Date": "2023-10-21T14:01:43.000Z",
          "Titre": "Talita reached out to see if she could…",
          "Contenu": "Talita reached out to see if she could help, and she did👌"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Christian",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T14:24:26.000Z",
          "Titre": "My first Hubstaff encounter",
          "Contenu": "Support responded in timely manner and gave options for troubleshooting."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Krishnan P V",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T17:03:38.000Z",
          "Titre": "I have n't prepared my profile to your firm, despite you are responding to my request for providing me data entry jobs.",
          "Contenu": "Request to send me the guide lines of your firm forthwith."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Marvin",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T07:13:31.000Z",
          "Titre": "Inquiry on Daily Limits",
          "Contenu": "Nothing to comment at this point"
        }
      ]
    }
  ]
}