{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "humblefax.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Val Bowden",
          "Nb_Reviews": 3,
          "Date": "2023-09-08T04:14:49.000Z",
          "Titre": "THIS IS THE WORST FAX PLATFORM EVER!! DO NOT USE! TOTAL SCAM!!!",
          "Contenu": "THIS IS THE WORST FAX PLATFORM EVER! DO NOT USE!!!!!!We searched for several companies before making our decision and chose Humblefax because of their claims for unlimited faxing and no hidden fees. Within a week, they canceled our plan without any warning saying that they do not actually offer unlimited faxing and that we needed to pay them more money. It was frustrating because it also impacted our clients in the medical field. They gave us no warning and told us that they do not actually offer unlimited faxes. We had a very negative experience with Adam Carpentieri from their team. I hardly ever write a bad review and try to be understanding of the challenges of running a business. However, the fact that they blatantly lied about offering unlimited (we didn't even send that many faxes!), cut off our subscription (despite paying for a full month), and sent us horrible messages was beyond anything we had experienced before. Most of our team is BIPOC and they were quite aware of this too so it actually seems extremely racist which is very sad. I would never recommend using them because they will take your money, cancel your subscription before the month ends, and will send you horrible emails. Total scammers!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T16:00:55.000Z",
          "Titre": "I have tried for months to cancel this…",
          "Contenu": "I have tried for months to cancel this account! I was not able to port a fax number I've had for 20 years into Humble Fax, so I've had no choice but to close this account. Any company that won't provide a customer service number is questionable. After a few months of pulling a monthly fee (without ONE transaction), I finally had to remove my credit card, so that I'm not continually being charged. I've tried using their \"contact us\" page, I've tried emailing their \"support\" email address, and I'm completely frustrated with this situation! I do NOT recommend using Humble Fax! Their customer service is non-existent.8/14/2023 Update: I continue to receive emails threatening to cancel my account (almost every day I receive them) even though I've repeatedly requested that they DO cancel it. If anyone has a phone number I can call to get the cancellation finalized once and for all, I would appreciate it. Once this organization is out of my hair for good, I will be extremely happy!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Former user of ShelterLOGIC",
          "Nb_Reviews": 4,
          "Date": "2023-06-26T22:52:01.000Z",
          "Titre": "I signed up for an unlimited account…",
          "Contenu": "I signed up for an unlimited account and they cancelled my service and removed my credit card and were unfriendly towards me. I am suing them and Web Ventures affiliate for breach of contract, abuse, and damages at a district court in Ridgewood, NJ 07450A notice on my iPhone appeared showing they had disabled my account, NOT REFUNDED MY MONEY, and removed my credit card.No advance notice was given, and my fax did not go through.They are unHumbleFax.comThey also really are horrible. Much better services elsewhere with “friendly” customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Algeiba C",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T18:29:05.000Z",
          "Titre": "I was happy until I was not.",
          "Contenu": "I have been using Humblefax since October 2022, and I was initially very happy with the service. I need to send large faxes a few times a month, and the $10.00 per month unlimited faxing was a competitive price.Anyway, this month, they decided that my faxing pattern, which has remained the same from the beginning, went against their policies. This has made it clear to me that this company is not truly an unlimited faxing service, as advertised. They were, I am guessing, losing money from my use of their service, and they needed to make an excuse to transfer me to their limited faxing service. I initially thought I was fine with being transferred to their limited service, but after dealing with their terrible customer service, I decided to stop using their service. Thankfully, I found another company that has a similar setup as theirs, and their reviews on BBB are better. If you are curious, Humblefax's BBB rating is an F."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "VP",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T11:11:29.000Z",
          "Titre": "Support Team is inefficient and nasty",
          "Contenu": "Support Team is inefficient and not professional. Do not by humblefax if you will need their help down the road. Look elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PBI",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T19:16:20.000Z",
          "Titre": "I am VERY disappointed",
          "Contenu": "i joined monthly on 6/23. i paid the 10.00 fee and began working.  a week or so in i saw that my billing info was stored. I am 66 and disabled on ONLY a social security debit card.  I receive no other income and I do NOT use credit cards at all.  So i removed the info and watched the days as they came close to having to make my next payment.  I heard nothing until 7/24 when they sent a reminder for me to update my billing information. it was a couple days away anyway so i just put in the info to see that the payment would go through. And it did on the 7/24. After it paid out I again removed the info. And I responded back to that email of 7/24 explaining my concern of having this only means of income floating around the internet when cyber hacking is common. They responded that they understood and that it was fine.  Also let me know that they do not hold the info, they send a token to STRIPE.com, who hold it.  This really concerned me because now it is somewhere else but being that i was able to remove it was okay...UNTIL 8/5 I get another auto message stated...We are sorry to see you go.... That they cancelled my account, released my fax number and files are gone!!!  And would i explain why i cancelled??!!I immediately responded back telling them this same conversation and to date NOBODY has responded and it is now 8/9.  I lost 5 days of sending and my work is now backed up.  I also sent messages directly to website where i normally fax from and again the 24/7 support has not responded either,i have the email of the correspondence and the person who responded and told me they understood and that it was fine.  The site is amazing otherwise but NOBODY she be forced into keeping their debit or credit out on an outside source.  Why can't the info be removed until the next payment is due???  Why not have that option like most business do.  If they DO NOT pay on time of course you would cancel.  So I paid 10.00 for 8 days, lost the rest, have no fax number or files available.  I feel this is very unjust.  Disappointed8/13 update NOT ONE RESPONSE8/29 Still not one response.ALL DONE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Natalia S. David, PsyD, DBSM",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T16:16:55.000Z",
          "Titre": "I am unable to receive some faxes from…",
          "Contenu": "I am unable to receive some faxes from providers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TopDoc Marketing",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T15:17:16.000Z",
          "Titre": "Product is not as described",
          "Contenu": "Product is not as described. There are limits to use not mentioned in the description. They will only tell you this once you have purchased the product and refunds are not issued. Company does not stand behind their product. Any reputable company would allow 100% refunds for a service that was unused, and canceled within minutes of purchasing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Neysha Sanders",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T19:42:59.000Z",
          "Titre": "I SUBSCRIBED YESTERDAY",
          "Contenu": "I SUBSCRIBED YESTERDAY.  ISSUES EVER SINCE.  WHEN I DOWNLOAD THE PDF...IT LOOKS NORMAL TILL YOU PRINT IT.  ONCE YOU PRINT IT----IT DECREASES THE FONT AND IS ADDING A BORDER.....WORST CUSTOMER SERVICE EXPERIENCE I HAVE HAD.  THE REP....CHOOSES TO ARGUE WITH ME CONTINUALLY IN EMAILS ALL DAY.  EVEN HAS TOLD ME TO NOT USE ALL CAPS IN MY RESPONSES BECAUSE THAT APPEARS AS ANGER.WHAT DO YOU EXPECT WHEN YOUR ARGUING WITH A CUSTOMER ABOUT WHAT THEY KNOW IS OCCURING AND EVEN SENDING YOU PROOF.  WORST SERVICE EVER.SANDERS LAW FIRM"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T20:17:06.000Z",
          "Titre": "Online Fraud",
          "Contenu": "They call themselves a “serious company” but watch out when you create your online account to start using their service: they will not clarify what you are signing up for. In fact, this will appear in a very small written sentence at the bottom of the page, as if it was something irrelevant - when instead it is the main point of your subscription - and puff!! you find yourself subscribed to a monthly payment plan with automatic billing. Customer care “obviously“ complicit in this fraud.Good luck with HumbleFax!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Leonard",
          "Nb_Reviews": 1,
          "Date": "2020-04-13T18:36:44.000Z",
          "Titre": "Where is the 0 Star Button?",
          "Contenu": "Worst service I've ever attempted to use.  After 2 months they decided that unlimited doesn't really mean unlimited despite only using 900 pages in this COVID-19 era of having to work virtually.  This is extortion.  The e-mails they send back and forth are the absolute worst too.  As though it's my fault I purchased an unlimited plan that they had no intention of honoring.  Stay far away from these people."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Eric Cashmore",
          "Nb_Reviews": 1,
          "Date": "2020-03-23T03:30:31.000Z",
          "Titre": "Terrible Customer Service",
          "Contenu": "I just started a non-profit in Canada and was going to use these guys for my faxing needs until I received a really rude email from them when I asked if it was possible to get a discount on the services. We weren't expecting a yes, but they didn't have to be mean about it. I wouldn't recommend these people if you're looking for good customer service!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Arezu Sharghi",
          "Nb_Reviews": 2,
          "Date": "2019-12-30T18:52:24.000Z",
          "Titre": "Awful company",
          "Contenu": "Awful company. First the don't tell you the fees upfront and then they keep updating the price. I have a credit card attached to the profiles that is valid for another month and half and they have suspended the account for the credit card getting expired in 45 days! They are new to business and don't know how things work. I do not recommend this company at all."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Andrew Youssef",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T19:32:52.000Z",
          "Titre": "The program worked fine although it's…",
          "Contenu": "The program worked fine although it's limited to 25 fax numbers at a time which is far behind their competitors at 50 fax numbers at a time...but they advertise unlimited fax...and once I reached 300 or so, they emailed me, suspended my account, and asked me to pay more for another account. They bring you and and and then try to gouge you. Far from humble."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lesley Nicole",
          "Nb_Reviews": 2,
          "Date": "2019-09-23T21:10:58.000Z",
          "Titre": "I tried to order humblefax in July…",
          "Contenu": "I tried to order humblefax in July 2019. The service did not work, and customer service was horrible. I used my cashapp credit card  and just noticed that they charge it every month and refuse to refund my money for a service I never recieved. Just another Con artist on the internet. Its really disgusting how people go out of their way to fraud decent customers. Shameful"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Office manager",
          "Nb_Reviews": 1,
          "Date": "2019-12-03T15:47:07.000Z",
          "Titre": "They increase my monthly fee to $30!!",
          "Contenu": "They stated it is $10 per month for unlimited faxing but this is incorrect. They increased my rate to $30 in less than a month because they stated I’m using the service too much. What it makes it bad service, they increase my rate and they asked me to pay in 2 days or they will suspend my service. I could not cancel right away because I had to port my line to another company before finally I canceled my service with them. They have no respect for their customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2020-05-28T19:19:05.000Z",
          "Titre": "I have sent numerous requests to this…",
          "Contenu": "I have sent numerous requests to this company to obtain login information. They charged my card immediately but will not contact me so I can access my account and there is no contact number to call them. I am hoping they see this since they manage to flag any non 5 star review of their company right away!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SA",
          "Nb_Reviews": 2,
          "Date": "2020-04-30T18:24:47.000Z",
          "Titre": "Baaaad fax service",
          "Contenu": "Baaaad fax service, faults advertising, it's not unlimited like they advertise,  they take take their time to solve your issues, bad chatting support and unprofessional,  stay away ,they question you why, what for, when ,where, seem they enjoying playing with their clients, stay awaaaaaaay."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Douglas Wellington",
          "Nb_Reviews": 1,
          "Date": "2020-05-17T13:23:02.000Z",
          "Titre": "Horrible",
          "Contenu": "Horrible, I am counting the ten dollars as a lost and running away now. I signed up and it says it cannot connect to the server. I emailed customer service with no response. Run as far away from this company as you can it is a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andy",
          "Nb_Reviews": 1,
          "Date": "2020-12-29T14:32:53.000Z",
          "Titre": "Humblefax False Advertisement",
          "Contenu": "Humble fax advertises that it is unlimited pages fax for one price. Then, we they know that you uses it for a month and have transferred your number over to them, they increase the price using different tactic. First they say the unlimited deal doesn't apply to business plans. Then, they said it doesn't apply to services that need to transmit faxes with patient information due to HIPAA rule. When asked what they would do differently once I pay the increased price, they said they would have a trail of faxes so we can manage the faxes (which was already done). They would come up with all kinds of reasons to increase your monthly once you subscribe to them. I'm sure they would screen this review out and would never put the truth on their website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Byron Maynard",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T18:15:09.000Z",
          "Titre": "I would not recommend using this…",
          "Contenu": "I would not recommend using this company.  The owner/CEO does not want to talk to vendors or customers.  This, to be sure, is passed down to the staff.  There are better companies to work with that do not mind helping their customers.My reply to Adam:Adam, you were less than polite.  If your goal is to teach your customers how you want to do business, it was not handled appropriately.  We received the message loud and clear, you do not want our business.  Glad we found this out now, rather than later when there are a lot of our clients on board.  We will work with another vendor that wants to support our needs.  We will also switch out our current clients that are presently using the service.  You and I have no ability to communicate effectively."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Zagara",
          "Nb_Reviews": 1,
          "Date": "2019-09-10T14:38:47.000Z",
          "Titre": "They clearly advertise unlimited faxing…",
          "Contenu": "2 big issues with humble fax. First, On August 2,  I paid them $10.00 for their monthly service. They activated my account. Then on August 16, they suspend my account for lack of payment. Last time I checked August 2 to August 16 didn't constitute a month. Second, they clearly advertise unlimited faxing for $10.00 per month. Then they tell me I used their service too much. Apparently, I faxed too many pages with their unlimited service.  I tried to explain that I didn't know that unlimited equaled limited they told me I could go on their $40.00 per month plan. When I said no thank you, I am not giving you any more money you just close my account. But they didn't. They continued sending me emails EVERDAY demanding payment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T14:06:44.000Z",
          "Titre": "Very poor communication when I needed…",
          "Contenu": "Very poor communication when I needed assistance. Appalled that I have to PAY Humblefax to have MY FAX NUMBER ported out to another platform. Very disappointed and will not recommend."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Rohit John",
          "Nb_Reviews": 1,
          "Date": "2020-10-08T18:31:42.000Z",
          "Titre": "It's surely a fraud company as they…",
          "Contenu": "It's surely a fraud company as they started with $10 unlimited fax and then next month they billed me $25 and within 15 days they stopped my services as billed me $45."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "P Nua",
          "Nb_Reviews": 1,
          "Date": "2019-12-18T17:11:07.000Z",
          "Titre": "I should've believed the other…",
          "Contenu": "I should've believed the other customers when they reviewed this company!! Boy was this a hard lesson to learn. It was all good with HumbleFax the very first month, until we hit 200+ faxes then we were experiencing ALOT of issues (faxes failed and 80% of our faxes we were not receiving from clients due to error messages).  We emailed the VERY general customer service email cusotmercare @humblefax.com and we got a very condescending and unprofessional person responding to us and telling us our concerns are not valid because our clients should \"NEVER\" be receiving the messages they were actually receiving, even though we gave them printouts and confirmation messages to prove it.  THIS COMPANY IS A NIGHTMARE!! Save your money and your sanity, use Fax.Plus, eFax, or any other company!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Francois",
          "Nb_Reviews": 1,
          "Date": "2020-03-24T21:23:30.000Z",
          "Titre": "So sad I can't Rate 0 star",
          "Contenu": "So sad I can't Rat 0 star. Don't trust them.Unlimited: FALSEI need to send xK faxes and ask before to create 10k contacts lists. They never answer me what is the maximum contacts, maximum faxes at a time. When I asked to simply tell me the truth. They answer: My anser: Well not really. If you tell me unlimited service. I’m not supposed to have limitations. Just one simple question. Why can’t you tell me what are the limitations. You know my needs and you still refuse to tell me what I can do and what I can’t. If you don’t what me as a user, simply tell me and I’ll cancel my account.Costumer Support answer: Thanks have a nice day. Your Support Team,They add by telling me \"You are not a costumer\" But they took my monthly subscription. Very bad costumer service. As we have multiple options they should be more gentle."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Milton Ares",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T05:01:56.000Z",
          "Titre": "Not unlimited in my HUMBLE opinion",
          "Contenu": "Watch the terms and conditions... I used the service for 8 months and never sent or received more than 200 pages total the entire time.  Today I HAD to send 1000+ pages to the same recipient.  I thought unlimited meant unlimited but not according to customer service.  I was labeled as a \"mass faxer\" even after explaining the situation to various people.  It works fantastically well until you actually need unlimited faxing.  This service restricted free service with unlimited bull feces.This is my actual usagePeriod\t         Incoming\t       Outgoing\t             TotalApr 20 - May 11\t15\t27\t19\t1095\t34\t1122Mar 20 - Apr 20\t41\t93\t5\t16\t46\t109Feb 20 - Mar 20\t18\t58\t9\t203\t27\t261Jan 20 - Feb 20\t38\t58\t9\t15\t47\t732020Dec 20 - Jan 20\t8\t24\t4\t18\t12\t42Nov 20 - Dec 20\t-\t-\t7\t49\t7\t49120\t260\t53\t1396\t173\t1656I used 173 incoming and outgoing faxed pages over 7 months.  Then I used 1006 pages today and this violated the TOS i call this tons of faxed  bull Sheet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alisa a",
          "Nb_Reviews": 1,
          "Date": "2020-05-05T19:14:23.000Z",
          "Titre": "Humble Fax Internet Faxing through a FOIP provides bad customer service when faxing fails",
          "Contenu": "The service that Humble Fax provides is limited. There is an hour response time before the fax let’s you know if there was a fax failure or fax confirmation and if the fax fails you’re left with the bill. Faxing large documents is not possible and even when you break down your initial fax into smaller sized documents the faxing tends to fail or send more pages than was originally in your documentation. Once you contact a representative from Humble Fax a shortened curt and rude response is given each time. Humble fax may possibly work for average one to five page documents but it simply didn’t work for me. I had to go out to an outside fax provider to have my fax properly sent through a machine that was not initiated by a FOIP. I asked for a refund and was told no repeatedly even after explaining my situation when the person responded “Huh?” to my email. Do not waste your time and money on this service there are other FOIP fax service providers that are more reputable and have a proper customer service team that responds with courtesy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Francisco Dima",
          "Nb_Reviews": 2,
          "Date": "2019-06-11T15:15:33.000Z",
          "Titre": "The worse service online",
          "Contenu": "The worse service online. Yes, I pay for this service for 3 months and when I needed to use it (2 months and 2 weeks) I was not able to access it. I was paying for a service that I know that is going to be there when I needed, and it was down. I had an emergency and it was very important to use the fax service with no luck. I end-up driving to UPS Store 45 miles away to send a fax. I asked HumbleFax for some kind of a refund with no luck. After I cancel my account they still to charge my credit card. DO NOT USE THEM FOR THIS SERVICE.UPDATE: I was not my password access to you sit, it was the website down for a long time. I understand that a site can be down sometimes, is that the fact it was down for such a long time. What was the possibility that your website was down only once in 3 months that I had the service with your? I was paying only to use it in case of emergency, where I did not had access to a store that can let me send a fax, when I needed too. You site was down for a very long time. So in the end your service is very unreliable, please avoid this company for service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Johnny",
          "Nb_Reviews": 1,
          "Date": "2019-06-18T06:17:54.000Z",
          "Titre": "Excellent when it worked!",
          "Contenu": "Warning: HumbleFax doesn't want you to see bad reviews, they try to report them to get them removed. Great service when it worked. Sleek UI. Faxes went through with confirmation, every time. I don't think I had really any bugs using HumbleFax. Setup was near perfect. A five star platform. Then I found my account suspended despite advertising all over the website and subscription for \"unlimited faxing\" forcing me to pay for an upgraded service several times the original $10 as originally advertised. Further inspection of reviews proves that my experience has been certainly replicated multiple times, so I am happy to find I am not being \"singled out\" and this is a pattern of behavior/abuse from the owner who I guess changes his mind about how much faxing is worth $10. I finally found the terms of service shows this and also that the owner can also inspect and read your \"confidential\" faxes raising some serious privacy concerns for sensitive information. Thank you HumbleFax for the great faxing experience while it lasted. I apologize for the one star review but having to pay considerably more for what was originally sold as $10 for unlimited faxing is a deal-breaker."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Info",
          "Nb_Reviews": 1,
          "Date": "2021-01-14T18:03:02.000Z",
          "Titre": "I had the worst experience with their…",
          "Contenu": "I had the worst experience with their customer service. Absolutely rude and unprofessional."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Nicholson",
          "Nb_Reviews": 4,
          "Date": "2020-11-02T22:16:40.000Z",
          "Titre": "Apparently there is no unlimited plan…",
          "Contenu": "Apparently there is no unlimited plan for a business. It is somewhat misleading IMO."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Shahbaz Haider",
          "Nb_Reviews": 4,
          "Date": "2021-02-26T19:19:32.000Z",
          "Titre": "Very very bad services",
          "Contenu": "No place of words to explain their services. In simple they lie everything."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "naposaurus",
          "Nb_Reviews": 48,
          "Date": "2020-07-22T19:35:54.000Z",
          "Titre": "Deceptive pricing - not unlimited",
          "Contenu": "Humble Fax homepage and FAQ say: \"$10 per month to send and receive unlimited faxes. No gimmicks, no hidden fees, no overage charges.\" ... however their Terms of Service say: \"The Company offers several account types, including but not limited to basic unlimited accounts for personal use, tiered accounts, and metered accounts. For individual, non-commercial use, we offer unlimited faxing accounts. Our tiered accounts accommodate customers with regular volume of faxes. Finally, we offer a metered option based on specific usage amounts.\"  So which is it? What is their actual pricing? The tiered or metered prices are nowhere to be found. (I have emailed the company and will update my review if they respond.)*** UPDATE ON 07-22-2020 ****When this review was originally posted, HumbleFax customer service tracked down my personal email and accused me of lying and violating TrustPilot terms of service (over the course of several emails). I did ask them what their actual pricing was but they never replied. Since then, they took down this review twice, first because I was \"not a customer\", and the second time for \"defamatory statements\" (thankfully, TrustPilot's customer service intervened and re-instated my review). As you can see on the company activity page they've flagged over 95% of their negative reviews, probably for similarly made-up reasons.For what it's worth I am currently using SRFax, it's reliable and cheaper than HumbleFax."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S. L Jones",
          "Nb_Reviews": 1,
          "Date": "2019-04-19T18:19:52.000Z",
          "Titre": "Expensive",
          "Contenu": "Too costly! The cost in comparison to others is extremely too expensive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chad O",
          "Nb_Reviews": 1,
          "Date": "2019-05-07T22:08:34.000Z",
          "Titre": "The old bait and switch (high tech version)",
          "Contenu": "I absolutely loved this service the first couple of months. $10 dollars a month for unlimited faxes? What a deal! Things changed soon after though. My service was interrupted and I was instructed to re enter my billing information and the new rate would be $20 per month. In the email I was told the business rate was $20 per month ; therefore, I had to pay the higher rate. Fair enough I guess, even though the website had no obvious statements regarding personal versus business rates, just unlimited. I decide it must be buried somewhere in the terms and just decided to move on. Fast forward to the next month. Once again, my service is interrupted and I'm am asked to pay an increased rate, $30. I sent 3 or 4 emails asking a few questions for clarification purposes: what are your rates in addition to the unlimited plan, will my service be interrupted every month if my volume continues to vary, where in the terms is this discussed etc.... Every response consisted of 1 or 2 vaguely construed sentences that inferred I am getting a quality service for the lowest available price. None of my questions were answered. To be fair my volume increased from about 800 to 2000 pages, but I was not warned my service would be interrupted if my volume changed. I still cant get a response as to what their \"true rates\" are.  I  also requested a returned phone call  that has not happened. Very frustrating!Update, another vague response just received:Generally we try to charge .02 cents per page. Your Support Team,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cassandra crotinger",
          "Nb_Reviews": 1,
          "Date": "2020-06-22T14:22:48.000Z",
          "Titre": "Takes way to long to fax something and…",
          "Contenu": "Takes way to long to fax something and most of the time it failed!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Oh",
          "Nb_Reviews": 1,
          "Date": "2020-05-09T15:03:50.000Z",
          "Titre": "1) They deactivate my account",
          "Contenu": "1) They deactivate my account2) When they deactivate your account, you cannot even login to cancel or to change any account setting3) I sent them an email to let them know that I could not login to cancel, so please cancel on their end. 4) Received no email5) Today morning they reactivated my account and charged me again6) I send an email to customer service complaining that their actions did not make sense to me.  They tie my hands behind my back, I couldn't cancel my account, I sent them an email, but they ignore it and reactivate my account and charge me for two months I did not use the service.  7) Then they deactivate my account stating for \"non payment\"So, they charge me for two months and lock you out so you cannot make changes, then when you ask for refund they file you as \"non payment\" and close your account while not issuing you a refund.  What in the world is going on.  This is run by an individual owner of some sort, you may run into the same issue as me.  Their demeanor and their response is very crude and unprofessional.   I would avoid at all cost!Here is their reply. \"Sir, our service will keep billing you until you cancel. That is how all subscription services work. In this case, it costs us money to renew the phone number associated with your account every month to keep it active with your account. If we stopped billing you then you would lose your number.Please stop using accusatory language, we did nothing wrong here.Your Support Team,\"\"Dear Iamsueoh,Your account was deactivated for non payment. Is this a jokeYour Support Team,\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ingrid Roca",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T22:13:55.000Z",
          "Titre": "I could not send any outbound faxes but…",
          "Contenu": "I could not send any outbound faxes but not clear why."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cheryl Harrison",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T00:45:00.000Z",
          "Titre": "Customer Service is not helpful"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ramin Badri",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:16:43.000Z",
          "Titre": "Customer service doesnt respond at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sheetal",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T17:07:19.000Z",
          "Titre": "1)Each and Every fax after downloading…",
          "Contenu": "1)Each and Every fax after downloading we have to salve the fax . There should be option of direct installation of icon selection (same like printer ) so that we can directly fax the same document from another software .2) After receiving the continuous fax pages we can not separately  save the each page of faxes ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan B",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T23:24:13.000Z",
          "Titre": "It's okay",
          "Contenu": "It's okay, the price is a bit high. They also do not have a mobile app to view and send faxes"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sean McHale",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T13:51:01.000Z",
          "Titre": "not extremely pleased",
          "Contenu": "I am not extremely pleased with my relationship with humble fax.com. The customer service is strangely set up to where they will not call customers, nor do customers have access to speaking with someone on the phone regarding an issue. I find this troubling, especially when I have immediate questions that need a simple answer but I have to send an email and wait sometimes more than a day just to get a response. And when I get those responses, it’s usually the same response I received the day earlier, which is frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roc W",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T19:45:11.000Z",
          "Titre": "I love you don't need a telephone line…",
          "Contenu": "I love you don't need a telephone line to fax documents and can see all your information on the computer.  I also love you can add different accounts to the same number.  What I don't like it takes like 40 minutes sometimes for documents to be accepted with this fax service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica McIntire",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T21:57:49.000Z",
          "Titre": "So far seems to work well except the…",
          "Contenu": "So far seems to work well except the small files you're able to send. I tried to upgrade but am having issues"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Robina Services Inc",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T19:32:46.000Z",
          "Titre": "Great system for faxing on the go…",
          "Contenu": "Humble fax should create a user friendly app for iOS mobility users. However, creating a “shortcut” to the home page provides a good working alternative! Works Great :)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sandra Narvaez",
          "Nb_Reviews": 2,
          "Date": "2022-08-03T15:31:44.000Z",
          "Titre": "Lack of a customer service direct contact via phone",
          "Contenu": "Hello.  I did a fax test and came very good.  The only reason that i am giving you 3 stars is because there is not a way to contact directly a customer service.  Only via email, and that is a big no when a customer needs a fast response.  It took several weeks for the line to transfer and if i would have been able to do a conference call between both parties, it should have been much faster the line transfer, but it was impossible to talk with a human being through a phone call.  I was extremely busy and I had to be working as the middle person between both companies.  Hopefully that would be improved shortly.  Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Prefer Not To Say",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T16:42:15.000Z",
          "Titre": "Great Fax Service... Not So Humble Customer Service",
          "Contenu": "I have been with Humble Fax just over a month and while the service works as advertised the customer support is anything but humble."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elena Panutich",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T23:25:37.000Z",
          "Titre": "Poor customer service",
          "Contenu": "The line would work for a week and then stop working for unknown reason. Restarts in a week, works for a few days and stops working again. Poor customer service with autoreplies  through e mail"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paralegal4Texas",
          "Nb_Reviews": 3,
          "Date": "2023-04-16T07:40:30.000Z",
          "Titre": "Well",
          "Contenu": "Well, my understanding is that I would be charged $10.00 once a month.  However, it seems every time I used the fax I was charged every time I used it.  So I am going to stop using it and go with another online company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shy Cameron",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T16:38:02.000Z",
          "Titre": "I really like the service BUT!",
          "Contenu": "I really like the service. It has a very professional feel. But I pay $10 per month just in case I need to send or receive a fax. So far I haven't, in which case the service is costing me more than what it is worth. I would like a pay per use option."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy Sawyer",
          "Nb_Reviews": 3,
          "Date": "2023-03-21T15:30:29.000Z",
          "Titre": "Its ok with limitations",
          "Contenu": "It’s good, but can’t fax more than 10 pages at once. The website states if you need to fax more pages, click for an upgrade but that has never worked. The price is right, though"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathleen E Mosher",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T17:22:46.000Z",
          "Titre": "I like the outgoing but incoming is too…",
          "Contenu": "I like the outgoing but incoming is too small to read.  HELP!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T18:41:40.000Z",
          "Titre": "Great way to fax",
          "Contenu": "Great way to fax. It's easy to use. However, it takes over 13 minutes for a fax to send"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roy Weinberg",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T14:28:31.000Z",
          "Titre": "Overall it is good",
          "Contenu": "Overall it is good. Unfortunately a few faxes were sent incorrectly. For some reason the process turned one of my pages sideways. As a result, the recipient received a partial fax. This is a bit troubling because I am filing a legal document and I am being charged a large fee by the receiver."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Cynthia Perrett",
          "Nb_Reviews": 1,
          "Date": "2020-08-26T13:59:08.000Z",
          "Titre": "Great Service, False Advertising",
          "Contenu": "Great fax service, but absolutely not 'unlimited'.  After reaching a threshold I was not told existed - my account was locked without notice.  To get it unlocked I had to wait over 8 hours for a response (I could not fax during this time), and was made to pay double to original (advertised) price. ~review before account suspension and payment increase (unsure about the last part now!)~Best fax service ever! Easy to use, with so many great extra features (scheduled faxing, contact saving to name a few) Highly recommended - I will be a customer for life."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Harold D. Carr",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T16:07:55.000Z",
          "Titre": "Not for Business such as Law firm.",
          "Contenu": "I thought As a business office we could use your service and after we signed on we found out your charge for HIppa service is too much and attachments are not easy to attach such as PDF files and Letters."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert McVeigh",
          "Nb_Reviews": 1,
          "Date": "2020-07-04T19:03:22.000Z",
          "Titre": "I have been using Humble fax for 2…",
          "Contenu": "I have been using Humble fax for 2 months now.  And I am very pleased with it, so you may be wondering why did I only give it 3 stars???  IT LITERALLY TAKES UP TO 10 MINUTES FOR FAXES TO PROCESS."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Blaire Chrouser",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T17:10:48.000Z",
          "Titre": "It's slow",
          "Contenu": "It's slow, very slow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trav",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:42:10.000Z",
          "Titre": "Price vs Quality",
          "Contenu": "I used other companies and the quality was not very good.  When I switched to Humble Fax I was very pleased to see that their quality was impeccable. The fax looks like it was a document that I created and printed.  I will never go back to the other services.  The price is very reasonable, especially for the quality.  Humble Fax is the best service.  Five stars for sure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy Lawrence-Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T17:52:06.000Z",
          "Titre": "Generally I am satisfied with Humble…",
          "Contenu": "Generally I am satisfied with Humble Fax - I like the low $10 monthly fee and how both received & saved faxes are saved. The only reason I didn't give them 5 stars, was that it takes so long to send faxes - close to 3 minutes for only 2 pages and maybe half an hour for maybe 18 pages."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paris Strange",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:44:35.000Z",
          "Titre": "Hassle Free, So Easy To Use",
          "Contenu": "Easy and secure way to fax documents. No hassle and very user friendly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric R",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T19:10:08.000Z",
          "Titre": "Less then a dedicated phone line and useful from anywhere.",
          "Contenu": "I signed up with humblefax as it is less monthly then getting a line in for my fax and I can use it when I am not at home. So far the couple of faxes I have sent have been good quality and sent quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christina Mennear",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T19:22:36.000Z",
          "Titre": "Awesome fax service",
          "Contenu": "This is very reliable in sending and receiving faxes.  I love that it keeps them all so if I need to resend a fax, I don't have to recreate it; instead, I can just click resend. I have to spend more time playing around in it because I'd like to have a fax coversheet that I use as my standard one I can go to and  just have ready to use.  Overall, so far, it has been great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed Fickey",
          "Nb_Reviews": 5,
          "Date": "2023-09-12T15:34:17.000Z",
          "Titre": "Almost great",
          "Contenu": "Almost great. I was a very long-term client of another online fax company that did less as time went on, but charged more, now more than double what I started paying initially. Humble couldn’t port my old number because the ex dropped me when I asked to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Folasade Alintunde",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T15:08:44.000Z",
          "Titre": "It will be nice if there is a live…",
          "Contenu": "It will be nice if there is a live person to speak to when a need arises. My business needs all eyes which includes my online fax for security reasons. But so far I have no issues with the company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Culver Tax Center Plus",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T19:26:54.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Maintains a record of sent faxes.  Reasonable pricing.  C"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teresa Pigg",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T15:07:08.000Z",
          "Titre": "I love the ease of use and there is a…",
          "Contenu": "I love the ease of use and there is a digital trail to verify sent faxes. The only critism I would have is that I have trouble receiving faxes sometimes.  There is a communication error.  I'm not sure if it is on Humblefax's end. It could be an error on the senders end. As if now, it suits the need of my business and ua very reasonably priced, without the need for any additional equipment"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pixie",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T10:45:14.000Z",
          "Titre": "I have been using Humblefax for about a…",
          "Contenu": "I have been using Humblefax for about a year now and it is the best thing. No issues until today. The 3 little dots beside the day/date isn't working anymore for me. I like to click there and download received faxes. Was working fine this morning but then the little pop up wouldn't come up anymore when I clicked on them. If anyone else has had this issue, please let me know how you corrected it. Other than that, I highly recommend Humblefax!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T16:15:26.000Z",
          "Titre": "It is very easy to use and beats having…",
          "Contenu": "It is very easy to use and beats having a fax machine, hands down. Support has been responsive, though it is email/form only.Set up was lengthy because we switched our number over and we did have some initial problems with the number getting a service error, but this was straightened out fairly quickly. We love having multiple users being able to independently log in access the account and send faxes. Keep in mind when adding users, that all emails receive all faxes. If you have someone that routinely gets very sensitive information, they should be set up with a separate account that isn't shared with other users. (There are some limits you can put on, but I'm not certain if any would solve this issue, as we do not limit any of our users)We would definitely recommend this service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Giovanni Bencomo",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T17:28:30.000Z",
          "Titre": "The functionality and ease of use of the app meets, nah, exceeds my expectations.",
          "Contenu": "The functionality and ease of use of the app meets, nah, exceeds my expectations.I would like to ability to fax using email: I can send an email to a an address linked to my fax which then converts the email into a fax."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T16:28:30.000Z",
          "Titre": "Love having unlimited faxing",
          "Contenu": "The unlimited faxing with Humblefax has  been a nice change. I wish there was no limit on the size of the attachments, but otherwise I'm very happy with this service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "stacey boscia",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T20:49:57.000Z",
          "Titre": "Convenient that I don't need a…",
          "Contenu": "Convenient that I don't need a telephone line... sometimes it's a slow connection but overall good value for the money I would recommend!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Baxley",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T17:44:18.000Z",
          "Titre": "Humble fax is a simple and powerful…",
          "Contenu": "Humble fax is a simple and powerful online fax service. The company appears to be a smaller organization, from what I’ve noticed when interacting with its customer service or support department. Over the past few months, they have redesigned and enhanced their user interface dashboard, which has a simple and easy-to-navigate interface. I don’t do a ton of faxing, but when sending most documents related to medical, to be compliant with HIPPA, companies/organizations often require documents to be faxed. Cheers to a beautiful product, give Humble a try."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rocky Coley",
          "Nb_Reviews": 7,
          "Date": "2023-01-24T13:25:48.000Z",
          "Titre": "Not that bad",
          "Contenu": "The faxes are not that bad, if they are scanned into your computer. If the papers are plain white paper, they look very good but if they are anything else you have a hard time seeing them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Perkins",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T16:09:44.000Z",
          "Titre": "Perfect for Small Businesses",
          "Contenu": "All my employees work from home, so this has been perfect for each of them to be able to send faxes from when needed. The only thing that kept me from giving it 5 stars is that everyone can see sent faxes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BSM - Freeport",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T20:59:46.000Z",
          "Titre": "Simple low cost alternative",
          "Contenu": "When phone carrier discontinued use of fax lines, humble fax served as a simple low cost alternative.  Government agencies and some medical/insurance companies will not convert over to email correspondence."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa Jones",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T16:11:44.000Z",
          "Titre": "I had no problems or issues using…",
          "Contenu": "I had no problems or issues using humble fax I am at the beginning stages with this company. been great so far"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D Coates",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T20:39:45.000Z",
          "Titre": "Humble fax is easy to use",
          "Contenu": "Humble fax is easy to use, and very affordable. I appreciate HF attention to customer service, too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel Langley",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T16:26:32.000Z",
          "Titre": "I love being able to manage all my…",
          "Contenu": "I love being able to manage all my faxes digitally, no paper wasted."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Ung Huh",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T18:29:02.000Z",
          "Titre": "Easy access",
          "Contenu": "Easy access, easy to use.  The price is lower than any other online fax service.  Love humblefax."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mandi",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T15:35:30.000Z",
          "Titre": "It is so user friendly!!",
          "Contenu": "It is so user friendly!!! I love having it on my computer and not having to go to another machine in another office."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Autry",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T11:14:48.000Z",
          "Titre": "I chose Humblefax because it allows me… to manage my teams' faxese",
          "Contenu": "I chose Humblefax because it allows me to use multiple email addresses and the cost is soreasonable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Olivia",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T20:07:20.000Z",
          "Titre": "Great support for remote work",
          "Contenu": "Great support for remote work! With a team in multiple locations that relies highly on remote and mobile work environments, Humblefax has become essential to meeting our continued communication needs from any location!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Acupoint Acupuncture Inc",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T18:17:58.000Z",
          "Titre": "owner",
          "Contenu": "Easy and convivence"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa Collier",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T16:42:22.000Z",
          "Titre": "Reasonably priced and Easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 3,
          "Date": "2023-03-06T17:17:44.000Z",
          "Titre": "I've been using the fax service for…",
          "Contenu": "I've been using the fax service for close to a month now. It seems a little slow. But, seems to work pretty well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Baroness’ Bum",
          "Nb_Reviews": 4,
          "Date": "2023-03-08T16:13:21.000Z",
          "Titre": "Excellent fax function to my busy…",
          "Contenu": "Excellent fax function to my busy duties."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarai",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T18:03:25.000Z",
          "Titre": "Absolutely love it!",
          "Contenu": "Overall great service and easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick Suglia",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T18:36:07.000Z",
          "Titre": "Great service that comes with a big BUT",
          "Contenu": "Great prices and ease of use. But they don't have on their website anywhere that the \"unlimited\" plan is for personal, non-commercial, use only. I don't know any individual who is not a business that would ever need an unlimited plan. Businesses beware! You NEED to read the \"terms & conditions\" before signing up. Otherwise, I have no complaints."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Navinchandra M Ruparelia,MD",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T19:06:32.000Z",
          "Titre": "Customer support good",
          "Contenu": "Customer support good. They would increase page limit with each fax from 100 to 400pages as our's is doctor company which send out  Medical records,which are at times 400 to 500 pages or more than 10 pdf files or folder, but they set back to their limit to 100 pages etc. Is this limit for my company to 500 pages constant as we want to keep Humblefax  permanently till we practice medicine. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zac",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T20:01:17.000Z",
          "Titre": "Super easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tonya Dishmond",
          "Nb_Reviews": 2,
          "Date": "2020-06-26T13:52:58.000Z",
          "Titre": "Humble works great and the price is…",
          "Contenu": "Humble works great and the price is right considering I don't use the fax that often but its available when I need it.  The only reason that I gave a 4 star rating instead of 5 is because it takes so long for the fax to go through when sending it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2021-08-30T13:49:20.000Z",
          "Titre": "Ability to add a disclaimer",
          "Contenu": "In my career, regulators require a disclaimer to my fax cover sheet.  In Humblefax, I can store a header but not a disclaimer.  I'd like the ability to use a disclaimer in the coversheet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NAVRISHAM KHAIRA",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T17:41:41.000Z",
          "Titre": "Its quick and professional"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan Dolan",
          "Nb_Reviews": 2,
          "Date": "2021-06-15T14:35:33.000Z",
          "Titre": "Probably be five star but I am just…",
          "Contenu": "Probably be five star but I am just learning system.Works quickly and efficiently, have not had any of the faxing issues that I have dealt with the traditional fax method.  I like it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "omillbro",
          "Nb_Reviews": 2,
          "Date": "2022-10-11T17:03:21.000Z",
          "Titre": "good service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Megan Gaw",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T14:54:49.000Z",
          "Titre": "I like being able to receive faxes…",
          "Contenu": "I like being able to receive faxes through email, but there was some kind of glitch where I was receiving the same fax over and over. I think I received it eight times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ellen Sauchelli",
          "Nb_Reviews": 2,
          "Date": "2021-11-01T13:47:36.000Z",
          "Titre": "Not for super large docs",
          "Contenu": "It was only ok, needed to send a large document but even the paid subscription didn't allow for it.  Finally got it to work after splitting it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron Lipman",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T16:46:02.000Z",
          "Titre": "The app works well and easy to use",
          "Contenu": "The app works well and easy to use.  My only complaint is you have to sign into app to get info, I know I know, I'm being lazy..All in all works well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roman Brushtein",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T14:12:59.000Z",
          "Titre": "Overall",
          "Contenu": "Overall, the program is very good. The way to review incoming faxes could be more advanced"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah L Arce",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T15:10:40.000Z",
          "Titre": "Easy n user friendly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ARIBA BETTS-NUNEZ",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T14:39:14.000Z",
          "Titre": "I like it pretty much",
          "Contenu": "I like it pretty much, but I think it takes to long to send"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leo Palang",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T05:05:58.000Z",
          "Titre": "Simple dashboard and priced right fax…",
          "Contenu": "Simple dashboard and priced right fax service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wendy Lee",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T14:10:36.000Z",
          "Titre": "Easy and fast to set up",
          "Contenu": "Easy and fast to set up.  Very affordable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Spanos",
          "Nb_Reviews": 3,
          "Date": "2020-08-31T14:07:48.000Z",
          "Titre": "Program has worked great for us..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keyi Yanf",
          "Nb_Reviews": 1,
          "Date": "2020-10-26T22:13:32.000Z",
          "Titre": "Good",
          "Contenu": "Good. Please don’t wast my time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yvette Zriouil",
          "Nb_Reviews": 4,
          "Date": "2019-10-24T21:40:39.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JHC",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:00:52.000Z",
          "Titre": "It's the easiest online fax system I…",
          "Contenu": "It's the easiest online fax system I have ever used. Complete with notices to let me know what I have sent has finished sending-with formal confirmation. My work is such that I require proof of documents being exchanged. This is my go to...to get things accomplished."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon Emerick",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T17:37:21.000Z",
          "Titre": "Reasonable prices and great service!",
          "Contenu": "I transferred to HumbleFax from another company that wanted to raise my rates. The transition was extremely easy; they helped me cancel my other service and were very friendly and helpful. Faxing is quick and easy and their prices can't be beaten!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christian Apodaca",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:32:28.000Z",
          "Titre": "A simple but great tool",
          "Contenu": "A great, cost effective, and simple tool that is invaluable for modern businesses. I have been using this for years and it is just as reliable as any other E fax or traditional fax. I like being able to reference my historical inbound and out bound faxes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeevan S. Rampersad",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:00:12.000Z",
          "Titre": "Useful and great value for my law firm.",
          "Contenu": "I needed a virtual fax for my business card and letterhead. I did not realize how useful fax still is because you receive delivery confirmations. The platform is easy to use and the confirmations are great! You can download them as proof of submission, just like an old fax. Faxes typically are quick- done in about 1-2 minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G L",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:17:25.000Z",
          "Titre": "I love Humble Fax",
          "Contenu": "I love Humble Fax. It's quick and inexpensive.  Now I can fax important documents knowing they will arrive securely. Thank you Humble Fax."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mandy Hart",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T08:58:57.000Z",
          "Titre": "Excellent!",
          "Contenu": "Humble fax has been excellent for my needs. Quick and easy faxing without the hassle of needing to deal with paper forms. I definitely would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:35:25.000Z",
          "Titre": "Being able to fax from home is so…",
          "Contenu": "Being able to fax from home is so convenient, no going to ups or libraries is just great. I love it, easy to setup and not too expensive No downside for me Thank you"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "CHARLIA EWING",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T18:26:47.000Z",
          "Titre": "Outstandingly quick easy and instaneous…",
          "Contenu": "Outstandingly quick easy and instaneous set up. I started using it in an Uber when I learned Documo had stopped personal accounts. Most faxes are sent and received within 2 minutes. Rates are very affordable. This is what tech is for. EASE SPEED.  Been a customer 3 months."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine Sweeting",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:03:42.000Z",
          "Titre": "since we have gotten Humblefax",
          "Contenu": "since we have gotten Humblefax, we have had no problems sending faxes which contain multiple pages - would recommend to anyone needing a fax service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula J Buerger",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:25:38.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use.  Fax in and out are easy to send/receive.This program has helped me exchange information with my doctors, giving me quicker access to medical care."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Camper",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T01:56:17.000Z",
          "Titre": "FIVE STARS",
          "Contenu": "I am giving Humblefax five stars due to the fact that when they advertised \"unlimited\" they were telling the truth.  Not the case with two other services I tried.  It is also surprisingly simple to use.  Social Security decided they had to have 18 months of bank and card records, HUNDREDS of digital pages, but technology-wise SSA could RECEIVE ONLY FAXES!  No uploading ability whatsoever!  The documents in groups took about 20 minutes each, but were all successful. Humblefax saved the day.  Additionally the Customer Service email questions I sent were immediately and intimately addressed.  In a world of flawed and unsatisfactory products and experiences, thank you Humblefax."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chasse Crandall",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:37:04.000Z",
          "Titre": "HumbleFax has changed the way our company faxes!",
          "Contenu": "HumbleFax has changed the way our company does faxing and we're obsessed. Not only is it easier and more convenient than classic landline faxing, but it is cheaper. Even porting our number over was easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Whitnee Arenas",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:37:04.000Z",
          "Titre": "highly recommended.",
          "Contenu": "Super easy to navigate. Very efficient for home offices and small businesses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carter k Clark",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T00:37:11.000Z",
          "Titre": "affordable and easy to use...",
          "Contenu": "This a great and easy way to have a portable fax for your business. Works great and very affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr.Russ",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:53:41.000Z",
          "Titre": "Mobile Office",
          "Contenu": "It’s a great app to help with faxing especially my mobile business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T19:33:00.000Z",
          "Titre": "The Best I Found",
          "Contenu": "After research and reviews, they have the best price for my Page needs & the Srvc / Software / Layout is modern and works just great. I am very pleased with the experience as I am not running a business but need it for personal Family affairs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toni Kelly Counseling & Consul",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:38:10.000Z",
          "Titre": "The Only fax service to Have!!",
          "Contenu": "First off I was switching phone providers and I needed an online fax service with email faxes and other services. The provider I was referred to by my phone company wanted an outrageous amount per month. Close to 50 bucks if not over. Then I found you all. You were courtesy, efficient and I was up and running in a matter of minutes. There is no other service offering what you do for the price you offer or that has the impeccable service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucretia Parker",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:59:45.000Z",
          "Titre": "Humblefax has made it very easy to send…",
          "Contenu": "Humblefax has made it very easy to send and receive e-faxes! I also enjoy receiving notifications that a fax was sent successfully, it gives me reassurance that my secure documents are being delivered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Coleman Younger",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:53:05.000Z",
          "Titre": "Simple, consistent fax",
          "Contenu": "The system is consistent, super easy to use, and does a great job with alerts. I've never had an issue with a receiver, and this is cheaper than adding a phone line for a fax machine!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monique",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T03:58:16.000Z",
          "Titre": "Humblefax is highly convenient",
          "Contenu": "Humblefax is highly convenient. When presented with the choice to snail mail or e-fax at a comparable cost, there was one obvious choice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Howland Agency LLC",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:01:34.000Z",
          "Titre": "The ease of the faxing",
          "Contenu": "The ease of the faxing, composing, and sending the fax. The ease of it being online is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T05:04:07.000Z",
          "Titre": "Quick and easy way to fax",
          "Contenu": "Quick and easy way to fax. Much much cheaper than competitors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felicia",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T16:44:23.000Z",
          "Titre": "My experience with Humble has been…",
          "Contenu": "My experience with Humble has been great. Im able to send faxes without having an actual old school fax machine it is great and convenient"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colleen Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:04:18.000Z",
          "Titre": "It was so much easier",
          "Contenu": "It was so much easier, giving the number out and having it come right to my email. No extra machine or option needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin White",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T21:02:29.000Z",
          "Titre": "Who the heck has a fax machine anymore??",
          "Contenu": "Who the heck has a fax machine anymore, especially if you are an individual?  Humblefax has made the need for a fax machine super convenient and very affordable.  For $10 a month, I have unlimited faxing capability and no contract and I can pull my reports anytime I need them.  I highly recommend this as I looked at several other sites first and they were not nearly as user friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stetson Holman",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:57:04.000Z",
          "Titre": "I trust and recommend Humblefax to…",
          "Contenu": "I trust and recommend Humblefax to serve anyone needing a faxing service who wants to axe the bulky machines and chords in the office! Humblefax is easy to use and provides an essential service to professionals like me who are required to use fax communications regularly to get quality work done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa M Dinger",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T16:40:35.000Z",
          "Titre": "Used this software to fax POA documents…",
          "Contenu": "Used this software to fax POA documents from home while caring for my uncle who was recently diagnosed with dementia. This was super helpful so I didn't have to run out to fax these documents."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mrs. Padilla",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:34:39.000Z",
          "Titre": "I had been a loyal EFax customer for…",
          "Contenu": "I had been a loyal EFax customer for over 10 years and had paid my fee to them annually up until this year where they not only charged me my annual subscription but also drafted my account monthly without first informing me.  Needless to say, I switched over to Humble Fax where my fee is at a very affordable $10/mo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S. Chipman",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T22:00:25.000Z",
          "Titre": "Affordable, Functional, Reliable",
          "Contenu": "So far no issues with Humblefax. I was looking at paying an extra $55/m to Centurylink for a fax line, but at $10/m nothing beats Humblefax. It's affordable, has no page count caps or hidden fees, and it's reliable. You can see a history of all sent/received faxes as PDFs. Very handy, can be used anywhere, even your phone. Better than all the other e-fax solutions I looked at."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SG",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T15:11:57.000Z",
          "Titre": "Great for small businesses!",
          "Contenu": "I started using Humblefax for my massage therapy business and it's been amazing. Humblefax very reasonably priced and my faxes go through right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "New User",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T04:21:34.000Z",
          "Titre": "Wonderful!",
          "Contenu": "So simple and easy to use. Your month to month subscription is wonderful.  I've not had one bad moment with Humblefax!  I only wished I had found you sooner!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ms. Vann",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T05:29:37.000Z",
          "Titre": "Great Investment",
          "Contenu": "Great Investment! So glad I took the plunge and did it. $10/mth is a drop in the bucket for the efficiency, data delivery, display, ease of use, receipts, and history provided. It gives me great peace of mind not having run out to the library, scan or copy it first, then fax and pay $1/pg and the quality still be subpar"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lazar Borukhov",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:59:16.000Z",
          "Titre": "easy to use",
          "Contenu": "easy to use, many options to send fax, email etc"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T17:14:43.000Z",
          "Titre": "This is so easy and affordable",
          "Contenu": "This is so easy and affordable! I love that you can create a cover letter with no effort, preview the fax before you send it, edit effortlessly, get instant confirmation that the fax was successfully transmited & they notify you immediately with an email copy. Great way to keep a paper trail with attachments!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jun Wang Acupuncture",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:06:24.000Z",
          "Titre": "Just $10 include all",
          "Contenu": "Just $10 include all! No need to worry page limitation!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chellsie W.",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T23:03:50.000Z",
          "Titre": "Most valuable service $10 can buy",
          "Contenu": "I own and manage a small law firm and we use Humble Fax for all of our faxing needs. It's only $10 per month and we can fax and receive documents from anywhere with internet access -no need for a fax machine at all and the best part is THERE IS NO CAP ON THE NUMBER OF PAGES we can send and receive. We have an assigned fax number with a local area code and all. I highly recommend Humblefax."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Lou",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:28:26.000Z",
          "Titre": "Very easy to use and cost effective!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wallace Fraser",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T16:02:09.000Z",
          "Titre": "Easy setup and easy to use",
          "Contenu": "So easy to setup and easy to use. Other online faxes require a lengthy process or calling someone to discuss features. Humblefax was super easy and I was signed up within a couple of minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber Furby",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T16:19:12.000Z",
          "Titre": "HumbleFax is very user friendly",
          "Contenu": "HumbleFax is very user friendly. The interface makes it easy to navigate the website features, and send faxes. I also really liked the status feature that lets you know that your fax is still outgoing, or has been received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clint Schleicher",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T16:12:17.000Z",
          "Titre": "Great product, definitely recommend!",
          "Contenu": "Great product.  Works amazing for sending and receiving faxes via email.  No more physical fax machine needed.  Monthly cost is also a great deal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Lawrence Sternhell",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T18:46:00.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Able to do everything from my phone. Definitely my new e-fax option. And does not break the bank. Appreciate that as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen D",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T19:12:31.000Z",
          "Titre": "Convenient, Affordable, Fast the only way to fax online for me",
          "Contenu": "I had been trying for days to find an easy way online to fax important documents and I wished I had tried HumbleFax first.I don't have a printer or a car, so trying to fax something to someone is very. All of the mobile apps and other online fax places were time wasters with hidden costs that claimed to be cheap or free and really weren't.I absolutely recommend. If you need to send and receive faxes from your phone within minutes WITHOUT hidden costs or a million screens to click through, I recommend HumbleFax."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melinda  Godshall",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T16:23:35.000Z",
          "Titre": "Excellent Online Faxing",
          "Contenu": "When fiber optic internet was finally available in our area, we cut the cord, including our landline telephone cable. Because of the nature of our business, we still needed a way to send and receive traditional faxes. After trying several different available options, we discovered Humblefax, and immediately like the user friendly interface, the functionality and the ability to use a local number. The cost is very acceptable, considering what we were paying previously for a 2nd phone line and for the added costs. Great program, very reliable and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T16:06:08.000Z",
          "Titre": "Humble Fax - Budget and User Friendly!",
          "Contenu": "HumbleFax is user friendly, support is easy to reach and I like how easy it upload faxes via your computer. I highly recommend if you are in the market for a budget friendly fax program!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leah McGrath",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T18:22:43.000Z",
          "Titre": "I have really enjoyed using this from…",
          "Contenu": "I have really enjoyed using this from my phone and PC. Has made my life so much easier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T07:26:26.000Z",
          "Titre": "Extremely easy to use",
          "Contenu": "Extremely easy to use! Just complete the fax cover sheet and attach your file just like you would to an email. Easy peasy! The site also stores copies of what you sent, who you sent it to and verification that the fax did/did not go through; so you have a record of everything in one easy to get to spot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Ross",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T21:39:31.000Z",
          "Titre": "I had to make a quick switch to using…",
          "Contenu": "I had to make a quick switch to using fax when our online system went down.  Humblefax allows for less paper and ease of use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billiejeanqueen",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:16:47.000Z",
          "Titre": "I came to Humble a couple of months ago…",
          "Contenu": "I came to Humble a couple of months ago after being connected to a another service for more than 10 years… The prices of other companies that offer the same service are up to triple the cost of this one… The operating system is smooth, no glitches, no special requirements… Just an Internet… It has been excellent and I do recommend it to anyone who does not want to invest in a fax machine and anyone who is remotely interested in purchasing a fax machine… Try this service first… You will not be disappointed ! Ten stars if I could! Saves you big bucks and time…no hidden fees!! 🤑 ❤️❤️❤️❤️❤️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reanna C",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T15:07:50.000Z",
          "Titre": "HIPAA  Compliant!",
          "Contenu": "I really enjoy the simplicity of HumbleFax- it's unlimited pages, you can pick your own number, and you can add users. It doesn't nickel and dime you for added services- it's exactly what I was looking for- AND it's HIPAA compliant!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vesta Wealth Advisors",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T03:23:25.000Z",
          "Titre": "Humblefax is easy to use",
          "Contenu": "Humblefax is easy to use.  You receive a notification for transmissions with the document attached.  They have an app that you can view all the faxes you've sent.  It's a great option for those wanting to use your \"email\" as a fax machine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamara Anaya",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:28:12.000Z",
          "Titre": "We gave up our big clunky fax machine…",
          "Contenu": "We gave up our big clunky fax machine recently and switched to Humblefax.com.  The first person to send us a fax that came yesterday.  The process is easy and intuitive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Propps",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:01:31.000Z",
          "Titre": "Simple easy to use software",
          "Contenu": "Simple easy to use software, never fails transmitting documents"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucille C.",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T16:40:33.000Z",
          "Titre": "The service is fast",
          "Contenu": "The service is fast, convenient, easy and professional.It has all the right features; cover letter, easy attachment of files, scannable docs to upload in various way, record keeping of fax received and sent, low monthly costs, etc. I just think it’s a good mobile service that works just the same, if not, maybe even better without a landline setup. Only con I have had so far, is that it requires me to add the recipients to my contact list before I can send a fax. But I have not figured out if I really can bypass that action as yet. But give it a try. No obligation, so you can stop your subscription anytime.I hope it’s as secure as privacy should be."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luann DiTullio",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T15:56:19.000Z",
          "Titre": "Humble Fax rocks!",
          "Contenu": "I was using a regular fax machine and having a lot of issues with faxes not being received properly. It would use a lot of paper and toner. Also hated that I had to print documents before I could fax them. I researched electronic faxing but most were too expensive for the minimal faxing I do.   I came across Humble Fax and was thrilled. Price is reasonable and it’s been 100% efficient. You won’t be disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanyea Griffin",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T14:28:31.000Z",
          "Titre": "We needed a company",
          "Contenu": "We needed a company, as our last one moved away from the efax capabilities. We searched and received several high monthly fees. Humble fax is not only affordable, but customer service if very responsive and the platform is easy to use and navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "shauna drye",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T04:49:34.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good I just recently started using humblefax and it has been so easy to access on my phone and laptop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mt. Morris Senior Center",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T13:58:38.000Z",
          "Titre": "Great price and easy to use",
          "Contenu": "Humble Fax is priced well in comparison to other options. It is also a very easy to use program. You can send faxes through their platform or through your own email. There is a preview in your email when you receive a fax, so you know if it is something important or just junk without wasting paper or time. Humble Fax works great for us!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Murphy",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T16:02:34.000Z",
          "Titre": "Humble fax works on multiple platforms…",
          "Contenu": "Humble fax works on multiple platforms for me. Computer, phone, iPad I’m able to image and send as well as receive and print faxes easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allan Hall Insurance Services,",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T05:06:10.000Z",
          "Titre": "New fax service",
          "Contenu": "Smooth transition from previous fax provider, very easy to fax documents."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacey M",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T17:16:51.000Z",
          "Titre": "I recently switched to Humblefax after…",
          "Contenu": "I recently switched to Humblefax after receiving a barrage of junk faxes. I asked my fax service if they had a way to block the junk faxes. They told me no, so I went searching for a better solution. That's when I came across Humblefax. Not only was the cost per month less but, they offer a way to block junk faxes! It will also automatically retry sending a fax if it doesn't go through the first time. After using the program for a couple of months I am thrilled that I made the change. The user interface is modern, clean and so easy to navigate. I highly recommend Humblefax!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SURESH",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:32:24.000Z",
          "Titre": "Very simple application & works…",
          "Contenu": "Very simple application & works flawlessly..very happy with the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LAN",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T01:36:21.000Z",
          "Titre": "This is exactly what I needed",
          "Contenu": "This is exactly what I needed. basic function with confirmation of faxes going through. It cost less than 1/2 of what others charged. I switched over from ringcentral and never looked back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Hazen Smith",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T00:44:24.000Z",
          "Titre": "HumbleFax is the BEST",
          "Contenu": "HumbleFax is the BEST! I have tried other email fax services and none compare to HumbleFax....price, value, options available, ease of use.  It's not often faxes are needed nowadays, but when they are HumbleFax is an affordable option to have at the ready when you need it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yelena Ashton",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T20:03:17.000Z",
          "Titre": "I am very happy with this fax service",
          "Contenu": "I am very happy with this fax service. It is so easy to send and receive faxes. I recommend it to everyone! And it is very affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Cook",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:59:53.000Z",
          "Titre": "Great service always",
          "Contenu": "Never an issue getting my faces out quickly great customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamerson & Associates LLC",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T18:02:40.000Z",
          "Titre": "Humblefax.com has been amazing for my…",
          "Contenu": "Humblefax.com has been amazing for my online faxing needs.  The software is easy to understand and navigate and does well when it comes to faxing the IRS quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T18:38:11.000Z",
          "Titre": "This faxing service has been great for…",
          "Contenu": "This faxing service has been great for my business. We have never had any issues and faxes come promptly !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Lambert",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T11:51:50.000Z",
          "Titre": "Easy and simple to use",
          "Contenu": "Starting with the ability to pick my own fax number, I found Humblefax good from the start.  I used to use a VOIP service to a printer/scanner/fax, but I'm without my printer right now and this is much better!  No need to worry about configuring the VOIP stuff, it just works, period.  Compared to other providers with quotas on how many faxes you can send and receive, this is brilliant because now I don't have to worry about spending the quota.  The faxes come as a PDF right to my email and there are tons of settings to play with in the control panel.  Best of it, it's quick and easy to make a cover page and upload a PDF document to attach to the cover-letter that contains your fax message.  So far, I'm loving it.  I will never not have a fax again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanne Sharpsteen",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T17:20:27.000Z",
          "Titre": "Faxing is perfect",
          "Contenu": "Faxing is perfect, neat and clean."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Tiko",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T20:05:03.000Z",
          "Titre": "i had a very good experience",
          "Contenu": "i had a very good experience. i use the fax machine very often and never had any issues so farthank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Cole",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T16:03:52.000Z",
          "Titre": "Affordable and reliable",
          "Contenu": "I’ve discovered humble fax is an affordable and effective way to send and receive faxes. I have tried other apps, and this one has proven to be the most reliable and easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Hebert",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:14:03.000Z",
          "Titre": "Works great sending",
          "Contenu": "Works great sending!  Have not yet received anything using it.  But, nonetheless very happy with it so far!"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Cecily Ruffin",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T16:40:05.000Z",
          "Titre": "The price",
          "Contenu": "The price, the consistency and the ability to add your team to send and receive has been great!!! I was with e-fax and was spending more, my entire team was not able to fax and I wasn’t able to at one point so I had to look elsewhere and I’m glad I did"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claudia Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:35:43.000Z",
          "Titre": "Fast and easy!",
          "Contenu": "It is very easy and convenient. Price is very affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Oliver",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T16:35:02.000Z",
          "Titre": "Fantastic",
          "Contenu": "It's truly unlimited, easy to use on both desktop and phone, efficient, great address book feature, simple set up, no hidden fees."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony I Hampton",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T00:59:12.000Z",
          "Titre": "Humblefax makes it so easy to send a…",
          "Contenu": "Humblefax makes it so easy to send a fax. The price can't be beat!! The logistics of this service is simple anyone can do it!!!! I think Humblefax is a wonderful product!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T. Miller",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T16:05:27.000Z",
          "Titre": "My experience has been great",
          "Contenu": "My experience has been great The system is user friendly I appreciate that it logs all past faxes to reference The cost is amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Lemay",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T15:20:03.000Z",
          "Titre": "Easy to sign up",
          "Contenu": "Easy to sign up, monthly rate is much more economical than the competitor's!  You cannot go wrong with using HumbleFax."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D.Hobbs",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T15:04:08.000Z",
          "Titre": "Humble Fax for the win!",
          "Contenu": "I enjoy Humble Fax being that the services are user friendly and it is very easy to navigate the user dashboard. it’s super affordable and no hidden fees."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lostprincess",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T22:35:05.000Z",
          "Titre": "So easy and efficient without needing…",
          "Contenu": "So easy and efficient without needing any complicated connections or extra external lines. I can fax like I text or email and the price is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammar M Noon",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:28:23.000Z",
          "Titre": "Humblefax explains how to use the service. Whether it be email,or PC Humblefax will be great.",
          "Contenu": "Have not use the service yet. Heard Humblefax is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amonzo Upshire",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T03:43:59.000Z",
          "Titre": "I've been using this app for my small business",
          "Contenu": "I've been using this app for my small business a few months. Has helped me close deals and complete contracts on the go.  Will definitely recommend 👌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delivery and Courier Services",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T05:23:55.000Z",
          "Titre": "Humble was so simple to set up",
          "Contenu": "Humble was so simple to set up. Such a convenient way to send and receive fax. Really happy to have found this service and so reasonable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John F",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:17:19.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, easy, easy. Very simple setup and works great. Even had my old fax number transferred. Extremely satisfied. Pricing was best around too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Earl Brittain",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T15:44:53.000Z",
          "Titre": "Everything works as it should",
          "Contenu": "Everything works as it should. Faxes take a little time to send, and I'm not sure if that's just because the facsimile technology is ancient, but they do always go through for me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean Trostle",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T04:35:38.000Z",
          "Titre": "The service is very easy to use",
          "Contenu": "The service is very easy to use, even for someone who isn't a tech person.  Outgoing and incoming faxes have been perfect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy. Downey Cardio",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T17:12:11.000Z",
          "Titre": "Super easy to use",
          "Contenu": "Love how easy it is to send and receive faces and also very affordable  happy with choosing humblefax"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie H.",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T15:02:28.000Z",
          "Titre": "Extremely easy to set up and use",
          "Contenu": "Extremely easy to set up and use.  Get confirmations for every fax. Would highly recommend for any small business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittany",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T15:04:43.000Z",
          "Titre": "Amazing, highly recommend!",
          "Contenu": "Amazing! So easy to use, it confirms your faxes sent and received, you can easily save contacts and print your faxes as well. We can from Ring Central, and prefer Humblefax now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Willenborg",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T16:16:31.000Z",
          "Titre": "Humlefax is awesome!",
          "Contenu": "We moved to a new phone system that didn't support Fax. We signed up with Humble Fax and were delighted. Faxing couldn't be easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Blount",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T07:49:29.000Z",
          "Titre": "Humble Fax has made my life simpler!",
          "Contenu": "Humble Fax has made my life simpler by not having to own a conventional fax machine or pay for that phone line, or have to worry about running out to a business that DOES have one every so often when I need to send a fax in 2023!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Gare Personal Injury",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T15:53:38.000Z",
          "Titre": "Humblefax has outstanding customer…",
          "Contenu": "Humblefax has outstanding customer service. I needed to add another fax line for an assistant. I was having trouble so I contacted Humblefax customer service. They contacted me the same day and got it done!"
        },
        {
          "Note": 5,
          "Lieu": "VI",
          "Pseudo": "Mary Sanders",
          "Nb_Reviews": 6,
          "Date": "2023-09-18T15:02:35.000Z",
          "Titre": "I checked on other options when I…",
          "Contenu": "I checked on other options when I decided to leave EFax. I tried a few and Humble fax was the easiest to use and looked most professional. Excellent tracking"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Satisfied in Alabama",
          "Nb_Reviews": 3,
          "Date": "2023-10-09T20:51:04.000Z",
          "Titre": "Best Value for Online Fax Line",
          "Contenu": "Best Value for Online faxing server. I needed a fax number for the occasional faxes I need to send and receive. This was perfect for the few faxes we use it for and the best price on the web."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Casey Draper",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T16:02:45.000Z",
          "Titre": "Simple & Efficient",
          "Contenu": "Humblefax is a user friendly way to utilize faxing in today's working enviornment. 5 stars from myself and my staff of 8!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ahmada Berry",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T16:26:12.000Z",
          "Titre": "Fast and convenient",
          "Contenu": "Fast and convenient. I don’t miss a fax because of the email notification. love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Cohen",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T18:23:27.000Z",
          "Titre": "I like humble fax",
          "Contenu": "I like humble fax, it is very convenient to use, good interface and setup"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Atkinson",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T03:26:03.000Z",
          "Titre": "Love it! 5 stars!",
          "Contenu": "It is a great service. It is so easy to use and gets faxes to their destination quickly and easily. Affordable price too! Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IRIN GUARDASCIONE",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T15:46:14.000Z",
          "Titre": "Conveniance",
          "Contenu": "I am able to access my faxes from anywhere/anytime.  It is so convenient.   It has been amazing for my company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "flavio morocho",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T16:15:09.000Z",
          "Titre": "Great faxing service",
          "Contenu": "Great faxing service. Very reliable and user-friendly. The price is also a great deal. I've 6 different fax providers. This is the one I chose to stay with."
        }
      ]
    }
  ]
}