{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "infiniteobjects.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Jangro",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T21:04:08.000Z",
          "Titre": "Not So “Infinite Object”",
          "Contenu": "My “Infinite Object” was not so infinite. The loop I had froze at the end for about 3 frames and then disappeared. Sent it back in for them to re-render and when it was sent back, had the same exact error. Might be a picky critique but it ruins the allusion for me and this device is very expensive for what it is. Long story short, I tried with them they failed to deliver the product I expected and I will be sending back for refund.Customer service was very prompt and friendly, just not a great product."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stan",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T00:02:09.000Z",
          "Titre": "My husband bought me a frame of a video…",
          "Contenu": "My husband bought me a frame of a video of our children for my birthday. It turned on as expected when taken out of the box, but has since just been utterly rubbish. After an hour, it turned off. Since then, you have to unplug it and then re plug it in with the charger to get it to turn on - no idea why? It’s supposed to stay on with charge? And now it’s entirely frozen. Just a still image in a frame. Such a waste of money. And a really terrible gift that is hugely disappointing…"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Finja Petry",
          "Nb_Reviews": 8,
          "Date": "2021-09-18T00:59:38.000Z",
          "Titre": "90 dollars shipping costs",
          "Contenu": "The frame is great. But overall I paid 50 Dollar for shipping and afterwards UPS charged me with 35 EURO on top ( which was not VAT ) .After I reached out to the customer Service I got told it was VAT ( even thought it said on the receit it clearly wasn't ). Pretty dissapointed to pay more than 90 dollars only for shiping to Germany. Would not recommend if you order from overseas."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Lucas Lykkegaard",
          "Nb_Reviews": 2,
          "Date": "2021-05-16T11:58:57.000Z",
          "Titre": "I bought a frame and haven't received confirmation",
          "Contenu": "I bought a frame a week ago and still haven't received any confirmation of my purchase. Infinite Objects has still charged me for the frame 99$ + the 42$ extra for shipping. Of course, I understand that covid causes a delay in shipping but a purchase without confirmation is unacceptable. I hope that this is just a misunderstanding."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T12:35:32.000Z",
          "Titre": "Terrible Customer Service",
          "Contenu": "I bought one of these products for a gift for my significant other. All was well until I had to deal with their customer service. Hands down, the worst customer service I have ever met. Extremely unresponsive, and in the rare instance they do respond, it is the most unhelpful advice. I am extremely disappointed. Order with caution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Quan Chizzle",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T14:08:07.000Z",
          "Titre": "No Trust",
          "Contenu": "Was going good until I made my 5th purchase. Apparently, someone who looks like me cannot possibly make the art I make. I showed pictures of my progress and they denied me. I'm so tired of racism."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lyndal Busch",
          "Nb_Reviews": 1,
          "Date": "2022-03-13T16:30:04.000Z",
          "Titre": "Disappointed",
          "Contenu": "I was in love with the aesthetic of my video straight from the box. It won’t stay on tho. I sent two emails immediately to infinite objects because this was a work I was entering into a gallery show. No response from them at all. I revived my frame in January and my show was second weekend of March so there was certainly time for them to make it right. In order to enjoy the work you have to stand with it and hold the cord just right. There’s no way I could show or sell work this way. If they fix the connectivity issues I would recommend them but as it stands I just wish it worked right."
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Livia Fălcaru",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T09:46:44.000Z",
          "Titre": "Stopped working, no help at customer support",
          "Contenu": "Stopped working after a year.Attempted to contact customer support via email several times and they didn’t get back to me. I don’t recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fynn Reckhorn",
          "Nb_Reviews": 1,
          "Date": "2021-06-07T14:45:49.000Z",
          "Titre": "Bad service",
          "Contenu": "Lots of problems with an order that was supposed to be a gift. It never even got shipped until I followed up and then they also used the wrong video. It was not a good experience and I will not be using them again to gift anything"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ethan",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T22:06:12.000Z",
          "Titre": "Horrible experience",
          "Contenu": "Horrible experience! I got my product and it was broken and would not work! The support team took forever to help me when I reached out to them! Overall my experience was very poor and I will not be shopping from you again!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Pamela Pauline",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T22:40:57.000Z",
          "Titre": "Fabulous product",
          "Contenu": "Fabulous product, fair price.  I look forward to working more closely with Infinite Objects for my animated artworks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrea Davalos",
          "Nb_Reviews": 1,
          "Date": "2020-11-13T07:33:39.000Z",
          "Titre": "I was so excited when I ordered this…",
          "Contenu": "I was so excited when I ordered this but my package has still not arrived. My package keeps getting delayed hopefully it gets here !"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KEVIN BALDOMERO",
          "Nb_Reviews": 3,
          "Date": "2020-11-05T16:31:26.000Z",
          "Titre": "Order placed about a month ago",
          "Contenu": "I placed my order on October 10th, 2020 and ship date was scheduled for November 1st.  I received an email on Monday, November 2nd, stating that my \"updated\" ship date is now November 25th.  I will wait until I get my order for a more accurate rating on the products, but for now I rate my experice as a 2 star."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brooks Slater",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T23:55:51.000Z",
          "Titre": "From other IO NBA top shot moments I…",
          "Contenu": "From other IO NBA top shot moments I was expecting more stats and details with my individual number on the back, but instead ended up with just a basic QR code."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aidee Martinez",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T03:42:16.000Z",
          "Titre": "i bought 2 a couple months ago and I…",
          "Contenu": "i bought 2 a couple months ago and I loved them but one of my frames already stopped working completely. It had been on my shelf since I bought it and set it up and came home one day to it being off. All other electronics on my shelf were powered on as normal.I tried using my other power cable from my other infinite object frame to see if the cable or power block was the issue, but it still won’t power on. I also tried disconnecting it from power completely for 2 days and moved it to another shelf but it still won’t turn on. They’re not exactly cheap, so it’s a bummer it won’t work anymore."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mkb",
          "Nb_Reviews": 1,
          "Date": "2021-10-02T00:22:28.000Z",
          "Titre": "should be able to send back the frame once to add more videos",
          "Contenu": "There should be a way to send it back and add more videos to the frame, especially for the price. I didnt even know i could add long videos and stitch clips together until after i bought it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "C. Buckley",
          "Nb_Reviews": 1,
          "Date": "2020-11-21T12:46:37.000Z",
          "Titre": "Nothing but a blue screen...",
          "Contenu": "Update: After writing to Infinite Objects Support about the problem with my order, they responded within the hour and will re-run the order and ship ASAP. They had not encountered this (blue screen) problem before and have requested that I return the original flawed one that I received. I commend IO for its quick response and customer service. Questions still remain open as to their Quality Assurance process during production and prior to shipping. Original Post: I received my order (which was a gift for my wife’s birthday) and upon opening the box, all that appeared was a blue screen - no video. We plugged it in thinking that perhaps it needs to be charged (despite the advertisement stating that all we need to do is open the box to play the video) and nothing happened. All we have is a blue screen. This is all very disappointing, particularly given that I have another order due to ship in Dec as a Christmas present for my mother! Awaiting Infinite Objects response..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Izzy Aramburu",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T02:07:54.000Z",
          "Titre": "I still have not received my package",
          "Contenu": "I still have not received my package and it has been over 2 weeks?? Can someone explain to me if there was a delay in UPS or if something happened in sending it out to delivery? I'm worried."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Surreal",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T05:00:00.000Z",
          "Titre": "I love my Limited Edition Infinite…",
          "Contenu": "I love my Limited Edition Infinite Object and it looks fantastic!  The only reason for the loss of a star is that it arrived defective, and while it was replaced at no charge, the process took about 4 weeks.  Not too long in the grand scale of things, but I was eager to display my purchase and a little disappointed I had to wait."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Shiro Ong",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T14:43:16.000Z",
          "Titre": "It's pretty nice",
          "Contenu": "It's pretty nice, but can be improved.Because this is the NFT project, it's good that it will show ETH price from time to time."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Irie Wata",
          "Nb_Reviews": 3,
          "Date": "2022-07-12T09:14:41.000Z",
          "Titre": "Customer service",
          "Contenu": "I was having some issues getting an NFT framed. I reached out to customer service and the process went really slow, but after reminding them a few times to get back to me they hopped on a personal call with me and fixed the issue (the issue was with Metamask). The video frame that I ordered came in super quick too even though I'm in Europe <3"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 2,
          "Date": "2022-01-05T00:17:46.000Z",
          "Titre": "Pleasant, a little slow",
          "Contenu": "I got in touch with customer service a couple different times to inquire about the estimated date one of the frames would be available. All of the members were pleasant and answered the best they could. Sometimes, the chat member would take a long time to respond when I first began the chat, but it wasn't a big deal."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Олег Галкин",
          "Nb_Reviews": 2,
          "Date": "2020-11-28T12:24:58.000Z",
          "Titre": "Great device but problems currently",
          "Contenu": "A great device, really enjoyed the video and the effects, somehow had problems with updating with the latest visuals, but overall thought that it’s a magnificent device until it stopped working. All of a sudden the screen is black and whenever I try charging it or if I put it back in the box  it doesn’t seem to work anymore... sad!Great idea"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 3,
          "Date": "2021-04-04T13:53:07.000Z",
          "Titre": "A few bumps, but satisfied",
          "Contenu": "This was meant to be a gift for Christmas 2020. The first one worked at first, back “blued” out and wouldn’t reset when put in the box.  I had chats back and forth with customer service about resetting it and finally sent it back for a replacement.  The replacement works beautifully.  I keep it plugged in 24/7.  Despite the pandemic the customer service was receptive and consistent.  I got my replacement in February."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Collin Mrugala",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T14:50:16.000Z",
          "Titre": "Good customer service",
          "Contenu": "I had recently given this company a 1 star review due to super slow and unavailable  customer service but they recently reached out and went above and beyond in resolving the problem. Overall the product is great and I recommend it to friends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C. Owens",
          "Nb_Reviews": 2,
          "Date": "2021-05-08T23:26:14.000Z",
          "Titre": "Looks great.",
          "Contenu": "I think it's a really neat idea to have your video on display. I only wish there were more sizes available - I would have liked the wood frame a size larger . I also would like to see the option of audio - as it is , it plays silently. The way I record my One Second Everyday videos, audio is a big part of it. It would be nice to have a button on the back to turn the audio off and on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Slygo Cici",
          "Nb_Reviews": 8,
          "Date": "2023-10-06T00:50:48.000Z",
          "Titre": "Fast easy purchase and delivery i now…",
          "Contenu": "Fast easy purchase and delivery i now own 3 of these objects they are all high quality and fantastic"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Noor Fatima",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T06:02:55.000Z",
          "Titre": "Its a very amazing game i am very…",
          "Contenu": "Its a very amazing game i am very excited to play this game☺"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Matlack",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T02:41:17.000Z",
          "Titre": "All I Hoped For",
          "Contenu": "Purchase was simple and a breeze."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dahylin Allen",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T18:11:58.000Z",
          "Titre": "A moment that I treasure",
          "Contenu": "I really love being able to see a video of my kids daily. It's something special because I know they won't be this little forever. It's making a stop in that particular moment in time. Very beautiful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Jones",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T23:14:42.000Z",
          "Titre": "Fantastic products and even better customer service!",
          "Contenu": "My roommate bought me an Infinite Object a couple years ago which was a lot of fun to have on display, but it recently was knocked over and the display broke. I reached out to customer service, who was very responsive and professional, and they were able to repair the video print very quickly and without any issues. I am very much looking forward to getting it back on the wall!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andie  Andie.segal@gmail.com Segal",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T23:28:32.000Z",
          "Titre": "Prepare to be wowed!",
          "Contenu": "First of all, this product is amazing! If you choose one of their designs or create your own, your object is unique, great quality and super cool. Customer service was responsive, efficient, and so helpful! These objects will be part of my gift-giving for years to come!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda T",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T18:22:34.000Z",
          "Titre": "A Great Gift and Attentive Customer Experience",
          "Contenu": "These video frame are charming and make the absolute perfect gift. After we put our dog down, I ordered one for my husband with a video of our pup fetching a ball. He loves it and everyone that comes over comments on how cool it is. When the display stopping working, they were easy to communicate with and replaced the defective object seamlessly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 4,
          "Date": "2023-02-08T19:16:48.000Z",
          "Titre": "Absolutely amazing",
          "Contenu": "Absolutely amazing, coolest thing I own! The decorative custom frame really sets it off. I would buy more art from IO but not a fan of just the clear or bamboo frame options, please open it up for customization or more frames"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Cramer",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T20:21:40.000Z",
          "Titre": "10/10 Customer Support - Crystal",
          "Contenu": "For some reason about 2 months after receiving my item it stopped working. I emailed customer support and Crystal got back with me the day after. I sent her video proof of it not working and she immediately offered me a refund/replacement. All within 2-3 days of when my item stopped working. 10/10 customer support. Product was amazing until it stopped working but no worries since I’ll be getting a free replacement!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "F Limbourg",
          "Nb_Reviews": 2,
          "Date": "2022-07-14T20:00:21.000Z",
          "Titre": "Super fast delivery and high quality",
          "Contenu": "Super fast delivery, only 4-5 days from USA to Belgium. High quality product. This is the Frame 3.0 🔥 This is not my last purchase as i’m really fan of Infinite Objects work and i need such quality for my beloved NFT epic pieces ! Thanks Infinite Object for the amazing customer experience that i can’t find nowhere 🤩"
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Hook P",
          "Nb_Reviews": 2,
          "Date": "2022-03-01T11:09:51.000Z",
          "Titre": "5 stars for Amazing customer support.",
          "Contenu": "5 stars for customer support.I originally received my NFTs on an infinite objects as a present. However the device came faulty and would not work properly, my initially impression was bad. However! Once I reached out to the support team they were amazing and most helpful. They arrange a DHL prepaid pickup all the way from Thailand to their office in USA and I received a new device back to my door within a week hassle free!Would definitely recommend to friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kendra",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T00:50:44.000Z",
          "Titre": "I absolutely love my video print",
          "Contenu": "I absolutely love my video print! It fits perfectly as my center piece to my collection 💙 so creative. So beautiful! Infinite Objects knocked this outta the park!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Janet Nicholls",
          "Nb_Reviews": 21,
          "Date": "2021-06-02T18:20:58.000Z",
          "Titre": "Exceptional & Exemplorary",
          "Contenu": "This company exceeds exemplary customer service. I had cause to contact them (my own mistakes) on 2 occasions.  Response was extremely quick and over and above customer services.  Delivery (from USA to UK) was extremely quick and competitively priced.  Quality was high.  I cannot commend them highly enough.  Many thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T20:09:28.000Z",
          "Titre": "Cool stuff",
          "Contenu": "Cool stuff.  Email with question just sent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz Aouad",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T15:18:55.000Z",
          "Titre": "Great service!",
          "Contenu": "We reached out to the team via a robot chat box to ask for a gift receipt to be used in our order instead of a normal receipt (as it's being sent directly to the recipient). I didn't expect someone to reach out that they've completed the request since I was typing to the chat last night (after hours) but they completed it & emailed me this morning with confirmation. So helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Gamella",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T00:01:27.000Z",
          "Titre": "Awesome Customer Service",
          "Contenu": "This was my first purchase with Infinite Objects, and unfortunately when my frame arrived it was defective and wouldn't stay on. I reached out to the company and they were extremely helpful, offering to send a return label so I can ship back the frame for an repair or exchange. Once I returned the frame, they kept me up to date the entire time and told me they are sending a brand new frame that replicates the original frame they sent me. The new frame arrived shortly after that and works perfectly. The customer service alone has me sold to be a returning customer."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Sach",
          "Nb_Reviews": 7,
          "Date": "2022-06-30T12:32:06.000Z",
          "Titre": "Superb and standard setting customer service",
          "Contenu": "I dealt with Crystal B and found her to be very proactive in helping me find a solution and very committed to ensuring I did. Very timely and prompt responses and very helpful. Having dealt with a bunch of other web3 companies, this level of customer service is not be taken for granted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank S",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T20:01:28.000Z",
          "Titre": "I had made a mistake on the shipping…",
          "Contenu": "I had made a mistake on the shipping totally on my side....Crystal B was super helpful in correcting my issue. She even followed up and made sure everything was perfect before re sending the item. One of the best customer service experiences I have had recently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delaney",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T19:53:39.000Z",
          "Titre": "Great product, great customer service!",
          "Contenu": "Crystal went above and beyond to assist me in a timely manner. I loved the product but was disappointed to realize I ordered the wrong size. As a made to order product, I assumed a return might not be possible, however, the return process was super easy. So excited to get my frame back! Great product and great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernest Villalobos",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T21:18:15.000Z",
          "Titre": "Memories",
          "Contenu": "I purchased two of the frames at the beginning  of the  year and was very happy with your quality of the video in the frames . My Husband passed last August and thought that this would be a great gift for the family menders so i put a video together  for them as a Christmas Gift  >so THAN YOU"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evan",
          "Nb_Reviews": 2,
          "Date": "2022-08-23T04:11:54.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service! I had some confusion and mix up on my part when ordering my frame but after reaching out to customer support they responded quickly, helped me through the ordering process, and promptly issued me a refund on my first order.I haven't received the frame yet (just got order straightened out), but the support has been great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan Ulmer",
          "Nb_Reviews": 4,
          "Date": "2021-11-19T22:45:36.000Z",
          "Titre": "Creating a family heirloom.",
          "Contenu": "I am always skeptical about buying from sites I see in Facebook ads, but I did my research and made a purchase. I used a family video and was going to give it as a gift, but my husband and I loved the final product so much, we kept it. I bought the smallest one with the bamboo frame since this was an “experiment.”  My next purchase will be larger and lucite. The quality of all components (reproduction, frame and even the wire) were excellent and the result is a one-of-a-kind treasure. The customer service was prompt and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sailesh Acharya",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T15:09:08.000Z",
          "Titre": "Easy replacement for my IO device",
          "Contenu": "My device suddenly stopped working. It was not charging at all and I was frustrated as this was a gift to my wife. However, I contacted the support and they readily sent a replacement. I'm very thankful and I was really surprised how easy it was for me to talk to someone at IO."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cansu Gokce",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T05:15:15.000Z",
          "Titre": "love it",
          "Contenu": "I feel like we have immortalized a perfect moment every time we look at it!  really beyond perfect🤍🤍🤍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yacht Club",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T23:54:54.000Z",
          "Titre": "No problem is too big for them to deliver A+ service",
          "Contenu": "There was a slight snag in locating the NFT and their customer service was top notch in finding the solution and keeping me up to date throughout the process.The whole selection of the NFT and checkout went super smooth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Lowe",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T01:15:38.000Z",
          "Titre": "Love IO!",
          "Contenu": "Love IO!! Custom frames are amazing! Ordered 6 custom for family as thank you for helping save my life last year… 4 for doctors and nurses who saved me… and one XL for my wife for saving me too. Great customer service too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathaniel - stoicswe",
          "Nb_Reviews": 1,
          "Date": "2022-05-01T23:39:46.000Z",
          "Titre": "IO: An incredible compnay that respects artists",
          "Contenu": "Before Infinite Objects started working with NFTs, I had reached out to them with an animated NFT art piece in order to get printed. During the process, my art piece was flagged because they had thought I was trying to print an artwork that I did not own. After talking with them and discussing back and forth with not only them, but also the artist online, I was able to get the NFT I owned printed. What really impressed me about IO was their dedication to respecting the artist's work and their willingness to cancel my print in case I did not own the art I claimed to own. IO really takes the time to respect the original artist instead of being just a money-grabbing company: a very rare display or morals in today's capitalist society."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oliver",
          "Nb_Reviews": 2,
          "Date": "2020-02-12T22:12:53.000Z",
          "Titre": "A Significant yet Subtle Contribution to the 21st Century",
          "Contenu": "The Entire Infinite Object experience has been AMAZING from start to finish. I purchased a small IO as a Surprise Valentine's Day Gift for my girlfriend and she was absolutely amazed when she opened it! Everything from the packaging to the actual IO was beautifully crafted with obviously high quality materials. We proudly display our IO on our mantle alongside many of our other memories. The possibilities with IO are endless and only limited by your imagination. After you receive your fist IO you'll instantly want to create another!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KEVIN BALDOMERO",
          "Nb_Reviews": 3,
          "Date": "2020-11-29T22:57:36.000Z",
          "Titre": "I reviewed this order prior to (update)",
          "Contenu": "I reviewed this order prior to receiving my order and gave it a 2 star based in the delay of my products.  Now that I have them, 5 stars all day!!!  I couldn't be more happy with my products (acrylic ball pit 1.0 and bamboo jellyfish).  I recently ordered 2 more prints from the collection and can't wait for those.  Infinite objects and awesome hands down.  Can't wait to see new prints / collabs in the future."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Shadow Moses",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T00:26:02.000Z",
          "Titre": "Great experience throughout!",
          "Contenu": "Great customer service was provided by Crystal B who went above and beyond to ensure that my issue had been taken care of! Such great customer service is what makes customers like me buy with confidence and recommend such business to family and friends!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Miss Aishah Saddique",
          "Nb_Reviews": 7,
          "Date": "2022-03-04T21:38:54.000Z",
          "Titre": "Cannot even be more happier with my purchase",
          "Contenu": "Cannot even be more happier with my purchase. It was for my husbands birthday and I put the video of our wedding (5 min long) it includes battery and the instructions are very easy to go by. One of the best purchases I’ve ever made!"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "masanori mizuno",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T02:56:39.000Z",
          "Titre": "I got my Infinite Objects!",
          "Contenu": "I got my Infinite Objects!! Thanks a lot for creating it again, so I also want to give a special thanks to exonemo. Also, the message card with the cursor and Japanese letters on it was great!! I’m proud to be your first customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lizzie C",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T22:12:18.000Z",
          "Titre": "Even better quality than I expected",
          "Contenu": "Came really quickly and the quality is even better than I expected. Great unboxing experience — makes for a perfect gift. It looks so good on the shelf! I’ll be ordering another"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James L.",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T19:38:30.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product. Fast turnaround. I've ordered two. Both arrived faster than originally expected. My friends love them too. I kept one and I've given another way. This is my new go to NFT frame. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Slygo Cici",
          "Nb_Reviews": 8,
          "Date": "2023-05-08T19:46:06.000Z",
          "Titre": "the item came fast and secure it is…",
          "Contenu": "the item came fast and secure it is better than it looks online and a very unique object . Bought a second one right after seeing the first , keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T23:27:25.000Z",
          "Titre": "You all did amazing work",
          "Contenu": "You all did amazing work. I’ll be using your product from now on when displaying my gif animations at art shows."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerome Thurman",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T22:35:32.000Z",
          "Titre": "Absolutely the coolest art that I own!!",
          "Contenu": "Absolutely the coolest art that I own!!I have a significant collection of art through the years but my pieces from Infinite Objects stand out!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "cwanzek",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T05:26:38.000Z",
          "Titre": "I have had prints done with them…",
          "Contenu": "I have had prints done with them before, and they are always great with good quality and a reasonable turnaround. I really enjoy their work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hailey Adair",
          "Nb_Reviews": 1,
          "Date": "2020-11-09T02:27:46.000Z",
          "Titre": "We love our Infinite Objects prints so…",
          "Contenu": "We love our Infinite Objects prints so much! I keep them at my home \"office\" desk and stare at them all day:) Perfect gift and so easy to order! The customer service is the absolute best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T23:17:19.000Z",
          "Titre": "This company is awesome",
          "Contenu": "This company is awesome, replied super fast and even came back on their own time to give me a heads up when an item became available! Lovely helpful people!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rahilla Zafar",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T01:05:01.000Z",
          "Titre": "I received a frame that didn’t work and…",
          "Contenu": "I received a frame that didn’t work and Infinite Objects replaced my item. Satisfied with their customer service and fats response."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Cuomo",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T17:31:50.000Z",
          "Titre": "Great service from the team",
          "Contenu": "Great service from the team!   my item broke, they responded quickly with ways to fix and when it didnt work for me, they sent me a mailing label to send the product back.   they fixed it and will be sending me my new/fixed object back next week!    thank you"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "CHI YE",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T07:48:29.000Z",
          "Titre": "quick response is appreciated",
          "Contenu": "quick response is appreciated ! I think, I will have a business with your company in the future .thank."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Earhart",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T19:52:26.000Z",
          "Titre": "Customer service was great",
          "Contenu": "Customer service rep Crystal B was very prompt, thorough, and respectful in helping me with my issue. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert B.",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T01:18:22.000Z",
          "Titre": "Best artwork,",
          "Contenu": "Best artwork,Best customer serviceBest turn-around time"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "K Waldschmit",
          "Nb_Reviews": 3,
          "Date": "2021-04-11T03:47:13.000Z",
          "Titre": "Great product",
          "Contenu": "Packaging was done carefully and product was exactly as described. Very beautiful frame, it's definitely the highlight in my bookcase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JCamp Lifestyle",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T02:02:44.000Z",
          "Titre": "To honest they made a mistake on my…",
          "Contenu": "To honest they made a mistake on my order they gave me a much bigger size. And I actually like the bigger one then what I ordered. You guys have great products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KEVIN BALDOMERO",
          "Nb_Reviews": 3,
          "Date": "2020-12-01T03:27:12.000Z",
          "Titre": "These things are so satisfying and…",
          "Contenu": "These things are so satisfying and relaxing!!!  Ordered two more, 10,000 digits of PI and the RGB lamp!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BkSI",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T22:44:11.000Z",
          "Titre": "Delivery super fast in US",
          "Contenu": "Delivery super fast in US. Couldn't locate my link for my NFT. Support was fast and helped me locate it. Great team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "As",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T02:07:27.000Z",
          "Titre": "No sound will be included with your video if you have music in the background, but overall great gift!",
          "Contenu": "Ships fast! & can have videos longer than 30 seconds if you combine videos together and then post it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kayla Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T23:26:46.000Z",
          "Titre": "Really loved the packaging and quality…",
          "Contenu": "Really loved the packaging and quality of the product. It was a gift for my partner and he loved it. I wish that in the future the digital frames can have sound as well."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Saeko Ehara",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T02:32:49.000Z",
          "Titre": "The design of website is very good and…",
          "Contenu": "The design of website is very good and it was easy to purchase! And I felt safe that IO reminds me about the shipping! Thank you so much for sending my IO safe :D"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bygbyrd",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T15:48:34.000Z",
          "Titre": "Very good experience",
          "Contenu": "There was a hiccup on my order, but it was taken care of quickly and efficiently. Very easy to work with these folks and a great product."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Fernanda U",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T22:15:42.000Z",
          "Titre": "PERFECT",
          "Contenu": "it was amazing, I loved everything about it! I am from Mexico and the shipping time was excellent"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Adeola",
          "Nb_Reviews": 1,
          "Date": "2022-01-26T22:27:57.000Z",
          "Titre": "Absolutely wonderful experience the…",
          "Contenu": "Absolutely wonderful experience the video frame is beautiful and came in one day all the way from new your to Ireland"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cansel Akbaba",
          "Nb_Reviews": 3,
          "Date": "2023-08-09T06:22:26.000Z",
          "Titre": "Perfect",
          "Contenu": "I have the chance to watch the pictures of my son growing up every day. This idea is great😍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Wallen",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T04:04:15.000Z",
          "Titre": "Got a NFT moment done looks great…",
          "Contenu": "Got a NFT moment done looks great worked with them to get the Rights for the moment and went smoothly. Got Aaron Judge #31 of #99 moment of when he hit #62"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Hoang Tran",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T11:34:52.000Z",
          "Titre": "Finest video printing quality",
          "Contenu": "Fast delivery! Finest video printing in the market right now!"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Jeremie",
          "Nb_Reviews": 2,
          "Date": "2022-02-04T12:48:28.000Z",
          "Titre": "Amazing",
          "Contenu": "It was a gift and it was everything we hoped it would do. Only little problems would be the taxes of importation (+100$)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Belle Asuncion",
          "Nb_Reviews": 4,
          "Date": "2020-11-27T05:56:33.000Z",
          "Titre": "the video pics are fun",
          "Contenu": "the video pics are fun. it's like the Harry Potter animated portraits."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "kiisumii",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T22:12:32.000Z",
          "Titre": "perfect!",
          "Contenu": "Everything was perfect! It was a gift for christmas and it arrived in a timely manner as well as it was in great shape!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JESSICA",
          "Nb_Reviews": 3,
          "Date": "2022-11-01T19:57:12.000Z",
          "Titre": "Best gift idea ever",
          "Contenu": "Easy to place order the quality is amazing is such a fun memorable gift i absolutely love it and shipping was extremely fast overall im a very satisfied customer definitely would be purchasing more from you guys highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "eva  Ordinola",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T20:15:57.000Z",
          "Titre": "Awesome",
          "Contenu": "So cool!!! Got 2 one for my bf and one for my boyfriends parents and they loved it!!! Seriously the coolest thing ever."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anne Spalter",
          "Nb_Reviews": 5,
          "Date": "2021-04-05T02:03:17.000Z",
          "Titre": "Amazing quality for very reasonable…",
          "Contenu": "Amazing quality for very reasonable price. Love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Block",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T01:29:14.000Z",
          "Titre": "Just an incredible product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Calleo",
          "Nb_Reviews": 2,
          "Date": "2022-08-27T12:36:39.000Z",
          "Titre": "Bought this as a gift for my daughter…",
          "Contenu": "Bought this as a gift for my daughter the video frame with her favorite group BTS and it arrive so quickly very nice website showed live images of what your piece would look like I could not believe how fast excellent packaging and quality through and through got the 7 inch and that is the measurement of the video portion that was something I was curious about before I ordered and could not find an exact answer so the video portion is surround by a frame so the overall size is larger than it looks so a 7 inch video screen completed is more like 9 inches with the surrounding edge."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Kalany Gutiérrez",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T20:17:37.000Z",
          "Titre": "I love it!",
          "Contenu": "I love it!! It came really fast and it’s beautiful. I gave it to my boyfriend and he is obsessed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brayden Bugazzi",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T01:26:59.000Z",
          "Titre": "Awesome",
          "Contenu": "Awesome, I have them for my booth at Scope, everyone loves."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cooper",
          "Nb_Reviews": 1,
          "Date": "2020-11-09T04:49:47.000Z",
          "Titre": "Love my video print!",
          "Contenu": "Love my video print!! It was such an amazing anniversary gift. Makes such a special gift"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rene Maynez",
          "Nb_Reviews": 1,
          "Date": "2022-03-16T14:27:35.000Z",
          "Titre": "although it took longer than last time…",
          "Contenu": "although it took longer than last time I ordered, Iam pretty happy with the results. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lamont Liles",
          "Nb_Reviews": 3,
          "Date": "2023-02-08T03:09:22.000Z",
          "Titre": "Easy ordering and love the results"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Dianky",
          "Nb_Reviews": 2,
          "Date": "2021-03-06T19:21:42.000Z",
          "Titre": "It' beautiful thank you!",
          "Contenu": "It' beautiful thank you! My daughter loves it!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alicia Flores-Campos",
          "Nb_Reviews": 1,
          "Date": "2021-03-06T02:42:54.000Z",
          "Titre": "It was a gift for my dad from my…",
          "Contenu": "It was a gift for my dad from my grandma who recently passed and he loved it (:"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lemoyne Collins",
          "Nb_Reviews": 2,
          "Date": "2022-10-05T15:14:54.000Z",
          "Titre": "I am very happy with my purchase",
          "Contenu": "I am very happy with my purchase, awesome and well made."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SM",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T01:55:50.000Z",
          "Titre": "Love my IO",
          "Contenu": "Love my IO. Great piece to have sitting on my desk. Zero complaints!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Lawrence Landeloos",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T18:45:52.000Z",
          "Titre": "Very fast response and friendly support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corbin A.",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T03:01:12.000Z",
          "Titre": "BEST GIFT EVER",
          "Contenu": "This product is by far the coolest thing I own. It makes my room complete. Such a great gift!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Anne Perdiz",
          "Nb_Reviews": 2,
          "Date": "2022-11-10T12:02:46.000Z",
          "Titre": "The product was amazing",
          "Contenu": "The product was amazing! Best gift ever <3 My bf loves it. Thankyou so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Cheng",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T19:58:36.000Z",
          "Titre": "Customer Service was extremely helpful…",
          "Contenu": "Customer Service was extremely helpful and proactive in helping me on purchase and shipments"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Temsup Techarukpong",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T20:11:32.000Z",
          "Titre": "Most touching gift ever",
          "Contenu": "Most touching gift ever! Obsessed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gina Horton",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T01:11:45.000Z",
          "Titre": "I ordered a custom pic with a video…",
          "Contenu": "I ordered a custom pic with a video from Hawaii.  It was great!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Aminel Toral",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T20:52:39.000Z",
          "Titre": "Thank you crystal",
          "Contenu": "Thank you crystal! Very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KM",
          "Nb_Reviews": 3,
          "Date": "2020-11-11T21:29:31.000Z",
          "Titre": "great gift",
          "Contenu": "highly recommend for a gift or keep a memory"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "FR",
          "Nb_Reviews": 3,
          "Date": "2022-02-04T13:49:46.000Z",
          "Titre": "professional",
          "Contenu": "fast, helpful, resourceful, and kind!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Latonya  Hicks",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T17:15:22.000Z",
          "Titre": "I loved it and my boyfriend loved it…",
          "Contenu": "I loved it and my boyfriend loved it just wish it had sound to it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca greene",
          "Nb_Reviews": 1,
          "Date": "2022-01-02T04:32:20.000Z",
          "Titre": "We loved this gift",
          "Contenu": "We loved this gift! And, I was so impressed by how quickly it came!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "caeli",
          "Nb_Reviews": 1,
          "Date": "2021-02-20T07:48:25.000Z",
          "Titre": "super fun product",
          "Contenu": "super fun product - love how sleek it looks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Carey",
          "Nb_Reviews": 3,
          "Date": "2023-06-13T00:07:20.000Z",
          "Titre": "Beautifully done and very ingenious"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jo Burchfield",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T01:26:08.000Z",
          "Titre": "Awesome customer service",
          "Contenu": "My Infinite Object was defective and the customer service was amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Madyllene Rodrigues",
          "Nb_Reviews": 1,
          "Date": "2021-05-08T21:46:28.000Z",
          "Titre": "Loved it!!",
          "Contenu": "Absolutely Loved it!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina Campbell",
          "Nb_Reviews": 1,
          "Date": "2021-09-04T23:36:48.000Z",
          "Titre": "Love it!",
          "Contenu": "Love it! Bought one for myself and one as a gift."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian - I Want To Mow Your Law",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T17:20:34.000Z",
          "Titre": "Grerat Support",
          "Contenu": "Grerat Support. Great product!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alberto Ayala",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T22:53:15.000Z",
          "Titre": "CoolCatz iO",
          "Contenu": "Awesome product, GREAT customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittin Clark",
          "Nb_Reviews": 1,
          "Date": "2021-05-08T19:53:20.000Z",
          "Titre": "I loved it",
          "Contenu": "I loved it it’s amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 4,
          "Date": "2020-10-20T20:18:04.000Z",
          "Titre": "Great product wish it had sound"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Maria Paula Fernandez",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T18:18:51.000Z",
          "Titre": "Amazing experience",
          "Contenu": "Amazing experience . love infinite objects!"
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Bang Dao Quoc",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T11:04:38.000Z",
          "Titre": "I very your products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hung Pham",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T06:28:02.000Z",
          "Titre": "Great products!"
        }
      ]
    }
  ]
}