{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ipostal1.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Abella1",
          "Nb_Reviews": 12,
          "Date": "2023-12-19T23:23:25.000Z",
          "Titre": "FALSE ADVERTISING",
          "Contenu": "Multiple places on the website say their locations can be used for business registration (with a state), but that is not true. And, you have to buy it before you find out this is false. They don't inform you upfront which locations do not, nor do they post a disclaimer, nor do they provide a phone number to contact the location to determine if they are registered as a PMB in the state. Wasted a lot of time on this. Rep told me I'm not the only one who calls in about this, so clearly they don't care they mislead people."
        },
        {
          "Note": 1,
          "Pseudo": "EL PEPINAZO",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:35:02.000Z",
          "Titre": "Discarding mail.This company has admittedly",
          "Contenu": "This company has admittedly, by one employee, indiscriminately discarded all my paid subscription magazines, for months, \"We get piles of magazine, catalogs and junk mail\"Their app freezes up constantly having to turn off my cell phone off and back on. Suggested by their employee. They know their app sucks. I do not trust them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cell Talk",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T22:38:43.000Z",
          "Titre": "I initiated a package forwarding…",
          "Contenu": "I initiated a package forwarding request for items held at the Staples store and completed the payment. However, the packages were not forwarded as agreed. Upon contacting iPostal1 for assistance, I was directed back to the Staples store. Then when I contacted the Staples store, I was directed back to iPostal1. This back-and-forth experience has been challenging. Nobody wants to take responsibility because they don't want to deal with customer service. Obviously, there are some serious issues within the management team.December 18, 2023 Update:Packages are still not shipped out. They provided tracking number but they never shipped it out. I'm going to file a police report and talk with my attorney for fraudulent behaviors within iPostal1 and Staples employees"
        },
        {
          "Note": 1,
          "Pseudo": "Cindy. Y",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T00:38:13.000Z",
          "Titre": "It was great until it wasn't",
          "Contenu": "Initially, I had a positive experience. My mail was sent out on time. However, the situation changed when they started to delay scanning items, and my mail was not being sent out promptly. Moreover, some of my mail started getting lost, which was a major concern, especially when it involved my business checks. Ipostal claimed that the missing items were not in their possession, and the shipping providers couldn't help either as they never received the mail. This is affecting my business significantly, and I can't afford to keep losing my business checks or to be on top of the mail when I have a business to run. I was okay with paying the fees and dealing with late scans. The lost checks are unacceptable. As a result, I am currently looking for a new business mailbox service provider because they are unreliable.NY location Staples 5th Avenue 10018"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LLC",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:44:01.000Z",
          "Titre": "Dismal Mail Service Experience",
          "Contenu": "I recently had an incredibly frustrating experience with this mail service. Never before have I had to actively chase down my own mail. Attempting to get in touch with the person responsible for issuing my mail has been a fruitless endeavor – the communication system is abysmal. Despite scheduling several pickups, there has been no correspondence whatsoever. For business owners in need of timely mail services, I strongly advise against using this service. I won't be utilizing it again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Mathew Ramsey",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T14:47:27.000Z",
          "Titre": "There are additional steps and cost…",
          "Contenu": "There are additional steps and cost required before you can get your mail. These cost and steps are not disclosed until after you’ve paid to set up the address. Secondly, the mail room, is a spare office of another company who just has everyone’s mail in a pile. Not secure or professional."
        },
        {
          "Note": 1,
          "Pseudo": "Olga Fokina",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:00:30.000Z",
          "Titre": "discrimination based on nationality",
          "Contenu": "I am a Russian national currently residing in Portugal and recently had an experience with this service that I feel compelled to share. Despite my residence in Portugal, the company denied me service explicitly based on my Russian nationality. This decision was particularly perplexing and disappointing, as I am aware of fellow Russians who were able to use this service in the past, before the recent global changes. It's disheartening to encounter such inconsistency in service provision."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Salah Ghanem",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T20:44:43.000Z",
          "Titre": "Extremely bad service.",
          "Contenu": "Extremely bad service.No replies on my emails.No decent support for anything.Charging money from my PayPal account without any need for payment, and when i asked them, they told me it's in your balance, while my balance was Zero. When i asked for a refund, they didn't refund all the money claiming that the system only refund 10s ! What is this.I sent 2 packages to my iPostal address, and i've been confirmed with the delivery, when i asked iPostal about those packages, they don't reply on my on mail nor chat nothing. After paying a year of subscription, that happened (typical).Strongly don't recommend getting this service even for Free.. keep away from them, they are scammers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "very disappointed",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T22:37:13.000Z",
          "Titre": "No response to my questions",
          "Contenu": "I have been trying to contact ipostal1 for days now but to no avail. Phones only have recordings the majority of the time and I have yet to get any calls returned. I have been emailing as well. I have extra charges on my PayPal account and no one is returning my calls.  I have tried online chat but of course, the answers it gives you are program answers. I am very unsatisfied with ipostal.  This is my first time using them. Not sure if I am going to continue with their services if no one can return my calls and answer my questions. The emails I have received from them do not respond to the extra fees I'm being charged."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T06:17:39.000Z",
          "Titre": "Two months still no mail delivered?",
          "Contenu": "It has been two months since I started service, & as yet nothing in my accounts inbox? I'm beginning to have second thoughts about your service. I even stopped at my iPostal location, still no mail? Why? Is it because the USPS not forwarding mail? I even stopped & talked with the staff, & I was told they would follow-up? It's been a week since I made my inquiry at the Happy Valley, Oregon location. I just got my first piece of mail with $9.55 due from a Wiley Peanut Company located in Hays, Virginia that I didn't order? So I'm probably going to return it? Maybe it's a gift? And I never ordered anything. But no other mail has been delivered. Wierd?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shashi B Chunara",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T19:47:00.000Z",
          "Titre": "I thought there will be locker and…",
          "Contenu": "I thought there will be locker and package might be handle securely. But found it open on billing desk. Employee was searching in staple for the package whole over staples. Totally disappointment with service.  Will surely terminate it once package I gave this address are received. I want my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yuri Michurin",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T00:41:19.000Z",
          "Titre": "business address is useless, no refund offered",
          "Contenu": "I got the iPostal1 virtual address, but I was not able to get business license with the city since they do not accept virtual business addresses, they were immediately detected it's inside Office Depot. Same did my bank - they said it's not a true office. California state, not sure about other states. IPostal1 refused to refund the fee payment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C Harris",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T09:30:50.000Z",
          "Titre": "If I could give 0 Stars I would…Stay away! Bad business!!!!!!!!!",
          "Contenu": "This merchant closed my account without contacting me at all so it was out of nowhere because they charged me for something unrelated to this mailbox that I have a confirmation saying was a trial called istop for unwanted mail… NOT MY MAILBOX … which I also closed upon seeing it not only charged me but no one responded for support although the email says 0.00 and I haven’t been able to access since (due to closing it during the trial period to make sure I didn’t get more unexpected charges), they never responded before it was disputed to any email and it was disputed after that which I have proof of. This is extremely bad business! Stay away! I paid for a yearly subscription and a scan and shred bundle which I am now disputing on this account since the mailbox no longer exists meaning I didn’t get what I paid for!!!! This is the worst business ever! Very shady!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James A Griffin",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T20:56:43.000Z",
          "Titre": "iPostal gave me a huge hassle trying to…",
          "Contenu": "Edit: \"many people do not use services like pick up\"?? People don't pick up their mail? I find the copypasta response below to be insincere and intentionally disregarding of my concerns.I also just went through the entire process of setting up an account just to verify there is ABSOLUTELY NO notification of any additional charge outside of the 9.99/mo mentioned anywhere. Letting people know after they get mail that they have to pay to pick it up is unethical and outright intentionally deceptive.iPostal gave me a huge hassle trying to setup the account and the customer service was absolutely awful. Unresponsive and incompetent.Now, out of nowhere, I found out that every time I receive a letter I have to pay to pick it up??? This is extortion. Not once was it mentioned that there was an additional charge for picking up mail.Very strongly do not recommend this service. Super shady."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CGP LLC",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T00:18:05.000Z",
          "Titre": "I have been a customer since February no mail",
          "Contenu": "I have been a customer since February. To date, I have not been getting any mail. Correspondence from banks, IRS, and businesses.  This is terrible. I even mailed correspondence to myself, but 9 months later, still nothing. I made several trips to the facility, but the reps there were unhelpful"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teodoro L Aviles",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T15:33:40.000Z",
          "Titre": "No help, no email, no response.",
          "Contenu": "I have been having nothing but issues with your company. I made a formal complaint via text and no one from your company has reached out to me with my questions. Representative said that I could change my location. I’ve had several issues with my location and your company does not get back to me. As I mentioned to the agent, I am going to file a formal complaint with the Better Business Bureau if my situation is not handled correctly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tameka Blessitt",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T23:56:19.000Z",
          "Titre": "Not happy with the cost to ship…",
          "Contenu": "This score is no reflection to customer support. This is strictly about postal1. I was Told and signed up for this service because I live in California however my business is registered in Louisiana. I wanted Something where i could Have a physical address and somewhere items can be returned. The cost to half postal one ship an item is ridiculous. I was Being charge $48 to ship a package less than 1pound. I will Have to cancel my service and find something else because that is extremely to expensive"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vesna Micic",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T05:38:49.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Horrible customer service, they charge without setting up mail box as promised. My all mail was lost. Just horrible!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesus F",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:37:15.000Z",
          "Titre": "I wasn't aware I'd have to pay each…",
          "Contenu": "I wasn't aware I'd have to pay each time to pick up my mail. I would not have signed up for this service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Business Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T00:38:15.000Z",
          "Titre": "Buyer Beware",
          "Contenu": "From the moment you submit your application for a P.O. Box, iPostal1 will start billing you.  Your mailbox will not be activated:  any mail you receive will be SENT BACK- return to sender.  Your mail will not actually be delivered to you until after you meet many additional requirements which in my case, took two months to complete.  You will be billed for this time.  Your mail will be returned to sender and yet you will pay and continue to be billed.  This is not a very attractive business model (well not very attractive for the customer at least).  If you complain about it you will be told too bad, this is what you signed up for.  Read the fine print.  My local store told me that there are NUMEROUS applicants on \"pending\" status who are having their mail returned to sender and yet still getting billed by iPostal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca Anne Oglesby",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T03:32:29.000Z",
          "Titre": "Deceptive business practice",
          "Contenu": "Deceptive business practice.  Unauthorized fees. Three weeks into my first month of my new online mailbox, I went to pick up two packages both under the 10 day free storage time frame.  On the 11th day, I had no mail in my box or at the location and they attempted to charge my credit card 50 dollars for \"storage fees\".  There should not have been any storage fees.  I was IRATE.  I closed my box immediately.  There was no explanation for the fees.  They just closed the account. So basically if you don't catch the false billing you would never know.  I only caught it because the charge was denied.  And this reply to my review below is incorrect and proves my point.  Even if I went past 10 days and I did not, it would have been $2.20 for another 10 days per my mailbox provider.  Stop lying on my review.  You falsely tried to bill me 50 dollars for no reason."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T15:12:30.000Z",
          "Titre": "Additional fees not disclosed.",
          "Contenu": "I'm not happy at all. I get charged $10 a month, plus on top of that I'm also charged an additional fee EACH time I pick up my package. These additional fees weren't diaclosed when signing up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amber Boone",
          "Nb_Reviews": 2,
          "Date": "2023-10-15T22:54:43.000Z",
          "Titre": "LOST PACKAGES WITH NO EXPLANATION",
          "Contenu": "My first time ever using iPostal1. I went to pick up 3 packages that were confirmed to have been delivered and only received one package. They lost 2 packages - unfortunately, these were business deliveries and not receiving them caused me to lose out on money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carmen Y Riser",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T19:59:02.000Z",
          "Titre": "I have visited 3x to try and pick up my…",
          "Contenu": "I have visited 3x to try and pick up my mail.  I was told the hours of operations  IA 20am to 4pm.  I am. Here for the third  time an no one is available  and the sa.w sign we will be back by 10 am tomorrow.   IS this a SCAM? I THOUGHT  I WOULD HAVE A CODE OR SOMETHING  AND CAN COME AND PICK UP  MY mail at any time  instead of depending  on someone to be here.  Please  advise how this is supposed to work?."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cell Talk",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T20:40:41.000Z",
          "Titre": "Lack of responsibility in customer service",
          "Contenu": "Pros:* Exceptional customer service at some locations: Certain iPostal1 stores offer outstanding customer service and make the process of managing your mail and packages a positive experience.Cons:* High fees for forwarding and scanning: Many iPostal1 locations charge exorbitant fees for forwarding and scanning services, making them significantly more expensive than other mail and package management options.* Mishandling and missing packages: There are numerous reports of packages being mishandled by store employees, resulting in damage, loss, or even theft. In my own experience, I encountered two stores where staff attempted to steal my packages.* Inconsistent service quality: The level of service provided by iPostal1 varies greatly across different locations. While some stores offer exceptional service, others are characterized by high fees, inadequate security measures, and mishandled packages.Recommendation:While some iPostal1 locations may provide excellent customer service and convenient solutions for mail and package management, the inconsistent quality, high fees, and security concerns raise significant red flags. I strongly recommend researching individual locations based on online reviews and choosing alternative options if reports of missing packages or theft are prevalent.Update (December 14, 2023):iPostal1 appears to disregard my status as a customer, despite the verified status of review and issues I have experienced with their service. This behavior can be perceived as gaslighting, as they fail to take responsibility for their actions and provide adequate customer service.Update (December 15, 2023):iPostal1 has contacted me by email, providing extensive information about pricing. However, I am disappointed that they did not offer any solutions to assist with my lost packages. As a result, I intend to maintain my negative review until my packages are located. Additionally, there are concerns that they attempt to suppress legitimate negative reviews on Trustpilot. Therefore, I would advise against engaging with this company, as they may not encourage open and honest feedback from their customers."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Robin Doyle",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T01:24:54.000Z",
          "Titre": "Terrible instructions for set up",
          "Contenu": "It has been two months and I just received my first piece of mail. IPostal ensured me that everything was set up including notarized Form 1583. But they didn’t tell me we actually had to change our address with USPS separately. I was able to do mine online, but my usps said my husband had to do it in person, with 2 forms of ID, which he can’t because we are now living in another country. So his mail, including important bills, is still going to our old house, with no way for us to retrieve it. So frustrating!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melisa G",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T23:29:19.000Z",
          "Titre": "I would recommend finding another…",
          "Contenu": "Wished I tried another provider. It cost 3 X the notary fee to correct a form that was correct the 2nd time because they couldn't see on their end what I had uploaded clearly on my end. Ipostal claims the P.O needs this form but nobody, including two separate post office master generals, had ever seen the form and swore this was not the correct form. I requested the Post Office verify my credentials and fill it out the best they can anyway, then took to notary.  After several attempts to upload with the \"form team\" it was requested I email it. It was not accepted, and they sent instructions for the form. It was done correctly and notarized again. I used the email feature, not the website. Then I was not notified that they refused to approve the ID docs. That was NEVER THE CASE!!!! They then began sending repeated emails that they needed the form filled out properly and my form matched their request.  I sent an email asking they look at their request and look at the form and to call me because clearly it was correct to their specifications. Nobody called. Long and short of it was in the end.. they had what they asked me for when I uploaded it with a link they sent the first time. They couldn't or didn't upload it from their end. I was requested to upload again while on the phone with the 3rd person I was pawned to trying to resolve this. I showed her the document was the same as before and was now there twice, but she was able to approve it immediately.  Ipostal has an entire department and a link and a \"form team\" for this one document because their site is complicated. They have contracts with stores to receive the mail and these stores can't do much, but they said they take a lot of complaints.  I spent far too much time getting tossed between staples and ipostal to find that a call back could have saved me two weeks of frustration. The only reason I keep it is because I began using the address and don't have time to start over."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca Anne Oglesby",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T00:06:57.000Z",
          "Titre": "Quoted prices are not accurate.  Much higher.",
          "Contenu": "Quoted prices were not what the business charges.  I bought a 9.99 plan and it lists the prices included. The prices at the business are much higher and the services are not included The prices are not transparent.  It's a bait and switch.  Im going back to a different virtual mailbox company that is honest."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacqueline Louise  Stemage-Tur",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T20:49:12.000Z",
          "Titre": "I have to drive fast 30 miles from my…",
          "Contenu": "I have to drive fast 30 miles from my home to get there. Also, I always have to call 1st before going to the mailbox. It's not normal business hours and that sucks. I would only suggest this to people who have no other choice than to use your service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Siratul Mustakim",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T19:05:20.000Z",
          "Titre": "Orlando location at 6249 Edgewater Dr",
          "Contenu": "I used their Orlando location at 6249 Edgewater Dr. They changed their location and didn't even inform any of their users that the forwarding mailing address has been changed. I urge everyone to not use their service better use the actual USPS or UPS mailboxes for a few more $."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sanny",
          "Nb_Reviews": 12,
          "Date": "2023-09-27T16:58:42.000Z",
          "Titre": "Looked through my mail",
          "Contenu": "They went through my mail, my package was opened and then denied because it was a white powder (hair supplement) do not trust this company. Horrible customer service too never told my why I didn’t get my mail until a month later after ignoring my emails and calls.EDIT!: Read their reply, they admit they go through your mail, do you want that?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Juddel J Parker",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T15:13:58.000Z",
          "Titre": "I visited the box 2 times already and…",
          "Contenu": "I visited the box 2 times already and the information in the mail box belong to someone else. One suggestion can the area have a box set up area with lockers with keys instead of having mails in a file draw in file folders. The associates seems to have problem finding the mails when asked for. They need a better system"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T23:06:47.000Z",
          "Titre": "What a Nightmare!",
          "Contenu": "Their setup process was a nightmare. All the requested information was provided including photos of IDs and proof of address. My application was on hold for 2 weeks until they sent a plain text email saying my proof of address photo needs to be resent. When it was plenty clear for their online notary to read read and verify. Now I finally get mail, and their system tells the physical location to scan the mail image, and shred the mail! That option is not selected on the account. The option to set a pickup time for the envelope which is from the IRS is still selectable. I didn't know the envelope was shredded until I went to pickup the mail. Thanks iPostal! Big help. I'll be riding out the year, since I prepaid, then i'll be switching services. Unless this sort of thing keeps happening, then I'll just write off the advance payment."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "K",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T14:18:17.000Z",
          "Titre": "Customer support isn’t great",
          "Contenu": "Customer support isn’t great. Once you submit a support ticket, you can wait a loooooong time before getting a response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sankofa Edition",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T20:14:19.000Z",
          "Titre": "No mails received!!!",
          "Contenu": "Purchased this service after reading all the great reviews - big mistake! A customer sent us a check to the address - no notification whatsoever. They cancelled the order and we lost a sale worth over $1000 dollars. We sent ourselves a letter to our own address to test the service - no notification or indication we received any mail. Emailed their customer service to inquire about this issue. Twenty-four hours later, no response. Makes me wonder about all these “great”reviews."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Todd Redmond",
          "Nb_Reviews": 4,
          "Date": "2023-03-23T07:48:19.000Z",
          "Titre": "In addition to all the other charges…",
          "Contenu": "In addition to all the other charges they have for \"service\" they add $16.95 just to simply mail a check to a bank so it can be deposited? What a joke. This business seems to specialize in creating additional special fees. Maybe more importantly they don't provide any transparency up front so customers will only figure out how greedy they are after it's too late."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Roger Garcia",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T23:31:10.000Z",
          "Titre": "Bad experience.",
          "Contenu": "Bad experience.Wasnt able to get through the initial set up process. Was too complicated and customer service was unhelpful through the situation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Jay Smith",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T12:22:21.000Z",
          "Titre": "The sign up process was exhausting",
          "Contenu": "The sign up process was exhausting. I finally got some help and completed the process to find the same lack of help in accessing my in box.  It has been two weeks since I had my mail forwarded and nothing is in my in box and no one will help me find out why.  They actually asked me why I was calling and what was I expecting and that it frequently takes a month or more for stuff to show up in the inbox.  When I explained I was expecting bank statement and bills they asked me how often I get this type of mail.  What a moron!  I wish I had never started the process."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-27T20:47:02.000Z",
          "Titre": "Mail and packages were delivered to…",
          "Contenu": "Received notification from shipper that mail and packages were delivered to location more than a week ago, yet was told I couldn’t receive them until they “logged” it in their system and this was supposed to take a few more days. Customer service at the store was very rude and unprofessional. You are better off simply going directly to the post office or UPS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dannt",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T18:54:25.000Z",
          "Titre": "I never saw anything in the marketing…",
          "Contenu": "I never saw anything in the marketing about $1 per package to pickup.You say, \"Many people do not use other services like pickup\" justifying a $1 per package charge, where I would say, what is the point of a mail drop address if you don't get shipments there, and if there was a way to get my packages without 'picking them up' to avoid an extra fee then please enlighten me.  If I get an address at UPS Store  for example, they don't have a 'pickup' change. They would expect, as most would, you would get shipments in, that is obvious.My main point is the deceptive way this charge is applied. After searching for 15 minutes on the iPostal1 site, I finally found this verbiage, \"Some locations charge a small pickup fee.\" Well nice to know now, I already paid a year in advance. I didn't know this when I signed up.  Which locations? Tell me so I can avoid those. Small pickup fee?  How small? It seems they can charge what they want, because I don't know in advance what the fee is going to be.  How am I supposed to make an informed decision?  I have been with the service for less than two weeks, so there is a hidden, secret way to get out of this, please let me know - this is really a deception.\"Details on pickup fees are available by each address listing.\"  You will not see these details unless you click on a greyed-out button; important cost details are hidden when they do not need to be hidden, it's literally two lines of text which takes up the same space as the greyed-out 'More Details' button."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janet Gustafson",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T21:32:08.000Z",
          "Titre": "They will charge your card way in…",
          "Contenu": "They will charge your card way in advance and refuse to reverse it if you no longer want the service. They also submit false records if you charge back through your credit card. I just got charged $99.00 for an account that no longer even exists.I submitted all of those forms years ago. I’ve been a customer for many years. I had an account, I cancelled it, you just charged me a $99 renewal fee, I protested the $99 renewal fee through my credit card company, and you sent me an email telling me you were deleting my account because I protested the credit card fee. You then told my credit card company that you get to keep the renewal fee you just charged me even though you sent me an email telling me you were cancelling the account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Me Me",
          "Nb_Reviews": 3,
          "Date": "2023-09-29T21:14:13.000Z",
          "Titre": "This company closed my account because…",
          "Contenu": "Update to response...which is a lie as you covered up my lost package due to your not adding the complete address and your stuff doesn't respond for days then doesn't seem to know what they are doing. POOR TRAINING MAYBE AS THE FISH ROTS FROM THE HEADThis company closed my account because of my \" colorful language\" instead of their incompetence and never refunded the package I paid for and the remaining days on my account. These are crooks and liars IMO. I have decided to file with OMBUDSMEN SERVICES"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Behrooz Roozbeh",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T23:15:18.000Z",
          "Titre": "canceled my account on June 30 2023",
          "Contenu": "canceled my account on June 30 2023, here is the confirmation email from Maria,  I Postal continued to charge my credit card for $15 on Agust 15 and $9.99 on Sep 4th.Following Please find the confirmation email I received.----->June 30, 2023 at 4:43 PMiPostal1 SupportRe: Helpdesk: New Request ( Please Cancel my account as of today )To: Behrooz RoozbehReply-To: iPostal1 SupportHi Behrooz,As per your request, your iPostal1 Digital Mailbox has been canceled.Moving forward, you will no longer receive charges from iPostal1. Please update your contacts to let them know that you will no longer be receiving mail in this location.Should you need a digital mailbox in the future, please feel free to reach back out to us, and we will be happy to service you.Sincerely, MariaSupport Team @PostalliPostal1 - Digital Mail Delivered. Since 2007."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Beverly Terry",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T05:19:18.000Z",
          "Titre": "unacceptable",
          "Contenu": "This services is being advertised for those who have small business' and starting out.  I began my process in February however due to an internal issue I have missed out on contracts, services, checks returned etc.  This is complete unacceptable.  If had not paid for the year and changed my address on DnB I would take my services elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T22:12:08.000Z",
          "Titre": "Beware hidden fees & bad customer service",
          "Contenu": "After I opened a mailbox, I was charged a $3.00+tax fee to pickup a small envelope package and this fee was not listed on that location’s fee list as a fee I could be charged. And the location just said “No refunds”, wouldn’t address the fact that this fee was hidden, blamed it on ipostal1, despite the charge identifying them. So, I closed my account soon after. With these hidden fees, the cost of renting a ipostal1 box is much higher than renting a PO Box at USPS. More expensive and ridiculously unpredictable. I don’t recommend👎🏻"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donald Noel Misenar Jr",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T18:45:40.000Z",
          "Titre": "Trash Service, No No Nice Way To Say It",
          "Contenu": "See my Google review. This is not a small customer shop. It is a $5.1 million business that hasn't figured out even the basics of how to run its operations. The price that they advertise is not the price that you will pay, period. There is up-charges, after up-charge after up-charge, starting with the notarization to the charge for picking up each individual package. Before you even get to that point, if you ever do, do not e Otto be able to use their services for at least one month, absolutely one month at the very minimum from the date that they charge you to start using their service. It is a scam company with completely inept people at the helm."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jaceguai De Magalhaes",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T04:30:52.000Z",
          "Titre": "Messy and usual lose your mail",
          "Contenu": "I have an Ipostal account at San Francisco 730 Noor Ave. At staples. They are a complete mess, they usually loss mail, and when you try to figure out where is your mail with them they have a less then acceptable customer service. Don’t loose your time with them. They are certain headache."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenneth R Fletcher",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T16:10:28.000Z",
          "Titre": "Mail returned, we couldn't use ipostal1 for a month due to approval delay on their end",
          "Contenu": "We couldn't use iPostal for a month due to an approval process on their end, and we still had to pay for that month even though important mail was returned. I filled out the required Form 1583 on Aug. 16, had it notarized through their recommended Notarize service, and submitted through iPostal's channel. More than a month later I discovered that my mail had been returned to sender. My form had never been approved and nobody contacted us. After I contacted them on Sept. 20 they requested my wife fill out a form 1583 as well as a secondary recipient. They claimed that the lack of my wife's form was the reason for the delay, even though I as a primary mail recipient had filled out the form more than a month in advance and it was never approved by them. We missed out on important information, and I can't believe that no one from Ipostal1 contacted us about the issue until I brought it up, nor did they offer to reimburse us for the month we paid in which they did not approve my documents. It took several phone calls and e-mails to clear up this issue even though I followed their instructions to the letter."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brittany Singleton",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T16:48:31.000Z",
          "Titre": "It was very difficult to use and…",
          "Contenu": "It was very difficult to use and understand.  Documents did not upload easily and I had to get on a chat and spend a ton of time gaining clarification."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ruben S.",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T23:47:12.000Z",
          "Titre": "iPostal lost important mail (IRS), and no answers!",
          "Contenu": "iPostal lost important mail from the IRS. After 10 days of chats, I have still have NOT received a note, a courtesy call, or an email in regards to the issue from corporate personnel. Just my chat transcripts and assurances from very helpful and powerless chat persons. I would NOT RECOMMEND THIS SERVICE!!REPLY to comment: INCORRECT, customer service has NOT been in touch me, it has me contacting them repeatedly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald Terrulli",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T02:10:50.000Z",
          "Titre": "Your service is great and customer only…",
          "Contenu": "Your service is great and customer service only told in big print $9.99 per month for 30 letters or packages No one has in big print that customer pays mail center money every time he drives all the way there to pick up 1 envelope Not only does the customer waste $ in fuel then pays to pick up the 1 envelope Other than that I think the service is a good concept and better than say a ups store mail box rental if a person gets very very little mail like I do."
        },
        {
          "Note": 1,
          "Lieu": "PR",
          "Pseudo": "Mauro",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T05:43:28.000Z",
          "Titre": "Cost of shipping estimate given on the…",
          "Contenu": "Cost of shipping estimate given on the website before the membership is taken are not real. The cost of shipping is actually 3 times the amount offered. Extremely excessive shipping cost for location. More than $111 cost of shipping for some shoes that only weight 4 pounds. When asked for quote and online through USPS it’s only $54.70. Unbelievable. I was robbed."
        },
        {
          "Note": 1,
          "Lieu": "VN",
          "Pseudo": "MW",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T23:00:53.000Z",
          "Titre": "They don’t return calls",
          "Contenu": "I sent in the forms to set up my account almost immediately. I reached out to customer service online because I kept receiving an error message stating that I hadn’t sent in the forms. The rep advised that I needed to call the location to have them expedite uploading the docs. I called and left a message, no response. I called again, nothing. They finally uploaded them but in both messages I did ask someone to return my call. I already paid for a full year or I’d cancel the service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Regular protein user",
          "Nb_Reviews": 3,
          "Date": "2023-07-21T23:01:12.000Z",
          "Titre": "This really sucks",
          "Contenu": "There’s no physical mail box and staple’s employee has to dig around the packages to find one’s package.Furthermore, I’m already paying for the mail box or space but I got charged for receiving a package.This is ridiculous!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M.Williams",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T06:22:41.000Z",
          "Titre": "No customer service!",
          "Contenu": "My requests have gone either unanswered or extremely slow at being answered. I've been requesting for them to update my email address for over 2 months and they still haven't nor do they alot any changes online."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Brandon Foster",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T16:02:55.000Z",
          "Titre": "I can't receive any mail and no one has…",
          "Contenu": "I can't receive any mail and no one has any idea what is going on they promise to get back to me but never do. Its been 2 months we are behind on bill payments now.We will create a ticket they say....They responded to this Aug 22 saying someone would reach out and of course no call again.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Maltby",
          "Nb_Reviews": 3,
          "Date": "2023-07-17T13:32:22.000Z",
          "Titre": "Filled out the paperwork Thursday…",
          "Contenu": "Filled out the paperwork Thursday evening and PAID, PAID again for notary service. AUTOMATED email told me it would take 24 hours to activate. I have gotten nothing within the time period advised, and the company does not have customer service on weekends."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Hossam Elharmil",
          "Nb_Reviews": 4,
          "Date": "2023-08-04T14:00:26.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service. Reached out for a refund and they said my bank couldn't accept the refund because they were sending in USD and my bank account is in EGP. Sent them my USD bank account and they literally ghosted me. Not recommended."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "T.D",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T16:29:53.000Z",
          "Titre": "Watch credit card charges carefully",
          "Contenu": "The process for picking up your mail is very inconvenient.reaching customer service is almost impossible.  Also, my second box was UNAPPROVED from Feb-May however, I was charged $9.99 for that time and was told only the last charge will be refunded. Pay attention to the charges on your card with this company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "NT",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T08:46:28.000Z",
          "Titre": "Ignore request with mail",
          "Contenu": "I had called and email various times for mail to be rejected as per the advice of the seller. Service completely decided to ignore and now I have to pay per day that the mail is kept. Incredibly bad service!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Believing For More LLC",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T19:50:03.000Z",
          "Titre": "My package was delivered on 5/3/2023…",
          "Contenu": "My package was delivered on 5/3/2023 with confirmation from USPS however when I went to Staples, I was told that I would have to wait until someone went to the mailbox outside to get the package or until the post man brought in the packages. I followed up the next day and I was told they were understaffed and my package as still in the box. I was finally able to get my package on 5/5/2023."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarita F",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T21:00:45.000Z",
          "Titre": "The sign-up process was smooth and took…",
          "Contenu": "The sign-up process was smooth and took about an hour. In January I received my confirmation email with the postal address with my mailbox number. I used the address provided but never received my mail. After multiple phone calls over the past three months, I was informed on April 25th that information was missing from my confirmation email. The building I selected had a suite number and it was not noted in the confirmation email or in the portal, causing me to lose wages, not receive products, and have missed opportunities. I am awaiting a response from management at Ipostal about the issue. This has yet to be resolved. I will provide an update once I receive a response from management."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dissatisfied Sally",
          "Nb_Reviews": 2,
          "Date": "2023-04-09T05:11:58.000Z",
          "Titre": "I've genuinely had nothing but issues…",
          "Contenu": "I've genuinely had nothing but issues with this service, with the assigned Staples location, with the employees at the location who have no idea what they're doing or how to sort/receive mail. It's been A W F U L."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emma",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T08:22:44.000Z",
          "Titre": "I wish I could leave zero stars",
          "Contenu": "I wish I could leave zero stars. I requested a piece of mail be shipped to me OVER a month ago. They then shipped me 2 items that I requested to be discarded long before that. I never received my requested item and I have been in touch with various members of their team over the last month, yet NOTHING has been done. I still have not received my item and I continue to get false promise after false promise that it will be resolved, or that someone will contact me, and they never do. It's absolutely disgusting. Their service and follow-through is non existent. DO NOT use this company. They will lose your mail, and never take accountability or rectify the situation.  TERRIBLE company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T15:23:29.000Z",
          "Titre": "Not Business Class",
          "Contenu": "This just isn't meant for more than a solo entrepreneur. This breaks when more than one person needs to use it. Much of the marketing isn't accurate. We have had trouble using it as a real address for our business and they have failed to sign for packages."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tina",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T22:15:50.000Z",
          "Titre": "DONT DO IT !",
          "Contenu": "It was not made clear that I would be charged for every letter to be opened then charged an additional fee for the item to be shredded.  This service is a money grab in my opinion.  I'm closing my account and would no recommend to anyone, unless you just have money to throw away.  Work on being ethical with upfront information about your services and fees."
        },
        {
          "Note": 1,
          "Lieu": "AR",
          "Pseudo": "JESUS ENRIQUE DIAZ GUEVARA",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T06:37:09.000Z",
          "Titre": "unacceptable",
          "Contenu": "unacceptable, the services they offer are not real.  They do not receive correspondence from amazon or google.  He caused us damage, - 5 stars"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-04-26T15:49:49.000Z",
          "Titre": "I would give 0 if possible",
          "Contenu": "I would give 0 if possibleWhen i want a letter forwarded and pay 15$ for express. It should not take 5 business days to get the letter.No money back everyone is blaming someone else.Worst company on earthAlways the carrier NO!I requested shipment Sunday 03/12 business closed OKMonday nothingTuesday nothingWednesday 507pm again PM 507 shipment was created... to LateThursday USPS picked up and delivered FridayBullhead Print and Ship blame iPostal1 iPostal1 support blame USPSAnd now iPostel1 is blaming me:ipostal1.com has flagged your review because they don’t think it’s based on a genuine experience. To keep your review online, we need to ask for your help.You shouldn't treat customers like that"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T23:29:18.000Z",
          "Titre": "AVOID!!",
          "Contenu": "AVOID!!! I received some documents at my virtual address and I requested them to be forwarded to me. The cost of this was $65.40 which is relatively high just for some documents but I still went ahead. The next day, I got charged $114.46! The customer service doesn't seem to be bothered at all and won't refund the difference. They will the runaround and ask you to contact the mailing centre and the mailing centre will ask you to contact iPostal."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Jack Duffy",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T17:48:53.000Z",
          "Titre": "Absolutely terrible service from the…",
          "Contenu": "Absolutely terrible service from the day I subscribed. And wasting a huge amount of time getting my account established, I now find that my mail center is closing. Hopeless!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T22:42:46.000Z",
          "Titre": "Stay away",
          "Contenu": "These guys are a complete joke. Almost every single time I want to forward my mail or have something outside of a scan done, they have some kind of issue. Paypal won't work, auto-charge doesn't happen, and credit card gets declined even though it is just fine. Random charges on my credit card, scans are horrible in quality. The website is absolute trash. The app is worse. I don't know how they are still in business. Support is trash."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frustrated user",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T17:56:27.000Z",
          "Titre": "Under staffed",
          "Contenu": "Under staffed. I had to go into the mail locations to check if my mail arrived. Location is just starting to process a month old mail. Feel I should have received more mail but never received. Having mailer to resend all bills again."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Shubha Iyer",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T09:37:27.000Z",
          "Titre": "A very honest and constructive feedback",
          "Contenu": "A very honest and constructive feedback1. I initiated one year contract based on feedback. When my first mail didn't make it to your mailbox, I initiated chat support. They asked me to contact the mailbox saying they just connect mailboxes. If you had clearly stated that on your website, very few would begin a contract. We are busy people who do not have time for two-step follow-up for issues that seem to not have been there in the first plae.2. I spent $22 dollars to redirect my global entry which was time sensitive. The mailbox support was not able to tell me why it was not scanned for 6 days. I am concerned with how much time you all take to scan the mails once received."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RHONDA R WOODSON",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T18:08:40.000Z",
          "Titre": "I tried to go back and change the name…",
          "Contenu": "I tried to go back and change the name on the account. I thought I canceled it. I created a 2nd account which I tried to cancel because I wanted to return to the 1st one, so I sent an email asking for it to be reinstated. My mistake cost me dupe account charges, for which iPostal1 holds me accountable. I discovered the changes went back to March, so that's the money I wasted trying to use your service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anne Singer",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T20:36:32.000Z",
          "Titre": "HORRIBLE EXPERIENCE",
          "Contenu": "They refused to give me a package that was delivered to them for me.  Joe Cabral in Camarillo office who claimed he was a manager and refused to give me the name of the owner, told me they can't give me the package because the person who delivered it was not wearing a uniform.  While I am standing there, he then gives it to the mail carrier who walks out with it.  I had to follow the mail carrier and pay $10.05 for a package that Ipostal1 says is part of their service.  Virtual Business it says on their website.  \"We accept packages from any carrier.\"  It says.  If I had not heard back from my client that they  were told the package would be returned to sender, I would not have even known that they were refusing packages.  I called Ipostal1's complaint line and a very nice lady apologized and said that should not have happened and she would transfer my account to a different location. Yet, this morning, I get an email that my account has been cancelled!  No refund either!  When I called today, I am told someone will have to call me back!  If you want peace of mind and to have a nice day each day you run your business, DO NOT SIGN UP WITH THIS COMPANY!  Horrible experience and I am a new customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Devante Walker",
          "Nb_Reviews": 4,
          "Date": "2023-05-28T17:52:25.000Z",
          "Titre": "Stole my money and refund",
          "Contenu": "Requested a refund on 5/20. Wad told it was sent. today 5/28 they told me my bank declied it bc i had my debit card replaced because i lost it. I tried to give them my new debit card amd they will only refund to original payment method.So I am now out money for a service I never used. I have also filed with bbb, ftc and plan on doing a chargeback since they think its okay to steal from customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Russ",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T06:17:27.000Z",
          "Titre": "Three packages were lost",
          "Contenu": "Three packages were lost, I have FedEx tracking proof of delivery and iPostal1 can't find any of them, they claim they were never delivered, however, they charged me for a forwarded package that doesn't exist and they have no proof they send me anything,,, aside from the email from their management with a UPS tracking number.They're a joke, keep looking"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bridget Tarver",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T03:34:54.000Z",
          "Titre": "I purchased the virtual address/mailbox…",
          "Contenu": "I purchased the virtual address/mailbox plan on 2/19 followed by getting the necessary documents being signed and notarized. Contacted Ipostal due to a message being reflected once I sign in that displayed \"will be ready to go in 1-3\" once approvals however, the 1-3 days never came as I am still pending a response from Ipostal 12 days later. I've requested a full refund $25 for notary and $9.99 for the monthly service because the lack of help and response. I do not recommend this company and I may be out of $35 dollars along with Ipostal having my personal documents used to sign-up. I would not trust this company if you're thinking about using them!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Hurlburt",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T16:41:16.000Z",
          "Titre": "My mail sat in the backroom for a week…",
          "Contenu": "My mail sat in the backroom for a week and a half.  I was expecting a very important letter and package from a customer. I called every other day they stated they didn't have anything.  After getting a tracking number from the customer I found out it was delivered a week in a half ago.  Spoke with a manager and they stated they had people out and the none of the mail was checked. Unacceptable.  Hope things get better moving forward."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "K L",
          "Nb_Reviews": 6,
          "Date": "2023-06-04T00:22:58.000Z",
          "Titre": "Poor service",
          "Contenu": "Sign up thru local mail shop with this. They lost my mail after couple months of service. I requested couple months service free make up the inconvenience that caused me. They drag their feet after a month I canceled the account end the ordeal with them. Not recommended."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laurel Christine Farrell",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T17:18:38.000Z",
          "Titre": "I subscribed to the service so that I…",
          "Contenu": "I subscribed to the service so that I could receive my mail remotely and in PDF form. Instead of opening my mail and scanning it to me, I received a scanned copy of the envelope. I can get that for free from the united Postal Service. I’m very disappointed and if I can’t figure out a way to resolve this with the company, I will be stopping my service immediately."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tamitha Horton",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T21:29:32.000Z",
          "Titre": "It too two months to approve my mailbox…",
          "Contenu": "It too two months to approve my mailbox yet they still charged me. then when I was finally able to pick up my mail I waited for for 20 minutes for someone to take their sweet time doing other things and sorting through a stack of hundreds of pieces of mail for my TWO items that I've been needing for my business for nearly two weeks. then they had the nerve to charge me just to pick it up lol....HORRIBLE and I'm canceling"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DAMEIN PETE",
          "Nb_Reviews": 6,
          "Date": "2023-07-17T16:14:38.000Z",
          "Titre": "I went to pick up my mail and no one…",
          "Contenu": "I went to pick up my mail and no one was there. The door was locked at my scheduled time. I’m very upset. It wasn’t outside normal business hours. I received an email Saturday morning 7/15 and I scheduled a time 12:45 pm pickup time, in which they do not close until 2 pm. When I went back on the website to confirm that their reply is not relevant, I saw that they changed my time somehow to 6:30 pm which was not the original time I had chosen. This was changed because I complained and left a review. Please do not insult my intelligence that way ipostal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rosemary K.",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T16:51:23.000Z",
          "Titre": "They lost a letter I saw in my mailbox",
          "Contenu": "They lost a letter I saw in my mailbox.  Impossible to get a human on the phone.  Chat took 1 hour to agree the letter was lost and open a ticket to find it.  Was supposed to get status in 2 days, it's been a week and just got an email saying they will look into it and I should hear back in 2 days.  If they hired more agents and paid them a better wage it wouldn't be so hard to get things resolved.  It's not the fault of the reps, but of management that isn't managing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda Bray",
          "Nb_Reviews": 4,
          "Date": "2023-05-19T16:42:31.000Z",
          "Titre": "No satisfaction with IPOSTAL.",
          "Contenu": "My husband and I joined ipostal. We went from filling out the necessary paperwork to return 3 different to insure the system. A month later we have not heard from ipostal. My husband had to call around to find out what was going on. So, in addition to joining ipostal, we had to work out with the USPS which is costing us an additional 600.00 dollars to receive our mail. So, you should not use this program. Just use USPS. IPOSTAL is just adding an additional cost."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aimee Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T19:17:06.000Z",
          "Titre": "First time picking up a package at…",
          "Contenu": "First time picking up a package at Staples in San Bruno, CA and they lost it. I use this as a business address. Not very impressed to use iPostal for my business if packages are going to be lost. The Staples Store was chaotic and disorganized. An employee told me if they don’t have it, the package was never sent. I had the USPS tracking number stating the package was delivered to the store. Not impressed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hale B KINCAID",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T13:26:30.000Z",
          "Titre": "After I completion of my notarized …",
          "Contenu": "After I completion of my notarized  documents they set in my account for many days with out being processed.  As a result my documents / mail was sent back. I got a notication I  had mail  and it is someone else's mail not mine. Didn't   process my sign up documents in a timely manner. You sent back my mail.  You gave me someone else's mail. Someone else  mail is still in my mailbox."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CO",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T18:05:55.000Z",
          "Titre": "The address changed",
          "Contenu": "The address changed! The purpose of getting this for me was to have a stable address for providers. Now I have to do another address change. And I just received a mail notice of something that wasn’t remotely addressed to me. I’m frustrated that I paid for a year for a completely useless service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul J Rydza Jr",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T00:55:17.000Z",
          "Titre": "I was charged for a scheduled pickup…",
          "Contenu": "I was charged for a scheduled pickup for a piece of mail that was not even addressed to me, but the former box holder. Also it took over a week for the location to approve my USPS paperwork."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chase",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T22:06:37.000Z",
          "Titre": "Terrible service",
          "Contenu": "Terrible service. Im still having problems 3 months later. Stuff just gets lost thats sent there. Its uncanny how not being able to receive mail is pretty crucial to running a small business. I am not happy with this service at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Judy S. Jones",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T00:41:37.000Z",
          "Titre": "I scheduled to pick up my package at… Store closed",
          "Contenu": "I scheduled to pick up my package at 7pm. I arrived at the store to find it closed. I was told by a store owner the postal store closes at 5pm daily. So, if that’s the case why have a pickup times after 5pm. I received an email on 5/30 that my Flatbush address is changing to a Broadway address. No date was given for the change to the new location. Why, pick a new location for me ? Broadway is too far for me to pick up my packages. I paid for convenience not inconvenience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SOPHIA WILLIAMS",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T15:26:07.000Z",
          "Titre": "I have mail and unsure how to receive…",
          "Contenu": "I have mail and unsure how to receive my mails.Went to where mailbox is located and could not find where mailbox is located."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disgrunted Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T21:44:47.000Z",
          "Titre": "The worst. Avoid.",
          "Contenu": "Went back and forth through chat for days about a package that was supposed to arrive weeks ago.Had it forwarded to my address, and instead they shipped it back to the sender's address.Complete waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emmanuel",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T00:41:51.000Z",
          "Titre": "I have been using iPostal1 for over a…",
          "Contenu": "I have been using iPostal1 for over a year now, never really had an problems until today when apparently an imposter called iPostal1 to cancel my account. I received an email saying my account was cancelled and I never requested cancellation. This just showed me how easy it was for somebody to get access to your account. The security of iPostal1 account is really vulnerable anybody can call iPostal1 claiming they are you and without verification can access your account in my case cancel your account without verification. If you care about secured mail this is not it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T17:51:14.000Z",
          "Titre": "Not loving this service",
          "Contenu": "Not loving this service.  Particularly the hidden fees ($1 to pick up my own mail, that I'm already paying to have delivered?).  Also, the address line is so long, the IRS can't fit it in their data base field.  I'm on the phone with them now trying to fix that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 5,
          "Date": "2023-08-25T12:28:04.000Z",
          "Titre": "Lack of Transparency on Fees...",
          "Contenu": "I've been using this service for a little while now. But in the last three months I've noticed a lack of transparency across their services or unclear pricing even after I selected the rate to forward my mail.I'm getting charged double or three times the rate I selected to include service fee. I'd thought iPostal1.com was competitive and transparent in this industry as advertised. Instead they started charging my account crazy fees without disclosure in any invoice.I was charged $21 to forward a 3 pounds package to a US domestic address using USPS. I was charged after I selected the rate to ship the package. It wasn't an international address...Nonsense!I hope they can start disclosing Clear Pricing and total cost w/ rates before charging my account. A breakdown invoice should be disclosed before authorization.I did send an email to support about this issues, no answer at this point. It was more than one occasion where hidden fees were charged AFTER I selected the forwarding rate(below $10.00). As per your request here is one of the transactions numbers: M10981 Invoice 15658464 under druiz. I did email support via the contact us page without an answer. Next time you decide to flag your own customers answer your customers emails looking for support. I'm reducing this review to 1 star due to your lack of ethic to responds my emails and for trying to flag my review instead of taking responsibility for your service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy Camper",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T19:33:16.000Z",
          "Titre": "Sketchy Service",
          "Contenu": "I have not received notice of any mail after six months, customer service is poor and non-responsive, and the mail site is hard to reach (busy line after repeated attempts to call)."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Not acceptable",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T14:57:14.000Z",
          "Titre": "The scanned mails only showed parts of…",
          "Contenu": "The scanned mails only showed parts of the letters received and I contacted the customer service. No one replied after multiple attempts.  Also, I’m no longer getting mails through the address, but I’m sure that many mails were sent to the address.  I’d like someone to reach out to me.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-18T00:15:09.000Z",
          "Titre": "This better be a mistake",
          "Contenu": "I have been paying them for a year or two, in preparation for an extended away from home.  Until today, I only received average one letter every 3 months or so.  They made mistakes before, but no big deal, no one perfect.  But I can't believe what's happening today.  I left town a week ago.  I saw a notification email today.  Signed on and noticed there was another mail that had been sitting there for the last 10 days.  Had they notified me, I would have picked it up before leaving.  Ok, whatever, I placed an order to have both letters forwarded to me in another state.  Their system said no charge.  I thought that was odd.  Later (after they sent it out in one envelope), I got an email showing almost $17 for the forwarding.  Are you kidding me?  I have to wait to speak with them till tomorrow, but I hope this is a mistake.  I will update this review later."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael C Ingle",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T05:23:25.000Z",
          "Titre": "I have to schedule a week out in order…",
          "Contenu": "I have to schedule a week out in order to pick up my mail. I am always traveling for work and not always on the island (Oahu Hawaii) I have no idea from week to week where I will be. They also charge me $5.00 to pick up my mail every time on top of my monthly fees.I feel completely ripped off and it is super frustrating to have to make a week prior to get me mail.I also am typically an hour away from where the box is located, and I can only pick up the mail after 2:00 pm and before 5:30 pm which means I must sit in horrific traffic. Again, it is very inefficient and more of a pain than I can describe."
        },
        {
          "Note": 2,
          "Lieu": "BR",
          "Pseudo": "Tuncay Cil",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:20:48.000Z",
          "Titre": "1) Pedestrian/non-intuitive user…",
          "Contenu": "1) Pedestrian/non-intuitive user interface. 2) No empathy for end user use cases and journey. 3) Would be best to have a guided set-up and send/receive first mail.4) Slow customer care response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MA",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:55:20.000Z",
          "Titre": "I knew that I had been mailed an item…",
          "Contenu": "I knew that I had been mailed an item on 11/30/23 from a local company. This morning, 12/7/23, I finally called to inquire if i have received any mail yet. They went to look and confirmed that I had and would scan a photo of it to me. It doesn’t take a week for mail to go locally, and I still have not received a pic of it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NM",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T17:28:52.000Z",
          "Titre": "Hidden fees, slow processing time",
          "Contenu": "Slow processing time, paid pick-up ($1/package), additional $25+ to notarize the form PS1583 online instead of going to the office. After the form is notarized, it takes ipostal1 1-3 business days to approve it, meaning you can't start using this service the same day you subscribe to it."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "KRENDALL srl",
          "Nb_Reviews": 6,
          "Date": "2023-11-01T11:09:57.000Z",
          "Titre": "There must be an \"ON HOLD\" option (!!!)",
          "Contenu": "As much as it seems an amazing service, also thanks to the innovative way they have to validate the documents and their fast service, WITHOUT the possibility of putting \"on hold\" an account the whole service feels like a scam.If I cannot put \"on hold\" somehow my paying subscription, I will have to spend money and re-do the whole subscription process just to \"reactivate\" my subsctiption. that is crazy and feels like a scam altogether.I feel there MUST be an option to have an \"unactive\" account but that still retains the validation process that is time consuming and costly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 5,
          "Date": "2023-11-07T02:33:55.000Z",
          "Titre": "No communication",
          "Contenu": "No communication.  Some of the small envelopes never reached.  Perhaps it's my settings but the experience has not been good to fully migrate my company address."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James F.",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T15:57:09.000Z",
          "Titre": "No one did informed me that my mailbox…",
          "Contenu": "No one did informed me that my mailbox was not working all my mail got send back , i sld not be charge for the month of September poor customer services.DID everything i was asked to do please is just poor customer services."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "eka",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T15:54:46.000Z",
          "Titre": "it took over 2 months for the mailbox…",
          "Contenu": "it took over 2 months for the mailbox to work, and I never received one of the 2 test letters I sent (and the mailbox is only a few blocks from me)edit based on response: I did not file a change of address, and by 'receive' I was referring to notifications within the platform. i finally received the scanned test letters on 10.2.2023 - extremely late"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "∂αиι",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T18:44:16.000Z",
          "Titre": "Charged for everything, even incorrectly filed mail",
          "Contenu": "Mail is incorrectly placed in my mailbox quite often and there is no method within the app for the user to remove the mail other than sending an email or making a phone call to ipostal1. If you forget, you get charged for mail that is not even yours. Between this continued frustration and their increased nickel and diming for every action, it is time to find a better mail service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pedro Burelli",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T18:48:26.000Z",
          "Titre": "The most convoluted sign up process i…",
          "Contenu": "The most convoluted sign up process I have experienced. Paid $50 to Notarize Online to expedite things and I still had to make six phone calls and upload documents multiple times. I start my experience as a client with the feeling the whole thing is very clunky and inefficient. And I could have saved $50 by getting a Notary myself and uploading the documents. Customer care pretty clueless.UPDATE after reply:I know Form 583 is a USPS requirement. That is not my issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kylee S",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T15:11:49.000Z",
          "Titre": "Unclear Fees and Costs",
          "Contenu": "I was surprised to find out about a $1 package pickup fee, as this was not something that is communicated clearly when you sign up for this service. I only realized this after I checked my bank and saw a pending charge. No prior authorization was required for it either, which also irritated me. We don’t typically receive packages in the mail, so I’m really dreading when we do now. I chose iPostal because it was cheaper than a USPS box, but after the uncharges, it’s actually not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Additional Fees",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T16:49:53.000Z",
          "Titre": "Pay attention to your account",
          "Contenu": "Pay attention to your account. Fees get charged to you - even after you’ve cleaned out your mailbox. This service is advertised as $9.99 or whatever price per month, but there always seems to be an additional charge for something. There is a customer service number to call but no one ever picks up. The only way to contact them is through email and it will take them a week or so to respond back to you."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "S. Manz",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T15:10:40.000Z",
          "Titre": "Increased postal rates make it hard to use this service",
          "Contenu": "I have maintained this service for years however the recent massive increases in postal rates have become inhibitive for people like me who maintain this service for US to Canada forwarding.In a recent experience I paid over $80 USD in USPS postal charges, in order to forward a $20 small bottle of mint mouth fresheners (less than 0.1 lb in weight and small dimensions). I was told that this was my lowest cost option."
        },
        {
          "Note": 2,
          "Lieu": "QA",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T22:30:01.000Z",
          "Titre": "Price is good/ customer service NOT",
          "Contenu": "Price is good but customer service is really bad. They don't respond to phone calls (they don't take calls) and it takes days for them to get back to you on the simplest issue, usually with an unhelpful answer. ** they keep saying, they're currently short staffed, but they've used that excuse now for over six months. At some point, it's just about bad business management."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Don D",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T20:31:53.000Z",
          "Titre": "Rough experience trying to sign up…",
          "Contenu": "Horrible experience trying to sign up for this company.  They kept rejecting my credit cards...all of them.  Then their customer service kept pushing me to sign up with PayPal which requires you to spend 2.5x the monthly price to use.  Got the runaround from everyone at this company.  Tread very carefully with this company and beware.Update: Finally got signed up  but took an entire week and a lot of effort.  Also, the notarization had to pushed through as well so not a straightforward process.  I'll update the experience as it progresses."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T16:56:41.000Z",
          "Titre": "I only need an address.",
          "Contenu": "They keep asking for my review even though I don't want to leave one so here it is....I only need an address, but they make the process burdensome and annoying, especially for small business owners. They nickel and dime you, never have office space available because they allow people to rent them monthly.  I don't think the service is worth it.  $40+ each month just for the address, $3+ to auto scan letters (even if you do not request this service), $1+ to pick up your letter etc... Hire an attorney to handle your business correspondence, it's cheaper and you have legal representation/privacy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FatalGoth",
          "Nb_Reviews": 2,
          "Date": "2022-12-08T02:42:15.000Z",
          "Titre": "All crickets…",
          "Contenu": "I have reached out to customer service multiple times regarding the status of some parcels that had received been received and shown as shipped to my PO Box by ups days prior to getting a notification from iPostal1 that I had anything in my PO Box and I never got a response back from customer service I just had to wait and hope that my mail wasn’t missing"
        },
        {
          "Note": 2,
          "Lieu": "KR",
          "Pseudo": "An K",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T12:00:50.000Z",
          "Titre": "Bad experience so far",
          "Contenu": "At first my experience with iPostal1 was good. Mail was scanned and shredded as requested. An then all of the sudden they started canceling my scan requests with excuses that my mail can't be scanned for security reasons. Exactly the same kind of mail that was scanned by them before without any issues. I'm staying overseas for an extended period of time, and signed up with iPostal1 so I can have access to my important time sensitive mail in the USA. They now are refusing to scan it, and they would not ship this mail to my location. I'm very much not happy with the experience so far."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Vernon",
          "Nb_Reviews": 2,
          "Date": "2023-02-01T22:03:30.000Z",
          "Titre": "Customer service is nonexistent",
          "Contenu": "Customer service is nonexistent. Phone is always busy and email support takes several days to get a response. After 4 email exchanges over two weeks my account is still not able to receive mail. The store performing the actual mail service (3rd party) told me that they can't do anything and don't know how the accounts work."
        },
        {
          "Note": 2,
          "Lieu": "UA",
          "Pseudo": "Alberto Leguizamo",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T00:21:46.000Z",
          "Titre": "So far I found out that most of the…",
          "Contenu": "So far I found out that most of the time my mail isnot delivered on time,also the charges are all the timefor no reason, and extra charges for nothing.There is no control  in order to charge on timefor any mail that you think it is going to be charge.In other words, there is not cronologic way to make\\any charges,they do it by wish."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeffrey Korn",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T21:06:54.000Z",
          "Titre": "Overall very unhappy with the service…",
          "Contenu": "Overall very unhappy with the service the past year and a half.  I have had issue after issue...mail not sent when requested, charging too much for mailing, charging to consolidate and charging for additional mail in a month.  I have no control over bulk mail.  It is unfortunate that you do not run a better business via Staples."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Wayne Stallings",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T19:42:32.000Z",
          "Titre": "They need to be honest and upfront with…",
          "Contenu": "They need to be honest and upfront with the service fees. Very misleading advertising. I would not recommend this company to anyone. Just as a specific example their website indicates $2.25 for scan or shred orders. If you have a document scanned its $2.25. Its another $2.25 to have that same document shredded. That's $4.50 to read a single sensitive letter. The monthly service is advertised in BIG BOLD LETTERS $9.99 PER MONTH. I guess that's true if you never get or read your mail, but it doubles if you get/read & dispose of just 2 pieces of mail per month."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T23:00:11.000Z",
          "Titre": "I was testing out getting mail and…",
          "Contenu": "I was testing out getting mail and received a small 6\"x4\" envelope package ✉️ and was very disappointed that I got charged for local pickup.  Be sure to read the fine print, your monthly fee doesn't necessarily mean you can get delivered mail or packages there for free!  After my credit card charge I checked the ipostal website and it says \"some places may charge a nominal fee\" under local pickup.   Had I known I would be charged $2 a package, I'd probably not signed up for a year!  So now I'll just use it as a business address without the extra fees that I thought my $10 a month was covering!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "M S",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T17:13:19.000Z",
          "Titre": "Form 1582 process is a hot mess",
          "Contenu": "Form 1582 process is a hot mess.  Took over a week to get our mailbox working.  Inconsistent instructions and finger-pointing causing irritating delays in service.  Just got our first piece of mail.  Can't wait to see how bad that experience will be.UPDATE: Note the cardboard, unresponsive \"answer\" to this post.  That is the kind non-support I got. Also, no notification was sent, they kept flashing the same message as everyone gets while waiting.  Nice try."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "W. Jones",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T09:43:15.000Z",
          "Titre": "I-postal has a lot of fine print and info that comes after you pay",
          "Contenu": "I-postal has a lot of fine print. Some disclosures about how the services work are not delivered until you have paid and get the welcome letter. Many of the \"physical\" addresses are Staples Stores. No workspace available, just Staples print services. Staff quality depends on the current staff at Staples. Phone Customer Service was horrible. I gave two stars instead of one, because it is a virtual address if that's all you need and the young lady in the store was friendly. I would have changed immediately, but going through the address change involves so much and I need to secure a much better service before changing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick Smith",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T23:14:44.000Z",
          "Titre": "Tornado disabled my location in April…",
          "Contenu": "Tornado disabled my location in April of 2023. I was not notified how I would be receiving my mail. After 5 months of attempting to secure information regarding my account, I was able to reach customer service. I was informed my mail was being held by the post office and I could pick it up there. I don't understand why it took 5 months to track down my mail with no assistance from iPostal1?  With no account services available until September, a refund was not granted. I paid for 12 months service and only received mail service for 6 months with mail being held. I do not recommend this mail forwarding service. iPostal1 does not have a committed customer service ethic. This was a natural disaster that hopefully this company can use to improve their services.Update:  location was Shawnee Oklahoma 2023 at the Staples location on Kickapoo Street.  Exact Tornado date unsure but spring of 2023. I hope this helps in your investigation. Thank you!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Suz",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T22:16:11.000Z",
          "Titre": "Half the time I request my mail to be…",
          "Contenu": "Half the time I request my mail to be sent to my physical address, some mail is missing. I always have to scan and save a pdf before requesting the send just in case. But there have many several unretrievable items that have costed money and time to get copies of from the original sender."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sean Scott",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T15:21:12.000Z",
          "Titre": "I was disappointed to learn that I do…",
          "Contenu": "I was disappointed to learn that I do not get any scanned letters included. Other services will open the mail and scan the contents without an additional charge as long as it is within the total scans of the month. If I have to consistently go into staples to get my mail to see the contents than the location is not helpful and out of the way."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gina",
          "Nb_Reviews": 4,
          "Date": "2023-06-28T06:17:49.000Z",
          "Titre": "I wish I read these reviews before I…",
          "Contenu": "I wish I read these reviews before I signed up. The customer service is poor at best and trying to get my mail service set up has been an absolute nightmare. I cannot get anyone to call me back and I have been trying since February when I purchased the mail service to get it set up. I have spent hours going back and forth  trying to just get this set up so I can get my mail, SUPER FRUSTRATING and not to mention the income and business I have lost because of this experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chuck Guy",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T21:16:13.000Z",
          "Titre": "False promise",
          "Contenu": "They promise a true street address, but the real address has PO BOX on it; most companies and people do not accept it (False promise) They are only a platform and do not stand behind the product; you better rent a PO Box directly with the store that offers it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brittany Rene Bailey",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T20:08:25.000Z",
          "Titre": "The instructions were blurred.",
          "Contenu": "The instructions were blurred. I was always confused. The local post office was lot much help. Really bad experience. Want to cancel. Truely not the best solution to my mail issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Ryder",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T18:47:07.000Z",
          "Titre": "Awful website and process",
          "Contenu": "Customer service was helpful but the system and process is abysmal. Took eight days to process my form. Even after that I had to remind them to send it to the mail center. I ended up missing an important delivery.Just a terrible experience so far."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ashley Scott",
          "Nb_Reviews": 2,
          "Date": "2023-07-22T15:20:20.000Z",
          "Titre": "There's always confusion and…",
          "Contenu": "There's always confusion and uncertainty around when/whether I will received my mail or package. Prior to each visit I'd receive confirmation of a package delivered to my mailbox. Once I arrive at the location to pick it up. The associates always have trouble confirming/finding my package. It's always stressful. But I love the convenience of having this service. So I unfortunately accept this poor feature of it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul L Hollis",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T17:37:44.000Z",
          "Titre": "Not sure I picked the right service",
          "Contenu": "Signed up for Staples, sent test mail, never notified of receipt of mail I sent to test. When I spoke to your representative to change location, he never told me that the new address was double in price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Aaron Sullivan",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T16:24:42.000Z",
          "Titre": "The app seems nice enough but so far i…",
          "Contenu": "The app seems nice enough but so far i have had four packages delivered, and a week on, only one of them has registered in the app, and i called the physical carrier and pestered them about it. The whole point of getting this mailbox was so that I didn't have to babysit my mail and it'd show up automatically. Wondering why I don't just get a PO box."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bulent Ender",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T02:18:21.000Z",
          "Titre": "I had the iPostal plan for two months…",
          "Contenu": "I had the iPostal plan for two months and did not receive any mail.  I called Staples several times to find out and they would not return my calls and could never give me a straight answer. Finally I had to contact iPostal to have them communicate with Staples to get feedback and resolution.  I would prefer to deal with smaller mail box storefronts rather than Staples.  Big box stores don’t seem to put much value on customer care."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valentina Newkirk-Malomo",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T18:30:02.000Z",
          "Titre": "When I go pickup they always have…",
          "Contenu": "When I go pickup they always have trouble locating my packages. Or they leave they out in open where I grab my own package just because I know it was mine they had no idea who I was. They never can find the keys to open just not organized."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Randal South",
          "Nb_Reviews": 4,
          "Date": "2022-12-18T22:07:25.000Z",
          "Titre": "iPostal1 contractor doesn't charge the…",
          "Contenu": "iPostal1 contractor doesn't charge the rates he advertised.  Additionally he will charge to refuse packages even though I never authorized this.  There might be better contractors, but iPostal1 doesn't police the people it contracts with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lea Anne Werder",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T15:01:35.000Z",
          "Titre": "I had an important letter that I…",
          "Contenu": "I had an important letter that I requested be mailed to me. It took 8 days for it to be sent out. By the time it arrived we had left that location. Staples said they didn’t get the queue for it to be sent out until a day or two prior to mailing. So, I called Ipostal Support. Support never answers and always keeps me on hold for several minutes. The recording states they be answering soon but it inevitably it goes to voicemail. They promise to call back. It’s been over a week. I still haven’t been contacted. In the past if they do follow up its by email and it takes forever. In my experience, the mail center blames Ipostal, Ipostal blames the mail center. Nothing gets resolved."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lia",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T20:25:56.000Z",
          "Titre": "iPostal1 started charging me monthly…",
          "Contenu": "iPostal1 started charging me monthly fees even before the account was activated, pending documents approval. Hence I paid monthly fees and no mail could be sent to me but I still have to pay the fee due. Very strange business practice!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JOSHUA E KELSEY",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T05:44:18.000Z",
          "Titre": "Not that great of a service as I thought",
          "Contenu": "Received mail and requested it be forwarded to me. Which costs a couple dollars a letter, on top of monthly fee. It didn't get sent and I requested it sent again. It caught up, but the service does not seem worth it unless you live close to your mailbox. It only seems useful for junk mail. To use it for regular important mail, home address seems to be better. You should get a couple free a month imo. Post office box may be a better option"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher Morris",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T09:00:07.000Z",
          "Titre": "One time they lost my mail",
          "Contenu": "One time they lost my mail. Almost every time, I have to wait 5-15 minutes for them to find it. Once, they said it wasn't there and then another staff member went back and found it (the first person overlooked it). I use the service because I am not aware of a reasonably priced alternative."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Durham",
          "Nb_Reviews": 2,
          "Date": "2023-08-05T19:07:00.000Z",
          "Titre": "The website and app are terrible when…",
          "Contenu": "The website and app are terrible when it comes to managing the actual settings.  I was trying to add a person to my mail box and there is no link to do so.  The \"help\" merely states that you can add 4 people but no instructions on how to do it nor a link to where you can do it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Philip Gutzler",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T20:21:01.000Z",
          "Titre": "Punctuality \"Counts!\"",
          "Contenu": "As you van see, the notification punctuality, was delayed more than 24hrs. This is not professional communication. The package was opened when I wen to sign for it. The agent, stated as such, this is the way they received it. The notification, process should be quite electronic and simple. This requires improvement."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tracy Skinner",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T09:32:38.000Z",
          "Titre": "lack of communication",
          "Contenu": "The service and the location aren’t communicating. I show 1 charge on the app and the location charges something else. Each time I pick up I have a problem. I’ve only had it for 2 months the 1st time I was unable to schedule pickup on the app, so I emailed the location to pick up- showed up and they wouldn’t release my mail."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer J",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T20:17:47.000Z",
          "Titre": "Don’t recommend at all",
          "Contenu": "Don’t recommend at all, had this service for a year now, about 20-50% of my packages are lost or stolen, and about 50-80% of my mail is lost, stolen, and returned to sender. All the thin envelopes and junk mail shows up, but any envelopes that contain anything a little thick like credit cards, gift cards etc always get stolen. Anything that the size or packaging suggests that something inside is something of value, it gets stolen. Use of the tracking numbers shows successful deliveries are made, but they get mysteriously misplaced after that. If you’re thinking about signing up for this address iPostal service, just don’t. There’s no security for any of your mail, just use another service!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RR",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T08:27:41.000Z",
          "Titre": "The stores that sign up for iPostal…",
          "Contenu": "The stores that sign up for iPostal aren't usually familiar with the process. The employees scramble to look for pkgs/ mail. There is usually one person who is familiar with how iPostal works."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "T C",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T06:10:23.000Z",
          "Titre": "iPostal1 can make your life easier if they wanted…",
          "Contenu": "Ipostal1 and Staples are separate entity..opening a digital mailbox at Ipostal1 doesn’t mean you can start receiving mail at the Staples mailbox…There was a discrepancy between Ipostal1 and Staples as far as meeting the requirement for completing the Form1583..Submitted a government ID and a State Drivers License for the notarization….Kept waiting for the Form 1583 approval for almost a week, but didn’t hear back from Staples…Wrote an email but no response and after calling was told the government ID had to have a signature on it to be valid….On the ipostal1 site Photo ID just needed a photo no mentioning of signature but according to Staples, ID provided must have signature.. and nobody bothered to call us or send us an email to tell us…Also I used Notary.com provided by iPostal1 to prepare the Form 1583 and was assured by the Notary that the 2 IDs used were acceptable…I hate when they give you the runaround…"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Morris",
          "Nb_Reviews": 8,
          "Date": "2023-06-26T15:19:26.000Z",
          "Titre": "I was able to pick up my mail",
          "Contenu": "One time they lost my mail. Almost every time, I have to wait 5-15 minutes for them to find it. Once, they said it wasn't there and then another staff member went back and found it (the first person overlooked it). I use the service because I am not aware of a reasonably priced alternative."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lora",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T11:49:05.000Z",
          "Titre": "1Long address 2 can’t forward mail from…",
          "Contenu": "1Long address 2 can’t forward mail from usps 3you have to pay to scan pick on top of paying monthly 4 overall feels completely wrong"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rih",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T02:58:50.000Z",
          "Titre": "I received packages 2 days ago",
          "Contenu": "I received packages 2 days ago . Was not scanned in, if it wasn’t for the brand sending me a tracking number and emailing me to confirm if I received I wouldn’t have know that I had packages there. The scan in / picture on the app is 1 of the main reasons I chose your company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T17:44:11.000Z",
          "Titre": "No notice when package arrives",
          "Contenu": "They are supposed to send an email when a package arrives and out of the 2 packages that have come I have not been notified."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "dlf",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T05:20:43.000Z",
          "Titre": "Too long for the local Staples to…",
          "Contenu": "Too long for the local Staples to approve our documents.  Went right up to the wire on the 3 day window.  Impossible for us to get documents to them any sooner since we were out of the country when the service was set up...and then were leaving again on the 15th.  So, a package was returned to sender on the 17th (March) and mail from that same day was not scanned until the 20th...so, you tell me, should I be upset?  Of course, I am upset with the service at this point.  BTW, the notary service said we didn't need documents for the second person on the form...just the primary..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Timothy Lawson",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T16:07:23.000Z",
          "Titre": "high fees…",
          "Contenu": "The charges for the varying services that you provide are excessive and non-ending. I don't think I'll be a customer of this service for long the costs are to high."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michelle Pontrelli",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T04:25:37.000Z",
          "Titre": "Not thrilled kinda disappointed actually",
          "Contenu": "For the second time I have been charged for mail I already picked up as well as mail was supposed to be discarded and was not. Missing mail this week, lucky wasn't important."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A.E.L.",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T16:53:19.000Z",
          "Titre": "I do not like that I am charged storage…",
          "Contenu": "I do not like that I am charged storage fees on top of a recurring monthly bill. I pay for a mailbox knowing that my mail is safe until I can pick it up. The extra fees are ridiculous."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stasiu Tyburski",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T09:31:40.000Z",
          "Titre": "Package lost by iPostal1 Employee",
          "Contenu": "Package was tracked via USPS and delivered to the iPostal1 location. The employees were then unable to find the package for the next 4 days when it was finally discovered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dean Pomper",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T17:43:36.000Z",
          "Titre": "Your screening process for ID verification is too picky.",
          "Contenu": "Your screening process for ID verification is too picky. I sent ID's and they were too blurry even though on my end they were perfect. I sent the second set of ID's and that wasn't good enough. I sent the post office form, and you didn't like that either, so I had to send it again. We almost quit your service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Louise",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T00:13:37.000Z",
          "Titre": "I’m surprised I have to pay a monthly…",
          "Contenu": "I’m surprised I have to pay a monthly subscription AND the first scanned items are so expensive.  I feel tricked"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KCN",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T03:28:28.000Z",
          "Titre": "Virtual mailbox bills for each item you…",
          "Contenu": "Virtual mailbox bills for each item you receive. Operation hours suck because they don’t open early or stay open late.l, which is a conflict for working folks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bradley  Collett",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T21:34:13.000Z",
          "Titre": "Very poor instructions on how too set…",
          "Contenu": "Very poor instructions on how too set up the account. I think it is very poor and that they need to improve there customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sintia Morales",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T13:44:48.000Z",
          "Titre": "Limited communication.",
          "Contenu": "Communication is limited between customer and the client. There should be a voice mail to retrieve messages from."
        },
        {
          "Note": 2,
          "Lieu": "PA",
          "Pseudo": "M. Brown",
          "Nb_Reviews": 4,
          "Date": "2023-05-13T10:09:26.000Z",
          "Titre": "Not all locations have trained employees",
          "Contenu": "1. In the setup of our service with iPostal1, we took our signed and notarized Form 1583 and our IDs to the store where the employee took it and spent time on his computer, then returned and said we were all set up.Later that day we logged into the iPostal1 app only to find we were not set up, that we had not submitted the required  documents. During an online chat with iPostal1, we were told that the store was not set up to approve our documents, that we would have to send them to iPostal1 and they would  in turn, forward them to the main Staples for approval and it would take up to 3 days. We did what they said to do and do now have an account properly set up with them.2. Two packages arrived at the Staples store where iPostal1 is in Sierra Vista, We had tracked them with USPS tracking numbers. Twenty-four hours later we had still not been notified of their arrival. We went to the store, and the employee had to look for the packages in the back where they had not even been processed. They took pictures of the packages, handed them to us, and had us sign for them.Later that day we found a $2.00 charge from iPostal1 for a \"Scheduled pickup.\" We were never informed there would be a charge, and this pickup was definitely not scheduled.We are unhappy with iPostal1 and how this was all handled. They are using a location and employees who are not efficient or capable of properly handling the service for iPostal1.UPDATE: As a response to iPostal1's reply... I have no issue scheduling a pickup. I have a big issue when waiting over 24 hours for the packages to show in my account so I can schedule the pickup. I am still waiting for another package to be entered into the system  Timeliness is everything, especially when a customer has paid for Overnight,  Priority, or Express packages."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TW",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T23:39:27.000Z",
          "Titre": "Poor customer service",
          "Contenu": "Poor customer service, extremely delayed response times to emails, difficult and invasive to set the account up, limited locations to choose from in our mid sized city, mom and pop shop where mine was located didn’t notify me of mail pieces received, and I could go on and on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher R Baker",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T01:22:35.000Z",
          "Titre": "They overcharge for their services",
          "Contenu": "They overcharge for their services.  Also, I’m supposed to be getting mail there under my name.  It’s not coming through"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tiffany E Stine",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T16:34:52.000Z",
          "Titre": "I have done everything right, nothing is being received",
          "Contenu": "I have done everything right, asked for help and got reassurances, but still have not received ANY mail. I'm trying very hard to be patient, but it's frustrating to bring up my issues, get some buttered words, and then be told \"well you didn't get any mail.\" No mail since January?? When I know people had sent me mail??EDIT: 4/7/23 They literally just sent me a message that they finally got ONE piece of mail. lets see if it makes it to me now.EDIT: 4/19/23 I have not gotten the one piece of mail I was notified of and no new mail has been received by them.EDIT: 6/19/23 Still have not received any new mail in my virtual box and I still have not had any mail reach my hands.EDIT: 06/29/23 got mail and PAID for it to make sure it gets to me. I have a service in place where I receive pics of what mail I am receiving that day. The request and payment was 06/26/23. Hope it makes it to me.EDIT: 07/17/23 finally got my mail last week! But I got an extra letter that originally was lost? I won't complain, but it is rather confusing since I was told it was lost. and I checked that I have received 2 more in my virtual mailbox. I believe iPostal1 tried to rectify the past issues by not charging these 2 new letters to be sent to me. I'm still wary about the consistency, but it's appreciated it. I'll update if I receive anything else.EDIT:08/21/23 RE-EDIT:8/22/23 gotten my mail twice in a row now, but I thought the UI was bugging out. Thank you for telling me what was really going on and I appreciate the explanation! So far, I have been happier with my experience and hope I to receive my mail."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Kintrak",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T17:39:50.000Z",
          "Titre": "The cost is excessively high.",
          "Contenu": "The cost is excessively high.1 letter pick up $11 package pick up $4In 2 weeks and I'm already charge $10/month and $50 for pick up charges!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brett",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T08:05:30.000Z",
          "Titre": "Mail notifications are very slow",
          "Contenu": "I only receive notifications about new mail received every few weeks.  I thought I would get notified much more often."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SEC",
          "Nb_Reviews": 9,
          "Date": "2023-03-24T09:24:22.000Z",
          "Titre": "Lack of Customer Service/Support",
          "Contenu": "I have had an account with iPostal1 for a number of years. The service started out ok and everything was fine, but the store being used for my address apparently changed hands and things are not so smooth any more. The new owners are less efficient, less conscientious and the employees are not helpful. I have now had call them directly 3 or 4 times with no results.  Had a recent problem with their billing system that should have been cleared up quickly, but it took days to straighten out because the iPostal1 website was not working properly and I was told they have no IT department. The only department that answers the phone is Sales. The only real customer service and support is by 'Chat' as it is extremely difficult to get anyone from iPostal1 'customer service' main office in New York to answer the phone. Even chat usually has a long wait. All this to see one's mail? When I first considered which company to use, I called their main 800 support number and it was fairly easy to reach--good service. Now, iPostal1 only has support from 9am to 5pm EST on weekdays. Many of the customers live internationally so this is a hassle if there is a problem. It seems that the company has gone downhill service-wise in the last year. I read a review that said iPostal1 had great service 24/7! I can only assume the reviewer was confused. Ipostal1 has no 24/7 service service options. Even 'Chat' is only available 9am to 5pm EST on weekdays. I really do not want to have to change my address, but I am now quite nervous about my mail being handled by this company. They do not monitor the stores carefully enough and they do not seem to understand that US mail is very important to customers. A letter scan that I requested 5 days ago still has not been done. For the amount customers pay iPostal1, the service should be much better and their stores should be more efficient. This company will tell you they care about the customers, but they do not act like it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T01:51:54.000Z",
          "Titre": "Unexpected fees",
          "Contenu": "Fees for mail storage even if you pick up your mail, unless you log in and mark it as picked up every single time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JOSHUA BLEUSTAR",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T17:39:23.000Z",
          "Titre": "I have constant issues with mail either…",
          "Contenu": "I have constant issues with mail either not being ship at times I request or mail getting lost!  Multiple issues with communication as well!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nikita Bernstein",
          "Nb_Reviews": 2,
          "Date": "2023-05-26T20:19:16.000Z",
          "Titre": "We tested the service and decided against it",
          "Contenu": "We tested the service.  The UI/UX is poor.  The service clings to every penny citing policy, even it is clear that service was not used."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Antonio Williams",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T21:42:50.000Z",
          "Titre": "I’ve had a bad experience overall with…",
          "Contenu": "I’ve had a bad experience overall with you guys. I’ve received my mail opened by you guys. Very unacceptable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T02:52:36.000Z",
          "Titre": "I feel like they hid the fact that…",
          "Contenu": "I feel like they hid the fact that scanning mail costs extra. I was under the impression that it was included"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anthony Bawn",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T18:07:04.000Z",
          "Titre": "The system does not update often and…",
          "Contenu": "The system does not update often and the knowledge of mail being delivered is notified to be via the united postal service but I don't get a notification of delivery in the mailbox."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AUser",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T07:28:04.000Z",
          "Titre": "Slow to process and notify of your…",
          "Contenu": "Slow to process and notify of your deliveries, unreasonable costs to pick up.  I've elected to go to a competitor."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "L Raspo",
          "Nb_Reviews": 32,
          "Date": "2023-01-30T13:36:22.000Z",
          "Titre": "Unsatisfactory",
          "Contenu": "The iPostal1 location I use originally charged to forward mail, but picking up mail was free. Then they started charging my card for me picking up my mail (after I paid for the membership). I found some charges on my credit card, and then they admitted their policy had changed, although they never notified me to see if I was happy to continue with the new charges.They also require me to schedule a time that I want to pick up, but when I arrive they never have anything ready. So I schedule, then stand around for 10 minutes waiting for them to locate my mail.Once I scheduled, then arrived to collect my mail. I was there for almost half an hour while they looked all over for a missing package. Finally they asked me to come back later to collect it, so they had additional time to locate it. I got in the car and left and they called me 5 minutes later to tell me they finally found it. So I had to drive back and find parking to get it. I’m now paying a friend to receive my mail and cancelling with iPostal1.***Nice that they responded here, but no follow up as promised. Went in to collect my last mail from the physical location and had to stand there wait while the girl was sitting on the computer instead of preparing my scheduled pickup. Goodbye iPostal1."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe p",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T21:43:10.000Z",
          "Titre": "It costs $3 just to pick up mail",
          "Contenu": "I like all the services and features. I don't like that it costs $3 each time I pick up mail."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Todd Hubbard",
          "Nb_Reviews": 2,
          "Date": "2023-04-04T03:10:58.000Z",
          "Titre": "I loved this until I found out they…",
          "Contenu": "I loved this until I found out they charge you for picking up your mail"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen Ni",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T18:12:19.000Z",
          "Titre": "Terrible communication and misleading rates",
          "Contenu": "Asked about rate for shipping an item. Was given a link to refer to to. Link had no rate info and said I had to ask them directly. So, emailed again to ask for rate. Was then given a rate of $3-$4. Asked them to ship item. Was charged $12. Asked why the difference. They said the rate was higher because it was a package and not a letter. They knew it was a package. No apology. No refund. Asked about getting a rate sheet for future. Request declined. Told I had to ask them for the rate each time. Not falling for that again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ed",
          "Nb_Reviews": 4,
          "Date": "2022-12-20T22:14:19.000Z",
          "Titre": "unstable addresses",
          "Contenu": "hard to use. unstable addresses. multiple physical address changes with little notice."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Keri Lestage",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T13:58:24.000Z",
          "Titre": "Expensive",
          "Contenu": "Insane to charge $2+ every time I need a piece of mail scanned or shredded."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MARIA FORD",
          "Nb_Reviews": 5,
          "Date": "2023-09-11T05:15:07.000Z",
          "Titre": "No communication",
          "Contenu": "No communication from company when contacting you by email."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Benjamin Badon",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T15:07:12.000Z",
          "Titre": "I did not know every time I picked up…",
          "Contenu": "I did not know every time I picked up my mail I will be charged a fee."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eugene Brown",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T22:32:35.000Z",
          "Titre": "Mail not arriving for several weeks.",
          "Contenu": "I have a mailbox at the Chicago location.  I have been calling and emailing the company for days.  No phone response as agents are always busy.  No response to email. Everything worked fine for a couple of months, then suddenly no mail for 3 weeks. I have confirmed with my USPS location that mail is being forwarded.  Customer service is not good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ELIJAH B MCDANIEL JR",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T21:40:56.000Z",
          "Titre": "Been double charged for mail box for…",
          "Contenu": "Been double charged for mail box for almost 2 years.  Not good"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ron V",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T23:28:24.000Z",
          "Titre": "I am having problems…",
          "Contenu": "I can not recommend this mail forwarding address used by the iPostal1 service.  I believe the USPS is delivering some letters and packages to the wrong location resulting in lost mail.  UPS and Fedex give me delivery notifications so I know to check with the iPostal1 service and I have not had any lost packages from UPS or FedEx."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dr Mike",
          "Nb_Reviews": 3,
          "Date": "2021-06-28T17:42:42.000Z",
          "Titre": "I think the software is great but my service center is awful",
          "Contenu": "I think the software is great but my local mail service center UnionpostSF is a disaster. They’ve lost a package. Sent me mail addressed to someone else. And worst of all they don’t respond to emails. I hate to pass this on to iPostal1, because their customer service is actually good, but they should hold these shops accountable. I’m in the process of transitioning to another box shop that I hope will be better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sam Morgante",
          "Nb_Reviews": 2,
          "Date": "2021-08-12T13:46:12.000Z",
          "Titre": "Steer clear of virtual PO boxes, and ipostal.",
          "Contenu": "It wasn't made clear that an individual needed to either schedule a pickup, or mark item's as \"picked up\", this had been done by our local merchant for some time, and then stopped.  I was charged fees for things that were picked up, and not stored.  I feel like this is a poorly designed service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brandon Dondiego",
          "Nb_Reviews": 1,
          "Date": "2021-07-18T04:20:35.000Z",
          "Titre": "I must not have read the fine print",
          "Contenu": "I must not have read the fine print. I get charged for every piece of mail I pick up. I inquired about this and the response was something to the effect of, each place may or may not charge. I will be using a new service when my contract is over. Which is going to be a huge ordeal. Besides that the service is convenient."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica Gorst",
          "Nb_Reviews": 2,
          "Date": "2021-07-22T12:17:18.000Z",
          "Titre": "Not a great system.",
          "Contenu": "Not a great system.When you have new mail, you're alerted, but then you have to request to have it scanned for view which takes several days. iPostal1 does not tell you when the scan is complete, so you have to keep logging in repeatedly to manually check this until it's finally ready. Frustrating."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "JG",
          "Nb_Reviews": 1,
          "Date": "2021-02-04T17:37:32.000Z",
          "Titre": "Works but is very rough around the edges",
          "Contenu": "The basic service works as advertised but the mechanics of using the service from the user interface of the website (designed what? in 1995?) plus the quality of the scans (half pages, not always getting both sides) reduce trust in the service. The iOS apps are an unusable disaster as well. As this is a critical service for us we continue to use it and suffer through the poor user experience and customer service. Would be great to see some investment in the way it works."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "danfromPA",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T23:22:27.000Z",
          "Titre": "Be careful when domiciling business",
          "Contenu": "Be careful domiciling a business at one of their higher priced \"office building\" locations (ones that don't appear as mail drops when searched online in a street maps application): Before paying they give you the address as \"XX Street, Suite XX, Town, State, Zip\"; After paying they surprise you by requiring the use of a \"PMB\" in the address (some authorities don't allow a PMB as a domicile).  Also, their web dashboard has poor regard to good human factors design and it won't accept my perfectly valid business debit master card issued by their advertised \"perks\", \"partner\" Mercury.  On the other hand, the operations at the specific location I chose (which is a separate business not owned by iPostal1) is quick and efficient.  iPostal1 is what it is until someone does it better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JJ",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T16:16:30.000Z",
          "Titre": "Be very careful with the options you…",
          "Contenu": "Be very careful with the options you select. It is not clear to new users what options incur additional fees. The local service or iPostal1 won't refund you if you get it wrong. The website should be clearer as to when selected options incur additional fees. I'm still disappointed about this and no one seems to care at the local store or iPostal1. I've already brought it up to them directly but didn't get any response saying they would correct it."
        },
        {
          "Note": 2,
          "Lieu": "BR",
          "Pseudo": "Hiromiti",
          "Nb_Reviews": 1,
          "Date": "2019-10-28T15:45:22.000Z",
          "Titre": "Poor information on website.",
          "Contenu": "Poor information on website.I chose an address which did not charge a penny for pickup but it comes out that for packages larger than 4896cu inches there is only 5 days of free storage. After that you either have to pickup (which it is not my case as I am still in my home country) or pay $1,10 per pound for each 5 extra days in storage."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Noniion",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T18:33:08.000Z",
          "Titre": "Changing Plans Failed!!",
          "Contenu": "I chat with Anelise who changed her story about downgrading my account three times. She asked that I \"Cancel the account to get a refund.\" I'm still waiting patiently for that refund. I would not recommend this company based on her responses, good bye!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Billy",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T21:17:33.000Z",
          "Titre": "Called a few times for assistance and…",
          "Contenu": "Called a few times for assistance and they are not very helpful.  Had them consolidate and ship me a package over two weeks ago and still haven’t received it. They make it seem like I’m bothering them each time I call.  I’ll be getting a box at a   U  P  S    store soon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2018-07-13T21:00:15.000Z",
          "Titre": "lots of extra charges",
          "Contenu": "Mobile app interface is terrible. It reminds me of a 1990’s web app. I got the basic plan as a trial but there is no value bc everything is an add on service. Had I realized that I would have used a different service that had a higher monthly fee but more built in services such as mailing my letters to me. On the upside, the local operator is very nice to work with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2019-06-05T11:30:45.000Z",
          "Titre": "been trying to use their on line notary…",
          "Contenu": "been trying to use their on line notary service but neither its web site nor phone app work . customer support only available through email and they take hours to answer always trying to get you to do the same thing that doesn't work . This is a crappy notary service . now I'm out of time and will be charged for trying to use their service that doesn't work . very disappointed but I have all ready changed all my mail to here . Wouldn't recommend this service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher Carbone",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T02:16:17.000Z",
          "Titre": "This sounded great in theory",
          "Contenu": "This sounded great in theory, but it certainly is not working in practice. Every time I go to pick up my mail it takes 20-30 minutes because nobody seems to know what they are doing. My packages constantly get misplaced, fail to get checked in properly, and fail to get logged as picked up. I spend hours of my time waiting around in the store or on the phone trying to make sure I don't get charged for storage on packages I have already picked up. The staff tend to blame the problems on the computer system or fail altogether to acknowledge how unprofessional the service is. Very disappointed with this experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "dfcrow2003",
          "Nb_Reviews": 2,
          "Date": "2021-04-15T15:25:54.000Z",
          "Titre": "NYC E 23rd St Location Poor Customer Support",
          "Contenu": "I have a  NYC account at 115 E 23rd St. The NYC location sent an email out yesterday, April 14th, stating that pick up mail service would be suspended from April 16th thru April 21st. Pick up by appointment only.  I went there today, April 15th, to pick up my mail, and there is no one available to assist with mail pick up. (Fortunately, I found one of the maintenance staff who was able to assist me.) I was told that the receptionist is on vacation thru next week, so there will be no one available to assist with the mail. This is a poor way to manage a facility. Very disappointing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ashley Beard",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:40:50.000Z",
          "Titre": "I like that the subscription is cheap…but that's it",
          "Contenu": "I like that the subscription is cheap just not happy with facility charging me everytime I get a package and that was not mentioned when I got account....I found out after I had a package pick up, also other buisness that work with ipostal charge if the the size of the package is too big, thats understandable, but to charge me for every piece of mail is ridiculous. So now I have to wait to let mail build up to get at one time to be charged"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle M Stratton",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:44:17.000Z",
          "Titre": "Not user",
          "Contenu": "The forms are easy to fill out but getting the 2 forms of ID and the notary approval form and the final approval to a long time and many phone calls. My new address was not clear until the final approval. The user tutorial is not very detailed or user-friendly. There are many extra up charges like for shredding mail @ $2.25/piece which I thought were included up to 15 in my package. Forwarding  your mail is a bulk fee. Viewing and deleting is about all that is included for the 14.99 package that I chose."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ROGER L VIERRA JR",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:39:41.000Z",
          "Titre": "They are okay but nothing phenomenal",
          "Contenu": "They are okay but nothing phenomenal. The employees don't pay attention to detail. For instance, they scan mail upside down and so you have to correct it. It gets annoying when you have to do something over and over again because they don't care to take a quick second to scan in the mail correctly so that the custmers can see their mail rightside up. If this continues, it is worth going elsewhere because it is something they can fix in a split second."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ZMP",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T09:05:56.000Z",
          "Titre": "Decent but room for improvement.",
          "Contenu": "I think the service is wonderfully affordable and the features are useful. However, the interface is slow and inefficient. I think it could be updated into a more modern, intuitive, and straightforward layout. Also, I definitely despise the fact that I can’t add my roommates onto my postal box. I can only add my spouse and kids (who are nonexistent). As long as every boxholder signs an appropriate 1583 form, why does this matter? Physical mailboxes do it all the time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shelley O",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T05:56:24.000Z",
          "Titre": "Unprofessional Notary and iPostal1 rules caused delays",
          "Contenu": "I disliked that I had to wait to receive my US postal mail because I needed to update my request to receive or send international mail. In addition, the notary signed the form to give approval for international mailing and Staples needed me to make a change to the form. What did I pay the notary for? Why was it not corrected before she and I signed the form? It took too long to straighten out this matter."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ms Shadra Bruce",
          "Nb_Reviews": 9,
          "Date": "2023-11-17T04:20:25.000Z",
          "Titre": "It's quite misleading",
          "Contenu": "It's quite misleading. You're told you get a certain number of pieces of mail per month for a certain price, then the minute you need to deal with that mail, each item costs even more to shred or scan. That initial 30 pieces or whatever should be inclusive of the monthly price. I understand having an additional cost for forwarding mail, but to scan and shred? That should be made way clearer that your 10 or month is actual going to cost more like 30 or more. Very disappointed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicole Sandler",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T13:59:58.000Z",
          "Titre": "Great concept",
          "Contenu": "I got my first notification that I had mail since opening this account. Thankfully a photo was sent of the package. The guy manning the area where the ipostal mail was had no idea what he was doing.  The places where the ipostal mail is kept seemed like an afterthought. When the clerk finally opened the cabinet where the package was,  I had to point out the one on top that looked like the photo I was sent.I don't have much confidence in the Chandler AZ location.I have 3 stores because of the concept. But it needs to be executed better.Nicole Sandler"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Loraine Theresa Strattford",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T15:45:32.000Z",
          "Titre": "Question",
          "Contenu": "I had to email three times before the person that replied would answer my question. My question was simply \"how do I write my address without it looking like a postal box?\"Loraine Strattford"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:50:20.000Z",
          "Titre": "Still new to the process",
          "Contenu": "Still new to the process. First mail item did not show up.  The second mail item showed the day I arrived to check on my mail.  Ensure of the process yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laiza Ashraf",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T01:52:26.000Z",
          "Titre": "There is an opportunity for more price transparency",
          "Contenu": "There is an opportunity for more transparency around pick-up, scan and shred charges. I was not aware of this before signing up for the month-to-month payment option."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sherry L Hanna",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T00:49:09.000Z",
          "Titre": "Issues with picking up my  mail",
          "Contenu": "Well I started getting my mail but when I went to pick it up they had a lot of trouble scanning my mail as picked up after 1/2 an hour they just gave up trying and handed me my letters"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ginger Colemsn",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T17:17:41.000Z",
          "Titre": "I like that I got an email",
          "Contenu": "I like that I got an email but do not understand or like scanning charges I was never told about that extra charge. I do like I was able to go into Staples and get my mail. I am not getting Fed Ex or UPS there just important Government mail so it will be minimal mail I was able to know I got mail via the email not the App so I think the App is an issue getting information on my desk top is difficult perhaps I am not tech savvy but do like your email alarmGinger Coleman"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Krystal Nicole",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T22:04:45.000Z",
          "Titre": "Mixed Experiences",
          "Contenu": "Mixed ExperiencesSometimes getting my mail is easy, and other times it’s a hassle. Sometimes on the mailbox operators side, my account doesn’t show, even though I paid my subscription and have picked up mail before. It will say that I don’t have a mailbox and that I need to complete paperwork,  even though I’ve completed all paperwork and have picked up mail before. This makes tracking down my mail a chore, and worrisome."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Kristin Morris",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T18:00:26.000Z",
          "Titre": "Useful but EXPENSIVE",
          "Contenu": "The service is useful especially as an American living internationally but it’s quite expensive. $10/month and $2.25 to scan each piece of mail. Which is essential for me since I’m living abroad and can't be there to pick up the mail. The tab adds up very very quickly. If i want to see just 10 pieces of my mail a month it’s $30 between the baseline cost and the scan cost."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KPoint",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T05:07:50.000Z",
          "Titre": "Ipostal1 was easy to navigate",
          "Contenu": "Ipostal1 was easy to navigate. The site offers addresses based on you prefer location.  Some can be pricey.  My advice, contact the location for specific details.  When I purchase my box, I didn’t realize mail is not kept in a “Locked” secured area.  Mail is left in a unsecured slot. In addition, any packages delivered from, let’s say, Amazon, is extra charge.  I would recommend IPostal1."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dora Daniel",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T17:06:33.000Z",
          "Titre": "Extra Fees Beyond the Annual Rental Reduce the Value of This Service",
          "Contenu": "The additional fees associated with holding the mail beyond 30 days and picking it up (instead of having them destroy it) is not an attractive business practice and will discourage me from renewing.  I use the actual mailbox very little, so these fees have me changing my business mail address to my home so I don't have to pay them.  Essentially what this leaves me with is a \"premium\" address location for which I pay $299/year."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher G Horrocks",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T04:46:51.000Z",
          "Titre": "The USPS questioned your mailing…",
          "Contenu": "The USPS questioned your mailing address in Hackettstown NJ, but didn't refuse it. I had to go to Phillipsburg PO to try and make sure everything was ok, and they even sent me a confirmation, but so far only 2 items have come in in 20 days, and your folks said they can't do anything, so I'm waiting it out. The USPS is very inefficient!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "T. Ashok Shenoy",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T22:29:14.000Z",
          "Titre": "iPostal customer service is very poor",
          "Contenu": "iPostal customer service is very poor. Had a problem a few weeks ago and other than a response to \"check it out\", nothing was actually done.The problem related to forwarding of mail from the Staples center which was being returned to that Staples by USPS for mailing problems. Happened 3 times in a row resulting in delays and costs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gloria Hernandez",
          "Nb_Reviews": 2,
          "Date": "2023-08-19T21:27:30.000Z",
          "Titre": "First time picking up my one mail and…",
          "Contenu": "First time picking up my one mail and the envelope was missing. I only received the item (MD Marc train ticket) loose without the envelope.  Also, why was I charged for scanning the one mail i received when I paid for one year for incoming mail service. I shouldn't be charged an additional fee to scan every time I have mail, it should be included with my membership.  I should be reimbursed for the scanned item I was charged."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T07:43:43.000Z",
          "Titre": "Notification",
          "Contenu": "I had a package delivered at 3pm on a Thursday and by noon on Friday I still had not been notified that I had any mail.  The company that shipped the package had notified me that the package was delivered but iPostal had not.  I would have expected that by Friday morning I would have got that notification from iPostal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pidong",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T22:04:56.000Z",
          "Titre": "Variable service expectation dependent on independently run operation",
          "Contenu": "Good concept but overall service and experience with actual mail really depends on the local postal office/location you are dealing with.   Every location is run independently with different owners, offerings and prices.  It would be better if everything is more standardized.   Customer services is highly variable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy Catherine Reid",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T04:39:56.000Z",
          "Titre": "I don't like being charged for picking…",
          "Contenu": "I don't like being charged for picking up my mail. Especially when I just spent $149 for a year long service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T04:41:35.000Z",
          "Titre": "All good except for final step",
          "Contenu": "The ipostal system with alerts, features and capabilities is a 5 star.     The amount of wait time I have had the past 3 visits really diminishes the overall experience.    If there is a way to expedite the delivery of mail once at the store, that would be a significant improvement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DC",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T15:00:04.000Z",
          "Titre": "No signage for iPostal1",
          "Contenu": "No signage for iPostal1, so I went to shipping/mailing area of Staples.  Waited in line, but person at desk didn’t know about where to direct me and said that area was just for sending items out. So then waited in line at the print center/copies help desk.  Took me 15 minutes of waiting in lines to pick up one envelope."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mmm",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T11:35:00.000Z",
          "Titre": "Semi-reliable basic service, dropping in quality.",
          "Contenu": "It's a really simple service and generally it does what you expect (your mail goes into your box, it's scanned and you can say what to do with it).  We've been customers for several years and the quality of service has dropped steadily.  It can take days to a week for mail to be scanned or for requested action (like a shipment) to be actioned.  They don't bother filling in the \"sender\" anymore (which was helpful because it was in the emails).  And we regularly get other people's mail, that can take nearly a month to get rerouted to a different mailbox."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen Schneyer",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T17:06:54.000Z",
          "Titre": "It's always an ordeal to pick up my…",
          "Contenu": "It's always an ordeal to pick up my mail...sometimes the associate is not familiar with the process and they have to call over a manager, which takes time.  Also sometimes the app doesn't let me schedule a pick-up, which means I have to wait even longer at the store."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jorge Moraes",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T23:56:59.000Z",
          "Titre": "Consolidated Correspondence Sent to Wrong Address",
          "Contenu": "Misplaced correspondence, submitting consolidated mail to the wrong address and charging correspondence pick-up twice are some of the problems I’ve had with this service. I’m still in it because I don’t have another option, but I don’t recommend it to new users."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Melanye",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T01:05:12.000Z",
          "Titre": "Address not normal looking as advertised",
          "Contenu": "I did not receive a normal looking address like they promised. The customer service person could only read from his script and wasn't very helpful. My test mail to myself went through fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rich Tanksley",
          "Nb_Reviews": 5,
          "Date": "2022-12-09T00:19:20.000Z",
          "Titre": "The thing functions at a basic level",
          "Contenu": "The thing functions at a basic level. Interface feels like 1992. You can't have more than one login so if you have an account with your spouse you have to share passwords, which is technically illegal and a violation of guidelines published by the USPS."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marcy Petricig Braasch",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T17:19:57.000Z",
          "Titre": "Difficult reaching anyone for help with misplaced box",
          "Contenu": "My first and only package delivery thus far didn't go well.It was appropriately addressed, and it was delivered 5.16. Unfortunately I was never delivered and had to make queries. My first email query to support was never addressed. The Chat query resulted in a \"we didn't find it.\" Finally I called the Staples location and a kind employee found it in the wrong box on 5/31. Then I picked it up and was met with a $1 charge for pick-up."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Office Manager",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T03:12:03.000Z",
          "Titre": "letterstream was completely functional. no idea why ipostal1 wants a review.",
          "Contenu": "Dislike that the website I did business with, letterstream.com, is not in fact ipostal1.com yet here we are talking about ipostal1.  I am still waiting for search engines to evolve such that legit companies only need one domain name to survive on merit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MM",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T00:33:58.000Z",
          "Titre": "The only reason I'm giving this 3 stars…",
          "Contenu": "The only reason I'm giving this 3 stars is that I have to pay to pick up my mail/packages. Not sure I would recommend this service to someone who is just starting and doesn't have a lot of money to spend on paying for mail/package pickup."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "James Rogers",
          "Nb_Reviews": 3,
          "Date": "2022-12-13T00:24:42.000Z",
          "Titre": "Quality depends on site…",
          "Contenu": "The design of the service is generally good but the quality is very dependent on the quality of the mailbox physical site you are using. In my case the service is very bad. When I get notified of mail it is always a slew of items with dated postmarks. They only check the box once every 2 weeks or less. The postal customer service is weak. I’ve asked them for assistance several times and they often come back with something like there was a staffing problem but it’s fixed so all good. It is never fixed. It would be difficult to change to an alternate location as the US Postal Service will not forward mail from these types of sites."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dana",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T17:23:14.000Z",
          "Titre": "Irritated",
          "Contenu": "I’m a digital nomad and was happy with iPostal1 while I was traveling. Now that I have permanently settled, I cancelled my account and put in a forwarding order to my new address. Come to find out, you can’t do a forwarding order. Any mail received after you cancel is returned to sender. I’m sure this was annotated in the fine print somewhere. Just be aware of this before you sign up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathy Cozonac",
          "Nb_Reviews": 7,
          "Date": "2023-07-26T04:20:51.000Z",
          "Titre": "Hidden fees",
          "Contenu": "iPostal1 is convenient, but there are fees that weren't clear when I opened the account. If I'd known that picking up my mail would incur a charge, I wouldn't have used the service. There's a charge to open and scan mail, a charge to send the mail to another address, and even a charge (and appointment required) to show up and pick up the mail. If you pick up the mail, the charge is based on how many letters you're picking up. Seems a little ridiculous to me. Wish I'd read all the small print."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vincent F Carter",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T01:52:28.000Z",
          "Titre": "Good Company, helpfully if you call and stay on top.",
          "Contenu": "The system doesn't give you many opportunities if using an outside source for a notary.  Also, it took over two weeks before someone got back to me about what happened with my account.  I'm still not sure if everything is good or not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen W Andersen",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T14:28:39.000Z",
          "Titre": "Nice that iPostal is associated with…",
          "Contenu": "Nice that iPostal is associated with Staples. Sometimes when I go in to get my mail, they cannot find it. Other times I have picked up my mail, but then I get a notice that I will be charged for storage of the mail that I picked up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Syed Jalal Farid",
          "Nb_Reviews": 3,
          "Date": "2022-12-12T07:43:29.000Z",
          "Titre": "App very quick and nice but…",
          "Contenu": "Overall application is very quick and nice but the prices for scanning each document specially mailed documents is a little bit overpriced.This should be included in the monthly subscription. Especially if its just 2-3 pages."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Candace Castille",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T03:24:44.000Z",
          "Titre": "I am rather neutral at this point…",
          "Contenu": "I am rather neutral at this point because I have not utilized all of the benefits of the service provided.  More monthly information to consumers would be helpful.  I have not had any negative experiences. Easy set up"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tanya Smith",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T20:31:58.000Z",
          "Titre": "For some reason I am not getting any…",
          "Contenu": "For some reason I am not getting any notifications at the location I chose.  When I called Staples the employee tells me they don't see my package but I contact the vendor to do a tracking on it. They inform me that package was delivered to the address ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "oldman Wilson",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T19:14:14.000Z",
          "Titre": "iPostal1",
          "Contenu": "iPostal1, I respectfully would give 4 stars,because a letter \"shipment\" (why isn't it called \"forward\") that I requested from my box, just prior to me closing that box, and being shipped to my new iPostal1 box was lost.Your contractor, in the new city, not the old city, I give 3 stars, because the manager has the opinion, all iPostal1 problems are not her concern and without a prior online \"pick-up\" request, \"I will not give you your mail\".  Perhaps iPostal1 should remove \"prior pick-up request\" from your policy and compensate your contractors to update the customers account at each random pick-up???  Otherwise, you & your contractor are doing a great job, thanks."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Mike",
          "Nb_Reviews": 24,
          "Date": "2023-04-19T09:50:27.000Z",
          "Titre": "Started badly, but they listed to my complaint and sorted it out.",
          "Contenu": "My experience with iPostal1 started bad. A few things went wrong and initially they were not put right. But, I complained and they then helped me out. OK, was too late for me, but I really appreciate that they took my complaint seriously and took action."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph F",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T02:34:08.000Z",
          "Titre": "Did not realize the mailbox I chose…",
          "Contenu": "Did not realize the mailbox I chose would only be accessible during the office building's business hours, or that I would have to schedule pick-ups for my mail. Has been helpful for setting up a virtual small business."
        },
        {
          "Note": 3,
          "Lieu": "EC",
          "Pseudo": "James R Morgan",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T15:49:46.000Z",
          "Titre": "Your new platform has a critical flaw",
          "Contenu": "Your new platform has a critical flaw. The scan of my of my envelope was very poor. Although I would still probably recomend the service, I would caveat it with the recent poor scan. The former platform was better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JTTP",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T15:13:14.000Z",
          "Titre": "I like the app… but this location for…",
          "Contenu": "I like the app… but this location for the mail office is closed. No one is here during the hours of operation. Everything is locked and requires an access key.It’s concerning. I need my mail. Otherwise the app is fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Holly Zenner",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T19:50:10.000Z",
          "Titre": "Most everything has been great",
          "Contenu": "Most everything has been great.  Easy to use and efficient.Our only concern has been when updating our address for business purposes with USPS and others, we often find the mailbox number, listed after the suite number or in advance of the street address, gets dropped as it is outside the typical address listing structure and does not fit easily into common address verification practices and procedures."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darik Tschetter",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T01:12:57.000Z",
          "Titre": "Forms of ID",
          "Contenu": "I think overall it’s a pretty good deal. I do however have a problem with the fact that when I filled out my 1583 form. The notary was fine with the two forms of ID I provided. But Ipostal would not accept my second form of Identification. I also spoke to someone on the phone that told me my second ID form would be fine. But then I get told by Ipostal that they will not accept it as my second form of Identification. In the mean while I receive mail and it was sent back. I am still yet to find out who it was returned to so that I can contact whoever sent the mail and give them an explanation or assure them it will not happen again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pasquale Amodio",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T13:14:38.000Z",
          "Titre": "App Issue with Mail notifications",
          "Contenu": "I received my first mail but on my iPhone with the app I didn’t receive any notification. I verified it is setup properly. I did receive an email notification."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ang S",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T03:46:42.000Z",
          "Titre": "fees",
          "Contenu": "Process can be tedious to get started. There are storage fees when you don't pick up mail. The actual facility where your mail goes doesn't know much about ipostal1 process and can't help with setup of account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Devontae Vincent Bowen",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T00:24:40.000Z",
          "Titre": "They be more helpful by not leaving out…",
          "Contenu": "They be more helpful by not leaving out details giving people the run around and wasting money …however there were “some”great tech support that help get me started"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisette R",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T12:21:17.000Z",
          "Titre": "NOTHING included in your monthly membership",
          "Contenu": "I was under the impression 30 items a month were included in my monthly fee of forwarding the mail or scanning the mail etc.  EVERYTHING COST which I don't like and wasn't clearly explained.  Otherwise, it's been fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michele LeMarr",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T15:18:03.000Z",
          "Titre": "the system is difficult to get around…",
          "Contenu": "the system is difficult to get around in.  Still have not received shipment of mail from them.  hoping its not lost.  hoping to get a tracking # that should have been emailed to me when it shipped out"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fh",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T02:34:46.000Z",
          "Titre": "The company you hire to do the the…",
          "Contenu": "The company you hire to do the the notary. I can send you a half a dozen emails of them telling me I didn't pay for or didn't complete the forms when I had a receipt of payment and copies of the signed forms they still continued to insist that you wouldn't have access and I would not have a box. I sent them copies of the receipt and the signed forms and ID. Then they said well that was retail not business so you have to pay $25 again and do it on the business side. No idea what they were talking about. I didn't you got the forms and ID. I went to staple at 1248 CarMia Way Richmond Virginia. Tina the manager reviewed everything and said, it was the weekend and iPostal1 will update Monday. She was spot on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Briana",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T20:50:00.000Z",
          "Titre": "I love the idea of this service but…",
          "Contenu": "I love the idea of this service and I believe it will improve the longer I have it. The reason I ranked it low is because I keep getting notifications for mail from the previous owner. The first time I didn't realize it was not addressed to me because the scan I received was so blurry it was hard to make out the words. I went to pick up the piece of mail and they told me it was already shredded because it was the previous owner's but it was still showing up in my account. I understand them continuing to receive the previous owner's mail but I do not think I should be notified about it. I also expected the scan of the mail to be better/clear enough for me to read who it was to and from."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Michelle Lake",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T14:49:25.000Z",
          "Titre": "Just getting started",
          "Contenu": "Just getting started, so far, so good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tammi Knapp",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T02:48:50.000Z",
          "Titre": "First impression",
          "Contenu": "First,  I didn't realize there was a fee to pick up my mail.  Disappointed that was not made clear. Second, the staff was less than pleasant when I arrived.  It's going to be a long year and I most likely will not continue with iPostal1"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denise Herbert",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T03:17:45.000Z",
          "Titre": "Reasonably Priced",
          "Contenu": "The place is clean, easily accessible, and pricing for an annual mailbox in the Lehigh Valley is lower than the USPS.I wish they were open on a Saturday and the website was more user friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T06:21:58.000Z",
          "Titre": "Staples store not well organized",
          "Contenu": "Staples store not well organized; slow to process letters and alert me by email. Employees sometimes do not know the process. Others do. Mail piles up and doesn’t get sorted in timely fashion."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tanisha",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T00:22:14.000Z",
          "Titre": "Great idea. But, you have to pay for delivery and pickup",
          "Contenu": "I love the concept of having a virtual mailbox. What I don't like is I have to pay for this service, and also pay to pick up my mail or have it shipped. This really defeats the purpose of having a virtual mailbox if I have to pay for everything. Per the contract, delivery is supposed to be free."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kael Shipman",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T19:25:44.000Z",
          "Titre": "Just barely good enough...",
          "Contenu": "Just barely good enough.... It's shocking how terrible the user experience is, but it does seem to work. I've been successfully receiving mail for a while and have done some scanning and shredding and it all seems to work fine (although pretty expensive). I haven't tried any sends yet, but I'm sure it probably works fine.One thing that was *very* frustrating to discover was that the address they gave me registers as a business address, even though I signed up for a personal residential address. This became really important when I tried to get an auto loan and Chase wouldn't work with me because my \"home\" address was a Staples. Luckily PNC gave me a loan, but now I've got a home address that everyone seems to know is definitely not a home, which feels really risky."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack Burke",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T03:05:03.000Z",
          "Titre": "Unnecessary hunting",
          "Contenu": "Had to hunt to determine that mail had been forwarded. Even when I saw the charge, I couldn't see what mail had actually been forwarded. Won't know for certain until it is received."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rolando Madrid",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T02:45:40.000Z",
          "Titre": "Your sign up is confusing ( notary) and…",
          "Contenu": "Your sign up is confusing ( notary) and getting a hold of customer service is not easy and quick. Once the ordeal of signing up is completed it works really well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrea Bonner",
          "Nb_Reviews": 4,
          "Date": "2023-01-09T18:24:53.000Z",
          "Titre": "Heavy Advertising/Slow response to inquiry",
          "Contenu": "Have had the service a couple months, and received a piece of mail. Asked that the mail be forwarded. A month passes by so I reach out through customer service email, no response. I reach out again two weeks later by phone and was told there was no mail piece. I gave the mail piece number, \"then\" there was a piece of mail that had been shipped and the issue was now with USPS. Off to a rocky start, but I have my business address tied to this service.  Customer service is lacking based on this interaction, but my goodness they advertise heavy on YouTube. Shift some of those ad dollars to customer service.***Response time was within a couple hours for the lukewarm review, but DAYS for the actual service I paid for. This is an issue when reputation management over good customer service is at hand."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wanslin Pierre",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T21:29:46.000Z",
          "Titre": "item delivered but when I show up for…",
          "Contenu": "item delivered but when I show up for pick up ,I postal had no clue about my package....Also ,assistant are slow in attending when I come for pick up.....they need to be update"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sue NIX",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T14:00:38.000Z",
          "Titre": "I was told several different…",
          "Contenu": "I was told several different information.  Noone has been able to tell me the same information about what sites have agent services."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Militantmel",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T06:22:13.000Z",
          "Titre": "Only 1 of 3 pages scanned",
          "Contenu": "Asked Mail to be scanned. They only scanned 1 page. Could not open the rest. Another document had too much tape on it. Took 15 mins to open a letter that was stuck with tape!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gerry",
          "Nb_Reviews": 3,
          "Date": "2023-02-05T00:52:45.000Z",
          "Titre": "I am new to iPostal1",
          "Contenu": "I am new to iPostal1. I was thinking that some struggles I had with using the mobile app were due to the learning curve. It was not functional on my iPod and clunky and not able to complete tasks on my iPhone. I borrowed a laptop and was able to log in and accomplish everything I needed to do on that. The mobile app needs some attention."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "V. Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T12:49:41.000Z",
          "Titre": "App needs technical updates",
          "Contenu": "Their app needs a technical update. It is very behind on efficiency. The features are nice but they rarely work properly. The staff has been great so far as well"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fred Connell",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T17:27:39.000Z",
          "Titre": "The staff needs to be trained better",
          "Contenu": "The staff needs to be trained better. It seems like there is always someone new and there is only one person that can perform functions. And I'm talking about just simply picking up mail. We are low end users so, the jury is still out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Robert Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T01:07:17.000Z",
          "Titre": "Unwanted charges",
          "Contenu": "I was not told there would be more money charged for mail over a certain amount.  When some people get a hold of my address, they give my address to others and those people send me stuff I haven't asked for and I don't want.  I get charged for stuff I don't want and I have no easy way of stopping it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandy Morgan",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T14:08:55.000Z",
          "Titre": "Needs Updating",
          "Contenu": "It's not the best service but it does what it is supposed to do. The app should really be updated and more user friendly. The look of it is very old. No major issues have accurred since I started using the service in late March 2023."
        },
        {
          "Note": 3,
          "Lieu": "ID",
          "Pseudo": "RKK",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T09:43:00.000Z",
          "Titre": "Rather confusing getting the notary to…",
          "Contenu": "Rather confusing getting the notary to verify addresses, instructions from iPostal could be better.  Overall, helpful for me to have a mailbox with them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Astrobuf",
          "Nb_Reviews": 4,
          "Date": "2022-12-11T16:42:13.000Z",
          "Titre": "Inconsistent service levels",
          "Contenu": "I have 3 iPostal accounts at 2 different locations. Service at 1 is excellent, at the other, unreliable. I don't think iPostal vets their providers adequately"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Monica Selina",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T17:16:21.000Z",
          "Titre": "Don't forget to check the price each location charge",
          "Contenu": "Just remember that the price posted on the website doesn't include the additional charges that each location will charge. It adds up."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Neal Allen Hayden",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T06:27:48.000Z",
          "Titre": "Bundles",
          "Contenu": "I dislike having only the option to purchase Bundles. Would rather like the opportunity to just bank a set amount. So far, everything else I appreciate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charlene",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T00:59:14.000Z",
          "Titre": "SCAM!!!",
          "Contenu": "Problem solved! They sent me messages to apologize and reimbursed the notary fess. I appreciate that they take accountability for issues coming from them. ThanksUPDATE!!! It's SCAM!!!!THE BIGGEST SCAM OF THE CENTURY! Hidden fees!!!These guys are just after honest people money.This is a complete garbage, well organized scam. This is not a professional mailing company. They have no control over mail centers they claim as partner. I subscribed since the beginning of August and was charged for it as well as the notarize form which costs $25. waste of money and time because my account has been pending approval since August 7 till today 09/02. It stated pending approval from the mail center itself, so as long as the mail center doesn't give approval, your account stay inactive and useless. I have been calling them and messaging them multiple time but they just ignore the problem. It really upset me since they never called me after multiple attempt to find a solution. They take no responsibility over issues and they don't care about you after you pay for the fees. They never returned my calls and messages even though I called them to complain not once but 10+ time. I remember my last call on Aug 28, when I got my call transferred to at least 7 people saying \" would you please hold on, I will transfer you to someone who can help\". When I ask how to cancel and get refund for my $9.99 mail subscription + $25 notarization, I was told only the mail center fees are refundable. Meaning I will loose $25 for nothing. Waste of time an money. As of today, no-one called me or messaged me for an update. No fix at all. NOT WORTH IT!This is a scam and I hope people won't get fooled. It's a well organized scam, so don't fall for it.PS: It's easy to talk to someone on the phone when you dial 1 as a new customer. Existing customers calls get rejected and they just redirect you to email them or use the chat box where you just get automatic responses.This is the worse experience ever and it's ridiculous how they treat customers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BC",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T20:23:34.000Z",
          "Titre": "Banking institutions do not accept all…",
          "Contenu": "Banking institutions do not accept all virtual addresses. Please have something in place to let customers know they need to check with banking institutions to see if it is acceptable"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pappa Rod",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T12:44:30.000Z",
          "Titre": "Satisfied with room for improvement...",
          "Contenu": "The remote access and letter scanning service are great. There however is a lag when I have attempted to have mail forwarded to my saved destination."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gail Gilberto",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T03:00:00.000Z",
          "Titre": "Meh-Not Impressed",
          "Contenu": "I appreciate the customer support, however I feel there is little quality control in the company and it may not be the best choice for postal needs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Latonya Moore",
          "Nb_Reviews": 2,
          "Date": "2022-12-08T22:34:39.000Z",
          "Titre": "Pick up charge",
          "Contenu": "I payment monthly fee but still charged to pick up my mail and most timeIt junk but I still have to pay to pick up mail.  Make 1 fee and be done"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Triston Cole",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T12:40:10.000Z",
          "Titre": "Terrible Business Practices and Worse Customer Service",
          "Contenu": "Buyer beware! UPDATE:I was able to get ahold of the CS team on my third attempt at contacting them. Gigi and John have been very helpful. I'm still waiting on my refund but I'm satisfied with history handled the issue.END UPDATE I haven't used the service in over a year because I found another option. I just took the loss on the first year because I wasn't sure if I would still need it later or not.It came time for renewal but my card on file expired so that couldn't auto-renew, so I figured that problem would take care of itself, but no. Somehow they managed to charge my new card without my having updated any information with them.Realizing this, I logged into my portal to resolve the issue. I called the customer service number listed, only to be kicked out of the portal and greeted by one of the rudest customer facing people I have encountered. I found out this is Mr. Shipper is Del Rae Beach, and he's not even the right place for me to call. He's the service provider for the address but cannot not do anything related to the account. His demeanor on the phone suggests that he doesn't care about the customer service end of his job. He did provide me with another number to call.I logged back into my account to submit a ticket, only to be kicked of my portal a second time!I called the other number the rude service agent at Mr. Shipper gave me and never got a hold of anyone. After answering their automated questions and waiting for 5 minutes, I was told to leave a message.Based on the other reviews this experience seems to be the exception, or maybe it's the new way they're doing business. Either way, it's been a terrible experience and as of yet, I have had no success in getting recourse for what I consider a fraudulent charge and a terrible customer experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Berger",
          "Nb_Reviews": 4,
          "Date": "2023-09-08T00:30:40.000Z",
          "Titre": "i called social security to change my…",
          "Contenu": "i called social security to change my address they said they cannot reconize ipostal address, customer service rep doesnt know what hes talking about."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ekoko Ben",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T19:04:25.000Z",
          "Titre": "I can’t get a business credit card…",
          "Contenu": "I can’t get a business credit card because the address is reported as a PO Box."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tina Cann",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T15:50:16.000Z",
          "Titre": "I haven't had no experienced  yet due…",
          "Contenu": "I haven't experienced anything yet due to I haven't got no mail from the postal yet. So far so good.No worries at the moment which is a good thing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron K.",
          "Nb_Reviews": 3,
          "Date": "2023-03-19T03:46:31.000Z",
          "Titre": "iPostal1 Good and Bad",
          "Contenu": "I like iPostal1 as I was contacted by the person at my location and he indicated that my mail there at iPostal1 can be mailed directly to my home address.When I was in town to stop by my iPostal1 location, it was super hard to find the office and there was NO indication of which unit number was iPostal at the directory, the security guard there was not familiar with the name and there was no business listed as iPostal1 there at the address of my iPostal1"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John W Shade II",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T23:16:56.000Z",
          "Titre": "Local Heath Ohio facility seemed to not…",
          "Contenu": "Local Heath Ohio facility seemed to not understand the program"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Beth McQueen",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T02:44:23.000Z",
          "Titre": "Slow start",
          "Contenu": "Slow, slow start with ipostal1. No one to talk to. Once you get someone they are kind but no action. Just about to switch to another mail service. At location got everything worked out. And kind."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronda MV",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T01:41:15.000Z",
          "Titre": "I’m already paying for the service so I…",
          "Contenu": "I’m already paying for the service so I don’t understand why you charge to  pickup my mails."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MIRIAM",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T05:01:54.000Z",
          "Titre": "This service upcharges for every mail…",
          "Contenu": "This service upcharges for every mail function on top of your monthly rate. Buyer beware."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Fernando Guillermo Hagelsieb C",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T23:18:38.000Z",
          "Titre": "The process of Form 1583 approval was…",
          "Contenu": "The process of Form 1583 approval was too long..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lynn Morris",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T02:58:50.000Z",
          "Titre": "I could not figure out how to…",
          "Contenu": "I could not figure out how to consolidate mail.  I had to pay .90 for one letter to be shipped to me, which was less expensive than the $1.00 to pick it up.  Kind of not cool!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank Monier",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T23:48:11.000Z",
          "Titre": "They have hidden fees for everything…",
          "Contenu": "They have hidden fees for everything from picking up your mail to discarding your mail."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeannie Dickerson",
          "Nb_Reviews": 3,
          "Date": "2023-06-13T14:02:16.000Z",
          "Titre": "I have not had it long enough to give a…",
          "Contenu": "I have not had it long enough to give a 5 star. But I will check back later once its being used more heavily with my business traffic."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Megan",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T22:48:17.000Z",
          "Titre": "web page is unstable and logs me out…",
          "Contenu": "web page is unstable and logs me out continually and gives errors"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "vintyahoo.com",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T03:25:09.000Z",
          "Titre": "I like how I post a response",
          "Contenu": "I like how I post a response, but I wouldn't say I like charges for everything. (shredding, sending, can't keep mails in the box etc...)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "A.W.",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T21:47:06.000Z",
          "Titre": "Can't Change Your Name on The Account",
          "Contenu": "I don't like the inability to change your personal mail recipient name on the account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elinda",
          "Nb_Reviews": 6,
          "Date": "2023-06-26T17:20:43.000Z",
          "Titre": "Fees for copies when paying for box",
          "Contenu": "I don't think I should have to pay so much for the scanning of documents."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ERNEST OGBEIDE",
          "Nb_Reviews": 2,
          "Date": "2023-05-23T22:01:15.000Z",
          "Titre": "Quicker respond to complaint",
          "Contenu": "Slow to respond and almost no customer service to talk with."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "embajadora",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T19:05:03.000Z",
          "Titre": "I have had trouble with login but…",
          "Contenu": "I have had trouble with login but afterward it has been good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alvin Korvah",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T07:30:57.000Z",
          "Titre": "I can't get nobody on the phone and I…",
          "Contenu": "I cant get nobody on the phone and I have questions.I would like to know why my phone calls are not transfer to my cell phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "K Willis",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:02:50.000Z",
          "Titre": "I like the price and having the…",
          "Contenu": "I like the price and having the convenience of them notifying me of letters and packages and then storing them for me so I don't have to worry about them getting stolen from my other address."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pamela Lue-Hing",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T20:08:58.000Z",
          "Titre": "The staff is always friendly and…",
          "Contenu": "The staff is always friendly and expedient in retrieving my .  However, the office has been closed earlier than I expected a couple of times. But overall, I am satisfied."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Josean Dominguez Pedraza",
          "Nb_Reviews": 4,
          "Date": "2023-12-07T03:25:14.000Z",
          "Titre": "Everyrhing is working fairly great",
          "Contenu": "Everyrhing is working fairly great. Except when I missed one of my payments, I could not access any of my information. I understand that I was to be blamed because I missed the deadline payment; however, it would be nice to have some more access during those \"transition\" times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R.Carmouche",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T11:33:08.000Z",
          "Titre": "Well it's kind of premature to give a…",
          "Contenu": "Well it's kind of premature to give a full review being I'm very new and it hasn't been a couple of months. But so far so good I'll come back and leave a review after I have had a longer timeline on the experience thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "onespike",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T00:35:46.000Z",
          "Titre": "The app does not display well on my…",
          "Contenu": "The app does not display well on my iPad Pro the resolution is screwy and does not work the phone app works just fine"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tinyatta Hollomon",
          "Nb_Reviews": 5,
          "Date": "2023-12-06T18:52:28.000Z",
          "Titre": "The service reps are always pleasant…",
          "Contenu": "The service reps are always pleasant when picking up my mail.  I also love the notification when I receive mail.I don't like paying $1 each time I pick up mail.  Especially when I pay a fee monthly to have/utilize the space."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nova",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T19:34:44.000Z",
          "Titre": "The service is affordable",
          "Contenu": "The service is affordable. I wish they updated their app and made interface modern and user friendly. I like that every time I have a package they inform me with the picture of the package"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "K. English",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T02:59:38.000Z",
          "Titre": "Patience is a virtue",
          "Contenu": "Slight confusion of where I should go within the store. New clerk said she could not assist, but after discussion with another clerk realized that she could i fact retrieve my mail. Friendly and apologetic."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JesusIsKing",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T09:44:19.000Z",
          "Titre": "They were sooo kind and patient",
          "Contenu": "They were sooo kind and patient! God Bless them ! im soooo Thankful!!!God loves all of us not our sin he want us all to turn away from sin and our wicked ways and surrender to him and live a life pleasing to him and according to his word daily it’s not easy but the Lord will be with us through it all no matter what! Trust and lean on the Lord!!! He will never leave you or forsake you!! Believe that God sent his only son Jesus Christ to die on the cross for our sins and that God rose his on the third day the only one ever to die and rose from the grave! Sooo incredible right!Praise the Lord!!! Turn away from sin receive  God forgiveness and love and mercy that we don’t deserve!! Crucify your flesh and desires for God daily keep your eyes on Jesus it’s a narrow path but it’s possible with the Lord Jesus Christ Trust and obey him!Watch God  move and work in your life I’m telling you I’m worth it!!! i love you and Jesus love yall wayyy more!!! THIS IS NOT A COINCIDENCE!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alicia",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T15:25:26.000Z",
          "Titre": "Reliable",
          "Contenu": "Reliable, trustworthy, and simple. The process to get your virtual box is easy. You are able to access your mail anytime through the app. A little pricey to have your mail scanned, shredded or thrown out.. But, iPostal is super convenient, and if you are traveling abroad, you don't have to worry about having your mail stolen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T04:24:19.000Z",
          "Titre": "Pretty good",
          "Contenu": "The onboarding process is a little sketchy due to the unclear postal form id requests, but the service is good."
        },
        {
          "Note": 4,
          "Lieu": "DO",
          "Pseudo": "NP",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T21:09:42.000Z",
          "Titre": "Works like expected"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T05:05:21.000Z",
          "Titre": "There was a glitch in my first shipment notice.",
          "Contenu": "I am a new customer of iPostal1. My very first shipment caused me some stress. I was sent incorrect and missing information regarding my shipment. A quick phone call let me know that “the internet was down at the warehouse” I expect the problem to be solved soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Russell Junior  Bosanko",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T22:14:51.000Z",
          "Titre": "Good customer service had challenge…",
          "Contenu": "Good customer service had challenge figuring out why my computer ipostsl1 connection did no appear sync’d with my phone app ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Random old guy",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T05:21:51.000Z",
          "Titre": "Great to have a safe alternative…",
          "Contenu": "Great to have a safe alternative mailbox for $10 month. No neighbors or vagrants searching through my mailbox to steal I.D. which happened to me..not fun."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jean Harris",
          "Nb_Reviews": 2,
          "Date": "2023-07-10T03:28:03.000Z",
          "Titre": "My First Mail Was A Package",
          "Contenu": "I am pleased that the mail has been forwarded to the virtual address without any hitches. Just did not know if I was picking up a package that, I was going to be charged an additional $5.00. Did not have time to raise my concern because I do not recall being told there would be an additional fee for packages above the monthly amount I am paying."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BABS",
          "Nb_Reviews": 2,
          "Date": "2023-06-25T18:15:48.000Z",
          "Titre": "Initial setup frustrating",
          "Contenu": "Initial set up is difficult.Asking for assistance from customer service was challenging as my questions and her answers were different. Service person didn't have knowledge of set up and I eventually figured it out by myself.  Also I have 2 boxes and they somehow crossed over each other , hopefully it's fixed nowWe shall see."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T06:00:51.000Z",
          "Titre": "Great concept and products",
          "Contenu": "Great concept and products. I do wish the app was better situated when viewing on your phone some menu items overlap other words."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valerie Hightower",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T17:24:24.000Z",
          "Titre": "I haven't actually had anything…",
          "Contenu": "I haven't actually had anything received there yet, but some items should be arriving within the next few weeks, so I can tell better.  However, it's easy to log into and check to see what is there, and that is good!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corey",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T20:09:22.000Z",
          "Titre": "It was very easy to setup the account…",
          "Contenu": "It was very easy to setup the account and pay to notarize the paper within the application process. It took longer than expected to be approved for the second final approval. I’m about to set up to receive my first piece of mail, and I’ll let you know how it goes."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "afm",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T10:16:40.000Z",
          "Titre": "Everything has been working as expected…",
          "Contenu": "Everything has been working as expected or better except shipping to Japan. The error messages returned by the iPad and iPhone apps did not provide any information to help me solve the problem. Support asked to try  again, which I did from the web page. This time it failed again, but the error message told me why. I made the changes I needed and it finally went through. I would have shipped the packages days earlier if the error messages on the iPhone and iPad app were as informative as the web page.I don't remember the exact date."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vivi Love",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T04:20:53.000Z",
          "Titre": "IPostal1 is reliable",
          "Contenu": "IPostal1 is reliable, fast and thorough with its clients needs! I had no delays and it’s staff are very attentive and have great communication. On thing I don’t agree with is they charge you the customer it pick up your own mail. Which is strange when you already pay a monthly fee to maintain the mail box. Other than that everything is pretty clear And easy going."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Julie Guerrero",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T15:13:54.000Z",
          "Titre": "I really enjoy iPostal1 but their app…",
          "Contenu": "I really enjoy iPostal1 but their app could use some work. I find that I need to log on to an actual computer in order to perform requests for incoming mail. The app seems to be great for seeing what’s in my inbox.Other than that, everything is working as expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ER",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T17:27:47.000Z",
          "Titre": "While their website is extremely dated…",
          "Contenu": "While their website is extremely dated and initially put me off from using iPostal1, I went ahead since my location Postal Connections store uses them for digital mailboxes.Overall, my experience has been positive; however, the dated website is clunky at times and makes me feel like I've stepped back in time when I use it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sparker’s Soapbox",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T14:23:20.000Z",
          "Titre": "I’m thrilled",
          "Contenu": "I’m thrilled! I mailed a “test” letter to my new virtual address on Saturday and got an email Monday night that it was received. Logged in and saw an image of the envelope! The iNotarize process was a bit challenging and I had to start over a few times. I recommend using a phone, not a desktop, to take the images of and upload the documents. Once I did that, it worked great. Based on my experience so far, I’d recommend iPostal1."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S Berby",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T19:23:00.000Z",
          "Titre": "Great Service",
          "Contenu": "Was a little tricky to set up for a business since instructions are all written for personal use. But, very friendly service in the phone and in person at our location."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Gull",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T00:48:54.000Z",
          "Titre": "We just signed up…",
          "Contenu": "We just signed up for our move to Florida. First mail pickup was today. Staples was unable to locate one item. I love the convenience, but a little leary of their in-store process. Time will tell, so 4 stars for now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "San Goh Ly. Sangly",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T02:07:35.000Z",
          "Titre": "Replies are fast and helpful",
          "Contenu": "Replies are fast and helpful. The only drawback I encountered so far was the inability to scan my newspaper, but this is an issue with the service provider. As well as being unable to send to my country. My emails were delivered promptly and my letters scanned automatically. Feedback was great so far.Setting up the mailbox was fast, e-notary took around 20 minutes to connect due to it being a weekend. Got the mailbox not long after, maybe 2 days?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anna Fountain",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T20:40:47.000Z",
          "Titre": "Great so far!",
          "Contenu": "So far so good! I have not had any issues outside of the system not taking my second set of verified documents initially. I notified customer service by email and received a response the same day letting me know I could send my documents as an attachment in an email!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ANDREW",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T12:32:55.000Z",
          "Titre": "My last shipment was delayed",
          "Contenu": "My last shipment was delayed, which I paid extra for overnight and I missed my package delivery. I placed the order before 2pm but it didn’t go out until several days later, which caused me to miss the package, as we had already left for a new location hours away."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allen Messia",
          "Nb_Reviews": 7,
          "Date": "2023-07-12T23:24:42.000Z",
          "Titre": "Their Customer Service is Tops",
          "Contenu": "My experience with iPostal has not had a chance to develop. I have some experience with their customer service and I have nothing but outstanding reviews of their handling and concerns for my issues. I just need to start receiving mail in order to give an honest rating. Time will tell."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "F Parkinson",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T15:44:08.000Z",
          "Titre": "Good location.",
          "Contenu": "The gentleman at the location was as patient as ever. And he tried his endeavour best to assist me in every way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy Hayes",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T21:28:01.000Z",
          "Titre": "Ipostal is such a great concept",
          "Contenu": "Ipostal is such a great concept. I was thankful to find it. However the sign up process is a little cumbersome. Specifically adding people to your account. When you add someone they don't ask what relationship this person is to you. I had added my dependent son. However they were waiting for a form 1583 from him because they just assumed he was my husband. Please add a field that identifies either the age or relationship of the person you're adding. If I had not called in, my account would have been on hold forever while ipostal waited for forms that were not necessary"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shelby D Rainey",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T02:40:18.000Z",
          "Titre": "Little bit of a ordeal but Great.",
          "Contenu": "Little bit of a ordeal. App needs a little work for ease of use.  Service is on point! Made sure you visit the location before you make it your address."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daudi Blackwood",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T02:36:10.000Z",
          "Titre": "At first I had a package that UPS…",
          "Contenu": "At first I had a package that UPS attempted to deliver and they declined it. I believe that either later that day or the next morning they finally accepted it. The guy in front apologized for the inconvenience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katy Strattan",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T00:12:16.000Z",
          "Titre": "Great Location; Excellent Customer Service!",
          "Contenu": "Well, my businesses have not yet yielded much in terms of phone calls, but the main thing was the address, and location is a huge part of an address, these days especially!  So I appreciate knowing that if any of our customers were to show up to a physical location, that they would not only feel perfectly safe and pleased with the location, but also would be greeted and treated well by a friendly and kind person!   That is extremely important to me in our businesses, as that is the main way we thrive (on kindness towards our fellow people)!"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T15:44:34.000Z",
          "Titre": "I like the service so far",
          "Contenu": "I like the service so far.  However I did forward on one letter and I cannot find the tracking number for it.  Also looking at my bank statement I was charged $21 for the forwarding fee twice.  But overall I am happy with the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Lee Scofield",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T16:04:58.000Z",
          "Titre": "I have only signed up for the service…",
          "Contenu": "I have only signed up for the service and not actually gotten but 1 package which I will pick up personally next week. Sign up was fairly easy, except when I was requested to upload government ID and photo ID, it was not mentioned that I also needed to upload the same for my spouse who was on the account (didn't need another notarization, just ID). It was a little frustrating that it drug out the process another day."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Samuel Burnett",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T00:21:52.000Z",
          "Titre": "I am trying out the service and it…",
          "Contenu": "I am trying out the service and it seems quite useful. I am waiting to see the results of consolidation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yoko T Minor",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T19:30:15.000Z",
          "Titre": "The Service Team corresponded to my…",
          "Contenu": "The Service Team corresponded to my email with how to solve a problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Le",
          "Nb_Reviews": 2,
          "Date": "2023-02-26T02:06:59.000Z",
          "Titre": "I think when establishing a business…",
          "Contenu": "I think when establishing a business this is an incredible service. I wasn't aware of the additional fees associated with this service when I first signed up though. It was advertised at $39.99 on promo and then $59.99 out the door. I thought that would have covered all my services."
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Carlos",
          "Nb_Reviews": 4,
          "Date": "2023-05-15T16:13:53.000Z",
          "Titre": "Processes just work",
          "Contenu": "Processes just work. I am happy as setup and managing mail is really simple. I believe they could optimise simple international documentation forwarding pricing as it is a little steep right now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T17:02:00.000Z",
          "Titre": "Great down to earth people",
          "Contenu": "Great down to earth people.  I've  had to have papers notarized several times. Customer service  friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray Messa",
          "Nb_Reviews": 3,
          "Date": "2023-03-23T20:46:14.000Z",
          "Titre": "Envelope Scans",
          "Contenu": "Website is easy to use.  Envelopes with address window not always easy to see return address and name of sender.  Taking more care when scanning would greatly help this situation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd Adams",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T07:43:51.000Z",
          "Titre": "Can't really give a rating haven't received my 1st letter from my source from your company.",
          "Contenu": "Just bought the mail box having a recent letter shipped to me so I really shouldn't be giving you a 4.  The process was easy but I would like to know why you don't put the prices down for a 1 once letter seems extreme for shipping.  But you are providing a service and I will keep the mail box for now.  When I get the letter this week I will then give a 5."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-03-03T19:19:21.000Z",
          "Titre": "Package arrived as expected",
          "Contenu": "The package too quite a long time to arrive, however the package was well put together and everything arrived as expected. I did call in after a week had gone by to check on the status and the personnel at the Tulsa office were very professional and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T16:27:12.000Z",
          "Titre": "Good service, good concept, meh app",
          "Contenu": "I’ve had some challenges get my iPostal account off the ground but my mail place has been helpful. I don’t have issues with the concept or service per we—it works. The app is a little clunky still and not intuitive to my expectations. That said, still all worth it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Melanie",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T16:41:45.000Z",
          "Titre": "Change my review after quick resolution of cust service",
          "Contenu": "Fantastic service. Like having your own post office on retainer. It's especially useful to me as I spend a lot of time abroad and this way I can review any mail that comes in and ship over whatever I need. Best part is that they don't scan junk mail!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R Brown",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T14:15:33.000Z",
          "Titre": "The company offers a great service for a virtual mailbox",
          "Contenu": "The company offers a great service for a very low price. They do charge fees for many things, so care is needed. However, these are manageable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Churchill",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T17:37:09.000Z",
          "Titre": "I registered a company using an address…",
          "Contenu": "I registered a company using an address from Ipostal 1 since my state allows it and it provided privacy without having to expose my real address. It's very convenient not having to drive to a P.O. box. I can read the mail online or have it forwarded if I don't want it to be opened. I recommend for those reason if you need privacy and convenience. For my particular needs though it was a great service Ipostal1 doesn't meet my particular needs. I wasn't expecting a Private mail box number to be apart of the address line I wish that was advertised up front. The addresses might be good for registering a company but opening a bank account, establishing business credit and a credit business location can pose a problem. Fortunately for me was able to get these issues fictional by obtaining a virtual office, but using Ipostal1 initially resulted in spending more money and time to get things done right for my particular circumstances. I still use it but as mailing address for customers if they need to write or if I need to mail them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Watson",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T16:15:55.000Z",
          "Titre": "Satisfied LLC Customer",
          "Contenu": "Like the service and price options. Helpful live customer service when I called. Online notary process cumbersome but not ipostal1's fault."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat Sanders",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T01:46:01.000Z",
          "Titre": "I’ve only just started to utilize the…",
          "Contenu": "I’ve only just started to utilize the services. I’m impressed with the variety of options and resources at your fingertip. I will come back and advise of that experience in a month."
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Gregory Clark",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T17:07:06.000Z",
          "Titre": "Perfect for when you are relocating homes!",
          "Contenu": "I am moving from my current job and retiring in a new location. This is perfect way to have an address while relocating. The scan and review is a great option!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Calvin Franklin Fouche",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T01:56:54.000Z",
          "Titre": "Fast service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T16:55:01.000Z",
          "Titre": "Just using it for a newsletter",
          "Contenu": "I haven't actually gotten any mail there, but that's not the reason I got it anyway. I got the address so I could put a legitimate address on my newsletter, as required by the mailing service, without sending my home address out to all my subscribers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "stacey christianson Spiritc",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T17:21:25.000Z",
          "Titre": "Traveling mailbox",
          "Contenu": "As I travel I need important mail. I've tried other mail carries/ places to receive mail and they have failed me. Ipostal1 has always received and got my mail ready for me to pick up. Always alerts me to new mail. Kind customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harriet Richards",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T15:08:19.000Z",
          "Titre": "I have only had one small glitch since…",
          "Contenu": "I have only had one small glitch since starting with ipostal. It was solved after speaking with customer service. Otherwise I am satisfied with the experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T01:33:56.000Z",
          "Titre": "First usage of the service went well",
          "Contenu": "In my first usage of the service, and everything went smoothly. I got a timely notification of a package with nice photoscan. There was a slight delay at the Staples pickup location,  because  personnel were occupied with other matters, and the unfamiliarity of the clerk, otherwise helpful and friendly, with the procedures."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Tim Highett",
          "Nb_Reviews": 4,
          "Date": "2023-02-08T23:04:05.000Z",
          "Titre": "I was not told of the extra cost in any…",
          "Contenu": "I was not told of the extra cost in any documentation to have the mailbox Notorized.  Whilst I still would have gone ahead, this should have been mentioned along with the additional cost."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Calloway Latisha",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T17:07:07.000Z",
          "Titre": "I like the service but wasn’t aware of…",
          "Contenu": "I like the service but wasn’t aware of the extra money we had to pay my business number I had set up with the company was cut off due to low funds which I was unaware of"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory moore",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T02:50:15.000Z",
          "Titre": "Was easy fast and convenient and…",
          "Contenu": "Was easy fast and convenient and they're really assertive to what your questions are and they look into everything is going wrong so I think it's worked pretty well for me so keep up the good work and I hope to have a long time with ipostal1"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Merissa Dickens",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T21:10:00.000Z",
          "Titre": "My experience with iPostal1 was…",
          "Contenu": "My experience with iPostal1 was pleasant and simple. I love the idea of having a virtual notary on hand to complete the notary process. Plus the price is reasonable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leviathan",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T15:33:26.000Z",
          "Titre": "Good Service",
          "Contenu": "Great service, only thing keeping me from giving it 5 stars is the cost of shipping a single piece of mail which is costing me almost $6"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Joseph Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T17:46:59.000Z",
          "Titre": "I love the service but needs some work",
          "Contenu": "I love everything about the service now that I'm officially active, however the verification posses in the store with staples was very unpleasant. The workers were rude and unprofessional, they lied and refused to help me until I called corporate and the excuse was they were not trained and most people pay for the nortery process. They have never verified in the store themself I was the first to ever have it done and still after  I was verified and active I was told it wasn't done correctly and I have to provide more documents within five days or my account will be closed.Once again cooperate got involved to assist and verified the account as complete and active. I think the pickup locations should be trained more thoroughly and not provide false information and ask someone above them for help if they are not aware of something."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Courtney Newkirk",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T14:51:40.000Z",
          "Titre": "I love iPostal1",
          "Contenu": "I love iPostal1! The only thing I don’t like I having to pay to pick up my own mail, however I completely understand it so I have no complaints at all!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Seattle daughter",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T23:40:58.000Z",
          "Titre": "The charges for services are a little…",
          "Contenu": "The charges for services are a little hard to understand but I think I’ll get used to it over time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Maddox",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:53:12.000Z",
          "Titre": "Customer Service",
          "Contenu": "Great Customer Service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank J Poolos",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T06:48:24.000Z",
          "Titre": "Local customer service was excellent",
          "Contenu": "Local customer service was excellent, and corporate chat service was great, but our setting up our business account was hung up for several weeks. Still, we are excited with the service so far!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wyatt Willoughby",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T16:25:48.000Z",
          "Titre": "So far things have been fine",
          "Contenu": "So far things have been fine, but honestly I have not yet really put anything to the test as I set up my account a bit in advance of actually needing it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "james Watkins",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T21:23:36.000Z",
          "Titre": "i had concerns because i had not…",
          "Contenu": "i had concerns because i had not received mail so i called and without a 1583 i could not retrieve mail thanks for informing me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Earnette Ray-stephens",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T04:21:56.000Z",
          "Titre": "I've only been with ipostal a few weeks…",
          "Contenu": "I've only been with ipostal a few weeks but so far they seem to get the job done. I have orders coming in I will see how they add up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T20:33:41.000Z",
          "Titre": "Only frustration",
          "Contenu": "It was frustrating completing for postal form, but once I got past it it was okay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lincoln R Ayle",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T15:27:31.000Z",
          "Titre": "I'm still trying to figure out the…",
          "Contenu": "I'm still trying to figure out the in/outs of how this system works.  I do not get a lot of mail, as my company is just beginning."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vernon",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T04:43:38.000Z",
          "Titre": "Very organized",
          "Contenu": "Even though I just started with this outfit it is well planned and you can always get support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph M Scott",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T23:45:21.000Z",
          "Titre": "It seems like only a few Staples…",
          "Contenu": "It seems like only a few Staples employees understand the iPostal1 system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deb",
          "Nb_Reviews": 4,
          "Date": "2023-06-06T01:11:24.000Z",
          "Titre": "First mail pick up",
          "Contenu": "This location is close to my house for a Virtual Post Office Box.  I picked up my mail today for the first time.  Pleasant staff, I didn't have to stand in line very long."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Priya Muddepal",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T13:30:40.000Z",
          "Titre": "It works very well for basic survives",
          "Contenu": "Basic services are great. You have to pay extra if you need anything more than basic services"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sylvia Gomez",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T23:29:25.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good, a bit of complications with initial set up, but seems after that, things have been good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christal Noble",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T15:29:30.000Z",
          "Titre": "Paige3lementEntertainment",
          "Contenu": "My mail came straight to my phone and I was able to view and set up a time to pick up my items or discard accordingly. This was so easy and convenient and in a time manner!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Murray Whistler",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T10:01:06.000Z",
          "Titre": "Faster check in on arrival.",
          "Contenu": "Things would be better if things were checked in the same day they arrive, instead of up to 72 hours later."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Felder Charbonnet",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T16:39:35.000Z",
          "Titre": "Great service on iPostal part",
          "Contenu": "Great service on iPostal part. Slacking on STORE #0197 Staples part with not having enough employees on hand to shorten the 20-30 minute wait to get my mail."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T21:46:42.000Z",
          "Titre": "So far it's good",
          "Contenu": "So far it's good, I don't get a lot of mail but I am notified when new mail arrives and can view it in my email."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T20:13:22.000Z",
          "Titre": "Convenient and easy to navigate…",
          "Contenu": "Convenient and easy to navigate website. The only thing I don't like is paying an addtl $6 per package pickup."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AJ",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T21:18:36.000Z",
          "Titre": "I received and requested the mailing to…my residence",
          "Contenu": "I received and requested the mailing to me of my first document received there. The process went smoothly and happened timely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SXM",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T18:47:26.000Z",
          "Titre": "Notary",
          "Contenu": "Trying tp up load ones own copy of the Notary near impossible.  Had to use the one web site and pay for the service."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2023-02-26T20:36:57.000Z",
          "Titre": "The iPostal1 website performs flawlessly! Be patient with setting it up.",
          "Contenu": "The iPostal1 website performs flawlessly and intuitively and is easy to use. Their customer service via e-mail and chat function is responsive, knowledgeable, and efficient problem solvers.The notarization process for Forms 1583 was a straightforward process for one person and unclear on what was required to add a second person. So a set-up delay ensued.Internally, iPostal1 did not have the second person on file at my location. The Form 1583 notarization was not available for International shipping authorization, creating frustration and delay in using our virtual mailbox easily. However, customer service solved these issues quickly, and our user experience has been smooth sailing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Jones",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T07:33:34.000Z",
          "Titre": "So far so good it was easy to set up…",
          "Contenu": "So far so good it was easy to set up and use still getting used to how everything works but so far so good!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carissa Benson",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T16:43:54.000Z",
          "Titre": "It was a little difficult to get…",
          "Contenu": "It was a little difficult to get started but the customer service is great and gets back to you quick if you have an issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Curt",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T19:37:08.000Z",
          "Titre": "I like that it's relatively functional…",
          "Contenu": "I like that it's relatively functional and other than the start up process everything seems to be operating well enough."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra Elke Serafica",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T18:19:33.000Z",
          "Titre": "Pick up",
          "Contenu": "Very helpful as this was my first time using ipostal.  I had an package with a tracker on,it was delivered, I went in to pickup wo going through the steps. Team member showed me how to use the app. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Mussehl Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T01:27:19.000Z",
          "Titre": "I like the service but I wish more was…",
          "Contenu": "I like the service but I wish more was included in the plan. Scanning or other services can really add up"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cynthia Watson",
          "Nb_Reviews": 9,
          "Date": "2023-02-09T20:19:17.000Z",
          "Titre": "Still New",
          "Contenu": "Still a new using and changing over all accounts to this new address but as far as I can tell, all is well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "STEPHEN COOK",
          "Nb_Reviews": 6,
          "Date": "2023-04-05T02:40:44.000Z",
          "Titre": "the office is small but yet you feel…",
          "Contenu": "the office is small but yet you feel like very personalized serviceStephen M Cook"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathaniel Townsend",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T01:02:47.000Z",
          "Titre": "It can be done from your own home and…",
          "Contenu": "It can be done from your own home and the responses to any question were answered quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T02:23:44.000Z",
          "Titre": "I just started using the service but…",
          "Contenu": "I just started using the service but have use it in the past and and I was very pleased."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Snakedoctor",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T13:44:26.000Z",
          "Titre": "I would have given iPostal1 5 stars…",
          "Contenu": "I would have given iPostal1 5 stars except that when I wanted a piece of mail forwarded they canceled the transaction as a duplicate and now the mail is gone, other than that it has performed well for the purpose initially intended."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric John Hildeman",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T16:33:59.000Z",
          "Titre": "Good",
          "Contenu": "Good, convenient service. More convenient than a PO box."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Manning",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T14:45:53.000Z",
          "Titre": "New Customer",
          "Contenu": "Having a virtual address/mail box has been very useful with my new business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas M Hodge",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T22:59:49.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. Wish scanning was part of the pricing like traveling mailbox."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tonya Yvette Wilson-Gilbert",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T21:12:32.000Z",
          "Titre": "I gave this rating due to be being very…",
          "Contenu": "I gave this rating due to be being very prompt with letting me know that I have mail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manuel Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:36:46.000Z",
          "Titre": "Easy to setup",
          "Contenu": "Needed a business address for my new online business. I didn’t want to use my home address. I found iPostal online and read their reviews. I felt confident using them. I set up everything online, submitted docs and was up and running in 24hrs. Been using for 4 months now and and no complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gizmo",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T17:38:28.000Z",
          "Titre": "Excellent customer service!!!!",
          "Contenu": "Excellent customer service!!!!Everyone I have spoken with have been very supportive, helpful & professional. There have been a few things I didn’t understand & they took the extra time to help me. I think there is a learning curve but it’s worth it. The mistake I made was my fault. Now I understand after they took the time to help me. It was refreshing to talk with a company that didn’t make me feel incompetent because I didn’t understand. I will continue to use this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vera Dixon",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T16:57:24.000Z",
          "Titre": "iPostal1 is awesome",
          "Contenu": "iPostal1 is awesome, my experience thus far is great.Thank you for the service that they provide. It ake it so much easier when you dont have an actual office."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T C",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T13:11:48.000Z",
          "Titre": "So far smooth sailing",
          "Contenu": "So far smooth sailing. Has some initial paperwork to deal with but once that was approved and notarized it's been very easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie Meadows",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:47:46.000Z",
          "Titre": "Ipostal1Better than a standard PO Box",
          "Contenu": "I changed to Ipostal1 because it was more affordable for my needs than a USPS PO box.  Ipostal1 Morrow, Ga. location has been a good fit with great customer service.  A one stop shop for me."
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Nicolas Dawidziuk",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:50:13.000Z",
          "Titre": "An essential part of our business",
          "Contenu": "We started a business living outside the United States and iPostal1 was (and still is) essential to be able to handle all of our correspondence."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kal G",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:42:13.000Z",
          "Titre": "I love the staff at my mailbox…",
          "Contenu": "I love the staff at my mailbox location.  They are friendly and patient, and have helped me track down several packages."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joy",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:17:43.000Z",
          "Titre": "This has been an excellent experience…",
          "Contenu": "This has been an excellent experience and great value. Our postal center on Wilshire Blvd is very efficient and reliable, and the staff are always so friendly and kind. Highly recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Neefus",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T18:23:10.000Z",
          "Titre": "My first notification",
          "Contenu": "My first notification came from a pension organization. They were verifying my change of address. I knew this without seeing the documents. I had them shredded at no cost. It toome 15 seconds and that was it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lou Lou Bev",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T19:44:12.000Z",
          "Titre": "Highly Recommended + Great Customer Support",
          "Contenu": "Honestly the few people I spoke to originally were very helpful but Jessica helped me through the real root of the problem and stuck with me throughout all of my questions, etc. She solved my issue with patience and all of her knowledge / expertise.  I am very impressed and grateful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherry Khan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:16:51.000Z",
          "Titre": "Very transparent, reasonable and easy to reach.",
          "Contenu": "The company is transparent; I know upfront my actual monthly charges, and conditions of virtual mailbox rentals. The fees are reasonable, and the initial background check is detailed. It's easy to get through to someone on the phone, and the staff is knowledgeable, cordial and friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mygiann",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:47:34.000Z",
          "Titre": "Professional, courteous and efficient",
          "Contenu": "The representative I talked to on the phone did an amazing job! He went above & beyond & definitely exceeded my expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaye-Loni Johnston",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:49:31.000Z",
          "Titre": "Great for Business Owners",
          "Contenu": "The service does everything it has advertised. I get mail and faxes on time and they even send reminders if you don't check that you picked something up to ensure it doesn't accidentally get thrown away. I also like not having all my business mail showing up at my house."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T17:05:45.000Z",
          "Titre": "iPostal is like having a virtual assistant…",
          "Contenu": "iPostal is like having a virtual assistant. No need to waste a trip going to your P.O. box to see what is in there - they scan it, send you an email and then you can decide the next step. This is genius."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter Simmons",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:10:57.000Z",
          "Titre": "Very easy set up",
          "Contenu": "What made my experience with iPostal so good, was that it was so convenient and easy to sign on"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Baraliyah",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:32:19.000Z",
          "Titre": "The experience I am having is…great",
          "Contenu": "Thank you the experience I am having is great so far no issues"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimi McBurney",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T13:23:31.000Z",
          "Titre": "Great service",
          "Contenu": "Great service! Very helpful for all of my business and personal needs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Soumya Haldar",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:38:24.000Z",
          "Titre": "Wonderful service",
          "Contenu": "Wonderful service.  It's making our lives so much easier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CDP",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T11:14:48.000Z",
          "Titre": "Just Do It.",
          "Contenu": "Small businesses who need a physical address I can’t recommend iPostal1 enough.  Their services are top notch and make it easy to find/set up your address.  And you can’t beat the price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim B",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:02:57.000Z",
          "Titre": "Incomparable service",
          "Contenu": "My experience with the office staff, Matt and Jeff, is exceptional. They are the ones that have made this such a great service. Postal1 wouldn't be what it is without the Framingham Shipping Company. Of course, the app and the chat agents are extra helpful. I'm actually impressed by how quickly they resolve all of my issues online. Conclusion: 10 out of 10 for all. Note: The app keeps popping the reminder to download the app. Can you have that fixed?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T03:47:07.000Z",
          "Titre": "First Time Customer super happy",
          "Contenu": "I've been super happy with my experience so far. I moved overseas and this was my first virtual mailbox experience. I was skeptical given I had never used a service like this, but I have had no issues with opening mail and even forwarding a credit card to Mexico. I am pleased thus far with the service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andre Forde",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T04:31:10.000Z",
          "Titre": "Receiving my mail without any hassle…",
          "Contenu": "Receiving my mail without any hassle and I postal working with me to give a extension so I can get my mail to pay my account on time. Very professional and understanding company thar shows compassion when times are hard or situations arise. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EARL KATIGBAK",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T01:58:52.000Z",
          "Titre": "Travel with peace of mind",
          "Contenu": "I’m currently in another country and I regularly travel for business. The iPostal1 service takes the hassle out of mail for me! I haven’t received much junk mail and important letters can be scanned & shredded, so I can get my snail mail in my email! Thanks iPostal1!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Seltin",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T18:46:57.000Z",
          "Titre": "iPostal1 for business addresses",
          "Contenu": "I have not had the chance to use iPostal1 much yet... I am in the process of setting up and establishing businesses. In the future my accounts will be used more extensively. I appreciate your services. Thank you very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Avrohom Gluck (Allen)",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T09:44:36.000Z",
          "Titre": "I'm new with iPostal1",
          "Contenu": "I'm new with iPostal1 and find the service and software all very good. I'm looking forward to seeing how this company evolves to become great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T16:33:05.000Z",
          "Titre": "Efficient",
          "Contenu": "My mail is sent to me in a timely efficient manner. The manager, Jasmine has been so patient to answer my questions and help me navigate the system. I am very pleased with ipostal1 and the mail service they provide."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Garnic",
          "Nb_Reviews": 5,
          "Date": "2023-12-06T22:45:44.000Z",
          "Titre": "Very satisfied",
          "Contenu": "After being with two other PMB providers over the last five years, a few months ago, I switched to iPostal1.  I have been very satisfied so far and think it is an excellent value for the money.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaQueria Rollins",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T21:19:05.000Z",
          "Titre": "I been using ipostal1 for a few months…",
          "Contenu": "I been using ipostal1 for a few months now and even went on to pick up mail.  The customer service is always great and they answer the phones and handle any issues professionally."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:18:06.000Z",
          "Titre": "Great place",
          "Contenu": "Everyone at the pickup location is friendly and eager to help you. Monthly payments are easy. It's just quick and convenient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brent Dyson",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:26:05.000Z",
          "Titre": "She was very pleasant and outstanding",
          "Contenu": "She was very pleasant and outstanding. Good customer service she told me she would call me back in 2hours and she called back in 1 hour. She over exceeded my expectations. She set the standards in my opinion for what good experience looks and feels like. Thank you Vicki"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:33:46.000Z",
          "Titre": "Performing as expected.",
          "Contenu": "iPostal1 is performing as I hoped it would.  No issues.  It just works!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T01:45:48.000Z",
          "Titre": "A+++ service",
          "Contenu": "I just finished getting everything setup with my new PO Box, but the ease and pricing were A+++ and the fact I can receive mail from all avenues as opposed to a PO Box thru the postal service is a beautiful thing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marco Escalante",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:13:12.000Z",
          "Titre": "very happy and grateful with the service",
          "Contenu": "In this my first experience I must say that it has been the best decision I have made and the staff is very efficient and friendly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ERNESTO ANTONIO SOLANO PARRA",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:40:21.000Z",
          "Titre": "I am a foreigner and this company has…",
          "Contenu": "I am a foreigner and this company has made my life easier in the United States of America, giving proper handling to the correspondence and sending it to any place where it is requested and much more that I still have to explore."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin L Frank",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:52:36.000Z",
          "Titre": "Simply stated, straightforward.",
          "Contenu": "Simply stated, they do what they  say they will.  The process of signing up  is straightforward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terrill White",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T04:28:27.000Z",
          "Titre": "The great response and fixtures to all…",
          "Contenu": "The great response and fixtures to all the uncertainty that I had to make my experience successful even when it was my mishap the support team was there to guide me in the moment of situations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pattie Rechtman",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:57:29.000Z",
          "Titre": "Thank you",
          "Contenu": "Thank you, the scanning option is a lifesaver. The people at the facility are very kind and helpful."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Kyle Bailey",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T01:42:08.000Z",
          "Titre": "Great way to view mail while traveling",
          "Contenu": "While it is a bit expensive (charges for every action as well as monthly fees,) it is great for viewing mail while living abroad."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Lehman",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:10:52.000Z",
          "Titre": "everything working as expected and…",
          "Contenu": "everything working as expected and thanks for the great customer experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexa G.",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T05:03:07.000Z",
          "Titre": "Great experience",
          "Contenu": "So far very good experience. First of all I don’t have to worry about my business mail anymore. Whenever I’m relocating no need to change the business address and make sure that I didn’t lose any mail. Besides that I don’t have to spend my time for sorting my mail from hundreds spam mail with different random advertisement. Super convenient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ayoola Ladapo",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:01:43.000Z",
          "Titre": "Great Job guys. Keep it up!",
          "Contenu": "Notifying very promptly of my mails and handling my phone calls professionally."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Milner",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:35:27.000Z",
          "Titre": "Use this!!",
          "Contenu": "I'm always promptly notified when I get mail and it's always neat"
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Pablo Damian Davis Zaines",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T17:45:14.000Z",
          "Titre": "Works great",
          "Contenu": "Works great, Perhaps a little inexperienced when shipping overseas."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christian P.",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:05:24.000Z",
          "Titre": "The guys in my office are great!",
          "Contenu": "The guys in my PostNet office (Paul & Luke) are great! They're on point and very helpful. They go out of their way for you in Lee's Summit, MO. and should be commended for it!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Aimen Hami",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T18:03:07.000Z",
          "Titre": "it worked great for me i tried it in…",
          "Contenu": "it worked great for me i tried it in Montreal and i received a picture of my mail still gonna try to pick it up from there but everything worked perfectly until now and as i expected i love it"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Susan Fluellon Read",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T19:01:25.000Z",
          "Titre": "The fact that iPostal will do deposits…",
          "Contenu": "The fact that iPostal will do deposits to the bank account is an extreme asset for us"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin Micevski",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:22:16.000Z",
          "Titre": "Great Service",
          "Contenu": "I had little issues on my side,they help me solve my problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Lam",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:58:09.000Z",
          "Titre": "Easy to open account online",
          "Contenu": "Easy to open account online. Love feature to be able to see image of mail delivered to mailbox. Cheaper than UPS mail box if packages delivered is not needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janice",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T19:56:38.000Z",
          "Titre": "Easy to Use",
          "Contenu": "The instant notifications are in real time and the system makes it easy to track your mail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T01:52:32.000Z",
          "Titre": "Really really smooth process",
          "Contenu": "Really really smooth process. It’s a good business they have. I’m probably going to set up a second mailbox with them within the next month. The set up is also pretty quick. All done from home. They get you through all of the required documentation and everything went smoothly. The prices are good too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tavia Diini",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T16:32:49.000Z",
          "Titre": "Amazingly stress free, thanks iPostal !",
          "Contenu": "I have had zero stress as being a truck driver and working out of state thanks to iPostal. The process is simple and easy to get started. The prices are more than affordable and I couldn’t ask for a better service, but they could take photos of the contents inside the package instead of having me all excited and I don’t know what’s inside or the package was unexpected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spencer S Mountzouros",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T04:50:08.000Z",
          "Titre": "It’s so amazing to see your packages…",
          "Contenu": "It’s so amazing to see your packages delivered to a secure place.  Still getting ripped off by UPS mailbox facility."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley Mathews",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:55:42.000Z",
          "Titre": "Happy Customer…",
          "Contenu": "My experience with iPostal1 has been wonderful the process of receiving my mail has been seamless and stress-free"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christie K",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:56:48.000Z",
          "Titre": "I’ve been happy with IPostal1 so far…",
          "Contenu": "I’ve been happy with IPostal1 so far and it makes my life easier and affordable for my tight budget."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeannie Dickerson",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T01:53:34.000Z",
          "Titre": "Perfect Customer Service",
          "Contenu": "My husband and I walked in. There was no one ahead of us.. Actually we we're the only ones there. The gentleman behind the counter acknowledged us immediately. And he was super friendly from beginning to end. Will highly recommend to anyone that need a business box or just in general. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angeline JoVan",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T18:24:04.000Z",
          "Titre": "A little bit to start it up but can’t beat the peace of mind",
          "Contenu": "A little bit to start it up but can’t beat the price & knowledge that your mail & packages are in safe hands!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T20:15:14.000Z",
          "Titre": "Works as advertised",
          "Contenu": "Works as advertised.  Cost effective and efficient way to manage mail remotely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T19:57:10.000Z",
          "Titre": "Professional and reliable",
          "Contenu": "I know the owner personally and she and her team are very professional and reliable."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Vishal Khandhar",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:22:58.000Z",
          "Titre": "It is working as per expectation"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rad.i",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T05:50:48.000Z",
          "Titre": "This company is great for entrepreneurs…",
          "Contenu": "This company is great for entrepreneurs looking to set-up , run and manage their business from anywhere and anytime that is convenient for them. Thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margie  Jordon",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T02:43:55.000Z",
          "Titre": "great service"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Alex Jansen",
          "Nb_Reviews": 4,
          "Date": "2023-11-18T15:01:22.000Z",
          "Titre": "Works well for my mail, efficient and no problems",
          "Contenu": "Opened an account for my business mail and the first pieces of mail were processed quickly without a problem. Efficient processing and solid website to access my mail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terrance T",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T05:54:13.000Z",
          "Titre": "Awesome customer servcd",
          "Contenu": "They solved my blunder in a quick and efficient manner while still being courteous. They also clarified my understanding on how this works."
        },
        {
          "Note": 5,
          "Lieu": "PA",
          "Pseudo": "Anya Spielberg",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T23:12:33.000Z",
          "Titre": "Problems resolved quickly",
          "Contenu": "In general, I have been exceptionally satisfied. The couple times I had problems, I found their customer service very responsive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ivan Shcherbakov",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T21:48:45.000Z",
          "Titre": "Good service",
          "Contenu": "They received my mail and notified me promtly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timberline Renewable Solutions",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T18:25:09.000Z",
          "Titre": "Once you get things approved and setup",
          "Contenu": "Once you get things approved and setup, the service is amazing. Mail notifications, scan of your mail. Allows you to schedule when you want to pick it up as well as understand if it is important mail!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carrie",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T19:13:35.000Z",
          "Titre": "Took care of details quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Body By Tina",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T21:19:33.000Z",
          "Titre": "Ipostal1 made my business life easier.",
          "Contenu": "Ipostal1 has made my business life so much easier! I submitted all the required paperwork and they approved my application in less than a week! Their prices are great! I would recommend Ipostal1 to anyone looking to grow their business!"
        },
        {
          "Note": 5,
          "Lieu": "UY",
          "Pseudo": "Pablo Brera",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T05:42:31.000Z",
          "Titre": "A very useful service",
          "Contenu": "A very good service to incorporate an LLC company from abroad"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Holley",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:06:34.000Z",
          "Titre": "Easy access and friendly staff."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Ali Coplu",
          "Nb_Reviews": 6,
          "Date": "2023-12-20T21:48:02.000Z",
          "Titre": "everything is as promised"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T04:18:20.000Z",
          "Titre": "MARYANN is Awesome!",
          "Contenu": "I'm not a computer or tech savvy person but Maryann actually called me and walked me step by step through the process of adding my business mail to my account AWESOME!"
        },
        {
          "Note": 5,
          "Lieu": "MK",
          "Pseudo": "Tosho Trajanov",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T10:31:46.000Z",
          "Titre": "Improving operational efficiency",
          "Contenu": "iPostal has been managing our mail communications for a few years now and has helped improve operational efficiency in our global communications."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guy",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T21:41:34.000Z",
          "Titre": "Great Balanced Service",
          "Contenu": "Cost effective, good service, good dashboard, good people at the pickup location!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Anna Geary",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T00:40:57.000Z",
          "Titre": "It was really seamless to set up this…",
          "Contenu": "It was really seamless to set up this mailbox and I was able to handle everything online, including the notary service. That is so convenient, especially when you're doing a big move and you need a central locale for your mail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randal Dale Rodgers",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:17:34.000Z",
          "Titre": "This place is awesome great people and…",
          "Contenu": "This place is awesome great people and friendly service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Callie Reece",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T19:13:27.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Cul",
          "Nb_Reviews": 4,
          "Date": "2023-12-07T06:01:12.000Z",
          "Titre": "I love iPostal1",
          "Contenu": "I love iPostal1! I’m happy that it is performing as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arteria Austin",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:57:27.000Z",
          "Titre": "I truly respect and appreciate the…",
          "Contenu": "I truly respect and appreciate the customer service they provide. I had a situation where I made an error and they resolved the problem quick & swiftly! So I highly recommend this company for you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RICARDO PEREA",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T22:33:13.000Z",
          "Titre": "I love that they upload a picture to…",
          "Contenu": "I love that they upload a picture to your portal of the mail my fear was having to go pick up the mail every time i got a notification that we received mail. This feature makes our lives so much easier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Zaryske",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T02:10:26.000Z",
          "Titre": "very easy to use",
          "Contenu": "very easy to use, great customer service and quick responses to questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NordVPN Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T02:41:53.000Z",
          "Titre": "Received a notification just today",
          "Contenu": "A GREAT SERVICEReceived a notification just today, Sunday, about a letter I have been waiting for. I will have it tomorrow and am happy about that. The service has done everything they said they would do so far.They offer so many services that in the short time I have been using them I don't even know about them all. I love that when I get a check, like a refund check from a utility, I can ask them to mail it to my bank for deposit. For a fee, of course (save by bundling).That is a great service! It is very convenient, especially if your vacationing far away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Compton",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:04:59.000Z",
          "Titre": "Good",
          "Contenu": "Works as expected thank u"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Breus",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T22:42:11.000Z",
          "Titre": "NiqWay Tech Trove Outlet",
          "Contenu": "Great service I'm not using my Ipostal but it useful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "April Baynes",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:58:38.000Z",
          "Titre": "Great, reliable service with real people working for you!",
          "Contenu": "It's always been a great experience working with this company. I maintain multiple mailboxes and have never had a mediocre experience, always very professional and communicative. 10 out of 10, I always recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Morgan Koller",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:15:31.000Z",
          "Titre": "Great communication and fast setup"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theresa Luca Gilbert",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:19:02.000Z",
          "Titre": "Staff is always helpful",
          "Contenu": "Staff is always helpful, efficient, professional, and courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:35:14.000Z",
          "Titre": "The online process was simple and quick…",
          "Contenu": "The online process was simple and quick to complete. also, the online $25 Notary Fee is waived by a personal visit to show ID."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Coren L Day Smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T03:28:25.000Z",
          "Titre": "Great service",
          "Contenu": "Great company, easy sign up process and i enjoy being able to monitor my mail digitally."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:12:24.000Z",
          "Titre": "This company really delivers excellence",
          "Contenu": "Easy onboarding and very clear explanations on what you can expect with every detail. Support usually responds within 24 hours and usually with the issue already resolved. This company really delivers excellence."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashish Shah",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T02:23:23.000Z",
          "Titre": "Amazing experience so far",
          "Contenu": "Amazing experience so far. Much easy to work with their App. I wasn’t sure when I signed up but I am very happy using their services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "N. Trahan",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T07:24:04.000Z",
          "Titre": "iPostal1 provides exceptional customer…",
          "Contenu": "iPostal1 provides exceptional customer service!! It was a breeze to set up my account, and when I requested information concerning the location that has become my virtual office, the service team responded within 48 hours.  They promptly provide delivery updates on received mail, and honor your requests concerning the handling of delivered mail or packages. Additionally, this location offers the convenience of renting office space for client meetings. I wholeheartedly endorse iPostal1 for their comprehensive services, making them a highly recommended choice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arthur J Rountree",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T13:41:40.000Z",
          "Titre": "Pleasant staff very informative",
          "Contenu": "Pleasant staff very informative. I  am a new business owner and he made me feel comfortable with my choice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Witters",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T05:09:14.000Z",
          "Titre": "They remember the meaning of good service.",
          "Contenu": "They were right on time. As soon as a price of mail came to my box they did not hesitate to contact me Excellent service in my opinion. The way service used to be. Just excellent!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scottie lequinn Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T07:41:13.000Z",
          "Titre": "They good to inform me about my mailbox"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aferret",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T17:33:49.000Z",
          "Titre": "I've used ipostal for a short time",
          "Contenu": "I've used ipostal for a short time, but so far I like it. i wanted something for personal use and the $10 package they have is sufficient for that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CO",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T20:08:51.000Z",
          "Titre": "The staff is very knowledgeable",
          "Contenu": "The staff is very knowledgeable. And helpful. They take there time with each customer . It’s just a great place ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T17:41:13.000Z",
          "Titre": "It is only 9.99 for a box",
          "Contenu": "It is only 9.99 for a box. They send me emails when items arrive. Love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Mcmanus",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T06:28:42.000Z",
          "Titre": "Good Service at the right price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leticia Gonsette",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:03:51.000Z",
          "Titre": "First letter I received and it worked…",
          "Contenu": "First letter I received and it worked as expected. Thanks"
        }
      ]
    }
  ]
}