{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "jooki.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T18:06:31.000Z",
          "Titre": "My jooky never worked properly",
          "Contenu": "My jooky never worked properly, and now doesn’t turn on, was a very bad/sad experience. I won’t recommend anyone to buy it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gordon Child",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T19:04:46.000Z",
          "Titre": "Does not work. Should have read other reviews.",
          "Contenu": "This device is non functioning. I’m a techie software developer and I couldn’t get it working. The player does not connect to my device. When trying to connect, the options in the iPhone settings app do not match what the Jooki app is saying. The connection steps very quickly just display, “sorry, contact Customer support”. In the state that it’s in right now, there’s no way to turn it off. (Except letting the battery run dead.) There’s no reset button. What I have is a big blue paper weight. I should have read the App Store reviews before purchasing it and 2 sets of tags."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "J F",
          "Nb_Reviews": 3,
          "Date": "2023-04-28T17:22:14.000Z",
          "Titre": "Not as good as it should be. There a reason Tonies are better reviewed",
          "Contenu": "I just got a jooki 2 and the initial impression of the packaging, web site etc are very good.Then come the hurdles. 1. To set it up the first time you are obliged to have, in my case, an android phone, download their app. up to here not so strange.the strange part is where you will have to register and give some of your data to them. Without this you can't use the product at all. It gets worse. Then you need to give location permissions and only then you can configure the wifi on the product.. Yes the wifi.So after you connect with bluetooth you need to configure the Wifi. this wifi is one of your choice but typically the one from your home. this means again, that you give access to your home wifi to an unknown box that does an unknown number of things.then...you need to connect with your phone to the same wifi network where the jooki box is and only then you are allowed to interact with the product.In summary: without wifi it doesn't work. (forget about hidden Wifi, forget about VPN's you might have, forget about security in general). The USB cable is not used to connect to a PC at all. it's really just for charging and nothing else.2. The reason it get a 2 star instead of a one star is the fact that once you get it working properly, and you're able to send the MP3 files (you can also use spotify, which I didn't want) it's really easy to use and the sound quality is not so bad.3. to get to the 3 star at this point everything must be fully ok...it's not. the orange buttons only work if you rotate them fully. for this you need a certain strength and dexterity. so my 3 year old son is completely frustrated and sad because he keeps rotating the knob but never enough for it to work.4. The figurines are ok, the material is soft to the touch and are relatively easy to fit in the music slot. Overall construction looks solid although I haven't put it much to the test because as I mentioned my son is really sad that the buttons are not usable.Suggestion to jooki. Please really improve on the connection method of this product. I'm not exactly illiterate (I'm an IT engineer) and I didn't find it user friendly at all."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Roos",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T06:15:30.000Z",
          "Titre": "Jooki experience",
          "Contenu": "The jooki stops very frequently (multiple times in an hour). The lights stay white, but no music. The jooki can't be turned off when this happens and needs a hard reset. Very disappointing for my daughter. I had hoped for a better experience for my daughters birtday present.Update:The servicedesk helped me to reset the Jooki, now it seems to work the way it should. They even offered me a new Jooki if the problems continued. My daughter loves the Jooki even better now!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Josiane",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T17:54:16.000Z",
          "Titre": "Physically Difficult to choose songs",
          "Contenu": "While the Jooki is awesome and is a great concept, we are disappointed by the control buttons on it.  They are difficult to use/ to turn when choosing/skipping a song. Such an expensive item should be easy-to-use for the child who uses it, but it is even difficult for an adult to use. The button needs to be turned A LOT to skip a song and the tokens on the Jooki can get in the way.  A different system should be used to skip the songs.  Also, the extra tokens (to be purchased separately) do not have a loop on them and cannot be gathered together and tied to the Jookie. The Jookie cannot easily connect to any wifi, it has to be specifically matched to an address, which is a pain when travelling and wanting to change songs.  The volume control system only has two settings, which is also a little annoying.  Aside from that, the speaker box sounds ok and the tokens are easy to install on the Jooki.  It recharges fast enough and last for a long car ride which is handy."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Felix",
          "Nb_Reviews": 17,
          "Date": "2022-11-25T09:41:32.000Z",
          "Titre": "Amazing product, solving issues could be better",
          "Contenu": "Truly an amazing piece of technology, our children are hooked.The only downside: hardware seems less reliable for early models and there are no effective solutions in place when you run into issues.My issue was resolved in the end, assuming for now it was Murphy's law."
        },
        {
          "Note": 5,
          "Lieu": "MT",
          "Pseudo": "Dee",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T10:24:17.000Z",
          "Titre": "Love it and efficient customer care service",
          "Contenu": "My kids, 4 and 6, love it! We bought it for them a few months ago. They use it independently and have their own tokens to listen to what they're in the mood for. What's amazing is being able to connect to Spotify without their needing my phone! I strongly recommend for parents like us who don't want unnecessary screen time;)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nicole",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T21:54:57.000Z",
          "Titre": "Great Product & Customer Service",
          "Contenu": "We've had our Jooki for 2+ years and the kids still love it! We recently had an issue connecting to it, but Customer Service was a great help! And it's working again, no problem. Turns out one of the kids had accidentally put it on airplane mode, which you never would have known just by looking at it. The fix was super easy, but I never would have thought of it on my own.To anyone who has left a bad review ... have you tried contacting Customer Service directly? They are so helpful!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "MW",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T11:06:26.000Z",
          "Titre": "Great product, great service!",
          "Contenu": "I have contacted the customer service twice. Once before buying to get more information about the different offers and once because my daughter put the box into airplane mode and I had no idea what happened. They reacted in no time (even on a Sunday - guys you’re allowed to have work life balance), were very helpful and so friendly. Product itself is the greatest kids player I know of. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T05:22:58.000Z",
          "Titre": "We love it",
          "Contenu": "My kid loves the player and the response when we had to repair it was fast and easy. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JLD",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T23:44:58.000Z",
          "Titre": "Overall worth it!",
          "Contenu": "Our daughter loves the Jooki! We have had it about a year now and it’s held up well. Set up was a bit difficult, as finding the songs we wanted to buy as MP3 files was a bit tricky, and we used Amazon music but it’s a pain to download your music files. We made some tokens play MP3 playlists and some play Spotify playlists. Our daughter likes both. There are 2 knobs on the Jooki. Our daughter can use the volume knob easy enough, but does not have the wrist strength to use the skip song knob. So I would recommend the company change that. However, all that being said, our daughter still uses the Jooki to play songs and we love not having to use our phones for her music!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Noina",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T11:01:20.000Z",
          "Titre": "Customer Service is 100%",
          "Contenu": "We have had our Jooki for over 2 years and love it for its flexibility and well thought out design. We recently had an issue with wifi connectivity and Jooki responded within an afternoon to help us solve our problem.Not our first experience with them and as always, absolutely fantastic customer service! Great company 👌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily Pancake",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T19:31:33.000Z",
          "Titre": "Our kid loves this thing",
          "Contenu": "Our kid loves this thing. After about 2 years of owning it, it stopped working for like a week and Jooki customer service was quick in getting back to me via email with troubleshooting tips so I could fix it (somehow I got it into airplane mode). When I got it started again my kid's face LIT UP from across the room and she went straight for the Encanto token (I put the whole soundtrack on one token) and started playing it for the millionth time. Thanks Jooki haha."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Bailey",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T03:50:24.000Z",
          "Titre": "Excellent purchase",
          "Contenu": "We really love our Jooki! Even my 12 month old enjoys playing with it and the mechanism is forgiving enough she can get it to work. Really cool set up. Love that we can control the max volume and that the kids can move to the next song by themselves. My only tiny complaint is that we've occasionally had trouble setting it up and connecting to wifi but we've been moving a lot so regularly it wouldn't be so bothersome. Overall it's an excellent purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T17:01:50.000Z",
          "Titre": "Outstanding Service and Product Support!",
          "Contenu": "My sons Jooki was having some problems. I reached out to customer service and not only were they extremely quick and helpful, but they made me feel like they wanted the issue fixed as bad as my son did! When we couldn't get the issue resolved, they replaced the unit! To say that we were pleased would be an understatement. After receiving the new Jooki, we ordered another one for our daughter's upcoming birthday! 10/10 would recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Kollaritsch",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T16:27:12.000Z",
          "Titre": "The best!",
          "Contenu": "We’ve had our Jooki for about a year and a half and my kids love it. We’ve run into several issues mostly caused by my toddlers turning all the knobs and buttons at once or being too rough with it and the Jooki support team is always quick to respond with a solution so we can get back to our music! I know that no matter what issue I have the Jooki support team will help!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jo",
          "Nb_Reviews": 4,
          "Date": "2022-08-19T12:12:28.000Z",
          "Titre": "Excellent product combined with…",
          "Contenu": "Excellent product combined with excellent customer service. We’ve had our Jooki for around 3years now and it’s still a firm favourite option for my children to play with/enjoy. We recently had some connection issues due to a house move and new Wi-Fi, the Jooki IT support team were on hand to provide help with getting it up and running again when I could not figure it out for myself! Today it is now fixed and I’d forgotten how well loved our Jooki is! Thanks Team Jooki :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Qing",
          "Nb_Reviews": 2,
          "Date": "2022-11-15T22:37:01.000Z",
          "Titre": "Great Product - Better Service!",
          "Contenu": "We received a jooki as a gift last year, and have had to reach out to tech support twice.  Once because one of the tokens was not working, and once because our jooki went into \"factory mode\" and I was unable to pair it with the app.  In both cases, jooki's customer service responded immediately to my email request (within a day), and provided quick solutions to my issues that had us up and running again and a very happy toddler who can listen to his bedtime stories.  Love this product and so happy with their service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaime Carr",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T20:12:38.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service. Amazing product. Had a challenge connecting to WiFi. They responded quickly and helped me troubleshoot the issue and it worked perfect. My son (6yrs) LOVES his jooki"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Dagmar",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T10:40:11.000Z",
          "Titre": "Jooki is really the best choice for people who like choices",
          "Contenu": "Jooki is really the best choice for people who like to choose their own music an stories for their kids. We had a lot of CDs already and didn't want our kids to ruin them, also we want them to listen to songs, that other kids player producers definitely wouldn't have in their selection. In addition my husband speaks a different language and can record and connect stories in his language so that the kids can practice that as well. The support team is very helpful. I have had about 3 times minor problems, where I didn't know how to use the software. Everytime they responded very quickly and helpfully. The first generation jooki has the USB-port for charging in a very unpractical place, which is why we ruined two chargers already. I hope the new generation has changed that but I wouldn't know. Still, I think jooki is the best choice for parents who like choices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Dragoset",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T14:23:50.000Z",
          "Titre": "Jooki is amazing",
          "Contenu": "Jooki is amazing! I can't say enough good things about it. I have complete control over the content. The kids use it every night to fall asleep listening to stories. They also play all of their favorite music on Jooki. It's the best screen-free entertainment option out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T06:28:08.000Z",
          "Titre": "We absolutely love Jooki",
          "Contenu": "We absolutely love Jooki! My son takes it everywhere with him. It's the first toy he wants when he wakes up and the last when he goes to bed. It's wonderful to be able to hand pick the songs they listen to while giving them the independence of choosing the playlist for themselves. I love the volume control and that it is light weight as well. I highly recommend Jooki to anyone who has kids that like music!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Greta Luisa",
          "Nb_Reviews": 2,
          "Date": "2023-02-12T11:38:54.000Z",
          "Titre": "We are the biggest Fans!",
          "Contenu": "We are the biggest fan of this brand and our Jooki! After two years the Jooki wasn’t charging anymore but the company went above and beyond to send us a new Jooki, even to the UK! That’s what we call customer service! Thank you so much! Our kids loooove their Jooki and the best thing about it is that you never have to buy any additional songs, audiobooks etc! ****"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Artin Sweet",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T21:10:07.000Z",
          "Titre": "Summer vacations have arrived and with…",
          "Contenu": "Summer vacations have arrived and with them the great challenge of keeping my son away from screens for as long as possible. Jookie came at the most opportune time in our lives."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Artin Artin",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T21:07:12.000Z",
          "Titre": "Summer vacations have arrived and with…",
          "Contenu": "Summer vacations have arrived and with them the great challenge of keeping my son away from screens for as long as possible. Jookie came at the most opportune time in our lives."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Fanf Desalpes",
          "Nb_Reviews": 2,
          "Date": "2022-10-28T11:23:10.000Z",
          "Titre": "Top notch support.",
          "Contenu": "Bought the pre-version and the final version. Our kid loves it. The e-mail support is top-notch: they quickly sent us a new Jooki when ours had problems. Now the USB connector is oxidised due to our kid drooling on it. They offered to send a new Jooki again. I told them it was not necessary, sending the replacement part will be enough. The website support is... not as good, but it is not a problem when you have people answering quickly on the e-mail."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "RW",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T14:39:37.000Z",
          "Titre": "Great product, amazing quality",
          "Contenu": "We ordered a jooki for our son. We had some technical issues at first. We contacted the jooki team by email and they responded within minutes. The problem was easy to solve with their instructies. The jooki team is very kind and has a great customer service. The jooki is beautifully made, great quality and my son plays with it every single day. For him it was the perfect gift. A great product. We recommend jooki to our friends and family and we are sure no one would regret buying one."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "P. S.",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T17:44:05.000Z",
          "Titre": "A fantastic device - by far the best music box for kids out there!",
          "Contenu": "First of all: After 3 weeks my jooki arrived in Germany. Not a great shipping time at all - but I think they can do it faster.The Jooki music player is by far the best player for kids. You have unlimited options and even can customize the flat jooki tokens with your own figures (you only need a figure and some plastic super glue).I am very happy with my purchase! The only thing I am missing is that you can not really adjust the total volume of the box. You can choose a kids protection volume but you can not define the maximum dB. Furthermore some options to define a time in minutes after that the jooki box automatically shuts down would be great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie Bonnema",
          "Nb_Reviews": 1,
          "Date": "2022-05-30T14:30:50.000Z",
          "Titre": "Jooki has been amazing for our family",
          "Contenu": "Jooki has been amazing for our family, but especially for my daughter who has autism! Music is very calming to her and she loves being able to be in control of the songs and the volume!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica McMahon",
          "Nb_Reviews": 2,
          "Date": "2022-11-08T22:10:11.000Z",
          "Titre": "When we were having difficulty getting…",
          "Contenu": "When we were having difficulty getting our Jooki to work I emailed customer service and received a very quick response. Their solution was easy to understand and worked right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Stylesimpler Mom and Famil",
          "Nb_Reviews": 1,
          "Date": "2022-06-19T17:12:36.000Z",
          "Titre": "My kids love this portable audio player…",
          "Contenu": "My kids love this portable audio player and I love that I can link playlists to the different figures for each kid!  It’s so easy to use my 2 year old can do it and listen to his music in his stroller."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexis",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T20:54:05.000Z",
          "Titre": "Fabulous customer service and product!",
          "Contenu": "The Jooki team is absolutely fantastic! Recently my son’s Jooki stopped working so I contacted the Jooki team for help. They quickly provided a way to fix it but when I tried it on our Jooki it didn’t work. Then the team offered to send a replacement Jooki for my son. We just got it yesterday and he was so happy to have a Jooki that worked again that he hugged it. What wonderful customer service. We love the Jooki in our house - it’s always playing!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Robin",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T16:11:20.000Z",
          "Titre": "We where having trouble with our Jooki…",
          "Contenu": "We where having trouble with our Jooki 2, it was unable to connect to our WiFi network.I emailed support and I received the relieving answer within an hour!"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Chris Maymi",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T15:06:34.000Z",
          "Titre": "My niece loves this speaker!",
          "Contenu": "My niece loves this speaker and her parents and I love it too! It’s very easy to sync Spotify playlists or add mp3s to it. We even have a custom made playlist with family audio recordings, and this I find it to be very unique for a toy. The jooki, as advertised, really does help get her off the tv which I’m really happy about.The battery is long lasting and the figurines are tough. She throws them around from time to time due to the excitement and they don’t even get scratched on our tiled floor.The customer service is also great! One of the figurines wasn’t working for me when it arrived and they were friendly and quick to respond. They gave me the choice to have it replaced or reset the nfc chip in the figurine myself following the instructions they provided. I went for the latter and in no time I had the figurine working again.I would recommend jooki to any parent. Definitely a must have for a child."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexandra  Dastrup",
          "Nb_Reviews": 2,
          "Date": "2022-08-30T04:12:41.000Z",
          "Titre": "My daughter loves her Jooki",
          "Contenu": "My daughter loves her Jooki! It's been great for getting active inside during our hot summer days. Love that it's easy for toddlers to use and strong for when they handle it. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Sterkland Yard",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T14:51:30.000Z",
          "Titre": "I bought a Jooki for my daughter. Never regretted it!",
          "Contenu": "I bought a Jooki for my then 4-year-old-daughter about a year ago. She absolutely loves it and uses it everyday. To be completely honest, I struggled a bit with the set up at first. It took me a few minutes to get use to the mechanics of the app, but once you get it, it is actually pretty easy to set it up. And the device in itself is really accessible for young children. So easy to use! I reached out to the Jooki support team once for a small connexion issue. They were prompt to reply and really helpful. It was fixed in just a minute. I really recommend Jooki to people with small children!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T15:50:44.000Z",
          "Titre": "Love it",
          "Contenu": "Great product! Nothing quite like it on the market. Definitely the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber Valenti Armstrong",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T16:02:14.000Z",
          "Titre": "Great Customer Support",
          "Contenu": "I had a sudden technical issue with their product. They diagnosed what was going on from my brief email and responded quickly with a clear how to. Problem solved and on with my day!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Lukas Etzel",
          "Nb_Reviews": 2,
          "Date": "2023-05-20T20:48:42.000Z",
          "Titre": "Best and most friendly customer service…",
          "Contenu": "Best and most friendly customer service i've ever dealed with - the jooki-box is a fantastic product by the way:)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beckie Jackson",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T04:29:36.000Z",
          "Titre": "My daughter absolutely loved her Jooki…",
          "Contenu": "My daughter absolutely loved her Jooki player! She wants to take it everywhere! I love that it’s easy to use and fun for her to make playlists on Spotify!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T19:04:01.000Z",
          "Titre": "Jooki helped me troubleshoot a problem…",
          "Contenu": "Jooki helped me troubleshoot a problem I was having connecting the device with my new phone.  My kid loves the device and I love that they were able to solve my problem after a few emails back and forth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T03:39:43.000Z",
          "Titre": "This product is so amazing helpful and…",
          "Contenu": "This product is so amazing helpful and educational for my daughter! She loves it and listens to music and stories on it daily!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "IMC Willemstein",
          "Nb_Reviews": 10,
          "Date": "2023-02-09T13:50:04.000Z",
          "Titre": "Easy to use, my daughter loves it",
          "Contenu": "My daughter is very happy with her Jooki player. The tokens are easy to connect to her favorite playlists and the device is very easy to use. We have a disco party every night. Fantastic!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sandy mendez",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T16:57:09.000Z",
          "Titre": "I had trouble connecting to my jooki…",
          "Contenu": "I had trouble connecting to my jooki for days. I contacted costumer service and to my surprise they were very fast and responsive. They guided me on what to do and it helped. Keep up the good work :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Holly",
          "Nb_Reviews": 2,
          "Date": "2022-07-27T21:03:28.000Z",
          "Titre": "My little boy loves playing music on…",
          "Contenu": "My little boy loves playing music on his Jooki! I love that it is screen-free and promotes his independence! Such a cool toy for kids!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenna",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:39:51.000Z",
          "Titre": "Super responsible to the issue and…",
          "Contenu": "Super responsive to the issue and walking through available solutions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teri",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T00:11:56.000Z",
          "Titre": "Love the concept",
          "Contenu": "I have just received it today.  Have not given it to my kids yet for the baby.  I do have a question.  I used to love books on tape for my kids when we were traveling.  Scholastic used to sell them at all the PTA book fairs.  Short books with tapes.  Have you guys ever considered the idea? Just asking….."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Gonzalo Camarero Miguel",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T21:16:07.000Z",
          "Titre": "It's fantastic",
          "Contenu": "It's fantastic, great sound, I bought for a kid 5 years old and he enjoy it a lot.Easy yo configure and very good product."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Matthias",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T13:48:31.000Z",
          "Titre": "We really like the jooki Box",
          "Contenu": "We really like the jooki Box. The Support was very friendly, unbelivable fast and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C. Norris",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T23:10:51.000Z",
          "Titre": "I made a mistake when ordering but they…",
          "Contenu": "I made a mistake when ordering but they quickly and generously fixed the problem."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Fauve Henst",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T21:53:15.000Z",
          "Titre": "Great and fast service",
          "Contenu": "Great and fast service. I entered the wrong postal code. Problem was solved quickly and friendly. Little one also loves the new Jooki player!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T21:40:30.000Z",
          "Titre": "My daughter loved her Jooki",
          "Contenu": "My daughter loved her Jooki. Just wanted to give her more song options to play to. Keep up the great work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lunsford Tyler",
          "Nb_Reviews": 2,
          "Date": "2022-07-13T22:26:06.000Z",
          "Titre": "We are excited!",
          "Contenu": "We are excited to try this with our two boys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meegan Bohmer",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T22:06:02.000Z",
          "Titre": "Great Product!",
          "Contenu": "Works great, setup in the app was very easy, and my kids love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danielle Berry",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T14:55:14.000Z",
          "Titre": "Perfect for kids always on the go",
          "Contenu": "Perfect for kids always on the go. The ability to download and play offline is a game changer for parents."
        }
      ]
    }
  ]
}