{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "journeyofficial.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen McDonough",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:15:07.000Z",
          "Titre": "I received the wrong product and cannot…",
          "Contenu": "I received the wrong product and cannot reach anyone at Journey to discuss an exchange.  I sent 2 emails - on through the contact us page and one to the @sales email with no response.  I have been calling all morning and I am kept on hold until a message comes on saying they cannot take my call right now - please call again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jane",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T22:56:00.000Z",
          "Titre": "I’m trying to send it back .",
          "Contenu": "I’m trying to send it back .. as advertised free returns… guess not!! This product is not worth the price .. and Not worth the price of #1 the product #2 the price I will have to pay for Return!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan Erhart",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T00:00:20.000Z",
          "Titre": "Didn’t work as promised",
          "Contenu": "The product made it difficult to attach phone to charger fails more then sticks.(I have an Apple case so that wasn’t the problem) The ear pods wouldn’t charge but the watch charger did work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Wynn",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T19:56:36.000Z",
          "Titre": "Unreliable Delivery Partners",
          "Contenu": "Two deliveries never arrived. This company uses DoorDash which is notoriously unreliable for this purpose. When my product did not arrive, I pleaded with them to send the replacement through anyone other than DoorDash. They agreed. Then the replacement was sent through DoorDash and, as expected, the package never arrived. I had to demand a refund since they were incapable of delivering their products. This was a giant waste of time that accomplished nothing. This company is not reliable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heidi Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T21:36:37.000Z",
          "Titre": "My apple mouse did not work on the felt…",
          "Contenu": "My apple mouse did not work on the felt pad - either side. I did get my money reimbursed however, they never sent me instructions so I could send back the defective unit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patti Richard",
          "Nb_Reviews": 3,
          "Date": "2023-06-26T20:04:10.000Z",
          "Titre": "HORRIBLE and POOR CUSTOMER SERVICE and will NOT take back DEFECTIVE product!",
          "Contenu": "HORRIBLE. Purchased 3, 2 are defective.  Condescending remarks from Customer Service representative who thinks I am a fool. Cannot get credit or return these items. I was scammed and am sure that others too have had issues.  I should be refunded for having to deal with poor CS and defective products.  Instead I am HARASSED with emails asking to send video of what issues are happening, when I have clearly detailed events."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Walter Shumate",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T16:03:56.000Z",
          "Titre": "DO NOT ORDER FROM THIS COMPANY!!!!!",
          "Contenu": "I ordered a charger from this company.  The deciding factor for me to order from them is that it guaranteed next day delivery on my order.  Once I ordered I get a tracking number telling me the product will be delivered in a week.  When I reached out to the company, the representative told me that they do not offer next day delivery on their products.  So either the company is falsely advertising on their website or the representative is clueless.  Needless to say, once I do receive the product I will be returning it because of this fraudulent act, and I will no longer consider them for any future purchases.  I would advise you to do the same."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jkidd",
          "Nb_Reviews": 5,
          "Date": "2022-11-30T06:18:07.000Z",
          "Titre": "Hard to Return - Doesn't work well with Apple Watch",
          "Contenu": "Pain in the butt to return. Their felt charging mat doesn't charge the Apple Watch nor does it work with non-mag safe cases.Have been trying to return my mat for days now and they just keep giving me the run-around. Asking for pictures, etc."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Griffin",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T23:47:20.000Z",
          "Titre": "Never mailed; demanded refund",
          "Contenu": "Order over the weekend, was suppose to receive items the following Wednesday. Tracking information was provided on the Monday prior to the delivery. Come delivery day no UPS. Called and each time their number dropped me. Emailed and got the runaround. By end of week, I demanded a refund and noted I would file a fraud claim if not refunded. Cannot recommend this company. Went to Apple and purchased my chargers. Horrible experience. Advise caution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kate S",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T14:39:42.000Z",
          "Titre": "Negative experience",
          "Contenu": "Negative experience. Purchased a 3-in-1 charger but didn’t try it out for a few weeks and when I realized it didn’t work, it was past the 30 day return window. Customer service would not offer a courtesy extension, and instead suggested magnetic rings, which ALSO did not work. The watch charger also doesn’t fully charge the watch. Overpriced, useless product. Disappointing customer service."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "BAJ",
          "Nb_Reviews": 3,
          "Date": "2022-11-28T17:44:50.000Z",
          "Titre": "Worst customer service ever",
          "Contenu": "Worst customer service ever. I’ve place an order for iphone 14 leather case on 21st of November and paid extra for express shipping. Based on my order, the product was supposed to be delivered by 24th of November. But I’ve got no delivery. No updates about my order. Trying to contact them via an email, but no replies from there side. Really frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T16:46:04.000Z",
          "Titre": "Don't buy the light grey Wireless…",
          "Contenu": "Don't buy the light grey Wireless Charging Desk Mat, I got a pen mark on the mat and they have no real experience about how to clean it. One would expect if you deliver a light color mat, it should come with proper cleaning procedures. When I reached out to Customer Service about the issue, I received the Warranty Policy link and 10% off offer to purchase other products or a different color mat."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Pettit",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T19:30:43.000Z",
          "Titre": "I ordered and paid for two I phone…",
          "Contenu": "I ordered and paid for two I phone magnetic cases with stand and credit card holder. I received only one case. I have written and followed your return site, unfortunately a missing item is not on your list and I no longer have wrapping and post marked mailer. I have written 3 times and am being told to go to return site, this does not work for my problem. I wish you would refund me for missing case, this situation has gone on long enough."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eldin Begicevic",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T20:42:38.000Z",
          "Titre": "package was delivered to the wrong…",
          "Contenu": "package was delivered to the wrong address twice, and when i tried to contact them for the correction i did not receive the package or help"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pia Host",
          "Nb_Reviews": 5,
          "Date": "2023-03-29T22:14:44.000Z",
          "Titre": "No return label?!",
          "Contenu": "Both keyboards came, not working fully. i immediately checked how i can return them and didnt see a return label anywhere? i then emailed journey (already pretty crazy having to do that for a return label) who got back to me over a week later. i still dont have a return label at this point..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Shelton",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T21:20:40.000Z",
          "Titre": "When I received it the magnetic stand…",
          "Contenu": "When I received it the magnetic stand would not hold my I-phone. I had to do some traveling so didn't reach out right away. But when I got back, I put my apple air pods on the charging area and now that doesn't work. Things are not always perfect, I get that. But when I emailed that support team. Their response was what phone am I using, does your phone have a magnetic protector on it, and can you please send a video of the stand not working....if it has a 1 year warranty and its only 3 weeks old, it seems odd that I have to prove it doesn't work. As a new company, I would think you would just accept my issues as valid and send me a new immediately. I can send the non-working one back and issue resolved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven C",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T22:45:45.000Z",
          "Titre": "Awful return policy",
          "Contenu": "I have a Journey charger which I love. I bought another that didn’t work out because of my device upgrades and Journey makes it REALLY difficult to return something (many emails, photos of the device and the packaging it came in, etc). Just be forewarned…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Langford",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T18:14:00.000Z",
          "Titre": "wireless charging pad",
          "Contenu": "I ordered the wireless charging pad from you guys, and it has never worked.  I've troubleshot via online recommendations, and nothing works.  I'd give you no stars if the system would allow."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick Zeiler",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T15:41:15.000Z",
          "Titre": "BEWARE!!",
          "Contenu": "UPDATE - Credit Card Back Charge is In Progress - Journey Keeps Sending Emails to Review my Experience so this is the latest update. BEWARE!!They will only refund to store credit even if the $100 dollar iPhone charging dock only works for two days!! And they will deny the refund altogether if you don’t have every slip of paper and plastic that came with the box!! This is a one way scam company! Do NOT BUY ANYTHING ON THIS SITE WITHOUT BEING READY TO BACKCHARGE WITH YOUR CREDIT CARD COMPANY!This is not a fake review my order number is 742179976!!!Reply to Journey Reply - A VIDEO OF A CHARGER NOT WORKING? HOW STUPID IS THAT? THERE ARE NO MOVING PARTS! Hiding behind your scammy practices just makes you look....scammy. STAY AWAY FROM THIS COMPANY!!!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T09:34:29.000Z",
          "Titre": "The product doesn’t work",
          "Contenu": "The product doesn’t work It looks good and I was excited to received it Then when I applied the ring to my phone it didn’t work and then I realised it is not compatible to the latest I phone Now I am fighting for a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T17:04:47.000Z",
          "Titre": "ALTI Wireless Charging Desk Mat",
          "Contenu": "I was so excited for this new mouse pad. Cracked it open and it felt and looked nice. Once I put my mouse on it didn’t allow my mouse to move on my computer. Which I tried out for an extra month and maybe so wear will fix the problem. Still have the same problem. For what I paid for it’s not worth the money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Baker",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T17:12:47.000Z",
          "Titre": "No open returns - faulty design",
          "Contenu": "I was unhappy with the functionality of my purchase as it does not work as it is supposed to, and there is no option to return merchandise to them that has been opened. If the merchandise is unopened, you have 30 days to return, which is no use to me after using the product and realizing that it does not work as described."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shirah Miller",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T22:39:21.000Z",
          "Titre": "This company sent me two used Rapid Trio…",
          "Contenu": "This company sent me used Rapid Trio charging stations products.  Not just once, but twice! The first time, they were apologetic, saying they didn't know what happened at their warehouse, and ensured me I would receive a brand-new rapid Trio Charging Station.  When I received it, there was dust all over it (again), and it had scratches on it. Not to mention the packing had two different types of seals.  One seal was already broken and then they put another seal on top it to \"make it look new or unopened\".  You didn't think I was going to notice that? I called back and they said they accidentally sent me their \"test\" product. Really?  Your warehouse is that incompetent? I don't think so! I just think this is a bogus company and I want my money back!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chiquita Pounders",
          "Nb_Reviews": 3,
          "Date": "2023-05-29T23:36:27.000Z",
          "Titre": "You weren’t clear that it required…",
          "Contenu": "You weren’t clear that it required additional items to work so I’m quite displeased. Not everyone wants to stick something to the back of their phones."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glenn Morrison",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T17:01:21.000Z",
          "Titre": "The product simply does not perform",
          "Contenu": "The product simply does not perform as expected. A desk man should not slip and slide across the desk. It should hold in place consistently and allow the work surface to be stable. Also, the man is office too small, and the charging portion takes up too much space."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Isabella Stone",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T19:01:46.000Z",
          "Titre": "No connection to power outlet",
          "Contenu": "No connection to power outlet. Tried to return for credit and refused to allow return. Poor customer service and relations. Poor satisfaction for customer. Rude service people. Long hold when try to contact."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JEFF  WATSON",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T21:10:48.000Z",
          "Titre": "Not very good customer service…",
          "Contenu": "Ordered the MagSafe battery for my iPhone.  Shipping took forever. Called and they told me they would credit my credit card as a courtesy and then didn’t.  Not very honest in my humble opinion.    To many other companies out there to shop from."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tamara Lafarga",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T18:28:51.000Z",
          "Titre": "I never received my product or order ever received my product",
          "Contenu": "I never received my product or order. I communicated with you various times. Outrageous delays and finally NO delivery. Please refund my money.Tamara"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T16:52:11.000Z",
          "Titre": "No way to amend order once placed.",
          "Contenu": "I made an error in where it was shipped and immediately tried to correct the error. There is nowhere on your website to amend an order. I sent an email and it was ignored. This is not how e-commerce should work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LA",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T19:59:14.000Z",
          "Titre": "I'm trying to submit a return and no…",
          "Contenu": "I'm trying to submit a return and no one is contacting me as requested.  I'm disputing this purchase with my cc company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vicki Wellington",
          "Nb_Reviews": 3,
          "Date": "2023-07-06T02:46:53.000Z",
          "Titre": "Product did not work and it took longer…",
          "Contenu": "Product did not work and it took longer than it should have to receive info from customer service to get a refund"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Shannon Arundel",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T20:42:20.000Z",
          "Titre": "Impossible company to get a hold off",
          "Contenu": "I ordered express delivery so my item should have arrived. I have contacted the company twice asking for tracking details and delivery. Had no response at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joni Lindgren",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T18:50:25.000Z",
          "Titre": "I sent for the hand-held \"piano\" for…",
          "Contenu": "I sent for the hand-held \"piano\" for granddaughter for Christmas. I waited a LONG time for it to arrive....11/2 month at least. The worst part is it was so hard to play it for my husband and I to work it. I didn't even wrap it but I showed my granddaughter what it was supposed to operate. She couldn't either! We threw it away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allison Hanson",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T19:00:45.000Z",
          "Titre": "Not a good value. Looks really nice, but extra features are useless.",
          "Contenu": "Looks really nice on my desk. Feels nice, charges well. For the price I paid, I feel there is really nothing better about it then the $30-$45 on other online retailers. On day one, I spilled a cup of water on the non-charging side. 1/3 got soaked and it took 2 days to fully dry hanging on the felted seam on a clothes line. The water resistant vegan leather part dried in one day, and the Felt part took 2. I don't think that a desk mat should be \"water resistant\" and for the price they want, it should be water REPELLANT. Spills are common and a consumer should not have to wait a min of 1-2 days for it to line dry. Luckily it was water. I feel if its any other liquid, the product will soak it permanently. Also, I had some documents stored inside the mat which got completely soaked because of the rapidness of the Felt absorbing the spill. To charge $130 for a mat just because it looks pretty and has a charger, is ridiculous and there should be more \"life proof\" features at this price point...Like magnets around the vegan leather and felt to help seal the documents that are stowed and make all the material water repellant.In Conclusion, I was really upset about the fact that my documents were ruined, its not life proof, and soaks liquids like a towel, and you cant easily dry it and cannot use it while you wait days for it to dry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie Hight",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T21:32:21.000Z",
          "Titre": "I emailed you guys on returning this…",
          "Contenu": "I emailed you guys on returning this item, due to the fact it wasnt going to work. You have to have a magnatized phone cover. Need to return please."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Russell Netti",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T16:52:51.000Z",
          "Titre": "I ordered the white button up shirt…",
          "Contenu": "I ordered the white button up shirt with the tall parrot on it but it came yellow with one button missing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mw",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T22:26:14.000Z",
          "Titre": "Been waiting ages for a return label…",
          "Contenu": "Been waiting ages for a return label because we double ordered"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Bannan",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T18:49:59.000Z",
          "Titre": "It doesn't say in the advertisement…",
          "Contenu": "It doesn't say in the advertisement that you need to buy a USB c cable before you can use"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "a terrible experience",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T11:23:48.000Z",
          "Titre": "Terrible after sales service",
          "Contenu": "Have purchased 2 x Units (1 x Black, 1 x White). The back works well, however the White (purchased at a different time), magnetic is not as powerful and the iPhone 14 Pro fall off at the slightest touch. We have tried engaging their after sales support for two weeks, and after been requested for a video of the issue which we did, still no response. Still after many attempted follow ups, no response. Seems they don't really care about their product and take no care for their after sales Support. What a SHAME!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "bala",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T18:50:18.000Z",
          "Titre": "I bought two of them .One for my toyota…",
          "Contenu": "I bought two of them .One for my toyota avalon. Which did not fit properly. Wanted to return. You promised a return label. Two weeks, have been waiting.Not happy transaction."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T19:04:38.000Z",
          "Titre": "Won't Work For iPhone 'Standby'.",
          "Contenu": "Product was unusable for the latest iPhone feature called 'Standby'."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allen Pacheco",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T18:24:00.000Z",
          "Titre": "Wouldn’t let me do a return cause I…",
          "Contenu": "Wouldn’t let me do a return cause I didn’t have original box 📦 when the product was still brand new ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna Preston",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T20:58:07.000Z",
          "Titre": "Not worth the money",
          "Contenu": "Too expensive - the mat curls and doesn’t lay down or stay together"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cece Grillo",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T17:06:25.000Z",
          "Titre": "We cannot use this with a case on our…",
          "Contenu": "We cannot use this with a case on our phones unless we are missing something? I want to return it. Everyone has a case on their phone. Cece Grillo"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CTinDC",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T16:20:31.000Z",
          "Titre": "Great in theory",
          "Contenu": "Great in theory, but the phone doesn't stay on unless it's outside of a case"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gregory Hawkins",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T00:49:40.000Z",
          "Titre": "Too big for my IPhone 13 mini",
          "Contenu": "Too big for my IPhone 13 mini     why ask for the type of IPhone and send a product that’s too big for the phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Glass",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T13:19:01.000Z",
          "Titre": "Garbage",
          "Contenu": "Garbage.  Watch charger stopped working after 30 days .  No response from company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Palmer",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T14:46:37.000Z",
          "Titre": "When there is a problem",
          "Contenu": "When there is a problem, I prefer to deal with it on the phone, not by text or email..  to me, the company is hiding something"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BDK3",
          "Nb_Reviews": 2,
          "Date": "2023-02-11T20:27:36.000Z",
          "Titre": "Delayed Delivery",
          "Contenu": "I have yet to receive my purchase. It’s been over 10 days and for some reason it keeps getting delayed."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kai Lau",
          "Nb_Reviews": 3,
          "Date": "2022-12-21T14:26:55.000Z",
          "Titre": "Good product, S**t company policies",
          "Contenu": "Good Product, absolutely crap returns policy and customer service.I purchased two of these and wanted to return one, not an issue but Journey wanted me to provide photos of the seals being intact, while I understand why they have probably asked for this, I think it is absolutely ridiculous and convolutes the return process, this is highlighted especially when returns from other retailers do not ask for this. Ultimately, so long the product has not been damaged then the seller probably would just repackage this and sell again anyway. This policy is solely designed to discourage quick returns and the choice of adopting this policy would make me hesitant to recommend this company and has honestly discouraged me from purchasing from them. Not to mention the extortionate charge for P&P - I paid £7.99 for the charger to arrive in a plastic postal bag and paid for RM Tracked 24 which costs £6 anyway, £1.49 additional charge for someone to click and drop via RM website. While this was late (though more the fault of RM strikes rather than Journey). The reason I am so infuriated with these practices is these are NOT consumer friendly and do not put the customer at heart of what they do."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MaryAnn Yourinson",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T16:13:23.000Z",
          "Titre": "Returned",
          "Contenu": "Returned. Didn’t live up to description. The watch part did not fit properly."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T15:29:14.000Z",
          "Titre": "Item is defective cannot get anyone to…",
          "Contenu": "Item is defective cannot get anyone to send me a refund shipping label"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MaryAnn Hudson",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T17:11:30.000Z",
          "Titre": "The phone does not stay on how do I…",
          "Contenu": "The phone does not stay on how do I return this I am upset. It was a lot of money I want a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry BONNER",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T20:49:24.000Z",
          "Titre": "Effectively charged AirPodsPro and…",
          "Contenu": "Effectively charged AirPodsPro and iPhone 14, however, charging for Apple watch regardless of series was slow and inconsistent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pamela Harris",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T17:19:32.000Z",
          "Titre": "Having the worst time finding s wall…",
          "Contenu": "Having the worst time finding s wall plug.  I finally had to buy one from you for $30"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bobby Gill",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T19:16:42.000Z",
          "Titre": "Will not intregrate with Apple car…",
          "Contenu": "Will not intregrate with Apple car play, big time waste of money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marti Delanoy",
          "Nb_Reviews": 2,
          "Date": "2023-02-09T03:52:32.000Z",
          "Titre": "I’ve tried to return these sent email to you to get info on the return",
          "Contenu": "I’ve tried to return these. One doesn’t work so the other may have issues"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan Gibson",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T00:45:54.000Z",
          "Titre": "I never have received my package"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Danny Mason",
          "Nb_Reviews": 4,
          "Date": "2023-01-17T09:48:32.000Z",
          "Titre": "Customer Service is Disgusting",
          "Contenu": "They sent out the wrong products, I even confirmed with my order in case I'd made a mistake. I hadn't and they did absolutely nothing to rectify the issue.Had to send multiple emails to even get a response from them, the products look good but I'm not gonna be using them and returning for a full refund as the service is absolutely shocking.Do not support this business.Love how you're playing victim in response. I had no choice but to spam you with emails because you wouldn't reply. So all the customers know why I spammed you and bullied your useless customer service agents it was because of this:I ordered a correct product, you never delivered it. You sent a completely wrong product.You only said return it and reorder.You offered no discount code for the inconvenience.You didn't offer to cover the new shipping charge until I argued with you for hours.You would have me make the entire effort of returning the product.You wouldn't offer an exchange for your mess up.Your team forced me to spam you with emails in order to get a resolution.You forced me to raise a merchant dispute with my bank because of your awful service.Your bad review is 100% warranted and your response to this is completely pathetic, small business mentality.I gave you every opportunity to offer me a decent resolution and you failed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "simone lago",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T20:34:18.000Z",
          "Titre": "Been trying to return an item for a…",
          "Contenu": "Been trying to return an item for a week."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "rob d",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T14:38:29.000Z",
          "Titre": "The both units doesn’t work",
          "Contenu": "The both units doesn’t work. Provide proofs too but never got my money refunded"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sylvia Catron",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T19:36:04.000Z",
          "Titre": "Device did not work",
          "Contenu": "Device did not work Still no credit Had to pay return Bogus Co"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tamara Lafarga",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T23:45:31.000Z",
          "Titre": "Never received my item.",
          "Contenu": "Never received my item.Please refund my moneyThank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Palmer",
          "Nb_Reviews": 2,
          "Date": "2023-03-06T23:01:39.000Z",
          "Titre": "You see me a broken charge and don’t…",
          "Contenu": "You see me a broken charge and don’t refund the shipping!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kay Goldstein",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T19:38:23.000Z",
          "Titre": "Couldn't hook up",
          "Contenu": "Couldn't hook up.  Am returning"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-04-23T22:24:46.000Z",
          "Titre": "Merchandise made and felt cheap",
          "Contenu": "Merchandise made and felt cheap, not worth the price."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ec",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T00:51:17.000Z",
          "Titre": "I’ve paid for the product but it has…",
          "Contenu": "I’ve paid for the product but it has yet to arrive"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julius Fahnbulleh",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T15:07:04.000Z",
          "Titre": "Need adapter for this charger"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RONALD TORNCELLO",
          "Nb_Reviews": 3,
          "Date": "2023-06-30T01:48:03.000Z",
          "Titre": "It doesn’t work for me",
          "Contenu": "It doesn’t work for me. It wont charge my phone or my air pods. It only charges my watch."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laurie Salerno",
          "Nb_Reviews": 2,
          "Date": "2023-02-18T05:13:01.000Z",
          "Titre": "The charger for the AirPods does not…",
          "Contenu": "The charger for the AirPods does not charge them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Delissio",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T23:57:01.000Z",
          "Titre": "I never received the items ordered!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lannah Alford",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T04:00:21.000Z",
          "Titre": "I never received my order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony D'Orazio",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T16:07:42.000Z",
          "Titre": "Make sure you have the right device",
          "Contenu": "Item not as advertised."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Edward Wright",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T16:22:42.000Z",
          "Titre": "Disappointing Experience",
          "Contenu": "Ordered 2 magsafe chargers during black friday. I accidentally double ordered and within the hour sent an email to the company to let them know to not send and refund the accidental order which was ignored. When both orders arrived i contacted again via the website and was told i would be contacted promptly to get a return and refund sorted, again this has been ignored. Probably looking to issue a credit card refund at this point. Shame as the product itself looks good."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Taryn",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T22:41:06.000Z",
          "Titre": "It does not charge through my case",
          "Contenu": "It does not charge through my case, and does not charge my AirPods:("
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Big Baz",
          "Nb_Reviews": 3,
          "Date": "2022-02-12T07:33:22.000Z",
          "Titre": "Order placed a week ago for the 3 in 1…",
          "Contenu": "Order placed a week ago for the 3 in 1 charger for my son. Payment was immediately taken. No order has arrived and Journey ignore all emails and messages. I don’t know when/if I will receive my item and I am currently £80 out of pocket. Shocking service!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dave moss",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T22:36:08.000Z",
          "Titre": "I never received my order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T16:11:00.000Z",
          "Titre": "one of my Journey devices died"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Edward C",
          "Nb_Reviews": 14,
          "Date": "2022-03-11T12:07:12.000Z",
          "Titre": "Unresponsive company. Avoid.",
          "Contenu": "Very poor service. Slow to arrive and unresponsive customer service. Had to raise PayPal disputes to ensure delivery and return refund. I would not order from this company again. NB: They also have a .co.uk shop."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Benvenuto",
          "Nb_Reviews": 4,
          "Date": "2023-09-27T04:38:54.000Z",
          "Titre": "cheap quality",
          "Contenu": "cheap quality,  bad customer service"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Denali 2500HD",
          "Nb_Reviews": 3,
          "Date": "2023-09-11T19:25:07.000Z",
          "Titre": "Disappointed with the magnetic wallet…",
          "Contenu": "Disappointed with the magnetic wallet bulkiness and the magnetizing capability. Won't recommend."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "NL",
          "Nb_Reviews": 27,
          "Date": "2022-01-13T15:17:48.000Z",
          "Titre": "Deceptive Advertising",
          "Contenu": "The product (Magnetic in-car wireless charger) looked great in the advert, so I thought I would take advantage of their offer, and purchased two (For myself and wife), having received them quickly, I was impressed. But then the reality kicked in, it only just held my phone onto the magnetic holder not even in the car, just holding it! emailed the company, and they informed me that I need their special case for it to hold better (this was not mentioned in the advert),  and the new case would cost £40! Since I have had one response telling me to but more products from them, I have heard nothing further... and reading this it seems to be their M.O! lets see if their systems delayed my email.......*****************DON'T BUY THIS PRODUCT***********"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raymond Black",
          "Nb_Reviews": 5,
          "Date": "2023-02-15T15:08:27.000Z",
          "Titre": "they dont work correctly !!!!!!!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cindy Higgins Perretti",
          "Nb_Reviews": 5,
          "Date": "2023-04-17T16:17:17.000Z",
          "Titre": "It was the wrong size",
          "Contenu": "It was the wrong size. Do not have Gen 3 AirPods"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Smith",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T19:11:02.000Z",
          "Titre": "My watch won’t charge on it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Samantha Blake",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T03:33:58.000Z",
          "Titre": "I still have not received my products"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hapto",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T15:13:34.000Z",
          "Titre": "The AirPod charger doesn’t work on both…",
          "Contenu": "The AirPod charger doesn’t work on both the chargers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T14:55:01.000Z",
          "Titre": "I was under the impression this device…",
          "Contenu": "I was under the impression this device charged all Apple AirPods but to find out only specific ones. I bought my daughter a brand new pair of AirPods but was told they do not have wireless capability after I reached out that they wouldn’t charge. I would not have bought it had I known."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jicelle Ochoa",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T14:54:35.000Z",
          "Titre": "I canceled my subscription and yet I…",
          "Contenu": "I canceled my subscription and yet I was billed again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eugen Deets",
          "Nb_Reviews": 5,
          "Date": "2023-02-08T14:50:07.000Z",
          "Titre": "It showed people using with their…",
          "Contenu": "It showed people using with their protective covers on but the only way mine would work is to take it out of the cover"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sylvia b",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T14:43:57.000Z",
          "Titre": "Cheap product that pills immediately"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sad Mom",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T14:40:42.000Z",
          "Titre": "I ordered three of these for Christmas…",
          "Contenu": "I ordered three of these for Christmas and was super excited to use them. Unfortunately they are completely useless if you have a case on your phone. What a terrible design and incredible disappointment."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Mitch R",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T11:13:12.000Z",
          "Titre": "Misleading: Poor quality product, customer service, and morals",
          "Contenu": "Paid $150 AUD for their desk mat - which feels like a cheap piece of plastic with a slow and unreliable wireless charger. Putting the word “premium” in front of something does not automatically mean the end product is not of poor quality - as proved by this desk mat, which has a “premium vegan leather surface” that feels like very cheap, crappy plastic, and is therefore far below the standard I would expect of any desk mat, let alone the most expensive one I’ve purchased. What has prompted me to write this review, however, is that I wrote a small, fair, constructive 2 star review on their website, which they requested though did not publish, and instead wrote to me “informing” me that it’s actually not of poor quality, but made of a high quality premium vegan leather. I think it’s very ignorant and misleading to request feedback from their customers, delete all non-5 star reviews, and tell customers with feedback that they are simply wrong about the poor quality of a product they’ve just wasted their money on."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nick Plumley",
          "Nb_Reviews": 8,
          "Date": "2023-01-30T13:16:17.000Z",
          "Titre": "Very poor quality product. Avoid",
          "Contenu": "Very poor quality product.Constantly makes a weird sound so unable to use in the bedroom. Also super slow charging despite using 20W USB C charger.Now one month after receiving the watch charging port has stopped working completely.Absolute waste of money I would avoid and buy an apple verified product"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Charles Brandreth",
          "Nb_Reviews": 2,
          "Date": "2022-12-01T11:56:31.000Z",
          "Titre": "Just cancelled my order because I was…",
          "Contenu": "Just cancelled my order because I was asking when it was getting delivered. Completely out of the blue, shocking company to deal with! Would avoid"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bobby Gill",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T16:42:27.000Z",
          "Titre": "Product does not work at all",
          "Contenu": "Product does not work at all, waste of my money"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bill Coleman",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T17:15:18.000Z",
          "Titre": "AVOID AVOID AVOID…",
          "Contenu": "AVOID AVOID AVOID…ALL CONMEN DONT WEAR STRIPPED SHIRTS AND CARRY A SWAG BAG I’d give minus stars if possible, and after reading the posts below,this is a regular incident..as with most online purchases nowadays, you have to set up an account, I was then offered a “ discount” which I accepted I then proceeded thru all the relevant procedures..address etc…then offered the option of paying thru PayPal, which I took, I went thru those procedures and at the end was offered what I thought was a “ bigger” discount…on my original purchase….but here’s the “Con”. What wasn’t clear was the “second discount offer” was for further identical “ charging unit “ ..And it wasn’t until I clicked “pay now “that you realise they have charged you for “2”…Within minutes of realising this I contacted them to inform them of the catch.only to be told “. Your order has already been processed “ and that they would send return labels with the charging units …The units arrived,not only weren’t the return labels, or any proof of purchase or guarantee included…but they sent two of the “ Wrong Coloured units “ I wanted White , and 2 Black ones showed up Here’s where the games begin, delaying tactics, In trying to force you to keeping the units and taking you past “ Paypals “ escalation period” of 7 days from original purchase date With the way in which I’ve been treated,I asked for a full refund on both “ units” as there is no trust with this company,I’d also raised a claim thru PayPal..Today I’ve had emailed contact where they are ignoring my requests and are still trying to make me keep one of the units….They asked me to prove the “Wrong” units had been sent first and then They’ve also then emailed a PDF format return label,which I have no way of printing…so they have forced me to escalate this issue “ for a full refund “ thru PAYPAL….so as I stated at the top….AVOID AVOID AVOID.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "shekarreddy pervala",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T03:55:55.000Z",
          "Titre": "worst",
          "Contenu": "worst. not worthy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katy Herbold",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T20:36:43.000Z",
          "Titre": "Terrible return experience"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Hickman",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T21:13:28.000Z",
          "Titre": "There was a lot of confusion in the delivery",
          "Contenu": "There was a lot of confusion in the order delivery, but I am satisfied with the product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marianna Holzer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T18:22:04.000Z",
          "Titre": "Watch charger not detachable",
          "Contenu": "I thought the apple watch charger could be detached , but the one I received doesn't seem to be able to do that,so it isn't what I expected"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ed McNichol",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:46:16.000Z",
          "Titre": "Does not work on circular vents",
          "Contenu": "The vent attachment did not work on my 2013 Ford F-150. When I contacted the company, they did offer a refund but made no attempt to understand why it did not fit. I used the adhesive mount on my dash to get the unit to work. And the LED light on the USB adapter stays lit all of the time, even when the car is os turned off."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dominique",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T19:57:29.000Z",
          "Titre": "No closure",
          "Contenu": "I like the idea of this sleeve, which is why I bought it, but I’m not happy with my purchase. It arrived very quickly, which is great, but it almost immediately it wouldn’t be as effective as I hoped. It looks sloppy/unprofessional. There is no closure so it flaps around and can be difficult to maneuver. I assumed it had a magnetic closure given that you can use MagSafe phones. It needs either a magnet or an elastic closure so that when you’re carrying, placing in bag, or even if it is just laying on a table with a laptop inside, the sleeve can stay closed. I travel frequently and have many client meetings. This just doesn’t meet the mark. Also the stitching feels bulky and adds to the difficulty above. I’ll be searching for another solution."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eduardo Jany",
          "Nb_Reviews": 5,
          "Date": "2023-09-11T17:55:49.000Z",
          "Titre": "Not worth it",
          "Contenu": "The mat is nice but frankly not worth the money.  Charger does not really work with most wireless charging items including newer Samsung phones.  Episodic functioning at best.  That being said it is a nice, classy felt desk mat that was likely produced for $20 but costs over $150 USD."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Connie Fowlkes",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T01:23:33.000Z",
          "Titre": "Love my purchase however the charging section for my air pods does not work.…",
          "Contenu": "Love my purchase however the charging station does not work for the air pods. I have placed the case on their many times and it does not charge and I purchased it specifically to charge my watch, Iphone and Air pods. Disappointed!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Gonsalves",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T04:01:01.000Z",
          "Titre": "Ordered online",
          "Contenu": "Ordered online, no notification that they couldn’t find the item, went to the store were I was told and had to drive to another store to find it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DP",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T18:59:08.000Z",
          "Titre": "Expensive and Mediocre",
          "Contenu": "Mount is very expensive for its category and frankly doesn't work very well. The stabilizing arm works okay for keeping it steady with normal use but it doesn't work too well if you want to make any adjustments, e.g. rotation to landscape. It's also pretty easy to pull it out of the vent because the magnetic connection is stronger than the grip holding it on the vent.The charging is pretty weak on an iPhone 13 Pro; I find that it tends to keep the battery level wherever it is when it starts, but the charge level doesn't seem to go up. Granted, this is a problem with all wireless charging and not specifically the mount.On the plus side, it looks pretty nice, but overall you're probably better off getting something for half the cost on Amazon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rob.",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T15:02:16.000Z",
          "Titre": "It’s a fine mat…on one side",
          "Contenu": "It’s a fine mat…on one side. The fiber side catches onto the mouse constantly and now the fibers are pulled out and unusable. I flipped the mat onto the other side but the leather has more friction and harder for the mouse to glide and the fiber side makes the mat slide all over the desk. The magnets holding the two parts together are weak and come detached often. I don’t even use the the mat anymore"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Molly Worrell",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T16:05:28.000Z",
          "Titre": "There were too many unanswered…",
          "Contenu": "There were too many unanswered questions on the front end of this purchase for those who do not own the latest iPhones (12 or 13). This is not made clear at all in the company’s adds for their products. So, while I think the product is a good one, the experience has been frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deb Warren",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T20:32:14.000Z",
          "Titre": "Some omitted facts about this charger...…",
          "Contenu": "I never saw or read about the act that one's Iphone 12 had to be removed from its case to charge it! I even considered buying one of your cases, although it is not as sturdy as the case I presently have for my phone.  However,all of your phone cases were out of stock!Since I had already opened one of my two chargers, I cannot return it...but I am going to try to return the one I bought for my husband as a gift. I feel that the information that a phone must be case-less or have your case only was very misleading!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SA",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T16:48:48.000Z",
          "Titre": "Would not buy again",
          "Contenu": "Air pods will not charge so that portion is unusable and the phone will not charge with a case on so we have to take off the case every night. We do not have a watch so never use/no need for that part of the charging dock. So really, this product is of no use to us. Extremely disappointed, especially at the price point."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Daniel G",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T17:19:33.000Z",
          "Titre": "iPhone 14 Pro Leather Case",
          "Contenu": "I purchased their iPhone 14 Pro leather case which I must admit looks great however, its design lets it down massively. The buttons simply do not function - by this I mean they either hold down the power/volume buttons completely (so it consistently activated Siri or takes screenshots) or they just don’t function at all. Journey customer service responded very quickly and dispatched a second case… unfortunately, this one has the exact same issue so it’s definitely a design fault. For the price of the case, you’d expect this fault to not be present. In addition, I believe for at least one of the cases, they had sent me a “returned” case as the packaging showed signs of “first use”. The other case had a great scratch deep in the leather on the back, so it was surprising to see how this passed their Quality Checks.Finally, when asked for an update from the second case, they didn’t seem to want to work out why I was sent two dodgy cases and took me up immediately on my suggestion of a refund. It would have been nice to see what could have been done to resolve the fault but at least a refund was promptly issued. Unfortunately, I would not buy from this company again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allen Sackett",
          "Nb_Reviews": 4,
          "Date": "2023-04-22T02:41:19.000Z",
          "Titre": "Amazing concept",
          "Contenu": "Amazing concept, great design. Love everything about it but……the watch charger does not deliver a full charge. Most times after all night in the charger, I get about 90%. I have moved my watch to other chargers with better results (100%)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rusia Mohiuddin",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T21:05:14.000Z",
          "Titre": "i got the rapid trio and while it is…",
          "Contenu": "i got the rapid trio and while it is aesthetically pleasing it is not rapid and for $150 you'd think it would come with a charging block. super disappointed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kramersmom",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T17:48:18.000Z",
          "Titre": "Doesn’t work for iPhone 11",
          "Contenu": "Doesn’t work for iPhone 11. Print too small, not as easy to assemble as seen in IG. Good customer service. I returned."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TBM",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T04:08:21.000Z",
          "Titre": "I purchased the leather desk pad that…",
          "Contenu": "I purchased the leather desk pad that charges iPhone and earbuds and the three in one that charges iPhone, watch and ear buds. Neither came with the charging block. For the price it should have been included imo. The three in one doesn’t hold the iPhone in a case. I would not recommend either. I’m sorry."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ROBERT SHELL",
          "Nb_Reviews": 3,
          "Date": "2023-07-03T16:27:55.000Z",
          "Titre": "Trouble aligning mag safe",
          "Contenu": "Trouble aligning mag safeNo one is ever available in customer service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeffrey Freeman",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T21:50:47.000Z",
          "Titre": "Too slow with delivery"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe Caruso",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T20:57:19.000Z",
          "Titre": "I love the product BUT",
          "Contenu": "I love the product, the experience and it shipped super quick.  I bought 5 of them.But they don’t charge the AirPods :("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Momo R",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T06:25:54.000Z",
          "Titre": "Not good for bigger iPhones",
          "Contenu": "I like the design, but not suitable for bigger phones (pro, pro max). My phone just slides off because of its weight"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deanna Couture",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T01:13:36.000Z",
          "Titre": "This item doesn’t charge my AirPods",
          "Contenu": "This item doesn’t charge my AirPods.  It works for my Apple Watch and my phone if I remove it from its case.  I regret buying it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T12:00:06.000Z",
          "Titre": "Charger is great but the blinding light isn’t",
          "Contenu": "The phone/watch and AirPod charger is great. But the light on the front of it is so bright and blinding at night I had to tape it up"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jackgree",
          "Nb_Reviews": 3,
          "Date": "2023-03-17T19:15:54.000Z",
          "Titre": "No response to site inquiry",
          "Contenu": "No response to site inquiry. Poor device charging performance."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adrian",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T17:49:10.000Z",
          "Titre": "Not worth the money",
          "Contenu": "Not worth the money. The charging pad is the nicest part. The main pad slides a lot on a wooden desk."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff Kraus",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T20:34:58.000Z",
          "Titre": "Would have been easy to include a clip…",
          "Contenu": "Would have been easy to include a clip for cash bills.  Also, it's quite thick and heavy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Hamilton",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T21:19:07.000Z",
          "Titre": "Keep having problems with it charging…",
          "Contenu": "Keep having problems with it charging my watch!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Colleen Hulce",
          "Nb_Reviews": 6,
          "Date": "2023-09-27T17:36:54.000Z",
          "Titre": "I ordered an iPhone case",
          "Contenu": "I ordered an iPhone case.  It has been over a week and it is still not here! ordered on the 21st"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dawn",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:24:28.000Z",
          "Titre": "Charger is extra",
          "Contenu": "I was impressed by the design and engineering of the products, just bummed that it did not come with the charger and that was an extra $30 so I just feel it’s priced too high"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven Randall",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T21:19:15.000Z",
          "Titre": "It is great but you have to take the…",
          "Contenu": "It is great but you have to take the phone out of the case for it to charge."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MARC N'DOUMI",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T03:35:23.000Z",
          "Titre": "TRIO ULTRA",
          "Contenu": "My 3-In-1 Wireless Charging Station was delivered ahead of time and I am pretty happy about it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joan Schlesinger",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:47:26.000Z",
          "Titre": "Non stick…",
          "Contenu": "My phone in its case does not stick to it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T02:01:41.000Z",
          "Titre": "They made it difficult to return the…",
          "Contenu": "They made it difficult to return the charger. They asked for images, and videos of it not working, including images of the item with all the accessories, including the box. I thought this was unnecessary ... I was dissatisfied with the product. Period. I get the feeling they were hoping to talk me out of it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Stechschulte",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T15:51:47.000Z",
          "Titre": "Connectivity is not as efficient as…",
          "Contenu": "Connectivity is not as efficient as expected.  Charge time takes longer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marissa",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T17:17:00.000Z",
          "Titre": "Can’t use with phone case",
          "Contenu": "Set up is great especially having to use my phone as the baby monitor, but having a very hard time finding a case that is compatible. All cases have been MagSafe but seem to be too heavy so have to take my phone case off every night."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Vincent teo",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T05:16:42.000Z",
          "Titre": "The quality and design is excellent.",
          "Contenu": "The quality and design is excellent.However the silent/ action button where it is left open is hard to operate being recessed too deep."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glenn McQuaig",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T23:05:33.000Z",
          "Titre": "Mostly Happy With The Stand",
          "Contenu": "I'm mostly happy with the stand. However, the magnet that holds the iPhone is tricky to attach the phone to, and it seems a little on the weak side. Also, my watch has a similar issue once I place it on its perch. It will sit there for five minutes just fine, then without me being anywhere near the stand or watch, apparently disconnect from the charger and then reconnect. I know it's doing this because of the \"ping\" that I hear from the watch. This happens several times while it is on the stand, oftentimes waking me up in the middle of the night.So, mostly happy with it, but I think it could be improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karla",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T19:53:32.000Z",
          "Titre": "Charger not blotter",
          "Contenu": "Lengthy shipping time. Charging feature is cool and love the color of the non-felt side but the materials are lacking. I'm very careful and there are 2 places where a bit of ink will not come off with water, dish soap, baking soda. Dents from spiral notebook. This is not ok--a blotter is to take the blows of daily life. Felt side texture is weird--there are WAY nicer vegan materials. It seems like a great idea that hasn't found the right materials yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt H",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T19:47:08.000Z",
          "Titre": "OK for the price of exceptional",
          "Contenu": "Product is a bit flimsier than expected. It's fine, usable, but not quite as polished as I expected for the price. The Watch charger only sort of works. It does not keep a strong hold on the watch, often not charging."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gabriela Gonicman",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T16:18:54.000Z",
          "Titre": "Sudden malfunction of 3 in 1 charging device The magnetic field that charges the…",
          "Contenu": "Sudden malfunction of 1 in 3 charging device.The magnetic field that charges the iPhone watch stopped working after 1 month of use. While the watch is placed correctly it  lights up and off while beeping. It doesn’t charge it .Since it was purchased as a Hanukkah gift (late November 2022) no longer have the original packaging and the 1 in 3 charging system stopped working after a month I didn’t reach out to the company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "emiliyat",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T02:03:33.000Z",
          "Titre": "Nice, but could be better",
          "Contenu": "The leather side of the mat is nice, the felt feels cheap and very thin. I am pretty sure it’s not compatible with older apple AirPods, I have the 2nd gen and I’m convinced the mat doesn’t charge them. Also I really thought the pad itself would be a lot bigger, but it’s actually on the smaller side, enough for my apple keyboard and trackpad, but that’s it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T19:34:05.000Z",
          "Titre": "Delivery was great, wool not high quality",
          "Contenu": "Delivery was great - quick shipping with no issues. However, I’m disappointed that for the price the wool side of this desk mat isn’t better quality. I’ve purchased cheaper wool mats from Amazon that feel better and are sturdier."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sean Maher",
          "Nb_Reviews": 3,
          "Date": "2023-04-27T20:14:48.000Z",
          "Titre": "It wasn't quite what I expected",
          "Contenu": "It wasn't quite what I expected. The felt material is fantastic, but it's not hemmed around so if your arm brushes up against it, it creases and buckles. It's easy to straighten out, but annoying to do so constantly. There's very little grip on the bottom so it slid around a lot on my wood surface desk. And the flap was not as useful as I thought it would be. I would have liked to have an even larger size than the largest they offer. I ended up swapping for something larger and thinner with no flap that I like much better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RONALD TORNCELLO",
          "Nb_Reviews": 3,
          "Date": "2023-07-05T19:47:52.000Z",
          "Titre": "Product did not work for me",
          "Contenu": "Product did not work for me. All it would charge was my watch. The customer service that was rendered to me, however, was 4 STAR quality. It doesn’t come any better!Thank you for your understanding of my difficulty and your quality handling of the matter."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Emma Galen",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T03:06:49.000Z",
          "Titre": "Charges my Apple Watch too slowly.",
          "Contenu": "I really liked getting rid of so many wires and I like how the iPhone attaches and rotates on the stand.  However I am disappointed with how much time it takes to charge my Apple Watch. When I plug it on the charger the watch came with, it takes about 1 minute per 1% to charge. That is about 3 times as fast as the time it takes to charge on the stand."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pete Smith",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T18:51:06.000Z",
          "Titre": "Thinner than expected",
          "Contenu": "I was very excited when I saw this product for the connectivity and its look. However, upon receiving it, the mat is extremely thin. If you know felt. It loses its shape easily. And I understand they wanted to match the height with the charging side, but it's too thin. Overall I wouldn't recommend."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yody O",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T16:22:34.000Z",
          "Titre": "Looks great but charges slower than expected",
          "Contenu": "I love the look and the feel of the stands. I bought both the 3 in 1 charger  and the rapid trio charger as well. They both look so elegant with one on my nightstand and the other in my office. I don’t notice any speed difference with charge time between the two at all. One negative is that they both charge way slower than just plugging it into my standard USB-C wall charger, especially for the Apple Watch. I’m not sure whether it’s affected the battery life yet. I hoping I can write an updated review after a couple of months.Also you definitely need both hands to remove your phone even though it claims you can use one hand. The base  isn’t heavy enough. Will probably have to use double sided tape to mount it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sue & Tim",
          "Nb_Reviews": 4,
          "Date": "2023-02-15T21:19:25.000Z",
          "Titre": "I love the concept",
          "Contenu": "I love the concept. Everything worked with fast charge. I’m disappointed that the magnet isn’t stronger. It’s difficult to find the perfect spot to set the phone (In its slim case) on the holder. It can easily slide off if you’re not careful to get it on that spot. A stronger magnet would solve the problem. That being said, I will keep it. I’m getting better at placement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alexandra Zilli",
          "Nb_Reviews": 4,
          "Date": "2023-02-11T17:56:15.000Z",
          "Titre": "Great",
          "Contenu": "I enjoy my purchase and the convenience of charging all three of my electronics all at once is great. However, I cannot get through the company to inform them that my Apple Watch is not charging as it should. This is very frustrating for me. So...I am back to using my other charger for my watch. The charger for my iPhone and iPods is great. I think this company has great products, and I might purchase other items in the future. I'm the meantime, I would like to speak with someone about my issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristin Pardue",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T20:33:04.000Z",
          "Titre": "I love the product",
          "Contenu": "I love the product, but it came in a package that was 50x the size of the mat. It would be awesome to decrease the size of your packaging to help the environment and make me feel good about ordering more products from you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greta Krueger",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T17:06:58.000Z",
          "Titre": "Not a streamlined return process",
          "Contenu": "I liked the quality of the band; however, the size was way off and not easy to understand in the ordering process.  I've yet to finalize my return as purchasing in this platform was not typical and seemed less than supportive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Oscar Aparicio",
          "Nb_Reviews": 3,
          "Date": "2023-07-19T19:39:17.000Z",
          "Titre": "One Fatal Flaw",
          "Contenu": "The charger is great except for one fatal flaw - the pulsing light on the front. Makes this impossible to use on a night stand. I’ve taped it over with electrical tape. But paying over $120 for something I need to mod to use is lame. The phone, watch, and AirPods tell me when they are being charged. I don’t need a light."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Colleen Hulce",
          "Nb_Reviews": 6,
          "Date": "2023-02-08T17:12:04.000Z",
          "Titre": "It’s not great",
          "Contenu": "It’s not great. Other companies have similar products that are less and take older iPhones  customer service with journey are subpar"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg Armstrong",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T21:48:09.000Z",
          "Titre": "The 3 in 1 wireless phone charger…",
          "Contenu": "The 3 in 1 wireless phone charger Product works great, but you shouldn’t have to buy the wall adapter separately"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anna C",
          "Nb_Reviews": 4,
          "Date": "2023-03-30T23:17:11.000Z",
          "Titre": "The product is beautiful and arrived in…",
          "Contenu": "The product is beautiful and arrived in a day. However I thought it would charge the wireless keyboard and mouse it only charges your phone and your EarPods and it takes a long time to charge. Not worth the money in my opinion. Should cost half the price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T08:02:45.000Z",
          "Titre": "My watch doesn’t charge completely when…",
          "Contenu": "My watch doesn’t charge completely when sitting on the stand."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carmie Pitt",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T17:53:02.000Z",
          "Titre": "Sleek charging station",
          "Contenu": "I really like the set-up.  Keeps everything in one spot and looks clean.  However, the charging unit for watch won’t charge my watch or my husbands.  I even took the band off.Also, if you have a case on your phone you have to take it off every night."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "robert poe",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T18:39:21.000Z",
          "Titre": "Why do you keep sending this",
          "Contenu": "Why do you keep sending this?  I’ve rated my experience several times!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Harold Clements",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T17:45:14.000Z",
          "Titre": "My phone has a cover and doesn’t attach…",
          "Contenu": "My phone has a cover and doesn’t attach to the charger.  Rather than go through the return process, I gave them away."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 5,
          "Date": "2023-04-21T00:04:33.000Z",
          "Titre": "Cover has to be taken off.",
          "Contenu": "I dislike having to take off my cover on my phone in order to use your device. I want to return it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grace Kwon",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T18:13:42.000Z",
          "Titre": "Average",
          "Contenu": "The charging pad did not charge that fast which was disappointing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carlos Moran Jr",
          "Nb_Reviews": 3,
          "Date": "2023-07-24T21:51:44.000Z",
          "Titre": "Shipping was quick but the quality of…",
          "Contenu": "Shipping was quick but the quality of the product isn’t what I thought it would be"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen Padilla",
          "Nb_Reviews": 3,
          "Date": "2023-02-08T14:42:44.000Z",
          "Titre": "It was not clear to me that I needed a…",
          "Contenu": "It was not clear to me that I needed a power block to use this product"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Celeste",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T14:53:57.000Z",
          "Titre": "I haven’t received the product yet",
          "Contenu": "I haven’t received the product yet. It’s taken too long to receive it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob Kitchen",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T14:53:53.000Z",
          "Titre": "Not especially well made",
          "Contenu": "Not especially well made.  Leather overlaps the felt due to poor measurements.  Feels nice though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vicki",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T16:37:23.000Z",
          "Titre": "Takes too long to charge the watch."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa Melancon",
          "Nb_Reviews": 3,
          "Date": "2023-02-08T16:32:18.000Z",
          "Titre": "It doesn’t come with the cube :("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joyce Davis",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T17:52:22.000Z",
          "Titre": "It does not charge.my ear pods."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Whittelsey",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:21:43.000Z",
          "Titre": "was a seamless process to order and…",
          "Contenu": "was a seamless process to order and delivered on time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Ross",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T06:53:26.000Z",
          "Titre": "I am happy that it charges my watch and…",
          "Contenu": "I am happy that it charges my watch and phone, but disappointed that it won’t charge my AirPods. Why not? Also curious if it will charge androids?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 2,
          "Date": "2023-10-21T00:40:34.000Z",
          "Titre": "Everything went generally well, few exceptions",
          "Contenu": "Everything went generally well.    One area of improvement is your Return process.     Way too much back and forth, which also equates to more time.    I feel like the Return process should be a lot more straight forward and automated.     Also your marketing links took me to a product that seemed like it was what was being advertised but it wasn’t.    Hence the ordering mistake resulted in an uneccessary product return."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John and Joan Steward",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T00:11:56.000Z",
          "Titre": "Quick service an update as to products…",
          "Contenu": "Quick service an update as to products arrival."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T23:12:10.000Z",
          "Titre": "95% perfect",
          "Contenu": "It’s SO close to be perfect. A heavier base with stickier pads would make it so, just for those rough mornings where I may be a bit careless and go to rip my phone off the stand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ERIC M. ALSHEIMER",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T18:26:16.000Z",
          "Titre": "I had to return the items…received well…",
          "Contenu": "I had to return the items…received well over a week ago and still no refund!!Update...so today is day 13 with no refund, so I guess the response Journey gave to my rating holds true 7-14 days, which is a ridiculous amount of time for a refund!!  In addition, customer service does not respond to emails and did not advise this back to me when I inquired on my refund a week ago.  Still no response to my email but were able to respond to my rating to attempt to save face.  This poor customer service is the reason for a poor rating and could have been avoided with a simple email response to my inquiry!Update...Journey has made it right and issued full refund today.  Customer service stepped up, opened communication, and processed the refund within their guidelines."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bernard Maurer",
          "Nb_Reviews": 3,
          "Date": "2023-11-27T02:54:14.000Z",
          "Titre": "Purchase was exactly what I ordered and…",
          "Contenu": "Purchase was exactly what I ordered and work’s great. Product is a little pricey compared to other brands but in my opinion well worth it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pamela Ruffolo",
          "Nb_Reviews": 4,
          "Date": "2023-11-18T20:33:23.000Z",
          "Titre": "Love this except that I have to remove…",
          "Contenu": "Love this except that I have to remove my case to charge. Yes it comes with the option to place the piece on my phone case however I have 2 cases that I change off with. Otherwise it’s great saver on space and cords."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JO",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T19:02:28.000Z",
          "Titre": "Overall good stand",
          "Contenu": "Overall good stand. Really like the clean design and spacing. I do wish it were a little heavier at the base so it didn't move as move when taking items off. Also, so far the plastic has held up well, but feels less premium and like it could scratch and show wear before long."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Vazquez",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T00:06:54.000Z",
          "Titre": "Well packaged product",
          "Contenu": "Well packaged product. Arrived as promised.  Watch charging seems a little slow. Phone charging meets expectations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T15:13:10.000Z",
          "Titre": "A solid product that looks sleek and…",
          "Contenu": "A solid product that looks sleek and smart on any desk profile. It’s a bit of a bummer because given the price, I’m already seeing the felt side give way and pill like a sweater where I use my mouse which makes me a bit regretful I didn’t know about this before my purchase. Otherwise the product is as described and looks and functions great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LHJ",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T15:45:37.000Z",
          "Titre": "So much more efficient!",
          "Contenu": "I love these charging stations and bought 3.  I own an iPhone, EarPods, and an Apple Watch. They’ve helped me to tidy up my bedside table, my desk, and my kitchen counter. The only reason I’ve omitted one star is because buying a wall charger is mandatory as they don’t work with your garden variety Apple charger (of which I already have many) Your website should make that clear before someone makes a purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GW",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T02:43:57.000Z",
          "Titre": "works as advetised",
          "Contenu": "Arrived in one piece. Great Packaging. Just doesn't charge my apple watch as fast as a dedicated charger."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick Sheehan",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T18:29:17.000Z",
          "Titre": "Great, but needs a fix.",
          "Contenu": "I really like this. I thinks it’s well-made, and looks nice on my desk. My only issue is that it seems incapable of charging BOTH my iPhone AND my AirPods Case simultaneously… my AirPods will not charge if the iPhone is connected. Sometimes the AirPods won’t charge at all. Sometimes they will…If this was fixed/replaced I’d give it a higher rating for sure."
        },
        {
          "Note": 4,
          "Lieu": "DO",
          "Pseudo": "Micaela",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T21:31:29.000Z",
          "Titre": "Great quality.",
          "Contenu": "The only thing that would make this a 5/5 would be to include the wall plug-in (esp because I purchased black and have no black charging heads so that’s no fun!). Product itself is amazing - quick charge for my watch, phone, and AirPods all on one place!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-02-08T16:24:18.000Z",
          "Titre": "A little disappointed it doesn't work with …",
          "Contenu": "A little disappointed it doesn't work with my Oh Snap phone grip even though it was designed to work with any Mag charger - My Oh Snap charges easily on any other wireless charger... Otherwise - LOVE it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt Rueffer",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T17:31:16.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Stylish. Have had zero issue. Only thing keeping it from being 5-stars is your shipping costs. For the price point of your product compared to other suppliers, you should be able to offer free shipping, better yet free 2-day shipping"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leslie Sporrer",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T21:49:06.000Z",
          "Titre": "Love it",
          "Contenu": "Love it, but the AirPod charger does not work. I have the regular AirPods, so maybe it only works for the AirPod pro?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Phillips",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T23:53:01.000Z",
          "Titre": "If you don't have the magsafe cover on your phone you need to order the MagSafe product from someone",
          "Contenu": "I wasn't able to charge my phone at first until I found out about the massafe piece that I needed because my cover doesn't have it built in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dustin Browning",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T20:16:10.000Z",
          "Titre": "I am very happy with this product",
          "Contenu": "I am very happy with this product! The only negative I have is that I ordered gray. I thought both sides would be gray but the leather side (my favorite based on material) is not gray. It’s more of a tope/light tan color. Had I known this I would have purchased the black one as the tan color does not match my office. It was too late to exchange as I had already opened everything. Other than that this product is awesome!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T21:57:28.000Z",
          "Titre": "I received the wrong color",
          "Contenu": "I received the wrong color (black instead of gray) and they got back to me right away.  It seemed like a hassle to have to take a picture of what I got and submit for review and return, so I just kept the black pad.  Now I think I actually like it better than the gray!  No one has emailed me to follow up though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corey",
          "Nb_Reviews": 3,
          "Date": "2023-08-16T02:30:03.000Z",
          "Titre": "The home docking charger station is…",
          "Contenu": "The home docking charger station is very nice. Well designed. Only reason I didn’t give it 5 stars is the price is pretty high. It should be about $30 cheaper. Other than that, it’s perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis Weinerman",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T18:27:07.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, works great, but should mention it didn’t come with the correct plug and the magnetic circle was not strong enough to hold the phone. I had to buy the plug and a phone cover that had a stronger magnetic circle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hope Styles Teclesenbet",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T00:27:36.000Z",
          "Titre": "The product is amazing!!",
          "Contenu": "The product is amazing!!! I’ve had it for maybe 2wks or so now and it is so convenient. The only thing I did not understand is why it did not come with its own plug because every plug does not hold the required watts to power everything that is put into it. So we shall see how long this last with the plug I have…"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SNewman",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T19:52:42.000Z",
          "Titre": "Shipping was great",
          "Contenu": "Shipping was great, however, the package delivered was super dirty on the outside, but fast delivery. The contents were good!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kellybell",
          "Nb_Reviews": 5,
          "Date": "2023-02-15T16:15:55.000Z",
          "Titre": "Great portable charger",
          "Contenu": "I love this portable charger except it’s very slow. Still it gets be through for about an hour without my phone dying. I got a MagSafe phone case so I don’t have to remove the case anymore to charge. I wish it had a battery life display."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Happy customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T01:18:31.000Z",
          "Titre": "Love it!",
          "Contenu": "I usually don’t rave and give feedbacks unless I really, really like it. This product arrived on time and it amazed me how easily it was assembled. It really worked as it should. Happy and contented buyer here👍."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T17:09:43.000Z",
          "Titre": "Very compact",
          "Contenu": "Very compact. Some issues with watch charger completing a 100% charge. Will see if this continues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle Frandle DVM MS",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T20:07:17.000Z",
          "Titre": "Very nice with all people we used with shipping of our new Radiology machine!!",
          "Contenu": "Easy to get information, they removed our old machine, and are installing our new machine, easy to work with!Thanks!Kyle Frandle DVM ,MS"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracy P.",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T21:24:31.000Z",
          "Titre": "Great product thus far!",
          "Contenu": "This is a great product. I haven’t had any issues with it. I love that I can charge all my products at once. I don’t think it really charges fast for the phone; the AirPods and watch do. But it doesn’t bother me because I charge my electronics overnight, so by the time I wake up it’s fully charged. I had to change my phone case because it didn’t have the mag safe capability. I had an OhSnap grip on there and It wouldn’t charge. I would’ve given it a 5-star if it could. I read responses from journey on why that could’ve been and tried what they suggested but it didn’t t work. It’s cool though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T00:18:11.000Z",
          "Titre": "Product was as promised and delivered…",
          "Contenu": "Product was as promised and delivered on time.  It’s nice not having to carry both a phone and a wallet. But it cannot carry much currency.  That it doubles as a phone stand is a bonus."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RanchoBill",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T20:25:00.000Z",
          "Titre": "Product works but the instructions are…",
          "Contenu": "Product works but the instructions are too small to read. Video installation would help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leslie Luhmann",
          "Nb_Reviews": 5,
          "Date": "2023-05-13T01:58:31.000Z",
          "Titre": "I love everything about this  charger…",
          "Contenu": "I love everything about this  charger except i have to take my phone cover off for it to attach magnetically"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim Heffernan",
          "Nb_Reviews": 7,
          "Date": "2023-06-06T00:34:53.000Z",
          "Titre": "I bought the wireless.",
          "Contenu": "I bought the wireless.. it's a great product and I have enjoyed its a little smaller than I thought and the color was much lighter than I thought it would be"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Viktor S",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T05:28:07.000Z",
          "Titre": "The quality is decent for the money",
          "Contenu": "The quality is decent for the money. But some engineering/design solutions could be better"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Wedmore",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T19:51:02.000Z",
          "Titre": "Love this product",
          "Contenu": "Love this product, however have problems getting my wife’s phone to work with it, just slides off."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeanette Kozlowski",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T22:05:42.000Z",
          "Titre": "Great product but no plug!",
          "Contenu": "Great product! I have two & they both work perfectly! It would be 5 stars except it doesn't come with a plug. I'd rather pay more and have the plug included."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lulu",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T19:08:35.000Z",
          "Titre": "Love the product",
          "Contenu": "Love the product, the only problem is that it gets very hot to the touch when its charging my phone.  Not sure if that’s normal?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Russ Gribble",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T16:34:56.000Z",
          "Titre": "The charging pad is not quick enough to…",
          "Contenu": "The charging pad is not quick enough to charge my iphone as I can do with the wall block charger."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy W",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T21:27:37.000Z",
          "Titre": "Love this multi-gadget charger",
          "Contenu": "Love this multi-gadget charger. Wish it folded up for my occasional travel purposes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Plant",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T15:49:48.000Z",
          "Titre": "Everything is in one place and the…",
          "Contenu": "Everything is in one place and the product is very sleek. Love it. Any criticism would us that some times I have trouble charging the air pods"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pico Delores",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T17:17:33.000Z",
          "Titre": "Hi love it",
          "Contenu": "Hi love it! Just needs to be heavier because you have to hold it to get phone off if not the whole thing moves!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erika",
          "Nb_Reviews": 3,
          "Date": "2023-05-22T23:39:14.000Z",
          "Titre": "I like it!",
          "Contenu": "It is nice and comfortable to use.  It's also handy for charging."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kari Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T16:25:42.000Z",
          "Titre": "The little blue light is so bright in…",
          "Contenu": "The little blue light is so bright in our dark room."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pamela Hoenig",
          "Nb_Reviews": 3,
          "Date": "2023-09-14T19:22:18.000Z",
          "Titre": "3 in 1 Apple charger",
          "Contenu": "Was exactly like described!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DZ",
          "Nb_Reviews": 2,
          "Date": "2023-05-23T08:02:45.000Z",
          "Titre": "Love the product",
          "Contenu": "Love the product. Just wish the AirPods charging space charged them through a case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hadley Mary",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T03:34:38.000Z",
          "Titre": "Fits phone perfectly & nice quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Inman",
          "Nb_Reviews": 5,
          "Date": "2023-02-15T15:31:18.000Z",
          "Titre": "Items took WAY too long to receive",
          "Contenu": "Items took WAY too long to receive. Other than that I’m happy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gustavo",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T17:23:12.000Z",
          "Titre": "Great product - Needs longer mat options",
          "Contenu": "Great product, would love it if there were a \"longer\" size option."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Morales",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T08:53:31.000Z",
          "Titre": "Ok….",
          "Contenu": "Ok……………….."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Willa Fleming-Harkness",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T22:04:43.000Z",
          "Titre": "It worked as stated",
          "Contenu": "It worked as stated - very happy with my purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian D",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T15:35:41.000Z",
          "Titre": "It’s a good device",
          "Contenu": "It’s a good device, I think the price point is a little high."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PMulford",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T15:51:45.000Z",
          "Titre": "Great design",
          "Contenu": "Great design, looks modern and uncluttered, and works!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mickey Quintrall",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T21:49:30.000Z",
          "Titre": "It’s okay but.,,",
          "Contenu": "It’s okay but, my wife has an iPhone 10"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "yrdone",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T13:28:14.000Z",
          "Titre": "Defective piece",
          "Contenu": "Looks good, works well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Burnett",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T21:49:22.000Z",
          "Titre": "Very nice product descriptions and…",
          "Contenu": "Very nice product descriptions and photos, made it easy for me to evaluate the products and to make my purchase decision."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Begin",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:43:49.000Z",
          "Titre": "Updated opinion",
          "Contenu": "Initially, I provided a two-star rating on this unit. I've since spoken with the sales department and they responded quickly and sent a replacement charger that works as intended. In addition to its great charging abilities, it's substantial in weight and form. I also want to acknowledge the excellent customer service I received.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karyn",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:38:40.000Z",
          "Titre": "Great Looking, Well Made!",
          "Contenu": "3 in 1 Charging Station is sleek and looks amazing on my night stands.  Happy to have all the wires gone!  One small oversight; the phone with the case on is too heavy for the magnet - the solution I was given is to buy the magnetic rounds and adhere it to the case.  I just remove the case for the time being!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Godfrey",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:29:36.000Z",
          "Titre": "The product is great!",
          "Contenu": "The product is great!! By far the best charger I’ve ever had. The delivery was quick and communication was excellent with keeping track of my order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rita J. Stingle",
          "Nb_Reviews": 11,
          "Date": "2023-12-11T17:38:54.000Z",
          "Titre": "Best Idea to Charge Everything in One Place",
          "Contenu": "So happy with the charger for phone, earbuds and watch in one place, with just one cord.  Before, I charged my phone on my desk, the watch in the kitchen and the earbuds were always dead in my purse.Did you know that if any problems that their Customer Service gets back to you immediately and solves the issue.  Happy Customer!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Weber",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:34:44.000Z",
          "Titre": "Great website",
          "Contenu": "The website was easy to navigate and I received the items in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geoff Gannaway",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:18:03.000Z",
          "Titre": "Professional and Customer Oriented",
          "Contenu": "Journey is totally professional and customer oriented. My first unit was not working properly and they immediately resolved the issue by forwarding a replacement unit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Glenn",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T05:13:57.000Z",
          "Titre": "Excellent quality and beautiful",
          "Contenu": "Love everything about it. Beautiful, great quality, and adds convenience. Order was shipped quickly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Susan Marti",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:22:43.000Z",
          "Titre": "Highly recommend",
          "Contenu": "Quick service, packaged beautifully, love having all devices in one space, fast charging. Couldn’t be happier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Denio",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:14:52.000Z",
          "Titre": "Three for my gang, one for me!",
          "Contenu": "I bought four. Three went as gifts to my mahjong group. They weren’t sure what they were but when I showed them, they loved the design and ease of using them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T23:36:17.000Z",
          "Titre": "The package came quickly an",
          "Contenu": "The package came quickly and the item was as pictured.  It is a gift so I am hoping they will like it and thank you for your service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Janet Curry",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T16:38:47.000Z",
          "Titre": "Journey is a quality product",
          "Contenu": "Journey is a quality product, nice to display any products in your home or office. Great gifts as welll"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CO",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:41:22.000Z",
          "Titre": "To be honest I bought several of the…",
          "Contenu": "To be honest I bought several of the journey chargers as gifts,but very pleased with delivery time,otherwise I cannot comment on use of the product.thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Jeffreys",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:27:33.000Z",
          "Titre": "Exactly as advertised!",
          "Contenu": "Item was exactly as advertised, was easy to buy and arrived timely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "diwich",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T17:57:22.000Z",
          "Titre": "Great 1st time experience with Journey",
          "Contenu": "First time ordering from Journey and was very pleased with my 3 in 1 wireless charger. I was concerned about leaving case on while charging but worked perfect for both phone and AirPods. I have recommend Journey products to my friends and family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alice Hua",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T06:34:14.000Z",
          "Titre": "The product works as advertised!",
          "Contenu": "The product works as advertised, looks sleek on my desk. Shipping was fast and pain free. I'm happy the purchase overall."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adi",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T17:23:38.000Z",
          "Titre": "I love this product",
          "Contenu": "I love this product. It’s exactly what i needed and was looking for. It looks so sleek and cute on my nightstand. It works perfectly so far. And the customer service is 10/10. I had a small issue that was resolved immediately. Great company. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brucey.B",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T01:17:56.000Z",
          "Titre": "Air vent mount",
          "Contenu": "\"Great find! I've been looking for this and considered two other options. This one looked most promising. When I got it, it was even better than the picture! Plus, the extra detail in packaging made it perfect.\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T13:08:21.000Z",
          "Titre": "Great well made product",
          "Contenu": "Arrived on time and was perfect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie Holden",
          "Nb_Reviews": 4,
          "Date": "2023-11-16T19:58:17.000Z",
          "Titre": "I was compelled to return my order…",
          "Contenu": "I was compelled to return my order since I was unable to use it.  Journey was very cooperative and stayed in touch with me throughout the return process just as they said they would.  I was very impressed.  Also, it only took a week for my order to arrive after ordering it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GRAHAM HILLYARD",
          "Nb_Reviews": 10,
          "Date": "2023-12-07T02:27:08.000Z",
          "Titre": "If your need a mount and you’re here, just buy it already!",
          "Contenu": "Hands down, thee best car mount I’ve ever purchased. Strong magnet and it’s adaptable to fit your needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adi",
          "Nb_Reviews": 3,
          "Date": "2023-11-11T22:19:18.000Z",
          "Titre": "Love the charger but the company is…",
          "Contenu": "Love the charger but the company is even better. Fast customer service. Very helpful and kind. The charger itself feels very solid. Does not feel flimsy or cheap. Will def be a return customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sydnei Alyshia Meyers",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T20:39:28.000Z",
          "Titre": "Speedy Shipping & Great Product",
          "Contenu": "My product was shipped quickly and arrived intact. I had been dragging my feet on ordering a replacement car vent mount (made the mistake of buying through a 3rd party and didn't feel like going through the work of trying to get a replacement) and then I needed the mount urgently. It arrived in time for my big road trip and I am so happy having my journey mount back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rex Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T17:25:36.000Z",
          "Titre": "Got my 3 chargers FAST",
          "Contenu": "Got my 3 chargers FAST, customer service answered my initial concerns FAST, my chargers work great, & matter of fact look pretty cool. What’s not to like? Absolutely 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia Nast",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T01:26:24.000Z",
          "Titre": "Great product- easy to charge my devices",
          "Contenu": "I bought the three-in-one charger. It is great for charging my phone and watch. Little slower than cords but there is no rush really. Have not tried the ear buds yet. I like the white color and easy way to charge my stuff. Cords are in the drawer so much cleaner area. No mess."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jo- Lynn Golden",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T19:42:22.000Z",
          "Titre": "Their customer service is excellent !",
          "Contenu": "Their customer service is excellent !They were very easy to work with and they followed thru on their promise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra F",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T22:13:12.000Z",
          "Titre": "Great charging station",
          "Contenu": "Great charging station, compact, easy to use, efficient. The only thing is that the phone charger is a little loose so it doesn’t stay at the angle I put the phone at, but it’s not bad. It still works as a clack. Also the charging for the watch and earbuds are great. No more having to center the ear buds perfectly to make sure they charge. Would definitely purchase again. Shipping and order communication was seamless and very quick. This company is really great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T22:01:34.000Z",
          "Titre": "Great product!!!",
          "Contenu": "Items came promptly and functioned as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peggy Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:24:17.000Z",
          "Titre": "I was very happy for even though I…",
          "Contenu": "I was very happy for even though I didn’t use it, (I wouldn’t work with all my devices) they did a great job helping me get my money refunded!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelley V Arciniega",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:28:05.000Z",
          "Titre": "Love this 3 in 1 charger. We bought 2 of them!",
          "Contenu": "Love this 3 in 1 charger."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T00:07:14.000Z",
          "Titre": "Quality Electronics",
          "Contenu": "So far, everything I have ordered from you company has been perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T19:53:47.000Z",
          "Titre": "Beautiful product",
          "Contenu": "Beautiful product! Love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Brice",
          "Nb_Reviews": 2,
          "Date": "2023-10-15T21:42:08.000Z",
          "Titre": "Customer service rocks",
          "Contenu": "What made my purchase a five star is the customer service experience. Originally I had a small issue and as soon as I brought it to the attention of Journey they addressed my concern timely and with a great response.  Thank you Journey!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Carrington",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:37:10.000Z",
          "Titre": "I love my laptop sleeve / wireless…",
          "Contenu": "I love my laptop sleeve / wireless charging.I didn't know it would come in handy as often as it does... and tell you what.. it comes in CLUTCH!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID FERRIER",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T21:49:53.000Z",
          "Titre": "Organization and Efficiency with Clean Lines and minimalist design",
          "Contenu": "This keeps my “at home office” (kitchen island counter) neat, clean and organized. No cords dangling everywhere and the hidden flap to hide bills, invoices and paperwork is perfect to hide clutter and keep things in place!  Great find!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Murphy William",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T20:37:33.000Z",
          "Titre": "Excellent Magsafe Wallet",
          "Contenu": "Excellent Magsafe Wallet!  I've been looking for a decent magsafe wallet that could carry at least 5 cards, and felt secure when attached to my phone.  This is by far the best I've found.  Absolutely recommended."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alex James",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T15:19:45.000Z",
          "Titre": "Great company with innovative products",
          "Contenu": "Great company with innovative productsHave been really impressed with my journey chargers and desk mats and would recommend them every time.In addition, have been impressed with my recent interactions with their sales team as they resolved my returns request in a no fuss manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ERICK CARLSON",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T15:19:05.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! Needed a replacement part and they took care of it, no questions asked!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T12:39:15.000Z",
          "Titre": "Thank you",
          "Contenu": "The wrong item was shipped by the expediting company, it was quickly replaced with the correct stand. Thank you for the friendly and prompt service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Poe",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T18:48:51.000Z",
          "Titre": "Could not recommend more highly",
          "Contenu": "Could not recommend more highly.  Fast shipping and the product has been essential for delivering on extremely rough roads."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S. Morgan",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T00:43:58.000Z",
          "Titre": "Excellent Product Outstanding Customer Experience",
          "Contenu": "This is truly an excellent quality charger! However, the outstanding customer service is what really sets Journey apart as a company. I had some questions and an issue with a charger I received as a gift and the customer service went above and beyond to answer my questions and provide a solution. They were highly responsive. It is so rare to find a company that truly cares about its customers and I will be purchasing my charging products from Journey from now on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kent McKeaigg",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T19:38:54.000Z",
          "Titre": "Prompt and thorough!",
          "Contenu": "I had a specific problem and although it took a few emails for me to explain it well, the problem was solved. They were quick, actually way quicker than I thought. They quickly responded to my follow-up emails trying to explain it and best of all they are shipping me the part that broke (just the clip) for free. I feel really happy and the whole experience was way better than i thought. I thought I was just going to have to buy another one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhonda Collur",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T02:23:54.000Z",
          "Titre": "I purchased another product it was not…",
          "Contenu": "I purchased another product it was not great. Got yours and love it. Going on my first trip and will see how it does!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T20:07:30.000Z",
          "Titre": "needs minor improvements",
          "Contenu": "Great product just wish it came with the wall plug instead of charging you more money to get a power source since the end plug is not a USB, you have to buy the Apple specific plug."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan B",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T22:32:36.000Z",
          "Titre": "I've made a couple purchases through…",
          "Contenu": "I've made a couple purchases through Journey and both are very high quality products. Would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kerri Bock Burg",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T01:00:10.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. fast shipping !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Derrenbacher",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T01:30:53.000Z",
          "Titre": "High marks for Journey!",
          "Contenu": "Product performs as advertised!All my  “I” products - phone, watch and ear buds are charged quickly while stationed on a neat stand with no messy wires to deal with!I have purchased two one black, one white and delivery was prompt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T14:52:40.000Z",
          "Titre": "Best customer service!",
          "Contenu": "First off the product is amazing, without failure. Secondly, if there are issues with returning, exchanging, delivery because of an address error on my part, I've never had such a positive and prompt customer service conversation. They get the job done and I wish other retail companies could function this efficiently and kindly. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris H",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T00:27:44.000Z",
          "Titre": "Exceptional product and customer service",
          "Contenu": "I was given the ALTI Desk Mat as a gift, having seen it advertised on Instagram and adding it to a wishlist. It looked great on my phone but I didn't hold too much hope, having dealt with some disappointing things from IG before. This, I'm pleased to say, was the absolute exception and exceeded my expectations entirely. The desk mat itself is exactly what I wanted. I've gone through many in my years, including fancy Vitra ones. All have had issues but this one is just right. I'll leave the details to reviews elsewhere but they are all right - the thing is lovely.I had one issue with the charging pad but, having contacted Journey to raise the issue, they replaced this immediately and for free. The replacement worked like a charm. What was particularly exceptional was the speed, efficiency, friendliness, and knowledge of the support/sales staff. It really was a breath of fresh air and something I'd almost forgotten is possible!I don't generally leave reviews but the quality of product and service meant I felt I should here. Thoroughly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Victor",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T19:37:20.000Z",
          "Titre": "Throughout the shipping process I was…",
          "Contenu": "Throughout the shipping process I was notified and it was delivered exactly when expected.  I love how I can easily charge my phone, apple watch and airpods without so many cords!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat H, Philadelphia, PA",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T22:02:31.000Z",
          "Titre": "Customer service was excellent.",
          "Contenu": "Customer service was excellent when I encountered a pricing issue at ordering due to user error. The response time could not have been faster with personalized, helpful attention. Well done, Journey team. I'm a happy customer and looking forward to your new product pipeline as it develops and comes to market."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Goodhue",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T23:45:48.000Z",
          "Titre": "New Charging Station",
          "Contenu": "This charging station is the perfect size for next to my bed and it charges my iPhone and Iwatch at the same time and it looks great too."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Janet Curry",
          "Nb_Reviews": 4,
          "Date": "2023-11-20T00:30:55.000Z",
          "Titre": "Easy to navigate sight & timely deliver…",
          "Contenu": "Easy to navigate sight & timely deliver But most importantly I love the products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MBCA",
          "Nb_Reviews": 6,
          "Date": "2023-08-14T00:04:47.000Z",
          "Titre": "Well made",
          "Contenu": "Well made, quality product, that was shipped and delivered quickly.My primary reason for buying this product was the Mag-Safe charging feature, which reduces desktop clutter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Guadagnino",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T01:35:25.000Z",
          "Titre": "Great Design Great Product",
          "Contenu": "Your product is beautifully designed, well-made, and completely reliable. I wanted to make sure I bought some thing that was made in the United States, and I am glad I invested in this product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adele M Wolff",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T00:18:20.000Z",
          "Titre": "The charger is very useful for all of…",
          "Contenu": "The charger is very useful for all of my electronics even when I travel.  I can charge my devices without any problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D A Penland",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T21:35:44.000Z",
          "Titre": "Everything was exactly as advertised!",
          "Contenu": "Everything was exactly as advertised!Have to say I was skeptical from past internet purchases, but JOURNEY exceeded my expectations. Will purchase a couple more for other vehicles."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sal Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T00:04:52.000Z",
          "Titre": "Great Wallet product",
          "Contenu": "Strong build construction, I am enjoying using the wallet for daily use.  Stays attached to my phone throughout the day and it is easily removable for charging or mounting."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kim StJohn-Bond",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T13:15:02.000Z",
          "Titre": "Very helpful after care service",
          "Contenu": "I purchased the 3-in-1 charging station for my iPhone 11 not realising my phone wasn’t compatible with the magnetic connection. I contacted customer services and there was no hesitation in sending me the magnetic rings I needed. They responded very quickly and efficiently. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jane Williams",
          "Nb_Reviews": 3,
          "Date": "2023-08-07T16:58:33.000Z",
          "Titre": "Finally! A quality charging station for home and on the go!",
          "Contenu": "I ordered two of the magsafe charging stations, one for home and one for my travel bag. It’s small enough to just throw in a bag, and takes minimal space on my nightstand. It also has only one cable, so no more packing a bag ‘o cables!When I opened the package I was blown away by the quality of the packaging and the whole presentation. This is clearly a company that cares!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eryn",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T18:17:51.000Z",
          "Titre": "Great Device and Customer Service",
          "Contenu": "Bought one and was having intermittent charging issues. Didn’t send in a complaint only left a 4/5 star review. They reached out and helped me to fix the issue. The device is great and so is the customer support. 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T22:44:40.000Z",
          "Titre": "Just what I ordered and came on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eee- Uplifted Productions, LLC",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T07:50:53.000Z",
          "Titre": "Car chargers were perfect",
          "Contenu": "Car chargers were perfect! Great quality and design. Only thing is the included bracket for the round air vents could not be used in one of my cars. I did manage to get the hook to clasp and tighten without it though."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pam",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T18:13:27.000Z",
          "Titre": "Great customer service!",
          "Contenu": "The charging station I ordered did not work with my phone and they responded immediately and sent me magnetic rings for free to make it work.  Excellent customer service and I love my charging station!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel S.",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T19:41:00.000Z",
          "Titre": "Best MagSafe 3 in 1 charger I have Owned",
          "Contenu": "Great product,  nice Apple like packaging and well built. Charges, my iPhone, Apple Watch to 100% every single time even when I go to bed late and they may be on the charger for only 4-5 hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grateful Mom",
          "Nb_Reviews": 4,
          "Date": "2023-10-03T01:56:50.000Z",
          "Titre": "The all-in-one cordless charging…",
          "Contenu": "The all-in-one cordless charging station has significantly reduced the stress an unsightliness of a bunch of cords.  I love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 8,
          "Date": "2023-12-13T02:34:32.000Z",
          "Titre": "Awesome product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jared B.",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T21:44:28.000Z",
          "Titre": "Awesome product and quality",
          "Contenu": "Awesome product and quality! 100% would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 9,
          "Date": "2023-11-16T16:02:51.000Z",
          "Titre": "Great customer support with care!",
          "Contenu": "Great customer support with products that are carefully designed and engineering for the best performance with your iPhone."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "E Harman",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T14:05:03.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service. I had a problem with my charger and they responded the same day and got it resolved so quickly and brilliantly. Great product and even better customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martha Hosey",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:57:43.000Z",
          "Titre": "Service was great",
          "Contenu": "Service was great!  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marilyn Bump",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T00:44:25.000Z",
          "Titre": "Great buying experience",
          "Contenu": "Great buying experience.  Love the product. I’m just really very, very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brent",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T00:16:43.000Z",
          "Titre": "Perfect",
          "Contenu": "Perfect!  Exactly as described.  Also a huge space saver!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Anderson",
          "Nb_Reviews": 11,
          "Date": "2023-10-20T19:52:35.000Z",
          "Titre": "Compact and efficient",
          "Contenu": "Love that I can charge three devices so neatly and efficiently from a space and use perspective."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donnad",
          "Nb_Reviews": 4,
          "Date": "2023-11-15T21:34:37.000Z",
          "Titre": "I really like have one place to charge…",
          "Contenu": "I really like have one place to charge multiple items without so many cords and cables.  I liked mine so much I got one for my daughter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Cummings",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T17:36:04.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Thank you for sending a free replacement part for my car mount charger which I love! Appreciate the prompt customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CYNTHIA",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T16:06:49.000Z",
          "Titre": "I absolutely love the 3 in 1 charger",
          "Contenu": "I absolutely love the 3 in 1 charger! It’s very stylish and functional. My wife likes it so much that she’s claimed mine for herself. I had to buy two more, one for home and the other my my office at work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Duncan",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T23:36:56.000Z",
          "Titre": "Journey stands behind their products",
          "Contenu": "Journey stands behind their products. Twice I have had the small clip on my car mount charger break. The piece that clips to the air vent. Twice they have sent me a replacement clip free of charge, and both times it was shipped right away. I will continue to do business with Journey. Great company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Pyzdrowski",
          "Nb_Reviews": 4,
          "Date": "2023-07-31T21:04:49.000Z",
          "Titre": "I had a problem with the first…",
          "Contenu": "I had a problem with the first shipment. Part of the device didn't work properly but after I contacted customer service, they corrected the problem immediately and sent me a new 3 in 1 charger that works perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Regina A Catequista",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T20:20:12.000Z",
          "Titre": "Everything Under One RoofCheck the product online",
          "Contenu": "Check the product online, amazed how convenient to charge all your phone and its accessories in one gadget. As easy as 123, how convenient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna Maria",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T20:08:14.000Z",
          "Titre": "Love it!",
          "Contenu": "Love it!Modern look small and fast charging.Referring friends"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albert",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T19:01:08.000Z",
          "Titre": "Journey Official means excellence",
          "Contenu": "I bought a quality product and I am very pleased with its performance!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne Leigh",
          "Nb_Reviews": 4,
          "Date": "2023-08-06T22:56:40.000Z",
          "Titre": "The bomb!",
          "Contenu": "The iphone, AirPod, Apple Watch charger combo is amazing! I’m thinking of buying one for every friend for Christmas. Top quality!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-11-09T22:43:41.000Z",
          "Titre": "Good quality",
          "Contenu": "Overall, impressed with the quality.Both the Qi, & MagLock are solid!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EB",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T21:32:50.000Z",
          "Titre": "First rate service",
          "Contenu": "First shipped item never showed up, but customer service didn't hesitate to re-send immediately.  First rate service. Item is fantastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beverlee Manis",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T00:30:35.000Z",
          "Titre": "Just what I wanted by my bed",
          "Contenu": "Just what I wanted by my bedroom night stand"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Liddell",
          "Nb_Reviews": 5,
          "Date": "2023-11-18T16:38:20.000Z",
          "Titre": "Great design",
          "Contenu": "Great design. Now I can charge all my devices in one place and accessible on my bedside table."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nakesha S",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T17:55:25.000Z",
          "Titre": "Amazing products!!",
          "Contenu": "Journey’s timely delivery is amazing. Their products are also amazing. I’ve purchased a trio charger and a car charger and both products are GOLDEN!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Thornton",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:58:53.000Z",
          "Titre": "Ease of ordering",
          "Contenu": "Ease of ordering, timely & proper delivery, excellent product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DONNA",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T19:21:22.000Z",
          "Titre": "Most convenient charger ever",
          "Contenu": "I love my purchase from you.  I like charging my watch and phone at the same time in a compact way!   Perfect!  Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin Ramirez",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T02:34:26.000Z",
          "Titre": "Great product",
          "Contenu": "Great product.  Makes u huge difference and wireless charging is a win-win!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jason Comfort",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T10:35:21.000Z",
          "Titre": "Nothing is too much trouble for these…",
          "Contenu": "Nothing is too much trouble for these guys. Had a faulty case they replaced it in 10 days. Great service and a really good quality case. Highly recommend. Thanks Journey."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Fite",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T18:00:59.000Z",
          "Titre": "Car charger is exactly what we needed",
          "Contenu": "Car charger is exactly what we needed. The magnet is very strong and hold phone in place."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T21:42:23.000Z",
          "Titre": "It works great and came quickly",
          "Contenu": "It works great and came quickly.  A helpful way to keep organized and keep phone and ear pods charged."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rex Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T22:56:33.000Z",
          "Titre": "Questions/concerns?  They're ON it.....",
          "Contenu": "They got back to me FAST when I had a question about iPhone 15 pro compatibility."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "coy troxell",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:22:37.000Z",
          "Titre": "Got my things in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Hartmann",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T17:07:30.000Z",
          "Titre": "LOVE the quality of this desk mat",
          "Contenu": "LOVE the quality of this desk mat. It feels like an Apple product, even down to the packaging."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Pruett",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T20:56:19.000Z",
          "Titre": "Your iPhone MagSafe charger flex vent…",
          "Contenu": "Your iPhone MagSafe charger flex vent mount was just what I've been looking for.  It does not slip off.  I can set it to the left of the steering wheel where I can just glance at the map.  The A/C keeps the phone cool on the 90+ weather.  Perfect.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrian Vega",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T20:01:21.000Z",
          "Titre": "Great product - sleek design",
          "Contenu": "Great product! Well designed and craftmanship.  Strong magnet hold."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TK B",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T17:40:01.000Z",
          "Titre": "Great product",
          "Contenu": "Great product that does exactly what it says it will do. Nice strong magnet, feels solid, charges what it should charge. I'm very happy."
        }
      ]
    }
  ]
}