{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "junglescout.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "CJ",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T20:35:25.000Z",
          "Titre": "Estimates are wildly inaccurate.",
          "Contenu": "***Avoid this company***Estimates are wildly inaccurate.The estimates are incredibly inaccurate. I paid for a year of service but soon realised that the estimations were way off. I could have accepted up to a 20% difference, but most of them were showing over 5 times the actual sales at the very least. The worst case was more than 100 times off.When I contacted customer service about the issue, they simply blamed Amazon, saying they were only displaying the sub-category data. It would have been much better if the software showed no data at all, rather than providing such wildly inaccurate figures.They have now updated me 4 months later saying they have \"fixed\" the issue. This company has cost me thousands with their issues and then had the cheek to offer me 2 months free as \"compensation\"."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Khalid Dawodzai",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T17:39:17.000Z",
          "Titre": "Please sent me more videos to improve…",
          "Contenu": "Please sent me more videos to improve my skills in jungle scout I don’t find products until Thanks"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mesut",
          "Nb_Reviews": 4,
          "Date": "2023-07-25T15:51:14.000Z",
          "Titre": "They don't give your money back. Avoid! they are scammers",
          "Contenu": "They claim on their website that they offer a money back guarantee if you cancel your membership during the 7-day trial period. It's a complete lie. I canceled my membership from the account setings before 7 days. As the money has not been returned to my bank account yet, they have not made any notification that they will return the money. Customer service did not respond to the e-mails that I sent to them. Avoid at all cost, they are scammers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam P",
          "Nb_Reviews": 3,
          "Date": "2023-05-11T04:17:44.000Z",
          "Titre": "Customer service is the worst!",
          "Contenu": "Customer service is the worst!This site crashes every single day. On top of that the Inventory Manager doesn't work correctly as advertised. I'm constantly running out of stock. I've been trying to get answers as to why I'm paying for a software that doesn't work. I get that software sometimes has issues but the fact that customer service can just completely IGNORE YOU makes me believe that this is just a complete scam."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Pietro",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T21:43:20.000Z",
          "Titre": "i have been a client with them for 5-6 years",
          "Contenu": "i have been a client with them for years. spent around 1500$ in subscriptions and software.i have chrome extension (full) and did few years of yearly web app subscription.so tired of all the missing data,missing infos, software not working and always needing to contact assistance. today  I decided to leave the software and go with other companies."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mohamed  Jama",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T09:26:32.000Z",
          "Titre": "Big scam.",
          "Contenu": "I am concerned that your may have charged my credit card without my permission. I have since switched to Helium 10. I would appreciate it if you could investigate this matter and provide me with an explanation."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris Sega",
          "Nb_Reviews": 3,
          "Date": "2023-04-22T20:13:41.000Z",
          "Titre": "Not fit for UK market,",
          "Contenu": "Not fit for UK market,Very few items actually have data against them in the Uk market. The opportunity finder is mostly branded cosmetic and misspelled Amazon searches. I used the suite for 2 weeks and couldn’t work out what benefit it actually serves as it seems completely tailored to the US market.Customer Service copy and paste responses from their help section and are no real help.All in all it cost me £55-£60 so not a complete loss but I would warn others that if you don’t get on with their programme in the first week cancel asap as there is no refunds past that point."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "Kyorin Shin",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T04:51:17.000Z",
          "Titre": "I am not sure whether you liked or…",
          "Contenu": "I am not sure whether you liked or learnt to cheat your customers but your answers look like unfaithful. I asked why your tool gave me wrong information. Your answer is nothing about that but you said wrong story."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Matjaž Gojkošek",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T20:30:48.000Z",
          "Titre": "Very helpful tool if it would work…",
          "Contenu": "Very helpful tool if it would work correctly. When comparing Jungle Scout Data with our client data there is clear discrepancy which shows that JS data is just estimation and not reliable."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Rostyslav Kuzmych",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T08:42:37.000Z",
          "Titre": "Customer support ignores clients. JungleScout may not provide purchased functinality",
          "Contenu": "The functionality of the site is pretty good.The customer service is awfull. I have been changed for the subscription and basically could not use purchased functionality due to Jungle Scout bug.A day after customer service fixed this bug. But when I asked about moving my subscription to the other deadline  I was simply ignred by them. I asked them to add one extra day of active subscription as I did not have an opportunity to use JungleScout features due to their bug. Double ping message did not help.So, you need to understand that you as their pottential and actual customer can be ignored by support. Also, there is a chance that you will be charged for the service and will not have an opportunity to use them!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Ruthiramoorthy Selvarasu",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T06:56:43.000Z",
          "Titre": "Since Feb 28,i am trying to Sync my…",
          "Contenu": "Since Feb 28,i am trying to Sync my Amazon Account.It is not happening. Raised a ticket, not nothing helped out .The Customer service team does not care about our Experience .they close the ticket without resolving the issue."
        },
        {
          "Note": 1,
          "Lieu": "ID",
          "Pseudo": "Horny Devilco",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T10:00:51.000Z",
          "Titre": "If I could leave no stars I would!",
          "Contenu": "If I could leave no stars I would, Free trial is a scam. Selected the 1 month option 7 day free trial and ive just been billed instantly for £289.35 with no pre warning! I've now gone overdrawn and no contact from JS!PS. you cannot even use JS without an amazon sellers account which I do not even have yet as we only set our company up yesterday! I literally hate it when companys do you over like this - its not on at all. I'll be spreading the word to NOT use jungle scout to all of my followers in future. ITs a shame because it had such great potential."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Colby Massy",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T03:09:54.000Z",
          "Titre": "Worst customer service ever and…",
          "Contenu": "Worst customer service ever and extremely greedy. I accidentally picked the wrong subscription plan for a year when I wanted to do it for a month and was trying to cancel it and get my money back, and they refused to refund me for a service that I'm not going to use for a year. This is very sh..ty. I will never use them anymore. I swear I will not let this go until I get my f...ing money back"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Yesenia Juarez",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T21:45:02.000Z",
          "Titre": "They did not solve my doubts",
          "Contenu": "Good afternoon! They did not explain to me how we would apply the discount manually?Can you help me know how much I would pay monthly?thank youThey just told me that they would contact me. and they did not allow me to send an email with more doubts.Please help me with my doubts and contact me thank you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amer Elahi",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T21:33:22.000Z",
          "Titre": "Need 8 hours to resolve the issue",
          "Contenu": "Need 8 hours to resolve the issue. I suggest that they should have customer service via phone. Save a lot of time"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "John Adams",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T22:49:11.000Z",
          "Titre": "Terrible experience"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hortense Ghemmegne",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T21:52:13.000Z",
          "Titre": "The problem hasn’t been resolved",
          "Contenu": "The problem hasn’t been resolved. I still can’t login to my account and $69.00 was retracted from my account for the second time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria Tomassone",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T13:21:54.000Z",
          "Titre": "I would need Youtube tutorials or a…",
          "Contenu": "I would need Youtube tutorials or a phone call.  I do not know how to do analysis of products in Block"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Shoukat Ali",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T10:44:24.000Z",
          "Titre": "I didnt use it properly",
          "Contenu": "I didnt use it properly. Whenever i log in to it the full white screen pops up and shows nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richdan Llc",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T21:24:09.000Z",
          "Titre": "not able to use features always have to…",
          "Contenu": "not able to use features always have to send an email for glitches"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Gestoramazonviking",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T16:29:05.000Z",
          "Titre": "So far it has not helped us at all.",
          "Contenu": "Bad. The reports do not match. On the Jungle platform our products do not load.So far it has not helped us at all."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Krishan Arora",
          "Nb_Reviews": 4,
          "Date": "2022-08-09T18:00:00.000Z",
          "Titre": "I signed up with jungle scout just over…",
          "Contenu": "I signed up with jungle scout just over a month ago, One of the main functions is synching your inventory so you can easily list and send data with a click in my case that my inventory is not synching with amazon, I have opened a few tickets and keep chasing them up but the only answer I get is someone is working very hard to fix the issue . CLEARLY NOT WORKING HARD ENOUGH because its been over a month and nothing has been fixed . Very dissapointed ."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Balwinder Singh",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T17:04:56.000Z",
          "Titre": "Membership rates are too high"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MMSD",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T21:27:55.000Z",
          "Titre": "I created a case more than 20 days ago…",
          "Contenu": "I created a case more than 20 days ago as there is a big problem with the extension that prevent accurate estimates.When I keep reaching out for resolution , I keep getting a canned answer saying they are working \"hard\" on the issue (Like other customers putting a complaint have been saying as well)..Very bad customer service.UPDATE : Jungle Scout technical reached out by email after 25 days of \"no news/fix\" and the issue is still not fixed. Useless tech support .If you expect customer support/resolutions from Jungle Scout, forget about it. Not worth paying the premium prices with no support. I cancelled my subscription."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "anthony",
          "Nb_Reviews": 3,
          "Date": "2022-02-24T09:47:32.000Z",
          "Titre": "Not recommand",
          "Contenu": "1- sales estimator is completely inaccurate. Estimated 40 sales a day while un real is 2.2- when i contact the team, they appologies but Do nothing.3- they proposed a spécial price for this month to apologies their mistake but was credited the regular price...100% disapointed. Pour le prix payer, le service est loin d'être à la hauteur..."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "alert hajdinaj",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T14:22:04.000Z",
          "Titre": "This is my first 1 star review",
          "Contenu": "This is my first 1 star review, but I have to write as I asked for help to find a product but no help provided. Very hard for to find a product so a guide or some other extra tips would have been handy and not only to watch the videos. Hopefully jungle scout improves on this ."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "H Mentions",
          "Nb_Reviews": 2,
          "Date": "2022-02-11T07:47:06.000Z",
          "Titre": "Delete our account because they can't fix a bug. How ridiculous!",
          "Contenu": "Can't fix a reporting bug after 6 months and keep pushing us back unless we sent follow up email again. After 6 whole months of \"we are working on it\" eventually they decided to jump the ship and cancel my subscription. They deleted the whole account and we lost all our data. THIS IS BEYOND RIDICULOUS!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LaTrese",
          "Nb_Reviews": 3,
          "Date": "2022-03-17T15:28:41.000Z",
          "Titre": "my extension never connecting to Amazon site, so frustrating.",
          "Contenu": "I signed up for Jungle Scout for a month to give it a try and I am thoroughly disappointed. I was not able to launch not 1 product the whole month due to my extension never connecting to Amazon site, so frustrating. I never saw the JS icon in the right top hand corner as seen on all of your tutorials (which I have watched HOURS of. This whole month was a big waste of time and money which defeats the purpose). I have put in work orders to get help with this to no avail. I had Big Hopes that Jungle Scout would work for me. Oh well on to the next."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Juan Enriquez",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T19:32:17.000Z",
          "Titre": "Can't log in",
          "Contenu": "Can't log in. Every time I try, I have to change my password."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Mansoor Mudassar",
          "Nb_Reviews": 1,
          "Date": "2021-01-27T06:12:32.000Z",
          "Titre": "I lost two professional accounts and…",
          "Contenu": "I lost 3 professional accounts and around 300$ as my account got blocked right after creation. Your team accused me of selling it, they think I am a liar & didn't want to listen to the customer. JS ruined 3 days of my life. All they give a bot reply that you break our TOU. There should be a human to at least listen to customer"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Raza Iqbal",
          "Nb_Reviews": 11,
          "Date": "2021-04-02T08:19:31.000Z",
          "Titre": "Login errors",
          "Contenu": "I subscribed for a monthly subscription but I dont know due to security reasons my Access is denied and thats a big problem, guys on chat cant solve the issue so i have to email them and wait for their response, its irritating when you are in a mood to work and you cant use a service which you have paid for"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alex lovell-hewitt",
          "Nb_Reviews": 13,
          "Date": "2020-06-15T16:30:56.000Z",
          "Titre": "Waste of time and money",
          "Contenu": "Signed up for this to research a product line , was sold on their promise to deliver all the analysis on all amazon products and departments etc ...Doesn't do industrial products , doesn't load on European sites doesn't do alot for me basically !might be okay if your looking for a white label or dropshipping opportunity for some chinese TAT....Waste of time and money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Parvaneh Eskandani Behnam",
          "Nb_Reviews": 1,
          "Date": "2020-06-29T20:37:47.000Z",
          "Titre": "Trouble logging in right after purchase and no customer support!",
          "Contenu": "Just signed up and the username and password does not work to log in! I received no email for the receipt of my transaction for JS + Chrome Extension purchase, and the request for new password email does not send the email!! The customer service is very poor. Very disappointing as a first time user which has took an hour of my time just to log into the tool."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Erik",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T01:06:47.000Z",
          "Titre": "I don't think the Jungle scout team has…",
          "Contenu": "I don't think the Jungle scout team has bad intentions, but I do believe they mis-represent the risk involved in selling private label products on Amazon. Their case studies show it to be a simple colour-by-numbers process. That may be somewhat true for e-commerce experts or a few lucky newbies. I believe most people who try to follow the simplistic recommendations on their blog will lose money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "j.j",
          "Nb_Reviews": 2,
          "Date": "2020-01-12T08:41:38.000Z",
          "Titre": "Scam took my $588.00 dollars right…",
          "Contenu": "Scam took my $588.00 dollars right before my little boy’s birthday party.No one answered me back,they are saying the whole company is at an event.I didn’t authorize $588.00 and I’m in my 14 day refund guarantee,so why not just refund me back instead of sending duplicate emails that aren’t helpful at all.SCAM SCAM SCAM SCAM SCAM SCAM SCAM SCAM SCAM SCAM BEWARE BEFORE GIVING THESE CROOKS ACCESS TO YOUR CREDIT CARD !!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "winnie umulisa",
          "Nb_Reviews": 1,
          "Date": "2020-04-29T16:22:25.000Z",
          "Titre": "It's clearly a scam!",
          "Contenu": "It's clearly a scam!! I purchased  a jungle scout & extension yesterday and paid $49 as a trial. My bank called this morning to warn me about a Fraud Alert. I can't even login now?? I literally wasted my $49. Please, be careful with which website you give your bank details too. Fortunetly for me my bank blocked them from taking $ 588 from my account. I Will use other alternatives to learn about selling on Amazon.. The company should be ashamed:("
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Hans Rosenberg",
          "Nb_Reviews": 1,
          "Date": "2020-03-18T21:33:15.000Z",
          "Titre": "Scammers with terrible customer service",
          "Contenu": "Customer service is terrible. I bought their 600 usd product for one year. I found out that selling through amazon is not what I want to do and asked them to cancel the yearly subscription. They wrote me back that they did. Now I just received an email they are going to continue my subscription in a few days, meaning they will subtract another 600 usd.It seems these people are only out for one thing: Get your money. They don't care about anything else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ty Kruz",
          "Nb_Reviews": 1,
          "Date": "2020-05-29T17:06:09.000Z",
          "Titre": "This is horrible",
          "Contenu": "This is horrible! I have sent 3 emails & 1 ticket to get a refund issued and no one has responded! They don’t have a phone number only email which they never respond!! I need a refund ASAP if anyone can help me! Please please, that’s $600 that’s gone to waste. & it clearly says on their website within 14 days you get a full refund guaranteed but that is all lies. I would greatly appreciate my refund please !! My name is Tyler Wallace. My ticket reference number is (209091)!! Please help !!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Windebank",
          "Nb_Reviews": 1,
          "Date": "2019-10-27T01:13:10.000Z",
          "Titre": "Was a fine working product that worked…",
          "Contenu": "Was a fine working product that worked well for me for about a year when it was under the JumpSend name.  But then after they switched from JumpSend to Jungle Scout, things changed, especially the customer service.  Company now seems to be just another cheap bait and switch company that has a genuine hatred for their customers.  Too bad I made an investment of time and effort into these clowns over the past year before figuring this out.  Oh well... live and learn."
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Lasmiranda Densivilja",
          "Nb_Reviews": 2,
          "Date": "2020-01-15T08:46:49.000Z",
          "Titre": "JungleScout charging Bank Account without permisson or subscribtion",
          "Contenu": "Worst service ever. They use 14-Day Trial with money back guarantee to catch customers. What I can guarantee you is that even if you unsubscribe, request and get a refund, they will charge you again in the next month.I have tested this with two different accounts / emails and banking data. On both accounts they still proceeded to grab money from my bank account without any permission or active subscribtion.This is what i call criminal behavior. Absolute unserious company."
        },
        {
          "Note": 1,
          "Lieu": "MT",
          "Pseudo": "Monika Vicci",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T14:07:45.000Z",
          "Titre": "Terrible software",
          "Contenu": "Terrible software, emails are not optimized / responsive. There is just so many bugs with formatting.Also, it is not personalized at all. Even when a person has a name filled in ihis Amazon account Jungle Scout will address him as \"Hi Customer\".It is a terrible software with ridiculous bugs everywhere.Do not recommend at all."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2020-07-29T10:34:08.000Z",
          "Titre": "misleading information",
          "Contenu": "misleading information, if you find a high demand product on search but then check on the extension it shows different information. I also found their data is way off reality after checking with products i am associated with. junglescout is way behind in listing optimisation much better tools out there."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Cihat",
          "Nb_Reviews": 1,
          "Date": "2019-10-05T10:53:21.000Z",
          "Titre": "Important!!!!",
          "Contenu": "Dear Junlge scout team, you withdrew money from my credit card for no reason!  I have not used Jungle scout for almost 1 year.  please transfer my money back.  you can contact very badly no hotline only email and you do not answer on email.  you draw money from accounts and give the people no answer if they want their money back."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Moussa  fouad Mohamed",
          "Nb_Reviews": 1,
          "Date": "2021-06-13T17:50:09.000Z",
          "Titre": "I am french personne",
          "Contenu": "I am french personne.  I dont Know thé tools in english. Every thing is in english.  For ex i receive this e-mail in english. I want to start a seller central amazon but i have alot difficult.If i know jungle scout is in english i will Nevers buy. Thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Fajgenbaum",
          "Nb_Reviews": 1,
          "Date": "2018-10-16T13:51:53.000Z",
          "Titre": "the only good thing is their…",
          "Contenu": "the only good thing is their advertising of the extension,  but in reality it doesnt work like they say, its crashes and doesnt let you work, you have to do many time the same thing until the extension stops crashing and closing. i woulnd recommend this, there are many option better than this. and they dont have a phone number for costumer services and where not helpfull by email. in one hour it crashes and closes and logs you out 20 times."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Far",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T19:44:39.000Z",
          "Titre": "I was a member for almost two years",
          "Contenu": "I was a member for almost two years, and they removed my plan to charge us more without telling me. I was asking the chat agent, and she didn't even care. This is the next level of customer service and keeping loyal customers out. Very unprofessional and unethical."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2020-01-08T17:30:42.000Z",
          "Titre": "Junglescout took my money again after I cancelled",
          "Contenu": "Last month I cancelled my membership after realizing I didn’t want it and then after I personally cancelled I sent an email to junglescout asking for my refund because they offer a 14 day refund guarantee, and asked them to make sure it was cancelled. I didn’t get the full refund and I don’t know if that’s because of the conversation from CAD to USD, and now this month they took my money again without my authorization. So I had better get my money that was taken from me and it better be the full amount"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Harris",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T10:46:17.000Z",
          "Titre": "NOT RECOMMENDED",
          "Contenu": "NOT RECOMMENDED I HAVE TRIED PURCHASING THE PROFESSIONAL PLAN YESTERDAY AND MY CARD IS CONTINOUSLY GETTING DECLINED AND THEIR SUPPORT IS UNABLE TO RECTIFY IT AND TODAY I RECEIVED AN EMAIL THAT MY ACCOUNT HAVE BEEN BLOCKED UPON SHARING. LOL I DINT EVEN PURCHASE IT POOR SYSTEM"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "bünyamin Burak",
          "Nb_Reviews": 4,
          "Date": "2021-08-19T08:37:09.000Z",
          "Titre": "7 days garanti issue",
          "Contenu": "( There was a problem in here but Jungle Scout's another customer servise has already handled it )A NEW FEEDBACK HERE; JUNGLE SCOUT MANAGER WROTE ME THAT IT WAS A SIRT OF MISTAKE THEY HADLED IT. I have already checked it and it has been done!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Vishwa Chavda",
          "Nb_Reviews": 1,
          "Date": "2020-05-27T07:14:03.000Z",
          "Titre": "NO REPLY! NO REFUND!",
          "Contenu": "I HAD SUBSCIBED TO JUNGLE SCOUT ON MAY 24. MY INVOICE NUMBER IS 81FE8A47-0001. I WAS NOT SATISFIED WITH THE PRODUCT AS MANY OF THE FEATURES ARE NOT AVAILIBLE IN INDIA, FOR WHICH I SENT TICKETS FOR ASSISTANCE BUT THERE WAS NO REPLY TO IT, NOW I HAVE CANCELLED THE SUBSCIPTION WITHIN THE 14 DAY BRACKET BUT NO COMMUNICATION HAS BEEN MADE TO ME REGARDING THE REFUND, EVEN I HAVE SENT A MAIL TO THEM REGARDING THE SAME BUT THEE HAS BEEN NO RESPONSE. THE COMPANY HAS SUB PAR OPERATING STANDARDS, A SMALL LOCAL SHOP HAS BETTER RESPONSE RATE ."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mike Hiatt",
          "Nb_Reviews": 1,
          "Date": "2020-02-27T02:53:58.000Z",
          "Titre": "Customer Service Sucks!",
          "Contenu": "I am trying to sync Jungle Scout to my Amazon Seller account and can't get it to work. I have issues with my email and my Jungle Scout account that can't be solved by emails to customer support or articles they suggest. I need a live body from customer support to work this out and this asinine company can't provide live customer support. Jungle Scout talks about customer service and how improve it, well how having somebody to answer a phone. How about it Greg? You charge enough. You should be able to do this!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thayne Davis",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T20:52:46.000Z",
          "Titre": "10X more expensive than what is advertised - Beware of secret tiered pricing",
          "Contenu": "Signed up for a $34.50 a month Jungle scout promo and began using their product.  Checked my bill several months later and after the first promo month my new bill became $451 a month!  I immediately contacted Jungle scout and they said \"you are currently on a Tiered Plan which means that the price of your subscription depends on the number of orders that your Amazon Seller account has processed in the past 30 days.\"  Tricky tricky.  You cant find anything about tiered pricing on their site.  Luckily they did refund some of the months but I am still out over $4,000 in charges they will not refund.  Good products but beware of their trickery."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Juan Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2019-01-14T20:09:21.000Z",
          "Titre": "No customer service at all.",
          "Contenu": "I bought the extension, it works well. But the problem is, when the app stopped working after I switched to a new desktop, there is no answer and no help from this people. I've send them an inquiry in their url, posted a comment in youtube, and nothing. Customer service, is, as far as my experience goes, 0 starts."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Caoline Pastel",
          "Nb_Reviews": 11,
          "Date": "2020-06-03T16:36:31.000Z",
          "Titre": "VERY DES APPOINTED WITH THE",
          "Contenu": "VERY DES APPOINTED WITH THE SERVICE.. This is horrible! I have sent 3 emails & 1 ticket to get a refund issued and no one has RESPONDED! EVEN CC BECKY nnd GREG MERCER   They don’t have a phone number only email which they never respond!! I need a refund ASAP if anyone can help me! Please please, that’s £497 that’s gone to waste. & it clearly says on their website within 14 days you get a full refund guaranteed but that is all lies. I would greatly appreciate my refund please !!. My ticket reference number is (210134)!! Please help"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2019-06-11T05:19:27.000Z",
          "Titre": "Hello",
          "Contenu": "Hello, I would to just start off by saying Jungle Scout is one of the worst companies on earth. In addition to my statement, they DO NOT offer refunds. I paid 97$ by mistake thinking I could use the extension, turns out it wouldn't let me use it. I have been fighting with customer support to recieve an answer about this. There will be a lawsuit.Anyone who is out there doesn't purchase this garbage product. You are wasting your money, they have HORRIBLE Customer service. And they have inaccurate data"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2020-07-05T01:09:19.000Z",
          "Titre": "Took money out of my account unauthorised",
          "Contenu": "Signed up for monthly and they took annual amount instead - 10x what I agreed to pay for. I chose the monthly option, and it clearly stated $49/month. I proceeded with the subscription and then found that they’d taken over 400 GBP. No response so far from customer services."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laurent",
          "Nb_Reviews": 3,
          "Date": "2022-05-27T12:34:20.000Z",
          "Titre": "The software is unusable as I cant even…",
          "Contenu": "The software is unusable as I cant even log in, contacted customer service numerous times, but no response. Then charge by bank for 1 year subscription.Declining for a refund."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T19:01:46.000Z",
          "Titre": "I was informed that they solved the…",
          "Contenu": "I was informed that they solved the problem but the problem persists, I hope they will compensate me for the lack of service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2021-09-12T02:27:43.000Z",
          "Titre": "Anti-Competitive Practices GALORE",
          "Contenu": "They buy tools that function better than their own only to shut those tools down to try to force people to use their sub-par platform. Helium-10 is a far superior service to theirs, with much better training provided."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Rangel",
          "Nb_Reviews": 1,
          "Date": "2020-05-31T20:17:03.000Z",
          "Titre": "BAD COMPANY .....",
          "Contenu": "BAD COMPANY ...... THEY TOOK MY MONEY $480 DOLLARS FOR ANNUAL FEES AND EXTRA 2 MORE THINGS ETC .I HAD NOT EVEN A MONTH TO SUBSCRIBED  TO THIS PAGE . FORTUNATELY I BLOCKED MY CARD ...EMAILS NEVER ANSWER TERRIBLE COMPANY . PEOPLE SEE THE REVIEWS FIRST"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fawaz",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T15:45:37.000Z",
          "Titre": "This price is so high and I only use it…",
          "Contenu": "This price is so high and I only use it for Saudi Arabia market and there is limit features for the Saudi Arabia amazon marketI don't mind paying the full price if there is the same features for Saudi market as US market"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Iris Renee Sykes Wyatt",
          "Nb_Reviews": 4,
          "Date": "2020-04-17T04:42:42.000Z",
          "Titre": "im very disappointed because i been…",
          "Contenu": "im very disappointed because i been trying to get in contact with jungle scout customer service or support team to get back into my account by trying to resetting  my passwords no one has contacted me yet i been trying every since the 4-11-2020"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Samantha Awe",
          "Nb_Reviews": 1,
          "Date": "2018-02-03T00:13:42.000Z",
          "Titre": "the right and correct name is Junk Scam …",
          "Contenu": "the right and correct name is Junk Scam its complete bs, please make a favor for yourself and save your money after all the fake promise they made I purchase this junk and when I tried to contact them to refund me they ignore me and didn't get my money back"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jane",
          "Nb_Reviews": 1,
          "Date": "2019-01-01T16:03:03.000Z",
          "Titre": "Dont bother wasting your time trying to…",
          "Contenu": "Dont bother wasting your time trying to create an account.I was going to buy the chrome extension but couldn't create an account. If the website is this badly made it does not fill you with confidence that the product will actually be any good."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "MO",
          "Nb_Reviews": 1,
          "Date": "2018-11-24T09:18:24.000Z",
          "Titre": "Disappointed in JS",
          "Contenu": "I've been looking quite a while for some decent software for amazon product research and I ended up with JS because I believe it was the best. After using their products for several weeks I was quite disappointed. Many products they show are not what they seem to be, info is often inaccurate and many times the chrome extension doesn't work well. I've paid a couple hundred bucks and I'm very disappointed. I started using other software to compare and many worked better or gave me really interesting products that JS didn't show. Eventhough I have the pro chrome extension I use other extensions now. waste of my money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2017-01-28T16:54:34.000Z",
          "Titre": "Does not work well in the U.K./EU.",
          "Contenu": "Does not work well in the U.K./EU, rushed to market and data (or lack of) is very poor.I was told they are collecting data on a daily basis for popular products but searching through products is impossible to get a feel of which products are worth pursuing since the results are poor.For example searching for a specific keyword on amazon returns millions of results, same keyword on JS web returns less than a thousand with the same filters.Best to wait a few months until the data collection expands to a level where it is actually useful.At this stage is completely useless to us so I cannot recommend it sorry."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Abdel",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T19:07:15.000Z",
          "Titre": "I reached out for support and nobody…",
          "Contenu": "I reached out for support and nobody got back to me to help. But you guys sent me a notice to review how the support was. How was it? Garbage"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Matteo Volteggi",
          "Nb_Reviews": 2,
          "Date": "2019-07-31T14:29:54.000Z",
          "Titre": "Horrible",
          "Contenu": "They talk about free trial but before steal your money and then you can start with your free trial.I personally can do better email than the email template in jungle scout and it's full of bug.I never reccomend jungle scout."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Marc Beaupre",
          "Nb_Reviews": 4,
          "Date": "2020-08-27T17:03:05.000Z",
          "Titre": "14-day Refund is Fraud",
          "Contenu": "Jungle Scout does not honor their 14-day refund policy. They will totally ignore your emails. I sent 2 follow-ups and nothing at all. I am currently seeking a refund through my credit card company. Wish me luck!"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Rachael Minter",
          "Nb_Reviews": 1,
          "Date": "2020-02-08T11:10:25.000Z",
          "Titre": "Worst Support",
          "Contenu": "Worst Support. They charged my card for Pro Extension for whole year and my account shows in active. Ticket not replied from last 48 hrs.Will file dispute with my bank on Monday.Never use this tool. Bad Experience"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "BSST LTD",
          "Nb_Reviews": 1,
          "Date": "2018-10-31T18:02:52.000Z",
          "Titre": "Scammers : warning for those who wants to buy.",
          "Contenu": "I bought this product thinking that it will be useful. It doesn't help much and most of the times data is not showing properly. I sent mail, but no response. Then I decided to ask for refunds as it was within 14 days as guaranteed to be returning full money by jungle scout team. But all lie. No response as of now yet.Warning: if you believe that they will return full refund before 14 days if you are not happy, then forget about it.you will never get any refund. I m still waiting, but no reply as of yetI m going to register a formal complaints at financial ombudsman and police against this company.Surprisingly, there is also no contact number, Sono way you can contact."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Simon K",
          "Nb_Reviews": 4,
          "Date": "2018-09-07T14:57:45.000Z",
          "Titre": "do not give them your credit card info,",
          "Contenu": "do not give them your credit card info,i have been emailing them for over a month to cancel subscription, and i haven't heard back, their are plenty of software that do same thing if not better for much lower price."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2020-05-11T11:42:49.000Z",
          "Titre": "Junglescout automatically charged my…",
          "Contenu": "Junglescout automatically charged my card yearly even when I haven't used their services. They save your debit/credit card details and charge your account and then you have to fight to get your hard earned money back.. It's so unfair that they renew your subscription and make you pay for it even when you are not actually using junglescout. I have been trying to contact the junglescout team and have sent multiple emails (even tried contacting them on social media) but no one ever replies you. They don't have a phone number in their website for you to contact them.. They have basically taken my money and ignored me.. If a member of junglescout team is reading this, please please refund my money. Thanks."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jaspreet Singh",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T17:56:58.000Z",
          "Titre": "I was going to start using actual…",
          "Contenu": "I was going to start using actual software after using js sales estimator, but its results were off by a mile. I already have a product listed, and when sales compared with estimator, its was way off."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Noble Crow",
          "Nb_Reviews": 1,
          "Date": "2018-05-13T13:27:39.000Z",
          "Titre": "Your Internet Site is broke folks",
          "Contenu": "Your Internet Site is broke folks, cant even buy the chrome extension pack, its just loading but nothing ever happens to enter the next step or something . iwant to buy it but its not working, please fix. =D"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "shamsedinawo",
          "Nb_Reviews": 1,
          "Date": "2018-04-21T12:49:40.000Z",
          "Titre": "I wasn’t able to use my web app it has…",
          "Contenu": "I wasn’t able to use my web app it has been more than a month but I still get charged for that please just don’t charge my card no more if it’s not working I don’t see the reason why I am paying.Thanks"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Alex Burke",
          "Nb_Reviews": 2,
          "Date": "2019-03-28T08:53:38.000Z",
          "Titre": "Want to find something that really sells? Don't use Jungle Scout.",
          "Contenu": "If you really want to find a product to sell on Amazon, Jungle Scout is the last thing you use. Jungle Scout is the single reason why THOUSANDS of people lose a lot of money.Every Amazon guru out there teaches you to use Jungle Scout because they get a cut every time someone buys it. Now every single one of those thousands of people uses close to the same search metrics to narrow down a product.When you eventually launch your product, you have A LOT of competition because everyone was using the same tool (Jungle Scout), to search for a product to sell. Don't be one of those people.There are much better ways to get new product ideas. Stop chasing volume. Focus on margins and be unique. Build your own brand and expand it constantly."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Robert hamelin",
          "Nb_Reviews": 1,
          "Date": "2018-11-14T06:52:43.000Z",
          "Titre": "15 day 100% refund garenteed that bull…",
          "Contenu": "15 day 100% refund garenteed that’s a huge lie. They don’t even answer your emails also there is no phone number to call. Talk about terrible customer service not impressed at all with this sceme"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 2,
          "Date": "2019-05-24T14:12:51.000Z",
          "Titre": "I have had jungle scout for awhile now…",
          "Contenu": "I have had jungle scout for awhile now and to be honest for keyword search they are good, but they recently partnered up with jumpsend and I use them as well. Once they joined up my jumpsend started not working at all so I sent as email waited 9hrs for a response and then I responded instantly and guess what? I have waited 15hrs so far and haven't received a response back at this point I need to say this company's support team is terrible and you can only contact them by email.Jungle scouts support process is terrible my issue is still here and hasn't been a priority for this company.... If you do tend to use Jungle Scout just remember that they have terrible support, and if you have a problem expect it to be resolved in a few days not anytime soon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nefi k",
          "Nb_Reviews": 1,
          "Date": "2020-05-16T14:20:18.000Z",
          "Titre": "Horrible service. They avoided refunding you. They lie.",
          "Contenu": "I don't know how good this product is. I purchased it, under the yearly plan, on May 15th. I cancelled it the same day. I do not want the product anymore. They say 14 day money back guarantee. I am not receiving any communication from them. They only respond with an automatic reply. I have emailed them multiple times. The same reply I get from them is not doing anything. The customer service is horrible. They use chat so that they can shoo pple away. If a company really cares they'll want to hear from their clients not try to avoid them. They are just trying to take your money. They're money lovers not pple lovers. You're not who they care about. Yes business got to strive but don't be a deceiver with false promises. I learned my lesson. I wish I can show my screenshot"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Elizabeth Nyamekye",
          "Nb_Reviews": 1,
          "Date": "2018-03-03T01:01:55.000Z",
          "Titre": "I registered in UK and it doesn't seem…",
          "Contenu": "I registered in UK and it doesn't seem to deliver as I have tried to cancel and get my money back when i click on the setting there is a watershed which prevent me from going further"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Philip Xie",
          "Nb_Reviews": 1,
          "Date": "2021-03-31T06:48:52.000Z",
          "Titre": "HORRIBLE, CANNOT CANCEL, OVERCHARGE",
          "Contenu": "HORRIBLE! ABUSE SUBSCRIPTION!I tried Jungle Scout and former Jump Send for a few months and decided it didn't help me in Amazon busines, but I couldn't find a 'cancel' link in their website, after a few months of delay, I finally find out that they request subscriber to email their support and cancel. So I emailed them back in March 2019, and requested cancellation. The support desk replied and confirmed my cancellation, also promised a refund for the period I didn't use their service. But after TWO year, I am surprised to find out they are still charging me subscriptions! I contacted their support team, and they asked me to request cancellation again, and didn't acknowledge my original cancellation request. OMG, I can't find any way to cancel and I have to call the credit card company and cancel my credit card instead."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tom Mason",
          "Nb_Reviews": 1,
          "Date": "2020-02-12T19:29:08.000Z",
          "Titre": "So much for the 14 day trial period",
          "Contenu": "So much for the 14 day trial period. Tried to cancel about 5 days unto using it and no refund to credit card. Way too expensive for what you get and shady business tactics."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ainsworth Enterprizes",
          "Nb_Reviews": 3,
          "Date": "2021-07-19T17:28:40.000Z",
          "Titre": "My login keeps not taking my password",
          "Contenu": "My login keeps not taking my password.  I just tried to change my password again after doing so many times and now it says my account does not exist.HELP"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "andrei codreanu",
          "Nb_Reviews": 3,
          "Date": "2018-10-04T05:41:12.000Z",
          "Titre": "realy bad investment",
          "Contenu": "sales volume are fake, net profit its not real , sometimes it is overwritten 7 times more or less you you are not even close to make an estimate waste of my money ."
        },
        {
          "Note": 1,
          "Lieu": "AR",
          "Pseudo": "Federico",
          "Nb_Reviews": 1,
          "Date": "2019-11-23T17:13:58.000Z",
          "Titre": "Promotion are not working",
          "Contenu": "Promotion are not working. My listing is fully optimized, I am not seeing results. What you tell in videos related to giveaways is not working for me. Sorry"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nnanna Ubu",
          "Nb_Reviews": 1,
          "Date": "2020-09-13T01:57:47.000Z",
          "Titre": "I have for several weeks listened to…",
          "Contenu": "I have for several weeks listened to both your webinars and other presentations concerning sourcing, communication with the customers, knowing and applying the key words etc.  I have yet to know how to label or code or whatever that would identify my products before leaving the factory. What to do once the products hit US and how it would be identified and transferred to Amazon warehouse? How can they be secured from the factory to Amazon? Also, making sure that Amazon recognizes that the product belongs to me. Should I have a separate bank account for the Amazon business or should I give them any account?  What happens when your product gets to Amazon platform? These and other i questions constitute major concerns in this training. You cannot have the confidence to start selling when you don't have a clear picture of the movements of your stuff. Please advise me where to go and who to direct my concerns. Thanks"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Moshe Ben Haim",
          "Nb_Reviews": 1,
          "Date": "2020-11-22T06:22:39.000Z",
          "Titre": "Bad software",
          "Contenu": "Bad software. Not accurate at all, too many irrelevant functions and they are also charged me without a justification for 3 months. Not recommended"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Anya K",
          "Nb_Reviews": 8,
          "Date": "2020-03-12T09:35:43.000Z",
          "Titre": "Check all Functions in the trial!",
          "Contenu": "Signed up to predominantly use the Research keyword data tools for UK and DE categories of Shoes and Footwear and no tools worked as they should. Searches on Best selling ASINS showed 0 results in every method of searching. ASINS ranked within the top 50 some older than 5 years still showed no data. The only data available was incredibly vague and no better than using Amazon directly / Sonar. JS has no real suggestion other than to wait for them to catch up. So unfortunately i cannot comment on the rest of the functions, very disappointing but my suggestion is to use the 14 days trial thoroughly to check that all tools you need work as they should for your specific marketplace and category also checking their accuracy. Cancelling within the 14 days was very quick and easy however and i received a fast full refund. You will need to check terms of cancellation if you have this issue beyond the trial period."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nefi",
          "Nb_Reviews": 1,
          "Date": "2020-05-17T16:34:00.000Z",
          "Titre": "Horrible Service and they lie.",
          "Contenu": "This company is money hungry. On their social media page it says they are always open. I sent a message no one is replying about my refund. All i get is automatic replys. Come On. Dont trust companies that only have Chat as their customer service. I dont care how much Youtubers say the company is great. They could be getting a piece of the pie too. Dont believe \"14 day money back guarantee\". Its a big fat lie. Eventhough its the weekend I gave them all day Friday.  It really takes all day...really. I blew up their emails. No its avoidence. COVID 19 is a stress for everyone. Dont cause more stress on pple. I know your company probably money hungry because of COVID19. BUT THANK GOD you have a business. I have me myself and I. Dont play with me. Im not even using the service. Please dont try to get me by not responding to me after the 14days just to try to keep my money. Im recording everything. Dont play me."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Amir Egel",
          "Nb_Reviews": 1,
          "Date": "2021-04-28T07:04:55.000Z",
          "Titre": "My meeting was cancelled by…",
          "Contenu": "My meeting was cancelled by JungleScount one day before the scheduled time with no explanation or anyone contacting me to reschedule. 0/10"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andrew Hargreaves",
          "Nb_Reviews": 3,
          "Date": "2023-01-22T21:27:34.000Z",
          "Titre": "I wanted to pay monthly",
          "Contenu": "I wanted to pay monthly, but couldn’t do it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hannah Nguyen",
          "Nb_Reviews": 1,
          "Date": "2019-11-27T13:59:20.000Z",
          "Titre": "THIS IS A SCAM.",
          "Contenu": "THIS IS A SCAM.If you bought their 1 year plan (better deal than monthly plan), you will be stuck with it! I tried to cancel my subscription within 30 days, but they said for this deal, I had to cancel it within 14 days!!! I thought it was my fault that I missed this detail, so I stuck with this for a year without even using their service. Then today they charge my account another $100 for renewal fee to a monthly service after my subscription expired. The worst thing is their website does not have an option to CANCEL your subscription. There is NO phone number to call. And you have to email their support team to ask your money back! I am sure they will find a clever way to say NO, WE CANNOT REFUND YOU BECAUSE YOU DID NOT READ THIS... What kind of company does not allow customers to cancel their service online and automatically renew their subscription without warning???THIS IS A SCAM! AVOID IT AND SAVE YOUR MONEY!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T21:53:48.000Z",
          "Titre": "I had a bad experience with Jungle…",
          "Contenu": "I had a bad experience with Jungle Scout.  I was excited to begin my subscription. I ordered the Basic plan at $19/mo.  You might say it was my fault but I assumed that the Basic Plan included ample \"Product Research\" inquires.  It did not.  As a customer, I'm saying this could have been made much clearer to first time purchasers. Once I discovered this, I contacted you and was informed I needed to purchase the Suite Plan to obtain sufficient Product Research inquiries.  At the time, I saw it advertised for $49/mo. and requested an upgrade.  I was then informed that the price increased to $69/mo.  This looked like deceptive/false/bait&switch advertising  and I canceled everything.  This was very disturbing to me and I thought how can they treat customers like that?  If I were in upper management I would want to know this happened.  I am taking the time to write this so it doesn't happen to anyone else.  Thank you for your time, Sincerely, Andrew Agard"
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Andres Sierra",
          "Nb_Reviews": 1,
          "Date": "2018-07-14T00:22:08.000Z",
          "Titre": "sales volume are fake",
          "Contenu": "sales volume are fake, sometimes it is overwritten 7 times more or less you you are not even close to make an estimate waste of my money Honestly"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jess",
          "Nb_Reviews": 1,
          "Date": "2019-12-20T19:48:05.000Z",
          "Titre": "DON'T WASTE YOUR TIME AND MONEY",
          "Contenu": "DON'T WASTE YOUR TIME AND MONEY. Jungle Scout is a mess after they merged JumpSend, JungleScout, and others.I can't use the Launch to promote my new product ever since they merged,  there is some technical issue on their end that makes the information can't be synchronized from Amazon. Without a correct profile image, it's useless to do a giveaway on Launch (formerly, jump send). I've been asking them to fix it and they admitted there's a bug but they still haven't been able to fix such a small bug for over a month. Their e-mail templates have also been broken with regards to simple \"variable\" replacements. Something so simple, yet it's been months and they can't fix it. All I've gotten from them is daily automated e-mails saying \"Thank you for raising the issue, your issue is being investigated as VIP and we'll get back to you...\"You might want to wait till they get more stable support if you plan to subscribe to it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael Brightmore",
          "Nb_Reviews": 3,
          "Date": "2018-10-26T07:22:29.000Z",
          "Titre": "Don't waste your money if you do don't…",
          "Contenu": "Don't waste your money if you do don't expect the 14 day refund. They don't bother to contact you back! Awful customer service."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Artilleria666",
          "Nb_Reviews": 6,
          "Date": "2018-12-04T02:41:21.000Z",
          "Titre": "Be careful , scammers!",
          "Contenu": "Be careful , scammers ! , I used the free trial period subscription, I try to recover my money , I couldn't get my money back ."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jeffery",
          "Nb_Reviews": 4,
          "Date": "2022-07-19T23:58:23.000Z",
          "Titre": "Its been one month and I was told I…",
          "Contenu": "Its been one month and I was told I would receive a refund and I have not received."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JAY",
          "Nb_Reviews": 1,
          "Date": "2020-05-17T17:23:20.000Z",
          "Titre": "FAKE COMPANY and HYPOCRITS",
          "Contenu": "this company is fake and funny(sarcasim) pay attention to the reviews. The review that says THEY RESPOND QUICKLY. Its funny how that was said after my comment. This company is using their employees to write reviews or offering these pple money. The VERIFIED reviews. Also its funny how that same review was 9 hours ago and i been personally waiting for them to hit me back up about my refund for 3 days now. Im confused. Please Jungle Scout stop playing pple. Yall do Chat customer service to avoid pple. yall are hypocrites. Yall help by donating money to programs so that you can look good. I know the game. I can speak it backwards. I dont play pple I live for truth. yall are players. Stop because i can send pple the emails i been sending yall with the automatic replys yall give me to avoid me. Yeah its Sunday. But 9 hours ago yall responding to someone and Friday your responding to someone from what one of the reviews show. Stop playing with me. I been waiting for yall to respond back to me All day Friday. Come on. Ima see Monday. Please dont try to steal from me. please."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Edwar Michelena",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T16:15:16.000Z",
          "Titre": "Good service but no results",
          "Contenu": "They were very kind and quick to respond to my problem, but in the end the problem of the lack of synchronization between the videos and subtitles in Spanish was not solved. I'm honestly a little disappointed"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Jatin Dua",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T15:20:41.000Z",
          "Titre": "Please call me"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Koen Verkoijen",
          "Nb_Reviews": 1,
          "Date": "2022-03-26T12:19:33.000Z",
          "Titre": "Mediocre at best",
          "Contenu": "I used the extension for a while in order to enhance my product research. I am not satisfied with the tool. The data that is generated is commonly not accurate and you cannot accurately make conclusions based on this data. Furthermore, the data is even less accurate when you are doing research on another market than the US market. I tried doing research on the UK market, but was not able to, since the data on the UK market on Junglescout is extremely limited. Would definitely not recommend using this tool for product research."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "AN",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T03:12:31.000Z",
          "Titre": "It took me a while to get the answer.",
          "Contenu": "It took me a while to get the answer.This is a different story from this case.members.junglescout.com supports Japanese, but the content (How to guide, etc.) does not support Japanese.Therefore, it is very difficult for Japanese users to understand how to use it.I think it's a great service, so please support the guide in Japanese.Otherwise, it will be difficult to continue using it.thank you."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "orian",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T22:40:14.000Z",
          "Titre": "T is owerwhelming ,lots of new things…",
          "Contenu": "T is owerwhelming ,lots of new things for me to absorb but you are helpful and observing and im gratefull for it..What I need is the place on the pages to ask the questions .example when rewiewing the prices i came with word net ..Maybe you already explaned but i missed it and i have to go back and look again  over to find explanation of it.and are lots of pages to find and its confusing...So i need the place like this window where i can find imediate answer for the the words and frazes that you use..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ben Oliver",
          "Nb_Reviews": 1,
          "Date": "2020-08-10T22:00:32.000Z",
          "Titre": "Customer service is absolutely horrible!",
          "Contenu": "I would give Jungle Scout a better rating but customer service is horrible. If you have a problem, like the app stopped working altogether, it takes days and days of email to deal with it. If you intend to do business with people who rely on your product to do their business you need to be available, Jungle Scout is not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Millad",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T03:04:26.000Z",
          "Titre": "Update: Need a serious work on their customer service",
          "Contenu": "Edit: Finally I was contacted after a week of trying. I had to go public on the internet then I was contacted and the problem solved!BEWARE! THE SERVICE IS A SCAM.I paid for pro version and it's not activated after a week! THEY DON'T OFFER CUSTOMER SERVICE. and no emails. no ticker replied, no follow up on twitter, The FOUNDER Greg Mercer's twitter is not active and no response. The service posts some random tweets and that's it.I WISH I COULD SUE THEM."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "W. Alexander Monchez",
          "Nb_Reviews": 2,
          "Date": "2020-01-07T15:22:41.000Z",
          "Titre": "Supplier database is almost useless",
          "Contenu": "Decent product but supplier database is incredibly inaccurate and therefore pretty useless. You get all sorts of random results and you need to spend a lot of time figuring out what is accurate and not. This was the main reason I got jungle scout b/c other competitors (Hellium 10, etc.) offer better products at better prices so overall very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Neeraj Rajput",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T17:04:09.000Z",
          "Titre": "You did cancel my subscription but you…",
          "Contenu": "You did cancel my subscription but you didn't send the full amount to my account. You deducted 235/- and I don't even know why. You haven't mentioned any kind of deductions while canceling the subscription. So, please send me my full amount."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barry Shereshevsky",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T12:12:59.000Z",
          "Titre": "I signed up for the downloaded…",
          "Contenu": "I signed up for the downloaded checklist to get started and the first link to download the checklist helper took me to a 404 page that told me that page doesn't exist any longer. I emailed them and got an auto-reply. Not happy so far.I did get a response from Jungle Scout a couple of days after posting my first review and they said they would fix the link and sent me the file I was promised....so, they are back in favor with me. Good company and respond to keep a good reputation. Well Done Jungle Scout!!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Ravinder Singh",
          "Nb_Reviews": 2,
          "Date": "2019-08-10T22:33:01.000Z",
          "Titre": "i bought JS but it was not working like before.",
          "Contenu": "i bought JS but it was not working like befor. for example if i search something and click on JS extension ....then extension only shows one product's data that i clicked ..not all other products that are in similar product catagory...many times it was not showing revenue for that product whereas i found that product after applying min. revenue filter. wgen i asked other users ..recently they were facing the same problem from last week.....so i asked for money back."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Rodrigo Sandoval",
          "Nb_Reviews": 2,
          "Date": "2018-10-16T20:36:03.000Z",
          "Titre": "Niche hunter should be included in the…",
          "Contenu": "Niche hunter should be included in the cost I paid $348 usd. Tools provided with this cost are not too good for my opinion due takes a lot of time to find a specific item.I asked to JS seller representative to charge me the difference and he told me that is not possible.I aked a Niche hunter tool a 30 days free as to test it and the answer was not possible."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Adrian",
          "Nb_Reviews": 3,
          "Date": "2020-08-02T14:51:36.000Z",
          "Titre": "Shady company with shady tactics",
          "Contenu": "I bought the extension and used it successfully for 2 years but now they have decided to break the tool in the latest patches for those of us who purchased it as a single purchase item, in order to push us into their ABUSIVE yearly fee subscription. Shady tactics from a shady company."
        },
        {
          "Note": 2,
          "Lieu": "VE",
          "Pseudo": "danielrvt",
          "Nb_Reviews": 1,
          "Date": "2018-04-24T21:00:38.000Z",
          "Titre": "Too Optimistic Estimates",
          "Contenu": "Everything that is not web-crawlable is wrong, like the Avg. Monthly Sales and Revenue Estimate. I've found JS estimates to be way too optimistic. I’ve checked this many times with my products and friends products.I often find myself pulling these data from another tools, which defeats the purpose of using JS."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Miranda",
          "Nb_Reviews": 1,
          "Date": "2018-02-28T20:31:39.000Z",
          "Titre": "I purchased Jungle Scout with the Web…",
          "Contenu": "I purchased Jungle Scout with the Web Extension about 2 months ago and still have not been able to find a product. The problem is whenever I use the Jungle Scout Niche finder or Product Data Base and then go to the Web extension the information is never the same. Also when using the Web extension I notice if I search for a product group it will give me a great opportunity score but if I search again for the same product and stroll to page 2 and use the Web Extension the score will change to a low opportunity. I am so confused to what to sell at this point and have been think about canceling my subscription."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 1,
          "Date": "2019-02-20T17:15:27.000Z",
          "Titre": "Tired of N/A",
          "Contenu": "It seems like so many things I search for are NA. Like 60% of items. In addition something changed and it is more difficult to find my products that I have been tracking. Can only work on Chrome and  not safari."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2017-01-23T17:27:52.000Z",
          "Titre": "Web app should have trial",
          "Contenu": "Every product I have bought till now had a trial for 14 -21 days but your web app doesnt have which doesnt make sense. people should buy it and then refund it if they dont want ? !!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ALOHA RIGHT NOW",
          "Nb_Reviews": 1,
          "Date": "2020-01-13T20:07:24.000Z",
          "Titre": "Your support team emails are like spam…",
          "Contenu": "Your support team emails are like spam because we receive a reminder to respond almost every day. We accumulated over 20 in the last week or two."
        },
        {
          "Note": 2,
          "Lieu": "KW",
          "Pseudo": "Hassan theeb",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T11:39:29.000Z",
          "Titre": "I refunded my subscription and i still…",
          "Contenu": "I refunded my subscription and i still didnt get my money back , i have been now more than 12 days"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Luigi Orlando",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T17:19:42.000Z",
          "Titre": "Thought this program would help me but…",
          "Contenu": "Thought this program would help me but still a Struggling Amazon Seller losing money lololol"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2018-04-30T15:05:13.000Z",
          "Titre": "Fees are misleading",
          "Contenu": "The good:  the tools are really good to help filter down to some product ideas. Customer service is friendly and generally responsive .  Site has a wealth of information.The Bad:  this is where I take it from 5 stars to 2.  My first attempt at selling on Amazon was mostly learned through JS.  The problem I have is that the fees are not accurately calculated.  After several weeks and countless hours of research and product development I placed my first order based on info from the product database. It appeared from JS that I could net about $6-8 per unit after sourcing and shipping to Amazon.  The problem is that JS mis calculated fees by $6 thus leaving me with a product that will make no money. I have checked dozens of other products against the FBA fee calculator and they are way off. Mostly by 15%. Some over 20%. The mistake I made was finding the amazon fee calculator after my order was placed. I trusted JS’s info. They have skirted the problem in several emails and never addressed it head on.  It’s a problem and the info is highly misleading. To this day, it’s still a problem."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Khaled",
          "Nb_Reviews": 1,
          "Date": "2017-02-07T15:18:08.000Z",
          "Titre": "Sales predictions are way inflated",
          "Contenu": "Sales predictions / estimates are way inflated and all product selection depend on sales and revenue estimates ..."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Ernest",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T15:01:34.000Z",
          "Titre": "Very Disappointing Customer Service",
          "Contenu": "I enjoyed the software...however my annual subscription plan was upgraded without my knowledge. The customer service team only tried to sign me on to various other plans instead of addressing the issue. After being forced to choose a new plan, I was charged additional fees on my account, on top of what they already charged me for my annual subscription and the mysterious upgrade charge, with no clear explanation as to how any new charges were calculated. After a week of back and forth on email with no option to speak to someone else or escalate my concerns, I was forced to cancel my subscription due to this, which was not my intention. If it were not for this customer service experience, I would've remained a paying Jungle Scout customer. Although received I some partial refunds, only after having to ask repeatedly for them, I had to accept some charges - however there was no transparency in this whole process, none of the refunded or un-refunded amounts were clearly explained to me. And now my chrome extension is inactive - although i purchased this product as a one time charge back in 2018.  It was not part of a subscription.I'm leaving this review for current users, this will be the expectation in your near future."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Naqash khan",
          "Nb_Reviews": 5,
          "Date": "2019-01-04T17:04:32.000Z",
          "Titre": "The software is hard find profitable…",
          "Contenu": "The software is hard find profitable products to sell. It isn’t what I thought it would be."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Studio Z",
          "Nb_Reviews": 1,
          "Date": "2020-12-19T14:25:21.000Z",
          "Titre": "Your cheaper version is not very good.",
          "Contenu": "Your cheaper version is not very good.And the constant push to upgrade is annoying."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Mohit Kumar",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T21:08:56.000Z",
          "Titre": "Not worthy for Amzon.in",
          "Contenu": "Not Showing statistics for every product on Amazon.inThis issue must be fixed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ainsworth Enterprizes",
          "Nb_Reviews": 3,
          "Date": "2021-09-07T23:07:30.000Z",
          "Titre": "Different access issues",
          "Contenu": "Different access issues, frustrating.  Love the tool once get in"
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "Selina Hsieh",
          "Nb_Reviews": 1,
          "Date": "2017-10-20T06:15:39.000Z",
          "Titre": "Not worthy",
          "Contenu": "Too expensive. I am thinking of another options."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T21:07:32.000Z",
          "Titre": "How I can use the data I need help"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Adnan Ismael",
          "Nb_Reviews": 1,
          "Date": "2020-12-06T10:41:01.000Z",
          "Titre": "Doesn’t work sometimes"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Betty Dickinson",
          "Nb_Reviews": 1,
          "Date": "2021-03-06T21:18:35.000Z",
          "Titre": "Please CANCEL ALL!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Mathew",
          "Nb_Reviews": 3,
          "Date": "2018-03-21T14:18:57.000Z",
          "Titre": "Expensive one"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "jgc",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T18:28:41.000Z",
          "Titre": "It is a helpful tool for finding…",
          "Contenu": "It is a helpful tool for finding products, but sometime when you try to orded data from high to low (or vice versa), you find products that are out of order. It is not easy to extract data if you require to do additional analysis outside the given tables (lets say to analize or track in an Excel).I am not getting information on Monthly Sales or the Opportunity Score (I do not know if it is due to the type of subscription I have. The problem is that I do not know why)"
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Ariel Nadler",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T09:11:44.000Z",
          "Titre": "the comments were very detailed but…",
          "Contenu": "the comments were very detailed but confusing. at first you told me it is possible to put parent asin in the tracker and then you told me i cant. it seems like an important feature that is missing and does exist on other sites. i hope it will work out soon"
        },
        {
          "Note": 3,
          "Lieu": "AF",
          "Pseudo": "Farhad Rahmani",
          "Nb_Reviews": 8,
          "Date": "2023-08-20T07:38:05.000Z",
          "Titre": "Not good for wholesale"
        },
        {
          "Note": 3,
          "Lieu": "JO",
          "Pseudo": "Mohammad Shaweesh",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T09:45:48.000Z",
          "Titre": "as mentioned before",
          "Contenu": "as mentioned before, I'm happy with the support, but disappointed with the concept itself, how do deduct before informing me For example, Shopify gave you a clear payment plan, and send many reminder about these payments"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "d heath",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T04:59:24.000Z",
          "Titre": "Jungle Scout’s Refund Guarantee is not Guaranteed",
          "Contenu": "Jungle Scout’s Refund Guarantee is not Honored:. I signed up for Jungle scout to learn about the reseller environment. Because I couldn’t afford it, I cancelled on day 5. I checked my bank statement to find that Jungle Scout billed me for three months on DAY ONE. I went back into my JS account and their was no record of my cancellation date. I contacted their customer service, they got back to me with a lame excuse. Word to the wise - take a screenshot of your cancellation page and make them honor their guarantee.**UPDATE: Jungle Scout responded to my review shortly after my submission. They get an extra star for that. Jungle Scout also refunded me the amount that I paid. It was described as an exception, however it ought to be standard. I thanked the representative and added that it was ironic that a data company doesn’t provide account data(i.e. dates) to their customers. Once my budget allows, I would use them again. For that, another star."
        },
        {
          "Note": 3,
          "Lieu": "KZ",
          "Pseudo": "Mariya Abeldinova",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T02:51:16.000Z",
          "Titre": "What’s wrong with your website?",
          "Contenu": "Hi! What's wrong with your website? It doesn't show anything at all! It won't open!  It's been almost a week, I can't open it, it's not being sent!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T22:48:48.000Z",
          "Titre": "I would have liked an online demo of…",
          "Contenu": "I would have liked an online demo of your products but you don't offer that."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Steve Simmons",
          "Nb_Reviews": 8,
          "Date": "2022-09-10T13:46:08.000Z",
          "Titre": "Very good service but expensive plans…",
          "Contenu": "Very good service but expensive plans which do not help when starting out."
        },
        {
          "Note": 3,
          "Lieu": "LB",
          "Pseudo": "Zeinab Housseini",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T15:29:31.000Z",
          "Titre": "I dislike the refund days zeinab",
          "Contenu": "I dislike the refund days"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Leander",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T07:27:59.000Z",
          "Titre": "Loading time and Excel format (currencies/numbers)",
          "Contenu": "Primarily, the deduction of 2 stars for the in-amazon add-in loading time and the \"Excel\"-format. It sometimes really takes ages to load. Further, it does not really make sense that data is coming in csv (the files are normally very small) and that currencies must be formatted so they are detected by Excel.Positive, was my experience with a very rapid costumer service once.If loading time and Excel format improve, with pleasure also 5 stars.Thank you for reviewing and kr :)"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Gargi Singh",
          "Nb_Reviews": 2,
          "Date": "2022-01-29T17:10:53.000Z",
          "Titre": "Easy to use, well priced, lacks some data",
          "Contenu": "The tool is fairly easy to use and well priced. However I had to leave it since it does not show data for the home category in Canadian marketplace. It does not yet have all the data for all categories and that is something I'd prefer to know before I subscribe...gaps need to be communicated as much as the good points, by the company."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Antonio Massimino",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T08:42:03.000Z",
          "Titre": "Let me begin by saying that I love the…",
          "Contenu": "Let me begin by saying that I love the service you are providing and i am sure i can start my own business in a couple of monthsThe only thing i wish it can be improved soon enough is the data on the italian market without which it would be much harder for me to find a good opportunity, and also once i select other markets if the categories could be all in english. Like for instance if i would like to study the german market everything is in german and i don't speak german..."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Yoel Amiel",
          "Nb_Reviews": 1,
          "Date": "2021-06-05T10:28:29.000Z",
          "Titre": "Beginners - Lower Fees for Several Months",
          "Contenu": "Hi,I was about to start as an Amazon seller.I subscribed to your service but unfortunately i had to freeze this activity due to family reasons.Your service seems to be awesome and required for sellers.But for me, who was just trying to become for my first time an Amazon seller, the fees are too high.I would suggest to consider lower fees for beginners like me for several months.Greetings,Yoel Amiel"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TSM Course",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T02:28:42.000Z",
          "Titre": "Configure the BSR sale and free estimator to only except numbers without punctuation.",
          "Contenu": "Please make the BSR cell in your free estimator so that it only accepts numbers. I was copying and pasting a BSR from Amazon and it included the comma as the thousand mark which threw the estimate into the thousands per month rather than 60 per month. Other than that you guys are doing a great job."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Dária Semikina",
          "Nb_Reviews": 3,
          "Date": "2020-12-03T06:16:22.000Z",
          "Titre": "Nice tool but too expensive",
          "Contenu": "Nice tool for amazon sellers but with limitations. Indeed when you are trying to click search button for suppliers it just redirects you to google search page and you will probably not find what you need. Good to find product ideas but not too useful to make it happen, and in my kind opinion it Is expensive for what it can provide. I had bigger expectations. Couldn’t find the price/value middle point."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "Stekot",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T08:36:23.000Z",
          "Titre": "I have been using the tool for a couple…",
          "Contenu": "Update: I am changing my score for 2 star to 3 star. Someone was able to explain to me in more detail about how often the data refreshes. If the production bugs can be fixed swiftly, i will rate as 4 stars. Thanks for hearing me out.-------I have been using the tool for a couple of weeks now and there are many bugs. Had to raise tickets to request a fix and this process is very slow. Also, there is no detailed documentation on how the KPIs are calculated, when does the data refresh etc."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles B",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T01:32:25.000Z",
          "Titre": "Very difficult to get in touch with…",
          "Contenu": "Very difficult to get in touch with support.   Sometimes it would take several hours to hear back from someone including Twitter.   The data on keyword ranking didn’t seem accurate.  For example, I would have a keyword with a sponsored ranking of 2 and jungle scout wouldn’t show I wasn’t ranked."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TK",
          "Nb_Reviews": 3,
          "Date": "2020-06-18T16:37:25.000Z",
          "Titre": "I think some tactical walkthrough on…",
          "Contenu": "I think some tactical walkthrough on listing a product would be very helpful. I recently learned that listing a private labeled product isn't as easy as it is made to seem. The Amazon Brand Registry is basically a nightmare and needs some taming. I had to open a support ticket to list a private labeled product because I don't have my registered trademark yet."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Zooby",
          "Nb_Reviews": 15,
          "Date": "2019-11-14T15:54:54.000Z",
          "Titre": "You will be charged even if you Cancel!",
          "Contenu": "Do not sign up for a trial as they will still charge you even if you cancel with their cancellation period. I was shocked to have been charged even though I cancelled 3 days after signing up and was informed I would not be charged if I cancelled within 14 days..Follow up _ have revised my review as you have responded and refunded my money. The account remains open even though you have said it has closed."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "HY",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T14:12:59.000Z",
          "Titre": "streamline",
          "Contenu": "No offense, Even though the contents are great, one of JS lecturer's pronunciation at Youtube is a bit difficult to understand. I was hesitant to say this one but since I pay for JS, I have a right to say my opinion.Also, when you record JS Youtube, you need to raise the volume of mic. Overall, compared to other numerous Ytube channels, the voice volume is too low. Trust me. I utilize Youtube for exercise, music and lecture etc around the clock. I keep the maximum volume of yours while I keep the half or less for others. Appreciate if you streamline that part."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darryl Parks",
          "Nb_Reviews": 2,
          "Date": "2021-08-13T22:55:40.000Z",
          "Titre": "I find jungle scout to be very useful…",
          "Contenu": "I find jungle scout to be very useful however I’m very frustrated after watching the videos which are very clear-cut I have found myself being able to select a product I do not know how to purchase it in dollar amount how would I purchase an item or bulk items from Amazon and make a profit.? Example if an item cause $10 do I supposed to purchase that product for $10 minus my shipping packaging and duties fees how is that profitable? Am I missing something and could you pointed that  out to me .If you can see if you can guide me to a video step-by-step how to purchase the product in dollar form."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SC",
          "Nb_Reviews": 1,
          "Date": "2019-07-03T19:37:24.000Z",
          "Titre": "Incorrect Data",
          "Contenu": "While the concept and information given if correct are excellent, i find the app does not seem to work properly. Contacted  CS a few times regarding the Web app NOT displaying correct data. Upon being instructed, i followed, to no avail.  Some of the data presented back correctly, while other remained obviously incorrect. Making a good product choice is hindered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Loretta",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T20:40:34.000Z",
          "Titre": "Not so Easy",
          "Contenu": "Since I subscribed to JS, I enjoy the Webinars and Trainings but I find the software difficult navigating or getting anything done.  I don’t find it very user friendly; this has made me to go on Arbitrage until I find it easier to navigate and make progress.  It’s really nice when it’s being explained by JS reps but not so easy to do on my own.  When I was trying the AMAZEOWL, I find it easier but JS has what AMAZEOWL  doesn’t have, and that is effective Webinars and Trainings!!  I’m sure with time, JS will work out well for me."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jean Jeanie Melville",
          "Nb_Reviews": 4,
          "Date": "2018-10-22T11:15:41.000Z",
          "Titre": "I'm currently trying to set up a jungle…",
          "Contenu": "I'm currently trying to set up a jungle scout account, however, i'm unable  to due to the ZIP code.  I have looked into it, i'm in the UK and the info i have is i should use the 3 digits for my postal code then add 00.  This doesn't work.  My bank and credit card company have sign posted me back to jungle scout.  Due to the time difference i'm awaiting a reply."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Joanne (Frolika)",
          "Nb_Reviews": 2,
          "Date": "2018-04-22T11:23:27.000Z",
          "Titre": "Reasonably good experience",
          "Contenu": "Reasonably good experience, not quite as good as I expected in some ways, but better in other ways. Maybe I was been too reliant on it to be honest. Some products lacking sufficient data to make an informed decision. I expected more products to choose from, but seem to find a lot of the same products (different colours/sizes etc) just by different sellers/brands."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "--",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T04:54:42.000Z",
          "Titre": "Over all Jungle Scout is a good tool",
          "Contenu": "Over all Jungle Scout is a good tool, i rate 3 stars as there are many portals which are not yet available on JS. Singapore, Australia, Saudi, UAE are some of them. Please try to cultivate them as we stand half strength when these portals are unavailable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sheila Barnes",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T03:19:43.000Z",
          "Titre": "Product Research Disappointment",
          "Contenu": "I purchased the program mostly for the tools. I canceled the freedombuilderbootcamp.com after 3 days because I was disappointed in the product database results. Didn’t see as many products as I thought Amazon sells."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ana",
          "Nb_Reviews": 1,
          "Date": "2019-07-08T21:40:16.000Z",
          "Titre": "Subscribed to JS last week",
          "Contenu": "Subscribed to JS last week, but can't seem to find a good product to launch. Many of the items don't show opportunity score, says 'it is only available on the search page' which is not helpful at all. Emailed customer service but did not get any help yet. Would definitely appreciate some help asap."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Ola",
          "Nb_Reviews": 1,
          "Date": "2017-01-23T18:52:07.000Z",
          "Titre": "I think its very expensive",
          "Contenu": "I like the idea of this software in general; easy, supportive and saves a lot of effort and time..despite that, I did not like the separation between it and the web extension and I found it really expensive to pay monthly for both...take it easy guys.. you are targeting junior entrepreneurs do you really think they will afford it on continuous basis??"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Kareli Shop",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T16:31:04.000Z",
          "Titre": "It seems they answer with automated answers",
          "Contenu": "I had the impression they were just answering with automated answers. They didn't really understand what I was trying to say.Having a chat would be great so we could communicate more efficiently."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Bersabeh Boroumand",
          "Nb_Reviews": 1,
          "Date": "2017-08-07T02:36:38.000Z",
          "Titre": "It is a smart business and market …",
          "Contenu": "It is a smart business and market survey tool, it also goves good hints about products' business potential, however it is expensive when it comes to adding each extension to it. And the level of its data accuracy is not clear. Also it would be nice to add a regulatory and market registry guideline to it for each market."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Khadijah Ahamefule",
          "Nb_Reviews": 2,
          "Date": "2021-05-14T16:16:46.000Z",
          "Titre": "I would have given 5 stars",
          "Contenu": "I would have given 5 stars, but I’m unhappy with this tool. I’ve been using JS now for close to a year and I’m gutted to find out that their data is not correct, they attributed a higher monthly sales revenue to my product than I actually make, even the monthly sales figure does not correspond to what I sell, so it’s made me begin to question the figures I see from other sellers. I know that JS cannot provide its customers with accurate numbers, but would be nice if it was closer to the real deal! Secondly, there’s a niche that I’m interested in, but JS isn’t returning any data, so how am I supposed to work out the profitability of the product?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ali Khaky-Kazzazy",
          "Nb_Reviews": 2,
          "Date": "2017-01-24T07:46:11.000Z",
          "Titre": "Great customer service, average tool",
          "Contenu": "Although the JungleScout team was great and provided very fast responses to my questions, the tool, I found, had some issues. For one, it didn't give accurate sales estimates (I know because I was tracking a product I OWN and the numbers were WAY off), and good tutorials were difficult to find."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ahmad Noubani",
          "Nb_Reviews": 1,
          "Date": "2020-12-13T21:05:23.000Z",
          "Titre": "Jungle Scout is always improving but…",
          "Contenu": "Jungle Scout is always improving and I really appreciate that about Jungle Scout, and it’s why I haven’t switched to another app, but there are still some bugs that can be annoying, and some ways I think it could look a little more appealing."
        },
        {
          "Note": 3,
          "Lieu": "CN",
          "Pseudo": "Eaman",
          "Nb_Reviews": 1,
          "Date": "2018-12-10T22:21:15.000Z",
          "Titre": "Analysis of customer preference",
          "Contenu": "everything is good, but sometimes when i d like to analyze the customer preference/market trend in view of dimension, color, lb by downloaded excel, I can’t easily filter them. If possible for good jungle scout to help, it should be much better to bring better experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2021-06-09T01:32:55.000Z",
          "Titre": "The tool looks fantastic",
          "Contenu": "The tool looks fantastic, but for me it didn't work. I don't speak English, I speak Portuguese/Brazil, most of the videos are not in my language. For this reason I was unable to continue with the tool."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jo",
          "Nb_Reviews": 1,
          "Date": "2018-04-23T06:56:52.000Z",
          "Titre": "I like your software but I am frustrated",
          "Contenu": "I like your software but I have some frustrations.  Recently, I've been researching new opportunities using high demand, bad marketing data. It notes there are approx 2 million products/items.  Once I get to the 5,000th line, I can't go any further.If your software recognises there are approx 2 million items in this category, why can't I have access to more than 5,000? I've contacted support twice and they advise that the limit is currently 5,000.  Fine but why can't I just move to the next 5,000?   I find it very frustrating. Additionally, I can only download 200 lines of the CSV file.  I hope you can find a way to allow much greater access.Jo"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Victor Lim KL",
          "Nb_Reviews": 1,
          "Date": "2020-01-19T14:00:36.000Z",
          "Titre": "At time i lock in JS hang on me i don't…",
          "Contenu": "At time i lock in JS hang on me i don't know why like today i have to down chrome extension again to restart JS app. WHyVictor Lim19 jan 2020 time 2032 i happan hang when i whan to start using JS"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2017-01-23T18:09:51.000Z",
          "Titre": "Difficult to navigate",
          "Contenu": "Although a very useful tool for marketing, it is not for the novice.  Searches are difficult to pinpoint and frequently the data is not accurate.  It's very time consuming if you are not familiar with the system."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Vepa",
          "Nb_Reviews": 2,
          "Date": "2021-08-23T10:51:00.000Z",
          "Titre": "sales analytics need to be improved",
          "Contenu": "Bad experience with sales analytics. Unable to upload costs (need to do manually). Figures do not really match with Amazon’s reports. I am not sure if I can trust JS reports."
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Ciaran",
          "Nb_Reviews": 4,
          "Date": "2017-01-23T18:10:14.000Z",
          "Titre": "Subscribed for 30 mins no full UK Coverage",
          "Contenu": "I like the Idea of Jungle Scout but I never got to use it as I wanted to use this for my European market which Jungle Scout does not provide. Would Like to use it in the future once European Coverage is fulfilled."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2017-01-29T05:54:52.000Z",
          "Titre": "Why is Jungle Scout on a plateau?",
          "Contenu": "Good product; however, I feel that there are some obvious enhancements that are needed.  The three stars are to encourage some improvements that I think will make the product great!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Melbin Abraham",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T04:04:46.000Z",
          "Titre": "U guys need to upgrade yourself with…",
          "Contenu": "U guys need to upgrade yourself with better features. There are other better softwares which has better features."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Client",
          "Nb_Reviews": 4,
          "Date": "2019-06-19T16:39:59.000Z",
          "Titre": "French/European markets and functionalities",
          "Contenu": "I would have appreciated to get all the functionalities for the European market and especially for the French market (where I'm located), like \"keywords\"..."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Laura  Finke",
          "Nb_Reviews": 2,
          "Date": "2019-01-14T19:43:33.000Z",
          "Titre": "Product tracker is not working anymore",
          "Contenu": "Hello, I can`t track products anymore. Why? It always says that the ASIN doesn't exsist. It doesn't make sense.Thank you for an answer, Kind regards, Laura Finke"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nick Allman",
          "Nb_Reviews": 1,
          "Date": "2020-05-04T20:35:51.000Z",
          "Titre": "Great overview, but not accurate enough",
          "Contenu": "Great tool to get an overview of product data, but not accurate enough in the fine-tuned details. AmazeOwl does a much better job for getting very accurate data."
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "Berke Aliyazıcıoğlu",
          "Nb_Reviews": 4,
          "Date": "2020-07-09T00:47:56.000Z",
          "Titre": "They do not deserve their price",
          "Contenu": "They do not deserve their price, unlike competitors, Jungle Scout offers extension and web seperately to charge more money, you can combine them together but it is expensive. I could consider the price reasonable if they offered Advanced Rank Filter, more comprehensive keyword tracking, product landing pages for social media ads, refund optimization etc... shortly they do not provide 16 tools like Helium 10. Jungle Scout is the first software of the market, that is why many people choose them but it is not good enough for me. Their strongest card is supplier database, I respect that, but finding and tracking supplier is the only advantage of Jungle Scout against competitors. To sum up, as a 350k/year professional fba seller, I have used paid plans for almost everything. My favorite is Helium 10.Let me explain short and easy,Jungle Scout = NokiaHelium 10 = Apple Iphone"
        },
        {
          "Note": 3,
          "Lieu": "PR",
          "Pseudo": "Dash",
          "Nb_Reviews": 1,
          "Date": "2017-01-28T19:05:39.000Z",
          "Titre": "not very accurate, or consistent.",
          "Contenu": "the following is only about tracking products: i find the rank is off by a lot often, tho i do understand js gives an average rank. js also doesnt show some products' data. not sure if its js problem or the listings problem. also a straightforward tutorial, without plugging in some other guy or his service or plugging a link on youtube, would be grand! i still don't get why there is not a tutorial embedded with in the software. should be the first thing users see upon purchasing the program. also should be mentioned what kind of numbers users should look for in terms of sales. i had to dig other places to find the 300 items a month 10 sales a day rule from greg. anyways user experience is not as seamless as it could be. but nothing in life is i suppose. so my verdict is: good snuff (for someone who understands what to look for)"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Max Lipmann",
          "Nb_Reviews": 3,
          "Date": "2020-06-17T07:59:18.000Z",
          "Titre": "JungleScout- Good but can improve!",
          "Contenu": "Tried them out, were good, not happy with their customer service though, multiple queries but none of them were answered to my satisfaction. Can be better!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LEE",
          "Nb_Reviews": 1,
          "Date": "2019-02-16T19:49:35.000Z",
          "Titre": "Falls Short of quality features.",
          "Contenu": "Not as many features as the competition.Step by step Videos would be helpful. Most features need enhancements. Too many additional improvements to list here."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luis Ramirez (S3 Global)",
          "Nb_Reviews": 5,
          "Date": "2017-06-01T05:04:28.000Z",
          "Titre": "Great product overall but some times",
          "Contenu": "Great product overall but some times, Results are inconsistent, specially with gated items, some times price is not advertise, the engine produce deceiving results"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "unknown",
          "Nb_Reviews": 1,
          "Date": "2017-02-01T10:23:28.000Z",
          "Titre": "My opinion",
          "Contenu": "Please, make  the pro verision available which would help to research and track products in the UK and other EU markets. Just like you have only for the US."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daisy Mae",
          "Nb_Reviews": 5,
          "Date": "2018-02-24T14:00:08.000Z",
          "Titre": "Happy with the results but lacking weight column and no response",
          "Contenu": "Happy with the results JS gives but was expecting to see item weight as one of the columns.  I wrote to JS about it and have not heard from them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2017-01-28T22:19:38.000Z",
          "Titre": "Haven't Seen Results Yet",
          "Contenu": "I am in the process of manufacturing my item that I found through Jungle Scout and have not sold any items yet, which is why I gave 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Barbara",
          "Nb_Reviews": 7,
          "Date": "2020-12-01T21:07:27.000Z",
          "Titre": "Very US oriented",
          "Contenu": "Very US oriented. The extension is not always working for European Amazon, sometimes is not even calculating the ranking"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cmontalvo13",
          "Nb_Reviews": 1,
          "Date": "2018-04-14T07:13:36.000Z",
          "Titre": "Don't really trust the numbers",
          "Contenu": "Don't really trust the numbers. Alot of variation from web app and chrome extension. Especially when trying to find a product."
        },
        {
          "Note": 3,
          "Lieu": "PE",
          "Pseudo": "Ana Gallo",
          "Nb_Reviews": 1,
          "Date": "2018-04-16T20:31:53.000Z",
          "Titre": "It’s helpful but few times the software…",
          "Contenu": "It’s helpful but few times the software doesn’t works and shows me all the best sellers and I had to fix with junglescout support"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "howard byrd",
          "Nb_Reviews": 2,
          "Date": "2018-07-12T06:20:30.000Z",
          "Titre": "Not enough information for beginners to…",
          "Contenu": "Not enough information for beginners to use your products. You need to provide basic information before referring to YouTube."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim Hughes",
          "Nb_Reviews": 13,
          "Date": "2018-11-12T09:41:26.000Z",
          "Titre": "Nice Tool",
          "Contenu": "nice and required tool for amazon sellers, but the pricing was so high when compared to other analytic tools in the market"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Krishna",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T16:01:05.000Z",
          "Titre": "SCAMMED me with charges!!!!",
          "Contenu": "I am the kind of the person that if I have a negative experience I usually don't say anything. So you guys must have REALLY f***** up to receive a negative review from me.In mid December I tried to cancel my membership with them which I thought I did. However, the following months of Jan, Feb AND March they kept charging me. I had contacted them 3 times previously.. no response!The 4th time I contacted them I also sent a DM on their instagram.. then they decided to reply me. They REFUSED to refund me my money for the months of Jan, Feb and March and get this... my account wasn't even allowed access in those THREE months. I even have a screenshot of my account access being denied.So how are you going to charge me almost $300 for not even using your services. I have my own amazon business.. I now use Helium thank God! I would NEVER use this platform or recommend it.. because if they would actually care about their customers they wouldn't scam them like this... HIGHLY DISAPPOINTED!!!!!!!Update: After going back and forth they did refund the money and apologised due to an error made."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Uncle Arpi",
          "Nb_Reviews": 1,
          "Date": "2018-02-11T00:44:22.000Z",
          "Titre": "Sometimes it hangs",
          "Contenu": "Hi, sometimes when i extract the 2. or 3. page, I get an error message. I have to close and to start again JS."
        },
        {
          "Note": 3,
          "Lieu": "BG",
          "Pseudo": "alevtodorov",
          "Nb_Reviews": 2,
          "Date": "2018-04-17T16:48:39.000Z",
          "Titre": "JS Web App's server is not working…",
          "Contenu": "JS Web App's server is not working properly. But as a whole, its a perfect research tool. Recommend it."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Mecerdes Lopez",
          "Nb_Reviews": 2,
          "Date": "2021-07-27T08:56:05.000Z",
          "Titre": "I still did get no where this program…",
          "Contenu": "I still did get no where this program please can you assign someone to me who can assist me"
        },
        {
          "Note": 3,
          "Lieu": "TW",
          "Pseudo": "Chen, Yun-Wei",
          "Nb_Reviews": 1,
          "Date": "2018-05-24T13:01:12.000Z",
          "Titre": "For a non English speaing and newly…",
          "Contenu": "For a non English speaing and newly started user, JS does not have a clear flow of usage. Chen, Yun-Wei"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2019-10-31T17:09:04.000Z",
          "Titre": "Jungle Scout has some really good tools…",
          "Contenu": "Jungle Scout has some really good tools to help but your customer service is really disappointing. I initially had an issue with the extension and went back and forth trying to get it fixed, the end result...we will let our tech know about the problem. No fix for me it was like oh well deal with the issue. Next came my cancelling of my App and working with the extension. An error in billing and instead of taking the time to be thorough my extension, which I was still active was cancelled. I immediately reached out as I was due to participate in a webinar using the extension. No response. I again reached out hearing back a couple days or near that missing my webinar. In the message the customer service rep used an exclamation, like I don't know what that means and stated, oh I extended your account 2 days, you didn't extend anything that's what I paid for.  Not good, actually bad. I don't know anyone at Helium but they sure have treated me better. Greg, you're webinar's are helpful, videos good, but take a look at customer service. I may be but one customer but I'm sure this isn't just me.  I should have been treated a lot better. I trusted your service, spent my money...sad."
        },
        {
          "Note": 3,
          "Lieu": "NP",
          "Pseudo": "Cem Bakış",
          "Nb_Reviews": 6,
          "Date": "2020-04-18T16:54:00.000Z",
          "Titre": "Major bugs that made me quit (it got fixed by itself after few days)",
          "Contenu": "EDIT: The system got fixed by itself and the customer service team reached me after my review with a detailed walkthrough. That's why I changed to 3*. I think the type of error I am writing below should not be part of JS. Their extension is cool but I no longer use their web app, I am using another company which seems better.If JS improves their service to catchup with other companies in terms of reliability, more tools and punctual customer service I think I can re-consider to try them again. (but it seems it's a better tool for beginners)----I appreciate some of the JS tools and I have used it (keyword research, listing builder, asking for reviews tool etc.) and I had good experience with customer service. I appreciated because in the beginning it helped me a lot.But recently, there is a major bug on the website about the calendars, I have tried many times from chrome and safari. I cannot use the promotions tool and also cannot review my profits. It is still going on. I have sent 3 emails and NONE of them got response.Today I cannot even log in to my account, it just shows a blank page. That was the last drop on the glass. How I can rely on JS if it gives me problems like that? If you guys could communicate me in advance or respond timely I could understand, but it seems nobody cares.I am very very disappointed about this."
        },
        {
          "Note": 3,
          "Lieu": "VE",
          "Pseudo": "Eguarbury",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T13:59:54.000Z",
          "Titre": "I am new but there are some típs that i…",
          "Contenu": "I am new but there are some típs that i dont figure out"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Suchitra",
          "Nb_Reviews": 2,
          "Date": "2017-01-23T16:48:39.000Z",
          "Titre": "No options to see past 6 month sale",
          "Contenu": "We cannot use this for seasonal products. Should give some Annual report as well."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "S.ZUR",
          "Nb_Reviews": 2,
          "Date": "2021-11-18T14:41:46.000Z",
          "Titre": "Its ok",
          "Contenu": "Its ok. You can use it if you just start your journey om Amz."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 1,
          "Date": "2019-09-21T00:37:29.000Z",
          "Titre": "Some of your features still don’t…",
          "Contenu": "Some of your features still don’t support  other  languages like Spanish"
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "mcasal",
          "Nb_Reviews": 1,
          "Date": "2018-04-20T15:39:06.000Z",
          "Titre": "Random mistakes",
          "Contenu": "Random mistakes in estimated sales and seller type but still a useful tool"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Giacomo",
          "Nb_Reviews": 2,
          "Date": "2019-05-04T13:28:27.000Z",
          "Titre": "Great interface, doubts on data quality",
          "Contenu": "Great interface, questionable data quality, some useful filters missing"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "SAM",
          "Nb_Reviews": 1,
          "Date": "2018-04-23T02:00:40.000Z",
          "Titre": "Numbers are on JS a little high than…",
          "Contenu": "Numbers on JS reflects a little high # of sales than actual sale on FBA."
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "Thanakit",
          "Nb_Reviews": 3,
          "Date": "2017-01-24T03:20:21.000Z",
          "Titre": "Bad Rationalization from JS",
          "Contenu": "JS is all about time saving in doing product research, right?I've just joined back in Dec'16. Now, you guys came out with a much more streamlined e-book and 7 part product research videos. You guys denied me and every members who already paid for JS with some absurd rational that you set (anyone who joined 2 weeks prior to the 2017 special is not getting these 2 valuable resources. Try to tell that to customers who joined 18 - 20 days before and see how that's turn out). Your customers who already paid for JS could benefit from the e-book and the video lessons for sure. By pointing out to similar resources that used to create these ebooks and videos bonuses as an alternative solution is alright but not good enough since it will take more time to go through those scattered videos (which defeat the purpose of time saving by using JS).By telling me that you're considered to make these two resources available to current members in the future is not good enough either. Those two resources are already available for new members which mean it wouldn't cost you much to actually provide great value for your current members.Since, JS doesn't value a paying customer like myself, I will not continue with the monthly payment. (I get it, I already paid for the extension so no more significant value financially. There is no big $ to be made from me just a low value monthly payment which I could cancel anytime).Please don't contact me again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KAYA",
          "Nb_Reviews": 2,
          "Date": "2021-09-19T17:55:58.000Z",
          "Titre": "It takes a very long time to download…",
          "Contenu": "It takes a very long time to download or upload reports"
        },
        {
          "Note": 3,
          "Lieu": "CN",
          "Pseudo": "Yulin Su",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T06:10:20.000Z",
          "Titre": "Sometimes the data Ali’s not accurate…",
          "Contenu": "Sometimes the data Ali’s not accurate and confused"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "ADAM",
          "Nb_Reviews": 1,
          "Date": "2017-01-23T18:37:02.000Z",
          "Titre": "Expensive!",
          "Contenu": "Too expensive for a monthly subscription of almost £80.00!"
        },
        {
          "Note": 3,
          "Lieu": "CN",
          "Pseudo": "xiangbin",
          "Nb_Reviews": 1,
          "Date": "2019-07-31T10:18:55.000Z",
          "Titre": "I don't know much about how this…",
          "Contenu": "I don't know much about how this software is used."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jessie",
          "Nb_Reviews": 5,
          "Date": "2018-03-22T03:20:51.000Z",
          "Titre": "Not bad but could be cheaper.",
          "Contenu": "Expensive and not worth the price."
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T06:48:24.000Z",
          "Titre": "Very slow customer service"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "John Vanderbeck",
          "Nb_Reviews": 2,
          "Date": "2019-04-02T16:19:46.000Z",
          "Titre": "A great help and useful tool but with room for improvement",
          "Contenu": "A great help and useful tool, though for the price I feel it could provide a better user experience.Pros: Saves you a crap ton of time.  It aggregates all the data that you want (or most of it anyway) from an Amazon search page in just a few minutes versus the 15 or so minutes it would take you to do the same.Easy to use.  Very easy.Cons:While it is far faster than doing the work yourself, it really could be faster.  Opening the extension on a search page still takes it a few minutes to grab all the data and then usually another minute for the \"opportunity\" score to appear.  Not deceptive, but they make it appear to function far faster in their videosLogging in all the time.  I get they don't want people sharing the app, bu the fact is almost everyone uses multiple computers and browsers these days.  Most have a PC and a laptop or example.  Every time I move from one to the other, I have to relog in.  Further more, if I want several browser windows open for organization, it often makes me log out in one to log in on another.Not as configureable as I'd like.  For example, you can't set how many results to list.  In nearly every class given on product research, including Jungle Scout's own videos, it is suggested to look at the top 10 for certain metrics.  This extension handily gives you information like average sales volume, average cost, average rating, etc but you can't see the averages for the Top 10 because it always retrieves 60 some odd results.  I'd love to see an option to limit the results to just the first 10-15 items (or really user settable) to make it both run faster and make the averages more useful.Laggy UI.  The UI is not smooth and sometimes frustrating.  When you are trying for example to remove items, the \"X\" often doesn't even show up, you have to wav your mouse around to get it to come up.  Adding items with the \"+\" icon sometimes just does nothing, or takes several seconds.No bulk actions.  It would be nice to be able to have a column for selecting multiple items and then have bulk operations on the selected items like add all selected to tracker, or export data just for selected items.Overall a very nice and useful extension, but with lots of room for improvement especially given the cost.  If it was half the price I would be more forgiving of its shortcomings."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Moyer",
          "Nb_Reviews": 4,
          "Date": "2020-03-18T18:22:01.000Z",
          "Titre": "Be very careful! Unclear pricing scheme, auto charges and no notifications.",
          "Contenu": "When we \"subscribed\" to a monthly plan to test out the software, their prompts told us it was $49/month for the plan we wanted. We figured that was an OK price to test out the software for a few months to see if it was something we could make use of. So, we subscribed and didn't think about the pricing again (rarely using the software) until 4 months later when reviewing our credit card statement I see that we had that same day been shifted into a \"Seller Level 5\" tier and charged an additional $350! Then, we were charged $400 per month for the next 3 months. Our accountant thought I had legitimately decided to pay $400 for the software so never raised the issue to me. Apparently, after subscribing, JungleScout prompted us to sync our orders in order to utilize all the \"features\" of their software. We didn't really need these additional features, but figured we'd test them out since we were paying for the software anyhow. Of course, those prompts didn't warn us that if our orders were above certain thresholds, we would be charged WAY more than we'd signed up for.  After JungleScout imported our sales stats they upped our fee without the slightest warning or notification either on our account after signing in nor via email. To top it off, JungleScout never sent 1 email with an invoice. To me, this implies that they are making every effort to hide their charges from sellers in order to swindle sellers into overpaying. Have you ever had an online subscription that didn't email you every time they charged you, nonetheless when they shift you into a new pricing tier that costs 4x more?? Of course, had I received any sort of notification I would have immediately canceled, but they probably know that and that's why they don't bother notifying customers.My guess is that this deception is part of their tactics, in hopes that as sellers grow they can skim more from their customers and hope it gets through unnoticed, siphoning away your hard earned money.  Even if you are a small seller, I would be wary to start developing your business practices around software built on such questionable tactics. If you decide to give it a try, just be aware of the pricing scheme. My suggestion would be to look elsewhere, as there are other options out there with similar tools that are transparent with their pricing. To JungleScout's credit, they did end up refunding the extra that was charged for those 4 months without too much of a hassle, but I doubt they will change their method of charging/notifying customers.The software may be OK, but it's clearly backed by a company with questionable tactics that I would not be comfortable basing my business around. We tested another option at the same time and preferred their data and interface over that of Jungle Scout, at least for what we wanted out of the software.TLDR - Beware of their pricing scheme that is not immediately apparent and that charges/increases automatically. You will receive no notification of charges or increases. There are other options, take the time to test out what's out there."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Ana",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:35:19.000Z",
          "Titre": "Hisotric downloads of several SKUs at…",
          "Contenu": "Hisotric downloads of several SKUs at once will be a great addition!!"
        },
        {
          "Note": 4,
          "Lieu": "MA",
          "Pseudo": "Youness Badanni",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T12:43:01.000Z",
          "Titre": "good  experience but if u can do mobile app is better",
          "Contenu": "good experience but if u can do mobile app is better"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Tshepang Mpho Kobue",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T07:09:20.000Z",
          "Titre": "Happy",
          "Contenu": "My query was assisted excellently. I love how jungle scouting, handle their queries and are willing to help others succeed in Amazon"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Zara",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T20:57:38.000Z",
          "Titre": "Just started out with JS so still…",
          "Contenu": "Just started out with JS so still newbie.But so far happy with JS software and customer service has been great .Hope to give 5* in the future."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Franck",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T17:45:06.000Z",
          "Titre": "Overall great experience",
          "Contenu": "Baring some problems with connecting my Amazon account with the app, which their support department resolved, I had a very good experience with Jungle Scout.The app has a good range of tools, is easy to use and their support is quick to respond to your questions.Would definitely recommend it."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sayyed",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T03:38:52.000Z",
          "Titre": "A great tool to use for product research for member countries.",
          "Contenu": "A great tool to use for product research, just missing the far East countries, otherwise a great tool for member countries."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise Bratcher",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T20:07:44.000Z",
          "Titre": "Email Customer Support is outstanding",
          "Contenu": "I was charged the annual fee but had never used the service.  Tried to call to rectify the problem but couldn’t get customer support by phone. Decided to email Jungle Scout asking for a refund. They immediately refunded my money and cancelled the account that I thought I had already cancelled. Unfortunately because I couldn’t get a live person I cancelled my card to prevent any future charges but didn’t need to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Steel Ginsberg",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T02:39:43.000Z",
          "Titre": "Greg",
          "Contenu": "Greg, JS is a very helpful tool. However JS needs to make things a little more simple, it should work harder for us to narrow down the ideal product. All of this, copy and past stuff and all the check it here and then compare it to the next step to see if it truly is a High Demand, Low Compétition, High Profit Margin. The JS formula should gather it all up for me and chew it all up then spit out an affirmative on the product or of the product from a niche. In other words JS should give a more sophisticated version of it's old self while making it even easier for the average want to be Amazon  seller like myself to use. Thankx, Steel"
        },
        {
          "Note": 4,
          "Lieu": "QA",
          "Pseudo": "Yusra Qureshi",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T23:19:00.000Z",
          "Titre": "iPads and mobile phones are not working for jungle scout.",
          "Contenu": "Very nice company from time to time they check on you is everything okay or are satisfied with our service appreciate able."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "John Doe",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T10:19:49.000Z",
          "Titre": "The product is really good and allows…",
          "Contenu": "The product is really good and allows you to make a data driven decisions instead of \"I like this product, so others will like it too\".I give it 4 stars and not 5 because some of the valuable features are only available for US market."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Mirla  El Masri",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T07:54:40.000Z",
          "Titre": "Good experience although short! The customer service team is great and…",
          "Contenu": "The customer service team is great and super responsive. My short lived experience was smooth from beginning to end. However, I was just wondering how accurate are these numbers when it comes to monthly sales and search volume as i found a big discrepancy between the JS monthly search volume for a particular products and the search volume of the same product on H10"
        },
        {
          "Note": 4,
          "Lieu": "KG",
          "Pseudo": "Nurbek Nogoibaev",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T07:33:33.000Z",
          "Titre": "need to improve technical support before buying, the buyer must solve all his questions directly through the technical support mail address or through the hotline, and not dig through the links",
          "Contenu": "I would rate it as positive, there is one thing, it would be better to get answers by mail and only from mail, so as not to delve into soft links. For example, you submit a question for maintenance, and they send links to the answer to maintenance, I think this should not be, customers prefer to receive an answer from one source, rather than looking for answers through links."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "YJ",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T19:44:45.000Z",
          "Titre": "Useful but login and alert problems.",
          "Contenu": "Overall I enjoy it and would like to use it for long term. But the issues that I created tickets are not solved in the past months. I hope that can be improved and my experience will be better."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Michel",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T23:52:10.000Z",
          "Titre": "so far so good!",
          "Contenu": "I choose Jungle Scout for not just the website but the training videos available to you.It would be helpful if you could watch some of the academy videos and experiment at the same time."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Shreepad Abhyankar",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T07:56:30.000Z",
          "Titre": "Extention CSV download issue fix",
          "Contenu": "Issue is fix now althought it took a while but now fine.From next releases onwards better to keep working features as is.."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Badr Altarjami",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T19:58:34.000Z",
          "Titre": "almost perfect",
          "Contenu": "Everything was great, I just hoped for a more then 1 year historical data, also less technical issues, which is the reason i canceled my subscription."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Shirley Franz",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T06:11:58.000Z",
          "Titre": "Good Videos, the support could be improved.  The academy is really good.",
          "Contenu": "Hi there :Looking for some customer service - could I get a call to walk me thru' Jungle Scout.  I need some help navigating the website."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jemseed Lebbe",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T10:39:37.000Z",
          "Titre": "I was able to get a satisfactory response:",
          "Contenu": "I feel that the Jungle scout provides a better service, which we can trust and work with confidence."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Maéva de Garrigues",
          "Nb_Reviews": 4,
          "Date": "2023-07-27T08:51:36.000Z",
          "Titre": "Love it",
          "Contenu": "Love it ! Just the extension is bugging sometimes and I have to desinstall and re install it few times.The rest is perfect !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marissa Williams",
          "Nb_Reviews": 1,
          "Date": "2022-09-18T01:18:32.000Z",
          "Titre": "This company made it right",
          "Contenu": "update: After all of this happened, the company has finally found my refund and was able to put the $376 back into my account. They made right on their business and I appreciate it from them.This company is fraudulent! They billed my card $376 and after going back and forth with them about a refund they still have never returned it.  They gave me the run around and told me to cancel the dispute with my card company. They kept telling me 10 more business days 10 more business days and you'll receive it. Never received it. I had to open up another dispute with my card company and my card Company  said their hands are tied and they can't take the funds back from them for a second time. They gave me a fake ARN to \"track down the funds.\" My card company told me that it is a fake ARN number and that there are no funds to track. Truly disappointed with the company and I advise anyone to steer clear."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "F. N.",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T19:53:46.000Z",
          "Titre": "Thank you Jungle scout for your…",
          "Contenu": "Thank you Jungle scout for your customer support prompt responses."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Osman Erdem",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T10:14:53.000Z",
          "Titre": "Hi, thanks jungle scout.",
          "Contenu": "Hi, Jungle Scout can make very accurate reports and analysis. Customer service is very good.thanks jungle scout."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wes  Lemire",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T19:11:23.000Z",
          "Titre": "Stats on current sales are outdated",
          "Contenu": "Stats on current sales are outdated. Customer service was spot on and helped to solve any issues I had."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tricia",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T18:47:40.000Z",
          "Titre": "Easy to use self-paced tutorials",
          "Contenu": "Easy to use self-paced tutorials, just getting started"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Alfonso Noriega",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T04:49:20.000Z",
          "Titre": "It is easier to open an account from Google Chrome",
          "Contenu": "Franz tried to help me by giving some ideas and reviewing my failed attempts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alicia m Lobo Sica",
          "Nb_Reviews": 4,
          "Date": "2023-02-09T20:46:12.000Z",
          "Titre": "I would like more videos about how to use this tool",
          "Contenu": "I would like more videos about how to use this tool. I am not that good on technology and that will help a lot, old people like me. We are not millenials😁😁😁"
        },
        {
          "Note": 4,
          "Lieu": "JO",
          "Pseudo": "mikhled shrouq",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T13:21:12.000Z",
          "Titre": "Thanks alot",
          "Contenu": "Thanks aolot for quick response to all questions."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rhea Geldeard",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T11:53:23.000Z",
          "Titre": "Mode of payment",
          "Contenu": "Was hoping JS will offer Klarna as payment. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Ana",
          "Nb_Reviews": 2,
          "Date": "2023-06-18T22:49:27.000Z",
          "Titre": "Really kind team that makes as much as…",
          "Contenu": "Really kind team that makes as much as they can to solve your problem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SolarGoods",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T21:19:15.000Z",
          "Titre": "Good",
          "Contenu": "Good. Quick feedback is great.Not so good. Phone support should be an option"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Ghulam Tayyib khan",
          "Nb_Reviews": 2,
          "Date": "2023-03-02T09:05:07.000Z",
          "Titre": "I used it for a month and had a great…",
          "Contenu": "I used it for a month and had a great experience"
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Rodrigo Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T05:11:58.000Z",
          "Titre": "Your support service is so good."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Andrew Bramwell",
          "Nb_Reviews": 3,
          "Date": "2023-03-02T20:57:35.000Z",
          "Titre": "2 March 2023",
          "Contenu": "OK, but I was still left in the dark slightly as to what Jungle Scout do."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LaTrese",
          "Nb_Reviews": 3,
          "Date": "2022-03-28T14:17:48.000Z",
          "Titre": "THANK YOU JUNGLE SCOUT!!!",
          "Contenu": "Good Day friends, I'm very happy to announce that Oshy, Rey, & Quincy was the AWESOME TEAM that solved my problem with extension!! they were so kind to send me screen shot instructions!  Thank you ALL, as that definitely did the trick! Also I was given a 50% discount for the upcoming month since I wasn't able to use the Extension my 1st month. Thank you Jungle Scout!!Sincerely, Genell LaTrese"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2022-03-26T13:16:13.000Z",
          "Titre": "I am still trying to wrap my head…",
          "Contenu": "I am still trying to wrap my head around the information I am seeing in the opportunity finder and the Product database.  all of the tutorials are overviews and not real-time product research.  I see branded names mostly with that name in the product title. I don't want to compete with a branded site with my first product.  Stop doing videos with jungle Stix and do a real product search!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rawad Alshamandi",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T16:09:47.000Z",
          "Titre": "Thank you",
          "Contenu": "Thank you for all appreciate"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Vicky Zhan",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T00:59:51.000Z",
          "Titre": "Need to improve",
          "Contenu": "I am satisfied with your service, but not with JS function. It can not provide me datas properly and exactly I think. The function often doesn't run properly. And I always got an answer that the category doesn't belong to the big category. I don't understand actually. Anyway, it's not so smart. when i download the CVS. file, it cannot download the product images which i think it's very helpful."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Stvnnarai",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T13:29:11.000Z",
          "Titre": "Overall it's a great tool",
          "Contenu": "Overall it's a great tool, it's a shame although that it only recommends suppliers from China and there is no list of valid European or UK suppliers.Apart from that, it is easy to use and a great tool to source profitable products on amazon."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rajina Panesar",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T05:59:51.000Z",
          "Titre": "Being new to the world of e-commerce…",
          "Contenu": "Being new to the world of e-commerce marketing, I found Jungle Scout very helpful and reliable in analyzing marketing data.  I really liked how keywords were so easily generated.  it gave me a good understanding of market trends, profits and my competition in the market.  For a beginner like me it is a God sent feature to have. Another good feature is the fact that it can pull your listing off the Amazon pages, be edited and placed back!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leslie Franczyk",
          "Nb_Reviews": 2,
          "Date": "2022-01-11T13:17:02.000Z",
          "Titre": "Great site for training information and…",
          "Contenu": "Great site for training information and product research.  Two ideas I would like to share:  1.  on many occasions when copying and pasting an ASIN, no suppliers is displayed.  Perhaps some additional info on where to find suppliers may be less difficult (for newbies).  2.  After completion of the training videos, I still found it a bit confusing on when and amount of bar codes to purchase, and how to use,; and, the process of actually setting up on the amazon site.  It may just be me missing something tho.  Great job JS, great product!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pete Houston",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T22:18:34.000Z",
          "Titre": "I had trouble with my account",
          "Contenu": "I had trouble with my account, a screen would come up saying to upgrade my account whenever I would do anything. It was my fault I went through an affiliate and didn't realize it was just for new customers. But they helpful people at jungle scout got me going again. The only problem is it couldn't find a phone number to talk to an actual person and the chat box is all automated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adriana Evans",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T01:39:50.000Z",
          "Titre": "Jungle Scout is a good extension",
          "Contenu": "Jungle Scout is a good extension, however I'm currently with a program that uses a different extension. In order for me to stay on track I need to learn how to use the extension my program is utilizing. We receive hands on to assure we learn how to properly use this extension. So nothing negative about Jungle Scout, just need to learn how to utilize these programs."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Rita",
          "Nb_Reviews": 3,
          "Date": "2021-08-23T12:57:59.000Z",
          "Titre": "Instructions to connect JS with AMZ",
          "Contenu": "I asked for instructions to connect JS with my Amazon account.The first instructions I received from JS were not helpful.The links I had to follow did not appear on amazon's website.It looked as if JS didn't have the latest version of Amazon's website (????)Eventually, I managed to reconnect AMZ with JS, but I did so without following JS's instructions.The JS person who contacted me, answered me every time, in a very short time. So my score is high."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Anne Delice",
          "Nb_Reviews": 3,
          "Date": "2021-05-20T18:09:59.000Z",
          "Titre": "Jungle Scout was easy to deal with",
          "Contenu": "Jungle Scout was easy to deal with. I cancelled because I simply wanted someone to help me pick a product and put on amazon for sale.  the process was too daunting and I decided not to continue. I simply don't have time for courses and calls all day. If someone were to simply call and help me find and put product on amazon I would not have cancelled."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Yasir Baloch",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T14:44:02.000Z",
          "Titre": "Quick response of customer service.",
          "Contenu": "Problem solved in minutes, excellent customer service."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mrs Jury",
          "Nb_Reviews": 23,
          "Date": "2021-03-05T12:14:07.000Z",
          "Titre": "So far so good!",
          "Contenu": "So far so good! Been using this software to make my life easier and that's exactly what it does! Lots of tutorials for beginners, real people to answer questions and lots of information.  If you are trying to decide which software to go with, viral launch etc I would choose this to start.  Some running issues when using a mobile device though so could do with this fixing but maybe that's me?"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Maria Verdugo",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T17:03:04.000Z",
          "Titre": "It's amazing all the information you…",
          "Contenu": "It's amazing all the information you can get to make important decisions about what products you can sell on Amazon. I think that JS can improve the branded products that appear in the search as an opportunity but if you check them on amazon, there are many others that offer the same product but with a different brand, or those products that may be copyrighted, such as baby yoda, that appears a lot."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Daniela Vaca",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T15:01:43.000Z",
          "Titre": "Excellent attention",
          "Contenu": "Jungle Scout has an amazing customer service. I had a problem with the system since not all the tools in the platform  are available for Mexico, so I requested support to check this, and they were very fast in response, direct to the point, I didn't need to struggle long processes."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "David Rambaran",
          "Nb_Reviews": 1,
          "Date": "2021-07-27T00:53:00.000Z",
          "Titre": "Jungle Scout Review",
          "Contenu": "Quick and responsive to issues experienced while using the extension.Issues will always pop up, this is the nature of things. How they are handled makes all the difference and the Jungle Scout representative (Regina) was most helpful. I would highly recommend them for their tools as well as their service."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Emerson",
          "Nb_Reviews": 6,
          "Date": "2020-12-26T08:14:20.000Z",
          "Titre": "Loads to learn and do with this tool!",
          "Contenu": "I have joined Jungle Scout two months ago and I am still learning how to use the tool, there's some much you can do with it that can be overwhelming at first, but there's also loads of guidance and instructional videos you can follow. So far, it has helped me understand the world of e-commerce in a way that I would not have done if it wasn't for what they offer."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Ashok",
          "Nb_Reviews": 1,
          "Date": "2021-03-07T08:15:49.000Z",
          "Titre": "Nice application to find product ideas | weekend plan pricing",
          "Contenu": "I bought the extension to find a product to sell on Amazon the extension and its working good, for some the products the extension not showing any data . I don’t know what is the issue. Overall nice tool.Suggestion from me is to keep prices as pay per use or weekend plan or something because i only use the application tool on weekends."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Daniel Servin",
          "Nb_Reviews": 1,
          "Date": "2020-11-28T01:41:29.000Z",
          "Titre": "Great contribution to my workflow",
          "Contenu": "The tools are very important to have and they are there for helping us in this journey, I'm rating 4stars because on Amazon Mexico I'm having some issues retrieving all the data accurately... I don't know if it's the platform itself (Mexico) or the bad listings quality or simply it needs more work. I like it in general and has been a great contribution to my workflow. Thanks JS, hope to stay for long!"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Willian  Sobral",
          "Nb_Reviews": 2,
          "Date": "2021-06-13T11:42:31.000Z",
          "Titre": "Great Information and Materials to help Seller Succeed",
          "Contenu": "The information provided by the software and the training materials are great and on point. Really helpful. You're doing an amazing job on that front. The software however is buggy. Buttons sometimes don't work and often when I open it on Chrome the format doesn't look right. I have to use Safari for the product database and then Chrome for The Plugin, but nothing that will prevent someone from using the product. Product experience is very important to me, otherwise, it'd be a 5 star from, no doubt."
        },
        {
          "Note": 4,
          "Lieu": "EC",
          "Pseudo": "Gino",
          "Nb_Reviews": 5,
          "Date": "2020-09-09T21:20:13.000Z",
          "Titre": "Two things that I would like to get easier",
          "Contenu": "Don't know if it's just me but every time I enter Junglescout from my cellphone to my laptop I have to log in. I suppose it logged out automatically for security but it's kind of annoying.Another thing that bothers me is that if I want to add a new product to a product group I have to zoom out the Chrome screen in order to be able to scroll down to the desired product group (since i have more than ten). Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DF",
          "Nb_Reviews": 2,
          "Date": "2020-11-18T19:46:44.000Z",
          "Titre": "Jungle Scout has valuable information…",
          "Contenu": "Jungle Scout has valuable information for new and experienced sellers. I have learned so much.  The tips and weekly webinars are great educational tools.Support reaches out in a timely manner on resolving and answering questions. It would be nice to see the subject of the initial issue displayed in the email subject line instead of the ticket number. It is easier for end-users to navigate and decipher through the work order tickets that are in the Inbox."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Avitug",
          "Nb_Reviews": 1,
          "Date": "2021-01-27T21:29:44.000Z",
          "Titre": "Promotion was on Facebook",
          "Contenu": "Response time was great. I put 4 stars because there was actually a promotion I saw on Facebook but was not given that option or explanation why I wouldn't be eligible for it. The promotion didn't mention anything if that it is for new or existing members. Overall, I'm still satisfied with the service. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick Bowen",
          "Nb_Reviews": 1,
          "Date": "2021-02-06T06:43:21.000Z",
          "Titre": "I am glad my issue was resolved and I…",
          "Contenu": "I am glad my issue was resolved and I got a refund, but it was a little frustrating that I had to reach out again to cancel my subscription and get a refund. Also it seems that without posting in the facebook group I would have had to wait even longer for a response. I am not mad but it was a frustrating moment."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "christopher",
          "Nb_Reviews": 1,
          "Date": "2020-10-25T08:26:17.000Z",
          "Titre": "Gives a lot of insight",
          "Contenu": "Gives a lot of insight, and there's  also a lot of training content which is a god send for beginners. The price is reasonable compared to others. The only thing I would say is the program that's used to find the supplier of already selling products (to me) just seems to general random suppliers. Please correct me if I'm wrong though as I'm still fairly new at all this, but on the whole I'm pleased with the information that's given by Jungle Scout."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Afolabi olawale",
          "Nb_Reviews": 1,
          "Date": "2022-02-27T15:10:38.000Z",
          "Titre": "JS has really been doing well giving…",
          "Contenu": "JS has really been doing well giving people more insight on how to get a source product and factors to consider to be able to make your product on point. This has really helped me in building my own e-commerce. Thanks to you JS"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2020-10-21T16:26:44.000Z",
          "Titre": "Overall the software is beneficial when…",
          "Contenu": "Overall the software is beneficial when you're beginning to sell on Amazon. It provides great insight into the products' details - daily sales, monthly sales, rankings, amount of sellers, etc. Sometimes I find the software to have glitches and not work as it's supposed to, but overall I really like it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "CraigMCalvert",
          "Nb_Reviews": 1,
          "Date": "2020-01-13T12:21:08.000Z",
          "Titre": "Great resource!",
          "Contenu": "I found Jungle Scout to be a great resource, and their free guides - especially the Million Dollar Case Study - to be incredibly useful, however I would recommend not limiting yourself to the recommended search settings, otherwise you will be seeing the same results as everyone else who is searching and wind up launching the same products at the same time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karima",
          "Nb_Reviews": 1,
          "Date": "2020-12-26T09:46:57.000Z",
          "Titre": "in the product tracker",
          "Contenu": "in the product tracker, I faced a technical problems to classify my ungrouped productroll down menu was not showing all the product titles I created I contacted the help center within 2 days we succeed to fix it hope that this feed back will encourage JS to improve the interface to avoid recurrence"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Adriana",
          "Nb_Reviews": 1,
          "Date": "2020-02-12T01:19:20.000Z",
          "Titre": "Jungle Scout is wonderful",
          "Contenu": "Jungle Scout is wonderful. I've tried others, and none like you. My suggestion is to have the option of the Spanish version ... we are many Latinos using it and it will be very easy for us to be in our language.You should have promotions for those who have already bought a product and want to buy it again, like the app. By far .... the best !!!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Robin",
          "Nb_Reviews": 1,
          "Date": "2019-09-08T17:19:09.000Z",
          "Titre": "Just starting out with this app",
          "Contenu": "Just starting out with this app. I think it could use more videos on how to use the product effectively - rather than having to search for YouTube video's from other people.------Much later - Many thanks to the team at Jungle Scout, I have looked at a number of the training videos in the app and they are well laid out and very informational. All falling into place now!"
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Fernando Gabriel Morales",
          "Nb_Reviews": 2,
          "Date": "2021-01-13T01:47:49.000Z",
          "Titre": "Good customer support",
          "Contenu": "Keyword Scout could not generate the CSV file. I contacted customer support and the issue was solved next day. Although I'm pretty satisfied with the response, the only reason I don't give them five stars is because I was focused and that issue distracted me and made me lose time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jarod",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T16:30:45.000Z",
          "Titre": "Decent product & service",
          "Contenu": "If one purchases the lifetime chrome plugin (~$500) it becomes useless without the $197/yr subscription. That’s a bit schistery. Not to mention, that there is no notification of the annual charge also seems like the focus is on profit over customers. The lack of any form of communication aside from email also doesn’t sit too well (instant messaging is “in the works”). Despite these issues, I would still recommend the product and company. They will put forth every effort to make sure you are satisfied."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Peter Weber",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T14:16:55.000Z",
          "Titre": "Jungle Scout and the Extension had bugs…",
          "Contenu": "Jungle Scout and the Extension had bugs and could not be fixed for a long time. For this I would give 3 stars. On the other hand, the support people tried very hard to fix the bugs and were generous with the compensation. Therefore I give 4 stars. I will continue using JS. Thanks Folks!"
        },
        {
          "Note": 4,
          "Lieu": "VU",
          "Pseudo": "Frank Kingston",
          "Nb_Reviews": 2,
          "Date": "2019-04-23T05:29:14.000Z",
          "Titre": "HI Guys",
          "Contenu": "HI Guys Love your system but I still get confused with things ( as you do when your 70 LOL) finding suppliers is our problem with products that are not over run by sellers already on Amazon and not sure where to go to try to find those not exclusive but products that only have a few sellers.I know we will do fine once we get sorted out just trying to compensate for a lack of a decent pension and make a decent living Best Regards Frank KingstonThe Moni Tree LLC"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Francisco",
          "Nb_Reviews": 3,
          "Date": "2020-12-23T04:42:58.000Z",
          "Titre": "Excellent Customer service",
          "Contenu": "Excellent Customer service. Very attentive and knowledgeable. Fix any issues right away. Only downside is having to respond on the same email and on top of the email received... but other than that you guys Rock! Keep up the good work and thank you...Best regards Francisco"
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Camila Beatriz Schmidt Cid",
          "Nb_Reviews": 4,
          "Date": "2020-12-09T10:41:22.000Z",
          "Titre": "It is a great product",
          "Contenu": "It is a great product. The academy and the facebook group helped me a lot. I'm cancelling my subscription just because I found something better that includes more tools. But overall it is awesome. And whenever I had an account problem, the customer service was incredible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2019-05-31T00:54:45.000Z",
          "Titre": "The Best Product for Amazon Sales I…",
          "Contenu": "The Best Product for Amazon Sales I know of.  Sometimes the Tracker seems to give me really way too high prices, but this might be my perception / lack of digging into the prices on Amazon on that particular product.  I love the Database, the Supplier tool & I really look forward to the Launch tool !"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jackson Manson",
          "Nb_Reviews": 1,
          "Date": "2021-09-17T00:15:59.000Z",
          "Titre": "feedback",
          "Contenu": "All learning videos are amazing platform is easy to use .only bad thing is half the tools and features don't work for my country. (AUD) I wanted to start up my amazon store here in Australia but there's not data"
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Fernando Gabriel Morales",
          "Nb_Reviews": 2,
          "Date": "2021-01-27T02:05:22.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "The customer service response was excellent, period! The problem was the Jungle Scout app, I had two issues within a couple of days, and again the problem were in their side. Ideally I would like to do my work without the aid of customer support."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jerry",
          "Nb_Reviews": 2,
          "Date": "2020-11-17T21:09:49.000Z",
          "Titre": "Just wish data would upload quicker",
          "Contenu": "Just wish data would upload quicker. For example rank tracker. Sometimes seems to take long. Otherwise very useful software and still a lot to grasp, but with the training and videos available, I think it’s worth it. ThanksJerry Medeiros JLMM Inc."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Sarmad Haqi mohammed",
          "Nb_Reviews": 3,
          "Date": "2021-12-28T17:09:39.000Z",
          "Titre": "JS is useful",
          "Contenu": "JS is useful. However,  some product data are not available (N/A)Moreover, as we don't know the original destination of the buyer, we don't know in which market our product has sold the most"
        },
        {
          "Note": 4,
          "Lieu": "BD",
          "Pseudo": "Masum Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T03:07:48.000Z",
          "Titre": "your feedback is great",
          "Contenu": "Your feedback is great. Thank you for that."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Chiara",
          "Nb_Reviews": 1,
          "Date": "2019-01-20T14:37:47.000Z",
          "Titre": "Very good but we need an app for cellphone",
          "Contenu": "Jungle scout is a very useful program for the amazon sellers, the service is very good and the customer care too. It would be even better If we could have a JS app for iphone and smartphone, so if you are often on the road you don’t have to stop your amazon search."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jenny J",
          "Nb_Reviews": 1,
          "Date": "2020-12-07T19:57:20.000Z",
          "Titre": "track a product",
          "Contenu": "When I tied to tick a product to in to tracker from database, sometimes the system didn't respond. Back and force, I had to try a few times. This happened to some products but not to others, so it would be the speed of my wifi."
        },
        {
          "Note": 4,
          "Lieu": "KH",
          "Pseudo": "CHEAM Lyheang",
          "Nb_Reviews": 2,
          "Date": "2021-02-02T00:52:46.000Z",
          "Titre": "Unsubscribe plan problem",
          "Contenu": "yes, look so good, the support team is acceptable, but the program when I want to cancel (unsubscribe) hard to understand. Jungle Scout should let customer see the bottom easily and fast press to cancel the plan if they need."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth Walch",
          "Nb_Reviews": 2,
          "Date": "2021-03-25T14:46:00.000Z",
          "Titre": "Jungle Scout is a powerful tool",
          "Contenu": "Jungle Scout is a powerful tool. It is not as intuitive as I would like because I’m not really techie but I am getting the hang of it. Their support is really good and fast when I have questions. I enjoy working with it."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "MELANIE",
          "Nb_Reviews": 6,
          "Date": "2019-03-21T13:24:47.000Z",
          "Titre": "Great value for a good price",
          "Contenu": "I really love the product, especially the chrome extension! Also great customer support and awesome tutorials on YouTube. The only reason for not giving a 5-star-rating is the not yet enrolled Keyword Scout tool for Europe. I hope this will come soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fabiola",
          "Nb_Reviews": 1,
          "Date": "2018-11-29T19:51:08.000Z",
          "Titre": "Best product for selling on Amazon !",
          "Contenu": "I had a issue that was not being resolved in the time I felt should had.Being new to Jungle Scout and Amazon I was freaking out. But..at the end all my fears where addressed by Jungle Scout and all is back to running normal.  Thanks Jungle Scout!"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "SIS BIM (SisBiimTV)",
          "Nb_Reviews": 2,
          "Date": "2020-06-17T19:50:36.000Z",
          "Titre": "They made it up to me",
          "Contenu": "I'm somewhat disappointed ! I would expect that this is supposed to be a cutting edge company that would have a chat option, so they can respond to customer queries in real time. So the only option is to send an email and wait ( perhaps for days) to get a response to a query raised.  I've not even started using the product yet because I'm unable to download the extension. Off the gate customer service is rated one star! I mean not a company like this .. no chat option!Okay i was impressed about how Jungle scout redeemed this situation. Im glad that brands are catching on to the fact that its all about perception. Thanks Jungle scout!"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Dhole.net",
          "Nb_Reviews": 5,
          "Date": "2021-01-20T10:20:32.000Z",
          "Titre": "Very nice tool to find the niches",
          "Contenu": "Very nice tool to find the niches. The data are very accurate.However, we had some technical issues with the Jump Sent and the email campaigns are not adapted for european countries.The Dashboard would also be improved."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Ragesh Valath",
          "Nb_Reviews": 1,
          "Date": "2020-11-28T11:46:33.000Z",
          "Titre": "I have used Jungle Scout in free trial…",
          "Contenu": "I have used Jungle Scout in free trial of 14 days and found lot of new techniques and advaced process . Unfortunately I am going to be busy in other business for 6-8 moNTHS AND i AM NOT GOING TO USE THIS. ONCE AGAIN THANKS ."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T23:53:54.000Z",
          "Titre": "I enjoyed the platform and got alot of…",
          "Contenu": "I enjoyed the platform and got alot of great information. Was easy to use and made research proactive. Canceling our account was difficult in that regard the website was not user friendly."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Olivia Mangaya ay",
          "Nb_Reviews": 2,
          "Date": "2023-06-03T09:29:01.000Z",
          "Titre": "Good support team!"
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Moises Tatis",
          "Nb_Reviews": 2,
          "Date": "2021-09-16T18:52:35.000Z",
          "Titre": "I'm giving a 4 stars because I just…",
          "Contenu": "I'm giving a 4 stars because I just started using the service. Although at this early stage has been so far so great, and deserves 5 stars, I'm leaving room for further experiences with them."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris Ward",
          "Nb_Reviews": 3,
          "Date": "2021-01-27T17:29:08.000Z",
          "Titre": "A comprehensive, quality package.",
          "Contenu": "Jungle Scout is a very-well-thought-out product, giving tons of value by way of data insights, tips, and professional advice. It takes away all the excuses for failure so, if that happens, it's down to me."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2019-07-11T00:12:48.000Z",
          "Titre": "Maybe adding an additional que that…",
          "Contenu": "Maybe adding an additional que that tells us if it is doable or not , as I find this somewhat overwhelming trying to make the RIGHT choice on my product . Amz Scout Pro offers this but the site is fussy to use sometimes ..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jimmey Loya",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T18:05:26.000Z",
          "Titre": "Work",
          "Contenu": "I love the data that junglescout provides and it allows me to work easier and faster.  It’s accurate, trustworthy, and credible."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "MR. MO",
          "Nb_Reviews": 1,
          "Date": "2020-04-09T17:40:04.000Z",
          "Titre": "chrome extension is very useful but the…",
          "Contenu": "chrome extension is very useful but the product database give results few efficient. each time, the product is low opportunity score in the chrome extension. So, i use more chrome extension that product database."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Emilio",
          "Nb_Reviews": 1,
          "Date": "2019-10-29T16:25:08.000Z",
          "Titre": "My experience is good",
          "Contenu": "My experience is good, but I sent you a email because there is a problem with the email campaigns because for some countries there are products that are not showed. So, I can not select all products for the campaign."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 3,
          "Date": "2019-04-14T16:40:43.000Z",
          "Titre": "I love it except sometimes I have no…",
          "Contenu": "I love it except sometimes I have no doubt something is wrong with your assessment of the category - about 5% of the time, I see something with thousands of reviews and it gives is a \"low competition\" rating."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Karl",
          "Nb_Reviews": 1,
          "Date": "2019-09-28T12:50:25.000Z",
          "Titre": "Great product for launching new…",
          "Contenu": "Great product for launching new product. I found it very useful tool however, I had a poor conversion rate for review from the buyers. Need to further investigate the reason. Nonetheless, I recommend this product."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Mallikarjuna YC",
          "Nb_Reviews": 8,
          "Date": "2022-01-09T17:35:48.000Z",
          "Titre": "Support people are knowledgeable and they care about the customers",
          "Contenu": "I had lot of doubts on using the software. All these were cleared. I had contacted the support team. and I got solutions to the issues that I had mailed them. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "flavio",
          "Nb_Reviews": 2,
          "Date": "2019-03-18T20:27:14.000Z",
          "Titre": "I'm beginning in the days to use…",
          "Contenu": "I'm beginning in the days to use junglescout, my first impressions are really very good, it's a great help to build my business.I have still to learn all that junglescout offers, but the beginning is great"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Sarfrazul Ameen",
          "Nb_Reviews": 1,
          "Date": "2021-01-14T00:36:33.000Z",
          "Titre": "I was having problems not able to get…",
          "Contenu": "I was having problems not able to get access to my chrome extension and the advise given by the JS Helpdesk was to uninstall and re-install the Chrome Extension. It worked and solved my problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Lynne",
          "Nb_Reviews": 1,
          "Date": "2018-12-02T19:47:38.000Z",
          "Titre": "Updated Review-Good tool to use",
          "Contenu": "I got a reply from Jungle Scout to access my account again and am happily using their service. I am updating my review to reflect the value I see in product research on Amazon and would recommend checking them out."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Keith Diduch",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T16:13:05.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I had my first question and it was answered fast and very good solution provided and relatively easy to navigate around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:26:02.000Z",
          "Titre": "Quick Response from a Real Person",
          "Contenu": "They responded to my request in just a few minutes and I could tell it was a real person.  I bought the wrong service, but now I have the right service and my refund is will be done in 5-10 business days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katiana beatriz Fuenmayor",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:51:50.000Z",
          "Titre": "My experience was great",
          "Contenu": "My experience was great. They responded to me as soon as I asked my question and resolved the problem."
        },
        {
          "Note": 5,
          "Pseudo": "Alton Rose",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:50:29.000Z",
          "Titre": "Buy Verified paypal Accounts",
          "Contenu": "Buy Verified paypal Accounts. We can give you the best paypal account. 100% trusted. Email, number, ssn, driving license, passport, photo I’d card verified than others dukuments access verified paypal account."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Abraham Great",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T04:42:02.000Z",
          "Titre": "The experience so far as been terrific",
          "Contenu": "The experience so far as been terrific. I enjoyed the quality of the information on YouTube. I also enjoyed the quality of the video production and audio. The live chat adviser was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Gutierrez",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T03:00:36.000Z",
          "Titre": "I contacted support for a partial…",
          "Contenu": "I contacted support for a partial refund and Eva responded promptly, was super sweet and resolved my issue. 10/10 no brainer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isaac Hannah",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T23:13:27.000Z",
          "Titre": "2 Thumbs Up to you guys...",
          "Contenu": "Jungle Scout made it easier for us to move forward with our business preparation start-up accounts, after not being able to get the results we were looking for. They helped us get back on track and we know that we can get feedback in a timely manner. Thanks JungleScout!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Maxime",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:10:00.000Z",
          "Titre": "Great product AND great people",
          "Contenu": "I have to say, I never give a review for a product whether im satisfied or not. But JS is an exception, after having bought the product - i had a lot of questions, and the Customer support is just amazing, super fast, reactive, clear - we can really feel that they are there to help you, to be successful. I still havent found my product but confident in the fact that I will.One downside, let’s say is that their tool is really focus on the US market therefore have much more data, than other marketplace ( france for example )"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "María silvina  Buhanna",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:34:37.000Z",
          "Titre": "They were fast and effective",
          "Contenu": "They were fast, kind and helpful with my request. And they solve the situation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Shih",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T20:29:21.000Z",
          "Titre": "Fantastic company - Loving & Caring Founder Greg Mercer & the team!",
          "Contenu": "Greg Mercer the founder & the team is a group of caring & loving people.I admire how they put so much time & efforts into teaching others how to sell on Amazon, how to become entrepreneurs & financially independent. I admired the most is how Greg Mercer donates revenues to worthy causes around the world while teaching thru Million Dollar Case Studies!! My highest respect & salute to Greg Mercer & the team!The support the team provides is always so helpful & timely. If I could, I would give them 100 Stars!!My gratitude & blessings to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Luda Orosz",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:46:22.000Z",
          "Titre": "Exceptional Assistance and Support!",
          "Contenu": "Jungle Scout's support team went above and beyond to assist me with navigating their tools. Their prompt and knowledgeable responses were invaluable in resolving my issues swiftly. I am genuinely impressed with their dedication and commitment to customer satisfaction. Highly recommend their exceptional service!"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Juan Carlos Gardeazabal",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T02:52:50.000Z",
          "Titre": "The prompt and positive response from…",
          "Contenu": "The prompt and positive response from the support team was so great. I am deeply grateful for your kind attention. Having been able to apply for the Friday offer means a lot to me; it was only possible because of the big help you have provided to me by responding so kindly and positively. Big thanks."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "احمد سكروه",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T14:46:21.000Z",
          "Titre": "The customer service were very helpful",
          "Contenu": "The customer service were very helpful, and they replied to me right the way with clear points, and I’m glad they put my email in the list to receive a notification whenever the JS data works in Saudi Arabia."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jakob Harris",
          "Nb_Reviews": 10,
          "Date": "2023-12-04T19:29:48.000Z",
          "Titre": "Great team, great service",
          "Contenu": "I`ve used these services for my business for a couple of months now and I can say it is fantastic. I`m not very tech savvy, however, the team help me out with some useful info. Definitely five stars!"
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T10:36:50.000Z",
          "Titre": "Team addressed my issue quickly and it…",
          "Contenu": "Team addressed my issue quickly and it was solved immediately."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Sergio",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T10:03:10.000Z",
          "Titre": "Fast and reliable since at the beginning",
          "Contenu": "I just join a new yearly plan with JS so I have not so long experiences with them but at the first little issue by changing my plan from monthly to yearly they were super fast to reply and solving my problem. I can say  this is a great start!"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "amg investments",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T21:17:06.000Z",
          "Titre": "Amazing",
          "Contenu": "The support team replied in less than 5 minutes, I really appreciate your support."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "JOHN JAIRO",
          "Nb_Reviews": 5,
          "Date": "2023-12-17T00:15:04.000Z",
          "Titre": "Very good service and always on proper…",
          "Contenu": "Very good service and always on proper time"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Don",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T05:20:39.000Z",
          "Titre": "Jungle Scout refund",
          "Contenu": "My father was using Jungle Scout for 3 years however he suffered several strokes last year and was unable to continue his business. His Jungle Scout subscription automatically renewed without his knowledge and went unnoticed for a month. When we contacted Jungle Scout and explained the situation to them they agreed to refund the purchase even though he had gone beyond the 7 days trial period detailed in their terms. This is a company that stands by their good name, has morals,  and integrity. I can't see enough good things about them!!!"
        },
        {
          "Note": 5,
          "Lieu": "QA",
          "Pseudo": "Shamail Aijaz",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T15:20:21.000Z",
          "Titre": "Jungle Scout: Your All-in-One Amazon Business Companion",
          "Contenu": "Jungle Scout is a game-changer for Amazon sellers. It's an all-in-one toolkit that covers everything you need to thrive on the platform. From its Academic Section for expert guidance to a comprehensive Supplier's Database, product hunting tools, marketing assistance, and inventory management features, it streamlines the entire process. Plus, the icing on the cake is their exceptional support team, always ready to help with any issues. With Jungle Scout, you won't need a dozen different tools – it's a one-stop shop for Amazon business success."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Diyana Dimitrova",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T15:52:59.000Z",
          "Titre": "JS is one of the best Amazon-related software on the market",
          "Contenu": "Jungle Scout is by far the most accurate software I have used for sales estimation on Amazon. This helps me with market and product research that I do on a weekly basis for my clients. The extension is useful and very user-friendly. If you run into issues, the customer support team is quite responsive and polite."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T22:30:22.000Z",
          "Titre": "Good product. The best customer support.",
          "Contenu": "Jungle Scout is a top-notch product for looking over a huge amount of information in Amazon, and automating things to take minutes that would otherwise take hours.The product is cool - but the customer support is the best. Replies are always extremely quick, yet detailed enough to leave me with no further questions."
        },
        {
          "Note": 5,
          "Pseudo": "smmserviceonline",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:42:02.000Z",
          "Titre": "best website.",
          "Contenu": "best website.Buy verified paypal accounts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T22:37:11.000Z",
          "Titre": "quick and efficient customer support",
          "Contenu": "The customer support team was extremely quick to respond; I had multiple emails sent back and forth and within a very short time my entire issue was resolved. The team member who worked with me was polite and helpful. Overall I was extremely pleased with how quickly and efficiently the customer support team responded and resolved my issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Najeebuddin Mohammed",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:50:38.000Z",
          "Titre": "EXCELLENT",
          "Contenu": "QUICK SERVICE"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Nadeemkasuri",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T07:48:07.000Z",
          "Titre": "I was saved from being fraud.",
          "Contenu": "As i text about the page  because the admine of the page asked me to invest 100 dolars  and said that it will return . I invested 100 dollars . When asked for returning with profit he said that i have to pay 50 dolars again to return  but i refused to pay. He said that he will bloke my account on which i invested . Then i searched this one and asked . Just in one day email was received that he was fake. Thanks alot. Excellent suport. Becuse  i was saved my 50 usdt from being again fraud. Thanks alot again"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rockerly Desronvil",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T05:02:38.000Z",
          "Titre": "My expérience with the costumer service…",
          "Contenu": "My expérience with the costumer service was fast and great"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Abo Younus",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T21:24:18.000Z",
          "Titre": "The tool works well after I encountered…",
          "Contenu": "The tool works well after I encountered a problem with the purchase process and it was solved for me by the support team. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "RC",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T23:30:20.000Z",
          "Titre": "Customer support is phenomenal",
          "Contenu": "I am just starting with Jungle Scout and haven't had a chance to fully explore it, but their customer support is phenomenal."
        },
        {
          "Note": 5,
          "Lieu": "QA",
          "Pseudo": "ZM",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T16:18:29.000Z",
          "Titre": "Customer Service",
          "Contenu": "I recently had the pleasure of using Jungle Scout, and I must say, it exceeded my expectations in every way. From the moment I reached out with a concern, the customer service team displayed unparalleled responsiveness and professionalism. They promptly addressed my issue, leaving me thoroughly impressed with their dedication to customer satisfaction"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Emad Alsayad",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T03:06:34.000Z",
          "Titre": "thanks JS",
          "Contenu": "JS provides the required support in the right time,  In addition to a wonderful academy by all standards, one of the most important things is online Webinar on Tuesdays to learn about the latest developments and immediately answer all questions. I am really very happy that I am a member of the JS community."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sotheavy  Charlberg",
          "Nb_Reviews": 17,
          "Date": "2023-11-04T00:54:06.000Z",
          "Titre": "Hello!",
          "Contenu": "Hello!I was had some issues about my account earlier today, and I sent email to JS support team to get some advices. It was really helpful and responding quickly. Thank you for your time and recommendation!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Salovich",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T18:36:31.000Z",
          "Titre": "My issue was taken care off as quickly…",
          "Contenu": "My issue was taken care off as quickly as could be with expected with plenty off feedback."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Abdul rahman shams Shams tabra",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T04:01:06.000Z",
          "Titre": "It was my first time using JS.",
          "Contenu": "It was my first time using JS and it was super User Friendly, though it required a few guide lines but it was very easy after using that, the chrome extension is awesome !!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Mussab Aslam",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T09:35:14.000Z",
          "Titre": "The extension runs smoothly on chrome",
          "Contenu": "The extension runs smoothly on chrome. I have had some issues in the estimates but support team helped me troubleshoot the issue till the resolution. I am very happy and satisfied with the support team."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "C. Zarakol",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T15:38:32.000Z",
          "Titre": "Talking to a real person who explained…",
          "Contenu": "Talking to a real person who explained the situation in a friendly way"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Ibrahim abdul Janan",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T19:38:00.000Z",
          "Titre": "By mistake i took 1 year plan instaed…",
          "Contenu": "By mistake i took 1 year plan instaed of monthly. Miss Regina help me in refunding at once.she told me will be refunded with in 5 to 10 business days my money . I appreciate her help❤️❤️"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Carole",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T23:31:29.000Z",
          "Titre": "Perfect and hyper-reactive team",
          "Contenu": "Perfect and hyper-reactive team, kind, patient and pleasant. I've had very quick responses every time I've contacted them. They really care about solving problems."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Abdul moeed Amir",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T14:05:42.000Z",
          "Titre": "It was great working with Jungle scout…",
          "Contenu": "It was great working with Jungle scout the customer support was extraordinary cooperating especially Levi one of their team member. It was a great experience working with them"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Cristian Fonseca",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T14:25:48.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use and to understand all statistics involved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sotheavy  Charlberg",
          "Nb_Reviews": 17,
          "Date": "2023-12-10T06:44:48.000Z",
          "Titre": "Thank you for sharing me with new…",
          "Contenu": "Thank you for sharing me with new Jungle Scout and new update. I would like to take my time to learn about it how to use it. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Oconnell",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T23:30:30.000Z",
          "Titre": "The great Academy of teaching videos…",
          "Contenu": "The great Academy of teaching videos that are more accurate and educational than Amazons. The extremely quick and thorough responses from Jungle Scout support team are amazing. It really helps to get quick responses when you’re working through a problem and need to get it done now."
        },
        {
          "Note": 5,
          "Lieu": "QA",
          "Pseudo": "Azaharuddin Ayub ali",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T10:05:17.000Z",
          "Titre": "The best",
          "Contenu": "Jungle scout is the best tool for Amazon sellers."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Niaz morsalin Rafy",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T18:22:21.000Z",
          "Titre": "Amazing customer service.",
          "Contenu": "This is a great service for anyone looking to use Jungle scout to help scale their Amazon business, easy to use with a buffet of data available at the finger tips. The best about Jungle scout is the amazing customer service with fast response able to resolve any issues that you might have."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Angelina  G",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T15:57:10.000Z",
          "Titre": "Great service",
          "Contenu": "Edward answered all of our questions. He was very informative and helpful. Pleased with his responses. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tony S",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T19:25:08.000Z",
          "Titre": "Thank you so much Jungle Scout",
          "Contenu": "I was really sad that I had to leave them because I'm not happy with the  main competition Helium 10 but unfortunately, their software was a little bit even slower, but the service was so much better you could actually talk to a real person instead of going round and round in a circle with Helium 10 . Thank you so much Jungle Scout"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Wysocki",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T16:17:48.000Z",
          "Titre": "Must Have For New Amazon Sellers",
          "Contenu": "Jungle Scout has been an invaluable resource in helping our company prepare our first product launch on Amazon. Their tools, learning resources and customer support are amazing, especially for those who need a little extra guidance with developing a successful Amazon sales channel. Very satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Milym",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T16:50:30.000Z",
          "Titre": "Appreciate Your Help",
          "Contenu": "The Jungle Scout team was able to come into an agreement with me and assess my concern promptly, helping me with my current needs. I appreciate I was able to resolve the billing issue. I am a firm believer that reviews help both ends of the equation to prosper in our business ventures. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mirline",
          "Nb_Reviews": 3,
          "Date": "2023-10-27T20:13:03.000Z",
          "Titre": "Highly recommend",
          "Contenu": "I never have any issues figuring out what to do on Jungle scout. Easily managed and thee are videos available to help, I think that’s huge plus"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T22:58:19.000Z",
          "Titre": "Support",
          "Contenu": "I have been using jungle scout for almost 1 year. I can say that I have opened several cases and they have always treated me perfectly. Until we solve the problems they continue with their good attention and good treatment, I am delighted with the great support they give and it is something to emphasize and congratulate"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "True to Yourself Arbitrage",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T20:57:52.000Z",
          "Titre": "Very nice people",
          "Contenu": "Very nice people Valuable information Everything was great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alden Alkas",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:15:57.000Z",
          "Titre": "Customer service was quick and helpful",
          "Contenu": "Customer service was quick and helpful in fixing my issue. I recently opened my account and so far I view customer service very reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joaquin Schamber",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T13:52:19.000Z",
          "Titre": "Happy customer here",
          "Contenu": "The tool is great in itself. The academy videos are amazingly clear and helpful. The customer support was quick and easily solved my problem. A happy customer here :)"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Naila Trading",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T10:42:04.000Z",
          "Titre": "Amazing tool and best customer service",
          "Contenu": "Amazing tool and best customer service, response time is very quick and i got answers to all my queries and concerns when asked..."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Santiago Turnay",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T11:33:40.000Z",
          "Titre": "Nice starting experience",
          "Contenu": "I'm starting in Jungle Scout and I think that the initiation course is of great help. They also help me with one problem and solve it making me a favour."
        },
        {
          "Note": 5,
          "Lieu": "LB",
          "Pseudo": "Violette Nehme",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T10:18:50.000Z",
          "Titre": "Jungle Scout Support Team: The Best in the Business",
          "Contenu": "I'm so impressed with the Jungle Scout support team. They are knowledgeable, helpful, and friendly. I highly recommend Jungle Scout to anyone who is serious about selling on Amazon."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Rennison",
          "Nb_Reviews": 7,
          "Date": "2023-10-27T14:25:24.000Z",
          "Titre": "Great customer service.",
          "Contenu": "Good software and I inadvertently paid up for a whole year when I wanted a monthly plan. Just one email to customer services and it was sorted. Can’t fault that."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Vlad Ra",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T14:37:55.000Z",
          "Titre": "Questions about paying",
          "Contenu": "I had questions about paying for my subscription. The manager and the company met me halfway in resolving the controversial issue. I felt caring about the clients. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Syed",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T02:32:03.000Z",
          "Titre": "Jungle Scout proved to be a lifesaver…",
          "Contenu": "Jungle Scout proved to be a lifesaver when my LLC process was taking longer than expected, causing a delay in my services. Their assistance in facilitating a refund was exceptional. They were prompt, efficient, and understanding throughout the process, ultimately helping me regain control of my resources. I'm grateful for their support during this challenging time."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "jordan baylock",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T23:38:53.000Z",
          "Titre": "I had a few questions about amazon fba…",
          "Contenu": "I had a few questions about amazon fba jungle scout always replied to me and answered all my questions. Overall it's been nothing but quality service"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "maher my tech",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T08:35:47.000Z",
          "Titre": "I loved working with you",
          "Contenu": "I loved working with you, but I have a problem with the language. My experience was good. I liked the speed of response as well as the services provided by the company. I hope you have it in your database. Interest in languages."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse R",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T04:12:36.000Z",
          "Titre": "Capabilities are extremely helpful",
          "Contenu": "JungleScout capabilities are extremely helpful across multiple areas of selling on Amazon. Highly recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Janice Lehr",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T01:34:43.000Z",
          "Titre": "Great service and quick response",
          "Contenu": "Great service and quick response. A very positive experience with a problem I had."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ayush Varshney",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T21:12:30.000Z",
          "Titre": "My experince with jungle scout tool is…",
          "Contenu": "Annika Thank you! for helping out me for resolving my issue. I really appreciate your suggestions and i have started implement it. Love you and take care"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cuitláhuac Utrera gonzález",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T06:23:32.000Z",
          "Titre": "It's great to find companies with this work ethic.",
          "Contenu": "The kind treatment and attention they give to people is great; In my experience, doing business with Jungle Scout was not doing business between computers, but between people. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Circiumaru Alexandra",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T18:20:51.000Z",
          "Titre": "They responded immediately",
          "Contenu": "They responded immediately, very nice and involved, Thank you very much !"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Corina Patriche",
          "Nb_Reviews": 2,
          "Date": "2023-09-23T05:41:07.000Z",
          "Titre": "E-commerce Insights Made Easy with Jungle Scout",
          "Contenu": "Jungle Scout has been an invaluable tool for my e-commerce journey. Its intuitive interface and comprehensive data have helped me identify profitable products and make informed decisions. It's a must-have for anyone in the e-commerce business."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Irfan Ali",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T16:03:47.000Z",
          "Titre": "Satisfaction guaranteed",
          "Contenu": "I like jungle scout for their quick and related reply and guiding till the we satisfied. I found JS is the best for all who are interested in start business on Amazon you will find a lot of help from here. Thanks JS"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Katherine Ramirez restrepo",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T21:32:47.000Z",
          "Titre": "Hello!",
          "Contenu": "I appreciate your prompt response and efficient follow-up. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Haroon",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T09:25:11.000Z",
          "Titre": "I recently had an inquiry about Amazon",
          "Contenu": "I recently had an inquiry about Amazon, they solved my problem quickly and efficiently, and I am very impressed with their level of support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evren Sen",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T04:10:38.000Z",
          "Titre": "Both the product quality and support…",
          "Contenu": "Both the product quality and support are top notch team. I wish your subscription prices were a bit more affordable though. Al in all, thanks a lot for your great service."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Futuremillionaire",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T22:48:05.000Z",
          "Titre": "The customer support team replied to me…",
          "Contenu": "The customer support team has replied in time and solved my problem.That's why, I appreciate them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chavie Blasbalg",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T19:57:55.000Z",
          "Titre": "Customer support experience was great",
          "Contenu": "Customer support was quick even in middle of the night!  Instructions to correct an issue were thorough, easy to follow and worked."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Salim",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T07:38:52.000Z",
          "Titre": "I had the pleasure of interacting with…",
          "Contenu": "I had the pleasure of interacting with Regina from Jungle Scout's Support Team, and I cannot express how impressed I am with her outstanding assistance. Regina went above and beyond to address my inquiry, showing exceptional professionalism, patience, and efficiency throughout the process.Her warm and friendly demeanor made me feel valued as a customer. I am truly grateful for the level of care and attention she provided.If you're looking for a company that not only offers a great product but also exceptional customer service, look no further. My experience with Regina reaffirms my confidence in Jungle Scout as a reliable partner for my business needs.Thank you, Regina, and the entire Jungle Scout team, for your dedication to customer satisfaction!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sam  F",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T11:02:22.000Z",
          "Titre": "Very prompt and efficient customer…",
          "Contenu": "Very prompt and efficient customer service support. Issue was dealt with within the hour."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AMS",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T21:45:48.000Z",
          "Titre": "Quick Response",
          "Contenu": "It was great to have your quick response on what I needed."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Kashif Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T09:37:38.000Z",
          "Titre": "Jungle scout has gained my trust well…",
          "Contenu": "Jungle scout has gained my trust well and they supported me well by understanding my scenarios. The response is quick."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MisterT",
          "Nb_Reviews": 27,
          "Date": "2023-09-20T19:02:08.000Z",
          "Titre": "Excellent software",
          "Contenu": "Excellent software, and a fast and super efficient support team providing a complete solution for Amazon research. Top team, thanks."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Aaron Saez",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T13:03:33.000Z",
          "Titre": "Great customer service",
          "Contenu": "excellent attention. I had a problem choosing the subscription and they fixed it for me very quickly. thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniela",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T00:51:13.000Z",
          "Titre": "Great",
          "Contenu": "Very useful and easy to use"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Carmen Lachance",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T20:10:04.000Z",
          "Titre": "Change of Plan",
          "Contenu": "Quincy over at Jungle Scout was very helpful and immediately fixed the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Bosley",
          "Nb_Reviews": 4,
          "Date": "2023-09-05T06:27:16.000Z",
          "Titre": "Good customer support",
          "Contenu": "The customer support team reached out quickly to help me solve my problem. They were very responsive and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nina Colone",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T16:43:43.000Z",
          "Titre": "The software is great and gives you…",
          "Contenu": "The software is great and gives you detailed and up-to-date information.  The customer service team is also amazing to work with."
        },
        {
          "Note": 5,
          "Lieu": "QA",
          "Pseudo": "Tareck Atallah",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T12:04:38.000Z",
          "Titre": "The best in the market so far",
          "Contenu": "The best in the market so far. Customer service at its best! highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Josh Gilliam",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T23:12:19.000Z",
          "Titre": "Updating the seller account",
          "Contenu": "There was quick turnaround from the support team and my issue got resolved"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Shahid Malik",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:57:01.000Z",
          "Titre": "To be honest amazing"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Samia  Imran",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T17:34:20.000Z",
          "Titre": "Great tool for Amazon",
          "Contenu": "Great tool for Amazon. Great Service. Recommended tool for new Amazon beginner's."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Hassan Khan",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T11:26:50.000Z",
          "Titre": "My opinion is this to use jungle scout",
          "Contenu": "One of the best tool for Amazon users I have never seen any tool like jungle scout"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Buybest-now Llc",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T10:15:05.000Z",
          "Titre": "really good customer service",
          "Contenu": "really good customer service, fast responding and allways resolving!!! good job!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "C. Douglas",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T07:02:52.000Z",
          "Titre": "Such helpful customer support",
          "Contenu": "Such helpful customer support.  Very detailed instructions on how to solve the issue as well as patient and kind communication."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Khurram Raja",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T20:28:12.000Z",
          "Titre": "Thank you JungkeScout for the timely…",
          "Contenu": "Thank you JungkeScout for the timely response and resolution of my issue. It’s greatly appreciated!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Entezar Ayar Khail",
          "Nb_Reviews": 3,
          "Date": "2023-09-07T00:18:26.000Z",
          "Titre": "Great Job!",
          "Contenu": "Great Job!The jungle Scout team are the best and helpful for everyone BCS they also answers the correct time Thanks allot"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Muhammad Awais",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T19:00:25.000Z",
          "Titre": "Whatever you pay is worth it",
          "Contenu": "Quick response well maintained website helped a lot learned a lot thanks again to the jungle scout team"
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Massiel Alecio",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T02:19:48.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, quick response and they clarified my confusion with a demonstration. Customer service for this company comes first."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sotheavy  Charlberg",
          "Nb_Reviews": 17,
          "Date": "2023-09-10T04:53:30.000Z",
          "Titre": "Thank you for being here",
          "Contenu": "Thank you for being here, JS always responding quickly when I need support.Thanks."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "SP",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T00:31:20.000Z",
          "Titre": "So quick with the response!",
          "Contenu": "So quick with the response it was instant. They also helped and solved my question straight away so guess what! I’m upgrading my plan!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Aabad",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T22:00:01.000Z",
          "Titre": "My problem was solved on time and…",
          "Contenu": "My problem was solved on time and effectively and with excellent attitud."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Bhawna Kochhar",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T02:17:43.000Z",
          "Titre": "Very good customer service",
          "Contenu": "Promt and quick reply and sorted out my problem....plzz start working for amazon australia too ...Thanks heaps"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Saif Qadri",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T01:27:53.000Z",
          "Titre": "I am very new to Amazon",
          "Contenu": "I am very new to Amazon. Have learned enough through Jungle Scout. Specially; their Amazon Guide book. They have explained everything step by step. So thankful to entire team. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sotheavy  Charlberg",
          "Nb_Reviews": 17,
          "Date": "2023-08-31T02:39:08.000Z",
          "Titre": "Thank you so much for supporting me and…",
          "Contenu": "Thank you so much for supporting me and my business, I been great experience so far with JS. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Théo Hazotte",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T17:14:33.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, the team is able to respond to every issue your face!"
        }
      ]
    }
  ]
}