{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "kb-3d.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Philip Schlesinger",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T18:22:25.000Z",
          "Titre": "You sent me the wrong part",
          "Contenu": "You sent me the wrong part.  See email I sent last night after I got home and opened the just-received package."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T07:08:21.000Z",
          "Titre": "I ordered a 6020 fan and got a 4010."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thom Sturgill",
          "Nb_Reviews": 4,
          "Date": "2021-09-06T22:21:45.000Z",
          "Titre": "No tracking sent",
          "Contenu": "No tracking sent. Asking for review BEFORE package was delivered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Hill",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T17:40:15.000Z",
          "Titre": "Product never arrived",
          "Contenu": "Product never arrived. Never ship USPS. They are incompetent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Brothers",
          "Nb_Reviews": 4,
          "Date": "2022-09-05T03:12:06.000Z",
          "Titre": "Great vendors sometimes goof",
          "Contenu": "I really like (and actively promote) kd3d. This particular time I ordered black hardware for a new Switchwire build. I got silver (not black). I have not contacted them to see what should be done as I am considering how important that is to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jasmin Tetreault",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T14:26:26.000Z",
          "Titre": "Great product, long wait time",
          "Contenu": "Ordered a Voron wiring harness. Product is great, very well made. Unfortunately, it took way longer than advertised shipping times and ended up making my own harness."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jasper H.",
          "Nb_Reviews": 2,
          "Date": "2021-10-05T22:11:17.000Z",
          "Titre": "KB3D always come through!",
          "Contenu": "KB3D always come through. Items are well packed and delivered in a timely manner. I’d give them 5 stars if their prices were more competitive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Shepherd",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T00:06:52.000Z",
          "Titre": "Will buy from you again.",
          "Contenu": "Products as described, and, look good. Have not used them yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WS",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T05:47:19.000Z",
          "Titre": "Good experience",
          "Contenu": "Good experience. Hard to find parts at reasonable prices."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Ramon x",
          "Nb_Reviews": 5,
          "Date": "2023-12-09T21:46:07.000Z",
          "Titre": "i am Dutch and i will pay the extra…",
          "Contenu": "i am Dutch and i will pay the extra shipping cost and have no problem to order my stuff from kris in the futurehe supports helps allot of people and keeps the quality of his products so far i can see highIf there is a problem iam 100% sure kris is on top of it and solves the issue so all smiles again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rene Wilson",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T20:36:50.000Z",
          "Titre": "Excellent products and service",
          "Contenu": "I receive excellent products and services every time I purchase from KB3D, I havent had any issues with the speed it is shipped and any of the products I have received.  I had a question and sent an email on one product and had a response I think within the same day or it may of been the next day but I remember it being a pretty quick response."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Farmer",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T18:00:16.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent The product descriptions are great and very helpful. I find myself  user the site to help me find the full documentation of the products I have purchased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Lynch",
          "Nb_Reviews": 11,
          "Date": "2023-12-06T18:27:55.000Z",
          "Titre": "KB3D has the best balls",
          "Contenu": "KB3D has the best balls. They are superior in accuracy and finish."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:45:58.000Z",
          "Titre": "They always have the items I need at a…",
          "Contenu": "They always have the items I need at a competitive price and orders are processed quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:58:12.000Z",
          "Titre": "Always a pleasure to deal with KB-3D",
          "Contenu": "Great products and great customer service!  KB-3D has a lot of parts that other 3D printer stores do not carry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:05:26.000Z",
          "Titre": "Quality products",
          "Contenu": "Quality products, low price, super fast shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanny Pope",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:57:26.000Z",
          "Titre": "Very good company to work with!",
          "Contenu": "Address printed on the label didn't include the 2nd line as I typed it in. This nearly resulted in the order being returned. Update!KB reached out to confirm some information and it turns out I had used the wrong email address previously, so my address was adjusted on that profile, not the one that I actually use, so it was ME who had the lack of attention to detail! :P Top tier responsiveness and service. Looking forward to using parts from them for many many more builds to come. <3"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Guthrie",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T22:55:29.000Z",
          "Titre": "Extremely fast shipping",
          "Contenu": "Kris ships out extremely fast and located in the Mid-West expedites delivery to residents not located on a coast.  Appreciated and a loyal customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Adcock",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T22:35:41.000Z",
          "Titre": "Very attentive to his customers needs…",
          "Contenu": "Very attentive to his customers needs and super flexible as far as not only selling you the parts but is willing to talk you through steps that are giving you trouble while installing the items. Very knowledgeable about 3D printers and their make up. Truly a professional of his craft."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PNWPat",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T03:23:39.000Z",
          "Titre": "Order was packed well",
          "Contenu": "Order was packed well, promptly shipped, arrived in good shape."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Wright",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T19:21:48.000Z",
          "Titre": "fast shipping, good quality parts.",
          "Contenu": "I am always happy with the products I receive from Kb-3d. The shipping is pretty quick and the parts are always genuine parts. Questions i have asked are always answered quickly and professionally."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Spohr",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T23:47:19.000Z",
          "Titre": "Always the best",
          "Contenu": "Just like all my previous orders, zero complaints. Outstanding service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael C",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T23:50:11.000Z",
          "Titre": "The prices are competitive and the…",
          "Contenu": "The prices are competitive and the shipping is reasonable and fast. Standard shipping reached me in 4 days. Was a small order, but  now I will always check here first."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "QP",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T21:15:02.000Z",
          "Titre": "Amazing service",
          "Contenu": "There's no shortage of vendors in the 3D printing space, but you usually have to compromise between shipping speed, price, or product availability. When ordering from KB3D, I know that I'm getting quality products at fair prices shipped very quickly and it's quickly becoming my go-to for hobby purchases"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Bennie",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T17:30:31.000Z",
          "Titre": "I have heard nothing but good things…",
          "Contenu": "I have heard nothing but good things about KB3D. And so it is. Good, fast communication. Answered my question/s. Received my product in a timely manner, well packaged, and intact. Reasonable prices. Excellent overall."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rene Wilson",
          "Nb_Reviews": 3,
          "Date": "2023-10-07T16:07:13.000Z",
          "Titre": "Great business for your 3D needs",
          "Contenu": "This company has very competitive prices but even better than that, I get my product fast. Depending on when I place my order, I am usually getting \"it's shipped\" by next day.  I have had questions on a product and they have walked me through on things I was missing or messed up.  I highly recommend this business"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOSHUA MCVEY",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T17:59:40.000Z",
          "Titre": "Always top notch!",
          "Contenu": "Fast shipping!Quality parts!Personal service!The folks at Kb3d are awesome!Kris always responds to my questions through email or phone calls.Supporting KB3D really makes me feel like a part of a family.They're always helpful and always ship quality parts!!My kb3d stickers are sacking up!Thanks Kris and Co!"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T11:58:44.000Z",
          "Titre": "Great Company!!!",
          "Contenu": "Great selection of items, the best prices,fast processing, and the shipping...OMG!!!I have never seen packaging done this great! I am not sure if USPS is afraid of you guys but the package arrive as if it just left your hands. I relly liked the  external KB3D security sticker as proof that the box was not opened!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shing Han",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T21:08:31.000Z",
          "Titre": "Great Customer Service Kris is a nice…",
          "Contenu": "Great Customer Service Kris is a nice guy and genuinely cares about his products/customers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AlexDLabs",
          "Nb_Reviews": 5,
          "Date": "2023-10-07T17:19:13.000Z",
          "Titre": "KB-3D is my go to 3D parts shop",
          "Contenu": "KB-3D is my go to shop for 3D printer parts.Whether I'm building a new printer or accidentally breaking fan blades, KB-3D is ready.  Great prices for quality parts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T21:24:43.000Z",
          "Titre": "No complaints here!",
          "Contenu": "No complaints here!  Fast shipping, good prices, excellent selection for 3D print-ists."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin Kentopp",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T18:58:43.000Z",
          "Titre": "always a pleasure ordering from kb3d :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T15:54:06.000Z",
          "Titre": "Amazing quality products",
          "Contenu": "The quality of their products is amazing. I bought quite a few items from them and inspected each component to ensure that it would work with all my printers. I am impressed that they take such pride in making sure everything is packaged well and labeled well. I would also like to say their shipping was incredibly fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben James",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T16:00:27.000Z",
          "Titre": "Excellent seller for your 3D printing component needs",
          "Contenu": "I have ordered from KB3D multiple times and each time my order is shipped very quickly and arrives well packaged. I would highly recommend them to anyone ordering 3D printing components."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Jesse",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T17:37:04.000Z",
          "Titre": "Website is easy to navigate, competitive prices",
          "Contenu": "Website is easy to navigate, clean and uncluttered, prices are very competitive.  Orders always ship very quickly usually next day and are packaged well having never received damaged parts due to packaging.  Their Wiki page is often very helpful for technical information regarding install and setup of parts.  On one occasion I did receive a part that was DOA (manufacturer's defect) I actually received email verification of the free replacement part order before my phone call with them ended.  I'd call that great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Verris",
          "Nb_Reviews": 2,
          "Date": "2023-07-09T18:14:04.000Z",
          "Titre": "Kris Chris Khris Kristopher and…",
          "Contenu": "Kris Chris Khris Kristopher and Khristmas make up the wonderful company known as Kris Baller 3D Printing and baller is the best way to describe them. Excellent customer service, great prices and fast shipping. A+++ Would shop again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean G",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T22:46:10.000Z",
          "Titre": "Good overall experience",
          "Contenu": "Good shipping speed. Reasonable site organization, maybe could use a little more in the way of subcategories but that might be my own inexperience talking. Good prices and solid packaging. Can't ask for much more than that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CJ",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T18:47:15.000Z",
          "Titre": "KB3D is the best",
          "Contenu": "KB3D is the best. I had a preorder that was delayed and ran into some issues with their distributor. They were easy to contact, and were more than happy to help me iron everything out. We ended up mutually finding a great solution to my needs (another similar product instead) and they handled everything. I love these guys. Seriously wonderful. Everything is always super fast, shipments are often sent out same day, it's great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris  Orear",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T18:34:16.000Z",
          "Titre": "Satisfied customer",
          "Contenu": "It's great that you are a local company to my area. The shipping is amazingly fast. I don't think I've waited for more than a day or two for any of my orders to arrive. Pricing is competitive. I don't have anything negative to say about KB3D. I'm thinking of building a Voron v0 as a father son project and I will be sourcing the parts from KB3D."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jarrett V",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T22:29:57.000Z",
          "Titre": "Top notch vendor for 3dp hobby",
          "Contenu": "I've been buying from kb3d for years and have always had a positive experience. Anytime I've needed to work with them on an order they've always been accommodating and timely. Great selection and pretty decent website. The website search could be improved but browsing by category is fine. I do wish they had more items on sale from time to time as I love a good deal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Hunter",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T22:39:23.000Z",
          "Titre": "Super fast shipping",
          "Contenu": "Always have a great selection of products and in stock items are shipped super quickly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Twisted Gear",
          "Nb_Reviews": 4,
          "Date": "2023-08-08T00:09:35.000Z",
          "Titre": "Simply amazing service",
          "Contenu": "KB3D went out of their way to ensure that my order was exactly what I needed. On top of that, the items were shipped in a very secure way. This was especially appreciated since they had to cross an international border."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rene Wilson",
          "Nb_Reviews": 3,
          "Date": "2023-07-03T20:52:28.000Z",
          "Titre": "Great company",
          "Contenu": "I started using this after ordering 2 different boards for my Voron and both boards were bad on arrival.  After that, I realized that this was a great company and I get my shipment usually quicker than I expect so very happy with this company over all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe A",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T14:28:02.000Z",
          "Titre": "The customer service I top notch",
          "Contenu": "The customer service I top notch. Simple things like modifying ab order last minute. Work ethics abd positive response is the best. A pleasure to do business with abd rather fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kermit - Build it Basement",
          "Nb_Reviews": 5,
          "Date": "2023-08-08T14:04:27.000Z",
          "Titre": "Kris at KB3D provides great products…",
          "Contenu": "Kris at KB3D provides great products and outstanding service.  He will go way out of the way to ensure you get what you need and help you resolve any issues.  I have placed over a dozen orders with KB3D and have never had an issue that wasn't resolved. If he does have a product, ask him - he'll either provide you with a reason OR get it for you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich C.",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T17:40:45.000Z",
          "Titre": "The incredible fast turn around",
          "Contenu": "The incredible fast turn around! I ordered it at night and the next morning it was going out the door!  I received it in a timely fashion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "arthur",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T15:16:35.000Z",
          "Titre": "Always five stars",
          "Contenu": "Always five stars. KB-3D knows what it takes to be a successful small 3d printing related business today, because they are genuine enthusiasts who are actively engaged in the community. 100% worthy of your business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roberto",
          "Nb_Reviews": 3,
          "Date": "2023-03-07T01:05:44.000Z",
          "Titre": "Not my first time ordering from KB3D…",
          "Contenu": "Not my first time ordering from KB3D and as always they delivered. Great inventory, excellent service, fast shipping and top notch merchandise. You'll get quality goods and fast. Do not have to wait months and guess at what you're going to get from China. Order from KB3D you will not regret it and will help a small business."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "James H",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T22:36:39.000Z",
          "Titre": "Quality Company",
          "Contenu": "Quality brands. Great service and quick shipping. Wish I was able to order more, but I'm international. KB3D deserves the business and should be a no brain choice for american customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Fryling",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T22:54:07.000Z",
          "Titre": "Great Company",
          "Contenu": "Kris made sure i had all the required parts needed before completing my order. I have purchased from KB3D before and the orders arrive fast. KB3D is an outstanding company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOSHUA MCVEY",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T17:18:24.000Z",
          "Titre": "My go to source!!!",
          "Contenu": "Kris and the folks at KB3D are so amazing!!the owner of this company will straight up call you back!They've been so help[full with any of my many Voron-related questionsThe quality of their parts is top notch and shipping is always fast!Any little odds and ends or even crucial printer components....KB3D has you covered!!!They've won a lifelong customer here!!!!Thank you Kris!!Thank you KB3D!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shing Han",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T17:19:23.000Z",
          "Titre": "KB3D for all your 3d Printing Needs!",
          "Contenu": "Kris is an example of exemplary customer service, will talk you about all your 3d printer needs. Genuine parts, wonderful pricing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek McRae",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T22:25:20.000Z",
          "Titre": "Great selection of parts",
          "Contenu": "Great selection of parts. All the Voron mods ate covered. Super fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evan Smith",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T20:22:10.000Z",
          "Titre": "Very prompt shipping",
          "Contenu": "Just discovered this online 3d printer parts store a couple of months ago.  Made my 3rd order last Friday.  All of the orders have been shipped very quickly, and the 2 orders that have arrived so far were well packaged and complete.  Very happy so far and will continue to source parts from them that they carry, unless I need it overnight, in which case I will check Amazon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:29:05.000Z",
          "Titre": "Good products and quick shipping",
          "Contenu": "Good products and quick shipping! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kermit - Build it Basement",
          "Nb_Reviews": 5,
          "Date": "2023-03-01T16:33:47.000Z",
          "Titre": "KB-3D is my first and usually my last…",
          "Contenu": "KB-3D is my first and usually my last stop for 3D printer parts and supplies.  Kris is SUPER knowledgeable and willing to go the extra three miles to get you what you need.  Shipping is fast and prices are on par with others.  In my book, that means that the extra level of service you get is a free bonus.  Order something and see!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Tortorello",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T15:15:00.000Z",
          "Titre": "Fast Shipping and a good price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Timberman",
          "Nb_Reviews": 4,
          "Date": "2023-08-03T12:12:31.000Z",
          "Titre": "Site always has what I need at a good…",
          "Contenu": "Site always has what I need at a good price, good stock level and quick shipping. I never have an issue purchasing my 3d printer needs at KB-3D!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael M.",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T22:48:10.000Z",
          "Titre": "Favorite 3D Printing Shop To Order From",
          "Contenu": "Favorite shop to order from. I've ordered 4 or 5 different times from KB3D, and it's always been a breeze. Shipping is always quick and orders are always right."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Alciati",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T16:27:49.000Z",
          "Titre": "They care for the customer",
          "Contenu": "I had two back to back orders because I forgot something. They proactively combined them and credited the shipping costs of one of them. You don't see great businesses like this anymore."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TOM MCINTEE",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T00:09:24.000Z",
          "Titre": "I ordered a part",
          "Contenu": "I ordered a part, then A little while late I ordered another part they  combined shipping and sent me a credit without asking. Shipping was super fast also.Very good experience. Will use again"
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "AyeMyaKyiThar",
          "Nb_Reviews": 3,
          "Date": "2023-10-21T10:02:18.000Z",
          "Titre": "I have heard nothing but good things...",
          "Contenu": "I have heard nothing but good things...I have heard nothing but good things about KB3D .And also good and fast communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Coleman",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T01:54:54.000Z",
          "Titre": "Everything arrived as expected and…",
          "Contenu": "Everything arrived as expected and quickly.  I even had a last minute order change and was able to have it adjusted before it shipped.  They earned my future business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaimie Schaper",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T08:33:41.000Z",
          "Titre": "Breezy the Goat",
          "Contenu": "Breezy the Goat. Always super helpful, delivers on time, excellent customer service, 10/10. Happy to get my parts from such a rare shop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luke Ingerman",
          "Nb_Reviews": 5,
          "Date": "2023-06-03T23:01:04.000Z",
          "Titre": "Easy to shop, quick shipping, quality service …",
          "Contenu": "KB-3D has an easy to navigate website and fast shipping. Their customer service is top notch and they are my go to for 3D printer parts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Pratt",
          "Nb_Reviews": 3,
          "Date": "2023-03-05T19:58:42.000Z",
          "Titre": "Fast shipping, all products in good condition",
          "Contenu": "Shipping was fast! All the products appear genuine and in great condition. They included a pocket screwdriver hex and a brand sticker. Will order from them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David P",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T20:44:52.000Z",
          "Titre": "overall great experience",
          "Contenu": "ordering was easypricing was great shipping was fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Silberfeld",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T20:42:21.000Z",
          "Titre": "I met the KB3D team at MRRF2023",
          "Contenu": "I met the KB3D team at MRRF2023.  Super nice guys lead by Kris (aka Chris #1).  They knew exactly what I needed (two high-flow Revo nozzles) and gave me an excellent price, to boot!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Yates",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T06:19:32.000Z",
          "Titre": "It's been great",
          "Contenu": "It's been great, I've made several orders all of them come quick and get me what I need at a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew C.",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T13:32:23.000Z",
          "Titre": "KB-3D is a top notch vendor.",
          "Contenu": "KB-3D is always great to work with.  Impeccable customer service, fast shipping and great products.  When looking for a product I need, I always check KB-3D's site first."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Dumas",
          "Nb_Reviews": 2,
          "Date": "2023-03-04T20:56:39.000Z",
          "Titre": "I really like your company i have…",
          "Contenu": "I really like your company i have ordered parts from multiple vendors while making my boron trident, your parts and shipping have been the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Trammell",
          "Nb_Reviews": 5,
          "Date": "2023-08-07T17:35:41.000Z",
          "Titre": "The Fulcrum Pin",
          "Contenu": "The fulcrum pin (dowel pin) fits perfectly in compact sprinkler and it didn't come a loose when I watering my backyard last week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Khalilieh",
          "Nb_Reviews": 3,
          "Date": "2023-10-09T02:33:27.000Z",
          "Titre": "KB3D is always super helpful",
          "Contenu": "KB3D is always super helpful, has good prices, and a great selection!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Giordano",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T20:28:13.000Z",
          "Titre": "Amazing company",
          "Contenu": "Amazing company! They noticed I ordered two separate shipments and combined the two and refunded me my second shipping fee. What company has that attention to detail anymore. Fantastic!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Kennison",
          "Nb_Reviews": 8,
          "Date": "2023-07-04T17:26:47.000Z",
          "Titre": "Great vendor",
          "Contenu": "They couldn’t make it easier if they try. Fantastic customer service. Definitely will use again and again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Hunter",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T16:51:48.000Z",
          "Titre": "Super fast delivery again",
          "Contenu": "Super fast delivery again - everything arrived well packaged."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Kirk",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T22:02:58.000Z",
          "Titre": "A great place to get 3D printer products.",
          "Contenu": "Every time I've ordered anything from KB3D, I've received the shipping notice within an hour.A great place to get 3D printer products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 3,
          "Date": "2023-03-06T01:16:54.000Z",
          "Titre": "As usual KB3D knocks it out of the…",
          "Contenu": "As usual KB3D knocks it out of the park.  This is a great site. They usually always are super fast with shipping and great with communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Calvin.",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T19:48:19.000Z",
          "Titre": "Great experience as usual",
          "Contenu": "Great experience as usual. KB3D was the only supplier in the US that had the product I needed in stock and it arrived in time. What more can I say right?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anchit Chandra Sekhar",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T17:26:00.000Z",
          "Titre": "Quick Shipping, Accurate description",
          "Contenu": "Placed multiple orders, all shipped quick and were well packaged. The textured PEI build surface is really good as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Ewing",
          "Nb_Reviews": 3,
          "Date": "2023-02-05T01:01:33.000Z",
          "Titre": "I received all items as described",
          "Contenu": "I received all items as described, and in a timely manner. Everything was packaged well, and I look forward to ordering more of my 3D printer needs from KB3D. I’m glad I found them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Thatcher",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T06:30:55.000Z",
          "Titre": "Great vendor!",
          "Contenu": "2nd or 3rd order from KB3D. Always great and you know what you are buying. Nice to be able to purchase name brand products reliably."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Pratt",
          "Nb_Reviews": 3,
          "Date": "2023-08-04T23:48:46.000Z",
          "Titre": "KB3D amongst the best",
          "Contenu": "Usps was the slowest part of the process, I said it before and I’ll keep saying it. If you need 3d printer parts here is amongst the best"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Harper",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T15:28:10.000Z",
          "Titre": "Cheaper, better, faster",
          "Contenu": "1. Service is prompt and great. My package was shipped almost immediately after ordering.2. Delivery is prompt and well-packaged.3. Prices are lower than [competitor] and [other competitor], consistently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mattaw",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T17:25:26.000Z",
          "Titre": "KB3D for inexpensive genuine parts shipped fast",
          "Contenu": "It's extremely difficult to get genuine high quality parts in hobbyist quantities at a reasonable price. KB3D is a standout for value, speed and authenticity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Woody Simpson",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T22:54:59.000Z",
          "Titre": "Extremely fast order fulfillment and…",
          "Contenu": "Extremely fast order fulfillment and great pictorial shoping.  Delivered extra screws and nuts!  Rapid, professional and kind reply to emails and messages!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Chapman",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T16:28:27.000Z",
          "Titre": "Great products and fast shipping after…",
          "Contenu": "Great products and fast shipping after order placed. All of my orders have shipped within one to two days after being placed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Meier",
          "Nb_Reviews": 2,
          "Date": "2023-07-09T19:07:40.000Z",
          "Titre": "Perfect service",
          "Contenu": "Same day shipping, friendly store owner and exactly what I ordered delivered on time and well packed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 9,
          "Date": "2023-10-01T21:29:25.000Z",
          "Titre": "KB3D is my go-to",
          "Contenu": "As usual, KB3D has the parts I need when I need them. Fast shipping. Always satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon Barnett",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T01:40:34.000Z",
          "Titre": "Best hobby store!",
          "Contenu": "Easy to order, ships fast, customer service is excellent!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rob",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:20:43.000Z",
          "Titre": "Great Service",
          "Contenu": "Great Service - Fast shipping as usual."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jason fetterman",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T00:55:36.000Z",
          "Titre": "i never have no issues",
          "Contenu": "i never have no issues. i am into building printers and i come here for pretty much everything i need.....now just need to get them to sell muscle wire and id be real happy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ET",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T01:14:57.000Z",
          "Titre": "Great first time buyer experience",
          "Contenu": "Quality products, well packaged, great associates and fast shipping. I also like the website layout and color scheme."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike  Venturini",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T06:08:18.000Z",
          "Titre": "Fast Service and is always helpful for…",
          "Contenu": "Fast Service and is always helpful for 3d printing space."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich C.",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T15:19:49.000Z",
          "Titre": "Super fast turn around",
          "Contenu": "Super fast turn around!  Always a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2023-07-05T00:21:53.000Z",
          "Titre": "Had the parts I needed",
          "Contenu": "Had the parts I needed, shipped in a timely manner and received on time and well packaged what more do you want."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 9,
          "Date": "2023-07-08T21:49:43.000Z",
          "Titre": "KB3D is the Best",
          "Contenu": "Quality products and fast shipping are trademarks of KB3D. I always shop here first when in need of supplies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luke Ingerman",
          "Nb_Reviews": 5,
          "Date": "2023-03-06T05:45:11.000Z",
          "Titre": "KB-3D Has become my go to store for 3D…",
          "Contenu": "KB-3D Has become my go to store for 3D printer parts and kits. They ship fast and communicate with the customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Funderburk",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T01:14:13.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, good part. We own and operate a 3D Printing blog and are used to waiting on china parts! This was only 3 days, super quick A+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Capon",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T18:12:02.000Z",
          "Titre": "Excellent and timely customer service",
          "Contenu": "Excellent and timely customer service. Easily handled my order modification and shipped very fast. Thank you KB3D!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin S",
          "Nb_Reviews": 3,
          "Date": "2023-06-04T14:41:16.000Z",
          "Titre": "One stop 3d printing shop",
          "Contenu": "Kb3d always has the parts and tools I need, they are my first stop for anything 3d printer related"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Brown",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T22:10:21.000Z",
          "Titre": "Met the guys at MMRF",
          "Contenu": "Met the guys at MMRF, and decided to order. Received the package in a very timely manor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T21:38:04.000Z",
          "Titre": "I'll be back again!",
          "Contenu": "Well priced, shipping was fast, and was packed extremely well. I'll be back again :D"
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Nico Lucchesini",
          "Nb_Reviews": 2,
          "Date": "2023-03-02T16:47:21.000Z",
          "Titre": "100% recommended",
          "Contenu": "I've found everything I needed, very good quality components, fast shipping. Now my voron is complete thanks to KB3D."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AlexDLabs",
          "Nb_Reviews": 5,
          "Date": "2023-05-31T16:22:24.000Z",
          "Titre": "Best 3D Printer Parts Supplier",
          "Contenu": "As always, Kris is very knowledgeable and has the best parts for my 3D Printer obsession."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Redroy",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T02:05:55.000Z",
          "Titre": "Very quick shipping",
          "Contenu": "Very quick shipping! Items arrived well packed and much quicker than expected. Great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHNNY",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T15:42:00.000Z",
          "Titre": "Very fast order processing and…",
          "Contenu": "Very fast order processing and shipping.  Item was well packaged to prevent damage to compents"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kermit - Build it Basement",
          "Nb_Reviews": 5,
          "Date": "2023-02-03T02:48:22.000Z",
          "Titre": "KB3D=My Favorite place to get printer parts!",
          "Contenu": "Kris and KB3D have been one of the best shops I have purchased from.  The customer service is great and it's amazing how many items he has in stock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 9,
          "Date": "2023-04-02T20:27:08.000Z",
          "Titre": "Super service.",
          "Contenu": "Great support, had product in stock, fast shipping. I would definitely purchase from KB3D again."
        }
      ]
    }
  ]
}