{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "keepcalling.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa Zvingowaniseyi",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T16:58:54.000Z",
          "Titre": "This calling card used to be good",
          "Contenu": "This calling card used to be good. I opted for the pinless dialing and everytime l wannna call l have to put a pin, meaning l have to go find the pin to have it handy. So stupid. I need to look for a different card, been lazy but l think that’s what l will do."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "R David",
          "Nb_Reviews": 5,
          "Date": "2023-11-07T06:01:19.000Z",
          "Titre": "Keepcalling is a Fraudulent company",
          "Contenu": "Fraudulent company. The deduct money every month on your account through automatic payment without adding the minutes to your account. When you call them to ask they are rude saying they don’t automatically deduct it you are the one who placed the order. You won’t know they are deducting the money because you don’t get the minutes and you don’t get an email for automatic deduction. You can only see it if you go to your statement. I only picked it up after 9 months so a warning to everyone to check their statement and their bank of you have used this fraud company. They won’t see a dime from me again thief’s and rude type of people. Don’t use them."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Rachid Elmdadi",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T01:44:30.000Z",
          "Titre": "your system took money twice even if I…",
          "Contenu": "your system took money twice even if I didn't talk. I dialed I waited for the line. when I started again I found that money was taken."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "oseyi oseghale",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T16:45:55.000Z",
          "Titre": "Fraud",
          "Contenu": "Fraud, I paid $10 they charged extra $4 total of $14 . Highway robbery! - I still could not use so called PIN number. Fraudulent/fake . I requested for support to provide step by step on how you apply PIN . the agent just told me to contact my provider ?"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mushtaq Hussain",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T04:50:01.000Z",
          "Titre": "It doesn’t work",
          "Contenu": "It doesn’t work. I tried to use on my latest iPhone 15 pro max. Paid for a month package. Wasted my money."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Abdelrahman",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T22:07:02.000Z",
          "Titre": "Horrible app and customer service, don't throw your money.",
          "Contenu": "I made a call and the recepient didn't pick up, and the call never connected. Then after a while I found out that the app is billing me for the call that never worked. Which cost me 4 USD. when I contacted customer support they didn't want to check their logs saying that it's not their problem. Didn't want to offer a refund. There's plenty of VoIP apps out there, choose somewhere with decent app and customer support."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark Hendricks",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T13:06:41.000Z",
          "Titre": "Call quality is very unpredictable when…",
          "Contenu": "Call quality is very unpredictable when calling South Africa. Often telephone rings for the caller but nothing happens on the other side - the person you're calling often doesn't even know that you're trying to call.Skype seems better."
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "vikas sharma",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T23:14:30.000Z",
          "Titre": "Unable to make calls..",
          "Contenu": "Unable to make calls... Every time I to take a phone reboot .. tried all hacks (plane deplane mode, closing all apps from the screen, setting my number as default caller  id etc.  but still without taking reboot or uninstall and reinstall. This is one of the common problem which I'm facing since long.I will make not any recharge further to this. Very disappointing"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Zed landau",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T16:48:42.000Z",
          "Titre": "They offer no Unlimited plan.....",
          "Contenu": "They offer no unlimited plans, they have  a cap of 4000 minuets.\"To make it clear\"Thy offer a plan of 4000 minutes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marie Gaffney",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T19:14:50.000Z",
          "Titre": "Avoid Keep calling as they are a scam…",
          "Contenu": "Avoid Keep calling as they are a scam outfit.  Repeatedly taken $20 from my account with out authorization.  Also impossible to get them on the phone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Wong",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T22:23:55.000Z",
          "Titre": "I had terrible experience",
          "Contenu": "I had terrible experience with this service. The phone calls were dropped by itself so many times. In addition, the other side could hardly hear me."
        },
        {
          "Note": 1,
          "Lieu": "ET",
          "Pseudo": "Samiel",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T18:43:52.000Z",
          "Titre": "It kept on dropping and disconnecting…",
          "Contenu": "It kept on dropping and disconnecting many times. not just today and yesterday as well. It's not working for me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kyung Lee",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T15:38:06.000Z",
          "Titre": "It is disconnected so often for almost…",
          "Contenu": "It is disconnected so often for almost a year. No sound at all. At that time, I left complaint. But no improvement.The reason to recharge again is there is no choice except this for now. My mother-in-law abroad is too old, so she uses only offline phone. That's why."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Xianbao Xu",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T14:15:26.000Z",
          "Titre": "The service is not stable",
          "Contenu": "The service is not stable! Some times the calls can not be made using the mobile app, then I tried to connect to keepcalling.com using computer, the website can't be reached. I can connect to any other website except keepcalling.com. This happened a couple of times. I called the service desk, it doesn't help!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Debs",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T17:51:12.000Z",
          "Titre": "Deceptive and dishonest company",
          "Contenu": "So they sent a 10% bonus notification to me on 1/6/23 claiming it's there 21st anniversary offer on any voice credit purchased. I placed an order and no bonus was added. When I contacted their customer service they said I should have used a coupon before placing the order when clearly there was no coupon in the notification sent. I replied with a picture of the notification I received but they still didn't do anything about it. That is deceptive and dishonest service in my opinion."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rita",
          "Nb_Reviews": 2,
          "Date": "2023-05-22T16:49:44.000Z",
          "Titre": "What has changed at Keep Calling's end?",
          "Contenu": "While talking long distance, I was cut off! I called again and was informed there were a lack of funds. I went on line and it seemed there was funds in the account! Despite that, I added $5 and it went through. I waited before calling back my sister to apologize! I was again told there were a lack of funds to make the call! Exasperated, I gave up, shocked because I have used KeepCalling for years and have been satisfied up to now!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Haitham Gazal",
          "Nb_Reviews": 2,
          "Date": "2023-04-22T19:15:06.000Z",
          "Titre": "Recently",
          "Contenu": "Recently, after about a 1 and half minutes on a call, the voice from person you called start repeating and you loose live connection. Never used to be that way, not sure what happened!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-20T16:24:04.000Z",
          "Titre": "Problems with offline calls",
          "Contenu": "Cheap international calls but only work on WiFi. I have not been able call oversees without WIFI for months. Customer service did not resolve the problem."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Suzanne",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T14:19:11.000Z",
          "Titre": "Waste of $$$$",
          "Contenu": "Called chile and nobody could hear , it was like being underwater and the call was lost. Just ended.App sucks, what a waste of $$$I even used their access number. The APP was the worst. Really not happy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ursula Westervelt",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T16:29:34.000Z",
          "Titre": "i never got to call international",
          "Contenu": "i never got to call international, that is why i sign up . called 3x for help . but it still did not got resolved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "hassan fizzou",
          "Nb_Reviews": 2,
          "Date": "2023-01-28T02:59:21.000Z",
          "Titre": "I want to make few second call using…",
          "Contenu": "I want to make few second call using two dollars.and I lose almost two follars with your answer machine saying that I have to add money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Majid Edalatjavid",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T08:17:06.000Z",
          "Titre": "Got an email with coupon of 14% off on…",
          "Contenu": "Got an email with coupon of 14% off on a $20.00 purchase.  I purchased the $20 but there was no prompt to apply the code.  I feel this was a fake & disappointing advertisement."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Ivor  Gore",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T03:58:20.000Z",
          "Titre": "I can’t get to make a call for the…",
          "Contenu": "I can’t get to make a call for the longest it’s a round and round when my money is done I’m going to delete the app"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T19:42:33.000Z",
          "Titre": "calling issue",
          "Contenu": "When I was talking, the receiver's voice repeated and low sound. however, they were charged from the account. please refund my money."
        },
        {
          "Note": 1,
          "Lieu": "HU",
          "Pseudo": "Melinda Bari",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T19:01:17.000Z",
          "Titre": "I unsubscribe and turn off the auto…",
          "Contenu": "I unsubscribe and turn off the auto renewal and thay just take my money every months!!! Why???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "May",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T09:00:57.000Z",
          "Titre": "Your app don’t update",
          "Contenu": "Your app don’t update? I have been using keep calling for years and it’s been having issues later and over a year no update. Please fix this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yacine Djoumbaye",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T07:07:37.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible. It doesn’t work & there’s no customer line with a live person to talk to. Do not waste your money!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenneth Ross",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T02:28:01.000Z",
          "Titre": "I usually buy $5 worth of minutes.",
          "Contenu": "I usually buy $5 worth of minutes.I thought it would be convenient to have auto renewal.What a shock to see you have renewed me for $50 !"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lusy",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T21:10:36.000Z",
          "Titre": "Bad network calls kept cutting off",
          "Contenu": "Bad network calls kept cutting off. Wouldn't recommend it to anyone."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Javier Lesta Candal",
          "Nb_Reviews": 8,
          "Date": "2023-07-09T23:26:57.000Z",
          "Titre": "I put £10 credit and it has disappeared…",
          "Contenu": "I put £10 credit and it has disappeared  from my account.Be careful...."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jeksis",
          "Nb_Reviews": 3,
          "Date": "2022-11-22T14:33:02.000Z",
          "Titre": "Talk Time Not As Advertised, Missing Minutes",
          "Contenu": "I bought $10 worth of credit and got much less than the talk time advertised - I got 40min instead of 52min, missing a whole 12min.  I contacted support and they refused to credit the missing minutes.Update on November 22, 2022:KeepCalling has acknowledged in an email to me that there was a rate increase. I checked my other emails from them and the increase was not communicated prior. They have issued a percentage discount for this issue but I declined this as a discount requires that I make a purchase. A credit is preferred.Also not happy with the company's Thanksgiving message: they just now sent a thank you to customers with a button to make a call (in other words buy credit). No thought to offer a Thanksgiving or Black Friday discount to customers that keep the business going. Discounts have never been a thing with this company. SMH"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "IL",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T04:56:29.000Z",
          "Titre": "Too expensive",
          "Contenu": "Too expensive, no need to use it more, just use what I have a credit in my account. Good luck"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oleg",
          "Nb_Reviews": 26,
          "Date": "2022-12-29T04:37:15.000Z",
          "Titre": "The app sends emails and annoying…",
          "Contenu": "The app sends emails and annoying notifications soliciting to leave a review. Apart from that, connection quality is really bad."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kevin Penner",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T01:27:49.000Z",
          "Titre": "Calls always drops when minutes renew"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KB",
          "Nb_Reviews": 3,
          "Date": "2023-09-18T17:09:26.000Z",
          "Titre": "Very very bad connection",
          "Contenu": "Very very bad connection! Call drops and very hard to connect"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcela Stewart",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T06:17:02.000Z",
          "Titre": "Everything",
          "Contenu": "Everything. I cancelled the subscribtion. Please reinburse any charge still active. Keepcalling is no longer what I was happy to use years ago."
        },
        {
          "Note": 1,
          "Lieu": "KN",
          "Pseudo": "Lesa FIsch",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T14:49:02.000Z",
          "Titre": "audio issues",
          "Contenu": "the person on the other side cannot hear me"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Adel Yahiaoui",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T12:53:47.000Z",
          "Titre": "I'm client with you for a long time but…",
          "Contenu": "I'm client with you for a long time but the price stil increase. It's reel expencive. I started using your services for 8 year à go and no discount proposed for me."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Gamini Perera",
          "Nb_Reviews": 3,
          "Date": "2022-12-04T13:57:20.000Z",
          "Titre": "We cannot hear anything",
          "Contenu": "We cannot hear anything, very bad and will not recharge"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Gurpinder Bajwa",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T21:47:07.000Z",
          "Titre": "From last couple of months",
          "Contenu": "From last couple of months, this app is not working properly, we cannot hear other person voice or its just hung up and we have disconnect the call and connect it back lots of times, we have unlimited data and fast internet connection and this app still does problem with fast internet. We like to discontinue our subscription, please let us know how we can disconnect it so no further payment will be charged on our card"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jop Wojtek",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T12:48:59.000Z",
          "Titre": "your service is completely your service is completely failed",
          "Contenu": "your service is completely failed"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Carol S",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T20:00:06.000Z",
          "Titre": "THIS IS NOT MY ORDER!!!!!",
          "Contenu": "THIS IS NOT MY ORDER!!!!!Please reverse charges immediately!!I am contacting authorities."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Haris Hukic",
          "Nb_Reviews": 6,
          "Date": "2022-10-02T19:40:10.000Z",
          "Titre": "Not working for international cell phones as promised",
          "Contenu": "After getting $2 in credit, when I tried to call cell phone number in Bosnia-Herzegovina system is not letting me do it. I guess it is not working for 060 network. Very disappointing and wasted money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Dunlop",
          "Nb_Reviews": 8,
          "Date": "2022-07-28T10:51:57.000Z",
          "Titre": "Cheap call scamWhen using Keepcalling they tell you to…",
          "Contenu": "When using Keepcalling they tell you to phone 01316080038 and enter your pin.What they do not tell you is that number appears on your phone bill with extortionate charges one example i was charged £12 for a 58 minute call to a swiss landline @1.5p per minute?? I have contacted the company and asked for an explanation for 22 charges amounting to £59.They do not answer my questions.Check the internet input the 01316080038 and read for yourself."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sal Sha",
          "Nb_Reviews": 3,
          "Date": "2022-08-09T16:50:19.000Z",
          "Titre": "Bad and not transparent, all in all",
          "Contenu": "The credit that the staff from Keepcalling claimed, was never received. Will be leaving this dishonest App soon.It takes forever to load. You cannot recharge via the app. The quality of the voice is terrible. The policy of use is not transparent. It is expensive compared to other apps. You also have to dial many times to get a line. And, you never get credit for the disconnections or redials.Update: They applied a credit after my review, but the rest of the issues (speed, connections and sound qualities) are still the same, more less."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shawn Wiggins",
          "Nb_Reviews": 2,
          "Date": "2023-03-19T20:16:39.000Z",
          "Titre": "Timesucks,never using it again..No way",
          "Contenu": "Timesucks,never using it again..No way, what a rip off.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "N.K",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T03:11:06.000Z",
          "Titre": "Rates for Iran",
          "Contenu": "I thought due to the human rights and current situation in Iran, the company would lower the rates for Iran but apparently, they don't care whatsoever!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mohammad Khalid Habiby",
          "Nb_Reviews": 2,
          "Date": "2022-07-17T18:03:25.000Z",
          "Titre": "Recently when calls connects after 40…",
          "Contenu": "Recently when calls connects after 40 seconds it starts automatically repeating what I said at the begin with the one who I call for. It is really frustrating!! If you don’t fix it I am going to delete my KeepCalling for ever.Hope you fix is soon Thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LOTFi Chettouh",
          "Nb_Reviews": 3,
          "Date": "2023-04-26T13:53:38.000Z",
          "Titre": "The service is so bad I waisted a lot…",
          "Contenu": "The service is so bad I waisted a lot of money in this app"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sal pineda",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T00:27:12.000Z",
          "Titre": "You revealed my number to the party I…",
          "Contenu": "You revealed my number to the party I called"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "susan",
          "Nb_Reviews": 11,
          "Date": "2022-08-10T09:36:26.000Z",
          "Titre": "Conversations are repeating",
          "Contenu": "Conversations are repeating. I tried to make 2 calls but it turned out that the people seemed to be repeating the sentences that they had just finished. Call 1 was at 18.40 and call 2 was at 18.4910/8/22UpdateI have had the same issues again this morning. While Keep Calling is making excuses and blaming my internet connection, I will respond to say that my internet connection is excellent as I have a great broadband connection as I work from home. All that they are doing is try and shift the blame so that they don't do anything to sort out the issue. I still use the number that was allocated to me to enable me make the phone calls.In this regard, I think that 2 stars are too generous to this company.Buyer beware!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kamal Khosroshahi",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T17:40:57.000Z",
          "Titre": "I can not call to Iran either land…",
          "Contenu": "I can not call to Iran either land phone or cell phone"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Richard Albert",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T14:31:42.000Z",
          "Titre": "Please refund all the money you wrongly…",
          "Contenu": "Please refund all the money you wrongly booked from my PayPal account. Money for the month of October and November should be refunded. I also have a problem with you not rolling over the rest minutes. Infant this is pure cheating from your side. Am about to delete this app from my phone and make a change. Thanks,  richardPlease be specific about your claim. The refund i ask for is based on the October and November month, do I use your service  this months?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Peter Beaumont",
          "Nb_Reviews": 6,
          "Date": "2021-12-08T09:48:12.000Z",
          "Titre": "Website and service down 24 hours",
          "Contenu": "Registered on Friday, unable to make calls since and web site has been down for past 24 hours.  Keep calling responded by saying my internet connection must have been at fault. My Internet connection over that period was fine for all other sites but it was  impossible to connect to any sites connected with KeepCalling for over 24 hours over Sunday/Monday, I wont have been the only one. These sites came back online later on Monday, and calls became possible again."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Chris D",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T00:20:51.000Z",
          "Titre": "Regular Dropouts after 10 minutes",
          "Contenu": "I've been to use this app for a few months. Calls connect well and quality is good. However, calls nearly always drop after  5 to 10 minutes. I just tried calling Australia from Singapore yesterday. I had to call 3 times and got 3 drop outs before giving up.Really annoying. Simply can't use it anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Samster",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T08:26:48.000Z",
          "Titre": "Ridiculous increase in rates",
          "Contenu": "Ridiculous increase in rates! The rates for both land lines and cell phones have tripled! Now, I understand global inflation has driven prices north however 300% is ridiculous."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon",
          "Nb_Reviews": 29,
          "Date": "2022-06-12T23:06:01.000Z",
          "Titre": "They have taken my money but dont providethe service they claim",
          "Contenu": "This company used to be excellent but but following the recent App update I can no longer use any of the menu functions and despite reaching out to them multiple times they have totally failed to respond to my pleadings for asssistance.The just repeat \"delete and reinstall\" Well I have now done this 6 times and still nothing works.  All I get whenever I try anything is \"Error\".I have asked for someone technical to call me but they dont.  I have also lodged a formal complaint but they dont reply.I have in excess of £20 in credit with them which is now quite useless.In the past I have recommended them to many people i have met on my travels - well no longer.They are a disgrace."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T10:15:56.000Z",
          "Titre": "The line goes silent",
          "Contenu": "The line would go silent the seconds and minutes are still going but you cannot hear anything. I have to call back multiple times and it’s very frustrating. Please fix this issue it happens on every call."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Henok Tewelde",
          "Nb_Reviews": 3,
          "Date": "2022-08-25T15:27:36.000Z",
          "Titre": "I do not know how you guys trust this…",
          "Contenu": "I do not know how you guys trust this company. I mean it, just untrust worth fish a 20 Euro out of my pocket in May 2021. I wonder why people are not aware of."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Henok Tewelde",
          "Nb_Reviews": 3,
          "Date": "2021-05-02T02:43:53.000Z",
          "Titre": "Again when a person starts lie he will…",
          "Contenu": "Again when a person starts lie he will never get out of the bad behavior. Keep calling like a company is failed to know what they do. They tried to provide a completely false document as if I have used those to call to Africa to my bank just to take the 20 Euro out of my pocket. Please never mess with this company. Believe me they are not good people.  Oh my! too much!! you guys need to learn from committing a constant mistakes over mistakes. That's sad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "calvin lucas",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T04:20:24.000Z",
          "Titre": "Really difficult to get connected",
          "Contenu": "Really difficult to get connected, and get a connection that can be heard at least some.  Like 10-15 calls using all different access number to try to get through once. Aggravates people being called also.  Have made 2 long distance calls both bad.  Many months apart, so not a one time issue. , . Some disconnects during calls but more of a minor issue.    No customer service number to help.  ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharef Hadat",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T20:36:19.000Z",
          "Titre": "I tried to call a number",
          "Contenu": "I tried to call a number, but I got connected to a converstaion between two other people who were already talking about their personal issue. I was wondering how come I hear two other people's talking. I could hear one side talking to the other. I lost my trust to this app that someone might get connected to my conversation while talking to friends or family."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A Mulstu",
          "Nb_Reviews": 1,
          "Date": "2020-06-29T18:28:17.000Z",
          "Titre": "There is a connection problem about 40%…",
          "Contenu": "There is a connection problem about 40% of the time. It tells me a none working number while the number is correct then you hear welcome to Verizonyou have a none working number. It also disconnects you in the middle of conversation very bad card I am stack with it until I use my credit and get a better calling card. Don't buy it find a better oneAmare"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Devika Manikpura & Ajith Tilakarathne",
          "Nb_Reviews": 2,
          "Date": "2020-06-07T06:43:00.000Z",
          "Titre": "Very Bad Service & No value for money",
          "Contenu": "Instead of clearly communication what I have to experience is for many & many times, the repetition of what I have said to the caller. The same conversation is going on as a repeating from y side & what the caller is telling me. Just I am wasting my air minutes to paying Keep calling co. I am doubted if this is a network problem or keep calling is purposely doing. Very bad service & using this facility because not having any option."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Haris Hukic",
          "Nb_Reviews": 6,
          "Date": "2021-01-03T16:13:02.000Z",
          "Titre": "Poor Connection, No Help",
          "Contenu": "After poor connection with previous call, no help, but 10% discount if I buy more minutes. I did, and call, what I made today, again with poor connection. Receiver of the call can hardly hear what I am saying due to constant cut-offs in reception. Can anyone fix poor routing, and compensate for money loss?"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Neda Goodarzi",
          "Nb_Reviews": 1,
          "Date": "2019-11-23T13:29:25.000Z",
          "Titre": "Keepcalling has increased its rate to…",
          "Contenu": "Keepcalling has increased its rate to Iran as the internet shutdown in the country. Many families, student  outside of Iran were struggling these days to talk to their beloved ones in Iran. It’s very unfair and oppose to a very basis human right that a company is taking advantage of the harsh situation. I would definitely make a petition along with many of Iranian against KeepCalling policy."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Nancy Rani",
          "Nb_Reviews": 1,
          "Date": "2021-01-05T02:47:53.000Z",
          "Titre": "Not good",
          "Contenu": "I wanted to recharge once only but i got recharged my phone three time which happened every month it was wastage of money because i needed only once so i send email then they cancelled the recharge but have not got refund yet. I had a bad experience always with keep calling. I don’t recommend to others."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rani nejad",
          "Nb_Reviews": 1,
          "Date": "2019-11-25T23:39:41.000Z",
          "Titre": "Poor customer service and greedy…",
          "Contenu": "Poor customer service and greedy company. As soon as they noticed Internet in Iran has been shut down by the government because of demonstration of the people of Iran, Keepcalling also increased the call rate between 40 and 100% which is really outrage and out of humanity of this greedy company. Therefore, I would suggest that we can boycott this company and using this type of similar services from other competitors, thanks for your support"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "sehdeep singh",
          "Nb_Reviews": 1,
          "Date": "2019-10-17T11:03:23.000Z",
          "Titre": "Disconnectes after 10 minutes",
          "Contenu": "Disconnectes after 10 minutes. I have had this issue for about a month now. Will run out of credit and revert use the app again. It should not be happening. Also cannot use the app with any other app open. It will not work. That's needs to be fixed. I loved the app before but I absolutely hate it now. Can't wait for my credit to finish so I can uninstall"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Omar Gonzalez",
          "Nb_Reviews": 2,
          "Date": "2022-03-29T21:30:55.000Z",
          "Titre": "You did not inform that I would not be…",
          "Contenu": "You did not inform that I would not be able to use it if the browser did not have the Java add-on. And I'm sure you know that this will happen in almost all cases. In other words, looks like a rip-off to me."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mushtaq Hussain",
          "Nb_Reviews": 4,
          "Date": "2021-10-30T19:24:51.000Z",
          "Titre": "Keepcalling & Telephonepakistan… both confuse the customers",
          "Contenu": "Keepcalling & Telephonepakistan confused me and I paid $20 each, total $40 but inspite of my repeated requests, they are not merging into one account. I can’t understand why these two entities are using one app while confusing the customers."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jack Kaczmarczyk",
          "Nb_Reviews": 1,
          "Date": "2019-08-05T21:18:55.000Z",
          "Titre": "Quality is terrible",
          "Contenu": "Quality is terrible. Phone get dropped every time after about 3-4 minutes of the conversation. Need constant recall to the dropped number. My wife is on separate plan and she experie same problem as me so it is not the phone. Many times do not connect at all. I am seriously considering cancelling my plan and my wife plan. Total garbage."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Natalie Lodge",
          "Nb_Reviews": 7,
          "Date": "2022-06-10T19:10:32.000Z",
          "Titre": "Can't make calls",
          "Contenu": "Each time l make a call rings once then cuts out, very frustrating!!! This is after topping up my credit so low credit is not the issue. It's been like this for the last 3 days"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Chitra Rohilla",
          "Nb_Reviews": 2,
          "Date": "2020-03-08T21:26:02.000Z",
          "Titre": "Very Bad customer service and deceptive advertisement",
          "Contenu": "Very Bad customer service. I opted for unlimited plan and learnt after sometime that unlimited plan is limited to 4000 minutes. advertisement is very deceptive. When I raised this with customer service. Guy accused me to use minutes for business use without knowing the facts, where I was using it to call my family. He was extremely unprofessional and speaking over me, did not try to understand or listen what my concern was. kept giving me scripted answers. It has been very bad experience. Will not recommend to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "hussein kamo",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T08:11:26.000Z",
          "Titre": "KeepCalling is the worst service I’ve…",
          "Contenu": "KeepCalling is the worst service I’ve ever seen, when placing an international call I get to speak to the other person who is on the other end of the line for one minute and then the conversation will repeatedly play over and over, then I have to hang up and call again"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Bahare Alishah",
          "Nb_Reviews": 1,
          "Date": "2019-11-22T15:28:37.000Z",
          "Titre": "Awful connection",
          "Contenu": "Awful connection, every time the voice has been shaking I had to call again and again with maximal 30 seconds call duration each time  but surely paying for one minute!!!And crazy, exactly when we need them, because of internet shutdown in Iran they increase their price for Iran around 15%!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Anoop George",
          "Nb_Reviews": 1,
          "Date": "2020-03-21T10:24:15.000Z",
          "Titre": "Very bad connection,line cuts off while…",
          "Contenu": "Very bad connection,line cuts off while talking,start loosing minutes before answering the call,I accidentally pressed few numbers (+509 )on KeepCalling dial screen, didn’t actually called,but within an hour I received a scam call from the above country on my mobile,can’t trust this app"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ruth",
          "Nb_Reviews": 7,
          "Date": "2022-11-01T15:35:52.000Z",
          "Titre": "I used to be able to renew a 650 minute…",
          "Contenu": "I used to be able to renew a 650 minute monthly plan earlier than the renew date if I ran out of minutes… this adjusted the renewal date and I did this up until this last time. My minutes expired and I wanted to renew the plan as of yesterday but it did not so what it normally allowed me to do. I messaged the support and they told me that it will automatically renew on the 6th of November. I asked if I could cancel the plan an resubscribe but they didn’t get back to so I went and cancelled the expired plan. When I went to subscribe for the plan again, that one is no longer available as I was told after I reported the issue because I wanted to reverse my cancellation within minutes of finding out that this plan was NLA!!! I have used Keepcalling for several years now, but since this last rate increase, it appears that customer service has gone out the window. I have received notification of other plans that are costing up to half the price but I usually am a loyal person to what I subscribe to. Due to NO attempt to resolve this issue has been apparent, I am questioning what their protocol is at handling any issues at all??? 😱😱😟😟The point that I was making is that if I would have been told to wait until November 6th to renew the 650 plan, then the plan would have still been available… unless you are saying that even on the 6th of November I would have been told that it would not auto renew.I should have been advised that this plan would no longer be available if that was the case."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Park Yongmin",
          "Nb_Reviews": 1,
          "Date": "2020-03-30T15:09:07.000Z",
          "Titre": "The worst refund policy ever.",
          "Contenu": "I realized that I had made wrong payments and asked for a refund immediately, but they refused.It is ridiculous that there is no refund in the world these days.Haven't you ever made a mistake in your life? Everyone makes mistakes. That's why there is a refund policy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristi Markovska",
          "Nb_Reviews": 1,
          "Date": "2021-04-18T13:51:07.000Z",
          "Titre": "The calls drop every 20 minutes so",
          "Contenu": "The calls drop every 20 minutes so. Also, I’ve noticed that my credit drops very rapidly. When I looked at the duration of my call and how much my credit had and dropped it seems like you’re charging more than the 7.5 cents to Bulgaria cell phone."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Norma Lopez",
          "Nb_Reviews": 2,
          "Date": "2020-07-16T00:35:22.000Z",
          "Titre": "The calls keep dropping off every 4…",
          "Contenu": "The calls keep dropping off every 4 minutes and sometimes I can't ever connect because a message keep asking me if I would like my phone calls offline even when I I just brought credit.I normally call to El Salvador with other companies and this does not happened."
        },
        {
          "Note": 1,
          "Lieu": "JO",
          "Pseudo": "Ghassan Barghouti",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T15:53:54.000Z",
          "Titre": "Tried to make a recharge for Jawwal",
          "Contenu": "Tried to make a recharge for Jawwal - Palestine.It didn't work out. It stayed pending in my account history for a while. Then it suddenly disappeared. What's worse is that there is no email to go by or anything."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Delia Tirado",
          "Nb_Reviews": 2,
          "Date": "2021-12-18T14:41:34.000Z",
          "Titre": "This app has become very hard ti…",
          "Contenu": "This app has become very hard ti connect. I have tried to restarting my phone several times and still have not luck to make a call. Hope you fix the bug or I will go with another company. I am very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gilbert rashbaum",
          "Nb_Reviews": 2,
          "Date": "2021-06-11T20:57:38.000Z",
          "Titre": "I rate you zero stars.",
          "Contenu": "I rate you zero stars.I have a month to go on my contract and I get no service at allThere is no way I will renew nor recommendat best - awfulAnd I cant even get you on the phone.Why dont you call meGilbert Rashbaum239 591-8624"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Lovejit  Singh",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T23:12:29.000Z",
          "Titre": "Hi iam using KeepCalling last two years…",
          "Contenu": "Hi iam using KeepCalling last two years every thing went good But now I have coming couple of problems like I am buying monthly unlimited plan For India that plan I couldn’t use hole month and between half month that plan expire  so after I need buy a new plan I don’t know how Make that happens I don’t want I spend money two times in month I request sort out that problem please  Otherwise I give up KeepCalling And second thing is when I calling to India that call cutting every time between 20 min or30 min And that problem start last 3 or 4  months  So I want you guys fix that problem alsoThanks lovejit"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Noor Hariz",
          "Nb_Reviews": 1,
          "Date": "2019-09-10T16:41:30.000Z",
          "Titre": "really expensive 😖😖😖",
          "Contenu": "it is really expensive 😖😖😖How come Jordan is15 cent and Israel just 1 or 2 cents And they are just next to each other . I keep hearing Echo from time to timeB.SAs a response to your BS None o these companies have a hidden fees.And talking about your company as the best and put other company's down is a shame .. You just wanna justify why you have a higher rate than any one else . Shame on you .. If I were you . I would be honest . And still talking about the quality of the voice like it's the best It it Horrible and bad Not Recommended at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Asefaw Woldu",
          "Nb_Reviews": 1,
          "Date": "2020-12-27T18:40:19.000Z",
          "Titre": "Keep calling  steal my minutes every…",
          "Contenu": "Keep calling  steal my minutes every time. If I purchase 41 minutes which it cost $10  and they say I got 41 minutes but I only talked for 26 minutes. Where do my 15 minutes go? So they cheat a big time that’s why I give them one star."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Mahshid Abedini",
          "Nb_Reviews": 2,
          "Date": "2019-11-22T22:41:08.000Z",
          "Titre": "Shame on you.Increasing rates for…",
          "Contenu": "Shame on you.Increasing rates for calling to Iran because these days the internet has shut down.  Making business of horrible situation in Iran!!!!! App deleted. I’ll tell to all family friends every where to delete the app. Shame 👎🏻"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Juan Jaliper",
          "Nb_Reviews": 7,
          "Date": "2022-01-21T19:35:33.000Z",
          "Titre": "Impossible to communicate",
          "Contenu": "Impossible to communicate, they answer from the other side and the communication drops.  2 days in a row trying and the same, download BOSS Revolution, and no problem, perfect communication."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Sammani Bopearachchi",
          "Nb_Reviews": 1,
          "Date": "2019-11-23T07:35:58.000Z",
          "Titre": "I always top up my phone with…",
          "Contenu": "I always top up my phone with KeepCalling just to call Sri Lanka. Recently I have noticed that even if you dial the number without calling we lose our money. I’m really disappointed and now thinking of moving to another less rated connection."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Robert",
          "Nb_Reviews": 7,
          "Date": "2021-01-10T12:53:34.000Z",
          "Titre": "Majority of my calls are not clear and…",
          "Contenu": "Majority of my calls are not clear and keep cutting out.I always get put through to a country am not calling which gets very frustrating as much of the time i need to pick to someone promptly.Am not happy with the service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arvo",
          "Nb_Reviews": 2,
          "Date": "2020-04-01T06:51:05.000Z",
          "Titre": "bad so far",
          "Contenu": "bad so far. had a calling card with 'true north' for many years, they don't do retail no more.what irks me most is i call a number  and a recording tells me 'the number is currently busy try again' but that's a stinking lie cause i am calling a cell that would automatically go to voice mail. calling germany has been at best 50%success, with true north it was 100% i am not selling true north, i myself sadly can't get their services anymore, but compared to them keepcalling SUCKS and this is an honest review, you can call me at 575-5887023 i am a real person and i would have happily given a good review but i can't"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kasaian X",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T16:08:53.000Z",
          "Titre": "This service is cheap but my god it’s…",
          "Contenu": "This service is cheap but my god it’s real shxt You have to enter the PIN number loads of times before its accepted and if you lucky to get through every 10 or so minutes it cuts off and you have to start the all thing again REALLY SHXt"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Komil",
          "Nb_Reviews": 3,
          "Date": "2020-04-07T21:32:43.000Z",
          "Titre": "KeepCalling is not honest",
          "Contenu": "KeepCalling is not honest. Its rates change as soon you buy a voice credit. For example KeepCalling offers 9.9 cents per minute for calls to Uzbekistan  but when you make an actual call to Uzbekistan you will pay 12 cents per minute."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Adaku Otuka",
          "Nb_Reviews": 1,
          "Date": "2019-10-21T05:47:30.000Z",
          "Titre": "To be honest",
          "Contenu": "To be honest, terrible! I must say cos I can't here the other end and this is repeatedly, and calls keep breaking thereby frustrating our communication.Please something needs to be done fast on this  issue of call breaking. Thanks"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "mohit guleria",
          "Nb_Reviews": 2,
          "Date": "2019-10-22T07:07:35.000Z",
          "Titre": "whenever  i call if screen  turn  off …",
          "Contenu": "whenever  i call if screen  turn  off  i can't hear from  other party.and i have to wake up my screen  for connecting again. i asked for help send them e mail. they didn't give any response really  bad customer service"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "fazheng soong",
          "Nb_Reviews": 1,
          "Date": "2021-05-30T01:30:01.000Z",
          "Titre": "It is only for occasional phone call user.",
          "Contenu": "The phone itself is good. However, if you make several calls a day, keepcalling will block your account without reasonable explanation. Should you need often call friends abroad, never use this app."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sal Sha",
          "Nb_Reviews": 3,
          "Date": "2022-03-13T17:26:09.000Z",
          "Titre": "It takes many attempts to connect",
          "Contenu": "It takes many attempts to connect. Sometimes it disconnects for no reason. It is too expensive. It doesn’t give credits for minutes lost because of bad connections."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carmen Seppa",
          "Nb_Reviews": 1,
          "Date": "2019-11-11T05:31:19.000Z",
          "Titre": "i took me about two hours to get some…",
          "Contenu": "i took me about two hours to get some help. The last person that helped me was very good. However, there is an unauthorized charge for 1.50 on my card. I do not know how long it will take me to fix that problem."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jacek Pyza",
          "Nb_Reviews": 3,
          "Date": "2022-03-14T16:26:22.000Z",
          "Titre": "Very difficult to top up",
          "Contenu": "Very difficult to top up, I'm waiting 3 days. Money left my account.No information in my app how to top up quick.You take money for waiting to talk too?!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "ndeve c. mutisya",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T18:58:09.000Z",
          "Titre": "The competition gives me 83min / C$10…",
          "Contenu": "The competition gives me 83min / C$10 while \"Keep Calling\" gives me 62min/C$10.It's time to give your loyal clients more minutes or you lose them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hakam Gaben",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:02:55.000Z",
          "Titre": "Two minutes in the callI the other side…",
          "Contenu": "Two minutes in the callI the other side kept repeating the last sentence only after three times I realized it was a robot keeping my call active so I hung up and dialed again only for the same thing to happen again whith the last sentence of the receiver being repeated again and again and that kept happening throughout the call."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Susan Mpofu",
          "Nb_Reviews": 3,
          "Date": "2023-06-29T09:48:54.000Z",
          "Titre": "Really enjoyed the service at first",
          "Contenu": "Really enjoyed the service at first. However the last few years it has been quite unreliable. Sometimes the phone doesn't go through or you can't hear the other person or it just mis-dials but you still get charged for not getting through on the line"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zoh Saa",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T16:43:38.000Z",
          "Titre": "Sometimes great but sometimes very bad…",
          "Contenu": "Sometimes great but sometimes very bad connection. I wasn’t able to hear my brother voice one time , I tried a few times and a last call a wasn’t able to hear still I forgot to hung up it drained over $50 dollars. I reached out with the customer service but they seemed they don’t care at all. If you use this app you should this to avoid the busiest period on a day . Earlier in a morning or late ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Salem Abbadi",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T10:21:45.000Z",
          "Titre": "The connection is constantly dropping",
          "Contenu": "The connection is constantly dropping, sometimes the connection is not clear, the prices are high, there are no offers.  My two-star rating is sufficient for what I sought from my experience to serve you.  ⭐️⭐️Thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MT",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T09:19:23.000Z",
          "Titre": "High rates",
          "Contenu": "1. No response to customers email/ question2. Balance it too late loaded ... can't call use the app right after adding credit.2. Rates to ER Ethio are expensive. Calling cards are cheaper. Please match lower rate, match it with the card value"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Agnes",
          "Nb_Reviews": 6,
          "Date": "2023-04-11T19:08:24.000Z",
          "Titre": "I can’t be able to trace my credit",
          "Contenu": "I can’t be able to trace my credit, it has been three times now, only sometimes I manage to talk, most of the time they send me a pin, and I don’t know how to use it. Still pending since last year, and even this week"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melitta T",
          "Nb_Reviews": 3,
          "Date": "2023-05-06T18:58:13.000Z",
          "Titre": "The connection was terrible",
          "Contenu": "The connection was terrible. A few time a recording would say that the number was incorrect. Lots of echo and static."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Giovanni Gegavine",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T13:55:13.000Z",
          "Titre": "KeepCalliing is excellent calling app",
          "Contenu": "The ads are too big on the screen and very disruptive and obtrusive. Wanted to get ad free version but it's too expensive and unreasonableI am sorry the above review is for TextNow, another app that I am using. TextNow is very badly designed especially with its distracting and huge ads. KeepCalling is ad-free and has very clean and beautiful screen and easy to use design. I am sorry for the mixup and confusion. The above review was written for TextNow app and not for KeepCalling."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Constance Iloh",
          "Nb_Reviews": 3,
          "Date": "2023-03-08T15:06:24.000Z",
          "Titre": "I requested that my balance from last…",
          "Contenu": "I requested that my balance from last month be rolled over to new month and I was denied that. This may be my last month of monthly subscription as a result of that. Thanks"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "susan",
          "Nb_Reviews": 11,
          "Date": "2023-03-12T19:47:13.000Z",
          "Titre": "I was disconnected 3 times and when I…",
          "Contenu": "I was disconnected 3 times and when I made last call, I could hardly hear my respondent. This was not a call but I have been charged for it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "sarita ferrera",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T19:31:01.000Z",
          "Titre": "I keep getting cut off in the middle of…",
          "Contenu": "I keep getting cut off in the middle of the long conversation Very annoying"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Narges Ndm",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T05:01:17.000Z",
          "Titre": "I liked very much bc its very…",
          "Contenu": "I liked this app very much bc its very comfortable to reach out over seas.But they increased the price from 14 cents per minute to 18 cents after I re charge my credit.It's not fair, If I need to call to Iran directly in this situation bc they don't have internet, this company raised up the price.Its taking advantage instead of supporting Iran."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "saravjeet singh",
          "Nb_Reviews": 3,
          "Date": "2023-01-10T19:38:41.000Z",
          "Titre": "Lots of time it showing no connection…",
          "Contenu": "Lots of time it showing no connection with internet while internet has no problems plus sometime call disconnected by itself while taking."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Chaminda Herath",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T23:30:19.000Z",
          "Titre": "Call stops and repeats after 3 minutes",
          "Contenu": "Call stops and repeats after 3 minutes,  very annoying"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "diana haile",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T17:14:50.000Z",
          "Titre": "You charge alot and you dont give a…",
          "Contenu": "You charge alot and you dont give a bonus to your customers."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Kuzeeko Tjitemisa",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T21:56:37.000Z",
          "Titre": "Struggling to call offline",
          "Contenu": "Struggling to call offline. Keep saying that my authentication failed"
        },
        {
          "Note": 2,
          "Lieu": "KE",
          "Pseudo": "George TJ",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T11:24:55.000Z",
          "Titre": "increase of rates unilaterally was very…",
          "Contenu": "increase of rates unilaterally was very bad!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "susan",
          "Nb_Reviews": 11,
          "Date": "2022-03-14T21:13:50.000Z",
          "Titre": "Repeated conversation…",
          "Contenu": "I called my mother and some parts of the conversation were being repeated! I froze as I thought she was losing it and starting to forget! I called my sister to find out if mum was forgetting but she said that she had spoken to her on a few occasions earlier and she was fine. Thank God I found a review here that made reference to the same issue. Keep calling has been ok so far but this repetition of a conversation is not good at all! Please sort this out before someone gets a heart attack!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sladjy",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T21:38:14.000Z",
          "Titre": "Could be better",
          "Contenu": "I’ve been using this company for years. It’s ok, but most definitely could improve. They don’t offer monthly calling plans for Bosnia and Herzegovina. The rates are bit high. Also, it used to kick me out when 60 minutes is up, now it’s kicking me out every 30 min. This is inconvenient and also I think it takes more money each time you redial."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ron",
          "Nb_Reviews": 7,
          "Date": "2022-05-28T23:35:21.000Z",
          "Titre": "fluctuating quality of connection; 70% - indistinguishable speech transmission",
          "Contenu": "Decided to try KeepCalling after leaving another provider due to uncomfortable payment options. The 1st call turned out very disappointing. The connection quality kept fluctuating through the call. About 70% of the duration of the call it was impossible to understand what the other side was saying. The other 30% it was fine. I called to cheer my uncle at his 75 yr annyversary. We managed to exchange basic information but that is it. VERY disappointing. The previous provider never had any problem with connection. So, I know that the problems with connection are due to specifics of KeepCalling. I'll continue looking for another provider."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Samuel  yvan Ze",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T06:39:03.000Z",
          "Titre": "Not able to make a call",
          "Contenu": "Not able to make a call, all my units keep going down"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sara Barashick",
          "Nb_Reviews": 2,
          "Date": "2022-10-25T21:06:50.000Z",
          "Titre": "Line goes dead every time between 19-30…",
          "Contenu": "Line goes dead every time between 19-30 minutes on the phone. AND I pay for unlimited."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "David Hughes",
          "Nb_Reviews": 4,
          "Date": "2021-06-21T03:06:02.000Z",
          "Titre": "Not happy",
          "Contenu": "Not happy. They advertise 0.9 cents per minute to call the United Kingdom. I called and was charged over triple that amount. I contacted customer service and they said the number I called was a cell phone and was over 3 times the price. I asked them to honour the 0.9 cent price as a goodwill gesture since I did not see the price difference for a mobile phone listed on their home page and I also didn't know the number I was calling was a cell phone. They would do nothing for me. I guess they don't want to keep a happy customer base."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Make live easy",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T13:19:41.000Z",
          "Titre": "Connection not always good",
          "Contenu": "Thank you for the good price, for sure!Why my rating is poor? because of the connection. Keepcalling said offering the best covering using 2 network company, but it is not true. You can walk in your home or outside without be disconnected. When you find a place, don't move. Also when you're at the end of your prepay the communication is over without alert that you will be cut... Hope keepcalling will fix the problems."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Julia",
          "Nb_Reviews": 2,
          "Date": "2019-11-06T09:30:52.000Z",
          "Titre": "Disappointed",
          "Contenu": "DisappointedI have an app that ran out of credit, so I topped it up online only to not be able to use the app again, so I had to use the damn pin which cut off during my phone call 4 times stating I had no credit when I had and still have 450 minutes calling time.Now I cannot place the $30 credit on my keep calling app so it takes 10 minutes to dial all the numbers.Not happy at all"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 4,
          "Date": "2019-12-08T20:58:50.000Z",
          "Titre": "I give them 5 stars for blame shifting…",
          "Contenu": "I give them 5 stars for blame shifting or excuses. Miss Bolivia the CSR blamed Paypal for turning my auto refill on. Apparently KC cannot control their own site. The actual phone service is ok and I suppose the rates are decent though Ihave not compared lately. No doubt you could do worse. Tell me if you do. Too lazy to shop around I guess. They are adequate so I stay."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Stefan H",
          "Nb_Reviews": 6,
          "Date": "2019-01-13T12:24:16.000Z",
          "Titre": "I have spoken to your service twice",
          "Contenu": "I have spoken to your service twice, was given information to access my accounts, told that it would be ready in 20 minutes, but I still can not access my accounts. The persons I spoke to know nothing about how the internet works, having said that I need to use a different program, not Firefox, something that can access your website, no problem, so why can I not access my accounts?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mohsen Salehi",
          "Nb_Reviews": 1,
          "Date": "2019-02-12T23:10:01.000Z",
          "Titre": "I have sent you several…",
          "Contenu": "I have sent you several emails,expressing my frustration with ;making calls on KC:I sent pictures of what pumps up when I click on KC logo on my IPHONE.A  message appears for me to sign up on ITUNERecommendation came from your experts to sign on to ITUNE:Bingo, I sing in and you charge me for $5.99also I complained of signing up every time I want to make a call, even if I leave your browser on my IPHONE for one tenth of a second"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sheila Shirinpour",
          "Nb_Reviews": 1,
          "Date": "2018-12-11T23:08:27.000Z",
          "Titre": "On each call I make",
          "Contenu": "On each call I make, every single \"one or two minutes\" we are disconnected. So, I have to dial again and again. I wished I didn't have to use this company call, but I don't have time to shop around. On the positive side, the clarity of voice is very good at least so two parties can hear each other well especially that my mom has a hearing problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sal k",
          "Nb_Reviews": 1,
          "Date": "2018-12-04T19:53:48.000Z",
          "Titre": "Need for improvement",
          "Contenu": "Spent a lot of money here. The quality of calls is so so not to mention dropped calls and connection issues. Hard to get any issues resolved or get a credit when you are able to reach someone. Customer service could have been better.  Spent a lot of money buying cards from this company. Not sure if customer loyalty matters. Thinking about switching."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Bryan Doyle",
          "Nb_Reviews": 4,
          "Date": "2020-04-11T18:05:44.000Z",
          "Titre": "I reach out to the support people",
          "Contenu": "I reach out to the support people. The good news is they responded quickly the bad news is you could tell they did not even carefully read my question. They missed the point of my question entirely and never really addressed the problem.Luckily it was a relatively minor issue and I found my own solution."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Miss Idris",
          "Nb_Reviews": 8,
          "Date": "2019-05-20T10:20:04.000Z",
          "Titre": "It use to be a good connection and fair…",
          "Contenu": "It use to be a good connection and fair charge, but this two top up I did I felt a charge is happening even though call wasn't connected. I am your customer for long time and very rare when this kind of matter happened I believe this is my second or third time within in all this years, and hope it will be sorted soon. Thank you"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "P Walters",
          "Nb_Reviews": 2,
          "Date": "2018-12-30T16:09:14.000Z",
          "Titre": "I've been a customer for over 9…",
          "Contenu": "I've been a customer for over 9 years,and their customer service with regards to technical support has been very poor, one of my lines was spoofed by a telemarketing company, who used my virtual number, to call hundreds of people. When I asked Keep calling to check into it, they said that it wasn't possible! It has happened twice"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 4,
          "Date": "2019-02-16T22:57:45.000Z",
          "Titre": "Surprise we refilled you without your permission.",
          "Contenu": "My  recent auto  renewal was not authorized by me. I may have ordered soon but  I want to choose when Scary that you folks can access  my Paypal account without my authorization or permission under the guise of pre approved is troubling. Pre approved by who not me. The overall product is ok but stunts like this leave a bad taste."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Aman Reen",
          "Nb_Reviews": 1,
          "Date": "2020-01-08T10:41:24.000Z",
          "Titre": "Firstly i have done recharge of 9.99…",
          "Contenu": "Firstly i have done recharge of 9.99 dollar for unlimited calling to india  on 7 of jan...payment got deducted but voice call was not updated and today i again done payment of 9.99 dollr again payment deducted....Now same plan activate 2 times so plz its a request refund my one payment in my account ...."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Long time user of Allo Mali aka Keep Calling",
          "Nb_Reviews": 2,
          "Date": "2019-01-05T15:56:16.000Z",
          "Titre": "The quality of the connection to Mali is poor lately",
          "Contenu": "The quality of the connection to Mali is poor at times. The phone rings several times and no one picks up at the other end, yet I get deducted 1 minute of communication fee. Also, they should switch to a per second billing as sometimes the phone rings for 20 seconds and you get charged for one minute without even speaking to someone. I was not able to wish new year wishes to my Dad and Mom as the connection was not established yet the phone keeps ringing for long time. Thank you."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Basharat Ali",
          "Nb_Reviews": 2,
          "Date": "2019-07-06T07:39:59.000Z",
          "Titre": "Still waiting for your reply regarding the difference £:9",
          "Contenu": "Dear Sir / Madam,I have just started with your company for calling service but I am so sorry to say that I have spend almost £:22 In different time but KeepCalling only top up £:13 in to my account I have make a complaint against it on your contact Department, they reply me & advice me to send Proof of this perching, which I did Same day, Since almost 10 days gone but no one come back to me, I am still waiting for your kind reply. Thanks, Mr Basharat Ali, Mobile No. 00447450256355,"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "kobra rahbar nezhad",
          "Nb_Reviews": 2,
          "Date": "2022-09-06T20:27:59.000Z",
          "Titre": "expensive",
          "Contenu": "last time i bought voice credit plus discount but it has been finiched too sooner than always...  something same as marketing fraud"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "babji",
          "Nb_Reviews": 1,
          "Date": "2018-12-19T01:39:04.000Z",
          "Titre": "The sound is unnatural",
          "Contenu": "The sound is unnatural. We can hear resound, especially others can hear resound when we are speaking with a loudspeaker. I have a very good internet connection, still, it's saying poor internet connection. Other apps like Skype, WhatsApp, and messenger are working fine with this internet connection but not this app."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-05T08:34:30.000Z",
          "Titre": "Texting on my iphone is a disaster",
          "Contenu": "Texting on my iphone is a disaster, the font size is way too tiny and it always says ‘pending’ after a message is sent.Calling has a very bad quality and calls are regularly dropped for no reason. Offline calling is not working outside the US so it’s pretty useless for me.All in all, I would not recommend it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Girum",
          "Nb_Reviews": 3,
          "Date": "2018-09-13T16:19:54.000Z",
          "Titre": "Very difficult to get connection and…",
          "Contenu": "Very difficult to get connection and the voice quality is shocking. On top of that you keep charging, for God knows what, even without getting connected. The reason I use this service was to get connected whenever I want and have a normal conversation. But you are lacking the minimum standards for service quality, at a time when Viber, WhatisUp, etc. provide much better service for free. So, if it continues like this, it is a matter of time before I delete the application from my phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ace Vue",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T04:06:30.000Z",
          "Titre": "Basic VOIP service with technical…",
          "Contenu": "Basic VOIP service with technical support being in India. Response time is slow and I actually went 2-3 whole months where I'd make a call, get to say hello and then the call drops or gets muted and I can no longer talk to whom I was calling and still be charged for it. Then here are times when I just get completely rerouted to someone else and I still get charged for it. The only reason why I still use it is because it's the most cost effective choice for calling my relatives over seas."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fran Harris",
          "Nb_Reviews": 5,
          "Date": "2020-01-08T04:37:15.000Z",
          "Titre": "I tried calling to Canada on  Sunday",
          "Contenu": "I tried calling to Canada on  Sunday, Jan 5th and kept getting voice recording saying something about no line was available.  I tried several times to no avail and couldn't use Keep Calling.I emailed customer service at Keep Calling Sunday night (again on Jan 5th) and have not received a reply.  I don't know if I can keep using Keep Calling or what.  Can you please get back to me with some information and what needs to be done to rectify this.  Up until now I've have excellent service and NO complaints.  Tk you.  F. Harris"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Mamadou DIALLO",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T03:23:09.000Z",
          "Titre": "Many calls charged while the communication has not been established with the recipient.",
          "Contenu": "I keep getting  charged(my balance reduced) while the communication is not establissed with the targeted recepient. This is happening with not succeful call at all or even with the successful call I get charged for the waiting(ringing ) time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bizuayehu Belay",
          "Nb_Reviews": 1,
          "Date": "2019-08-12T17:53:27.000Z",
          "Titre": "The connection is poor most of the…",
          "Contenu": "The connection is poor most of the time.  When the person on the receiving end does not answer or the call would not go through, the customers pay for service.  Randomly, I also hear a repeating conversation on the other end when the line is actually disconnected  The fact is, the line is already disconnected, but a repeat of previous conversation before the line got disconnected keeps on playing making your customer believe that the person on the other end could not hear the conversation.  Yet, you make your customers pay for this system error."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Binny Singh",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T07:22:52.000Z",
          "Titre": "Poor sound quality"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "wendy",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T19:15:31.000Z",
          "Titre": "The calls get disconnected repeatedly",
          "Contenu": "The calls get disconnected repeatedly, during the course of conversations."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "TD",
          "Nb_Reviews": 4,
          "Date": "2019-02-11T04:18:28.000Z",
          "Titre": "unfortunately calls drop a lot and…",
          "Contenu": "unfortunately calls drop a lot and strangely they refund only if the call is less than 1 minutes and the timing starts from the first ring. Most of the time by the time the call is connected  more than a minute is gone. Also irs hard to keep writing back asking for refund."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "A. J. Glasser",
          "Nb_Reviews": 1,
          "Date": "2018-09-24T21:36:48.000Z",
          "Titre": "We had been most satisfied up until recently…",
          "Contenu": "We had been satisfied up until recently when we paid $10.00 into our account, and had it organized thru KeepCalling's office, only to try & place a call and be told that the $ were not in the account.  We will call to straighten this out, but we are most disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Floretta Seeland",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T22:47:08.000Z",
          "Titre": "nothing went wrong, everything is fine."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Peter Kozz",
          "Nb_Reviews": 1,
          "Date": "2021-12-03T00:22:42.000Z",
          "Titre": "When we place a call to Europe once a…",
          "Contenu": "When we place a call to Europe once a week, which may last for about an hour, we getting disconnected every 5-6 minutes, so we have to redial quite a few times during the conversation, it is pretty annoying"
        },
        {
          "Note": 2,
          "Lieu": "KN",
          "Pseudo": "khalid hakim",
          "Nb_Reviews": 1,
          "Date": "2019-07-13T23:57:17.000Z",
          "Titre": "i dial in w/ # correctly",
          "Contenu": "i dial in w/ # correctly, it rings ONCE,.........keepcalling cuts in......tells me to dial  my # ,,  .......i dial it correctly AGAIN,  ....rings ONCE,       EACH time charged for a CONNECTION.     DA !     it happens   ALOT.        khalid hakim (973)676-8008"
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "Girish Kumar",
          "Nb_Reviews": 2,
          "Date": "2018-10-18T13:10:44.000Z",
          "Titre": "Poor Quality.",
          "Contenu": "The experience with KeepCalling was nice before, even in weak network. Now it has lot of problem for getting call connection and its quality in weak network, especially with iOS platform. If it is not get improved, i would like to un-install the program immediately."
        },
        {
          "Note": 2,
          "Lieu": "PR",
          "Pseudo": "Alexander Alicea",
          "Nb_Reviews": 1,
          "Date": "2018-10-20T10:52:57.000Z",
          "Titre": "At first the app was working in perfect…",
          "Contenu": "At first the app was working in perfect conditions but afterwords sence la last update of the app it started to freeze and not working properly it needs a new update to fix any minor bugs or malfuntion im using a android model of the device is a pcd but app was working great at first please help fix this minor issue.Sincerly a client sence april 2018 thanks for taking the time to read my feedbackA 5 star will be awarded when help recieved as a great thanks and i will greatly recommend this calling app to all of my friends and shared in all social websites. Thanks again !=^)"
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Esmond Kusimba",
          "Nb_Reviews": 5,
          "Date": "2019-12-24T06:28:28.000Z",
          "Titre": "Using keepCalling app takes 5 to 6…",
          "Contenu": "Using keepCalling app takes 5 to 6 minutes to call. Everytime you try to make a call it say network is weak. Even if you are using phone data to call. Honestly that app need big improvement, and it is also not cheap.Other app offer the same rates too."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Murtaza Nazeeri",
          "Nb_Reviews": 1,
          "Date": "2018-11-16T01:58:40.000Z",
          "Titre": "Poor connection",
          "Contenu": "Poor connection. I have a very strong LTE connection and still sometimes lose connections and that causes for call failure. It happens over the WiFi as well. Wish I could refund some of my money. The only reason I gave two stars is because it’s more affordable!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "holly",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T21:08:14.000Z",
          "Titre": "I have been using your service for a…",
          "Contenu": "I have been using your service for a few months now. But since last January call quality is  bad because  long buzzing sound interrupts  the conversation after ten minutes or so. It goes on almost a minute then stops but after a few minutes it starts again. So I paid  for the minutes that I was not able to talk or hear the other side because of prolonged deafening sound. I was told to give another try and I tried today same problem going on even I tried different access numbers thinking it would make difference but it did not..I made a complain about it before I hope you can solve this problem as soon as possible. Because it will cost you losing your customers..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stanley Kemboi",
          "Nb_Reviews": 1,
          "Date": "2019-07-14T17:44:15.000Z",
          "Titre": "The calls are clear the only issue I…",
          "Contenu": "The calls are clear the only issue I have in comparison to what I used yesterday after I bought 25 dollar worth. KC calling gave less minutes per dollar.  I wish it was the other way around. I won't use it again until they adjust their discrepancies."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Samer",
          "Nb_Reviews": 8,
          "Date": "2018-12-18T14:50:59.000Z",
          "Titre": "People on the other end don’t like me… because they can not hear me clearly",
          "Contenu": "People on the other end don’t like me calling them using “keepCalling”, because they can not hear me clearly. I tried the free App and tried calling the direct Keepcalling number. both with same results. KeepCalling used to be good, but no more, sorry"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Natalia Andryuschenko",
          "Nb_Reviews": 1,
          "Date": "2018-09-11T19:29:15.000Z",
          "Titre": "I’ve been a customer for many years and…",
          "Contenu": "I’ve been a customer for many years and Recently I’ve had a problem with hearing the people I call on the other end. I will hear static and other people’s voices. If this issue isn’t resolved I will be forced to find a new company to use for my calls."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amal Rashid",
          "Nb_Reviews": 1,
          "Date": "2019-01-13T10:10:58.000Z",
          "Titre": "The quality of connections is poor",
          "Contenu": "The quality of connections is poor. I was talking with a family member in Iraq two days ago and I heard the first few phrases of conversation again and again, as it was recorded and replayed repeatedly . That was annoying and unsatisfactory."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-11-30T04:46:13.000Z",
          "Titre": "Notice for making international call using 800 access line",
          "Contenu": "Their service is usually good. International calls using local access number works fine, a week ago, I called Japan using local access number but it had very bad connection and couldn't continue, so I gave it up and tried 800 access number, which worked a while, but failed after 7-8min call and had to try back again with 800 access number. Then the 2nd call was terminated with zero balance warning message. I had enough balance in my account to begin with so checked my call history right away and found empty account balance. The reason why it became zero $ was they charged twice rate of local access number call for 800 access number. I knew I pay some fee for using 800 line use but never knew double charge for that. This must be stated so in their site, not just a extra fee !!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica Mina",
          "Nb_Reviews": 1,
          "Date": "2018-11-21T18:14:28.000Z",
          "Titre": "I like the low rate but think the call…",
          "Contenu": "I like the low rate but think the call quality is not very good. Also, hate that the amount is lost if not used. It should rollover and only renew funds when they are needed. I will probably be looking for another calling service."
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "Ahmed Mushtaq",
          "Nb_Reviews": 1,
          "Date": "2019-07-18T06:46:54.000Z",
          "Titre": "I have multiple time experienced that…",
          "Contenu": "I have multiple time experienced that voice voice quality degrades gradually. Voice quality is good at the start of a call, but it becom unacceptable after 1 minute (approximately).KeepCalling Web shop functions excellent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stuart Goldberg",
          "Nb_Reviews": 1,
          "Date": "2018-08-28T16:53:34.000Z",
          "Titre": "Connectivity Issues",
          "Contenu": "Oftentimes calls do not go through on the first try.It often claims that it has no connection when in fact there is a network connection. The only thing I can do is stop the App and restart it.Your rates, though are great."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Acie",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T13:41:03.000Z",
          "Titre": "It works most of the time and its…",
          "Contenu": "It works most of the time and its inexpensive. Biy I do get a lot of goodbyes and teh phone hangs up unexpectedly. This hapens quite often to me."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Gold",
          "Nb_Reviews": 6,
          "Date": "2018-08-25T21:38:33.000Z",
          "Titre": "Not the greatest call app",
          "Contenu": "Not the greatest call app. The down side is that you have to use wifi as you can't call direct using your existing minutes to connect. Without internet, you can't use it to call. So a waste of money where that is concerned. It is too expensive for the type of value that you get and the line is not too good. It cuts off and you can hardly hear the person on the other side of the line, when you do, they can't hear you. This is a continuous problem since using this app, but as internet is free everywhere these days, it is cheaper for international calling than using your phone  ring international numbers directly. If you can find a better option, then by all means do so."
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "Nasarudeen",
          "Nb_Reviews": 3,
          "Date": "2018-09-09T10:05:41.000Z",
          "Titre": "I used your calls last two times",
          "Contenu": "I used your calls last two times, I was satisfied, but this third time I have many problem by use this. Many times when I dial, No internet connection message is coming regularly even I have good net connection."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CK Savage",
          "Nb_Reviews": 1,
          "Date": "2019-11-16T00:15:20.000Z",
          "Titre": "Poor user access to site but want it to work",
          "Contenu": "This review is based on usability of the website. I want this service. I have to make an account to get it. I have been unable to create an account but thought I had. I can't reach the customer service site so I can call Keepcalling. I really want this to work. I'm frustrated. Please reach out if you see this, to the company, and help me so I can use your service.Thanks.ed on usability of the website. I want this service. I have to make an account to get it. I have been unable to create an account but thought I had. I can't reach the customer service site so I can call Keepcalling. I really want this to work. I'm frustrated. Please reach out if you see this, to the company, and help me so I can use your service.Thanks."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Sue Ballance",
          "Nb_Reviews": 2,
          "Date": "2019-04-21T17:59:51.000Z",
          "Titre": "I love Keep calling  and when it works…",
          "Contenu": "I love Keep calling  and when it works its a fabulous tool for keeping in touch However recently every time I try to ring the States its says lines down for maintenance I have asked about this issue before ... like over the last year 18months at least and was told theline would be upgraded   after that I think I got through once ..its really frustrating and a reason why I nearly didnt renew my subscription.The other calls like to the UK have gone through no problem , I did have problems with those in thepast but they seems to have resolved.Its such a shame I have written to help line about it , I have ammended the star rating ... which is time consuming and annoying to have to do that ..and it doesnt seem to make any difference ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fouad Mirzashafa",
          "Nb_Reviews": 1,
          "Date": "2019-02-18T01:59:24.000Z",
          "Titre": "The connection is very bad unable to…",
          "Contenu": "The connection is very bad unable to hear and my called destination had hard time hearing me. Dialing an old number and having had called that number before I was told I did not have enough credits."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Abdeali Walijee",
          "Nb_Reviews": 3,
          "Date": "2019-11-23T14:21:33.000Z",
          "Titre": "poor connections",
          "Contenu": "at times it is good; but at times it is very poor connection or to hear; or communicate. On Friday,11/22/19 connection got disconnected all the time and I was charged for those unconnected call."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "MJ Matthew",
          "Nb_Reviews": 8,
          "Date": "2022-04-02T22:01:26.000Z",
          "Titre": "It doesn't work with Bluetooth",
          "Contenu": "It doesn't work with Bluetooth, once the receiver picked up the call is cut off from the Bluetooth. Please do something about it.Mary."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Philip Robertson",
          "Nb_Reviews": 4,
          "Date": "2018-08-31T12:24:26.000Z",
          "Titre": "i get charged for calls not completed",
          "Contenu": "i get charged for calls not completed. get disconnected requiring me to make the call again. recently from another company charging 10% less per minute and considering making the change.  Phil"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SR",
          "Nb_Reviews": 2,
          "Date": "2020-06-23T18:16:41.000Z",
          "Titre": "Expensive",
          "Contenu": "I use KC because my options calling relatives in South America are limited. The service however, appears unnecessarily costly, particularly during these times of forced isolation."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "joe",
          "Nb_Reviews": 1,
          "Date": "2018-11-05T22:50:04.000Z",
          "Titre": "Quality isn't what it used to be",
          "Contenu": "Quality of calls isn't what it used to be. When calling Europe, calls get dropped and you have to start over. I'm looking for another carrier. I'll pay more for better quality."
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Ordre",
          "Nb_Reviews": 6,
          "Date": "2018-11-12T09:06:43.000Z",
          "Titre": "I have had enjoyed Keep calling for…",
          "Contenu": "I have had enjoyed Keep calling for years, but suddenly now over the past few months it is really bad. Poor connection breaking off every 5 minutes not only for 1 country but several."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Urbano",
          "Nb_Reviews": 2,
          "Date": "2020-03-07T03:39:51.000Z",
          "Titre": "Always lagging",
          "Contenu": "Always lagging. Me and the other person at the other end step on each other because of the delay. I hope this gets fixed or I will switch to another carrier that does not lag."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "maria nolasco",
          "Nb_Reviews": 1,
          "Date": "2019-03-20T23:26:10.000Z",
          "Titre": "When i try to call the machine said.",
          "Contenu": "When i try to call the machine said.. i don't have any credit so.. you get the money every month and now just i can't call because suppose i don't have credit... omg!!"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "jakeer mohammed",
          "Nb_Reviews": 1,
          "Date": "2018-11-05T03:09:23.000Z",
          "Titre": "Cal services are ok",
          "Contenu": "Cal services are ok, but last monthly subscription charged my account twice even after raising the query didn’t get resolved.so ended up paying double charges for one month"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Rushi Sheth",
          "Nb_Reviews": 1,
          "Date": "2019-01-11T19:52:35.000Z",
          "Titre": "Crazy fake offers",
          "Contenu": "It plays politics. Offers you 10% bonus and the amount gets deducted similar to bonus received. That's crazy!!! So you just get 0.05 extra talk time. What a joke..!!!?"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Richard Francis",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T12:21:17.000Z",
          "Titre": "GREAT SERVICE BUT EXPENSIVE",
          "Contenu": "It works really well and is good for topping up someone in another country in an emergency. But the exchange rates used are pretty outrageous"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marta",
          "Nb_Reviews": 1,
          "Date": "2019-12-23T23:52:08.000Z",
          "Titre": "Poor connection",
          "Contenu": "Poor connection. I had to dial 6 or 7 times to hold a conversation with my sister. I was disconnected every 8-10 minutes. The quality of the call was poor to fair."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Monthly member",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T11:39:08.000Z",
          "Titre": "Sometimes works sometimes not",
          "Contenu": "I pay monthly sometimes work sometimes not. Lately not I start looking for another company if this is continuing."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Ha Ra",
          "Nb_Reviews": 2,
          "Date": "2022-09-28T19:03:09.000Z",
          "Titre": "Expensive",
          "Contenu": "Expensive. Call quality is also not the best. Connection sometimes broke"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Juan Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T19:15:20.000Z",
          "Titre": "Before your company used to offer Us…",
          "Contenu": "Before your company used to offer Us coupons and discounts now you don't do none of that and the cost is gone up and calling El Salvador"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "dorte brydges",
          "Nb_Reviews": 11,
          "Date": "2020-05-30T15:14:47.000Z",
          "Titre": "I can  not all for more than 13 minutes…",
          "Contenu": "I can  not all for more than 13 minutes at a time  and then have to call back and given another 13 minutes and on it goes. I USED to get an hour long !!!!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Imad Takla",
          "Nb_Reviews": 2,
          "Date": "2018-12-05T00:13:22.000Z",
          "Titre": "Tariff is very expensive to call syria…",
          "Contenu": "Tariff is very expensive to call syria 🇸🇾 I am a customer since 4 or 5 years but the tariff was changed,, one minute coast me 50 cents tooo much"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Tammy",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T17:23:04.000Z",
          "Titre": "The call keeps dropping",
          "Contenu": "The call keeps dropping. Very blotchy and your balance goes down without having a conversation.  I wouldn't recommend."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Raghav Sharma",
          "Nb_Reviews": 1,
          "Date": "2018-11-30T22:17:37.000Z",
          "Titre": "Sometimes the call quality gets really…",
          "Contenu": "Sometimes the call quality gets really worse I can’t even understand what the person on other side is saying please work on this and improve the call quality."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nimtz Scott",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T03:42:54.000Z",
          "Titre": "How to loose your calls",
          "Contenu": "I use this to call Mexico. It drops calls every 10-15 minutes, 20 at best. They can hear me, but I can’t hear them."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Helen Ho",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T06:37:35.000Z",
          "Titre": "Frequent interruptions to call quality.",
          "Contenu": "Frequent interruptions to call quality.Have to keep calling back in the hope that the interruptions will go away."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Zenas Naidoo",
          "Nb_Reviews": 1,
          "Date": "2020-01-31T03:23:27.000Z",
          "Titre": "Not good connections",
          "Contenu": "Not good connections. Always getting cut off. And too expensive for where I call. Every time I get cut off, have to pay again for the next minute."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "George Cotzas",
          "Nb_Reviews": 1,
          "Date": "2019-04-30T18:16:31.000Z",
          "Titre": "Calls to Athens, Greece",
          "Contenu": "I frequently call friends and relatives in Athens Greece. The quality of the calls improves and becomes acceptable when I bother rate my experiences."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Eva",
          "Nb_Reviews": 1,
          "Date": "2020-02-08T04:57:14.000Z",
          "Titre": "I have pinlessdialing enabled but I…",
          "Contenu": "I have pinlessdialing enabled but I always have to put in my pin. There is a free calling number for cellphones from NZ but it is always engaged."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vasile Hagiu",
          "Nb_Reviews": 1,
          "Date": "2019-02-04T22:28:02.000Z",
          "Titre": "If used while driving it will give you…",
          "Contenu": "If used while driving it will give you the message “ no internet connection “ and will drop the cal although the sognal on my phone shows full LTE :("
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Jaganjot Singh",
          "Nb_Reviews": 2,
          "Date": "2019-05-13T09:24:14.000Z",
          "Titre": "I can't use speaker mode when i am…",
          "Contenu": "I can't use speaker mode when i am unable to hold phone. Voice quality is getting bad to worst. I think i will gave up keep calling in few weeks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ilkhom Khodjaev",
          "Nb_Reviews": 2,
          "Date": "2022-01-06T12:36:52.000Z",
          "Titre": "Pool was busy for unknown reason but…",
          "Contenu": "Pool was busy for unknown reason but from other phone I was able to call in. I even restarted my phone, still same issue."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Savka Orozovic",
          "Nb_Reviews": 3,
          "Date": "2022-02-07T17:49:47.000Z",
          "Titre": "Not reliable service",
          "Contenu": "The connections are very often poor, breaking down and unpredictable.The rates are expensive for some destination."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "ranjit kaur",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:08:44.000Z",
          "Titre": "Call recording facility is unavailable",
          "Contenu": "Call recording facility or back up is not available. Some other company or apps are providing facility of call recording. Like when we open our account or login, detail of calls along with voice recording is provided. Kindly improve it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Z",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T21:15:39.000Z",
          "Titre": "It works some times...",
          "Contenu": "It works very well, unfortunately not all the time. There are days when it does not work. Also sometimes it does not recognize that phone is connected with strong wifi. I hope you will work on improving reliability."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "GARY CHRISTOPHER",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T05:17:10.000Z",
          "Titre": "I find out that many times I can't…",
          "Contenu": "I find out that many times I can't connect to the server to make a call."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 5,
          "Date": "2023-11-03T15:50:05.000Z",
          "Titre": "Overall good, but a couple of issues",
          "Contenu": "Good connections. Two problems are 1) the telephone number the receiver sees is different every time (at least when I call the UK) which makes it difficult to know whether it's a scam or not. 2) I had it set on AUTO refill, but it ran out while I was on the phone and when I looked at my online account, it showed as $0 so I had to add money."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "Shaun",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T20:59:08.000Z",
          "Titre": "Not bad",
          "Contenu": "Occasionally doesn't connect on the first attempt first time, especially with the use of recent calls. Some static at other times. Easy to navigate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sekar",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T01:14:15.000Z",
          "Titre": "Phone App interface is pretty bad",
          "Contenu": "Phone App interface is pretty bad. Improve design, font size, contrast level, Ux, etc. Provide a dark mode. If the App UI is improved I would give 5-star rating."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-09-09T13:01:19.000Z",
          "Titre": "Keep calling is mostly great but…",
          "Contenu": "Keep calling is mostly great but sometimes the call can be dropped  suddenly. If my call is super important I don't like using Keep Calling as it can be unreliable. If my call is relaxed I love keep calling as the line is clear and it is a good price"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Borzan Daniel",
          "Nb_Reviews": 4,
          "Date": "2023-05-13T06:18:23.000Z",
          "Titre": "I can't talk from the car.",
          "Contenu": "My problem is that I can't talk from the car, that is, the car doesn't recognize the call, or if it does, then the other person can't hear me.the other problem is, a notification that the credit ends would be good, at least 10 seconds before."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "EM",
          "Nb_Reviews": 4,
          "Date": "2023-02-20T15:50:09.000Z",
          "Titre": "Quite expensive app to call to Russia",
          "Contenu": "Quite expensive app to call to Russia, no discounts amount of voice minutes purchase, no discounts for returned customers. No discounts at all. The app keeps closing down during phone calls and I have to reconnect. Almost every day."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Yudit Margulies",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T23:29:57.000Z",
          "Titre": "Usually great service but many times…",
          "Contenu": "Usually great service but many times the phone line is unclear and the line disconnects"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "R. O.",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T23:26:21.000Z",
          "Titre": "Auto reload",
          "Contenu": "The quality is good but I have a big issue with it. I put my account to reload automatically so prevent any disconnect but every time it reloads it gets disconnected and I have to call that person again. It would be nice if the issue is resolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rockyhes",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T12:11:43.000Z",
          "Titre": "Sweeter than sour in two years",
          "Contenu": "I give “keep calling “ 8 out of ten because the con is I’ve lost minutes I did not use during the pandemic and I am unable to recharge while on the phone. Pro is that it has been excellent otherwise. I recommend it!!IG:rockyhes"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Daniel Zorkli",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T08:41:57.000Z",
          "Titre": "The clarity must be improved"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Michael",
          "Nb_Reviews": 8,
          "Date": "2023-11-16T14:48:35.000Z",
          "Titre": "Annoyingly drops calls in…",
          "Contenu": "Annoyingly drops calls in mid-conversation — not to some overseas number but to my daughter in Vancouver."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Savka Orozovic",
          "Nb_Reviews": 3,
          "Date": "2023-08-09T21:22:57.000Z",
          "Titre": "The connection is not the best",
          "Contenu": "The connection is not the best, very often i can hear my voice back just repeating what was already said."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Amo JLR",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T06:22:39.000Z",
          "Titre": "Landline bugs",
          "Contenu": "It is very inconvenient that I can no longer make calls using a fixed line.  I am obliged to make calls using my mobile phone."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Liz Aiken",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T23:15:49.000Z",
          "Titre": "I renewed my account or topped it up",
          "Contenu": "I renewed my account or topped it up. I always used an Access number 524-908-4462 and then put in my ID# and all was well.  Today, t said my ID# was invalid when I put it in after the access number! I searched on google and found an 800 # and that worked with my ID#. Do you know why?"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "from me",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T12:59:16.000Z",
          "Titre": "they cannot hear ne welll from New Zealand…",
          "Contenu": "sometimes when I call from New Zealand to Iran, they cannot hear me at all or the voice is very low.  I can hear them. Sometomes isok. I let them know a few times when not ok.  Do not remember the dates. but I let you know via a message. Last call I did was OK."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Said Bagherieh",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T15:57:27.000Z",
          "Titre": "Recently the connection is not as good…",
          "Contenu": "Recently the connection is not as good as before. Every few minutes the call disconnects and have to dial again."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "J Zhu",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T14:30:01.000Z",
          "Titre": "Disconnection without warning while in phone coversations",
          "Contenu": "I hate line disconnection while in our phone talks."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Diane",
          "Nb_Reviews": 3,
          "Date": "2023-05-01T12:18:54.000Z",
          "Titre": "Calling from a landline is ok",
          "Contenu": "Calling from a landline is ok, but from a mobile, the call keeps cutting out."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "MR REZA",
          "Nb_Reviews": 6,
          "Date": "2023-06-02T23:13:09.000Z",
          "Titre": "The connection is fine and fast",
          "Contenu": "The connection is fine and fast, but the quality of conversation is poor and with many interrupt."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "MD EKRAM HOSSAIN",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T06:00:18.000Z",
          "Titre": "No Indonesia Unlimited Call Package And…",
          "Contenu": "No Indonesia Unlimited Call Package And I bought some dollars to make voice calls But I don't understand the correct time of call Please add some new futures And it's better to include Indonesia's unlimited call package"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Kent",
          "Nb_Reviews": 12,
          "Date": "2023-10-05T04:45:25.000Z",
          "Titre": "You can find better",
          "Contenu": "It works but they never improve their product. Their app is not really user friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "pamela montapert",
          "Nb_Reviews": 11,
          "Date": "2023-02-16T00:56:05.000Z",
          "Titre": "I used to be very happy with…",
          "Contenu": "I used to be very happy with Keepcalling.Lately, my calls  are getting  cut off  and they have not fixed the problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gica Petrescu",
          "Nb_Reviews": 11,
          "Date": "2023-08-17T12:24:55.000Z",
          "Titre": "Every time when I talk I can hear the…",
          "Contenu": "Every time when I talk I can hear the echo of my voice, is very annoying"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T21:06:32.000Z",
          "Titre": "High rates for cell",
          "Contenu": "Very high rates, calls get interrupted. Good connection."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Abdelamlek Ouazene",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T03:36:56.000Z",
          "Titre": "I recharged my phone by mistake when I…",
          "Contenu": "I recharged my phone by mistake when I wanted to recharge voice credit, but they didn't want to cancel the transaction"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Roland GILBERT",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T16:05:19.000Z",
          "Titre": "Rates are good but connection quality…",
          "Contenu": "Rates are good but connection quality is bad."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Ha Ra",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T17:39:22.000Z",
          "Titre": "Call quality is very bad",
          "Contenu": "Call quality is very bad. Price is also high compared to the service"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "abdelli aymen",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T22:30:32.000Z",
          "Titre": "Good but expensive",
          "Contenu": "Good, fast but expensive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Svetlana",
          "Nb_Reviews": 3,
          "Date": "2023-07-14T22:26:33.000Z",
          "Titre": "Last phone Call was not good",
          "Contenu": "Last phone Call was not good, I called again and again to reach better quality!thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg Melan",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T05:40:42.000Z",
          "Titre": "Decent Call Quality...but...",
          "Contenu": "In general the call quality is acceptable but that is not soley dependent on their service as your internet connection need to have a decent signal.  That being said, there is something that is specific to their service that has made me search for alternatives.  Many of my international calls to the USA are to companies where wait times can exceed 20 minutes.  I have experienced on multiple occasions being dropped after on hold for anywhere from 18-22 minutes.  Then I lose my queue and have to start over.  Aside from the frustration, I have lost those call minute credits.  I have used my G-Voice and another app and never had this experience.  But 75% of the time I exceed 18 minutes holding I get dropped by KeepCalling.Regarding response from KeepCalling, of course I implemented all their suggestions. I even tried a few of my own corrective measures given I’m technologically adept. Unfortunately, results were the same. Dropped calls after 18-22 minutes."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "John Barrett",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T03:36:29.000Z",
          "Titre": "Unable to recharge from app reply update",
          "Contenu": "It would be nice to recharge my account from the mobile app when Iwant to recharge, like other service providers. There seems to be a very big push to use auto recharge. Good to have this option but not good to be the only option.Reply:Thanks for responding to my review.I understand there are other ways to recharge my credit. I am using the latest IOS software. It is unfortunate that, due to Apple’s policies, Keep Calling have no option to add Voice Credit directly from the KeepCalling App, as you state in your reply. I am however able to add credit directly from the Toolani App using the same phone with the same IOS software. Perhaps Keep Calling could find out how to do this with the IOS software?I hope this information helps."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gertrude K",
          "Nb_Reviews": 4,
          "Date": "2022-07-02T19:35:11.000Z",
          "Titre": "I like this system when it works but on…",
          "Contenu": "I like this system, however on a regular basis when I go to call someone it says \"account failed to register\" I always have a credit on my account so that is not the issue. The only way to fix the problem is I have to shut my phone down. This is definitely frustrating. When I do call and get through it does work well."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Victor Aldea",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T20:14:19.000Z",
          "Titre": "I am usually calling a landline in…",
          "Contenu": "I am usually calling a landline in Romania. The connection used to be very good in previous years, but now it often breaks up and there is also some noise in the background (like a fax machine or dot matrix printer).I can still get a good connection sometimes, but this happens less than 50% of the time now."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jean Lessard",
          "Nb_Reviews": 4,
          "Date": "2022-05-10T15:37:42.000Z",
          "Titre": "Had a hard time to find my history",
          "Contenu": "Had a hard time to find my history. I still don't know what my conection no. is and the last time I checked it was in toronto. I live in Montreal and don't know how to switch the nos. With the toronto no. it cost me a long distance charge with my house phone usage. It happens sometimes that the phone no. I use to Nevis has music or an english program from england playing instead. When it goes well, your sound is clear and connection is quick"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Turhan Valliani",
          "Nb_Reviews": 12,
          "Date": "2022-10-18T19:19:00.000Z",
          "Titre": "I don't understand each time I use the…",
          "Contenu": "I don't understand each time I use the line I get charged every single time in increments of $ 5.00 re-charge -"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Samer",
          "Nb_Reviews": 8,
          "Date": "2022-04-03T18:28:02.000Z",
          "Titre": "Works but not clear enough",
          "Contenu": "Not very clear, not reliable, sometimes line will but I will be hearing a recording of the other person playing back since started the call. Customer support will only blame my 500 Gb internet speed. I will also be charged for unanswered calls. Used to be much better but years ago."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Urs Eggimann",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T18:28:35.000Z",
          "Titre": "I always have Trubel calling Switzerland"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HI",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T16:45:22.000Z",
          "Titre": "Unfortunately",
          "Contenu": "Unfortunately, the service recently is not as reliable as when I first started to user KeepCalling. The communication keeps disconnected after 10 minutes conversation despite excellent internet connection"
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Hamed Jafarzadeh",
          "Nb_Reviews": 3,
          "Date": "2021-05-27T14:40:33.000Z",
          "Titre": "It stopped working and they are not…",
          "Contenu": "It stopped working and they are not refunding my account balance. Send their support over 10 emails, they always respond with a pre-defined answer that update your app. My app is the latest version and already tried reinstalling, cleaning cache and everything they suggested, it is not working . it stuck on ringing, without the other person receiving the call. Clearly a scam, got the money and no service after that. --- Update : after two days, I got my money refunded"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erick Salmon",
          "Nb_Reviews": 2,
          "Date": "2020-08-18T20:36:59.000Z",
          "Titre": "Sometimes it doesn’t work at all!",
          "Contenu": "Sometimes it works very pleasantly but some other times, though I have full strength WiFi, I get none of the 5 dots in the KeepCalling  app showing there is a good connection from the WiFi to the KeepCalling app. Tonight I spend a good two hours by the campground reception where I am at and where the WiFi is but NOTHING went through. I couldn’t get ANY of my important phone calls through."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "KAKARELIS PETER",
          "Nb_Reviews": 2,
          "Date": "2022-03-19T03:01:50.000Z",
          "Titre": "some times works and some time is…",
          "Contenu": "some times works and some time is disasteralso i m in toronto ont canada and i use the app to call long distances but the calling first ottawa number first why is this i m in 647 or 416from calling areathankspeter"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Katarina House",
          "Nb_Reviews": 9,
          "Date": "2019-08-09T17:30:52.000Z",
          "Titre": "Quality and Dropped Calls",
          "Contenu": "I am having problems with the quality of the calls (I usually call Sweden) and that they are dropped after a bit. The only times I have had success is when I sit still in our house and I have our internet connected. I also have data through my phone. It seems that I need to be in one place or have a super strong connection to internet for this to work well. JAJAH was better in my opinion."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Graham Bell",
          "Nb_Reviews": 1,
          "Date": "2019-10-19T13:51:42.000Z",
          "Titre": "no reply when i contact Keep calling through email",
          "Contenu": "I am pleased with the calling service abroad lines not always good but that's to be expected, my only gripe is I have tried many times to send txt through there system and for some reason they are never sent so I contacted keep calling twice regarding this issue I am still waiting for a reply Nothing so far back from them, my only disappointment with them not replying to give me some advice as how to sort this issueRgds Graham Bell"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Miss Charity",
          "Nb_Reviews": 6,
          "Date": "2019-08-22T09:20:56.000Z",
          "Titre": "Used to be better now it’s just bad",
          "Contenu": "When I first started using it, it worked well. But recently, when I try call a number it’s directing me to a completely different person and probably country. Have to try 2-4 times to finally connect to the number I’m actually trying to call. Secondly, doesn’t show ringing anymore, it just says connected even before it says ringing, so you have no idea whether the phone is ringing or you’re being charged for all that time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Zariv",
          "Nb_Reviews": 1,
          "Date": "2019-06-20T21:09:15.000Z",
          "Titre": "Overall was good",
          "Contenu": "Overall was good. One challenge they have is that during the call/conversation with other person, machine comes on and asks to dial the number you want to connect with and hangs up your call and you have to redial your party again to reconnect. I have notified their support and they are telling me that they have adjusted the line but it keeps repeating the interuption of the machine in your conversation.......... Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chanel Miller",
          "Nb_Reviews": 1,
          "Date": "2019-06-11T01:54:21.000Z",
          "Titre": "I get a lot of dropped calls and I use…",
          "Contenu": "I get a lot of dropped calls and I use it for texting now only there's calls drop constantly so it's no good in service for me talking that's why I gave it at 3 I wish I could give it a three and a half because it is pretty good sometimesbut overall it's okay if you want to text with it and not talk constantly when you call in Nigeria and losing calls all the time so that's money wasted going down the drain"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Din",
          "Nb_Reviews": 1,
          "Date": "2020-03-29T16:29:04.000Z",
          "Titre": "When you campare with others give less…",
          "Contenu": "When you campare with others give less minutesOn talking to someone else cutting off..When customers trying to contact with customer service on phone can not ...On on....It's not easy or simpl process to go throughto call In 21 century...In my opinion should be very easy and simply way ...to attract customers..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Marquette",
          "Nb_Reviews": 4,
          "Date": "2021-04-10T05:45:44.000Z",
          "Titre": "Being honest...not mean",
          "Contenu": "Calls to Cuba are way too expensive--more than in places much farther such as Africa and Europe. That's the reason I don't call to Cuba as often as I'd like to. If I could find less expensive ways to call to Cuba I'd not be using this website. I know honesty is becoming more and more rare, but it hasn't extinct as yet and I'm proof of that. So please, don't take my honesty as being mean. Nonetheless, I have given you three stars for the good service you provide. Apart from being too expensive, I never had any issue with the delivery of your service."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Sam Bootsma",
          "Nb_Reviews": 1,
          "Date": "2022-01-15T20:21:23.000Z",
          "Titre": "Not enough time to punch in pin",
          "Contenu": "Not enough time to punch in pin.  Especially true if PIN and phone number to call are on different screens.  Then you need to navigate between the two, and there is not sufficient time before Keep Calling cuts you off."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Sohil Visar",
          "Nb_Reviews": 3,
          "Date": "2021-11-01T20:19:06.000Z",
          "Titre": "It was working earlier but from last…",
          "Contenu": "It was working earlier but from last few weeks I am experiencing lot of APP OFFLINE issue despite my internet is working fine and I can browse on all the other websites. I would really like someone to look into this with urgency!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Douglas",
          "Nb_Reviews": 1,
          "Date": "2021-01-13T20:42:54.000Z",
          "Titre": "General calling",
          "Contenu": "While calling outside of the US, call volume is low & when put on speaker phone There seems to be a lot of echo.Recently while calling in the US to home in Peru the calls kept dropping off.I am going to try a local KC # for Charleston, SC to see if that helps."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NL",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T23:04:06.000Z",
          "Titre": "The connection of the phone call abroad…",
          "Contenu": "The connection of the phone call abroad is always very good. In many of my calls to Germany there is a lag though and the person gets my communication delayed and starts talking when I am not yet finished, or even asks if I am still on the line, just because of the lag."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sal Sha",
          "Nb_Reviews": 3,
          "Date": "2019-08-21T02:44:59.000Z",
          "Titre": "Quality of sound sometimes is very bad, and also you loose minutes due to no connection.",
          "Contenu": "Quality of sound sometimes is very bad, the structure of the app within is complicated, you cannot pay via the app and that is less secure,  displaying the balance or the minutes consumed is also not very clear.An update I n response to KeepCalling’s response:I had used exactly what you suggested, and still... I even had calls connected to countries I did not intend to call!!  Again, I did everything you’ve mentioned in your response, and nothing has improved.  I really believe that you need to work much more on it."
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "Joao Taborda",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T05:48:51.000Z",
          "Titre": "The pricing is good but there are…",
          "Contenu": "The pricing is good but there are several errors. Sometimes I have available balance and it says that there is no balance. Others say that I don't have an internet connection and asks if I want to activate \"Offline Calling\", and I have an active internet connection."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maria  Alexiev",
          "Nb_Reviews": 3,
          "Date": "2020-12-06T19:53:31.000Z",
          "Titre": "Not very happy with the service",
          "Contenu": "Not very happy with the service. Many times the connection is impossible, just gives you busy signal. Other times, you just get silence.From the many conversations I had with customer service/ support, they ask you to reboot your device! Mediocre service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ILDA",
          "Nb_Reviews": 3,
          "Date": "2019-05-16T15:28:52.000Z",
          "Titre": "What I like about Keep Calling is the…",
          "Contenu": "What I like about Keep Calling is the fact that there are no hidden fees. You know how many minutes you have used and what remains, and the remaining minutes don't \"disappear\" like with all the phone cards I used to buy. What I don't like is the fact that the rates had gone up (for the country I call) a lot, from 12 cents/minute to 17 cents/minute if you call a landline, and from 25 cents/minute to 40 cents/minute if you call a cellphone. As you can see the rates had gone up significantly, and the rates only go up, they never go down."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Noeline Vorster",
          "Nb_Reviews": 1,
          "Date": "2019-05-09T10:03:20.000Z",
          "Titre": "Not always good",
          "Contenu": "Sorry, I'm disappointed at times... I have enough credit like $20 on my account and when I phone a voice comes up saying that I do not have enough credit...  The lines are also not very clear and breaking up so that I cannot here my family/friends on the other side."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeremiah",
          "Nb_Reviews": 2,
          "Date": "2020-05-10T10:52:10.000Z",
          "Titre": "Text message does not work....",
          "Contenu": "I am disappointed since the phone service seems to work but the text messaging does not seem to work at all. I will continue using it for calls since it seems to be a good deal at this time. I will be looking into other services that is fully functional."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Asghodom",
          "Nb_Reviews": 2,
          "Date": "2020-03-23T13:38:14.000Z",
          "Titre": "The rate per minutes to call Eritrea is…",
          "Contenu": "The rate per minutes to call Eritrea is very expensive and if you could reduce the it I can assure everyone will switch to you and will see a big change on your revenue.  I strongly recommend you to revisit you rate specially with trying time.Thank you,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maria Grigoropoulou",
          "Nb_Reviews": 3,
          "Date": "2019-08-23T19:18:53.000Z",
          "Titre": "Lately the international calls are…",
          "Contenu": "Lately the international calls are dropped ( while there is a signal) . Sometimes the speaker is not audible.Also, iIhave been using this company for at least 5-6 years. I have received a coupon maybe one time in all those yeas. Thank you,Maria"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Charly Makitu Kivuvu",
          "Nb_Reviews": 1,
          "Date": "2019-08-25T10:46:52.000Z",
          "Titre": "Si tu your system or seems impossible…",
          "Contenu": "Si tu your system or seems impossible when making internal Call To change à number that i am calling for without hand up and start Cali.. can you improve tour service.Why when calling a number is local orunknow  number which appearingThx"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Galal Alzokm",
          "Nb_Reviews": 4,
          "Date": "2019-09-08T16:11:59.000Z",
          "Titre": "The service is excellent but your rate…",
          "Contenu": "The service is excellent but your rate for calling Egypt is very compared to your rate for calling to Israel and some neighboring countries I recommend that you review your rate for calling Egypt because on the face of it seems unfair Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerzy Pytko",
          "Nb_Reviews": 3,
          "Date": "2023-08-13T16:05:59.000Z",
          "Titre": "connection interrupts after a few…",
          "Contenu": "connection interrupts after a few minutes of conversation"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TRS",
          "Nb_Reviews": 2,
          "Date": "2020-05-30T20:45:15.000Z",
          "Titre": "The recent call was bit disappointing…",
          "Contenu": "The recent call was bit disappointing as compared to the better experience in previous occasions. Had the impression that the agent could have been more professional and better receiving! Hoping to have better experience next time."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Felix Jim",
          "Nb_Reviews": 2,
          "Date": "2019-07-01T12:40:21.000Z",
          "Titre": "Call costs",
          "Contenu": "Your charges for making calls are way high. Could you please lower them .With what's app  I am able to make some free international calls. Unfortunately on some phones I can not but where ever I can, it's absolutely free.😏"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Parshotam Malhotra",
          "Nb_Reviews": 3,
          "Date": "2019-06-22T18:27:39.000Z",
          "Titre": "I have to dial a 4 digit security code…",
          "Contenu": "I have to dial a 4 digit security code which other cards do not require this. They should give billing date reminder with remaining minutes at least 5 days in advance. Once in a while I get poor connection or no connection or wrong number."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ibrahima Sarr",
          "Nb_Reviews": 2,
          "Date": "2019-06-07T13:15:46.000Z",
          "Titre": "I am still using keep calling to make…",
          "Contenu": "I am still using keep calling to make international calls, but I recognize the services offered are still so higher. Much effort could be made to attract more customers . Also, I think it’s important to do some prpromotions sometimes."
        },
        {
          "Note": 3,
          "Lieu": "KZ",
          "Pseudo": "Midhat Farooq",
          "Nb_Reviews": 1,
          "Date": "2019-11-05T14:28:32.000Z",
          "Titre": "Because call is not connected properly…",
          "Contenu": "Well,all i can say is that this app provides very good way to correspond to your near ones even when internet connections are not working in the area to which you want to call..!!by making an international call that too on suitable prices and offers ! But like all other apps it also has some drawbacks like call is not connected properly at once... My lot  of time is squandered  while trying! And sound quality is not good sometimes But as such is very good app... And came to my rescue when all other communications means were suspended in kashmir! I supplicate to the authority to improve call quality and also huge Huge hats off from me to them for other initiatives!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Turhan Valliani",
          "Nb_Reviews": 12,
          "Date": "2021-08-27T15:57:10.000Z",
          "Titre": "I think I am being charged before the…",
          "Contenu": "I think I am being charged before the expiry of the minutes in almost all cases if I have 30 minutes left after speaking for 10 minutes or so I am charged again - this should not be the case !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Islam Babiker",
          "Nb_Reviews": 1,
          "Date": "2019-10-07T12:32:17.000Z",
          "Titre": "Before was good but now not any more.",
          "Contenu": "Before was good but now not any more. the line keep disconnecting for awhile and come back again the whole conversation, it's really annoying and west of time and money. The three stars  for the easy connection."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chuck Hunt",
          "Nb_Reviews": 3,
          "Date": "2020-05-05T13:59:03.000Z",
          "Titre": "Since you have asked us to be honest…",
          "Contenu": "Since you have asked us to be honest and as a consumer, permit me to say it then. The service is good and the phone calls are for the most part cleared and diligently fast. The app is okay and easy to understand. However, I wish KeepCalling would allow its customers to keep the minutes that are not used during the month period and roll them over to the next cycle. I find it abysmally troubling that unused minutes are just deleted once the month reaches its cycle.  This to me is something that I find a bit dishonest especially because those unused minutes are ours to keep. After all, we have paid for them and we should be able to keep them regardless of the cycle's terms. Just something to consider!"
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Angeles",
          "Nb_Reviews": 1,
          "Date": "2020-07-16T17:27:15.000Z",
          "Titre": "Call ended despite having top up option when credit is $5",
          "Contenu": "Although I have set up the settings to top up when credit is at U$5, my last call ended because I had no credit. I need you to confirm that this will not happen again, because I missed the call I was having."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 7,
          "Date": "2019-10-30T11:19:12.000Z",
          "Titre": "Overall I always was very satisfied…",
          "Contenu": "Overall I always was very satisfied with \"KEEP CALLING\". However the last time I used Keep Calling I had a lot of interference, like someone else was using the same line. Plus the call was dropped twice."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "C D",
          "Nb_Reviews": 2,
          "Date": "2019-08-04T01:44:08.000Z",
          "Titre": "Connected to a different party",
          "Contenu": "There are some instances when I call the Philippines that I ended up connected to a different party despite entering the correct phone number. But most of the time the connection is quick and the line is clear."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Chris",
          "Nb_Reviews": 6,
          "Date": "2023-01-12T19:42:48.000Z",
          "Titre": "Honest fees."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James J. Kim in Portland, OR",
          "Nb_Reviews": 3,
          "Date": "2020-09-15T21:26:28.000Z",
          "Titre": "I'd give a 5 star if the call doesn't get disconnected.",
          "Contenu": "I like the rates and convenience (app), but I do not like the calls being disconnected after between 30 min and 50 min of a call.I'd give a 5 star if the call doesn't get disconnected."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "IDRIS MANNA",
          "Nb_Reviews": 1,
          "Date": "2019-11-03T07:30:22.000Z",
          "Titre": "I just purchased $10 calling credit I…",
          "Contenu": "I just purchased $10 calling credit I don’t know where it’s gone is not top up in my account it second time can you tell me what to do please come on KeepCalling I lost my $20 Australian for netting"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jackie",
          "Nb_Reviews": 5,
          "Date": "2019-08-20T17:00:57.000Z",
          "Titre": "I only give you guys a three because…",
          "Contenu": "I only give you guys a three because every time I ask you guys about a plan to Zimbabwe 🇿🇼 I get no response this is the only place I call and I have been using you guys for a while"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Amo JLR",
          "Nb_Reviews": 2,
          "Date": "2022-02-28T17:44:46.000Z",
          "Titre": "Numbers considered incorrect",
          "Contenu": "Abiut half the time the calls are deemed as 'number incorrect' so I have to keep trying at different times.  Not convenient in an emergency."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elizabeth Fiedtkou",
          "Nb_Reviews": 1,
          "Date": "2019-06-24T20:11:25.000Z",
          "Titre": "I’m giving 3 stars because the customer…",
          "Contenu": "I’m giving 3 stars because the customer service people are great.  But login In to the site sucks, being able to recharge is difficult as well. Too much to do just to get on a site...."
        },
        {
          "Note": 3,
          "Lieu": "RW",
          "Pseudo": "Michael Washington",
          "Nb_Reviews": 1,
          "Date": "2019-04-22T11:44:13.000Z",
          "Titre": "The exchange rate is outrageous",
          "Contenu": "The exchange rate is outrageous.  I do not mind the fee, but a 20% difference in exchange rate it too much.  I will try to only use this for emergencies, not as a standard practice ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carlos Rai",
          "Nb_Reviews": 3,
          "Date": "2020-10-22T21:35:13.000Z",
          "Titre": "Poor connectivity & audibility",
          "Contenu": "Network regularly disconnects and at times it’s not audible . Rather frustrating because u have to disconnect and recall. I’ve already reported this but it’s not improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "fairoz ALREFI",
          "Nb_Reviews": 7,
          "Date": "2023-03-01T14:31:05.000Z",
          "Titre": "Not like always"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amer Ebrahim",
          "Nb_Reviews": 4,
          "Date": "2021-12-10T20:50:42.000Z",
          "Titre": "You do not give credit or offer coupons…",
          "Contenu": "You do not give credit or offer coupons regularly to your valuable customers. Honestly thinking about canceling my account and find another provider"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Iftekhar",
          "Nb_Reviews": 3,
          "Date": "2019-04-19T14:14:17.000Z",
          "Titre": "my review",
          "Contenu": "calling to some destinations are way expensive. Some destinations routes are not good. Some others are fine. I am using this service for last 4 years. topping up is convenient."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Outi",
          "Nb_Reviews": 2,
          "Date": "2021-12-21T04:32:52.000Z",
          "Titre": "Tried to buy credit while on the phone",
          "Contenu": "Tried to buy credit while on the phone, but it didn't work, even after several trials. Was able to go the homepage and got the credit there."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wolf Juekoff",
          "Nb_Reviews": 1,
          "Date": "2022-08-07T02:36:11.000Z",
          "Titre": "it took several calls and lengthy phone…",
          "Contenu": "it took several calls and lengthy phone consultations before the problem was fixed but it is fixed now."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Robert Jensen",
          "Nb_Reviews": 2,
          "Date": "2019-10-23T11:30:56.000Z",
          "Titre": "I have only used keep calling and am…",
          "Contenu": "I have only used keep calling and am happy with the service, though lately I have to phone more than once to have a conversation, with the cut off more and more often"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christian",
          "Nb_Reviews": 2,
          "Date": "2019-07-25T12:48:06.000Z",
          "Titre": "Good, but not the cheapest",
          "Contenu": "Good, but not the cheapest: KeepCalling was very attractive for calling mobile phones, but prices in that area went up - making it less attractive. Quality is decent."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "EugeneP",
          "Nb_Reviews": 3,
          "Date": "2022-01-30T15:10:31.000Z",
          "Titre": "Very good rates, but not always works",
          "Contenu": "Very good rates, but not always works - for example, I couldn't make calls to Kazakhstan because of the extremely poor connection."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Choo Choo Rosenbloom",
          "Nb_Reviews": 5,
          "Date": "2019-06-16T06:13:58.000Z",
          "Titre": "Not the most reliable way to call internationally",
          "Contenu": "For whatever reason, I am always unable to connect to my sister, who lives in Australia.  It works in Malaysia but doesn't seem to work for phones in Perth, WA."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jean Lessard",
          "Nb_Reviews": 4,
          "Date": "2022-08-21T00:13:56.000Z",
          "Titre": "You keep routing me thru an Ontario…",
          "Contenu": "You keep routing me thru an Ontario number but I live in Montreal. I have to reset every time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Arthur Blackburn",
          "Nb_Reviews": 5,
          "Date": "2020-03-21T19:32:26.000Z",
          "Titre": "My call doesn't always go through to…",
          "Contenu": "My call doesn't always go through to the German phone network on the first attempt; however, service has greatly improved in comparison with Summer 2019."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stella",
          "Nb_Reviews": 1,
          "Date": "2019-11-18T04:37:32.000Z",
          "Titre": "Not bad",
          "Contenu": "I great full of having keep calling as an option to be able to call my family, but I had to call back three times since it disconnected while I was talking."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "P Tarzan",
          "Nb_Reviews": 4,
          "Date": "2022-07-18T12:10:09.000Z",
          "Titre": "My overall experience using KeepCalling…",
          "Contenu": "My overall experience using KeepCalling has been good, however, I experience occasional voice drops."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Kumar Vivek",
          "Nb_Reviews": 1,
          "Date": "2020-05-01T01:45:48.000Z",
          "Titre": "It doesn't works if cell phone is not…",
          "Contenu": "It doesn't works if cell phone is not connected to wi-fi.Many times it gets disconnected in mid of the calls and again you have to make the call."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "H K",
          "Nb_Reviews": 1,
          "Date": "2020-05-22T03:21:41.000Z",
          "Titre": "Pretty much satisfied with the service",
          "Contenu": "Pretty much satisfied with the service. However, the balance of prepaid card is not updated. Recently, the call is not stable and kept disconnected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Riaz Ahmad",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T18:11:36.000Z",
          "Titre": "Great service but …",
          "Contenu": "Great service. Reliable and satisfactory. I hope that the per minute rates for Pakistan come down to be  comparable with other destinations. Thanks KeeCalling."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hajnalka Bereczki",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T15:18:15.000Z",
          "Titre": "It is perfect except sometimes you…",
          "Contenu": "It is perfect except sometimes you interrupt me when I talk a long time and I have to redial."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Anita Stuart",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T19:13:35.000Z",
          "Titre": "Food for Thought",
          "Contenu": "I like how easy it is to add more credits and how supportive customer service is if I need anything. I did not like it when the cost of minutes for calling Barbados went from 8 cents a minute to 25 cents minute without any warning. I understand things can change due to contracts and other things but I believe customers should be warned. Otherwise I am very happy with the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ERnyc",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T13:15:51.000Z",
          "Titre": "Service is very good!",
          "Contenu": "Service is very good. Way better and easier than MyLine which I dumped for having a horrible customer service. I wish the start point for auto-recharge was $2 instead of $5 or that choice given to customers. Otherwise I am very satisfied with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adel Elraie",
          "Nb_Reviews": 6,
          "Date": "2023-12-12T05:08:07.000Z",
          "Titre": "very important",
          "Contenu": "easy navigation through the process"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John O'Dwyer",
          "Nb_Reviews": 12,
          "Date": "2023-09-07T13:21:02.000Z",
          "Titre": "A really good service and value for…",
          "Contenu": "A really good service and value for money but I have had a few technical issues like connecting to an unknown number and calls been dropped.  Let me point out this happens on a rare occasion.  Overall I am a happy customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shirley Tucker",
          "Nb_Reviews": 3,
          "Date": "2023-09-10T06:35:12.000Z",
          "Titre": "Old friend.Have been using KeepCalling since 2000",
          "Contenu": "Have been using KeepCalling since 2000! Only had one problem, but within few hours I got problem solved. Any call I need to make overseas my calls go through. Will always use KeepCalling."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dennis Cole",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T07:15:16.000Z",
          "Titre": "Easy to make payment",
          "Contenu": "Easy to make payment; not so easy to see what is paid for.Paid twice for same thing in error.Also no notifier to pay before service ends; had to make payment to use service again."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "geoff cordell",
          "Nb_Reviews": 4,
          "Date": "2023-05-17T22:19:35.000Z",
          "Titre": "buying minutes",
          "Contenu": "Although I think that Keep calling is great I do find it frustrating how difficult it is to buy more minutes.This last order took many attempts to finally be able to complete.Apart from that I think that your actual service  is second to none.RegardsGeoff Cordell"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Monika Schiller",
          "Nb_Reviews": 4,
          "Date": "2023-09-04T00:21:08.000Z",
          "Titre": "Usually works well",
          "Contenu": "Usually works well, other than sometimes I’m not able to make a call or the connection on my side is abruptly cut off on my side, they hear, I don’t hear them anymore"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abed Zantout",
          "Nb_Reviews": 4,
          "Date": "2023-04-17T13:46:31.000Z",
          "Titre": "Hearing a recording of my calls",
          "Contenu": "I like KeepCalling but some of my calls experience strange audio.During a conversation, instead of continuing to hear the other party, I start hearing a recording of the beginning of the conversation.Of course, at that point, I would no longer be connected but it takes a bit to figure out what happened.AND during this disconnection period (while I am hearing the recording of the start of the conversation), KeepCalling continues to charge me for the minutes.Now that I know that happens, I hang up as fast as I can and dial again. This happens often.Very frustrating."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Da Costa",
          "Nb_Reviews": 41,
          "Date": "2023-11-10T23:39:59.000Z",
          "Titre": "Cheap",
          "Contenu": "Cheap, most of the time variable sometimes lose connection. Not to Bad quite happy with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "REK",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T15:14:47.000Z",
          "Titre": "Easy to set up and used and generally very reliable",
          "Contenu": "The service is generally very reliable, but dropped calls do happen particularly if you're on a call for a long time. The price is good and it's easy and swift to top up the balance on an account. I would definitely recommend, and have recommended, Keep Calling to friends and family."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Qesther",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T21:42:52.000Z",
          "Titre": "Top up was fast and fee is reasonaeble. However, I can't top up from the app. Every time I need to top up I have to go to the website. So the app is not usable to me as I only use keep calling to topu",
          "Contenu": "Topup was fast and fees reasonable. However when I need to topup I have to go to the website. The app is not usable to me as I only use keep calling to topup for my family and friends, so it would be great if that adjustment is made. Otherwise I'll just Uninstall the app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Philip Schaeffer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T17:24:37.000Z",
          "Titre": "E mail site well defined only took 3…",
          "Contenu": "E mail site well defined only took 3 minutes to access site and refill my pin"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John O'Dwyer",
          "Nb_Reviews": 12,
          "Date": "2023-01-10T15:32:21.000Z",
          "Titre": "The call quality us generally very good…",
          "Contenu": "The call quality us generally very good and I'm happy with the service. The price is well below what other carriers charge. On the rare occasion I had to contact customer support they were prompt in getting back to me. I have I am a happy long-term customer."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "CHK",
          "Nb_Reviews": 3,
          "Date": "2023-03-22T16:21:04.000Z",
          "Titre": "I like this service",
          "Contenu": "I like this service however sometimes the voice is very low and the other person cannot hear well. Also, sometimes the call ends by itself. Hope this will be improved in the future.Thank you for providing this service"
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Terry Page",
          "Nb_Reviews": 2,
          "Date": "2023-04-19T11:30:08.000Z",
          "Titre": "Prices are very good but...",
          "Contenu": "Prices are very good with no real obligations to top-up regularly. However I am somewhat disappointed with the lack of SMS that was removed and which causes a problem with bank services etc."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Duane Joseph",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T09:53:01.000Z",
          "Titre": "I was able to call anywhere in the…",
          "Contenu": "I was able to call anywhere in the world mainly the Caribbean and the price per minute is worth every cent. The reception is good and clear"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Me",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T17:16:55.000Z",
          "Titre": "It was very easy to reload my account",
          "Contenu": "It was very easy to reload my account, BUT this morning 07/18/ 2023 I am unable to use Keep calling for a very important call to the UK, so I am not very happy!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Al Sobol",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T02:06:28.000Z",
          "Titre": "Reliable-Always there when you need it",
          "Contenu": "No interruption to the service- mostly good quality connection- I just wish the rates to the middle east are better."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jack Altman",
          "Nb_Reviews": 3,
          "Date": "2023-07-25T23:19:44.000Z",
          "Titre": "Great value for the money",
          "Contenu": "Great value for the money, especially international calls from Canada to foreign mobile phones.  Only criticism is the very occasional dropped call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Roman",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T19:44:46.000Z",
          "Titre": "Sometimes it does not connect the call…",
          "Contenu": "Sometimes it does not connect the call and I have to redial more than once"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Asa",
          "Nb_Reviews": 4,
          "Date": "2023-06-23T22:38:10.000Z",
          "Titre": "It is a cheep way to keep in contact…",
          "Contenu": "It is a cheep way to keep in contact with family overseas. I like how you can choose the countries that you want to call. Easy to top up your account. Clarity when you are on the line is good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adel Elraie",
          "Nb_Reviews": 6,
          "Date": "2023-05-13T09:04:18.000Z",
          "Titre": "when v",
          "Contenu": "when v. smooth, no hassle, received confirmation within a minute and credited the amount to my account immediately."
        },
        {
          "Note": 4,
          "Lieu": "DZ",
          "Pseudo": "Nadjib Labed",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T10:33:39.000Z",
          "Titre": "the application looks stable however the quality of soun need improvement a bit",
          "Contenu": "the price is afforadable and  you can make needed call per day with controled low budget"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Elfriede Venter",
          "Nb_Reviews": 3,
          "Date": "2023-04-13T10:53:06.000Z",
          "Titre": "Good service",
          "Contenu": "Because it’s affordable this way to keep contact with family and friends abroad"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fung",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T21:06:37.000Z",
          "Titre": "Great, suggest lower price",
          "Contenu": "The quality of voice is very good, except that it is a little expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Azi",
          "Nb_Reviews": 4,
          "Date": "2023-07-19T01:39:01.000Z",
          "Titre": "Clear voice connections with non to…",
          "Contenu": "Clear voice connections with non to very few call drops.One star less is for recent price hike"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "elizaveta batalova",
          "Nb_Reviews": 4,
          "Date": "2023-02-05T06:06:23.000Z",
          "Titre": "Sometimes, during international calls, voice of responder is disappear and I have to recall several times.",
          "Contenu": "I have to recall international call, last time, several times because responders don't hear me or I don't hear them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick O Connell",
          "Nb_Reviews": 3,
          "Date": "2023-02-23T19:40:04.000Z",
          "Titre": "I've been using the service for years…",
          "Contenu": "I've been using the service for years and I'm very pleased with it! Very reasonable rates thank you very much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "micky prasad",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T04:02:08.000Z",
          "Titre": "Clear call",
          "Contenu": "Clear call Fast connectionNot like phone company called rebtel"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Gibson",
          "Nb_Reviews": 7,
          "Date": "2022-10-07T20:24:57.000Z",
          "Titre": "for years I have been buying Keep…",
          "Contenu": "for years I have been buying Keep Calling for my sister who doesn’t have a credit card.  It has been a smooth ride.  When I was confused and needed help awhile back, I was able to quickly find a customer service number.  This time, I could not find it so sent an e-mail which they responded to with the 888 number for help.  Its great to have a contact number when your problem isn’t listed in the FAQ."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Hadrian-maximus Obi",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T00:29:39.000Z",
          "Titre": "Room for improvement",
          "Contenu": "I am happy with the call charges and rates. However there is still room for improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hoyt Voeun",
          "Nb_Reviews": 2,
          "Date": "2022-10-15T17:08:38.000Z",
          "Titre": "I really like it with app just straight…",
          "Contenu": "I really like it with app just straight dialing from contact list need no pin#. But has issued with voice dropped off  from other side destination doesn’t hear. Hope you’ll fix this problem in the future. 1 to 3 times dropped off per destination called."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "SHANTHIKUMAR",
          "Nb_Reviews": 7,
          "Date": "2023-02-16T23:08:19.000Z",
          "Titre": "EXCELLENT SERVICE AND VERY GOOD RATES…",
          "Contenu": "EXCELLENT SERVICE AND VERY GOOD RATES PER MINUTE"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jose Lameiro",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T20:26:44.000Z",
          "Titre": "It was no very easy to recharge my…",
          "Contenu": "It was no very easy to recharge my account.Greetings."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Leen Auperle",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T01:38:12.000Z",
          "Titre": "It is pretty straightforward and does…",
          "Contenu": "It is pretty straightforward and does not take long"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aisha",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T00:14:27.000Z",
          "Titre": "It is mostly okay.",
          "Contenu": "It is mostly okay.  Sometimes, calls don't go through!"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "CHK",
          "Nb_Reviews": 3,
          "Date": "2023-07-17T11:16:51.000Z",
          "Titre": "good rate compared to normal phone calls"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Christine Mukasia",
          "Nb_Reviews": 5,
          "Date": "2022-11-10T18:13:10.000Z",
          "Titre": "Good connection",
          "Contenu": "Good connection, without need of internet on the other side I call! It's EXTREMELY EXCELLENT!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aysha",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T22:22:02.000Z",
          "Titre": "It is very easy to use",
          "Contenu": "It is very easy to use and is set up so you don't have to constantly check your balance but it tells you how much you have each time you call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob McCluskey",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T08:29:45.000Z",
          "Titre": "The only negative issue I've…",
          "Contenu": "The only negative issue I've experienced so far is that during my monthly teleconferenced meetings that can sometimes last over 3 hours, I get cut off at about 2 1/2 hours and have to call back in to the teleconference.......this is a real inconvenience.......if KeepCalling can do something about this , I'd really appreciate it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "PAOLO CAJANO",
          "Nb_Reviews": 7,
          "Date": "2023-06-19T17:28:41.000Z",
          "Titre": "VERY CHEAP BUT NOT ALWAYS AVAILABLE"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenthou",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T02:12:25.000Z",
          "Titre": "Great app",
          "Contenu": "Great app, with good customer service"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Charles Ojaji",
          "Nb_Reviews": 2,
          "Date": "2023-02-12T08:56:32.000Z",
          "Titre": "Most calls are crisp and clear",
          "Contenu": "Most calls are crisp and clear. There have been very few times that I haven't been able to connect."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jose Lameiro",
          "Nb_Reviews": 3,
          "Date": "2022-11-02T23:46:45.000Z",
          "Titre": "Nice and easy to use",
          "Contenu": "Easy to use. And also very combinient.And that is all what Indeed.And I don't what else I can say."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Vicki Watson",
          "Nb_Reviews": 29,
          "Date": "2022-08-06T17:20:51.000Z",
          "Titre": "Usually excellent cover",
          "Contenu": "Usually excellent cover worldwide.I spend a lot of time in the UK & use the Keep Calling App to make calls to colleagues, family & friends using my Spanish mobile. Really affordable and usually great cover. Highly recommend at only €4,99 per calendar month!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 6,
          "Date": "2022-10-09T11:35:11.000Z",
          "Titre": "Works for me",
          "Contenu": "I have been using Keep calling for nearly 10 years. Happy with the product.Can’t comment about value for money but convenient way for me to call abroad."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Mohammad",
          "Nb_Reviews": 2,
          "Date": "2022-09-28T12:49:07.000Z",
          "Titre": "i want to pay with paypal on Apple…",
          "Contenu": "i want to pay with paypal on Apple devices not apple payment.and the prices for calling to afghanistan is now 26min and not 37min like before.but the app is so far okay."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Umesh",
          "Nb_Reviews": 1,
          "Date": "2022-10-02T16:00:14.000Z",
          "Titre": "Service is good",
          "Contenu": "Service is good. Interface is very clean and straight forward. I’m just upset about the recent rate hikes - rates were doubled last month and that’s a lot."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan",
          "Nb_Reviews": 4,
          "Date": "2023-03-18T14:50:15.000Z",
          "Titre": "fast service",
          "Contenu": "I feel very good  with keepcaling"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beryl King",
          "Nb_Reviews": 2,
          "Date": "2022-03-27T18:16:08.000Z",
          "Titre": "They are great",
          "Contenu": "They are great, if you call one country frequently.  For the price and ease of use , while knowing that I'll never run out of minutes or see an outrageous international phone bill.Just remember \"International calling\"  does not mean the whole wide world.  So If you have a plan for England, you're not going to be able to call France...until you get additional coverage.  Which is still reasonably priced."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VINCENT LE",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T05:34:20.000Z",
          "Titre": "Great service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eugene Zajerko",
          "Nb_Reviews": 7,
          "Date": "2023-01-11T17:53:44.000Z",
          "Titre": "fast and good contact",
          "Contenu": "fast and good contact, but expensive to call international mobile phone number"
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Clarissa Hu Andersen",
          "Nb_Reviews": 36,
          "Date": "2023-01-03T18:10:15.000Z",
          "Titre": "It is great and works well",
          "Contenu": "It is great and works well. Been a customer for over 3 years"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ibiyemi Bello",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T13:39:24.000Z",
          "Titre": "Awesome app",
          "Contenu": "Awesome app. Would have given 5 stars but lately the sounds cracks on both ends. Secondly , I registered my phone number but when I call, people sometimes tell me they see all manners of numbers popping up that they refuse to pick the call because it wasn't displaying my number.  Asides that. It's very awesome and convenient to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 2,
          "Date": "2022-06-22T18:13:19.000Z",
          "Titre": "I've come to use this app a good bit of…",
          "Contenu": "I've come to use this app a good bit of late.  I have family that is out of the country and it's one of the least expensive, and quite efficient ways of staying in touch with them. I would easily recommend use of this app."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John O'Dwyer",
          "Nb_Reviews": 12,
          "Date": "2022-01-15T14:01:46.000Z",
          "Titre": "KeepCalling is good value for money and…",
          "Contenu": "KeepCalling is good value for money and easy to use.  It does drop calls occasionally but generally it works fine.  I have tried other services and this is by far the best one for international calls.  The monthly plan is great if you make a lot of calls.  I have family in the Republic of Ireland so it is great for me.  I would highly recommend it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Vega",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T21:55:20.000Z",
          "Titre": "We normally call from USA to Chile",
          "Contenu": "We normally call from USA to Chile. I gave only 4 stars mainly because every time we place a call we get crossed lines (other people talking on the line) for several seconds before we get the phone we are calling. After this the conversation is normal; loud and clear! I hope you can correct this minor inconvenience."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Raymond Gunraj",
          "Nb_Reviews": 2,
          "Date": "2022-12-27T22:39:05.000Z",
          "Titre": "Quick and clear reception."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "SG",
          "Nb_Reviews": 16,
          "Date": "2022-09-10T23:20:55.000Z",
          "Titre": "Would give KeepCalling 5 stars if they…",
          "Contenu": "Would give KeepCalling 5 stars if they implemented a function to be able to re-order the entries in the Speed Dial list.Apart from that it is excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karin Scheiwe",
          "Nb_Reviews": 3,
          "Date": "2021-12-17T02:22:03.000Z",
          "Titre": "The wrong credit card was charged",
          "Contenu": "The wrong credit card was charged, but it was professionally and expeditiously   handled  by KeepCalling.However, there is one complaint. Every so often, we are requested to enter our PIN before making a call. To us, it is quite annoying and we believe it's completely unnecessary."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Andrej",
          "Nb_Reviews": 3,
          "Date": "2022-01-09T03:55:17.000Z",
          "Titre": "Not really and thinking for other option as demand for call will increase ...",
          "Contenu": "So far I am satisficed as  with easy service account in place just add funds on  .., but recently I have  experienced drop calls l and redialing etc  frustration... and as loyal customer had been very much  surprised with raising costs per minute and per package etc  from 1,5  to 2.3 or so per minute , Question Is that is the way to keep customer for long haul,  I know there are other options with better quality more options video texting voice msg   So my Question is BE or NOT to be moving forward  .... Will be happy New Year  with lowering costs....and maintaining customer to be more loyal ...?il"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Apache",
          "Nb_Reviews": 8,
          "Date": "2022-12-29T00:34:26.000Z",
          "Titre": "Great service although the price…",
          "Contenu": "Great service although the price fluctuates."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-03-04T06:46:09.000Z",
          "Titre": "I am happy with Keep Calling the only…",
          "Contenu": "I am happy with Keep Calling the only thing that can be annoying is that now and then it says I am off line when I am not. I just refresh and it usually comes right. It is worth it for the fabulous rates and the quality of the call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 9,
          "Date": "2021-02-07T15:06:43.000Z",
          "Titre": "I love the ease of how you could add…",
          "Contenu": "I love the ease of how you could add minutes and you can talk long distance all over the world and I really like the service is done instantly but I wish they was more minutes to the dollar.. I do appreciate the service though it is very easy and a connections are very clear although sometimes the cause do drop.... I give this a four-star rating because service is good but they need to add more minutes to the dollar cuz I believe it's not enough but I am blessed to have it I recommend it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sonja Brumfield",
          "Nb_Reviews": 3,
          "Date": "2020-10-22T01:44:20.000Z",
          "Titre": "I recently signed up with Keep calling",
          "Contenu": "I recently signed up with Keep calling. I've been looking into International calling, however, there isn't much available. This service works great, unless u leave in the mountains. I have a bad connection even when my neighbor's call me. Therefore, I call my family when am in town and it works great and I like the price."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Achim",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T08:54:05.000Z",
          "Titre": "Good service and decent rates.",
          "Contenu": "Good service and decent rates.Need to emphasise though that I always use their landline call service from my landline or mobile, their VoIP service was below par last time I tried it and simply not good enough for regular use, hence only four stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derek McGowan",
          "Nb_Reviews": 6,
          "Date": "2022-09-07T16:02:45.000Z",
          "Titre": "Sometimes the lines to the UK get voice…",
          "Contenu": "Sometimes the lines to the UK get voice breaks in the service but generally I would give KeepCalling.com, 4 stars for its overall service."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Amit Lapasia",
          "Nb_Reviews": 2,
          "Date": "2021-04-29T05:52:28.000Z",
          "Titre": "Lowest International Call Rates & Superior Voice Quality...",
          "Contenu": "Great calling app for international numbers. 4 star for lowest pricing I have seen anywhere. Not giving 5, only because even if the call is failed, many times it does gets charged, leaving user to track record those call details manually and later ask for reimbursement. Rest all seems ok."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jean_Claude JACQUIN",
          "Nb_Reviews": 6,
          "Date": "2022-01-03T19:50:02.000Z",
          "Titre": "Replenishment of my account was slow to…",
          "Contenu": "Replenishment of my account was slow to sgow in \"my balance\" and I hesitated to make urgent call I then needed. WHY can't it show up immediately? Quality of communication was not bad on loudspeaker so this is positive."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Thea Pawlikowska",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T17:29:29.000Z",
          "Titre": "Early cut off",
          "Contenu": "My only complaint was a recent non availability of access (ie I dialled the number in Europe as have done for weeks but Keep Calling  just went dead. I  recharged and discovered I still had  'juice\" left in my account. Why cut off when  it was no that near 'empty\"Thea"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WOLDEHAWARIAT/ABIY TESFAYE",
          "Nb_Reviews": 3,
          "Date": "2023-07-01T13:35:16.000Z",
          "Titre": "Good service ."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Taiwo E",
          "Nb_Reviews": 1,
          "Date": "2021-10-30T15:27:21.000Z",
          "Titre": "I would have given 5/5 but sometimes…",
          "Contenu": "I would have given 5/5 but sometimes the app claims that I am offline with no internet connection even when there is. Therefore, I have to troubleshoot by closing the app and turning off my internet, then turning it on again to retry."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2021-07-04T17:19:13.000Z",
          "Titre": "Great phone carrier!",
          "Contenu": "I have used Boss Revolution for all overseas calls but because of their drastic rates increase I chose KeepCalling.com. I hope KeepCalling.com won't disappoint me like my former phone carrier. Keep up the good work KeepCalling.com. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "CIn Louis",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T14:36:05.000Z",
          "Titre": "Price and voice are good",
          "Contenu": "I use this app to call back home,price and voice are nice and clear,but if I on phone little bit longer,I got suddenly disconnected several times right away I dial the same number and it connected to  a Filipinos speaking phone. It happened several times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria T",
          "Nb_Reviews": 4,
          "Date": "2021-09-13T17:31:17.000Z",
          "Titre": "Good service",
          "Contenu": "Calls quality is good, rates are good, and it is very convenient that I can make phone calls by pressing only two buttons: one to accses your server, then one dedicated to the person that I intend to call. That's fantastic!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kevin Wyllie",
          "Nb_Reviews": 1,
          "Date": "2021-11-14T06:03:49.000Z",
          "Titre": "Have used it for years to call back…",
          "Contenu": "Have used it for years to call back home to Canada from Australia. Very cost effective,  only had some issues at the very beginning but helpful staff helped & have had no issues since.Cheers KevinNsw Australia"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "charles mixter",
          "Nb_Reviews": 2,
          "Date": "2021-12-17T12:33:52.000Z",
          "Titre": "A very good program which is quìte easy…",
          "Contenu": "A very good program which is quìte easy to use. It sometimes cuts cuts out and drop a call or call or noise appears on the line. It has constantly improved over the years. The cost of calls is reasonable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 2,
          "Date": "2021-11-11T17:31:38.000Z",
          "Titre": "My wife uses this service regularly to…",
          "Contenu": "My wife uses this service regularly to Mexico. The only drawback is sometimes she has to call several of the local access numbers to find one that will work for her on that day and time. This can be confusing."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "surinder paul",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T22:12:15.000Z",
          "Titre": "never had any problem",
          "Contenu": "i will rate this five star service"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Marie Krykorka",
          "Nb_Reviews": 3,
          "Date": "2022-05-26T16:53:50.000Z",
          "Titre": "Pretty good",
          "Contenu": "Pretty good, only from time to time the system kicks me out in the middle of a call ( connection lost, the voice saying ènter the number you want to call`...again)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kinfe gebeyehu",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T06:33:59.000Z",
          "Titre": "Tried to add to a dwindling bill",
          "Contenu": "Tried to add to a dwindling bill. It went on fine after a few steps. I thought it would have been easier to click on the remaining amount and add to it rigt there and then"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Diana Teodorescu",
          "Nb_Reviews": 5,
          "Date": "2021-08-22T11:36:37.000Z",
          "Titre": "App works well",
          "Contenu": "App works well, accesses contacts easily, has favorits lists, easy to add money with credit cards or Paypal. Very affordable, call quality varries, from very clear to hard to hear, need to call again sometimes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GINO",
          "Nb_Reviews": 12,
          "Date": "2022-03-25T05:42:10.000Z",
          "Titre": "CALLS TO PERU CELLS DON'T GO.",
          "Contenu": "Once in a while the line drops in long calls.Also occasionally, calls don't go through.Main and a real negative: calls to cell numbers in Peru don't go through anymore."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Monika Schiller",
          "Nb_Reviews": 4,
          "Date": "2022-08-06T05:26:27.000Z",
          "Titre": "Mostly works well",
          "Contenu": "Mostly works well, sometimes I loose calls, they can still hear me, I can’t.Also, sometimes I can’t make any calls for a while at all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ni An",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T19:14:14.000Z",
          "Titre": "Voice very clear except sometimes if…",
          "Contenu": "Voice very clear except sometimes if not good weather such as heavy rain. First time I used this app it off every 5 mins but now signal very good I can call without stopping signal at least 30 mins."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ivica Taras",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T09:42:53.000Z",
          "Titre": "good service",
          "Contenu": "happy with service"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Roger",
          "Nb_Reviews": 6,
          "Date": "2020-12-02T17:44:54.000Z",
          "Titre": "Great cost/benefit",
          "Contenu": "Although I have problems occasionally, given the number of calls I make, I would say it works pretty well. And the cost/benefit is fantastic!Have been using them for years and would easily recommend their service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Riaz Ahmad",
          "Nb_Reviews": 2,
          "Date": "2022-03-20T20:50:27.000Z",
          "Titre": "Per minute rates for international calls                 I am COMPLETELY satisfied with the…",
          "Contenu": "I am COMPLETELY satisfied with the quality of connectivity and top class service. However, the rate for calls to Pakistan is higher than the market and my expectations."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Powell",
          "Nb_Reviews": 5,
          "Date": "2021-06-11T09:45:14.000Z",
          "Titre": "A very  good service",
          "Contenu": "A very  good service.  It works well. I like the way I can receive  calls from home and the caller pays only local  UK rates.  Also I can call home cheaply.  I love this service.  Thank you 😊"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John O'Dwyer",
          "Nb_Reviews": 12,
          "Date": "2021-05-20T11:16:54.000Z",
          "Titre": "Amazing value for money",
          "Contenu": "Amazing value for money, good sound quality.  It does drop calls occasionally but it is rare.  Would I recommend it?  Yes, definally.  It is the best value international phone service I have found."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alfonso Castillo",
          "Nb_Reviews": 3,
          "Date": "2022-05-07T17:37:26.000Z",
          "Titre": "Voice calling is excellent but SMS",
          "Contenu": "Voice calling is excellent but SMS, text messages is not. But to me it is good enough as long as I can talk directly to my loved ones. The cost is fair."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John O'Dwyer",
          "Nb_Reviews": 12,
          "Date": "2021-09-17T15:05:04.000Z",
          "Titre": "It is good value for money",
          "Contenu": "It is good value for money.  Occasionally they are dropped calls but overall I have happy with the service.  I would highly recommend it to anyone who calls abroad on a regular basis."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 3,
          "Date": "2022-08-13T19:30:44.000Z",
          "Titre": "Reliable and dependable",
          "Contenu": "At time telephone calls are dropped and ones loose communication with others. However for the most part is very reliable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Olson",
          "Nb_Reviews": 1,
          "Date": "2022-06-12T01:26:44.000Z",
          "Titre": "Calls occasionally terminate without…",
          "Contenu": "Calls occasionally terminate without reason. I have to accept T & C to comply with your request to leave a review. How interested are you?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Isaac Achobe",
          "Nb_Reviews": 5,
          "Date": "2023-11-14T03:57:12.000Z",
          "Titre": "EXCELLENT for International Calls"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Spin",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T22:36:48.000Z",
          "Titre": "overall a great service and experience",
          "Contenu": "overall a great service and experience.  it is the occasional disconnects and audio quality that prevent me from rating 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Coumanan PEROUMAL",
          "Nb_Reviews": 2,
          "Date": "2022-07-11T18:00:36.000Z",
          "Titre": "Excellent software and service",
          "Contenu": "Excellent software and service!  Alerting mails or reminders when balance falls below predefined value would be more appreciable."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Karolyn",
          "Nb_Reviews": 10,
          "Date": "2023-12-18T21:57:59.000Z",
          "Titre": "It’s so easy and great value",
          "Contenu": "Once you’re set up it’s very easy to add credit and it’s incredibly cheap to phone home when you’re traveling"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "chi ng",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:14:05.000Z",
          "Titre": "Easy transaction.",
          "Contenu": "Easy transaction. Always fast and reliable service. We been long time customers. I think more than 10 years. Thanks Merry X'mas and Happy New year for the company Keep calling.com"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Afeworki Kidane",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T05:04:26.000Z",
          "Titre": "convienent to call abroad",
          "Contenu": "easy to puchase on line but most important very easy direct as if i in US calling line acess when i call over seas my parents and relatives.i had another company before that, i had hard time every time i call, customer service terrible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yisroel. Elias",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T04:32:17.000Z",
          "Titre": "great calling card",
          "Contenu": "I loved how you could make pinless entry from my phone and have speed dial to call my favorite international numbers"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Thomas MOLNARD",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T03:07:07.000Z",
          "Titre": "Nice keepcalling",
          "Contenu": "Nice keepcalling, one constructive observation: I am in Almerimar, S/E Spain, between Malaga and Almeria. I kept calling number from previous years, and I can call it. From some reason this number, 951 254 267, vanished from the internet keepcalling documentation. Is this deliberate or an accident? You may lose customers! Keepcalling renders a great service to many people, bravo, we must understand and even like each other, whichever our country."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natallia Andreyeva",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T11:45:05.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. Money appears on your account right away, you can track everything, high quality of calls. No scams, no cheating that I had with my previous provider.  I am very happy that I had switched to KeepCalling. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lydia Chowa",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T20:23:38.000Z",
          "Titre": "The card is so easy to use and lasts a…",
          "Contenu": "The card is so easy to use and lasts a long time. I love it. When I contacted customer service with questions, they were very helpful. No rude customer service. They were very professional."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Leslie Dixon",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T04:22:29.000Z",
          "Titre": "Easy to make a call and re-charge…",
          "Contenu": "Easy to make a call and re-charge account. Has been reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike James",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T22:50:29.000Z",
          "Titre": "Keep calling is helping me connect with family in the UK",
          "Contenu": "Keep calling is helping me connect with family in the UK who do not have smart phones, only landlines. I can call anyone on any phone, cell or landline for little cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "E. Taylor Ambrose",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T21:08:34.000Z",
          "Titre": "Great Service",
          "Contenu": "All my communications through this service are Great.  The price also, have actually gone down.  Which is another good thing."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jean Lessard",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T05:31:30.000Z",
          "Titre": "Simple is the word.",
          "Contenu": "Easy, fast and efficient to do a voice credit. The extra $3 is a bonus."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jerome Logassi",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T15:01:58.000Z",
          "Titre": "Easy to call and handle",
          "Contenu": "Easy to call and handle Good price and no reloading or expiration"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T16:34:41.000Z",
          "Titre": "Easy calling method",
          "Contenu": "Easy calling method, very clear talk and very friendly method of use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natalia Dimitrova",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:30:02.000Z",
          "Titre": "Great service.",
          "Contenu": "I’m happy of using  Keep Calling, never had issue to connect with international call ."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Albert Day",
          "Nb_Reviews": 18,
          "Date": "2023-11-20T13:26:41.000Z",
          "Titre": "with some apprehension I engaged keep Calling",
          "Contenu": "So with some apprehension I engaged KC to make TP calls mainly to Ireland .. after my last company folded and took my funds with it ...Dial 123 ... I need not have been worried .... I have been totally impressed with KC.Ease of calls , clarity , and very reasonable cash I say too. I would recommend anybody to try them ... the service quality is the same either from mobile or landline .. BRILLIANT."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Olga J.",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T03:42:52.000Z",
          "Titre": "Great calling service",
          "Contenu": "Great calling service! The rates are quite good, I have been using it for a few months now, and the connection has consistently been reliable and high quality. The website is easy to navigate too, it's simple and fast to recharge your card."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Elizabeth Rulka",
          "Nb_Reviews": 4,
          "Date": "2023-11-28T22:27:10.000Z",
          "Titre": "By far The best rates",
          "Contenu": "By far The best rates. Love  the quick connection easy to use site automatic top up. Clear communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Laue",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T14:52:53.000Z",
          "Titre": "Great economial calling app that let's…",
          "Contenu": "Great economial calling app that let's you make calls all over the world."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jayson Trews",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T06:52:08.000Z",
          "Titre": "cheep rates and easy monthly auto refill"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Park",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T05:34:25.000Z",
          "Titre": "I have uesd it for 7 years",
          "Contenu": "I have uesd it for 7 years. It is good quality connection and very cheap"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara McEnery",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T07:48:59.000Z",
          "Titre": "Almost instantaneous service",
          "Contenu": "Almost instantaneous service. I paid and within minutes I had my minutes added to my account. Very easy site to follow. Have been using KeepCalling for years. Very appreciated."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "steven spencer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T21:55:13.000Z",
          "Titre": "So far everything has been perfect",
          "Contenu": "So far everything has been perfect. Ordering is easy and fast. Phone connections have been great. I have no complaints with the service. I wish all my purchases were this easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margarethe Kircher",
          "Nb_Reviews": 7,
          "Date": "2023-12-14T04:09:04.000Z",
          "Titre": "Easy order and excellent service and…",
          "Contenu": "Easy order and excellent service and price."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mr. Ahmad Caliph",
          "Nb_Reviews": 9,
          "Date": "2023-11-14T17:28:54.000Z",
          "Titre": "Affordable Easy Reliable Service",
          "Contenu": "Easy to order credit.I am in complete control of the transaction. I get an invoice immediately. I get my phone credit immediately. I have been a customer since 2015. It's great."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Martin Moran",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T20:07:13.000Z",
          "Titre": "My recent calls to Ireland and Europe from the UK…",
          "Contenu": "My recent calls to Ireland and Europe from the UK have been very clear with very little interference,I highly recommend \"Keep Calling,\"for a very competiive   telefone service.         Martin in UK."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Scott and Tina Martin",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T20:16:38.000Z",
          "Titre": "This service is incredible",
          "Contenu": "This service is incredible! Very useful to call the US from the UK. Voice quality is good and overall dependable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Sweetman",
          "Nb_Reviews": 3,
          "Date": "2023-09-22T12:38:19.000Z",
          "Titre": "I make several calls per week to the…",
          "Contenu": "I make several calls per week to the UK. When my old carrier went really pricey per minute I looked for an alternative.I came across KeepCalling by a Google search and was sceptical concerning the very low cast per month.My scepticism soon disappeared and I now love the service. The reception is clear and reliable.From my own situation I highly recommend this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ireen Nisha",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T00:42:10.000Z",
          "Titre": "Good service",
          "Contenu": "Easy in connection with family"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Shahid Raza",
          "Nb_Reviews": 5,
          "Date": "2023-11-08T03:00:27.000Z",
          "Titre": "Have never dad any issue using…",
          "Contenu": "Have never dad any issue using KeepCalling.com, ever. What more can I say, the system is absolutely wonderful. Raza"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Georgina Pierce",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T17:42:02.000Z",
          "Titre": "Keep Calling makes it possible to keep in touch with my friends and family worldwide.",
          "Contenu": "I wouldn't be able to keep in touch with all my friends and family in other countries if it weren't for Keep Calling. This is a fantastic service that makes calling affordable for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MIHAELA STEFAN",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:02:57.000Z",
          "Titre": "Cheap and reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mirsad Celic",
          "Nb_Reviews": 4,
          "Date": "2023-12-02T16:51:38.000Z",
          "Titre": "Great service",
          "Contenu": "Great service , good connection every time , no hidden fees"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Heather Knobel",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T12:46:09.000Z",
          "Titre": "Great call with no static",
          "Contenu": "Great call with no static.  Everybody should have a Keep Calling connection."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Maluma",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T07:03:45.000Z",
          "Titre": "Worthy of a Ding Dong!",
          "Contenu": "Easy to navigate through the website to buy phone credit, and the calls from Australia to Austria and rest of Europe are very affordable.Still not 'almost' for free, but at least affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chrispy",
          "Nb_Reviews": 7,
          "Date": "2023-10-20T12:46:31.000Z",
          "Titre": "Unwavering perfection!",
          "Contenu": "Easy, affordable, unwavering, THEY'RE PERFECT IN EVERY WAY IN THESE MOST DIFFICULT TIMES!!!  Always a great phone connection to my loved ones."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "GAYE",
          "Nb_Reviews": 6,
          "Date": "2023-09-03T09:11:56.000Z",
          "Titre": "excellent service",
          "Contenu": "excellent service, the reception is not always good in some countries but all in all it is so reasonable and worth it! If I experience dropped calls, bad reception I simply Keep Calling :) I don’t think there is a cheaper calling card - no matter where I travel!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Timothy",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T09:08:34.000Z",
          "Titre": "I'm always happy that I can use my…",
          "Contenu": "I'm always happy that I can use my local phone number to make calls from abroad"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOANNE WHITTLE",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T00:31:31.000Z",
          "Titre": "EASY & AFFORDABLE",
          "Contenu": "Super easy system to use, pay online, keep track of my account etc. International calls are affordable and excellent clear lines. Money deposited has no \"sell by date\". I top up the account whenever I need to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek McGowan",
          "Nb_Reviews": 6,
          "Date": "2023-09-02T22:32:22.000Z",
          "Titre": "A good reliable company and service!",
          "Contenu": "The company and the service they provide is very reliable and cost effective.  We call overseas everyday without any of the problems we encountered with other providers.  The real test will be phoning around the holidays."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Wm Morin",
          "Nb_Reviews": 14,
          "Date": "2023-08-29T15:25:57.000Z",
          "Titre": "GREAT SAVINGS",
          "Contenu": "Great company and fantastic phone call availability for the world. Low cost which makes it affordable for everyoneHave used this app for over 4 years and have saved hundreds of dollars on phone call to around the worldHighly recommended"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mehdi",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T14:29:52.000Z",
          "Titre": "EXTEREMLY RECOMMENDED",
          "Contenu": "More confident, secure and unbelievable speed in dialing & connection. I love it and will keep it forever. Thanks a lot KEEP CALLING!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BRIAN HEWSON",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T14:53:10.000Z",
          "Titre": "My experiences have always been great",
          "Contenu": "My experiences have always been great.  The line is clear, my calls to England sound like they're next door.I will \"Keep Calling\", thanks for a great service at a very reasonable rate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosemarie Singer",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T03:39:18.000Z",
          "Titre": "I have never experienced any problem…",
          "Contenu": "I have never experienced any problem using Keepcalling. My only wish is you had more local access numbers, i.e. in my local calling area, sp I woudn't have to use the 800 number and pay 3 cents/minute"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 29,
          "Date": "2023-11-01T19:09:23.000Z",
          "Titre": "Easy top up with 10% bonus!",
          "Contenu": "Easy top up with 10% bonus!Currently using the service in South Africa - It's saving a fortune on calls back to the UK"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jianping guan",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T18:20:16.000Z",
          "Titre": "it is a good price for calling China",
          "Contenu": "it is a good price for calling China, and it is much more convenient than using the ***cards to call. The quality of voice has improved since I sent a message to customer service. In a word, I am satisfied."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "aarif Diwan",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T01:02:13.000Z",
          "Titre": "Rate and call quality is great for long…",
          "Contenu": "Rate and call quality is great for long distance calls"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carter Mahrdt",
          "Nb_Reviews": 7,
          "Date": "2023-08-31T17:15:47.000Z",
          "Titre": "For the price KeepCalling can't be…The Price Can't be Beat!",
          "Contenu": "For the price KeepCalling can't be beat! Since the year I've been with them I've only had one occasion where I couldn't make a call. Otherwise I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Madhumita Tarafdar",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T11:46:03.000Z",
          "Titre": "Excellent service",
          "Contenu": "I've been using this service for a long time.The calls are very clear, no hiccups in between, the connection is always stable, calls don't drop in between and is very affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eugen Holzknecht",
          "Nb_Reviews": 7,
          "Date": "2023-09-12T14:49:14.000Z",
          "Titre": "I have been using KeepCalling for 5…",
          "Contenu": "I have been using KeepCalling for 5 years. Throughout this time period it worked great with zero problems. And all this to a very affordable price. I am really glad to have found KeepCalling."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sura Crutch Sevastopoulos",
          "Nb_Reviews": 4,
          "Date": "2023-11-20T22:42:29.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Reliable. Any issues are quickly resolved."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jaspal kaur Bangar",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T05:08:52.000Z",
          "Titre": "Quick And easy to reach to near and dears",
          "Contenu": "Good quality and very quick to reach and cheaper"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rowan White",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T00:26:34.000Z",
          "Titre": "The best value out there without any…",
          "Contenu": "The best value out there without any doubt.  Thank you for the quick response to my question about recharging my account.  Excellent service."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Paula Gallinaro",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T02:57:55.000Z",
          "Titre": "Value for money",
          "Contenu": "I have to contact my elderly mother in Italy and so far KeepCalling is the best service in terms of quality and value. I would reccomend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T22:05:33.000Z",
          "Titre": "Good Value, Excellent service",
          "Contenu": "So easy to use, and an excellent value.  A fraction of the price the major carriers charge for International calls."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Vasilis",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T20:15:47.000Z",
          "Titre": "Good reception",
          "Contenu": "Very good prices, good service & reception android app needs to be improved compared to Apple app"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "sukhbir .s. sandhu",
          "Nb_Reviews": 13,
          "Date": "2023-12-12T15:51:30.000Z",
          "Titre": "Very good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ivan kosta",
          "Nb_Reviews": 16,
          "Date": "2023-11-22T07:05:15.000Z",
          "Titre": "Superior quality and the best value for…",
          "Contenu": "Superior quality and the best value for money In simple words ... the best"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mehari Misgina",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T22:57:51.000Z",
          "Titre": "100% excellent keep calling card for…",
          "Contenu": "100% excellent keep calling card for family member and friends too! No any problem to call family members"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Lynne McKeown",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T14:06:28.000Z",
          "Titre": "Connection",
          "Contenu": "ConnectionNever have any problems getting connected and the line is clear."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Skye MacKenzie",
          "Nb_Reviews": 5,
          "Date": "2023-11-21T13:31:56.000Z",
          "Titre": "KeepCallings international rates allows…",
          "Contenu": "KeepCallings international rates allows me to stay in contact with family and friends anytyme I want!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "TSAALBI",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T09:47:00.000Z",
          "Titre": "Application au top malgré que je n…",
          "Contenu": "Application au top malgré que je n arrive pas à le traduire en Français."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Le Po",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T05:52:41.000Z",
          "Titre": "Now calls are not dropped anymore",
          "Contenu": "Now calls are not dropped anymore, yay! Prices are good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Klepp",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T01:11:33.000Z",
          "Titre": "Keep using KeepCalling.com",
          "Contenu": "The online purchase process is smooth and easy. The price is right. And ... KeepCalling just flat out works. What else would one want?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Xao Her",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T18:49:41.000Z",
          "Titre": "It’s very helpful for me to contact…",
          "Contenu": "It’s very helpful for me to contact family in other country by phone number without internet or Facebook."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michel",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T16:18:24.000Z",
          "Titre": "Great User Experience",
          "Contenu": "Good reliable connection. Easy to navigate through the menu and the website. Very affordable."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Victor Mensah",
          "Nb_Reviews": 14,
          "Date": "2023-10-23T11:58:43.000Z",
          "Titre": "Great price for USA & Canada calling…",
          "Contenu": "Great price for USA & Canada calling package . Line quality has always been good !!Keep up the  good work."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sudaniah",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T21:41:03.000Z",
          "Titre": "Excellent services with good price",
          "Contenu": "Excellent services with good price, honest, fast and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Harvey",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T21:38:42.000Z",
          "Titre": "Keep Calling is easy and reliable 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maura Stroia",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T19:51:25.000Z",
          "Titre": "A very useful service",
          "Contenu": "Not expansive, always updated and quick response for everything"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Elizabeth Rulka",
          "Nb_Reviews": 4,
          "Date": "2023-08-30T22:06:04.000Z",
          "Titre": "Fantastic experience!",
          "Contenu": "The quick dial, the auto-recharge option so the call is never disconnected. And above all the PRICE! Unmatched!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kerstin Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T21:52:48.000Z",
          "Titre": "Talking to my family…",
          "Contenu": "I call home to Sweden and I love talking to my family without worrying about running out of time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathir Sara",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T20:38:34.000Z",
          "Titre": "Low Cost",
          "Contenu": "At a time of rampant inflation, Keep Calling has maintained the same low rates for years.Clear sound and easy to use."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Rajwinder Kaur",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T21:14:09.000Z",
          "Titre": "Good service",
          "Contenu": "This service is very good and fast, I don’t have problem at all.thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wilma Prausa",
          "Nb_Reviews": 3,
          "Date": "2023-09-11T10:53:38.000Z",
          "Titre": "I  Like  The  Keep Calling  They  Don’t…",
          "Contenu": "I  Like  The  Keep Calling  They  Don’t Expired  The  Balance. I Used Maybe  2x  A  MonthTo  Call  In  The  Philippines"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick O Connell",
          "Nb_Reviews": 3,
          "Date": "2023-11-27T15:54:31.000Z",
          "Titre": "Very affordable,and easy to use.",
          "Contenu": "Very affordable, easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hala",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T19:59:34.000Z",
          "Titre": "Easy to buy credit",
          "Contenu": "Easy to buy credit . Purchase should  be done on the website for sure. Quality of calls is good ( often cuts after around 5 min). Prices are good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ileana Conejo",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T17:49:14.000Z",
          "Titre": "This is the best provider ever!",
          "Contenu": "This is the best provider ever!. I have been using this type of phone cards more than 20 years ago and nothing beats this Keep Calling!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dave",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T17:55:18.000Z",
          "Titre": "very satisfied"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justina Kingsberry",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T00:17:43.000Z",
          "Titre": "Great App",
          "Contenu": "Great App Mobile credit delivered in minutes"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jose Lameiro",
          "Nb_Reviews": 3,
          "Date": "2023-10-01T23:06:30.000Z",
          "Titre": "All the possibilities to pay",
          "Contenu": "Should, provide all possibilities to pay when you want to buy time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guido Valverde",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T12:29:59.000Z",
          "Titre": "good service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Marcia",
          "Nb_Reviews": 4,
          "Date": "2023-08-31T22:57:43.000Z",
          "Titre": "Always a clear call",
          "Contenu": "Always a clear call. I have no complaints totally satisfied, thank you keep calling. 9"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "beshaw feleke",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T21:15:04.000Z",
          "Titre": "I do not have any issue",
          "Contenu": "I do not have any issue. Great job ! great service all the time"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Alicia Burt",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T03:12:26.000Z",
          "Titre": "That they can get value for money, that now is very important",
          "Contenu": "I have been a very happy customer for over 6 years, and I can say the service is tops for me, would not change it. Thanks for doing a great job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brigitte Archuleta",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T15:24:06.000Z",
          "Titre": "Great company !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T15:23:24.000Z",
          "Titre": "It is a dependable telecom line."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Roy Edwards",
          "Nb_Reviews": 9,
          "Date": "2023-09-30T17:44:08.000Z",
          "Titre": "Highly recommend",
          "Contenu": "I have used Keep Calling for years.  It is very easy to use and @ 1p a minute to the USA, very inexpensive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Swaminathan Sambandham",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T22:33:14.000Z",
          "Titre": "Easy-to-use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leon Newton",
          "Nb_Reviews": 3,
          "Date": "2023-10-14T17:26:31.000Z",
          "Titre": "ITS RELIABLE AND FAIR PRICED AND NO…",
          "Contenu": "ITS RELIABLE AND FAIR PRICED AND NO INCREASES IN PRICES"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Uwe Buehrle",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T02:15:43.000Z",
          "Titre": "No Problems",
          "Contenu": "No Problems , everything works smooth, that is the most important thing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esteban Medina",
          "Nb_Reviews": 4,
          "Date": "2023-09-20T04:32:51.000Z",
          "Titre": "I can talk pretty well and has a good…",
          "Contenu": "I can talk pretty well and has a good price 👍. Definitely  Recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucila Tavarez",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T21:26:22.000Z",
          "Titre": "I love this application for…",
          "Contenu": "I love this application for international calls.Fast!Clear!Like home"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nico Manasoiu",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T22:31:38.000Z",
          "Titre": "Best monthly plan",
          "Contenu": "Best monthly plan, excellent connection and  sound quality very good, never disappointed."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Gilles Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T22:35:26.000Z",
          "Titre": "It is always working well does not use…",
          "Contenu": "It is always working well does not use your data and it is really cheap!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "I N",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T23:31:23.000Z",
          "Titre": "Simple to use",
          "Contenu": "Simple to use. Saves me a lot of money. Easy automatic refill."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry S Peebles",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T04:28:15.000Z",
          "Titre": "Great service",
          "Contenu": "It was very easy to make a call and the voice quality was excellent."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bluenoser",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T04:58:47.000Z",
          "Titre": "Easy",
          "Contenu": "Easy.  Clear costs available. Buying process went well."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "ziga dorkic",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T12:53:33.000Z",
          "Titre": "great great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arlette Matthys",
          "Nb_Reviews": 11,
          "Date": "2023-09-18T17:21:04.000Z",
          "Titre": "I give it a A PLUS",
          "Contenu": "I give it a A PLUS EASY ,VERY AFFORDABLE .COULDN'T BE BETTER"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alice",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T23:07:29.000Z",
          "Titre": "Great service for international calls.",
          "Contenu": "Great service for calling internationally. It works and I can definitely recommend this company."
        }
      ]
    }
  ]
}