{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "keyauth.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T01:44:03.000Z",
          "Titre": "they are all kids scammer",
          "Contenu": "just a trash service i lost my money they scammed me 80$ all the staff it i skids trash do not trust."
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T19:43:42.000Z",
          "Titre": "Always Asking For Login",
          "Contenu": "Always Asking For Login, Verify Location, even i turn it off"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex P",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T02:27:33.000Z",
          "Titre": "Good product",
          "Contenu": "Good product, Cashapp took long time to come through causing my plan to take a week to go through."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Kian Mitchell",
          "Nb_Reviews": 3,
          "Date": "2023-10-13T16:36:09.000Z",
          "Titre": "lots of but but pretty good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T23:33:56.000Z",
          "Titre": "Not alot of protection but overall easy…",
          "Contenu": "Not alot of protection but overall easy to add and use"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "DarkLunny",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T17:48:38.000Z",
          "Titre": "Keyauth on top",
          "Contenu": "One of the best auths I've used good support the uptime is good and if it goes down they comp time they have good examples I would recommend buying keyauth"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T00:35:13.000Z",
          "Titre": "4 stars maybe"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Legend Modz",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T12:35:55.000Z",
          "Titre": "I was considering another service..",
          "Contenu": "I originally was going to use another authentication method for my applications until I came across KeyAuth, I believe I had already seen it before as I had a login already and at the time I don’t think I needed an authentication so I simply forgot about it. Well not anymore, the service comes with 3 total plans; tester, developer, and seller, the first thing I’d like to mention is that the tester plan is completely free with detailed documentation on how to implement KeyAuth into a wide range of different programming languages like C#, C++, Javascript, Python, and a lot more. Typically what sets apart authentication methods for me is for one, the security it provides for me and my users and two, does the service seem to have a structured place of giving information to new users, for me it is their Discord server as I use Discord the most so them having one that looks great and is not all over the place is very good, on top of that they have support bots within the server which you can direct message and it’s pretty much a ticket system, this is incredibly helpful because being able to reach out if you encounter any issues is such a great thing to provide so props for that. Saying that, Discord is not their only means of community in fact they also have a Telegram, their own forums which people can and have posted a wide variety of helpful information. The fact that I haven’t even talked about the prices they ask for on their developer and seller plan speaks volumes about the detail they provide in their service, the developer plan comes in at $10 USD with a wide range of different positives that aren’t on the tester plan such as unlimited logs, unlimited files, a we hook system to hide your webhook url calls from bad actors, their file system as it allows to download files securely and if you want to hide sensitive information or code you don’t want the user to see then you can simple load it into memory which, even though it is not within the scope of their service, they provide links to stackoverflow info how this is exactly done. As such the developer plan is leagues better than the free tester plan, which typically is the case but the interesting plan is their Seller Plan which is double the money but you also gain all developer features with an increase of 25MB of file storage and gain access to their Seller API and access to use a Discord bot with their system to generate tokens and whatnot.All-in-all, I will definitely be using this service for all of my authentication needs as it just far exceeds the competition and I know that there are other alternatives that may even but better but to that I just must say that KeyAuth’s detailed step-by-step allows literally anyone to securely provide safe and secure authentication to their users, whatever use-case it may be which is far more support than you may get from other services and any errors or issues I had with implementing it into my own program, their support is ready to help which is quite refreshing as it typically takes a while to get responses most of the time.Another point to add that I forgot, KeyAuth is completely open-sourced meaning practically anyone can view the code and or improve upon it. This means that there are a multitude of people thy can view and inspect the code they are trusting their users with and can go a long way, especially for me, in making someone purchase.Discord: Legend Modz#1337 or thatladlegend with their new username system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "notaps",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T03:45:03.000Z",
          "Titre": "kinda funky but good"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Valorant God",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:27:28.000Z",
          "Titre": "It is just good",
          "Contenu": "It is just good, It is the best had an subscribtion but cant pay anymore but now i got it back really good i also tell the pp what i use for it."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "_alex_",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T19:15:40.000Z",
          "Titre": "Been using keyauth for over 2 years and…",
          "Contenu": "Been using keyauth for over 2 years and can say am glad that I switched from my previous auth system (auth.gg = bad). And having the option to have a self hosted version of it is even more amazing being able to add own functions etc. And in fact that its open source even another + so what ya waiting for drop the bad auth you using right now and join us on KeyAuth.my discord: Rakia#1337"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Virtue",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T17:08:59.000Z",
          "Titre": "Great Software, Highly Recommend!",
          "Contenu": "Bought seller plan in January and never had any issues, its an amazing and easy solution for licensing paid software. There are examples of how to implement it into your own software in many languages and the software is well documented with a friendly staff team so its easy to get started. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "MJ MODZZ",
          "Nb_Reviews": 2,
          "Date": "2023-04-09T16:24:17.000Z",
          "Titre": "KeyAuth Seller Plan - Best decisions you can hit",
          "Contenu": "I have bought KeyAuth seller Plan. Was one of my best decisions, Keyauth has many options and you can do everything with it, devs are also constantly updating the auth, adding New stuff and improving it. There are people who think keyauth is unprofessional because its easy to crack. But thats not true, you can simply obfuscate and crypt it by yourself and you have a insane auth."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T22:47:04.000Z",
          "Titre": "perfect",
          "Contenu": "my experience with keyauth is great. its very easy to use and supports such a wide array of programming languages that no competition offers, and for me that is the point that made me buy it.they have many easy/ready to use examples on their github.as for the features themselves, the seller api is very useful and allows for instant license delivery. and authentication itself is super fast and robust.i would not pick any other authentication system over keyauth! if you have a project that needs authentication then give keyauth a shot!"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Rayzr",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T18:01:41.000Z",
          "Titre": "KeyAuth is undoubtedly the best…",
          "Contenu": "KeyAuth is undoubtedly the best authentication system I have used over the past few years.Aside from the great compatibility, it's very easy to use and integrate in many different projects without hassle.Not to mention, it's also very secure.I've used KeyAuth in around 4 or 5 different projects and never have I experienced any issues with it.Excellent and cheap option."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Elf Fucker",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T19:23:03.000Z",
          "Titre": "Honest customer review.",
          "Contenu": "Been using keyauth for over 2 years and can say am glad that I switched from my previous auth system (auth.gg = bad). And having the option to have a self hosted version of it is even more amazing being able to add own functions etc. And in fact that its open source even another + so what ya waiting for drop the bad auth you using right now and join us on KeyAuth."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "faheem alvi",
          "Nb_Reviews": 2,
          "Date": "2022-11-27T11:03:54.000Z",
          "Titre": "KeyAuth Helped me managed my…",
          "Contenu": "KeyAuth Helped me managed my Subscriptions model business specifically talking about keeping the Liscense binded to their hwid. It is easy to use and pushing updates with it is also one of best features they have got. Pricing is also pretty reasonable so no reason to not go for Seller Plan."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "egssag gradfgr",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T01:12:48.000Z",
          "Titre": "I MADE $90K WITH KEYAUTH <3",
          "Contenu": "i bought the seller plan 1 year ago. +rep to keyauth, i made about $90k selling pasted software to kids.Its very easy to setup, everyone which uses his brain can make his own program!! Only bad thing i can say is that keyauth is getting ddosed often and sometimes their website & api is offline. But its not common anymore like in the past :)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ShadowMonster",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T01:10:02.000Z",
          "Titre": "KeyAuth System",
          "Contenu": "KeyAuth is overall amazing. Even with free plans the amount of help you get from the admins is immeasurable. Never had any huge problems with it with C++, PHP, and C#. KeyAuth does not only give you authentication but you also have to freedom to a mini customer panel where they can manage their account with the Seller Subscription (which is only like 20 dollars a year). You (the admin) also have lots of freedom to manage users. you can ban, change password, create variables to access from the client and there is also a live chat for you users in you app in the latest example. Keep in mind Keyauth also has a #code channel on their discord server where users upload free code examples you can use. Overall All my programs are way better with KeyAuth and I've give it a 10/10.- ShadowMonster#2247"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve Modz",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T22:55:54.000Z",
          "Titre": "Best place for authentication",
          "Contenu": "One of the best places to go if you are looking for any security/authentication for your own applications!This will be my second year with them -SteveModz"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "wor runs eu",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T20:59:32.000Z",
          "Titre": "I just wanted to say also this is the…",
          "Contenu": "I just wanted to say also this is the best key authentication for everything ever and its a big W for the 10€ Yearly and not to pay monthly(Its a stress) Support is fast and clear."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Laugny",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T18:41:03.000Z",
          "Titre": "Very good Auth System",
          "Contenu": "Keyauth is a very good auth system, I already used it and its simple and basic to understand. If you have a basic knowledge with coding, then this is something you could really need.Thanks to the Keyauth team for being such a great service!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "devil love",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T16:19:33.000Z",
          "Titre": "Better then auth.vegetables",
          "Contenu": "If you want a good and strong also with simple integration auth system keyauth.cc is for you. I am using an old auth of some other sites can't tell name but giving a hint (auth.vegetables) and when I ask them help for support they Banned me Lol. But On the other side Keyauth.cc have best support Thanks Keyauth.cc Team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Water Smith",
          "Nb_Reviews": 2,
          "Date": "2020-12-27T23:50:47.000Z",
          "Titre": "BEST AUTH EVERRRRRR…",
          "Contenu": "This is one of the best Authenticators ever better then Auth.gg, cauth.me, safeguard (safe but EXPENSIVE ASFFFFF) and best thing about it is there is almost no downtimes!!!! I love this authSeller,WaterTheDev"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Weebzo",
          "Nb_Reviews": 1,
          "Date": "2021-11-27T07:15:42.000Z",
          "Titre": "Weebzo Review",
          "Contenu": "WeebzoMy experience with keyauth has been very great so far, the owner actually reads suggestions and bugs that you find and you can say this the 1# best authentication service out right now 🙏.Plus all the reasons it offers, customer panel, chat for your applications, seller api to manage keys of your application and how simple it is to setup, since it already has already coded SDK's for PHP,Python,C++,C#,Rust ans VB, you can also make your own sdk for lenguages that don't have an available sdk.In conclusion this the best auth service you can get right now for so cheap, if you don't have a paid subscription to use all its features get it when you can since its so worth it🙏🙏🗣️💯."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T13:18:24.000Z",
          "Titre": "Best auth",
          "Contenu": "Incredibly cheap for what this service offers. Auth works really well and devs are constantly working on improving the product and helping their customers."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Sukiii",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T11:50:59.000Z",
          "Titre": "keyauth is be so amazing man",
          "Contenu": "keyauth is be so amazing man100% buy bro, hella cheap for what you get too, compared to other secured web auth providers - sukiiiluv"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cornelius Mbara",
          "Nb_Reviews": 3,
          "Date": "2023-09-07T16:16:46.000Z",
          "Titre": "Trustpilot is one of the must trusted…",
          "Contenu": "Trustpilot is one of the must trusted sites I've ever came across that one can always rely upon."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Someone",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T12:53:22.000Z",
          "Titre": "Best open source auth out there and probably will continue to be...",
          "Contenu": "Best open source auth out there and will prob be for more a couple years. Nice chat too free speech with just some rules, I recommend buying seller plan as it is game changing from free to sellerplan.Greetings Giuseppe"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Displayray",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T11:41:58.000Z",
          "Titre": "I recommend Keyauth for everyone",
          "Contenu": "I recommend Keyauth for everyone who needs a keysystem. Its so easy to set up and connect to your project. The prices are insane and it's totally worth it. I like the amount of features you have with keyauth and they still release new one. They also have a big amount of examples about using keyauth in your project.The only thing what i miss is a example for javascript. Hope it will be added soon.-- Displayray"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Kunde",
          "Nb_Reviews": 2,
          "Date": "2021-11-26T01:06:57.000Z",
          "Titre": "Best Auth Software/API",
          "Contenu": "I've been using Keyauth since around 6 Months, first the free plan, but since a few Weeks i bought the Seller Plan and im very happy with KeyAuth. I'll probably extend my subscription once its over. I can only recommend this!-Yonaire"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Dig",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T23:59:49.000Z",
          "Titre": "Flawless Support 10/10 Service!",
          "Contenu": "Outstanding support experience! The team responded promptly and efficiently, ensuring a 10/10 service. A special shoutout to CodeGraph for guiding me through the entire process. I truly appreciate the effort. Thank you once again."
        },
        {
          "Note": 5,
          "Lieu": "DZ",
          "Pseudo": "Kids Vidéo",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T12:13:20.000Z",
          "Titre": "Madrismsg",
          "Contenu": "Is thé best  auth système im a devloper and i sée keyauth is 1st auth in Google it have a good système and good protection for m'y applicationsSo thenk you very much"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sylverack",
          "Nb_Reviews": 2,
          "Date": "2023-05-05T18:28:04.000Z",
          "Titre": "Highly recommend",
          "Contenu": "Keyauth offers a wide range of customization and security measures f to secure programs/apps etc… The free version is very good while the paid plans are even better. Keyauth is authentic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Combo Unbanned",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T00:23:46.000Z",
          "Titre": "Best auth and it's cheap",
          "Contenu": "Only $10 for the most secure auth. Also, it comes with features like deleting keys and auto getting the hash so no one else can use your auth token."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Свисток",
          "Nb_Reviews": 3,
          "Date": "2021-11-26T01:07:38.000Z",
          "Titre": "Astonishing Security and Licensing",
          "Contenu": "KeyAuth for me has been one of the most exciting networking clients i've worked with, the amazing security they provide when integrating with .NET Programs have been amazing for me, the licensing system has no ends it literally spills a pool of absolute amazingness, I just love how i am able to pick and choose who i want to give time to on each users license, the customization is endless and the support is unbelievable, some of my past projects i would have not been able to complete without KeyAuth and its a tool everyone should use, its worth the money.- WhistleDev"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Zain Regedit",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T17:25:29.000Z",
          "Titre": "Fast Customer support love it and it is…",
          "Contenu": "Fast Customer support love it and it is easy to use but i have a request that please decrease the price of Annual subscribtion"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin Cody Morgan",
          "Nb_Reviews": 9,
          "Date": "2022-10-12T17:56:31.000Z",
          "Titre": "Perfect service",
          "Contenu": "Perfect service, been using for almost a year now for my application. Support is fast and very helpful and very good 👍."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "nick lolol",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T01:04:02.000Z",
          "Titre": "Greatest auth ever",
          "Contenu": "Insanely good auth, theres tons of helpful features and easy to add it to any project.-eugostodecoco124"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Serpensin",
          "Nb_Reviews": 5,
          "Date": "2023-04-12T00:50:00.000Z",
          "Titre": "Good purchase",
          "Contenu": "I bought Enterprise, so I can have all the functions I need, to host it on my own server.Working perfectly so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shxde",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T02:31:37.000Z",
          "Titre": "Amazing in all areas",
          "Contenu": "Amazing in all areas. Support and automation is amazing I can’t find one error with this service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": ".gg/plugboostsx",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T20:14:47.000Z",
          "Titre": "Staff member \"Smae\" helped me get my…",
          "Contenu": "Staff member \"Smae\" helped me get my account information back after forgetting it 5/5 help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "P-Denny",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T17:44:14.000Z",
          "Titre": "Great System for selling apps",
          "Contenu": "Great System for selling apps and other paid products. Defiantly worth the $10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GOR GOR",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T06:36:52.000Z",
          "Titre": "Keyauth is daddy",
          "Contenu": "Keyauth is daddy, but seriusly keyauth is amazing for sucuring your program no matter what it is"
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "WasdGamer",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T00:24:12.000Z",
          "Titre": "I really like KeyAuth +Repp",
          "Contenu": "I have been using KeyAuth for 3+ months from now on, Its really good and also they have very fast Support."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Quincy Farter",
          "Nb_Reviews": 2,
          "Date": "2021-11-29T06:22:40.000Z",
          "Titre": "best auth out there",
          "Contenu": "best auth out theregoes very hard no bypasses frequent updates-samsondev"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "apilol",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T01:36:55.000Z",
          "Titre": "Use KeyAuth it's better then those…",
          "Contenu": "Use KeyAuth it's better then those pastes *cough cough authgg*. And is just an all around good auth"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T16:30:03.000Z",
          "Titre": "10/10 Authentication Service",
          "Contenu": "10/10 Authentication service, works great, easy to use, and is always being updated. Highly recommend it!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Skidcar",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T05:01:52.000Z",
          "Titre": "Amazing service!",
          "Contenu": "KeyAuth is the best solution for authenticating your applications, I mainly use this for my Visual Studio apps in C#"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew Meder",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T19:31:43.000Z",
          "Titre": "Great auth service",
          "Contenu": "Great auth service. Next to no down time or issues, friendly support team and just a great product"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Shredder",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T03:54:37.000Z",
          "Titre": "amazing",
          "Contenu": "really easy to setup, good auth and helping staff on discord-shredder"
        },
        {
          "Note": 5,
          "Lieu": "DZ",
          "Pseudo": "ᏟRiMiNaL HaCKeR",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T16:33:44.000Z",
          "Titre": "i love keyauth #miro",
          "Contenu": "The service saves you a lot of time and the price is excellent"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Garexu",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T17:33:59.000Z",
          "Titre": "Now i can create my apps without a hard…",
          "Contenu": "Now i can create my apps without a hard login system!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T09:40:32.000Z",
          "Titre": "Not gonna lie",
          "Contenu": "Not gonna lie, that’s the best secure Authenticator for your Applications"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mohammed Abbadi",
          "Nb_Reviews": 1,
          "Date": "2021-11-27T20:00:11.000Z",
          "Titre": "this is the best author action system…",
          "Contenu": "this is the best author action system out there"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SuperA",
          "Nb_Reviews": 2,
          "Date": "2020-12-30T09:15:53.000Z",
          "Titre": "Best Auth system out there",
          "Contenu": "Best Auth system out there. very good support and staff and very safe and easy to use api!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Dani",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T23:00:21.000Z",
          "Titre": "Keyauth customer support is always…",
          "Contenu": "Keyauth customer support is always quick with reply times and good informative answers."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Snowy Snowman",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T01:03:59.000Z",
          "Titre": "Best auth on the Market",
          "Contenu": "Their Discord is very funny also the auth is very good aswell!-Snow"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evan Fincher",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T01:04:21.000Z",
          "Titre": "10/10 would date",
          "Contenu": "Best and easiest to use auth system-Dread"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rudy heartless",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T02:17:55.000Z",
          "Titre": "Been using Them for about a year no…",
          "Contenu": "Been using Them for about a year no complaints"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Hymerine Hymerine",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T13:04:03.000Z",
          "Titre": "Great Service and Support"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "quinten dams",
          "Nb_Reviews": 3,
          "Date": "2022-09-12T22:25:05.000Z",
          "Titre": "Good program easy key creation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Limitless",
          "Nb_Reviews": 3,
          "Date": "2022-10-08T00:35:27.000Z",
          "Titre": "one of the best key authorization…",
          "Contenu": "one of the best key authorization systems ever"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "PEGASUS",
          "Nb_Reviews": 2,
          "Date": "2022-08-01T18:49:18.000Z",
          "Titre": "nice and easy to use",
          "Contenu": "nice and easy to use, but not well protected!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "AbhashBhai",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T04:47:59.000Z",
          "Titre": "I can't explain it by just typing"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "madryx",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T01:04:27.000Z",
          "Titre": "Great Auth System",
          "Contenu": "Great Auth System- madryx"
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "NoRules Developer",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T06:35:14.000Z",
          "Titre": "the best support and admin <3"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Unreal pro",
          "Nb_Reviews": 1,
          "Date": "2021-01-02T19:52:30.000Z",
          "Titre": "great auth!!!!!!!!!!!!!!!!!!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Adkinson",
          "Nb_Reviews": 4,
          "Date": "2022-09-06T17:44:07.000Z",
          "Titre": "Easy to impliment to basically any…",
          "Contenu": "Easy to impliment to basically any project."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ghist verify",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T17:22:12.000Z",
          "Titre": "great support and very friendly"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "mostafa kamel",
          "Nb_Reviews": 2,
          "Date": "2022-10-08T16:13:15.000Z",
          "Titre": "Best Support"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "TERROR OP",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T20:41:51.000Z",
          "Titre": "Good Website"
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T10:41:07.000Z",
          "Titre": "Good fast auth"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T01:40:33.000Z",
          "Titre": "Very great service 👍"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Fort Nite",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T08:43:05.000Z",
          "Titre": "Great auth :)"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "VX Project",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T23:30:40.000Z",
          "Titre": "Best",
          "Contenu": "Working fine . Maybe best ?"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "???????",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T19:06:07.000Z",
          "Titre": "Best auth for c#"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Nour Eter",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T01:11:24.000Z",
          "Titre": "the best ever"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KoolKid",
          "Nb_Reviews": 1,
          "Date": "2020-12-27T21:44:16.000Z",
          "Titre": "very good 10/10 :)",
          "Contenu": "Very Good and secure Authentication system. 10/10 would recommend"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Eason",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T14:15:58.000Z",
          "Titre": "Very good",
          "Contenu": "Very good, Not have much words."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "pio",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T19:54:29.000Z",
          "Titre": "Good very good"
        }
      ]
    }
  ]
}