{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "laptop-battery-shop.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Hoefnagels",
          "Nb_Reviews": 2,
          "Date": "2023-04-30T14:14:24.000Z",
          "Titre": "HP fake battery",
          "Contenu": "I ordered a battery for an HP laptop on the website that was also shown in photo with the correct HP serial number. But the battery I got was from another unknown brand."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T02:33:00.000Z",
          "Titre": "Still No Battery",
          "Contenu": "I still haven't received my battery or any valid shipping information on the battery. I have emailed Laptop Battery Shop 3 times, but have only received 1 response, and that response did not have valid shipping information."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frodo Baggins",
          "Nb_Reviews": 2,
          "Date": "2020-06-09T22:51:05.000Z",
          "Titre": "Knock Off batteries that don't match the origial specs",
          "Contenu": "Ordered an ASUS battery and yes, finally saw the disclaimer that they sell knock offs but it's still presented as an original ASUS. The battery specs do not match the original ASUS battery or what they advertised on their website. The order, below, even says ASUS.Order Confirmation from laptop battery shopThanks for shopping with us today!The following are the details of your order.------------------------------------------------------Order Number: 10037049Date Ordered: Thursday 21 May, 2020Detailed Invoice:ASUS A42-U53 LI-Ion Battery Pack for ASUS U43F LaptopProducts------------------------------------------------------1 x Asus A42-U53, A41-U53 14.8V 4400mAh original batteries (1002563)  =$54.38"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laurel",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T07:27:27.000Z",
          "Titre": "BUYER BEWARE!",
          "Contenu": "BUYER BEWARE!! They sent a battery that did not fit. Trust me- I would have loved for it to work- it was desperately needed!!! They don’t pay return shipping and you have to send back to China! $30 or more to ship back and it’s a huge hassle. Super sketchy selling knock off batteries that may or may no worries for your computer. I can’t believe these guys have any good ratings on here. Shocked."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2019-06-19T01:40:19.000Z",
          "Titre": "Warning!!! They are scammer and thief.",
          "Contenu": "I bought a battery would arrive in 4-12 days, After 14 days I still not receive the package. I pay by paypal and their company name show 长沙唐传电子商务有限公司. I try to contact them where is my package. They reply me \" The battery ship out already and ship from China.\" They have stopped answering my emails, and they have not returned my money."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Arnon Klineman",
          "Nb_Reviews": 1,
          "Date": "2019-10-31T09:32:03.000Z",
          "Titre": "They sell fake batteries.",
          "Contenu": "They sell fake batteries.I ordered an \"original\" bty-m6k battery, and got a fake that try to look like the original.That's even worst then replacment..Do yourself a favor, avoid this site!"
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "JP",
          "Nb_Reviews": 1,
          "Date": "2019-09-20T12:54:14.000Z",
          "Titre": "Ordered a laptop battery a month ago…",
          "Contenu": "Ordered a laptop battery a month ago and havent received it. It says 10 days for delivery on the website for my country.I have emailed them but they dont answer."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Shaun Howell",
          "Nb_Reviews": 6,
          "Date": "2019-07-31T09:55:00.000Z",
          "Titre": "Product works but wrong size, offered payment for good review",
          "Contenu": "The battery I bought was cheap, it arrived on time and it has worked well for the past month. However, some significant issues: the battery was slightly too big, so putting all the screws in caused it to buckle, meaning I couldn't get the laptop shell back on, so I removed one screw. I also feel like it wasn't clear on purchase that the battery would be off-brand. Also, they've just asked me to write a good review for them with a link a different site, and offered to refund money if I do, so don't trust the ratings. Clearly an overseas outfit making knock-offs and playing fast and loose with rules/service, but you might get lucky."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T03:47:42.000Z",
          "Titre": "Correct battery but has charging problem",
          "Contenu": "The battery fits fine and runs the laptop.  In spite of having cycled it below 20% three times it does not reach 100% charge but only 97%.  The indicator on the laptop never indicates that the battery is fully charged.  The shipping took longer than expected.  The battery functions well enough to recommend the seller."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "Mohammed Abu Rahma",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T09:41:00.000Z",
          "Titre": "thanks for you",
          "Contenu": "i want to say t am very happy with this sitethey are true and products are good and very quick service but also to mention that their support is outstanding thank u again"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Vier Wet",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T13:08:04.000Z",
          "Titre": "good",
          "Contenu": "bought their battery last year still working good."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Joe M",
          "Nb_Reviews": 2,
          "Date": "2019-10-31T06:57:26.000Z",
          "Titre": "Late but it is here",
          "Contenu": "I ordered a battery and I neither receved the article nor any tracking mail. I'm waiting since 14 days. I payed with Paypal.UPDATE:The battery is here! After over a month."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keith Jonatzke",
          "Nb_Reviews": 1,
          "Date": "2019-10-25T19:27:38.000Z",
          "Titre": "Wrong Product, No Response",
          "Contenu": "Hi, I ordered a replacement battery for my aging Razer Blade Pro 17\" (2012) on 9/23/2019.  After finding one on the website to be a perfect match, I placed my order.  I even paid the extra $15 shipping to get it here quicker.I received my package, only to find instead of a battery it was an exit sign in roughly the same dimensions written in Chinese.  I have written back twice to Laptop Battery Shop without hearing back from them.This has become a huge bottleneck for me, as my entire build has been put on hold until I can find a replacement battery.  Not sure how to move forward from here.  I just really need the battery.ordered:   Gigabyte 961TA002F, GMS-C60 11.1V 5440mAh  batteryOrder# 10032720Update:     I finally received a message after a week explaining that it was a week long holiday in China, and that they apologized for taking so long to respond to my inquiry.  They had also explained that they placed the battery inside the exit sign to help \"protect\" it from damage during shipping.     I did indeed find the battery inside, and once I installed it in my laptop it went from 15-20 minutes of battery life to 2-4 hours!  It was something I needed dearly, and worked just fine.     I was also asked several times to delete this post, that it was affecting their \"sales\" and was even offered a bribe to take it down.  I will do no such thing.  This is what is, and they will just have to acknowledge that this was a missed chance at communicating an important piece of information.  This has profoundly delayed my build by over a month, as timing is crucial for a busy professional as myself.  I did improve the rating to 3 stars, as the battery performed as expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Gazaway",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:12:10.000Z",
          "Titre": "4/5 Service and Shipment",
          "Contenu": "I was initially a little skeptical because the website was entirely unfamiliar to me. They sent me an email confirmation to verify the right connector I had, so kudos to them. The battery arrived about 2 weeks later, in brand new condition with no wear. It fit as described. Very smooth process, would buy from them again. The company does refund you $2 to write a positive review, so feel free to be wary of that. Other than that, a good company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T07:54:08.000Z",
          "Titre": "Pleased with product, spotty website, fast shipping",
          "Contenu": "I was a little skeptical at first but I was very happy with my purchase. The shipping times were faster than advertised and it shipped from somewhere is California. I don’t know that the battery I received was genuine or not, but it got my laptop back up and running so it was the best option since asus wouldn’t let me buy an official one.NegativesThe email system was good but the website experience is quite poor. Couldn’t log in and check order status. Various pages still have sample text from some sort of website template. Not very professional. I had to use a different card because the purchase came through as international. It would be nice if payments were processed in the country of purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T19:44:31.000Z",
          "Titre": "Send More Updates, Otherwise Perfect!",
          "Contenu": "Sending a shipping/order update would be great.  I also never received a receipt email.  I did create an account after order and I had hoped my order would be there."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T17:37:15.000Z",
          "Titre": "Order confirmation was stopped by Spam fllter",
          "Contenu": "Order confirmation was stopped by my Spam filter - which created some confusion. Can notifications be made so that they do not get stopped by an average Spam filter?Bettery is fine, and shipping time was good! Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Chuck",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T16:28:24.000Z",
          "Titre": "Experience with the battery",
          "Contenu": "The shipment was very fast as promised (4-8 working days). I mounted the new battery into my MSI laptop and calibrated it. I use it just for a week. The experience in general is good but only once the laptop has been shut down at 30% of charged status but I am not so sure this is related to battery status. I would recommend in general."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Willem Ditters",
          "Nb_Reviews": 3,
          "Date": "2023-06-09T17:08:36.000Z",
          "Titre": "Good and genuine product",
          "Contenu": "Good and genuine product, quick turnaround... But almost no communication whatsoever. Almost a black hole. Money goes in, battery comes out, but nothing else :-)"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T03:32:02.000Z",
          "Titre": "From ~3 hrs battery life, now to ~8 hrs!",
          "Contenu": "Sales team ensured that the battery I received would be the exact battery I needed. No issues to mention, although finding your tracking number could be a bit simpler/more obvious."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ben P",
          "Nb_Reviews": 1,
          "Date": "2021-02-23T01:10:34.000Z",
          "Titre": "The battery works as expected & good…",
          "Contenu": "The battery works as expected & good customer service. They respond in a timely manner, friendly and professional. The delivery got delayed not because of them but it was held in customs, I wasn't too frustrated in waiting for it even if it took longer than expected. Mostly it was COVID's fault that deliveries got delayed. They can also improve their website to become more user-friendly (and might attract more customers)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M. Berger",
          "Nb_Reviews": 3,
          "Date": "2021-12-22T14:05:28.000Z",
          "Titre": "Laptop Battery Shop delivered as advertsied",
          "Contenu": "Laptop Battery Shop delivered as advertised.  Their web site walked me through the correct battery selection for our laptop and their price was most attractive.  Our free delivery took longer than expected, we attribute that to the holiday shipping rush."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Reuben Shanthikumar",
          "Nb_Reviews": 2,
          "Date": "2020-01-10T14:52:37.000Z",
          "Titre": "Can Trust Product Quality!",
          "Contenu": "Great Company, Battery was delivered as promised and works great. This would be a five (5) star review, but the shipping time is longer than expected (instead of 3-4 weeks more like 5-6 weeks) in my case anyway. Other than that, their service is great, would definitely recommend"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Simon Worthington",
          "Nb_Reviews": 3,
          "Date": "2020-06-17T08:21:30.000Z",
          "Titre": "Took a long time to come from China…",
          "Contenu": "Took a long time to come from China but- major issue was Yodel delivering to the wrong address- it arrived eventually after 4 weeks. It appears very well made-install was straightforwards and holds charge incredibly well- far better than the original OEM battery when new. The team in China worked very hard to ensure I received my product- and for that I am grateful- as it is surprisingly hard to find a replacement for my ASUS model supplied via john Lewis just 2 years ago! I will use this company again based on what I have experienced so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T16:00:38.000Z",
          "Titre": "Battery is fine",
          "Contenu": "Battery is fine, in early trials, and hard to find.  Shipping time was good, however, three dcays to send aftrer payment is below par."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T15:15:27.000Z",
          "Titre": "The battery was received and works…",
          "Contenu": "The battery was received and works fine.I paid for a faster delivery and had a portion of my payment refunded and informed the faster delivery was unavailable. The seller should not be offering faster delivery knowing it will not be used."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stan",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T15:24:16.156Z",
          "Titre": "Good service, reasonable prices.",
          "Contenu": "This is a great company to get reasonably priced replacement batteries from. I've ordered 3 of them over the past few years and got good service out of the batteries. The only ding I can give them is since they're in China, it takes a while for the type I bought (I understand they do stock the more popular types in the U.S.) to be shipped to you. Other than that, no complaints."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Martin Osvaldo Cano Adriano",
          "Nb_Reviews": 2,
          "Date": "2021-10-11T15:36:30.000Z",
          "Titre": "Martin C.",
          "Contenu": "Great prices!Helpfull tracking!Email fast respond!Easy purchase paymentNice treatment I really recomend this webpage"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tony McCormick",
          "Nb_Reviews": 3,
          "Date": "2020-05-27T16:01:50.000Z",
          "Titre": "Asus laptop battery successfully replaced.",
          "Contenu": "Hi there,I ordered a battery for my 2 or 3 year old Asus laptop. Initially I was disappointed with the delivery time. I ordered Mid March '19 and it arrived maybe mid May '19. But I supppose with Covid  we have to be patient about these things.The battery was pristine, well wrapped, and was the correct one.So everything has gone well.By the way, I thought at first it was not charging up for a long time but it was my fault...it turns out the computer was set to stop charging at 60%. I have now increased this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah Brunsting",
          "Nb_Reviews": 1,
          "Date": "2020-03-31T13:48:22.000Z",
          "Titre": "Battery fits perfectly and works just…",
          "Contenu": "Battery fits perfectly and works just the same as the original one. Thanks for double checking that I ordered the correct battery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Scott",
          "Nb_Reviews": 1,
          "Date": "2020-04-27T20:31:12.000Z",
          "Titre": "Great buy!",
          "Contenu": "Given that I've provided specifications for my battery to other retailers but still fell short of receiving the expected product.I finally received the correct battery, timely delivery, and great price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Claudene Raymond",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T02:04:30.000Z",
          "Titre": "Acer Chromebook battery",
          "Contenu": "I ordered a battery for my Acer chromebook.  I received this in a timely manner. It was what I ordered. It cost me half of what I paid for the computer but I needed the files from the computer."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 1,
          "Date": "2020-10-08T15:17:20.000Z",
          "Titre": "The overall experience was a mixed bag",
          "Contenu": "The overall experience was a mixed bag, which maybe expected from a Chinese company dealing with shipping sensitive (LiPo) batteries during this pandemic.My laptop battery had bulged, and the vendor was unable to ship the bare batteries to me and pointed me to site and the exact batteries to get.Site staff was very helpful by answering pre-sales questions about shipping and confirming the exact battery ordered before processing the order.I understand the pandemic has everything up in knots but it was still an odd just over 5days before they shipped my order out and provided me with like 3 different tracking numbers via 3 different shipping companies - the actual one was not named and a generic tracking site provided.The batteries arrived just around the estimated maximum of 15 (working) days, with tracking not making sense and not timely.When the batteries finally did arrive (it seems there's no local delivery anymore, had to contract anther local courier to finish the last mile, or go to pick it up) they were the exact batteries stickers and all :DThe batteries behaved exactly as the original ones did."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "reem",
          "Nb_Reviews": 6,
          "Date": "2020-04-24T08:59:10.000Z",
          "Titre": "laptop battery",
          "Contenu": "I bought a laptop battery ... the battery as same as the discription in the website and it is work good."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T14:13:05.000Z",
          "Titre": "quick email replies and quiet efficient…",
          "Contenu": "quick email replies and quiet efficient tracable parcel"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T01:59:45.000Z",
          "Titre": "Good",
          "Contenu": "GoodProduct. As expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harry",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T17:34:23.000Z",
          "Titre": "Great Service and Support."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "LIANE OON",
          "Nb_Reviews": 2,
          "Date": "2019-10-19T05:30:45.000Z",
          "Titre": "Got a refund",
          "Contenu": "Ordered my laptop battery with this company. After one month, it still had not arrived with no updates provided. Sent an email check and they replied that it had not been sent out. Asked me to email back after 3 days to see if there was stock available. Sent the email asking for a refund if not available and promptly got a refund."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "M C Clatworthy",
          "Nb_Reviews": 12,
          "Date": "2018-10-22T09:52:35.000Z",
          "Titre": "Battery arrived promptly",
          "Contenu": "Battery arrived promptly. Fitted to my Lenovo Tab 10 but couldn,t get the tablet to charge. Suspect the problem is with the charging port as the tablet board gets very hot when trying to charge. I do not think the problem is with the battery but have no way of checking. May try to replace charging port but that is not so easy."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Reuben Shanthikumar",
          "Nb_Reviews": 2,
          "Date": "2019-10-01T11:55:23.000Z",
          "Titre": "Buy with confidence, but delivery will take at least a month!",
          "Contenu": "I have ordered twice from this company and I can't fault them for much; except for their delivery time. They claim to be out of the US, but they actually ship from China and though they claim to have a 6 -12 day delivery time its more like 20 - 25 days. Their customer service is average, they respond usually within a 48-hour time frame, though it does sometimes take longer. Their tracking information is good but often late or lags behind their response email. Their products are great, both batteries work as they should and I haven't had any problems as of yet! I would buy with confidence but you will have to wait at least a month."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2018-11-08T08:54:00.000Z",
          "Titre": "Dell XPS13 9333 battery",
          "Contenu": "Dell XPS13 9333 battery powered laptop but would not charge.  Company has agreed to issue a refund.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Franco",
          "Nb_Reviews": 1,
          "Date": "2018-12-19T11:06:54.000Z",
          "Titre": "Good delivery timing and service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sonic Shim",
          "Nb_Reviews": 1,
          "Date": "2019-03-03T23:33:45.000Z",
          "Titre": "Fast and professional service"
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Bruno Eberle",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T14:15:53.000Z",
          "Titre": "Good service",
          "Contenu": "Fast delivery. Just what I ordered. Got an E-mail to confirm the version of the connector. Good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IFuqCops_",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T06:20:13.000Z",
          "Titre": "They really came through",
          "Contenu": "My laptop's battery was worn to death; was outright shutting down after a minute of being off charge!Was looking for a battery and found this one.While the website may look suspicious, they delivered a battery that works fine!My laptop's back to a great lifetime"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Ole Kammersgaard",
          "Nb_Reviews": 14,
          "Date": "2023-09-11T13:29:03.000Z",
          "Titre": "All in all a good experience.",
          "Contenu": "After placing the order I had a brief email correspondance, where they wanted to make sure that I got the correct battery, which I did.Shipping to Denmark took something like 3 weeks, but on the order hand, there were no additional fees or taxes, so all in all a good experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer L. Myers",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T01:36:40.000Z",
          "Titre": "Prompt Service",
          "Contenu": "The computer batteries I ordered were packaged so securely and delivered quickly. I have 2 computers I reconfigured for my grandchildren and was very anxious to give them to them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian P.",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T19:48:56.000Z",
          "Titre": "Very happy with Laptop Battery Shop!",
          "Contenu": "I was very fortunate that Laptop Battery Shop had in stock a battery for my Lenovo Yogabook tablet PC.  The order process was easy and I received an email letting me know my order had been received.  The new battery was delivered within a week. It's installed and working as expect.  Overall, this was a great experience."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bryan Daneau",
          "Nb_Reviews": 5,
          "Date": "2023-07-24T19:01:31.000Z",
          "Titre": "Really happy with my purchase",
          "Contenu": "Really happy with my purchase - got a new battery for my Acer Chromebook as it's health was at 70%. New battery arrived within 2 weeks (it shipped from CN) - packaging was excellent and protective - and the battery itself had all the exact same markings as the OEM aside from the Acer logo. Health is 97% now - so really happy overall with my shopping experience."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Ilya",
          "Nb_Reviews": 2,
          "Date": "2023-04-21T13:16:49.000Z",
          "Titre": "This is how the most effective things work",
          "Contenu": "Don't be confused by the old site design. This is what the most effective tools look like. The guys really know their stuff the best. An extremely wide range of batteries (including rare ones), reasonable prices, fast delivery, and feedback if necessary. Don't waste your time looking for better deals."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "a human",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T10:14:35.000Z",
          "Titre": "Battery is good of good manufacturer",
          "Contenu": "Battery is good of good manufacturer. Laptop can hold the whole conference day again.In three days parcel was out of origin. The rest of weeks parcel was traveling inside Correos de España."
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "Tony Georgiou",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T07:53:35.000Z",
          "Titre": "Great communication from the start",
          "Contenu": "Great communication from the start. Delivery to Cyprus was also reasonable timeframe considering that when shipments arrive in cyprus they get lost in the system for a week. So even with those delays the shipping time was good. Battery was as decribed and is currently working fine. Well done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Ringel",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T12:50:10.000Z",
          "Titre": "Attention to detail avoids mistakes.",
          "Contenu": "I wanted to purchase a backup charger for my ASUS Vivobook Flip. The charger for my particular model has a tip that is different from almost all other ASUS laptop products. The vendor was aware of this and required that I confirm tip dimensions before shipping. I am always impressed by this degree of attention to detail. Nice job, guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz Mendoza",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T03:58:41.000Z",
          "Titre": "Fast and free delivery!",
          "Contenu": "The website promised delivery in about a quarter of the time of any of the others. Not only that, the battery was a lot cheaper. So far so good, I installed it the day after I got it and it showed it was fully charged. I've been using it on and off the last few days and it hasn't lost a bar yet. Oh, and delivery was free! I'll be back to get another one in a few years!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Peter",
          "Nb_Reviews": 3,
          "Date": "2023-01-15T13:54:20.000Z",
          "Titre": "Legit webshop with legit batteries",
          "Contenu": "The only website that had the exact laptop battery that I needed. After ordering, the item was shipped relatively fast. Since it came from China, it got held at the customs and I had to pay a small handling fee + VAT, but thankfully the declared value on the package was low so it wasn't much. I also realize this is outside of the webshop's control so nothing anyone can do about that. The total time since ordering upon receiving was 2 weeks. The battery is working great so far and seems to be identical to the old one. Overall, I'd recommend the webshop."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Stephen Hancock",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T05:05:00.000Z",
          "Titre": "Tablet batteries too!",
          "Contenu": "Ordering a Lenovo Tab genuine replacement battery was very easy from Laptop Battery Shop, it arrived in Australia in the timeframe specified.  It has given the tablet another couple of years of life at a fraction of the cost from Australian battery suppliers. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ChappyPants",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T18:49:24.000Z",
          "Titre": "They stand by their service!",
          "Contenu": "Here's what you need to know: sometimes, how someone handles an issue is the most important thing. I ordered a laptop battery that said it would fit but only if an SSD wasn't being used. That wasn't immediately apparent to me.The company made it right with an easy return. I appreciate that."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "ID",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T10:38:55.000Z",
          "Titre": "Better than provided by Lenovo authorised service",
          "Contenu": "After 2 changes of the battery in my daughter's Lenovo Yoga by authorised Lenovo service - 1st worked  day, 2nd half a year,  the battery from L-B-S, for 1/3 of price, works without any problem. To avoid doubt with the proper battery type, the exact specification of the battery was double-checked by the seller. Battery delivered in suitable package to protect the content within the transport."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Raed hamdan",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T14:24:57.000Z",
          "Titre": "Reliable shop",
          "Contenu": "I just received my order the battery works fine but there were extra fees I had to pay. it depends from a country to another just be aware.I contacted them and they explained them self and its out of there control overall good experience and the support team is nice and answers fast Reliable shopI will update the review after 6 months if the battery still works and everything is fine"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny C",
          "Nb_Reviews": 2,
          "Date": "2023-04-04T18:05:48.000Z",
          "Titre": "Great vendor",
          "Contenu": "Great vendor. I ordered and received an OEM battery and unfortunately it didn't fit my computer, which I could have noticed if I had paid more attention to the images of the connector and which connector my laptop accepted. Not a vendor issue, as far as I could tell I received a well packaged, good OEM battery. They accepted my return and were responsive via email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eclipse",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T19:28:33.000Z",
          "Titre": "Great quality and service",
          "Contenu": "Really good company, was a pleasure doing business with them. Ordered a battery for my laptop that came with 2 different connector variants, they reached out to me to help me find my connector. When the battery arrived, it was in pristine condition with full capacity. 10/10 would do business with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T21:45:29.000Z",
          "Titre": "MacBook A1398 battery",
          "Contenu": "Found this vendor listed on review sites with overall favorable reviews, so I decided to give them a try. Web site was easy to navigate, order process was quick and easy. Price/shipping seemed reasonable. Good communication and tracking info. Packaging was very good, instructions lost a little in translation, but was able to follow. It arrived on time and in working order. Good fit and finish, time will tell as for the longevity of this battery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sprinzy",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T22:39:07.000Z",
          "Titre": "happy and satisfied with Service !",
          "Contenu": "happy and satisfied with Service !Glad I found Laptop battery website to replace my Lenovo Laptop battery. Customer service was prompt in response and also shipped immediately with tracking number and received battery perfectly. Will recommend for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devin Green",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T12:45:15.000Z",
          "Titre": "Amazing Company",
          "Contenu": "Amazing Company. The site looks sketchy, but the products and customer service are top tier. It did take a while for the battery to get here, but that's expected considering it came a long way. 10/10 would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Moar",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T09:05:35.000Z",
          "Titre": "ASUS Q524U Replacement Battery works well!!",
          "Contenu": "Needed a replacement laptop battery for my ASUS Q524U as the current battery was dangerously swelling up and warping my unit.Was able to find a suitable replacement at an affordable price from Laptop Battery Shop and was ordered and shipped within the time specified. As I've already opened up my laptop previously for other issues, the task of replacing the battery myself was quite simple with the right tools and was completed in less than an hour.I've been using the laptop with its new battery for several weeks now without a hitch!"
        },
        {
          "Note": 5,
          "Lieu": "GU",
          "Pseudo": "Shy Hestu",
          "Nb_Reviews": 1,
          "Date": "2020-09-17T09:23:47.000Z",
          "Titre": "Great customer service!!! Highly recommend!",
          "Contenu": "Although, Laptop Battery Shop was not able to ship the battery to my location due to the pandemic, Ms. Amy was very professional, kind and helpful. She answered all my questions and explained the situation with the shipment. She also responded very quickly via email and refunded me immediately. Great customer service! Will hopefully be able to order a battery from them once we are allowed to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jas Sheets",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T01:27:22.000Z",
          "Titre": "Really Pleasant Experience",
          "Contenu": "My experience was very good. I couldn't really find the battery I needed anywhere else that wouldn't take more than a month to get to me. This took about I believe it was 2 weeks which was much better than the 4-6 weeks I was estimated from getting for only a few dollars less. It worked really well when I got it and was brand new. When I tested it, it said it had a single cycle which means it was definitely brand new, it also had more capacity than stated which is great. Overall the experience was really well. I definitely didn't mind how long shipping took, was a bit disappointed they didn't have an option for faster shipping but that's most likely due to the restrictions on batteries on flights."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "alay",
          "Nb_Reviews": 18,
          "Date": "2023-04-27T13:45:00.000Z",
          "Titre": "Great product and great service",
          "Contenu": "Great product and very good turnaround time. The battery is holding up so far and came in perfect condition. The seller was very responsive when I asked for shipping updates and I have full confidence in them. Would buy from them again, and recommend to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rod",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T03:33:21.000Z",
          "Titre": "Wide variety of batteries",
          "Contenu": "My new go to battery shop. Has a large selection of batteries. Although shipping is not overnight, it is very acceptable. Replacement battery was identical to the original."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2020-08-31T15:21:27.000Z",
          "Titre": "Very happy customer",
          "Contenu": "I received my battery within 3 weeks, as was expected considering my MSI laptop is 8 years old. I was very pleased by the prompt and friendly customer support I received from Amy. The price of the battery was significantly cheaper than other sources. I will definitely deal with them again if need be."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheldon",
          "Nb_Reviews": 1,
          "Date": "2020-08-20T02:59:42.000Z",
          "Titre": "Great communication",
          "Contenu": "Great communication! I overlooked selecting the adaptor for the laptop battery I order and their support staff (Amy) contacted me immediately. We were able to select the correct adaptor, but unfortunately the battery with the adapter I needed was sold out and would not be in stock in the near future. They provided a full refund (which will show up on account in 5-10 days) and remedied the situation quickly! I was impressed as most suppliers can take up to a week or more before remedying such situations. Thank you Laptop Battery Shop!!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Lia Hau",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T04:39:14.000Z",
          "Titre": "God bless your business booming.",
          "Contenu": "I ordered a battery and for a problem regarding my mailing address it has been returned, it has caused an extra freight.  I felt really sorry and suggested to bear the freight but they said that wasn't my fault, eventually they gave me a full refund.  I wanna say they're such a kind and honest and reliable and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald G.",
          "Nb_Reviews": 2,
          "Date": "2020-08-16T23:15:21.000Z",
          "Titre": "Got my exact Laptop charger replacement",
          "Contenu": "Easy and user friendly website. I was able to find the laptop battery replacement I needed. Customer service emailed me immediately on what type of plug I needed since the model has two, they were able to provide what I need. Shipping was a bit long since of the shipping delays happening due to the pandemic. Overall I highly recommend Laptop Battery Shop. Would order agsin if the need arises."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Dean Ovadia",
          "Nb_Reviews": 1,
          "Date": "2020-09-11T05:46:53.000Z",
          "Titre": "MSI battery replacemet",
          "Contenu": "I purchased an MSI battery replacement on the 16th, the shipment was the day after which is impressive taking into consideration the COVID-19 situation. The shipment was very long, about 3 weeks so don't expect it to be fast. The tracking is very lacking and not informative. BUT! I the costumer service is on another level! I had Amy which was so kind, extremely responsive - she didn't ignored any email and even helped me to track the package and stated that if a problem will accoure I'll get my money back. Highly suggested if you can wait that long for a battery. The service is the strong point!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Kevin Wang",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T04:26:56.000Z",
          "Titre": "Very helpful seller",
          "Contenu": "I'm in Australia. After my laptop battery died, I tried local store, ebay and Amazon couldn't find the battery for my laptop. I found Laptop Batery Shop on google and ordered one from them. I was not very confident with this purchase since the battery was shipped from their overseas warehouse. I was surprised when I received the battery in two weeks (including two weekend) because my experience tells me overseas shipment usually takes one month. The battery was packaged well and easy to install. I used for one week and didn't find any problem. I'll recommend Laptop Battery Shop to those who can't find local battery seller. They are true and reliable seller."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alun Palmer",
          "Nb_Reviews": 2,
          "Date": "2020-06-01T15:19:01.000Z",
          "Titre": "Great service, very pleased.",
          "Contenu": "I ordered a laptop charger, during this Covid outbreak, and didn't really expect an expedient service, due to what is happening around the world. However, I was updated and given information on a regular basis with 'Laptop Battery Shop'. When the item arrived, there was a lovely little note included (along with a complementary face mask) apologising for the late delivery - even though the item wasn't late. The product is in perfect condition, and I'm very satisfied. I will use this business again, in the future!"
        },
        {
          "Note": 5,
          "Lieu": "EE",
          "Pseudo": "Aleksandr Vedeshin",
          "Nb_Reviews": 3,
          "Date": "2021-09-23T17:20:00.000Z",
          "Titre": "A very nice store",
          "Contenu": "A very nice store. The prices are affordable. I ordered a Samsung AA-PBXN8AR 7.4V 8400mAh replacement batteries for Samsung NP900X4C. Very happy with the purchase, I recommend the laptop-battery-shopThanks, best regards. Aleksandr"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell James",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T23:26:34.000Z",
          "Titre": "Battery was as described on the site",
          "Contenu": "Battery was as described on the site. Got an email before they shipped asking for a picture on my battery connector to verify the correct item was shipped. Great follow thru to get the correct item shipped."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Schnupp",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T02:56:28.000Z",
          "Titre": "Positive experience - MSI AC Adapter",
          "Contenu": "I ordered an AC adapter for my MSI laptop, and communication with Amy has been professional and pleasant. They made sure I knew my options for the adapter I chose, and even helped remedy a mistake I made during the process. I haven't received/tested the product yet, but if it is like their customer service, I expect to be pleased. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Andrew Farndon",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T01:10:32.000Z",
          "Titre": "I tried to buy a replacement battery for my Ultrabook from the manufacturer.",
          "Contenu": "I had tried to buy a replacement battery for my Ultrabooks Keyboard from the manufacturer, with them giving very unhelpful service. It was like pulling teeth.I fortunately found Laptop Battery Shop online and contacted them.  Their service is and was excellent.  They knew exactly what I wanted, even though it is an internal battery. I bought it with free delivery.  They kept me up to date with it's delivery and answered any questions I asked quickly. It arrived early and I installed it.  I am very happy with the batteries performance.  I highly recommend their service and product."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Markus Hausner",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T06:40:16.000Z",
          "Titre": "Good service and product",
          "Contenu": "Got my battery a couple of days ago. It seems to be an original battery and everything went perfectly. Best price I found!Shipment to Germany took about 7 Day.--------------------Order Number: 10037148Date Ordered: Wednesday 27 May, 2020Lenovo Thinkpad T460s Typ 20FA Battery: ASM P/N SB10J79003 FRU P/N 01AV406NOM 11.46V 2.274 Ah / 27WhProducts------------------------------------------------------1 x Lenovo 01AV405, SB10J79003 11.46V 2274mAh original batteries (1004624)= 53.46"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Boozar Noorian",
          "Nb_Reviews": 8,
          "Date": "2020-06-18T07:30:12.000Z",
          "Titre": "I ordered a laptop charger from Laptop…",
          "Contenu": "I ordered a laptop charger from Laptop Battery Shop and their service was amazing.  They took due diligence to ensure they send me the correct part.  They did that by asking me to take a photo of my existing charger and supplied me with example photograph.  Their response was prompt, very polite and needless to say it worked perfectly well for me.  I will not hesitate to recommend them.  First rate service."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Stefan Schneider",
          "Nb_Reviews": 1,
          "Date": "2020-10-22T16:50:59.000Z",
          "Titre": "Positive experience: Toshiba PA5214U-1BRS 11.4V 3158mAh",
          "Contenu": "I ordered a Toshiba PA5214U-1BRS 11.4V 3158mAh replacement battery on Sept. 26th, 2020, and received it on Oct. 21st, 2020. The battery works perfectly. The price (= 73.68 Euros) is very convenient. The people in the Laptop Battery Shop are very helpful and answer questions within a few hours. The length of the shipping is partly due to European customs and forwarding operations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard Robins",
          "Nb_Reviews": 1,
          "Date": "2021-12-10T09:18:16.000Z",
          "Titre": "Great Replacement and Service",
          "Contenu": "The good news is that the replacement was an exactly the same as the original battery and fit perfectly.  DHL shipping seemed to take a little longer than I expected, but the battery was packaged nicely and it did arrive in a reasonable amount of time.  I am very pleased to have my Acer Switch 10 back in service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Andy",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T06:36:15.000Z",
          "Titre": "They pulled through when I really needed them",
          "Contenu": "I was looking all over the web trying to replace my laptop battery that had been discontinued. The only other website that had it in stock sent me a faulty battery. This website was my last resort and they pulled through for which I am very thankful.Ps. I will say the website could use a friendlier makeover as I feared this was a sketchy business until I received my working battery. I honestly would not have given this business a chance had I not been so desperate to replace my battery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nobody Everyman",
          "Nb_Reviews": 2,
          "Date": "2021-10-15T02:48:45.000Z",
          "Titre": "The battery was exactly what I needed.",
          "Contenu": "The battery was exactly what I needed.The only “problem” was that they could not ship priority, but they informed me the same day via email. I choose to ship with the normal priority and they refunded the priority shipping price the next day.I would shop here again if another battery dies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susana",
          "Nb_Reviews": 1,
          "Date": "2021-04-11T00:48:50.000Z",
          "Titre": "Entered skeptical. Left satisfied.",
          "Contenu": "At first, I was a bit skeptical about ordering from this site after my laptop battery gave out but it was the only laptop battery shop site that had my exact battery model so I bought it from them. From the pics and video of the battery I was ordering, I thought it was going to be a bit big from my laptop but once I received the battery it fit perfectly and my laptop finally turned back on. I was satisfied and the new battery lasts so much longer than my old one. 5/5 would recommend this site."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bettin Kurian Jacob",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T17:11:42.000Z",
          "Titre": "I ordered a battery and it arrived on time",
          "Contenu": "I ordered a battery and they even contacted me before dispatching it to confirm the correct model(actually two models exist with minor differences). This helped me to get the correct battery and it arrived on time without any problems. They even updated me on the progress of the order with the tracking number over email. Happy with their service and purchase."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Piyush Bajaj",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T08:34:41.000Z",
          "Titre": "Awesome experience, product and customer support included",
          "Contenu": "It was an awesome experience. I had a failing laptop battery and was not able to get the replacement after trying out so many places. Finally, I got the battery on this site and it was decently priced as well. The battery quality is also good. However, what I liked the most was the customer service, which was very quick to respond and help out. As I had some troubles with the local delivery carrier, I was helped promptly with this and I got the package delivered as well.  Would like to rate more than 5 stars because of the awesome customer service, but am limited to 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T05:48:59.000Z",
          "Titre": "Good and reliable vendor for replacement batteries.",
          "Contenu": "Checked availability and ordered replacement battery for Sony Vaio laptop. Payment via PayPal was reliable and battery shipped promptly and arrived in 8-10 days.Quality product to match OEM and very satisfied with service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T01:01:21.000Z",
          "Titre": "Genuine Customer Service",
          "Contenu": "Unfortunately, the battery I received was faulty. In trying to resolve, the company were very good with their communications (emails, phone calls and advice). After exploring all of the corrective options that were available, the final conclusion was that the battery was faulty. Without further question, I was offered a full refund to my credit card account - this was received within 2-days."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Allan Gaudette",
          "Nb_Reviews": 3,
          "Date": "2023-04-22T12:35:13.000Z",
          "Titre": "Great Response and Service",
          "Contenu": "Service and response from Laptop Battery Shop was excellent. Product delivery completely failed due to USPS incompetence - not as a result of anything Laptop Battery Shop did. Due to my time restrictions, Laptop Battery refunded my money quickly and efficiently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Hamilton",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T06:25:02.000Z",
          "Titre": "I highly recommend this company",
          "Contenu": "I highly recommend this company! They were very professional the product was as described they took the time with constant communication to make sure that I would be pleased what's the product and I am. And I will be using these services in the future. Thanks great product great experience. God bless"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Mui",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T20:58:01.000Z",
          "Titre": "Great customer service",
          "Contenu": "I found this site after my friend's dog chewed through my laptop charger and I wanted to get a quick replacement. They had the one I needed at a cheaper price than anywhere else I looked (Amazon, the manufacture's original site, etc.) However there were different types of input plugs for the charger I requested from their site. They even sent me pictures of the different input sizes side by side to help me figure out which one I needed. Unfortunately I didn't know because I didn't have the cable anymore, but even then they were understanding and refunded my order promptly. Wonderful customer service, will definitely come to this site first in the future and highly recommend to anyone looking"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Bright",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T00:45:26.000Z",
          "Titre": "Laptop Battery Shop had an exact replacement!",
          "Contenu": "Laptop Battery Shop was the only place I could find an exact replacement for my Onn 2in1 Laptop. It was an exact replacement and is working great a month after installing. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "H Richard Adelman",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T13:29:54.000Z",
          "Titre": "Replacement battery & Well worth it",
          "Contenu": "I went online to find a replacement battery. ALL the sites selling only had a price & no other information. Their website also pointed out that there were two types of batteries for my laptop (8 wire & 10 wire) & had a Youtube showing it.  I expected from China that it would take forever to get. I got it within 10 days & it works perfectly. And the price was great as well.  I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T19:51:49.000Z",
          "Titre": "Really good guys",
          "Contenu": "Really good guys, battery wasn't compatible with my laptop they gave me full refund no questions asked!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger and Kim Lovell",
          "Nb_Reviews": 1,
          "Date": "2020-08-18T02:23:20.000Z",
          "Titre": "Recommend--the Company went out of the way to make sure the right battery and interface was sent!",
          "Contenu": "Thrilled--the laptop-battery-shop.com connected with me several times to make sure that they would send the correct battery interface to my LG Gram--turns out the battery had 2 different interfaces--I sent pics and wow--perfect!  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Little Green Spartan",
          "Nb_Reviews": 1,
          "Date": "2020-05-25T02:00:52.000Z",
          "Titre": "Laptop battery dying",
          "Contenu": "My aging MSI laptop suffered from a expanding battery. I looked for a replacement and found this site. It had my battery, but, it not meet their specs. So, they wrote back and suggested another battery with a lightly different model number, though it was identical to the one specified. I ordered it and within 2 weeks it arrived to my home in California. This battery was perfect and the people who e-mailed me were very kind and helpful.I am a very satisfied customer and now my laptop is back in working order with a brand new battery.The people from Laptop Battery Shop really came through."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Riggs",
          "Nb_Reviews": 4,
          "Date": "2021-08-25T14:00:37.000Z",
          "Titre": "HP Envy replacement - works great",
          "Contenu": "Ordered a replacement battery for my HP Envy and this arrived in approx 2 weeks.  Their website was very informative about which battery I needed.  Fit perfect and working well.  Would order again from this site.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul S",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T21:15:35.000Z",
          "Titre": "OEM couldn't deliver, so I went 3rd party",
          "Contenu": "I ordered a replacement battery from Lenovo as I wanted 'original equipment'. However, they were unable to deliver while I waited 4 months. I cancelled and ordered from LapTopBatteryShop. They delivered in about 2 weeks. The battery fits perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T17:04:32.000Z",
          "Titre": "Battery was exactly as expected",
          "Contenu": "Battery was exactly as expected. Because there might have been a question on which battery  this was they requested a picture, rather than to blindly send a battery. Realyl quality service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Nicholson",
          "Nb_Reviews": 2,
          "Date": "2020-10-16T16:06:54.000Z",
          "Titre": "Great customer service, good product",
          "Contenu": "The battery was exactly what I needed.  The shipping by DHL was terrible.  Then they forwarded it to the USPS which was worse.  It took 15 days to get here and I paid for expedited shipping.  After the company read about my experience they refunded me the shipping cost.  Thank you Laptop Battery Shop."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Cristina Ferrari",
          "Nb_Reviews": 4,
          "Date": "2023-06-03T10:27:38.000Z",
          "Titre": "Great company",
          "Contenu": "Great company! I had a problem and thanks to Amy's tenacity (who followed me even when I was now discouraged) they solved it promptly. I am very satisfied. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sepideh Mirshahvalad",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T06:45:06.000Z",
          "Titre": "I was looking for an adapter for my old…",
          "Contenu": "I was looking for an adapter for my old laptop, I found the best price here. After ordering I was confused about the tracking, the customer service answered all my emails really soon and helped me with the new link to track. I received my parcel at the correct time and it works well."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Edward Snow",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T06:34:13.000Z",
          "Titre": "Fast shipping - best price - original battery",
          "Contenu": "The product arivved in 3 weekes ( it was christmas ) - well packed - good shipping - fast comunication on email - the battery was original and still had 83% battery charge. i recomend the seller with all my heart"
        },
        {
          "Note": 5,
          "Lieu": "LV",
          "Pseudo": "Frenks Rozentals",
          "Nb_Reviews": 3,
          "Date": "2023-04-30T10:32:03.000Z",
          "Titre": "Ordered the battery for my Asus…",
          "Contenu": "Ordered the battery for my Asus Zenbook. They shipped it in a slightly longer period than I was expecting, but their support kept me up to date every few days. If I need another laptop battery, will buy from them again. 5 of 5"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angelena Jones",
          "Nb_Reviews": 7,
          "Date": "2021-02-23T06:53:03.000Z",
          "Titre": "Glad my friend recommended them!!",
          "Contenu": "A friend of mine recommended this company to me. He's a major IT guy who works in the industry, so I trust him. I ordered a battery for my son's Huawei laptop that we bought for him about 3 years ago, and paid to have it expedited. Was I surprised when I received an email from Amy, one of their representatives, letting me know that the carrier they use to expedite their orders,was unstable and said that it would take longer to get to me. In her email she said that they would refund the expedited shipping cost I paid if I was willing to wait, or they would refund the entire cost of what I paid. I went with waiting, and the battery came within the time frame they stated. Their communication was COMPLETELY AMAZING! I would totally order from them again. Thanks Amy, for being such a nice person to deal with."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Timo Rissanen",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T09:27:57.000Z",
          "Titre": "Bought a replacement battery for older…",
          "Contenu": "Bought a replacement battery for older Amazon Kindle. Very good quality and works perfectly! Shipping took a little bit longer than expected, but no complaints. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T23:25:44.000Z",
          "Titre": "Easy Battery Swap",
          "Contenu": "I swapped out the battery for my asus Q526FA-BI7T Laptop after it had been soiled by a power surge and this website made it so easy to find the exact battery replacement I needed!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Jörgen Cáceres",
          "Nb_Reviews": 6,
          "Date": "2023-02-02T11:27:14.000Z",
          "Titre": "Delivered swiftly and exactly as…",
          "Contenu": "Delivered swiftly and exactly as expected.My battery has two connectors and they sent me the correct one even though the description currently lacks the picture."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Sorin",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T18:28:23.000Z",
          "Titre": "I am very satisfied",
          "Contenu": "I am very satisfied with the quality and the price of the product.Also, the transaction and delivery were fast, in good conditions.I wholeheartedly recommend Laptop Battery Shop."
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Roberto Gurovich",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T03:49:14.000Z",
          "Titre": "Great service",
          "Contenu": "Great serviceThey worry on precise modelo of my laptop previously to dispatch. Then seller manage to pack properly the batt to asure no custom problemsTks for all"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T17:55:14.000Z",
          "Titre": "Laptop battery arrived even before…",
          "Contenu": "Laptop battery arrived even before shipping date said it would, and was a perfect component fit for my device! It works perfectly again"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Radu Istrate",
          "Nb_Reviews": 1,
          "Date": "2020-11-13T06:30:32.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Battery arrived sooner than expected and it was exactly what I needed.A very large battery offer to cover most needs. Will order from here again when needed."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "KOBS Inc",
          "Nb_Reviews": 1,
          "Date": "2021-03-15T08:23:48.000Z",
          "Titre": "Surprisingly Fast Delivery and Knowledgeable Customer Service Agent",
          "Contenu": "Surprisingly fast delivery of my ordered laptops batteries. Also Amy in customer service is very quick to reply and knowledgeable of their products.I am placing my 2nd order now."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Hutton",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T21:53:11.000Z",
          "Titre": "Prompt and positive experience",
          "Contenu": "Very helpful in obtaining a battery that was not available in my own country. Excellent, polite and courteous service, making additional effort to get the battery to me when there was trouble with customs. Battery arrived quickly once customs prroblems had been rectified. I would recommend and will use them again."
        },
        {
          "Note": 5,
          "Lieu": "MD",
          "Pseudo": "Eloise Reid",
          "Nb_Reviews": 5,
          "Date": "2020-11-26T11:52:45.000Z",
          "Titre": "I got an excellent customer service all…",
          "Contenu": "I got an excellent customer service all year around, my battery was delivered as expected, the right and perfect battery. Thank you guys for helping my laptop live again. cheers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jess",
          "Nb_Reviews": 4,
          "Date": "2020-06-02T03:42:23.000Z",
          "Titre": "New battery, old computer",
          "Contenu": "I had to order a new battery for my stepsons computer.  I read over the internet that the laptop he had, the batteries go bad quick.  I was able to find the battery match on this site at a reasonable price.  The battery came charged and worked right away when it was put into the laptop.  The laptop was finally able to be used without being plugged in.  Awesome!  It was packaged well and arrives sooner than I thought."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "ceyhun",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T04:56:02.000Z",
          "Titre": "Satisfied purchase, nice service",
          "Contenu": "My delivery was on time even with the free delivery service and I am quite satisfied. I couldn't use the battery yet, so I can not make a review about the duration and the quality but it seems original and all the parameters on that are the same that it was given on the website. The website is trustful regarding the products, delivery and customer service. I will probably order another battery for my refurbished laptop soon. Recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "denikerman",
          "Nb_Reviews": 1,
          "Date": "2020-12-04T13:33:14.000Z",
          "Titre": "Quality Replacement Battery",
          "Contenu": "I was surprised when my Lenovo laptop battery failed so quickly. I was even more surprised a replica battery was hard to find. Lenovo didn't list a replacement. I wanted the replacement to have the exact same specs.I am very happy with the battery and service I received from the Laptop Battery Shop. The new battery came in just as ordered. I received email updates and was further ask to upload a photo of the \"plug\" as there are more than one style. The new battery weighed the same as the OEM that failed. I am confident I received a quality replacement battery.I will order from the Laptop Battery Shop in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T22:23:42.000Z",
          "Titre": "Excellent communication quick service…",
          "Contenu": "Excellent communication quick service and it was exactly what I needed.This is not my first time dealing with this company both times it has been a very good experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "david leung",
          "Nb_Reviews": 1,
          "Date": "2020-09-02T07:47:32.000Z",
          "Titre": "they back their product.excellent customer service",
          "Contenu": "i was wary about ordering stuff overseas but im glad i did. excellent customer service. battery may take a week or two but they will back up their product.i had a little mishap with my battery and Tiffany took care of it. my go to eshop for future battery needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Breezy",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T12:39:49.000Z",
          "Titre": "I am so grateful",
          "Contenu": "I am so grateful, I was able to find the battery I needed it is an Internal battery for a Dell Inspion PC/Tablet All in One. I leave it plugged in all the time so it will eat up a battery in a couple of years. I have also replaced it once. This is the second internal Battery for it. I was good with the shipping time Grateful for them having the battery nobody else had. Pricing was also really good with free shipping. Thank You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frankie Fresh",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T08:42:19.000Z",
          "Titre": "Excellent Company!!",
          "Contenu": "This company is the best when it comes to finding replacement batteries for your devices!! They are definitely trustworthy and it is easy to get a hold of someone by email for support. My Asus tough gaming a15 laptop came with a 48 watt hour battery originally and it would die so fast that it was frustrating. I found the 90 watt hour battery with the correct connector for my laptop on this website and it lasts much longer.w The price was reasonable and the shipping wasn't too bad I think it took about a week to come in. The folks that run this company are also very knowledgeable when it comes to batteries. They are also very kind and respectful. When I had an issue with a battery I bought they corrected it for me no questions asked. I would highly recommend using this site to order a battery if you need one or your friends or family need a replacement. They will definitely have almost any type of battery that you can think of in stock!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew Penson",
          "Nb_Reviews": 16,
          "Date": "2020-06-04T07:37:27.000Z",
          "Titre": "Very good service and a good battery",
          "Contenu": "Very good service and a good, and original, battery for my HP laptop. I was particularly pleased that they kept me informed of delays due to delivery problems from Covid19. I will use them again."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Pedro Hernández Ariznavarreta",
          "Nb_Reviews": 3,
          "Date": "2021-04-14T06:27:30.000Z",
          "Titre": "Replacing my MiniBook Chuwi battery",
          "Contenu": "Chuwi tech support couldn't/wouldn't replace the battery of my MiniBook which never worked since it was purchased one year ago! VERY BAD for Chuwi people  :(So I ordered a new one from Laptop Battery Shop and now my MiniBook is working fine! VERY GOOD for this Shop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2020-10-08T16:29:43.000Z",
          "Titre": "Great Customer Service Excellent Product",
          "Contenu": "I noticed my old battery was dying quite a bit sooner that It was supposed to (15-20%) and started searching for a replacement. I stumbled on to laptop-battery-shop by accident and after a bit of googling to figure out whether or not the site was legit, I placed an order. The delivery time took approximately 9 business days, well within their range of 6-12, and I'm happy to report that the battery is exactly what I expected and works just as well as the original."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T18:19:02.000Z",
          "Titre": "Laptop Replacement Battery",
          "Contenu": "I ordered a replacement battery for my laptop. It came in within about a week, was packaged nicely and worked perfectly. Would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Emily",
          "Nb_Reviews": 7,
          "Date": "2020-05-30T16:05:52.000Z",
          "Titre": "*****Top Customer Service*****",
          "Contenu": "I ordered a battery recently and whilst I didn't end up following through with the order due to stock issues, I could not go without giving these guys a great review.within hours of placing my order I have a very well toned email aapologising that they were waiting for stock and did I still want to go through with the order bearing this in mind?  Having initially responded with a 'yes I'm happy to wait' I later was able to acquire one elsewhere and emailed to request a ful refund if not too late.  I had an instant response and refund with no questions asked and a polite and professional exchange.I will definitely return to use Laptop Battery Shop in future as I value good customer service and think these guys did fabulously - especially considering the particularly tricky climate we are currently in with the Pandemic.Thanks Laptop Battery Shop. I will shope with you soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "New Customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T18:48:37.000Z",
          "Titre": "Very easy to locate the exact battery",
          "Contenu": "Very easy to locate the exact battery required for an older out of support laptop after searching many other sites that indicated a battery with the wrong voltage for my device."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jade Brais",
          "Nb_Reviews": 1,
          "Date": "2020-08-24T15:20:07.000Z",
          "Titre": "Good service",
          "Contenu": "Good service! There was a little confusion with my order, but tech support (Amy) quickly answered all my questions and we found a great solution. Sent on time and quickly, given the circumstances.I would do business with them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin Clark",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T06:39:17.000Z",
          "Titre": "I had a problem with my battery and…",
          "Contenu": "I had a problem with my battery and received a full refund without issue.  Great service.  I will buy again from them.  Purchase with confidence."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jason Bishop",
          "Nb_Reviews": 6,
          "Date": "2020-06-02T17:36:40.000Z",
          "Titre": "Needed a new battery for my tablet",
          "Contenu": "Needed a new battery for my tablet. Very pleased with the battery I received and in these difficult times the battery arrived within 15 days which u think is very good. Would definitely use again. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Gianfranco Savonarola",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T16:48:44.000Z",
          "Titre": "I received the good very fast!",
          "Contenu": "I received the good very fast!! Delivery were tracked and precise. Thank very much ! I will of course advice everyone to buy at laptop battery shop.Gianfranco S."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2021-03-20T15:52:01.000Z",
          "Titre": "I ordered a replacement battery for my…",
          "Contenu": "I ordered a replacement battery for my Lenovo laptop and my battery was delivered within one week of ordering. I am pleased with the ease of ordering and service that I have received from the Laptop Battery Shop."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "JJ",
          "Nb_Reviews": 1,
          "Date": "2020-08-23T16:08:33.000Z",
          "Titre": "Got my replacement battery quick and good.",
          "Contenu": "Got my replacement battery in good time. Just installed this weekend and brings my laptop back to 6-8 hr use per charge again! Previously, the old battery was doing less than 2 hours per charge. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Jones",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T20:19:09.000Z",
          "Titre": "Super Helpful Customer Service",
          "Contenu": "Super Helpful. Great Customer Service.  Help me locate the exact battery that I needed.  I was slow to respond but they were patient and kind.A+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MFR3",
          "Nb_Reviews": 3,
          "Date": "2022-03-07T03:48:10.000Z",
          "Titre": "Samsung Laptop Battery Success",
          "Contenu": "I purchased a replacement Samsung laptop battery from the LBS not knowing what to expect as the price was significantly less than other websites. I was pleasantly surprised by the fast shipping, constant updates/communication, and the ultimate product. I received my battery about 10 days after ordering on a weekend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharkaire Ways",
          "Nb_Reviews": 4,
          "Date": "2023-03-22T22:25:21.000Z",
          "Titre": "Great quality and quick shipment",
          "Contenu": "I order a battery for my laptop and received the same identical OEM battery very quickly. I am very pleased with the quality and quickness of the service"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jonathan Velasquez",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T05:44:30.000Z",
          "Titre": "Battery woks well, great customer service",
          "Contenu": "Battery woks well, no problems. buying is very easy and the support/service was excellent. thanks to Amy for reaching out to check on my order."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Roland R",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T08:32:28.000Z",
          "Titre": "Receiving a good product I'm not disappointed",
          "Contenu": "I received the battery and it worked perfectly. Happy to find a shop committed to an excellent service. I am planning again to order soon when need arises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Francois",
          "Nb_Reviews": 6,
          "Date": "2021-08-14T12:51:31.000Z",
          "Titre": "Dell laptop battery, recommended!",
          "Contenu": "Ordered a battery to replace the one in my Dell laptop, came in a few weeks, well packaged and battery looked like new. Recommended merchant!"
        }
      ]
    }
  ]
}