{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "lasta.app",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:11:17.000Z",
          "Titre": "Scam - won’t give refund!",
          "Contenu": "I tried the app and don’t find it easy to add foods and if you want coaching, it’s extra. Every little thing is extra. I tried to cancel since it said I had 30 days to request refund and they won’t let me cancel. BE AWARE, these diet apps don’t let you get a refund once you sign up. SCAM!!"
        },
        {
          "Note": 1,
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T14:56:46.000Z",
          "Titre": "Very disappointed",
          "Contenu": "I'm sorry to write this but I was VERY disappointed. I've spent months looking at various providers offering to help with fitness and weight loss, specifically for over 50's (which sadly I am now!). In particular, I liked the look of chair yoga. But not the gentle, soft touch yoga, I like the more strenuous exercises that genuinely look like they'll increase fitness and help you lose weight. Your advert on Facebook caught my eye, specifically demonstrating the vigorous chair yoga I described. Imagine my disappointment when I downloaded the App and the chair yoga section for men does NOT even exist. There are several ladies versions, not what I want. For males, it was traditional floor style yoga, again NOT what I wanted. After so many months of contemplating, to finally choose your product, I feel completely let down. False advertising, plain and simple. Well you've got my £30, so good for you. I've already deleted the App after less than a week and I will never look at your website or advert again. Poor. Very very poor. 😡"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry Henderson",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:53:02.000Z",
          "Titre": "Very disappointed. Feel tricked!",
          "Contenu": "I signed up for this because the ad showed what I thought were going to be daily Pilates lessons. I even got an email telling me my “Lasta Pilates 6-Month Premium Subscription was successfully activated”. However, when I went to the app, it is primarily focused on fasting. I sent 2 emails asking for a refund because I am in no way interested in fasting. I did get quick replies, but they just told me where i could access their available videos, that anyone could do them ( with doctor’s permission) and that more videos will be coming. My request for a refund was not addressed either time and the ad said there was a money back guarantee. I requested this within the first 24 hours of seeing the app and realizing it wasn’t what I was looking for. Very disappointed!Update: I was contacted by the company and issued a refund that should be available to me within 10 days.  They were very polite and helpful and they even offered me free informative information on diet and exercise."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mandy McQuaide",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T16:36:20.000Z",
          "Titre": "Waste of money!",
          "Contenu": "This app is nothing more than a glorified timer and a complete waste of money. Customer service is awful. Don't waste your money expecting a \"customized\" app experience. If you can tell time, you can track your own fast withoug paying for this."
        },
        {
          "Note": 1,
          "Pseudo": "Chloe Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T14:18:07.000Z",
          "Titre": "I could not get in the app to access…",
          "Contenu": "I could not get in the app to access the service they provide, and I could not able unsubscribe the service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cee Kesha",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T12:20:20.000Z",
          "Titre": "Faulty app",
          "Contenu": "Hi Mike thanks for responding to my emails. I appreciate your help. However, it's the app I am displease with. It is not straight forward, there is no way of knowing that it would not work effectively and efficiently with my android. If I missed logging in my food there is no way of going back to log my food. Out of all the apps there are, I am sorry I Choose this one. As for refund the policy is not clear to the public because it mentioned 14 days satisfaction and I am not satisfied with it. So I feel like I am forced into keeping an app that I am displeased with based on the solution options you have provided.I am accepting your extension because I feel like I do not have the option of a full refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lynn",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T04:57:01.000Z",
          "Titre": "Don’t know what you’re buying until you buy it",
          "Contenu": "The app asks you all the assessment questions and then doesn’t really give you a preview of what it actually does other than track fasting times, unless you pay $30 for a month trial. I’m not really sure it’s worth the money since I don’t know what I’m truly getting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Ann Bacon",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T13:44:09.000Z",
          "Titre": "Read the fine print",
          "Contenu": "My experience has been that it is almost impossible to cancel within the 14 days! Read the fine print. This app not provide a calorie count for the basic of workouts such as, yoga and Pilates. When asked, I was told to choose a workout with a similar calorie burn. It does not proved a daily food log (extra cost) after $50 annual fee. Fantastic and Noom are far superior.  In my request for a refund, they were “delighted” to offer a 2 month extension to my subscription or the option to purchase more features (many of which are included in the “free” of other apps) to help on my weight loss journey. My  experience has found this to be an inferior imitation of other fasting apps. Choose wisely."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michela",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T15:29:57.000Z",
          "Titre": "Bad support",
          "Contenu": "The app is not bad, but you cannot cancel your membership… cancel any times it is not true ..I sent different emails around 10 and the support center cannot find my account ( I also sent a screenshot of my account ) I just want to cancel my membership and don’t pay for an app that I do not use At least you don’t want Lasta application for the rest of your life, don’t sign in .It has been a nightmare It should not be so difficult to cancel a membership I never had a bad experience like that before."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Themby Ndlangamandla",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T10:56:46.000Z",
          "Titre": "DO NOT SIGN UP, this is a SCAM",
          "Contenu": "If there was zero rating, I would give them a zero. This company is a scam. I did the free trial and canceled as soon as I realized that this app is not what am looking for. I used the cancel subscription option in their app. So I was suprised to see a charge on my account.. & i wasn’t even active on the app. I don’t even use it…!! And boom $160 charge on my account!!!! $160…  I almost canceled my debit card, thinking it was a scam only to realize it’s this app. Reached out to them and a certain KATE BROWN replied.. at 1st they say I don’t qualify for a refund, then I can have 50% refund, and then  oh you can have 70% refund????? Like what is this!!! I did not agree to a partial refund as I do not even partially use this app.. 🤷🏽‍♀️. This is strait up theft. That’s why they want your banking details up front. They rob people? Stay away.****UPDATE: After writing this review, I was issued a full refund. They apologized and also promised not to auto renew further subscriptions.  Refund was processed quick. And To compensate for any inconvenience they shared comprehensive guides covering various aspects of wellness.  I am honoured they refunded and the way they handled my complaint . Hopefully this fixes the issue. I will update if anything changes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan Sipple",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T23:48:38.000Z",
          "Titre": "Beware, they try to rope you into buying more or you can’t access it",
          "Contenu": "I purchased this app two months ago, and I went in today to end my fast. It would not allow me back in until I selected a purchase of 1, 3 or six additional months. It clearly stated that my current six months does not end until August 22, but I could not move forward in the app without selecting a purchase. I contacted the company who gave me a huge amount of steps to delete and start over, etc. This is clearly a scam to get you to purchase more of their app and it’s ridiculous that you cannot get into the app without it or without going through a whole litany of steps to try to fix it on your end. The app itself is not that great anyway."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Tennille",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T22:07:29.000Z",
          "Titre": "DO NOT SIGN UP",
          "Contenu": "DO NOT SIGN UP. This ap is a total scam! They ask you to complete a questionnaire about your goals and personal information to create a custom fasting program for you… then sell you a timer. The ap is rubbish. Nothing is personalised, it’s literally just a timer. You can use your phone timer for free, and there are plenty of other free aps out there that actually offer personalised plans and helpful information. Lasta say that they offer a ‘100% money back guarantee’ that they tell you about right before you sign up, BUT they make it impossible to redeem. When you can actually look at the ap (once you’ve paid) and you see it’s trash and want to cancel for a refund (I did this within 24 hours of signing up), they refuse your refund saying that you have to prove that you’ve followed their plan for 21 days by sending them photos and videos of yourself making and eating the recipes from the ap. Which no one could ever do. So this is intentionally misleading practices by an unethical company whose only goal is to get your initial payment, then fight you when you ask for a refund because you have actually had a look at the ap and it’s rubbish. DO NOT SIGN UP WHATEVER YOU DO. You can find any of the ‘tips’ on the internet for free (and better and more useful ones) as well as better and more useful recipes that you can actually make and will actually eat. I’m so disgusted that a company would operate this way and defraud customers over and over again, as evidenced by similar reviews here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Azi Fa",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T18:10:09.000Z",
          "Titre": "The app is simple and actually nothing…",
          "Contenu": "The app is simple and actually nothing . They are lier said money back guarantee but they not even respond your email or message, no money back they are not sent my money after 2 days . Customer support service are very rude as well"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mischelle McCulloch DiCiccio",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T01:37:24.000Z",
          "Titre": "I was looking at the app and somehow…",
          "Contenu": "I was looking at the app and somehow ended up purchasing. Thought the program was designed specifically for me, it is not. It was difficult to work through and the recipes were not appealing. I emailed support within a couple of hours to ask for a refund and they told me no. Do your homework before you purchase this. Not worth your money in my opinion."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LMK Cates",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T21:54:13.000Z",
          "Titre": "I am so disappointed with Lasta's…",
          "Contenu": "I am so disappointed with Lasta's customer service.  I have been trying to cancel and request a refund and no matter what I do, they may respond but nobody is canceling or refunding anything.  I have followed all the instructions, I have provided the documents they \"needed\" and still - it's been a month and no refund.  I feel like Lasta's unavailability is very convenient for them but not a service to their customers at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pamela Breier",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T18:36:19.000Z",
          "Titre": "This app is nothing more than setting a…",
          "Contenu": "This app is nothing more than setting a timer.  I bought the program hoping to be able to log my food intake along with water.  All this app does is set your fasting time...record your water.  There is not any help with diet during the fast, except for several very complicated receipes.  You must use a second app to count your calories/carbs etc...Save your money...set your phone timer for the hours you want to fast."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Brunka",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T01:11:31.000Z",
          "Titre": "Total scam",
          "Contenu": "Total scam. Have been trying to cancel membership and unable to do so on app. Have reached out to customer service and no response. Needed to escalate through Apple. Would not recommend"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T23:24:32.000Z",
          "Titre": "Scam",
          "Contenu": "Purchased the trial and my full purchase would have been yesterday, June 28th. I've tried to cancel my subscription back in April and into May, with many, many, emails, THAT I STILL HAVE, they keep telling me they can't find my account but yet I was charged $74.98 on my credit card yesterday. I called the number and there's a recording saying they're not taking any phone calls right now!?! I'm reporting to the Better Business Bureau and put a block on my credit card for this fraud of a company.Good thing my credit card does chargebacks for scammers such as yourself, so I will get my money back.You should not have to do this with a legitimate company!!!Please do not leave a response saying, please reach out to us on our app when I have done so many many times already, including today. I'm just coming on here to let others know that this is a total scam. Not letting your customers cancel when they want to? SCAM!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "tycraw",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T01:25:50.000Z",
          "Titre": "This company is a scam",
          "Contenu": "This company is a scam.  I did the free trial in July 2023 and canceled within an hour of looking at the app.  It's basically a timer.. This was copy and pasted from their return policy: Lasta offers a flexible and convenient way of trialing the app: you can choose the price that suits you the most and use the app for one week (3 days) to determine whether or not it fits your lifestyle and needs.  First of all I canceled well within their very conflicting timeline in the app itself.  I didn't realize at the time I was charged $39.12.  Then this past week there was a charge for $83.23 withdrawn from my checking account from an unknown company.  I almost canceled my debit card.  After researching, I discovered it was from Lasta.  I never authorized any amount of money to be withdrawn.  To me, this is THEFT.  I contacted the company and was told that they never received a \"cancellation by email\" so I am not entitled to a refund.  There is literally a cancel subscription option in the app. that I utilized an hour after downloading it.  They did offer me a 30% refund of the latest fraudulent charge and a discount on their services.  I did not agree.  This is strait up theft. Please beware of this company and others that offer a free trial.****UPDATE:  After writing this review, I was issued a full refund.  I was also promised that they would remove their “misleading” trial period from the app.  As of right now, it’s still there.  At least they honored the refund. They also promised not to auto renew further subscriptions.  (I have completely cancelled several times).  Hopefully this fixes the issue.  I will update if anything changes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Schoen",
          "Nb_Reviews": 3,
          "Date": "2023-08-04T16:35:12.000Z",
          "Titre": "Horrible business practices - cancellation guarantee is a scam",
          "Contenu": "I downloaded the app for a month trial with a guarantee of cancel anytime.  I thought the app was somewhat useful but not worth paying for.  I cancelled within the first month.  I then got billed for a year a “renewal” for multiple months after my cancellation.  When I questioned it at first they said they’d cancel it and asked more questions about my account.  Then they wrote that they can’t refund the new billing because it already has been processed and they don’t give refunds.  They then said they billed me because they couldn’t find my account when I cancelled so they couldn’t cancel it and I have to pay because they already charged me despite the cancellation and they don’t give refunds. Huh?Post-script:  they wrote me now and offered a half refund.  Crazy:  they offered money back guarantee and free cancellation in first 30 days.  I signed up 7/1 and cancelled 7/30.  They sent email acknowledging receipt of cancellation and now say sorry no refund or half refund because they couldn’t find my account before they billed me the next month.  Pretty outrageous and has all the earmarks of fraud I am afraid."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Iuliana Mihaela Molac",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T15:43:49.000Z",
          "Titre": "This app is rubbish",
          "Contenu": "This app is rubbish, is stilling money from our account, you can’t unsubscribe from nowhere, you need to contact them, is not easy, because not answering quick."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Michelle Lindsey",
          "Nb_Reviews": 4,
          "Date": "2023-05-02T23:26:56.000Z",
          "Titre": "I have tried to cancel membership for a…",
          "Contenu": "I have tried to cancel membership for a couple of weeks. It won’t let me cancel. Trying to get hold of someone to help cancel it, has been impossible. They still just keep taking money for this subscription. Yet they say cancel anytime. It would be great if that were true."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ray Kash",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T08:08:13.000Z",
          "Titre": "I have been trying to cancel the app…",
          "Contenu": "I have been trying to cancel the app for a week now , and no respond, after also 3 emails. it's TOTAL SCAM, stay away from it. the cancel button in app doesn't work and they ignore your emails. fake ratings . will have to go through credit card now and it is a headache."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mikhail Salita",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T22:09:58.000Z",
          "Titre": "I just deleted this app",
          "Contenu": "I just deleted this app, after reading reviews. They should improve it and make it at least one or two weeks for free, so people can see the results."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gladys",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T23:23:52.000Z",
          "Titre": "This app is a complete scam It say…",
          "Contenu": "This app is a complete scam It say cancel anytime but doesn’t even give you the option to do so."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole Ackley",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T14:42:35.000Z",
          "Titre": "Don't buy this app until you try!",
          "Contenu": "I saw the Lasta app being advertised on social media and thought I would look into it. First off, I had to purchase a $50 six month subscription before I could do anything (even take a look at the app). I bought the subscription and downloaded the app. I immediately opened and went through the app which is very confusing with little guidance on how you should fast or even for how long. You basically just get a timer of how long you are fasting. I realized immediately that this wasn't for me so I reached out to them through their contact us for a refund, which stated that I could receive a refund within 30 days of purchase. Days later I hear back from Lasta's customer service telling me I am not entitled to a refund. I reply and tell them that I have read through their refund policy and to please explain why I was ineligible for a refund. They respond and say they will give me a 30% refund. I respond with that is unacceptable and that I wanted a full refund. They respond again, now offering me a 70% refund. I of course, wanted all of my money back, but after days and days, hassle after hassle, I just finally said refund my 70%. I just wanted others who this app may not be for to know how they are. I wouldn't buy this app or a subscription until you have a received a free trial to ensure it's worth your money. Because it definitely wasn't worth mine... not even 30% of it. Terrible business practices here!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C.Curt",
          "Nb_Reviews": 6,
          "Date": "2023-06-08T11:23:37.000Z",
          "Titre": "Definitely not what you expect!",
          "Contenu": "I purchased this app based on info in an Instagram ad.  I should know better!  I paid for a 3 month subscription which was supposed to include all the features.  There are plenty of little nuggets on fasting advice and related topics, but info provided is not of any substance and I can find better by myself all over the internet.  I can track my fast and my water intake. I CANNOT access mood tracker, activities, steps, or anything else.  I feel ripped off.  I have some of these features on my Fitbit, and I will get along without the others unless I find an app that fulfills it's promises.  I asked for a refund, but they won't do that (I have only had the subscription 3 days).  So I have told them to cancel me at the end of the 3 month period and that NO additional charges are authorized.  I think they are a fly by night bait and switch operation.  Note to self (again) NEVER EVER purchase anything based on an Instagram ad without doing due diligence first!UPDATE:  6/8/23.  I received email from Lasta offering a 50% refund if I would take down this review.  Initially I asked for a refund, and none was offered.  Prior to that, I had emailed support asking for help how to access features.  I got no response on that request.  The offer of a partial refund to get me to take down this review seems like they want to stifle my opinion.  I would hope others would have a better experience.  I also received email from TrustPiolot that Lasta was requesting my contact information to be sure I had legimately purchased, or my review might be taken down.  They have my contact, I communicated with them and they replied.  I will not be\"paid\" to take down an honest review of my experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Chiavola",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T17:10:58.000Z",
          "Titre": "BEWARE",
          "Contenu": "I inadvertently purchased this app - deleted it and there is NO WAY to cancel this or CONTACT THE  COMPANY.BEWARE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Georgeson",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T14:40:01.000Z",
          "Titre": "LASTA is a scam",
          "Contenu": "So I heard fasting might be an option for weight loss. Not knowing anything about it when I did a search Lasta came up and looking at their site it looks like there will build a personal plan for you to follow. In bold print it says MONEY BACK GUARANTEE so I figured I had nothing to loss. I filled out all the personal information and figured I would be getting a personalized plan. What I got was a suggestion that I fast for 14hr and then the app turned into a basic timer that you turn on and off... no notices no alerts... if your not opening the app to turn the timer on or off you don't even know its running. So after a day I realized this was a total waste of money so I asked for a refund. I was told I have to wait 14 days then I can get a refund... I thought this was strange but I figured it was a way for the company to try to get people to forget to come back for a refund... I waited 14 days and when I reached out again now they directed me to the fine print which say you have to follow the personalized plan (which they never provided) for the first 14days and you have to provide verification of everything what you eat when you fasted. Of course this is impossible to do so basically you pay them $50.00 for a timer.UPDATE 7/20/23I just got a replied to my review... the standard sorry for the experience... and yes I did get a full refund but only after I had filed a claim with my credit card company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kay McCoy",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T23:54:52.000Z",
          "Titre": "I don't recommend this app",
          "Contenu": "I don't recommend this app, not helpful and refused a refund"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jmenell",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T11:30:55.000Z",
          "Titre": "Not for me",
          "Contenu": "I did not find the app useful, but some might. Unfortunately they exposed my contact info to phishing scammers and all attempts to cancel my subscription within the 30 day refund period have been met with a run around of auto generated messages. The phone number they provide simply has a message saying “they are unable to take calls at this time” and refers you back to the email contact support which just creates more automated messages but does not solve issues or cancel my subscription.Update:After three days I received an email offering a 30% refund. I declined and received another email with an offer for 70%. I respectfully declined again stating my expectation from their stated offer was 100% refund. The next day they refunded 100% and I see PayPal is actually processing it. Just be aware that the fine print terms of their refund (which were not seen when signing up) are complex and bizarre including photographic proof required of the app’s failure to help you lose weight. Even then they only promise partial refund. I am appreciative they agreed to 100%."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Lorinda McKellar",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T02:38:42.000Z",
          "Titre": "Trying to contact customer service to…",
          "Contenu": "Trying to contact customer service to cancel but the Google results page(s) for Lasta look fishy/unprofessional.  Spelling errors for a site asking for me to enter my information?  Why can’t I be served by a human?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T04:58:14.000Z",
          "Titre": "New to Lasta",
          "Contenu": "I just purchased Lasta and I still cannot get logged in to the app. I am having the same issues as one of the other customers in the review with logging in and it taking me to a page to purchase more plan. This is ridiculous! I sent support an email and haven't heard back from them yet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peter Peladeau",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T17:56:01.000Z",
          "Titre": "Everytime I log in and try to start or…",
          "Contenu": "Everytime I log in and try to start or Stop fasting or log water it brings up an advertising page trying to get me to spend more money and I can't log my stuff. After spending 30 dollars already"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barnes Kayleigh",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T15:59:52.000Z",
          "Titre": "I've had an typical experience with…",
          "Contenu": "I've had an typical experience with Lasta.app that was alright. I can't say it was extraordinary, but it wsn't bad either. Practically serviceable. A run-of-the-mill performance. Nothing particular noteworthy, nothing poor. Everything was done efficiently but nothing remarkable. Carbage-in calamari-out kinda thing. Nothing stood out positively or negativley. A standard experience all-in-all."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Loren Gerlach",
          "Nb_Reviews": 6,
          "Date": "2023-11-28T14:20:48.000Z",
          "Titre": "This review can be deleted.",
          "Contenu": "They have provided a solution to my problem.  I'm trying to delete this review entirely but not finding that option."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "N. D.",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T14:39:17.000Z",
          "Titre": "My honest opinion",
          "Contenu": "Not thrilled with the cost of the program on Lasta, but very thankful and impressed with Kate from Lasta having reached out to reply to my message promptly. Need more of that kind of customer service these days from companies."
        },
        {
          "Note": 3,
          "Lieu": "PR",
          "Pseudo": "Jorge Valenzuela",
          "Nb_Reviews": 3,
          "Date": "2023-11-26T16:29:21.000Z",
          "Titre": "I’m just new to this type of healthy…",
          "Contenu": "I’m just new to this type of healthy thing so don’t quote me on my review! I will just try the exercises and after that I will leave a new review!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Imelda",
          "Nb_Reviews": 3,
          "Date": "2023-10-23T19:57:50.000Z",
          "Titre": "My experience with app",
          "Contenu": "I did not like the limited amount of offers, I was hoping to be able to get more out my experience. It was costly. The reminder could have been sent via Text which is a more of better way of reminding me I was going to be charged because the trial was going to be over. I am so unhappy about the occurring charges. My job is high maintenance and the email was not a good option to contact me. The stop and start fast is small and very difficult to get in to to add your time it was confusing. I had skipped days which made feel like I was not getting what I needed from the app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alicia Duncanson",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T00:05:28.000Z",
          "Titre": "Too simplistic",
          "Contenu": "This app over promises and under delivers. It simply tracks your start and stop times for fasting, but it does not track your meals or calorie intake, and doesn't really effectively track your progress. There are some decent articles to read but I don't think it has enough value add to make it worth purchasing. I would not recommend."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JOE FED",
          "Nb_Reviews": 5,
          "Date": "2023-07-21T02:17:15.000Z",
          "Titre": "Excitement Turned to Frustration...then Disappointment",
          "Contenu": "I was excited to get this app as I had always wanted to try intermittent fasting, and this seemed to be a good way.  I also saw that they had a 30-day, money back guarantee...so I didn't hesitate.  I should have not only hesitated, but checked out these reviews beforehand!Needless to say, I was confused with how to use the app, and like others was disappointed in the lack of other features.  So in less than a week I email support to ask for a refund.  They emailed back that they stopped the automatic subscription for me.  That was great, but I emailed back as to when I could expect my refund.  They asked why I was disappointed with the app and when I told them, they told me that I didn't meet their requirements for a refund. They gave me to option of getting free info on how to better do intermittent fasting, or to freeze my account.  I chose to freeze my account as I am using another app now...one that is easy to use and half the price!  So yeah...buyer beware. Read the fine print.UPDATE: that being said, they did specify the conditions of the guarantee which I failed to read. I've increased my review as they worked with me to refund 30%."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Lane",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T02:47:43.000Z",
          "Titre": "Sign in problem resolved quickly",
          "Contenu": "Initially after signing up for my 3 month plan I was unable to gain access to Lasta app and plan.  After contacting the Lasta Customer Service email address, I received a prompt reply and the issue was resolved in short order through my contact with Eugene Walton and finally with Michael Drake.  Thanks guys."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sullivan Hollie",
          "Nb_Reviews": 9,
          "Date": "2023-11-15T00:42:49.000Z",
          "Titre": "My ordinary experience with lasta.app…",
          "Contenu": "My ordinary experience with lasta.app is almoast good. I found thes company reliable & helpful. They provided me with several optins for solvng my problems. The customer servce was prompt & I recieved quicvk responses. The interface is well designed & made it easy to find what I needed. The proces was easier than I expected & everythng was navigable. I did have a few issues with the navigability of certain areas, but overall it was okay. My only complaint is that the loading times were a bit slow. All in all, it's been a good experiience."
        },
        {
          "Note": 4,
          "Lieu": "GD",
          "Pseudo": "Wendy Ann Garcia - Duncan",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:18:26.000Z",
          "Titre": "Prompt Refunds",
          "Contenu": "Hi, I tried the LASTA fasting plan and decided that it was not for me.  However, I got charged in error, so I e-mailed and querried the charge. I received an immediate response from service rep. Seth Barratt and was advised that my credit card would be re-funded within 10 working days.  I am grateful and very much appreciate the prompt response."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Jac Young",
          "Nb_Reviews": 9,
          "Date": "2023-11-21T21:37:10.000Z",
          "Titre": "Only just received the app today and…",
          "Contenu": "Only just received the app today and impressed with the great variety of information on fitness/health.Looking forward to using the app.Recommend!!!!!!!"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Jac Young",
          "Nb_Reviews": 9,
          "Date": "2023-11-23T10:39:55.000Z",
          "Titre": "Recently bought the Lasta App and…",
          "Contenu": "Recently bought the Lasta App and pleasently surprised by the variety of health and fitness information available.Recommend!!!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teresa Morlang",
          "Nb_Reviews": 3,
          "Date": "2023-10-17T21:31:24.000Z",
          "Titre": "Lasta is GREAT",
          "Contenu": "Lasta is GREAT!  for tracking my fasting hours and weight loss journey.  There are tons of great information on the app to read and listen to.  The only negative is navigation but I'm not very tech savvy.  However, when I couldn't figure out how to find my history of fasting hours (last week, etc.) I reached out via their Support link and got an answer right away!  And it was easy to follow their directions."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Craig Keegan",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T12:38:04.000Z",
          "Titre": "Support very responsive and accurate",
          "Contenu": "I had a glitch on my phone installation, Adam Smith was so incredibly efficient and helpful.I am looking forward to working the program and getting the results."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Meghan S",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T11:23:50.000Z",
          "Titre": "Don't like the app but service was fast and efficient",
          "Contenu": "I didn't really like the app at all. It doesn't work with my ADHD brain.I gave 4 stars, because although I unsubscribed and deleted the app almost as fast as I purchased it, I was charged again today. That being said, I emailed the company for a refund and I had my money back, assurances of my account being thoroughly unsubscribed and deleted within 20 minutes. Great service on that point!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NehaM",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T00:35:54.000Z",
          "Titre": "Lasta Review",
          "Contenu": "I used this app in order to track my water intake and to work on intermittent fasting. The use interface was very easy to learn and tracking water intake was quick and easy. I also liked how you could start and end your fast, and it would visually show your progression through the fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashby Adams",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T04:49:32.000Z",
          "Titre": "I encountered some troubles while…",
          "Contenu": "I encountered some troubles while trying to subscribe, but a support member was able to explain what I was doing wrong. Currently, I am only beginning my trip towards a healthier lifestyle, but I can already say that I feel better."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "carol andrews",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T17:38:06.000Z",
          "Titre": "24/05/24 wanted to get in shape for my birthday",
          "Contenu": "I would love to give it five stars, but really, I’m to blame there, just not being committed enough at the start! everyone should just give this a go at work it works for me when I worked it, every video explains the methods and the results you could expect to get it. The daily mood tracker helped me to understand my habits. I would recommend this site for anyone who is going to try a weight loss program, I reach my target weight. PS my iPad is playing up. This review was written on the 24th of May 2023"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ToniDolphin",
          "Nb_Reviews": 5,
          "Date": "2022-11-02T18:05:18.000Z",
          "Titre": "I have no more back pain and move around much easier!",
          "Contenu": "There's really no story to tell other than I can't leave sweets alone and I don't get much exercise. Before fasting with Lasta I thought I'm doomed, but I read some reviews and decided to give it a shot. So, I passed the quiz to get a personal IF program with different fasting windows, it was created for my body type. So, I followed that program and lost almost 50 lbs! I have no more back pain and move around much easier!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lizet A. Holguin",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T07:45:41.000Z",
          "Titre": "It is a good app if the subscriber follows instructio s.",
          "Contenu": "I like the idea that I can monitor my efforts to gain a healthy weight.  I began by answering the questions and loging in my initial weight and my weight loss goal.  The app was quick to figure a timeline that would help me reach my goal if I follow the instructions correctly.  I really liked that it provides a way to log my fasting time.  This is important to me because I tend to pick at foods.  Seeing the different recipes is great because I don't always think of healthy foods.  *Idea* It could be a neat idea to help subscribers by allowing them to also post recipe ideas and have someone review these and give input.  The cost is given in 3 forms.  That is helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jordan Signorelli",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T18:48:24.000Z",
          "Titre": "What makes this app great is…",
          "Contenu": "What makes this app great is having food option and recipes at your fingertips.I also really enjoyed the affirmation section to keep a positive mindset while going through a new journey.Having the direct feedback of how many hours and the underlying benefits of fasting was helpful to keep me engaged."
        },
        {
          "Note": 4,
          "Lieu": "QA",
          "Pseudo": "emad ali",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T17:21:26.000Z",
          "Titre": "I'VE downloaded the app",
          "Contenu": "I'VE downloaded the app , and I found out that it's not about just training to lose weight but also eating habbit  and meals .My consideration is how far I can stick to the plan"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "N Griffiths",
          "Nb_Reviews": 4,
          "Date": "2022-08-29T12:53:14.000Z",
          "Titre": "I absolutely love the shopping list…",
          "Contenu": "I absolutely love the shopping list feature. The interface is fun, friendly, clean, and intuitive. If more of the diet programs had an option for pre-planned menu and shopping list, this app would be full-on perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reuben Boyd",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T08:11:26.000Z",
          "Titre": "I tried several apps before but I…",
          "Contenu": "I tried several apps before but I wasn’t able to keep my results. This app Lasta is different. They teach you how to build the right habits in your lifestyle, and as a result 30 lbs lost in 4 months. It’s not fast but for me saving the result is more important."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chocobks",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T23:38:48.000Z",
          "Titre": "Great for bariatric patients",
          "Contenu": "This is an amazing app for anyone who wants to do a reset for your pouch (bariatric patients)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Imelda",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T15:14:52.000Z",
          "Titre": "I am glad to have gotten some of my…",
          "Contenu": "I am glad to have gotten some of my money back. The app is not for me. But I can still see how it can work for some. I received some of my money back. I am glad for that."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Lauren Jane Hayes",
          "Nb_Reviews": 3,
          "Date": "2023-05-24T13:26:54.000Z",
          "Titre": "Good concept but confusing at the end…",
          "Contenu": "Good concept but confusing at the end when it takes you to automatically make a payment"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Javaria",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T23:21:07.000Z",
          "Titre": "Fasting made easy",
          "Contenu": "As a Muslim who fasts spiritually, I found this app quite handy so I have been using it to fast for the health benefits and its quite easy I like the notifications of when to eat and when to fast also like the recipes on there looking to try the granola bar recipe."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Miss TAYLOR",
          "Nb_Reviews": 5,
          "Date": "2023-08-07T15:59:50.000Z",
          "Titre": "A great app for fasting",
          "Contenu": "A great app to help get started with fasting and a push for me to lose weight! Easy to use and some good features to get started"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charlotte Jones",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T13:27:14.000Z",
          "Titre": "It works for me",
          "Contenu": "It works for me, but I was expecting more variety in the recipes (taking into account cultural differences in meals.)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Md Sohan",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T08:17:15.000Z",
          "Titre": "40 pounds lost in 2 months!!",
          "Contenu": "40 pounds lost in 2 months!!! THANKS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sayvion Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:16:27.000Z",
          "Titre": "10/10 weight loss app must download.",
          "Contenu": "This app is great for those looking for assistance in their Weight loss journey! It has everything, from dietary aid, a water intake tracker, A variety of workouts to choose from that track the calories burned from it, A daily step tracker/goal, and a activity tracker to make sure your active on you journey to a better physique. They teach you how to be mindful on your journey an the importance of a healthy diet for the best results. Overall this app is very helpful for anyone who needs assistance with losing weight and dont know where to start or get it from. Download Lasta!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Wilkerson",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:45:40.000Z",
          "Titre": "Thank you Lasta",
          "Contenu": "Having recently lost over 50 pounds due to illness, most of my muscle was lost. I also have some back problems, so alot of exercise are difficult. The Lasta App has a lot of low impact chair and wall exercises that I am able to do comfortably and take very little time out of the rest of my day. It's just been a few weeks, and I'm feeling stronger every day. I'm also getting more flexibility with the chair yoga. Thank you nice people at Lasta for helping an old man feel younger."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Biviana Arenilla",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T14:03:27.000Z",
          "Titre": "No more frustration for losing weight!",
          "Contenu": "Lasta has been a game-changer for my weight loss journey. The app's features, from meal tracking to workout plans, have been instrumental in helping me reach my goals. The user-friendly interface and personalized recommendations make it easy to stay on track. I highly recommend Lasta to anyone looking to lose weight effectively. It's a 5-star app! My only small recommendation would be to add more diverse workout options to cater to different fitness preferences. Great job, Lasta team!"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Abeselom Yosef",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:33:45.000Z",
          "Titre": "Game changer",
          "Contenu": "Lasta Healthy Weight Loss is not just an app; it's a holistic approach to weight loss and a healthier lifestyle. Its personalized plans, diverse and delicious recipes, tracking features, educational resources, and supportive community make it an invaluable tool for anyone looking to achieve and maintain a healthy weight. Lasta Healthy Weight Loss has truly been a guiding light on my path to a fitter and healthier me."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Trung",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:34:03.000Z",
          "Titre": "Wow, amazing app🤩🥰🥰",
          "Contenu": "Wow, this is amazing app for healthy scounting daily that i'm looking for. It's really easy, clear and nice while using. Thanks to app to keep my body fit. I will use it every single day. Thank you so much( slight_smile🙂🙂😀😃)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Alvarez",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:48:25.000Z",
          "Titre": "Supercharged app for maximum results",
          "Contenu": "To begin with, I absolutely love how easy it was to setup my profile. The prompts were easy to understand as well as illustrated. It gave me confidence to see that they have stats featured which let me know that others have been successful using the app to reach their weightloss goals. Setting the fasting level as a first step communicated to me the importance of fasting, which matches what I’ve heard online. I also like that notifications were suggested but not pushed on you, but were helpful to keep me engaged in my weightloss journey.One of my favorite things was that the app did not push a certain diet. Instead it allowed me to choose an option, which is great for those who have their own preference for meal planning. One of my favorite things is that this app plots the timeline in which I can expect to plot my goal. That is amazing!The Learn Today feature allowed me to learn about why I feel hungry when I do, what to drink while fasting - which is truly helpful, and helping me differentiate moods from emotions. I enjoyed the healthy food for busy people section, which gives you viable options to eat healthy while on the go. In all, I would definitely recommend this app to anyone looking to take control of their health and lifestyle and reach their weightloss goals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HEATHER STEWART",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T18:22:55.000Z",
          "Titre": "I'm really excited to try this app",
          "Contenu": "I'm really excited to try this app. I think with the notifications and such, it should be really easy to keep on my fasting schedule and lose the weight."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Vishvesh Khandpur",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T00:19:11.000Z",
          "Titre": "Mind blowing app!",
          "Contenu": "Lasta is a fantastic resource for me as I pursue wellbeing! This app promotes a healthy lifestyle rather than just helping users lose weight. Lasta is unique in that it takes a comprehensive approach to weight loss. It stands out in a sea of fitness apps thanks to the combination of customized meal planning, exercise regimens, and mindfulness exercises.The meal plans are tasty and varied, meeting a range of dietary requirements without sacrificing flavor. The grocery list tool is incredible, and the recipes are simple to follow! Everyone can benefit from the workout routines because they are customized based on each person's degree of fitness.Lasta's emphasis on mental health is what I like most about it. I've been able to maintain my focus and optimism thanks to the motivational advice, mindfulness exercises, and meditation sessions. The app's community support is also excellent; people encourage one another and share stories, which fosters a sense of camaraderie that keeps me motivated.Navigating around the user interface is simple and easy because of its clarity. Regular updates and feature additions demonstrate the developers' dedication to improving user experience.All in all, Lasta is a partner on my path to a healthier and happier life—it's more than simply a weight reduction app. Strongly advised for everyone searching for a holistic approach to healing."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Kaung Thike",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T10:49:16.000Z",
          "Titre": "It’s a great app",
          "Contenu": "It’s a great app. First of all, the UI,UX of the app is very cool and user friendly. And they have cool gadgets to track your fasting or activities for IOS too. They provided me very good instructions for workouts. I connected Lasta with Apple health for more further functions. Everything worked well. Excellent App!!"
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Sandra C.",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:01:16.000Z",
          "Titre": "Great app to help you maintain your healthy lifestyle!",
          "Contenu": "It's a great app that will support your healthy lifestyle! It's easy to use and intuitive. You can track your fasting hours, your weight and water intake, you can go through daily stories and read useful tips on various topics regarding healthy lifestyle. There are also useful articles you can read and various mini videos you can watch and educate yourself on healthy lifestyle. Recommended!"
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "stanislava kuharski",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:00:16.000Z",
          "Titre": "The team really cares about the…",
          "Contenu": "The team really cares about the customers' experience in using app, their progress and satisfaction.Recently I had some difficulties managing starting steps and Kate, from customers' service helped me with fast, professional and useful guiding.Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon Marshall",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:41:19.000Z",
          "Titre": "It's a 5/5 For Me!",
          "Contenu": "I recently downloaded this app and can’t stop using it. It’s very easy to navigate and helpful when it comes to logging my food intake. I was impressed with the several different health resources Lasta provides for users - from video-guides, fasting basic information, and mini-health courses. There are a lot of really great workout instructional videos as well. The pilates videos have soothing music to go along with the videos. I would recommend this app to my friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Belknap",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T21:56:04.000Z",
          "Titre": "OFF TO A GREAT START",
          "Contenu": "The past 4 or 5 years I have struggled with taking off 35 to 40 pounds.  I went 65 years or so never having to struggle with my weight, able to eat what I wanted/when I wanted!  The last 10 years, however, little by little, the extra weight has caught up with me.  I have reviewed several IF plans recently and settled on Lasta.  So glad I did!  At enrollment, I encountered technical issues in activating the Lasta app.  I reached out to Lasta for help.  Michael Drake from Lasta reached out to me, identified my technical issue, and within minutes opened the world of Lasta on my very own IPad!  What a wealth of information and services at my fingertips!  Spent a couple of hours just exploring!  I’m so grateful that Lasta also knows the value of excellent customer service.  Michael Drake, thank you so much for the “key” to the Lasta world!  Can’t wait to get started!"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T15:29:37.000Z",
          "Titre": "Fast and convenient service.",
          "Contenu": "Adam was very fast addressing my questions. Even Lasta was not a perfect fit for my type training, Adam give some options including how to opt out. Really nice service"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Thea K Wold",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T22:20:37.000Z",
          "Titre": "It was so much easier than I thought it would be!",
          "Contenu": "Lasta made it easy to understand! I've never really understood what fasting is, and or how it works, but after giving it a go over the weekend, trying out the different features in the app, I'm genuinely surprised.It wasn't as hard, or as difficult as I thought it would be. The app is super easy to navigate, and has many different features, like daily meditation, daily tips, recipes, workouts, weight loss hacks and affirmations. My favorite feature has to be the recipes, and the workouts. The recipes are simple, it makes it easier to make healthier foods, cause we all know how boring that can be. The workouts in the app surprised me, as you can easily get a full body workout done in 10 minutes! I'm gonna keep going with this, and I'm excited to see results, both physically and mentally! If you're curious I recommend trying it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Hale",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T06:06:32.000Z",
          "Titre": "I have been so pleased with the speedy…",
          "Contenu": "I have been so pleased with the speedy response and solutions offered whenever I reach out to customer service regarding questions about the app.  More companies should operate in this manner! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jacob Bracey",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T10:41:51.000Z",
          "Titre": "Actually love this app!",
          "Contenu": "Actually love this app!  Very easy and intuitive to use, the calorie counter is the best I've used.  But also it's quite comprehensive in that it tracks all your metrics even mood and water intake, which is great.  It's good for a simple fasting timer app, or you can go deep with it and use it as a comprehensive detailed weight loss partner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "johnny nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:11:27.000Z",
          "Titre": "Definitely recommended, especially for beginners.",
          "Contenu": "Before I discovered this app, my dieting plan was a bit of a hassle for me. I was hopping from other apps to websites in tracking my activity, calorie intake, my steps, trying to research meal plans and educating myself in the science of nutrition. When I happen to find this app called Lasta, I was curious to try it as it seems promising in simplifying my weight loss journey. And it truly did. From my experience through this platform, I was able to already see great results within a week of losing 1.5 Ibs. 2x easier.Not only was it very easy to navigate and convenient as everything that you need to achieve your ideal physique is in one place, but they also focus on how to exponentially promote your wellbeing which helped me in developing great self-care habits to become a better version of myself like meditation, doing affirmations, stretching, reading, running, etc. There are many components implemented in the app that has skyrocket the way I have been planning my health. From the daily stories & tips that are highly educational, to daily weight / mood / calorie / fast tracking, planned work-out exercises, and meal plans customized for my calorie goals, it all kept me accountable, informed, and thriving with ease. I feel like without this needed support, I wouldn’t be as consistent in my journey. This platform also saved me so much of my time from having to switch from app to app, website to website and I can now use all of that time that could’ve been wasted researching everywhere to pursue my dreams and work on personal projects. My favorite feature that they provide is that the moment I opened my phone, my fasting tracker pops up at my Home Screen reminding me to be more disciplined and motivated. And also they provide easy and simple healthy meals that are calorie-friendly, inexpensive, healthy in nutrients, and TASTY. (Which I think is the most important part of any meal)The only drawback I could think from this is that their fasting period timers do not go below 12 hours. So if you feel that you can’t fast for half a day, then you may have to stop the timer yourself if you need to. But other than that, most elements in the app are solid.If you either struggle in managing/monitoring your fitness journey or want to start losing weight in a more efficient way, I would recommend Lasta. They have all of the essentials that you need to kickstart your journey all in one app to becoming a more lean and fit person. Don’t worry if you think it may not be a good fit for you, it’s really beginner friendly and offers plans for everyone as your specific goals and plans can be tailored for your needs. I highly suggest in trying it out to. 💪"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "KT",
          "Nb_Reviews": 5,
          "Date": "2023-12-07T01:43:09.000Z",
          "Titre": "We really didn’t believe …",
          "Contenu": "We really didn’t believe intermittent fasting would work. We started with a 10 eating and 14 fasting schedule. Within a week we had adjusted to the schedule. We took some advice from the meal plans (didn’t care for some) and noticed small amounts of weight loss.Two weeks in greater loss and we adjusted the schedule to 8 eating 16 fasting. That was harder but it worked.No more heart burn and what we called “belly full of puke” syndrome.Been 4 months and I’m down 22 lbs, my wife is down 41lbs. Felling healthy, enjoying meals and sleep100% better.Worth the effort! Even the days we were out with friends worked - we adjusted our schedule to fit the day."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T15:11:09.000Z",
          "Titre": "Initially I could not get into the app",
          "Contenu": "Initially I could not get into the app, for some reason the link I received was faulty. I was extremely frustrated and Kate from the team was unbelievably helpful and patient and got everything sorted and back on track. Great support!"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "hafizh ghifari",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:43:12.000Z",
          "Titre": "This is amazingg",
          "Contenu": "This application is fantastic. I urgently require a reliable weight management strategy. The app aids me in maintaining a harmonious nutritional balance throughout the day and allows me to organize and record dietary details in a systematic and polished manner. I plan to persist in utilizing and suggesting it to my pals."
        },
        {
          "Note": 5,
          "Lieu": "TZ",
          "Pseudo": "Patrizia Ponti",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T11:35:11.000Z",
          "Titre": "Great Support Team",
          "Contenu": "The app is not fully updated to Android, so I reached out asking for the missing features. Michael Drake from Lasta- has been super helpful in letting me know the status of the progress and how they can help while I wait for the app to be updated. I appreciate the good customer service and sense of security. I am definitely looking forward to having full access to all features soon and I trust Lasta will stick to their word. Thanks again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T18:06:51.000Z",
          "Titre": "Super Awesome Fasting App",
          "Contenu": "Wow! This app is an amazing tool for calorie tracking and water intake. I am new to fasting and have been very hesitant to try it out. Lasta could not have made a more user friendly introduction to the process. The premium account provided daily work outs and motivational information encouraging my success."
        },
        {
          "Note": 5,
          "Lieu": "MK",
          "Pseudo": "Stefan S.",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T13:56:36.000Z",
          "Titre": "Great App!",
          "Contenu": "Lasta, in my opinion, is one of the best apps for fitness enthusiasts and biohackers out there.It’s not just a fasting tracker app. It’s a health app with many features like tracking your food and water intake, weight tracker, activity and mood tracker, and many others. Also, I love how they offer personalized plans and give you daily tips on becoming healthier. You can learn a lot by following their daily tips and health quizzes. It has a user-friendly interface, and its customer support answered my questions in a matter of minutes. As a fitness fanatic and biohacker who has tried all of the fasting and fitness apps, I can say that Lasta is my favorite one so far.I highly recommend it, 5 out of 5!"
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Elena N.",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T16:55:08.000Z",
          "Titre": "An app that delivers on its promises",
          "Contenu": "An excellent application, which is easy and convenient to use!For me it was important to find a way to track my fasting and using Lasta is a pleasure. There are multiple features, which can be used, that include adding your mood, tracking your weight, water intake and fasting hours. There is also extra content, where you can find great advice for managing your mental and physical well-being. In my opinion, the best one was the Food Diary, where I could keep track on my calorie intake, just by adding my menu for the day.I would strongly recommend this application to anyone who has a busy lifestyle, but still wants to take care of their body and mind."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "ly",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T17:02:17.000Z",
          "Titre": "This is not just a lifestyle improvement app but it is a treasure trove of knowledge for your lifestyle",
          "Contenu": "Everything has become easy for me, thank you very much! I had a difficult time because the pressure of work made me gain a lot of weight. I tried making a daily exercise plan and intermittent fasting but eventually stopped because I felt too lazy to write down every little thing I ate. I tried to remember what I ate but ended up forgetting. I needed it to track my progress in keeping my health balanced until I found this great app. It makes it easy for me to jot down everything I'm too lazy to do in a day, and the app has tons of relevant exercises so I don't have to search. I was surprised. Now, I just open the app and start working out without any more delays. I highly recommend it to those who want to maintain their diet and monitor their health without the hassle of planning and finding workouts."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Minh Tien",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T07:03:05.000Z",
          "Titre": "This app is amazing",
          "Contenu": "This app is amazing. I am in dire need of an effective weight loss plan. This application helps me balance the nutritional intake of food during the day and the ability to store diet information in a methodical and professional way. I will continue to use and recommend to friends"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kirk Myers",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T00:57:47.000Z",
          "Titre": "The App has been very helpful with Keeping me on Task and on Target.",
          "Contenu": "The App has been very helpful with keeping me on-task with my fasting - Before I bought the App I thought \"How hard can it be to keep track of not eating\", I quickly learned that it's pretty hard.  It is way too easy to get distracted into forgetting when I started and when to end - Before the App there were days I thought I had gone 18 hours and ate at 12, and days I thought it had been 12 hours when 20 had passed, neither was good for MY fasting.All the other features like that sharing I.F meal ideas, Physical exercise ideas, and mental support were all very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb T",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T06:54:24.000Z",
          "Titre": "Quick Customer Service Support",
          "Contenu": "Right out the gate I needed assistance from customer service and within 24 hrs., I received an email from Eugene with simple, easy to follow instructions which took care of my problem right away. Thanks Eugene for responding so quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Marrone",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:29:52.000Z",
          "Titre": "Alice got back to me right away...",
          "Contenu": "Alice got back to me right away and answered all my questions and concerns! I'm excited to see how much weight I will lose! Customer service is amazing when you receive such a quick and thorough response back so quickly especially when you are using an app and not actually talking to a live person. I know if i have any further questions, I can look forward to Alice getting back to meThank you for making this journey enjoyable!Angela"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Melanie Kraemer",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T14:39:19.000Z",
          "Titre": "Fantastic Support!",
          "Contenu": "Adam Smith from Lasta Suport quickly resolved my issue. So helpful and friendly. Definitely exceeded my expectations of customer service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Harkaran Hothi",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T04:56:56.000Z",
          "Titre": "I'm an individual who had it all",
          "Contenu": "I'm an individual who had it all, long workouts, runs, juice cleanses, but it just didn't \"work out\" the way I wanted it to. I kept bouncing back to binge eating on the sofa and gained back my fat pack. However, Lasta let me get a grasp on my health through their timers, tracking, and ultimately recipes, (FYI I'd recommend the Cherry-spinach smoothie). So if your on the fence of getting it or upgrading to a plan, take my word it will be the key to your weight loss journey!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Eoghan Harris",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T22:39:57.000Z",
          "Titre": "Fast response",
          "Contenu": "Apart from the product the most important thing for me is a fast and friendly response to my queries. Eugene Walton responded almost immediately and stayed in close contact until was happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc Gorenstein",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T17:45:30.000Z",
          "Titre": "Prompt response from Adam Smith",
          "Contenu": "I signed up for Lasta, installed the App and couldn't log it. I sent an message to Lasta support, and Adam got back to me within the hour!  I followed his instructions, and was able to access my account.  I really appreciate the prompt response and the fix to the problem."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Yeni",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T18:32:42.000Z",
          "Titre": "Helpful app to stay committed to intermittent fasting",
          "Contenu": "I've been trying to lose weight healthily and decided to do intermittent fasting. However, I'm having trouble with keeping myself committed to the diet. Lasta came up with a solution to help track my fasting journey in the most fun way possible. The app uses a timer to show how long my fasting goal is and when I can eat again. I can edit the fasting goal anytime I want. In addition to that, the app gives tutorials for first-time users, as well as meal plans personalized to my fitness condition and articles to boost my knowledge about intermittent fasting. The app also tracks my mood and is able to connect to Apple Health App to track my exercise activity. Can't recommend it enough!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Edgar Juárez",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T17:44:48.000Z",
          "Titre": "A perfect choice",
          "Contenu": "Definitely a lifesaver. When I wanted to take control of my life in terms of diet and exercise, I felt overwhelmed with options, but this one is perfect for me. What I like the most is its user-friendliness. Furthermore, its progress tracking is exceptional. For now, I will continue using this app."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chrlotte",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T14:09:12.000Z",
          "Titre": "the best fasting app out there....",
          "Contenu": "I seriously believe that this is the best fasting app there is out there. It has everything you could possibly need, it has nutrition plans which include full meals, a workout section and loads of valuable lessons and stories about health in general. And that isn't even the main fasting bit!! The main fasting bit is unbelievable and it really makes it hard to fail. I had never previously been able to succeed when it came to fasting but this app has been an absolute game changer, I couldn't recommend it enough! Unbelievable!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Edward Reader",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T18:59:24.000Z",
          "Titre": "Satisfaction Guaranteed",
          "Contenu": "My reaction to Michael Drake's (Lasta) response to my request for a refund.If I'd taken the time to read the contract I would have realized a full refund is not possible. My fault.However, I was offered 3 offers that included a 50% refund, two extra months to my current subscription and access to exclusive content on their premium  portion of the app. I accepted all three offers and consider this the BEST  customer service with my absolute satisfaction. Thank you Lasta. Now if I could only get into fasting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Spurling",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T13:54:36.000Z",
          "Titre": "Seth with customer care took care of my…",
          "Contenu": "Seth with customer care took care of my issue in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kevin Barkman",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T09:55:40.000Z",
          "Titre": "Helpful for health and performance.",
          "Contenu": "I am a semi professional athlete who has been trying with very little success to fast for the past several years for health reasons. I have the premium version of this app and it has really helped me keep track of not just my fasting but other aspects of my health as well. The simple layout and timer shows exactly how long I have been fasting, and how long my last fast was, as well as including other data such as mood, weight, and water intake. with such a busy life this helps me keep track of everything and make good progress."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Vizitiu Ruben",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T20:10:27.000Z",
          "Titre": "I really enjoy this app",
          "Contenu": "It's been a week since I use this app and in my surprise, my sleep quality has improved.Eating and preparing food has never been easier and enjoyable for me personally before Lasta.If you are looking for a healthy lifestyle, they kinda have it all, from tasty meal recipes to home exercises you can do every day!I really reccomend this from the bottom of my heart ♥"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cliff Alston",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T07:28:36.000Z",
          "Titre": "I couldn’t find what I saw in the…",
          "Contenu": "I couldn’t find what I saw in the advertisement so I wrote to customer service. Before I could blink Alice Wood had replied to my question and guided me where I wanted to be. Alice was nice and helpful, I am very pleased the way I was treated."
        },
        {
          "Note": 5,
          "Lieu": "AL",
          "Pseudo": "Best In The World",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T12:16:06.000Z",
          "Titre": "A great app for your health.",
          "Contenu": "A great app for your health.I was looking forward to finding a good way to track my diet and this app was brilliant for the job.It helps with fasting , keeping track of calories, and water consumption.Has different recipes depending on the kind of diet you need, and a section dedicated to tips about physical and mental wellness.A must have if you want to take care of yourself!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Gabriele Battaglia",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T17:26:54.000Z",
          "Titre": "Best FASTING/HEALTHCARE APP",
          "Contenu": "After discovering amazing fasting benefits I tried a lot of apps to manage and motivate me. This is absolutely the best app I have tried so far. The stories function is awesome, it works as a daily reminder about every health-care habits, I struggled so much to keep me motivated and disciplined through the time, this app gave me the necessary motivation to not give up. Other useful functions such as meal planning and yoga workouts make it perfect."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Chiara",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T13:39:03.000Z",
          "Titre": "I lost 5kg in 2 weeks thanks to this app!",
          "Contenu": "Lasta has been a total game-changer for my health and wellness journey.I always wanted to try something like intermittent fasting but I always struggled for one reason or another.I found this app and I decided to give it a go.Actually I found myself really good with it because it allows you to check your mood, fasting hours, water intake and other things so it kind of make it a game.I honestly like the interface and the colors as well.I bought the premium access and I honestly have to admit that my money was  very well spent. I lost 5kg in 2 weeks and this helped me stay motivated.Highly suggested!It could be improved by adding the possibility to talk directly with a nutritionist via the app but this is just my opinion"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "João Calderaro",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T22:59:53.000Z",
          "Titre": "Best health app ever!",
          "Contenu": "This is not only the best guide for fasting healthy: it is a powerful life-changing tool which provides useful insights and content for a whole well-being state: mind and body, connected. I was looking for a fasting app when I found Lasta and I’ve decided to try premium. Certainly, it was one of my best decisions. Not only it helped me eat healthier, but also shown itself as an excellent fitness app: the workouts are so amazing and everyone can do it alone, at home and even without equipments. Further, the app is very similar to social networks, but acting in a worthy way: you’ll find motivational content, such health tips and tricks, courses and a lot of things to get us better than yesterday. Calisthenics workouts would make it even better, but I’m not afraid to state: I’m fully satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Swaa Heli",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T18:49:16.000Z",
          "Titre": "Good App to track your fasting",
          "Contenu": "Good App to track your fasting , great way to also monitor you water intake . When needing support, Michael Drake was helpful and quick in responding my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexandria Hampton",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T17:52:29.000Z",
          "Titre": "Alice W support",
          "Contenu": "Alice W. from their support helped me with an issue. She consistently responded more quickly than any interest support I've ever experienced. Also she was efficiently helpful. It was a great experience."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T15:38:54.000Z",
          "Titre": "Lasta is excellent",
          "Contenu": "Lasta is excellent. It gives you all the information you need to lose weight, you can easily track your calories. And to top with that, there is everything you need to know for your general health and self care."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Marcell Tóth",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T15:28:05.000Z",
          "Titre": "My goal was to find something that…",
          "Contenu": "My goal was to find something that gives motivation, and I found the lasta. and it not only gives motivation, but it also gives divine recipes and training plans, so that if you haven’t been able to lose weight so far, now it will definitely succeed."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Ursu Tudor",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T19:25:21.000Z",
          "Titre": "Amazing app for a healthier lifestyle",
          "Contenu": "It's a great app, very easy to use for anyone who wants to lose weight or lead a healthier lifestyleThe food plans are very well structured and the personalized tasks give very good returns"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Şerif Ali Atici",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T12:18:31.000Z",
          "Titre": "You're great, Lasta",
          "Contenu": "I have a really busy life. I do a lot of things in one day and it can be really tiring and exhausting.  It makes me eat irregularly, it disrupts training. .  I knew that intermittent fasting would protect my health and my performance, but I was new to it and I didn't know where to start. Lasta is a great system to start and progress. Lasta's practices and suggestions are really nice. The interface is easy to use, fluid and fun. I can track my fasting and training very well. Also, seeing other users motivates me and helps me to get better. Thank you Lasta for the beauty and balance you bring to my life."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Monika Klaudia",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T04:55:01.000Z",
          "Titre": "Easy fasting and nutrition tracking",
          "Contenu": "Lasta is a great way to keep track of your fasting and nutrition. I enjoyed the fact that you can track your fasting period for a detailed view of how well you're sticking with your goals. There are also motivational \"stories\" you can view each day on topics you're interested in like meditation, self-care, nutrition, stress relief etc. Finally, the app creates a meal plan for you based on your health and fitness goals with daily recipes for breakfast, lunch dinner and snacks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terrence Franklin",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T20:49:13.000Z",
          "Titre": "The customer service delivered by Mike…",
          "Contenu": "The customer service delivered by Mike and his team was excellent! Moreover, the App was very easy to use and the additional resources were on point."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Dasuni Dissanayaka",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T23:08:00.000Z",
          "Titre": "Amazing application",
          "Contenu": "I really love this workout app called Lasta.When I first started working out daily, Lasta workout app was my go-to app, the best thing was my bestfriend was also using this and that’s how I found this. This app provides various workout programs such as bodyweight exercises, high-intensity interval training, cross-training, body shape exercises, core exercises and expert health tips and great nutrition meal plans to keep you on track. Also they’ve lots of stories for our mental health and also relief from our stress as well. I really love this app because I can see some progress with my body shape now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trisha",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T14:36:21.000Z",
          "Titre": "Lasta made me realize…",
          "Contenu": "Lasta made me realize I need more than a glance at the clock to be successful in my fasting journey.  In just a few days I have learned why and how intermittent fasting works for me and how to maintain fasting as a lifestyle but in a healthy way.  It's not about starving!  My favorite part of Lasta's support is the recipes:  Zucchini cocoa pancakes, that's about all I have to say.  The many trackers help keep me honest and the motivating content keeps me forging ahead.  I'm Lasta for life."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Emily Crowe",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T15:42:14.000Z",
          "Titre": "Great App",
          "Contenu": "The app has lots of different features to help keep on you track. As well as being able to log your fasting hours, you can add water intake and sync the app to apple health to track steps. There is a really nice interface with stories containing affirmations which are great motivation. It's nice that so many features are in one place and avoids the need to use multiple apps!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew Griffith",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T14:30:23.000Z",
          "Titre": "Comprehensive Lasta app",
          "Contenu": "This app provides a comprehensive fasting and weight goal experience, once you figure the app out. It took me a while to figure the app out; it was confusing at first. But after using it for a few days I found it very helpful in my quest to better overall health. It is a wonderful first step in learning how useful responsible fasting can be. The daily stories, meal planning, and short recipe videos are excellent!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "lawrence lee",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T03:16:46.000Z",
          "Titre": "Great way to monitor day to day health habits",
          "Contenu": "Wonderful app for tracking fasting window and health in general. I’m not a huge work out guy but this tracks water intake, fasting windows with reminders and activity levels. The articles and stories are great reads too. Very insightful and I learned some of the reasoning/science behind certain fasting practices. Definitely made me more conscientious of my daily health habits."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shy",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T18:52:14.000Z",
          "Titre": "I have tried several fasting apps and…",
          "Contenu": "I have tried several fasting apps and this one by far is the best! And their customers service is excellent. Mike was extremely helpful!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Adrian",
          "Nb_Reviews": 16,
          "Date": "2023-09-15T07:28:03.000Z",
          "Titre": "Well balanced",
          "Contenu": "Balanced app to manage fasting and lose weight.  There are lots of helpful functions including meal planning and recipes.  The daily affirmations and self-care advice have been motivating.  I also enjoyed the health-related articles on fasting, nutrition, self-care and managing stress.  There is something for everyone so be sure to give it a go."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Ilja Sticker",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T18:03:28.000Z",
          "Titre": "Very good app for dieting!",
          "Contenu": "I have used the Lasta App for the last week and was really surprised about the good handling and layout of the app. It is simply build, so you quickly understand the app.It sends you messages, when to diet or drink water. This was very helpful.I also tracked my food to know how much calories I have to eat.The app also has the feature to track your mood and activities.I think this is a very good app for people who want to diet and I can only recommend it to everyone."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Carol",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T20:27:52.000Z",
          "Titre": "Fast and effective",
          "Contenu": "Seth Barret answered right away and satisfyed my demand with no problem and fast."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "3223476",
          "Nb_Reviews": 8,
          "Date": "2023-07-13T09:20:33.000Z",
          "Titre": "Lasta app to help with fasting",
          "Contenu": "If you’re looking for support in fasting, then the Lasta app is really helpful. You can very easily track what hours and days you fast. The Lasta app has some great wellbeing tips for self-care, meditation, relaxation and more. The app has loads of recipe ideas that you can filter for meal times, types of meals, prep time and more.Lastly, the Lasta app is great for tracking your activity, water intake, mood and weight."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sabrina",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T15:39:36.000Z",
          "Titre": "Helpful & easy to use app",
          "Contenu": "I downloaded the app and found the whole process, whether it was creating an account or reading through the learning guides, very easy. The app is extremely helpful as it provides you with “daily to do’s” and makes everything much easier for those who have never tried intermittent fasting before. It’s like a guidebook, showing you exactly what to do and how to do right; which helps you easily add fasting into your daily routine. Thank you to the app creators, your app is perfect and has really helped me. Thanks again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jana Hatch",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:53:46.000Z",
          "Titre": "Well-developed Application",
          "Contenu": "It is a well-developed application for intermittent fasting with many helpful categories to improve one's health. The customer service is also very prompt, professional, and solution oriented. Mr. Seth Barrett was my representative, and I appreciated his professional assistance and communication."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Shobhit Kapoor",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T00:22:07.000Z",
          "Titre": "Great app",
          "Contenu": "Great app. for not just someone who wants to go for intermittent fasting but also who just wants to eat healthy food. With cooking instructions along with calorie count which is awesome and can help induce fitness habits."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Roshni Patel",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T01:56:23.000Z",
          "Titre": "Great App to Help You Fast & Loose Weight",
          "Contenu": "This is a nifty app that is very helpful  helping you maintain your weight loss through intermittent fasting. My favorite part  of the app is the fact that there is a meal planner/recipe finder that helps me make good choices around my meal. I love the built in flags that help me make more conscious decisions. 10/10 of would recommend if you are looking for an app to help you stay on track to meet your weight loss goals."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Angus D",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T00:35:24.000Z",
          "Titre": "The Lasta Intermittent Fasting App Review…. WOW",
          "Contenu": "The Lasta Intermittent Fasting App is great. You can track your mood, water intake, daily steps, weigh ins, activity tracking, and many other relatable topics. The app is all inclusive of your weight loss journey and is a one stop shop of resources and support. Thanks Lasta!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sharon H.",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T19:11:09.000Z",
          "Titre": "Fabulous app!",
          "Contenu": "I tried this app thinking it was going to be basic intermittent fasting plans and support. However, it is way more than that! It has amazing recipes, eating plans, workouts and lovely mindfulness components. It is motivating me with great reminders for fasting and it is very helpful for my overall health and wellness with so much information and tracking at my fingertips. I am impressed and happy with Lasta!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "AAthira",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T14:40:57.000Z",
          "Titre": "Best Ever Fasting App!",
          "Contenu": "This app provides me a good knowledge on what fasting is and how fasting should be done.This app is the best for beginners who wants to do fasting and does not know how to start it.The short stories are really interesting!The meal options are given based on nutritional value,Energy value and Eating style which is really a good one.This is very helpful for the one like me who is allergic to gluten."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Reasbej",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T00:03:21.000Z",
          "Titre": "An interesting concept",
          "Contenu": "An interesting concept that allows you to monitor the amount of time you fast each day. Articles about diet and nutrition can be filtered by gender. Also includes a variety of healthy recipes to choose from. Overall a useful app for someone looking to try fasting."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sarah A",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T12:15:50.000Z",
          "Titre": "Great app for fasting, healthy eating and wellbeing",
          "Contenu": "Great app to support fasting, especially for those new to it such as me. Its also excellent for general healthy eating and lifestyle, with all of the recipes available. I'm vegetarian and there's sooooo much choice! I also love the interactiveness of the daily stories, little reminders to keep you motivated!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gusburg",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T21:11:05.000Z",
          "Titre": "Excellent fasting app!",
          "Contenu": "Excellent fasting app! The app is filled to the brim with motivating content and stuff to learn about fasting. Such as recipes for food, fasting tips and motivational stories. It is great at tracking your progress and I can see great potential in the future with myself and this app. It suggests fasting times based on your experience with fasting, and suggests things you can do during your fast when you start the fasting timer. It also tracks water intake to reach water intake goals. Overall a fantastic app with plenty of features. Really recommend people giving this a try."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Go Waters",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T04:03:41.000Z",
          "Titre": "Lasta is your fitness coach",
          "Contenu": "Lasta is your fitness coach! It helps monitor your fasting start/end periods, gives you advise on detailed health topics, provides countless recipes (which are healthy and delicious too) and very simple to do! It keeps you on your plan towards better health. Great app!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elsa",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T12:41:45.000Z",
          "Titre": "I absolutely love the app",
          "Contenu": "I absolutely love the app. I like that it’s not only keeping me on track with my fasting schedule, but it also keeps me motivated during the day or when I need it by providing positive affirmations and wellness tips as well as information about women’s health so I can feel my best during each part of the month. I love it!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Daniel",
          "Nb_Reviews": 4,
          "Date": "2023-09-01T23:17:25.000Z",
          "Titre": "Great well-being app",
          "Contenu": "This app is very user-friendly and you can add this as a widget on your iPhone Home Screen. This makes it really accessible. The app has lots of free well-being resources, recipes and yoga videos. I think that it’s a well rounded app that encompasses many resources to improve your physical and mental well-being."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Abi Tapner",
          "Nb_Reviews": 3,
          "Date": "2023-08-07T16:29:43.000Z",
          "Titre": "Great app for beginners",
          "Contenu": "This app is a great introduction to fasting. I had no experience with fasting and this app made it easy to understand and follow. It allows you to time your fasting so you don’t need to work this out manually. It gives you notifications to remind you of your progress. I love that you can also track your water in take and it stresses the importance of this. The app also promotes mental health with affirmations, self-care, stress relief and relaxation stories. Many of these only take a small amount of time and are manageable."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Gaurav Joshi",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T00:35:56.000Z",
          "Titre": "Top Notch App",
          "Contenu": "Excellent app with timely reminder about the water and take meal. Also, built-in recipe is easy for someone like me who doesn't cook. vegan program is a bonus. you can plan your meal ahead. overall fantastic app to reduce weight through fasting."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dominique André",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:54:16.000Z",
          "Titre": "Great customer service",
          "Contenu": "I had a great experience with my questions with Alice from your customer service! Thank you very much Alice for your prompt response 🤗"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mariya Kholod",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T02:17:10.000Z",
          "Titre": "Very good and informative",
          "Contenu": "This app is very informative. It allows you to learn more about your health and how it can be improved. It also gives you content on health topics that affect your health as well as information on conditions like diabetes. It also emphasizes fasting and tells you how to lose weight.Overall, a great app to have and use!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Roshni",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T23:56:54.000Z",
          "Titre": "Gamechanging App!",
          "Contenu": "This app has been a gamechanger!  It's been helpful for me tracking and maintaining my weight loss goals! The coolest feature of the app is the recipe finder. I can find great vegetarian recipes and I love the fact that app displays what are healthy meals and what are not healthily meals. I feel like I have been able to make more conscious decisions about eating and would recommend folks to use this app for that feature along!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jake",
          "Nb_Reviews": 3,
          "Date": "2023-07-21T17:16:51.000Z",
          "Titre": "Wow…Lasta App is a gamechanger!",
          "Contenu": "I’ve only been working with the Lasta App for a few days and wow already seeing a difference.  I love all the different health and fasting related features and the built in motivation to stick with your weight loss journey.  Shoutout to Lasta for keeping me accountable and helping me be my best self!"
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "Karolis",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T09:59:37.000Z",
          "Titre": "hello why not cancel my memberships",
          "Contenu": "hello why not cancel my memberships? I found you two days ago. I have not received an answer and money yet.Thank you for reaching out to Lasta for support. We have successfully received your request, which is now being processed by our team.We have assigned a unique Ticket ID to your request:4776543Rest assured, we understand the importance of your query and are committed to resolving it promptly. Our team aims to provide a response within approximately 24 hours, although we strive to exceed this timeframe whenever possible.We have assigned a unique Ticket ID to your request:4776543Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rebecca MacDonald",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T14:54:46.000Z",
          "Titre": "Great app for anyone who wants to use…",
          "Contenu": "Great app for anyone who wants to use intermittent fasting as part of their diet. You can adjust your fasting period, then log when you commence and finish and it sends you reminders. You can also track your water intake, mood and weight. A very useful and easy to use tool!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristen Kenney",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T14:42:02.000Z",
          "Titre": "I like how this app keeps me…accountable",
          "Contenu": "I like how this app keeps me accountable. One of my favorite features while at work is the chair yoga. I am often sitting for extended hours and this is helping me be less stiff. There is a nice gentle beep sound to help you know when to move positions so that you’re not staring at the phone while trying to stretch/exercise"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "E.C.",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T15:30:41.000Z",
          "Titre": "I loved this app and its great…",
          "Contenu": "I loved this app and its great features. A lot of intermittent fasting apps are very limited. This isn't. Being a larger person, I was skeptical about starting but Lasta really allowed me to experiment with fasting. I loved all the features the app has and all the customization options that are on the app. If you are questioning using the app, dont! This app is great and will totally deliver what you are looking for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh McClendon",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T21:07:46.000Z",
          "Titre": "5 Star Experience!",
          "Contenu": "The Lasta App is very helpful with intermittent fasting. It holds you accountable with reminders throughout the day and helps you track your progress. It provides suggestions on healthier eating and activities. It even lets you connect to the health app on your phone which is huge for me. I highly recommend this app!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felicia Scott",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T14:30:45.000Z",
          "Titre": "I am enjoying this app",
          "Contenu": "I am enjoying this app. It is very useful with reminders throughout the day. It helps me keep track of what I should be doing and recognizes when I haven't logged anything in a while.  This app helps me stay focused on eating healthier and doing healthier activities via its suggested meals and encouraging articles."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Alicia",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T04:42:56.000Z",
          "Titre": "Surprised me in a good way",
          "Contenu": "I was a little skeptical at first, but the whole experience has converted me and now the app has a spot on my home screen.  The starting quiz asks all the right questions to get you started with a tailored fasting plan with tailored recipe matches, and a timeline of expectations. Log your weight, water, exercise, steps, mood and fasting all in a great interface. Large recipe library to suit all diet types, and great articles to keep you motivated and on track."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sanjay Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T15:50:02.000Z",
          "Titre": "Probably the best meal tracking app",
          "Contenu": "This app has ticked every box in my list. I've struggled with fasting apps before, but this one is super easy to use. The quiz at the start is actually helpful and makes everything in the app more personalized. Not only did I lose weight with this app, but I also became more aware of my mood, water intake, and diet. The recipe sections and content were awesome too, and I loved tapping through the daily stories for some extra motivation. Worth trying it.."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T12:16:42.000Z",
          "Titre": "This app is game changing",
          "Contenu": "This app is game changing. I’ve always found fasting apps difficult to use but this one is so simple. The quiz at the beginning is useful and it makes everything in the app more relevant to the user. I lost weight while using this app and also became more mindful of my mood, water intake and diet. The useful sections with recipes and content were a great addition. I also enjoyed tapping through the daily stories and found them really motivational."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amelia Stice",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T05:39:15.000Z",
          "Titre": "I enjoyed using this app as it helped…",
          "Contenu": "I enjoyed using this app as it helped me stay consistent with my goals and health. The app helped me track my fasting in an east and efficient format. I was able to lose some extra weight and I even feel more energized after following the apps guidelines! Highly recommend this app to anyone looking to stick to a consistent healthy lifestyle."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jlu",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T13:41:36.000Z",
          "Titre": "MOTIVATED",
          "Contenu": "This app is jam packed with so many helpful guides and tips and tricks. Very personalized app can make your custom meal plan. Create exercise plans. Helps keep track of all the things your experiencing on your journey. It definitely helps keep you on track and motivated. GOOD LUCK to everyone on your journey!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "sophie cross",
          "Nb_Reviews": 3,
          "Date": "2023-07-15T07:27:12.000Z",
          "Titre": "The app itself is really user friendly",
          "Contenu": "The app itself is really user friendly, a couple of minutes to set up your profile and when using you don’t have to commit a lot of time in entering information. The recipes are absolutely beautiful and inspire you to eat healthier. All round a great and easy app to use."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Janet Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T19:22:08.000Z",
          "Titre": "The app helped me track my progress",
          "Contenu": "As someone who values a healthy lifestyle, I recently started using health apps, and I must say, it has been a great experience. The apps helped me track my progress, and offered personalized recommendations to enhance my well-being. It's amazing to see how technology can seamlessly integrate into my existing habits. For now I use lasta app and the app for my fitness routine."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Izzy",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T08:59:47.000Z",
          "Titre": "A great fasting app",
          "Contenu": "The app is bright and clearly laid out, the recipes are right next to the meal plan so you don’t have to search far. You can sync to your health app so exercise is tracked and there are links to additional information"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Bowlby",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T14:03:15.000Z",
          "Titre": "The Lasta app has worked wonders with…",
          "Contenu": "The Lasta app has worked wonders with getting my body in check.  Being able to easily track my fast, mood, activity, and read articles, has helped keep my mindset positive.  I love how versatile the app is, and love how it promotes positivity.  I can see this being a long term use for me as a way to check myself."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Manu",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T16:09:18.000Z",
          "Titre": "Look for videos and recipes",
          "Contenu": "I really like this app. Compared to similar ones i have tried earlier, the interface is good and well shown. The circle on the front page is an excellent reminder to fast, drink water, and to take regular weight. I also found that the timeline chart is easy to use and manage. My favorite part was the the videos and quick recipes. They cater to all kinds of diets. I recommend this app to all looking to lose or maintain weight."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Yvonne OB",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T06:23:14.000Z",
          "Titre": "Awesome app",
          "Contenu": "I really enjoy this app. Very easy to use, can track so many things. Gives you delicious recipes to choose from. lots of illustrations, great support. I didnt experience any problems.  Awesome app 👌"
        }
      ]
    }
  ]
}