{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "leaserunner.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Pagel",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T22:41:19.000Z",
          "Titre": "Horrible",
          "Contenu": "HorribleTwo tenant screening reports and applicationsfor Brandy Fagan and Josh P were completed, showed up in lease runner for a day or so and are now totally missing in action.  I submitted an email request to have you look into it and have not heard back from you.  The signed leases that my tenants signed have never come back to me for signature.  Major fail"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luis Talamantes",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T18:04:06.000Z",
          "Titre": "Had to create a second account 1-2…",
          "Contenu": "Had to create a second account 1-2 years ago because 1st account stopped working. Support was no help. Tenants always had an issue logging in. Leaserunner sucks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Elfassy",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T21:18:22.000Z",
          "Titre": "It's not user friendly",
          "Contenu": "It's not user friendly To complicated To get this submitted to you I needed to think of a date 🙄 within 12 months or else it wouldn't go through . I had to make up a date . Sorry just trying to help .🫢Not necessary"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Marquez",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T01:59:44.000Z",
          "Titre": "Closed Fridays??"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Nasser",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:11:27.000Z",
          "Titre": "Too complicated to use",
          "Contenu": "Too complicated to use, cannot customize the lease easily, rent payments take about a week to get to me plus they charge a fee and Zillow does not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Naj",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T04:08:29.000Z",
          "Titre": "Just Ok!",
          "Contenu": "Ok, but difficult to find reports. Also does not send alerts when expected lease payments are not made."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary Crowley",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T16:02:13.000Z",
          "Titre": "I had my bank account hacked",
          "Contenu": "I had my bank account hacked. I am leary about the system since Leaserunner is one of the four items that are automatic deductions or additions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Naheed Chowdhury",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T16:58:14.000Z",
          "Titre": "Not the best but does the job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Geddes",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T18:17:31.000Z",
          "Titre": "I use Leaserunner in my property…",
          "Contenu": "I use Leaserunner in my property leasing business. It makes the job of collecting rent payments much better.  Tenants pay more reliably.  There are some things that Leasrunner wants to do that I don't use - like managing my leases.  And that can make it less intuitive to integrate into my business, but i am happy that ACH payments are possible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phil Sgamma",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T21:02:57.000Z",
          "Titre": "Leaserunner has saved me so much time…",
          "Contenu": "Leaserunner has saved me so much time and energy executing leases. Great product.I have been using it for many years now. I would still like to see a very clear and obvious way to choose who on the lease receives the lease first. This is important for the head of house, or 'lead' tenant that needs to see it first. I am never sure who will end up getting the lease first until I click send, then often times I have to cancel and resend to adjust who will get it first. Clarifying this and being able to adjust before sending would be fantastic. Thanks for a great product!Phil"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle S.",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T19:57:29.000Z",
          "Titre": "Such a helpful tool",
          "Contenu": "I’ve used LeaseRunner for years to help with leasing our rental property and collecting rent. It helps make sure our leases follow current state laws and allows us to collect rent through ACH and not deal with checks, as well as routes the lease electronically to all necessary parties for e-signature. It’s a little confusing to use sometimes since I only go in every year to update the lease, but their online help directory is very thorough and customer service is super helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katherine B",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T20:25:25.000Z",
          "Titre": "A dependable and flexible landlord platform",
          "Contenu": "Leaserunner is working well for me as a medium term, rental landlord. I figured out ways to share an application link with prospective tenants on various platforms, access various kinds of screening checks, depending on what I’m curious about with different applicants, control the drafts of my lease documents and lease terms, and use electronic signatures with people from out of town. It is web-based, without an app, and I’ve had occasional small, technical glitches, but usually have gotten good responses from their technical support people. I’ve been using it about five years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ella",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:53:05.000Z",
          "Titre": "Everything is fine",
          "Contenu": "Everything is fine, but I wish you stop raising the price for each account,  especially on your old loyal customers. We went from $3 per property to now $5, without even being informed about the increase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam Harris",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T00:06:01.000Z",
          "Titre": "Easy to use for the most part",
          "Contenu": "Easy to use for the most part. Comprehensive lease templates but they are a little clunky. It's nice to choose each service individually."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terrance Tarleton",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T22:09:19.000Z",
          "Titre": "I love using LeaseRunner",
          "Contenu": "I love using LeaseRunner. There’s great support, and the reports, leases, etc. are all professionally done! My reason for 4 stars and not 5, is that I also have commercial properties, and would love a commercial lease!!!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Matthew Smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T19:52:28.000Z",
          "Titre": "Lease building",
          "Contenu": "Amendments to the lease"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Candela Innovative Solutions L",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T19:57:00.000Z",
          "Titre": "Need to be able to auto charge late fees"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Warren Howard",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:47:57.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Very simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy landlord",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:52:14.000Z",
          "Titre": "Everything I need as a landlord.",
          "Contenu": "I love the lease templates that are updated when state regulations change. Super helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim James",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T00:17:02.000Z",
          "Titre": "Highly Recommend",
          "Contenu": "I used the template lease agreements which made it easy to write each rental agreement. Used it from 2014 until I sold the property in September 2023. I had my tenants pay the monthly rent using leaserunner and never received a late payment. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "lori Kuzia",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T20:43:41.000Z",
          "Titre": "Great phone support great application process!",
          "Contenu": "I’ve been using Leaserunner for years and really trust them! Many tenants are reluctant to pay for an application before even seeing the home. However, it’s a very helpful tool to give the tenant the free part of the application which they readily fill out. That way I know vital facts about them before even meeting up.  When I do want yo move forward with screening I appreciate the deceitful in their reports. Most of all I appreciate always easily speaking to a live rep whenever I need customer support by phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie Bermet",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T22:14:27.000Z",
          "Titre": "Customer Service consistently good",
          "Contenu": "Customer Service is great!  I received an email back within hours helping me to understand how to change my lease from annual to month to month.  I am a landlord with only one property so I often forget how to do things.  LeaseRunner is consistently helpful and their prices can't be beat!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Georgiana Indrea",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T06:31:59.000Z",
          "Titre": "I absolutely love leaserunner",
          "Contenu": "I absolutely love leaserunner! Their site is userfriendly, responses are accurate and quick turn around time, the reports are returned promptly, they can be downloaded and helpful on the decision making. I also had to be with support on the phone and the staff is always professional, knowledgeable and friendly during the exchange! Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Bergquist",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:08:57.000Z",
          "Titre": "Best Tenant Review Tools!",
          "Contenu": "Best Tenant Review Tools!The nationwide eviction search, together with the financials review allows me to see if an applicant can afford the rent they're applying for. And setting up online payments (that the tenant pays for....bonus) is sooo much better than messing with checks. I use LeaseRunner on all 3 of my current rental properties and used to have 7 before selling some."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K Williams",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T00:46:35.000Z",
          "Titre": "This is a great landlord service platform",
          "Contenu": "I appreciate having the reports for rental applicants all in one place along with rental and pet agreements. I find it useful to have LeaseRunner bill the applicant for the fees, it shows they are a serious applicant when they pay for their own background check fees."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny L.",
          "Nb_Reviews": 8,
          "Date": "2023-11-08T20:39:13.000Z",
          "Titre": "GREAT platform!",
          "Contenu": "I have turned renters 3 times using LeaseRunner and I couldn't be happier with their service. The screening process is great, you set it up and send it to your potential renter - they fill everything up and pay directly. You can use them for setting up your lease and my FAVORITE thing about them is that your renter can use them to pay you rent via ACH!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T22:47:59.000Z",
          "Titre": "Your tool is reliable and very user…",
          "Contenu": "Your tool is reliable and very user friendly. I like the updates to documents to ensure your in compliance with state laws. I like the on stop process for vetting new potential applicants. I also like the ease of use user access and automatic rent deduction. You provide landlords with a very helpful tool."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Holden Properties",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T20:46:08.000Z",
          "Titre": "LeaseRunner removes the direct contact…",
          "Contenu": "LeaseRunner removes the direct contact negatives,Like people suspicious of handing personal information over to another who may or may not be legit. I had a applicant accuse me of being a personal information thief! It was all a distraction, Turns out she was a twice evicted train wreck with terrible credit. Now using LeaseRunner, there is a third element and the process is between applicant and LeaseRunner. I get my reports and nothing more. Completing the process all on line in as little as 1 hour!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Cummings & Jim Lee, REALTORS",
          "Nb_Reviews": 9,
          "Date": "2023-11-08T18:17:15.000Z",
          "Titre": "We love LeaseRunner",
          "Contenu": "We've used LeaseRunner several times to screen tenant applicants and to advertise rentals. The site has always worked great for us and we've successfully placed great tenants in our rentals. We especially like the application/screening process where the credit report is taken off our plate and only the results are reported. It simplifies our record keeping. Love LeaseRunner!"
        },
        {
          "Note": 5,
          "Lieu": "QA",
          "Pseudo": "Xiumei Cao",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T20:52:43.000Z",
          "Titre": "I have been using LeaseRunner for…",
          "Contenu": "I have been using LeaseRunner for years, and I am really happy that I have chosen this company to manage my properties. The staffs are very helpful. They respond to my emails and calls promptly each time. And drafting  a contract and signing the lease only needs a few clicks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Baron",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T20:05:21.000Z",
          "Titre": "If your landlords looking for tenants lease runners, the only way to go …",
          "Contenu": "These runners amazing platform in which to research your tenants make your contracts and receive your payments. I would recommend it to anyone who is the landlord. Especially the security check."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Schaeffer",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T03:48:26.000Z",
          "Titre": "I used Lease runner for almost 8 years",
          "Contenu": "I used Lease runner for almost 8 years. It’s great and make things super easy to be your own Landlord. I highly recommend them to anyone who decides they want to be there own property manger."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen A Green",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:18:53.000Z",
          "Titre": "LeaseRunner as a Property Manager",
          "Contenu": "I have used LeaseRunner as a Property Manager for about 7 yrs with over 30 rental units in the Dallas, Tx area. I find their customer service quick and informative for me and all my tenants thru the years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Desroches",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:39:49.000Z",
          "Titre": "Best landlord platform, user for 7+ years",
          "Contenu": "I have been using Lease Runner for over 7 years now and am extremely pleased with it. The reports produced by the financial/background/eviction checks are very well constructed, helpful, and go deeper than any other platform I've found, while still being respectful of the tenant's data and security."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Long Term User",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:12:54.000Z",
          "Titre": "The credit report is totally relevant…",
          "Contenu": "The credit report is totally relevant in rental property tenant selection.  Those with trashed credit will generally trash your rental and your finances.LeaseRunner is worth it's weight in gold."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TIMOTHY WOODSTOCK",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T14:53:26.000Z",
          "Titre": "My main rental is weekly in the summer…",
          "Contenu": "My main rental is weekly in the summer and academic in the fall winter spring. This is the only software realtime I could find to accommodate the weekly rentals. It is a bit clunky for the weekly BUT it works and well once setup."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S. Wuest",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:11:53.000Z",
          "Titre": "A great tool for property managers or a homeowner",
          "Contenu": "Lease Runner is such a great tool for property managers or those simply renting out a room or 2.   Instant notifications on new/interested tenants."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary S",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T21:10:21.000Z",
          "Titre": "Processing of document batch went very smooth",
          "Contenu": "I've always had good customer service when I couldn't figure out how to do something."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ASenger",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T20:03:00.000Z",
          "Titre": "Single Property Private Landlord",
          "Contenu": "I am just a private landlord with one property. I like that I can send documents for mold, lead paint etc disclosures and have a paper trail. My tenants set up auto pay so it goes straight to LR. I do have to wait a good 6 days for funds. I like that I can set up if I want to pay the $5 fee or the tenant. It is good to be able to set up credit, eviction and criminal checks in one place. Again, you select who pays fees. My house payment is due the first and I would have set up rent due earlier if I had realized it takes 6 days to clear. Not a big deal because I have funds to cover. I could see where this would be very handy with multiple properties. I am a part of the landlords association for MT so we use our own forms. I am assuming the ones they have available would be fine. I simply send the payment link and LR does all the rest. My tenant was happy to pay the $5 a month for convince."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diego Gandolfo de la Fu",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T17:54:10.000Z",
          "Titre": "I’be been using Lease Runner for years…",
          "Contenu": "I’be been using Lease Runner for years to review my prospective tenantsThe information is always easy to read and, very important, their customer service is always there ready to help should you have a question"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven L",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T03:48:26.000Z",
          "Titre": "First time landlord",
          "Contenu": "Even for first time landlords, the templates for a lease is very helpful and easy to adjust. Very happy with Leaserunner services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Private User since",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T01:03:04.000Z",
          "Titre": "My client likes the convenience and…",
          "Contenu": "My client likes the convenience and freedom that LeaseRunner provides when working with Tenants. We've been using LeaseRunner to customize leases, accept direct deposits on rents and teanant screening for managing properties from the Westcoast to the Eastcoast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Schmidt",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T20:01:45.000Z",
          "Titre": "Fast and Complete",
          "Contenu": "I currently only have three units and most of my tenants are long term so I don't use the service often. Each time that I have used it, it was very fast and complete."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn M Snyder",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T20:20:50.000Z",
          "Titre": "Excellent Management Tool!",
          "Contenu": "As a long term user of this service, I can say with a great deal of bias, that it is the best service for the money I have found.  I currently only have one rental but I have 3 more in the works."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jan",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T09:31:01.000Z",
          "Titre": "Quick and Easy",
          "Contenu": "From clearing potential renters, building & signing lease and other documents, to providing portal for renter to pay, LeaseRunner makes everything easy and quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted Prescop",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T01:42:08.000Z",
          "Titre": "Makes it easy to check tenants and collect rent",
          "Contenu": "LeaseRunner makes it easy to check tenants and collect rent. Faster rent payments than zillow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Houtsma",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T20:48:01.000Z",
          "Titre": "We’ve used Leaserunner  for years",
          "Contenu": "We’ve used Leaserunner  for years. There are small enough to care and large enough to do a great job. Very good customer service I would highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T19:57:10.000Z",
          "Titre": "So easy",
          "Contenu": "Leaserunner makes screening potential tenants, sending out new leases, and collecting rent super easy without any hassle for either party!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Fitzgerald",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T13:16:44.000Z",
          "Titre": "Excellent support",
          "Contenu": "Customer service is in person and responsive. Leaserunner has great on line tools but human support is excellent if needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ms. Myers",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:21:09.000Z",
          "Titre": "Love LeaseRunner; USE IT FOR EVERY TENANT",
          "Contenu": "Once I found out about this service I have used it consistently. Safe, easy and so efficient. Thank you Experian!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelly McCammond",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:28:20.000Z",
          "Titre": "LeaseRunner has been so easy to use",
          "Contenu": "LeaseRunner has been so easy to use! I have recommended it to many friends who are first time landlords."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amit",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T20:37:46.000Z",
          "Titre": "Leaserunner makes it zero touch",
          "Contenu": "Love experience to setup lease and screen tenants. Rent collection is automated. I wish leaserunner can add maintenance capability as well to coordinate with handyman/contractor as well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Hedden",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T20:59:00.000Z",
          "Titre": "Easy website",
          "Contenu": "The website is very easy to use. They have all my previous leases available and I highly recommend it to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meskerem Gebregiorgis",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:04:02.000Z",
          "Titre": "Excellent Platform",
          "Contenu": "This platform is comprehensive, user-friendly and reasonably priced. I have used it for years and I'm a very satisfied customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Gayton",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:10:02.000Z",
          "Titre": "Peace of Mind",
          "Contenu": "Gives me and the tenants peace of mind that a 3rd party handles sensitive documents"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debby Hennessy",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T20:05:38.000Z",
          "Titre": "Great Experience",
          "Contenu": "Great cars, great price!  Easy app and easy communication with car owner(s)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Bargers",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T22:21:23.000Z",
          "Titre": "I utilize LeaseRunner on behalf of my…",
          "Contenu": "I utilize LeaseRunner on behalf of my income-producing and investment clients. The reports are consistently reliable, thorough, and easy to review. The production fee is reasonable for prospective tenant to absorb."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annette",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:15:23.000Z",
          "Titre": "Couldn’t live without it",
          "Contenu": "Easy to use! Keeps track of all of my leases.  If there is a question or problem, customer service is great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Clarken",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:31:17.000Z",
          "Titre": "Very simple and easy to use",
          "Contenu": "Very simple and easy to use.  Really cuts the work of administering real estate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Walker",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:57:37.000Z",
          "Titre": "I don't use it very often so sometimes…",
          "Contenu": "I don't use it very often so sometimes I forget what to do. The CS people are really great in working with you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toni Holt-Hutto",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T03:23:11.000Z",
          "Titre": "Great job!",
          "Contenu": "Pretty thorough report!  Thanks!!  Our business is happy to use Lease Runner!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jo Wavra",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T16:13:40.000Z",
          "Titre": "Very dependable",
          "Contenu": "Very dependable, always in my bank account and I don’t need to worry"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Orlanda Powell",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:11:15.000Z",
          "Titre": "The website is very user-friendly",
          "Contenu": "The website is very user-friendly and ordering reports are very simple and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Schoenthaler",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T15:57:05.000Z",
          "Titre": "Very easy to create the lease I need…",
          "Contenu": "Very easy to create the lease I need and do a sufficient background check.  Has everything I need in one stop"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dream Housing LLC",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T20:09:37.000Z",
          "Titre": "Process is easy",
          "Contenu": "Process is easy, smooth and payments are never delayed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence Witt",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T01:16:14.000Z",
          "Titre": "LeaseRunner EASAY",
          "Contenu": "LeaseRunner is a professional easy to use through process to vet tenants."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Lundgren",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T20:45:17.000Z",
          "Titre": "Simple to use and includes all of the…",
          "Contenu": "Simple to use and includes all of the functions we need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim F",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T22:18:04.000Z",
          "Titre": "Outstanding",
          "Contenu": "LeaseRunner is an outstanding service that provides many features in making managing rental properties the easiest it can be."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terésa Weise",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T22:20:50.000Z",
          "Titre": "Easy payment method",
          "Contenu": "Lease Runner made it easy for my renter to pay online each month."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Dorra",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T18:07:57.000Z",
          "Titre": "Only put my property for rent and be…",
          "Contenu": "Only put my property for rent and be able to screen applicants"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mervat Morcos",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T19:08:15.000Z",
          "Titre": "Fast reply",
          "Contenu": "Fast reply, accurate information provided, easy to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Lemke",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T15:45:29.000Z",
          "Titre": "Easy; Helpful",
          "Contenu": "Easy straightforward process to allow prospective tenants to apply and pay directly for screenings."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vien Wimberly",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T22:56:51.000Z",
          "Titre": "The platform is easy to maneuver",
          "Contenu": "The platform is easy to maneuver, and the customer service is excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Hickory",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T20:27:38.000Z",
          "Titre": "Always reliable and appreciate ability…",
          "Contenu": "Always reliable and appreciate ability to use just the screening tools withiut needing use the lease features."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Visone",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T01:08:21.000Z",
          "Titre": "Easy to use in great customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Brower",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T20:51:19.000Z",
          "Titre": "Super easy and organized",
          "Contenu": "Super easy and organized. Very user-friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harold Baxley",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T21:28:52.000Z",
          "Titre": "Great job on collecting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Everette",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T21:03:46.000Z",
          "Titre": "Leaserunner is and quick!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kirk Walters",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:41:51.000Z",
          "Titre": "Good review"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angelo Mazzei",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T23:49:24.000Z",
          "Titre": "Easy fast reliable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiffany H",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T02:44:26.000Z",
          "Titre": "It’s very easy to use",
          "Contenu": "It’s very easy to use. Thank you for the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail Kirby",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T22:58:40.000Z",
          "Titre": "Quick response and affordable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VDee",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T20:00:57.000Z",
          "Titre": "Meets my needs perfectly."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Greg Keyes",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:28:50.000Z",
          "Titre": "Always no issues.!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shiferaw",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T01:00:40.000Z",
          "Titre": "Nice service & happy to share"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Twin Rentals",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T01:14:09.000Z",
          "Titre": "Very useful and easy to use!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ethan Howard",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T22:26:54.000Z",
          "Titre": "Good App",
          "Contenu": "Very helpful! It’s my go to!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sidney Mehrdady",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T19:59:24.000Z",
          "Titre": "The services are great, prompt and quality",
          "Contenu": "The ease of app’s use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vladimir",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T00:34:05.000Z",
          "Titre": "Great customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reese Ha",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:07:52.000Z",
          "Titre": "Responsive customer service"
        }
      ]
    }
  ]
}