{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "libsyn.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "AD",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T23:20:27.000Z",
          "Titre": "Doesn't post to platforms like advertised",
          "Contenu": "Says that they post them to platforms but weeks later when I check the platforms, they arnt there. So they arnt actually sharing them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Micah McGukin",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T06:23:34.000Z",
          "Titre": "It says my podcast episodes have been…",
          "Contenu": "It says my podcast episodes have been posted on all the platforms, but when I search for them, I cannot find them. Then, when I contacted support on the issue no one got back to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcus",
          "Nb_Reviews": 4,
          "Date": "2022-11-24T01:23:15.000Z",
          "Titre": "Worst service ever",
          "Contenu": "Worst service ever. The USED to be good. Support takes ages to react. They aren't concerned about small and new podcasts. I have a awful experience with them and therefore can't recommend them. Host your podcasts elsewhere!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom Townsend",
          "Nb_Reviews": 2,
          "Date": "2022-10-12T00:37:24.000Z",
          "Titre": "False Advertising and Dishonesty.",
          "Contenu": "WARNING. I was suckered in by False Advertising. I am a handicapped Creator and I emailed them that I was looking to switch hosts. I told them this is how I support myself and my handicapped child do you have monetization from day one? I was told absolutely and the advertising says the same thing regardless of audience size. I signed up and was told your audience isnt big enough we will put you on a waiting list LOL. I showed them the advertising where it said it didnt matter AND screenshots of my other Podcast hosted elsewhere with 700k downloads a month. Still NOPE, I dont want all my eggs in one basket. I told them how important it was due to being handicapped and crickets no one seems to care. You already paid. I also asked how to lower the tier since I already have four episodes out and was going to possibly wait to see what happens. Never got an answer after asking 3 times. Look Libsyn does not offer anything better then any other hosting and some offer monetization from day one. Seeing the dollars add up is really motivating especially when your kid requires food. More honest companies as well and who dont take advantage of the handicapped. Heartbreaking."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Peter Cook",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T03:24:01.000Z",
          "Titre": "Poor UX, File Errors",
          "Contenu": "Errors uploading files even though they are MP3. Bad UX experience, confusing. Limited website flexibility. Podcast buttons failed to push to website automatically."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jason mccarthy",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T20:32:46.000Z",
          "Titre": "Not enough storage and it is expensive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Morris K.",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T02:20:44.000Z",
          "Titre": "The pros and cons",
          "Contenu": "I appreciate the platform's excellence, which is equipped with all the essential features the Podcast community needs. It is clearly designed by great minds to make it more user-friendly. However, it's unfortunate that the customer service and support are not up to par. Minor issues can take forever to resolve, which can be extremely frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dave McDonald",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T14:02:32.000Z",
          "Titre": "Too expensive",
          "Contenu": "Too expensive.  I host multiple podcasts and they do not have deals for podcasters who have multiple shows...so you have to pay pretty high prices for each show you host.  It's too much and unfair."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erin M.",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T22:13:19.000Z",
          "Titre": "Newbie Podcast Honest Review",
          "Contenu": "I'm a rookie, amateur podcaster. I went with Libsyn as a hosting platform by recommendation from another small-op podcast. I've been with Libsyn a little less than a year but longer than a human fetus gestation. My experience has been lukewarm and really plummeting in the last month. For background I work fulltime in healthcare and so does my co-host. It's just us two and he's a Boomer so I take care of all the producing and tech-related aspects of the podcast. Getting the 'Destinations' setup took a little of forum perusing - it's a bit more of a multi-step process for bigger podcast platforms like 'Apple Podcast' and 'Spotify'. Small hiccup.My ONE decent Pro is the remote recording feature that is relatively new. I like that it gives you separate tracks for speakers and a 'master' track option. The major con is similar to Skype/Google Meet in that the audio competes and cuts out if people are talking over each other. Makes for a nightmare in post-production when I have to use AI to regenerate pieces of audio. The biggest headache and absolute TRAINWRECK is the website and interfacing a podcast feed with Libsyn. For context I was hoping to create a 'blog' style feed that I could add transcripts and resources to. There is the option to embed a player but that option is essentially just a media player. The other option is to use an RSS feed to embed the episodes on a website and that's fine if all you want is the show notes in tiny, plain, black text with ZERO formatting (good luck with brand consistency). Libsyn is retiring their 'Legacy' website, which is pretty rudimentary at best. Very bare bones, but honestly I could've worked with it and truthfully I have no idea when it is officially going to be 'retired'. That being said, Libsyn is hardcore promoting its sister company 'Pair Networks' or 'Pair Domains' where you can buy a domain and create a website. A podcast website. Sounds great? It's not. It's the worst experience ever. Apparently the podcast website is supposed to be WordPress based, but when you create a website through Pair Networks it defaulted to a Weebly-based. Still never figured out how to move it from Weebly servers to Wordpress services through Pair. There is absolutely ZERO interfacing between Pair Networks and Libsyn. And there's no way to fix it either. The Libsyn forums on linking podcast episodes to an external website are outdated and there's nothing for guidance on how to do so with the 'sister' companies nonexistent interfacing. Well I built a Weebly website and when I had to update the expiring card information Pair Networks deleted the entire site I built. I've contact support at both Libsyn and Pair and usually get a generic, bot response and promptly receive notification my 'ticket' is closed/marked as resolved even though it's definitely not. This whole process has been so frustrating therefore I'm moving our entire podcast to Buzzsprout. If you're fine with bare bones you can probably crutch your way through the Libsyn platform as a beginner but if you want any semblance of interfacing with a podcast website I absolutely CANNOT recommend Libsyn."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Homeslice",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T21:38:15.000Z",
          "Titre": "I like the interface",
          "Contenu": "I like the interface. It's pretty straight forward and simple to learn and use.However, I've had an uploading issue and submitted a ticket several days ago and haven't had any kind of response. I'd also reached out to Spotify to see if they could help and have already talked back and forth with them several times. And still no response from Libsyn. Pretty frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Blake Mattocks",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T15:20:08.000Z",
          "Titre": "new customer",
          "Contenu": "I am a new customer trying to onramp and have some very specific questions. The Bot and articles provided did not answer my questions directly. I have sent 3 emails because my issue is very time sensitive. As of now I still have not had a response. It is very disapointing as a new customer that I have not been responded too"
        },
        {
          "Note": 2,
          "Lieu": "CR",
          "Pseudo": "Jaime Rothbard",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T14:30:20.000Z",
          "Titre": "I don't see my show listed anywhere",
          "Contenu": "I published my first test show 3 days ago, 5 others last night and there is still no sign of it where I normally access podcasts. I am waiting for the Libsyn support team to answer my inquiry about what I haven't done correctly, if anything."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Sam Abdallah KW",
          "Nb_Reviews": 3,
          "Date": "2023-04-22T23:32:00.000Z",
          "Titre": "Not satisfied with not much training…",
          "Contenu": "Not satisfied with not much training and support on how to get my podcast pushed. Says pushed to apple podcast when sharing doesn't s how up for peopleHelp would be appreciated"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "laurascoegmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T17:33:35.000Z",
          "Titre": "I am moving to zencasr and really can't…",
          "Contenu": "I am moving to zencasr and really can't believe how much better they are. The interface is pitiful, the tools are old. Lybsyn needs to invest into its platform."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zippy Etzel",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T20:17:46.000Z",
          "Titre": "Some of the worse customer experience…",
          "Contenu": "Some of the worse customer experience I've ever had. Went with Libsyn after reading a handful of reviews. I chose it because of the relatively easy \"plug & play\" model it project to be. After setting up the free website that comes with using Libsyn I purchased a special domain website name through Libsyn suggest company (which they also own) called Pair Domains. Since purchasing specific domain name I've yet to be able to get the Libsyn host to point to domain name (a feature that was crucial to whatever hosting service I was going to use). After looking through site FAQ to attempt to troubleshoot myself, all I found was an outdated article from nearly 4 years go when the features looked completely different and the suggestions in the article are not even ones that you can institute as the backend of Libsyn doesn't now include most of the buttons or menus the article points you to. Thus, I sent a ticket asking how to do this. After 4 emails later the support person claimed he'd \"solved\" my issue but never actually did anything or gave me the info I needed. Simply told me the issue was on the \"Pair\" side of the equation. I called Pair support and they stated it was all on the Libsyn side. No phone number for Libsyn support. So good luck there. A task that should have taken 5 min has stretch into 2 weeks and I've essentially spent hours of my time & money trying to get this to work. I've yet to launch a single episode but already heavily regret going with this \"service\" that feel like much more of a scam."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Caroline Lee",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T00:11:13.000Z",
          "Titre": "can't upgrade the subscription",
          "Contenu": "can't upgrade the subscription - shows constant loading screen"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christine Mighion",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T14:08:47.000Z",
          "Titre": "Connect Call simply doesn't connect",
          "Contenu": "Connect Call simply doesn't connect. I have struggled repeatedly to use Connect Call for interviews. I either can't let someone in the room or it says that they are not there when they are. We have spent 15 min or more trying to work this out and even have sent new links. It's embarrassing. Contacted support and they said maybe I should try Zoom or another service to record the call. That was half the reason I chose Lisbyn. I like the Studio, but I'm trying to decide if I should move to another hosting service altogether as I'm now paying for Zoom too."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bruce ciotta",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T23:28:24.000Z",
          "Titre": "Everything works and information is…",
          "Contenu": "Everything works and information is available genera. But it so far feels a little self serve. As something is brand new to podcasting I would prefer a bit smoother ushering thought the steps especially in posting first and second audio posts. Additionally I had some challenges when I tried to update a show with different info and I’m really not sure what worked and didn’t."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin T",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T23:31:49.000Z",
          "Titre": "I need more opportunities to link…",
          "Contenu": "I need more opportunities to link people to all platforms and better make ting and embedding"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Murder Mittens NYC",
          "Nb_Reviews": 2,
          "Date": "2022-10-16T01:42:18.000Z",
          "Titre": "Have tested multiple podcast hosts, sticking with Libsyn.",
          "Contenu": "I have tested a few podcast hosts and all-in-one solutions and though I am giving Libsyn 3 stars, I am staying with Libsyn. The other options had MUCH better interfaces. Libsyn is stuck in the ... 60s? The green is awful, but it's really the backend that gets the minus 2 stars. Good luck figuring out where they've stashed things. Libsyn works. It is reliable. It's unfortunate that no one on the team has any design experience. If you're just getting started or you're moving over, you will find what you need. But it'll be a little like digging in the goodwill bin to get there."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Tiffany Gilleland",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T10:23:22.000Z",
          "Titre": "Easy to Use - Slow to Load Pages",
          "Contenu": "So I just started with Libsyn 5 a few weeks ago. It's not too bad, easy enough to use. I just wish it loaded faster when logging in or loading any page it's considerably slower than say Youtube for example."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roger L'Hereault",
          "Nb_Reviews": 2,
          "Date": "2023-01-13T22:52:16.000Z",
          "Titre": "Lost Opportunity",
          "Contenu": "I appreciated the feedback.It seems like a waste of opportunity for you all, though, as the feature I was asking for (dynamic pre/post roll)is easily accessible and much cheaper and transparent as to the cost with your competitor buzzsprout. My impression is that innovation is not top of mind with Libsyn.The features I need, value, transparent pricing and ease of use makes it a no brainer for me to move to Buzzsprout."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom Parish",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T23:24:28.000Z",
          "Titre": "Feedback",
          "Contenu": "I like the devices. Used it way back then you first started. Came back recently. However the Libsyn website is rather sluggish imho.  The graphics feel out of date. Is there a iPhone app version?Tom"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryan Hochenberger",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T04:57:57.000Z",
          "Titre": "You need a costumer service # so…",
          "Contenu": "You need a costumer service # so customers can get their questions answered in real time instead of waiting days for a response that usually doesn’t answer the question."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Aaron Yu",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T23:34:26.000Z",
          "Titre": "Libsyn does everything I need but UI/UX…",
          "Contenu": "Libsyn does everything I need but UI/UX is quite poor. If I don’t post podcasts for awhile I have to relearn where everything is. Otherwise quite happy with the service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shannon Ahearn",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T03:04:54.000Z",
          "Titre": "Unfortunately have had major errors…",
          "Contenu": "Unfortunately have had major errors with my podcast launch and slow responses on how to solve them."
        },
        {
          "Note": 3,
          "Lieu": "BO",
          "Pseudo": "a Podcast Company",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T14:57:21.000Z",
          "Titre": "Very limited options"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Triple  Grill",
          "Nb_Reviews": 4,
          "Date": "2023-02-12T01:27:45.000Z",
          "Titre": "I really like the ease however I am…",
          "Contenu": "I really like the ease however I am struggling getting it on to Spotify regularly via libsyn"
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Leon Birdi",
          "Nb_Reviews": 3,
          "Date": "2023-05-06T21:18:37.000Z",
          "Titre": "Unstable version 5 and slow support…",
          "Contenu": "Unstable version 5 and slow support makes me think about finding another podcast service :-("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt Miller",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T20:21:53.000Z",
          "Titre": "links to various feeds don't seem to…",
          "Contenu": "links to various feeds don't seem to work consistently"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Michelle Forsyth",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T08:37:26.000Z",
          "Titre": "Great support",
          "Contenu": "Each step well explained, fully supportive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristal Saladin",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T17:21:44.000Z",
          "Titre": "Good service",
          "Contenu": "The suggestions provided were great (even though I had already tried them but they didn't know that) I also appreciated that a step to test the issue on their own was initiated by the customer service agent without me having to ask. I just wish the response was faster."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Hall",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T01:22:56.000Z",
          "Titre": "I’ve liked most things about the…",
          "Contenu": "I’ve liked most things about the platform, and it sound direction for posting on multiple streaming sites helpful. But the automatically generated webpage for the podcast was super ugly, I would never send anyone there. That’s not the biggest deal for me because I have my own webpage, but that’s why I didn’t give it five stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JR",
          "Nb_Reviews": 5,
          "Date": "2023-05-16T11:59:59.000Z",
          "Titre": "Issue Resolved!",
          "Contenu": "Libsyn's resolved my issue and in a timely manner.  I am impressed with their response.  The only reason why I'm giving 4 stars and not 5 is the difficulty in submitting a question to Libsyn. They try to answer with a robot, suggesting articles etc. and it would be nice if asking a question to a human would be easier.  Overall satisfied and thank you Libsyn!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shx",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T20:53:50.000Z",
          "Titre": "Good but pricey",
          "Contenu": "It’s a very well organized service however, the pricing of the plans are pretty high. They have gone up drastically since the overhaul and it may look prettier but it’s not that different. Because of the prices of the plans, our show’s expansion of how much content we can put out is hampered by a budget now…"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina Shepardson",
          "Nb_Reviews": 5,
          "Date": "2023-09-26T17:36:51.000Z",
          "Titre": "Everyone has been extremely helpful",
          "Contenu": "Everyone has been extremely helpful! Very easy to use, hoping some additional features are added like adding more inages soon ."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Kate",
          "Nb_Reviews": 100,
          "Date": "2022-09-05T07:45:06.000Z",
          "Titre": "Good hosting, exasperating billing",
          "Contenu": "I've used Libsyn for many years and enjoyed their reliability and constant technical updates. One thing I haven't enjoyed is their billing system, which insists on sending teeny-tiny bills every month that constantly mess up my accounting system. Please allow for annual billing!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Elaine",
          "Nb_Reviews": 5,
          "Date": "2023-07-01T20:11:58.000Z",
          "Titre": "Stress free and user friendly",
          "Contenu": "The experience has been stress free and user friendly, the instructions easy to understand and the pricing is reasonable. However, I think it has an outdated feel to it  compared to other sites, I'm not impressed with its website for the podcasts and trying to use its Glow feature is rather challenging!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Stan Shear",
          "Nb_Reviews": 2,
          "Date": "2022-12-20T20:41:12.000Z",
          "Titre": "I am happy to share my positive…",
          "Contenu": "I am happy to share my positive experience with Libsyn.  Although this was a trivial issue, I know that Libsyn never treats a problem as trivial. They always respond promptly, and will not leave it until they are satisfied that it has been resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Chelson",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T21:17:24.000Z",
          "Titre": "I am still new to Libsyn and learning…",
          "Contenu": "I am still new to Libsyn and learning everything. So far things have been pretty good. I believe things will get better as time goes on. I have used a few other podcast hosts in the past and each one has their differences and I am not trying to compare as each host has their strengths and weaknesses.So far Libsyn is doing good and as I continue to learn more about it, I hope to be able to see the full value that is offered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Campfire Woman",
          "Nb_Reviews": 3,
          "Date": "2023-06-15T23:46:28.000Z",
          "Titre": "I had already tried to fix my issue but…",
          "Contenu": "I had already tried to fix my issue but was unsuccessful. I tried a third time following one step suggested to me by Ben and I was able to log in. It took longer than expected to get a reply but it all worked out in the end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allie Maurus",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T02:00:41.000Z",
          "Titre": "customer service",
          "Contenu": "contact info greatset up to upload podcast, not so greatplatform could use some readjustments but otherwise very cheap and nice"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alcides",
          "Nb_Reviews": 5,
          "Date": "2022-10-17T22:22:58.000Z",
          "Titre": "A good site for hosting podcast, but can be improved",
          "Contenu": "A good site for hosting podcast. Good infraestructure, but it lacks some useful features, like hosting different podcast in one account and more easy tools to publicate the post on platforms like Apple, Google or Spotify"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T00:14:38.000Z",
          "Titre": "Recent podcasts not playing…",
          "Contenu": "Aaron was very helpful in diagnosing and helping me correct the issue with podcasts not playing. I only wish the issue could have been resolved quicker."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steph",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T23:21:31.000Z",
          "Titre": "4 is better than 5",
          "Contenu": "While extremely helpful, it took nearly a week to hear back from libsyn support. Libsyn 5 is not as user friendly as libsyn 4, especially when it comes to seeing when a podcast has posted on different destinations. I feel it is easier to find that information out as well as update broken destinations on libsyn 4.Other than the destinations issues, the statistics available are impressive and helpful and uploading a podcast is more streamlined in libsyn 5"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ALAN HOSCH",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T03:50:00.000Z",
          "Titre": "Ease of publishing; Ease of Artwork Creation",
          "Contenu": "I appreciated the ease of publishing and artwork creation. I'm still trying to figure out how to get the podcast on Spotify, etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Hooper",
          "Nb_Reviews": 3,
          "Date": "2023-06-07T02:18:50.000Z",
          "Titre": "Not perfect but very good …",
          "Contenu": "Content upload limit can be annoying but everything else is easy to use"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Ines Alexandrino Pereira",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T10:07:28.000Z",
          "Titre": "Lack of video functionalities",
          "Contenu": "If you would have a way to put also video in the podcast like other providers do I would give 5 stars"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cory WM",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T05:06:12.000Z",
          "Titre": "Pretty easy",
          "Contenu": "Pretty easy. I’d like to see it publish more readily to things like google podcast or link to your Patreon though"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd DeJarnatt",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T01:44:25.000Z",
          "Titre": "the ease of the transition",
          "Contenu": "the ease of the transition. I am still learning.. so far so good.thanks"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Laarni Abanid",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T09:02:18.000Z",
          "Titre": "No Complaints Just allot of Love and…",
          "Contenu": "No Complaints Just allot of Love and Support! Very GOOD!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rainey",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T17:52:11.000Z",
          "Titre": "The show that I was listening to is now…on You Tube",
          "Contenu": "The show that I was listening to is now on You Tube and so that is where I watch it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Loren",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T05:25:04.000Z",
          "Titre": "The system is easy to use and great to…",
          "Contenu": "The system is easy to use and great to navigate!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Georgia",
          "Nb_Reviews": 4,
          "Date": "2022-10-24T06:13:33.000Z",
          "Titre": "always easy and helpful team!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle Bryant",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T21:20:18.325Z",
          "Titre": "Phone option would be helpful",
          "Contenu": "Adam was great.  However in general when I am seeking support it would be great to have a phone call or video chat option.  It's hard to find time to keep the conversation going during the work day and a phone call would significantly cut down on the back and forth."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Diala",
          "Nb_Reviews": 3,
          "Date": "2022-03-30T21:12:08.000Z",
          "Titre": "The platform is super easy to use and…",
          "Contenu": "The platform is super easy to use and the support team are quick at responding to and resolving items. Highly recommend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jill Catledge",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T03:14:57.000Z",
          "Titre": "It seems to be user friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Grothoff",
          "Nb_Reviews": 2,
          "Date": "2022-02-04T19:43:36.000Z",
          "Titre": "Good response and timely solved my…",
          "Contenu": "Good response and timely solved my problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:24:28.000Z",
          "Titre": "I reached out about being unable to upload my most recent episode",
          "Contenu": "I reached out about being unable to upload my most recent episode, and the issue was resolved, and a follow-up email explained the problem. I was quickly able to meet my deadline."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doc",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:21:46.000Z",
          "Titre": "Customer service",
          "Contenu": "Customer service - Always quick to respond. Dave Jackson was the guy who helped me resolve one."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Maria Saraphina Love",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T18:02:44.000Z",
          "Titre": "Outstanding Customer Service",
          "Contenu": "I recently rejoined Libsyn after a period of inactivity and they've gone above and beyond in their customer service to get me settled back in. Their customer service is proactive and super helpful.On top they've got an excellent library full of great resources."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Rune",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T21:03:13.000Z",
          "Titre": "Awesome support!",
          "Contenu": "Quick, precise and helpful answer every time I need them!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Andrew Man",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T12:00:12.000Z",
          "Titre": "This company is great.",
          "Contenu": "This company is great.Having never made a podcast before, they really did help to set my show up correctly.In addition they offered an online coaching to explain how to improve my show further!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler Hespeler",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:37:50.000Z",
          "Titre": "I found it very valuable how I was able…",
          "Contenu": "I found it very valuable how I was able to get very quick responses via email whenever I had any issues."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Penny Dee",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T20:18:12.000Z",
          "Titre": "Libsyn are amazing",
          "Contenu": "Libsyn are amazing, it is so straght forward to get podcasts up and when I have ever needed help they are so responsive and help.  Great company and would highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Ana Nicole David",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T19:51:30.000Z",
          "Titre": "Responsive Support",
          "Contenu": "Support was responsive and eager to help. Answered questions to the best of their ability."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fransheska Meservy",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:20:35.000Z",
          "Titre": "Effectiveness | Efficiency",
          "Contenu": "Your company has distributed my podcast episodes to the different audio platforms flawlessly. Your customer service is top notch, and I am very grateful for all your support through my new podcast journey."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Shelton",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:09:34.000Z",
          "Titre": "Fast and great help",
          "Contenu": "Fast and great help. I was pleasantly surprised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fabiola Rodriguez-Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:36:16.000Z",
          "Titre": "Is very easy to use",
          "Contenu": "Is very easy to use, and they load up the episodes very fast"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Scary Little Girls",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:20:52.000Z",
          "Titre": "Podcasting made easy",
          "Contenu": "Really straight forward with clear guidance and training materials."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew Chamberlain",
          "Nb_Reviews": 7,
          "Date": "2023-11-10T00:00:38.000Z",
          "Titre": "I highly recommend using Libsyn for new or seasoned podcasters alike.",
          "Contenu": "Libsyn is a great platform - super easy to upload and manage files, monitor performance of your pods, and schedule your releases. On the very rare occasions that I've needed support (not because I'm amazing at podcasting but because the system is so intuitive!!), the support team is second to none. Prompt, professional, and incredibly helpful. I highly recommend using Libsyn for new or seasoned podcasters alike."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connie",
          "Nb_Reviews": 3,
          "Date": "2023-10-23T19:16:33.000Z",
          "Titre": "Superior Above and Beyond Service",
          "Contenu": "Chris at Libsyn took the time to personally solve my problem by figuring out the *reason* Apple was not uploading the latest episode and then FIXING it!!! Upload was immediate. Thank you. He also sent a great video showing me how to adjust artwork size in the future. Above and beyond service at Libysn for a techno-challenged client."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valerie",
          "Nb_Reviews": 6,
          "Date": "2023-12-09T01:29:13.000Z",
          "Titre": "Libsyn support is THE BEST",
          "Contenu": "Libsyn support is THE BEST. They exceed all expectations for knowledge and efficiency.I love Libsyn"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marilyn McLeod",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T23:13:02.000Z",
          "Titre": "Colt understood my questions and was…",
          "Contenu": "Colt understood my questions and was easily able to answer and help me resolve what I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DM",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T19:45:40.000Z",
          "Titre": "Chris was thorough and provided easy to…",
          "Contenu": "Chris was thorough and provided easy to follow explanations and directions."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Susanna",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T16:12:05.000Z",
          "Titre": "Support exceeded my expectations",
          "Contenu": "I was helped with my support request very quickly and the support I was given exceeded my expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Wright",
          "Nb_Reviews": 7,
          "Date": "2023-10-31T23:00:12.000Z",
          "Titre": "Emilio made my experience GREAT!!",
          "Contenu": "Emilio made my experience great!  I am working to post may of my past Libsyn podcast files to YouTube.  He VERY VERY patiently helped me with many questions about how to do this.  Not sure I would be able to accomplish this without his help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allison James",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T17:33:22.000Z",
          "Titre": "Libsyn Support is truly 10/10 Stars",
          "Contenu": "I needed to get with the support team because my episodes weren't loading after having them scheduled. Rich H. was extremely kind when I emailed support. Guess what my flub was & why my episodes weren't loading?? I FORGOT TO ADD THE AUDIO (can't you tell I'm a professional podcaster?) Rich didn't make me feel like a fool for one second. In fact, he let me know this is a common occurrence and no big deal. He also responded to my initial enquiry within an hour! We need more Rich's in our lives. Thanks again Libsyn - I already knew y'all were the best and Rich helped solidify that today!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rafael Alvarez.",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T19:02:11.000Z",
          "Titre": "Libsyn Podcast Hosting is a great for Latinos.",
          "Contenu": "Libsyn Podcast Hosting is a great platform for Latinos, easy to learn and to use, and there is always great improvements and new features. Libsyn made it easy for me to communicate with my Latino Community in the Franchise Industry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cherith Childers",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:56:03.000Z",
          "Titre": "I am new to this and have had lots of…",
          "Contenu": "I am new to this and have had lots of questions! I have been helped so much when I email in and I really appreciate it!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Hunter",
          "Nb_Reviews": 16,
          "Date": "2023-09-21T21:54:30.000Z",
          "Titre": "Why would you host your podcast anywhere else?",
          "Contenu": "I'm a big fan of Libsyn. They make everything about podcast hosting so easy, while still allowing all the complicated things. (Most of them are pretty easy, too.) To top that off, their customer support is effective, efficient, and friendly. Why would you host your podcast anywhere else?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Markel",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T03:26:41.000Z",
          "Titre": "I have used Libsyn's support several…",
          "Contenu": "I have used Libsyn's support several times now (cuz I'm not that computer literate!), and every time I've reached out to them they have been amazingly helpful, fast, kind, and patient in their delivery of the help I've needed. I've never once been disappointed with Libsyn's support/assistance!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guy Rodgers",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T22:41:27.000Z",
          "Titre": "Excellent and prompt customer support.",
          "Contenu": "Support responses to email occurred within 12 hours, and sometimes within an hour or two. I find this very rare and worthy of commendation. Second, support emails were thorough and, if I didn't understand something, follow-up help via email came pretty quickly."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Velosews",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T22:58:06.000Z",
          "Titre": "A key reason I stay with Libsyn is…",
          "Contenu": "A key reason I stay with Libsyn is because of the support I always receive. I get fast feedback. I learn from each person that helps me and they look at all facets of a problem."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Shannon Elizabeth",
          "Nb_Reviews": 3,
          "Date": "2023-08-01T21:37:18.000Z",
          "Titre": "Two thumbs way up.",
          "Contenu": "What an excellent service - made infinitely better than many out there, thanks to the exceptional customer service you consistently get access to.  I had one of those help desk questions that needed manual workarounds and all down to me. 24hours later it was sorted in a way that made me feel like I was, in fact, an important customer in their books.   In an age of bots and hyperlinked articles, give me LibSyn.  Their $20 plan is hard to beat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Athena B",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T02:55:12.000Z",
          "Titre": "Absolutely love libsyn",
          "Contenu": "Absolutely love libsyn! It’s so easy to use and fantastic quality and speed with posting episodes and all their corresponding information! Highly recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jedlie",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T23:28:37.000Z",
          "Titre": "Love Libsyn",
          "Contenu": "Love Libsyn. I have been hosting my podcasts with them since at least 2014. Great service, always quick to respond to questions, I can honestly say I have never had an issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Read Me a Story, Ink",
          "Nb_Reviews": 5,
          "Date": "2023-10-06T00:42:34.000Z",
          "Titre": "Why I Love Libsyn",
          "Contenu": "I am a very small podcaster of children's stories. I subscribe to Libsyn at the minimum level but have always been treated as though I were their best customer. Responses are always fast, courteous and on-the-spot helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina Shepardson",
          "Nb_Reviews": 5,
          "Date": "2023-08-04T20:50:54.000Z",
          "Titre": "I recently had questions about adding…my book covers to my About page",
          "Contenu": "I recently had questions about adding my book covers to my website and Rich H. was very helpful. Knowing that he and others see so many of the same questions, I really appreciated in addition to his quick response, his polite manner, answers, and offering any future assistance. While I have not been with Libsyn that long, this is my first host experience and all of you continue to be wonderful!Thank you, Tina"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rikki Meece",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T23:09:17.000Z",
          "Titre": "Fast, Fast, Fast.",
          "Contenu": "Fast response. Inquiry answered with satisfactory & pleasing results including a link to show proof of info/answer. Very helpful. Friendly service, even after a follow up email... fast, sincere, good info. Give Chris Jones (Libsyn 5) a raise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Stoner",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T22:00:04.000Z",
          "Titre": "Rich H is the best! Could not of moved my podcast to Libsyn without him.",
          "Contenu": "Rich H. was prompt and so incredibly helpful.  I thought maybe I was asking too many question but he patiently and thoroughly answered everyone.  I almost felt like he was sitting in a chair next to me guiding me in each step as I moved my podcast from a different host to Libsyn."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Screens in Focus",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T00:38:57.000Z",
          "Titre": "Rich's service was exceptional",
          "Contenu": "Rich's service was exceptional. He not only understood and resolved my issue but also provided images for clarification. His follow-up and attentiveness made me feel heard. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Howard",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T19:35:01.000Z",
          "Titre": "Connect is the answer to recording",
          "Contenu": "It's always been relatively easy to figure things out. Your interface has been good, and then it got much better last year.My satisfaction leapt ahead when I used Connect for a podcast interview this weekend. It was so easy. It worked perfectly. I've had serious problems using Riverside, and Connect was dead easy."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mark Carter",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T02:35:57.000Z",
          "Titre": "Libsyn has provided a good platform for…",
          "Contenu": "Libsyn has provided a good platform for our podcast at a good price . . . great for us as we start out in podcasting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley Weldon",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T16:31:44.000Z",
          "Titre": "Great podcast support team!",
          "Contenu": "I worked with a few different podcast support reps during the course of trying to set up a new show, and all of them were top-notch! Response times were pretty good, and the information given was to the point, easy to digest and apply, and got me to where I needed to be. I am very appreciative of this service option and just wish I had reached out sooner!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alex Russell",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T08:11:56.000Z",
          "Titre": "Libsyn Support help on how-to on setup Apple Podcast",
          "Contenu": "I thought I'd read all the instructions, on how to do something, but after asking for helping, and carefully following the guidance/documentation provided, it turned out I'd missed something, and Libsyn Support was able to identify what that was. It turned out I had more trouble with Apple Podcast web site too, but with a bit of patience (and luck), everything came out in the wash! (it worked!)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T21:38:32.000Z",
          "Titre": "Chris Jones gave me very detailed",
          "Contenu": "Chris Jones gave me very detailed, step by step instructions to update a very old podcast episode. Very clear and concise, I was able to walk through it and fix my problem without any other further questions. Super helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsay Harris-Friel",
          "Nb_Reviews": 9,
          "Date": "2023-06-17T18:28:52.000Z",
          "Titre": "Libsyn makes podcasting worthwhile",
          "Contenu": "Libsyn has been one of the things that makes podcasting worthwhile for me, no matter how frustrating podcasting can get, since 2015. The audio quality is consistently excellent. The geographic stats help me see where my podcast reaches, so I know my audience is out there. The customer service is so good I could cry. My RSS feed was screwed up by a typo in my tags, and not only did they help me, they showed me new directories I didn't know about, so my show could grow even better than before. Plus, The Feed podcast helps me stay well-informed about what's happening in podcasting and excited about the medium. Libsyn helps me produce and sustain a podcast that's as big and exciting as possible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina Shepardson",
          "Nb_Reviews": 5,
          "Date": "2023-06-24T17:01:06.000Z",
          "Titre": "Extremely helpful service",
          "Contenu": "This week, in trying to complete my new site, I was finding difficulties and struggling to figure it out on my own. I sent questions and screenshots and heard from Chris quickly. His suggestions, with more poignant articles to review, helped solve my problem immediately. His wording in the directions were succinct, and his tone always professional and kind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Our Catholic Prayers",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T16:32:13.000Z",
          "Titre": "Libsyn Rocks!",
          "Contenu": "I've been a quite satisfied Podcaster with Libsyn for 6 years and have always been impressed with the thoroughness of their hosting and the great and quick customer service I've gottern from them whenever I've had a question. I appreciate how once I upload a new Podcast they send it out to all the major providers, which is a great time saver. Their interface is easy to use and I like how they're always adding new features as well as Podcast tutorials (available on YouTube) from time to time. I would highly recommend them to anyone starting out in this still growing field!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Q Dyer",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T19:14:37.000Z",
          "Titre": "I needed help closing my account",
          "Contenu": "I needed help closing my account, and Rich made the process quick and simple. I have loved being a user with LibSyn and never had an issue with the company or the platform. If I ever produce another podcast in the future, LibSyn will be my key to sucess as it was before."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina Shepardson",
          "Nb_Reviews": 5,
          "Date": "2023-06-07T15:54:59.000Z",
          "Titre": "I am brand new to Libsyn and…",
          "Contenu": "I am brand new to Libsyn and podcasting, so while I know I can figure things out, I also know I will have questions along the way. Yesterday Ben and Chris responded to questions very quickly, providing exactly the answers I needed and calming my nerves lol. All good. I appreciated the assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T05:36:26.000Z",
          "Titre": "done!",
          "Contenu": "I was having an issue that despite taking the steps listed on the website and reaching out to additional resources online I was unable to remedy. Rich at Libsyn was able to handle it quickly. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Duncan Cartlidge Online",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T19:16:27.000Z",
          "Titre": "The best",
          "Contenu": "So easy to use, the studio works like a dream. Excellent support too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mysterious Radio Official",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T21:50:06.000Z",
          "Titre": "We've had an excellent experience thus…",
          "Contenu": "We've had an excellent experience thus far with customer service. Platform is very easy to use and has very useful features you can't find anywhere else. Libsyn sets the standard as far as we're concerned."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elle Eminense",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T20:38:12.000Z",
          "Titre": "Brilliant customer service",
          "Contenu": "Brilliant customer service. Quick replies and excellent guidance on getting my issue fixed. Walked me through the issue and even educated me so I have the wisdomFor the future!I love this platform!!"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Micheal Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T02:11:00.000Z",
          "Titre": "Personal and human support",
          "Contenu": "Customer support was personal and human, so the question was answered quickly, and we were able to do what we were trying to do easily and quickly. Fantastic in this world of chat bots and passing-the-buck."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Subjective Professor",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T17:18:59.000Z",
          "Titre": "Only started using it but it's great",
          "Contenu": "Only started using it but it's great, does a LOT of work for you as far as uploading to various platforms.I hope to take advantage of the other programs/apps offered by the site, but uploading to the other platforms  ALONE after a SIMPLE fast set up is well worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Kay Holmes",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T05:22:35.000Z",
          "Titre": "Been a user for years!",
          "Contenu": "Each upgrade takes a few moments of patience, but it always comes together in the end. I've been hosting podcasts here for years and it works fantastically for me!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Sponseller",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T21:55:56.000Z",
          "Titre": "Great experience with Libsyn",
          "Contenu": "I've used Libsyn since I launched my podcast two years ago - fantastic service.  It always works and does what they promised.When I have an occasional question for support, they respond fast (sometimes under 10 minutes)!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grace Puerto",
          "Nb_Reviews": 5,
          "Date": "2023-09-01T22:33:42.000Z",
          "Titre": "Excellent support!",
          "Contenu": "This was our first time launching a podcast and we ran into issues with our first episode. We were amazed at the speed and efficiency with which our issues were handled by Rich H. with Libsyn podcaster support. He fixed everything and had us up and running same day. We are very pleased!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "eileen",
          "Nb_Reviews": 2,
          "Date": "2023-08-15T22:45:42.000Z",
          "Titre": "I love Libsyn",
          "Contenu": "I love Libsyn. I have never had an issue with posting any content. there plans are affordable and overall, the platform is vase. There site is easy to navigate through and they are always reaching out about updates or any major changes. I love my podcast being on this platform. I had a conversation with Rich about an issue I ran into by my own fault. He was so accommodating and helped me navigate through the subscription plans. I love how they have multiple platforms for your podcast. It has helped me grow to the fact that now I have because of this platform offers. Thank You guys so much for providing podcasters who are new to the business a wide variety and always available to help. I stared a year ago. I have no regrets with them. I encourage any new podcast this platform is affordable, easy, and amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nataliya",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T22:20:20.000Z",
          "Titre": "Great communication",
          "Contenu": "I received a clear answer to my question and an explanation of how my issues could be solved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsay Lee Bowden",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T15:44:39.000Z",
          "Titre": "Chris J",
          "Contenu": "Chris J. quickly and accurately answered my question! He helped me even though the issue wasn’t with Libsyn! Excellent customer service 10/10"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Elle",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T23:00:22.000Z",
          "Titre": "Quick and great support",
          "Contenu": "I had some technical problems and contacted the support center by email. They answered and helped me  very quickly and the problem got solved very easily. It was a great experience to get this support and that they took really care about my problem.THANK YOU!:-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Beatty",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T19:11:50.000Z",
          "Titre": "Beginning to end help!",
          "Contenu": "Rich helped me through the process of redirecting my client's podcast, from giving me the best options to reopening the ticket when I made an error to double-checking that I had finally done it correctly.  That last help really gave me peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Franz Sidney",
          "Nb_Reviews": 10,
          "Date": "2023-08-08T19:18:02.000Z",
          "Titre": "I had to ask a question related to my…",
          "Contenu": "I had to ask a question related to my podcast RSS and within minutes I received a polite and helpful answer from Chris. In these days of bots and automation I am so grateful I could talk to a human and be understood!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine Whitmarsh",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T19:07:47.000Z",
          "Titre": "Service Second to None",
          "Contenu": "By far the best customer service from a tech provider I've ever received - fast, personal, no templates/form emails, just smart, thorough, knowledgeable, caring team members. And the Libsyn interface and features are fantastic, super easy to use. No complaints from this happy customer and I recommend Libsyn to anyone in need of a podcast provider!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Khadaura",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T20:24:07.000Z",
          "Titre": "Everything, Everywhere, All At Once!",
          "Contenu": "I wanted to level up my podcast game a year ago and Gary Vee recommended Libsyn, so I took the leap. No regrets and their user interface is easy to navigate. I record with easy and it is distributed with even more ease. Their support team helped me from the ground up and STILL supports me with the same respect as Day One. I trust them with my vision, mission and purposes in life! Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Bowser",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T00:22:05.000Z",
          "Titre": "Makes podcasting easy and smooth.",
          "Contenu": "Makes podcasting easy and smooth. I appreciate it how easy you make it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Brookins",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T04:16:02.000Z",
          "Titre": "My daughter recommended",
          "Contenu": "My daughter recommended. It has been easy. I had difficulty finding my RSS feed initially. It wasn't obvious, I would have liked something saying this is where your RSS feed is. However, it has been super easy to use and worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valerie",
          "Nb_Reviews": 6,
          "Date": "2023-08-03T02:36:22.000Z",
          "Titre": "Have been a customer for three years",
          "Contenu": "Have been a customer for three years. Libsyn customer service is outstanding. Plus they have Dave Jackson who has his podcast school help out also.  What a team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yolanda Russell",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T15:42:03.000Z",
          "Titre": "I had a great experience with Libsyn’s…",
          "Contenu": "I had a great experience with Libsyn’s support. I had a question, it was answered promptly and with the information necessary for troubleshooting. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Warren Moodliar",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T20:15:10.000Z",
          "Titre": "Amazing Tech Support",
          "Contenu": "Amazing support to rectify my account. Really helpful and support as good as the service!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tammie Gagnon",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T21:30:00.000Z",
          "Titre": "Exceptional Customer Service",
          "Contenu": "Had a question regarding scheduling and received a response within a few hours . Chris J went above and beyond to answer all my questions . Great customer service"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Ascua Dorada",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T00:22:56.000Z",
          "Titre": "Prompt response and very attentive",
          "Contenu": "Although I am not a paying customer yet, the support team at Libsyn has been very useful in helping me with my email change issue.  Thanks so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kit crumb",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T00:01:24.000Z",
          "Titre": "For 4 years of with Libsyn = over 200,000 listeners",
          "Contenu": "For 4 years I ran True mysteries of the pacific northwest, then Kit's Myths and Mysterys...where I had over 200,000 listeners. I have vacationed and am starting a new."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Laurie",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T17:18:39.000Z",
          "Titre": "Superior Customer Service and Support",
          "Contenu": "Ben is very responsive and offers superior support with all things Libsyn.  Goes above and beyond.  Thank you Ben!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 5,
          "Date": "2023-07-07T16:53:50.000Z",
          "Titre": "Love the support I get from Libsyn",
          "Contenu": "Love the support I get from Libsyn! Every time I contact them they are super fast at getting back to me and get whatever I have a question about answered and solved super fast. Chris Jones happened to be who helped me this time, he has helped me many times before and is great!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Amy Purdie, Brand Explorer",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T23:08:47.000Z",
          "Titre": "Easy peasy podcasting",
          "Contenu": "As a brand new podcaster I found using libsyn super easy to do. It's not hard, I can schedule podcasts, upload artwork, see stats and make sure that my podcast shows up in all the places. What more do you want?!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Molly E.",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T19:18:55.000Z",
          "Titre": "Support team is helpful and responsive.",
          "Contenu": "The Libsyn support team has been very helpful on two occasions. They were very responsive and resolved the issues quickly. Today, they helped resolve a link issue quickly. My team and I are impressed with how soon everything was fixed. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Kyle",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T21:56:17.000Z",
          "Titre": "I’ve found Libsyn to easy to navigate…",
          "Contenu": "I’ve found Libsyn to easy to navigate and very responsive when I’ve had questions. I would highly recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sonia Flores",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T20:46:09.000Z",
          "Titre": "I love the promptnesst to my question",
          "Contenu": "I love the promptness with which I was contacted across several emails. I was able to get an answer very quickly.We need more support like this everywhere else. Thanks for setting a great standard!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T19:46:01.000Z",
          "Titre": "a fabulous support response from libsyn…",
          "Contenu": "a fabulous support response from libsyn - i feel more confident using my account and know there is a good team to help me as i master podcasting!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joan Posivy",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T23:44:56.000Z",
          "Titre": "Fast response",
          "Contenu": "I've been a Libsyn customer for just over 1 year and every time I've needed to reach out to Support for help, the response has been quick and very helpful. (Thanks again for your help today, Ben H.)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bret Williams",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T19:04:46.000Z",
          "Titre": "By far the best support I’ve ever had",
          "Contenu": "By far the best support I’ve ever had.  Dave not only addressed my issue, he took a deep dive into my feed and found solutions to problems I didn’t know I had. It was like going to a good mechanic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucinda",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T18:20:32.000Z",
          "Titre": "Chris was very helpful answering my…",
          "Contenu": "Chris was very helpful answering my questions about Apple subscriptions. In fact, every time I need help, the associates are knowledgeable and courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mario Zamarron",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T19:33:51.000Z",
          "Titre": "Ben was quick and efficient in getting…",
          "Contenu": "Ben was quick and efficient in getting my issue resolved and getting me back up and running. Thank you Ben!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GowerCrowd",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T23:17:38.000Z",
          "Titre": "Superb platform for podcast syndication",
          "Contenu": "Superb platform for syndicating podcasts. Easy to use and amazing customer support. I have been, and will continue to be, a loyal user and evangelist for Libsyn."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Ireland",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T15:09:47.000Z",
          "Titre": "Ease of use!",
          "Contenu": "The entire process has been so user friendly. I really enjoy using this platform."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Shira Cohen",
          "Nb_Reviews": 5,
          "Date": "2023-10-10T16:59:59.000Z",
          "Titre": "Great people",
          "Contenu": "Great people, not bots, and wonderful podcast platform! Have been with them 4yrs and always happy!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michelle Gregory",
          "Nb_Reviews": 11,
          "Date": "2023-05-16T14:49:18.000Z",
          "Titre": "Everything you need at the right price",
          "Contenu": "I have been using Libsyn for three years and love it.  Even the lowest price package (+ analytics) is enough if you have a basic once a week podcast."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Marie-Claude Lessard",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T17:20:56.000Z",
          "Titre": "Above and beyond",
          "Contenu": "Customer service was very quick to resolve my issue and went above and beyond my request.  Impressed!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jorge",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T23:15:26.000Z",
          "Titre": "Nagging Problem Fixed Quickly",
          "Contenu": "We've had a nagging file problem that was resolved very quickly after raising it with the team. Really appreciated the response."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Rojda Cetindag",
          "Nb_Reviews": 7,
          "Date": "2023-07-07T16:17:09.000Z",
          "Titre": "Abolutely amazing customer service",
          "Contenu": "Abolutely amazing customer service. I always get very fast answers to my questions. A very friendly customer service. I  am very thankful and happy using libsyn."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johanna",
          "Nb_Reviews": 4,
          "Date": "2023-10-20T15:22:09.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Understand the boundaries of my storage space. Easy to upload and publish."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dianne",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T15:32:49.000Z",
          "Titre": "I started my podcast in 2017 and Libsyn…",
          "Contenu": "I started my podcast in 2017 and Libsyn was my feed.  In all these years, things ran so smoothly I had no reason to contact Customer Support.  Due to a change in my team that uploads my shows, I have needed to contact support.I have been online since the mid 90s and have seen a lot come and go.  This level of support that Libsyn offers is like gold to have as a resource.  I am thankful for my decision years ago to host my podcast on Libsyn. I never needed to contact them before and now that I have, they are the best and some of the nicest and smartest people you will find in the podcast world.In case you haven't noticed, now everyone and their dog is coming up with a podcast.  And every company in the world also wants in on podcasting.Libsyn will give you the support you will need, I contacted them because I was in a jam with a staff change and they had my back 100%.The internet is full of companies that get into a hot market to only later crash and burn.  I worked in Silicon Valley, that is how it works, when the people offering the \"free\" stuff, crash and burn, so does all of your work with them.  I am glad I found LIbsyn because when I needed them recently, they were there with the correct answers, not just any answer;)"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Totally Tanked",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T05:41:53.000Z",
          "Titre": "Friendly and efficient help",
          "Contenu": "Friendly and efficient help that resolved my issue.Libsyn customer services has been fantastic all the years I've been with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheri Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T19:57:23.000Z",
          "Titre": "New Billing Info and Re-Subscribe",
          "Contenu": "I emailed Ben for support and he replied promptly with clear directions. My issue was resolved simply and timely. Thanks so much for your courteous response!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Romaine",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T18:18:13.000Z",
          "Titre": "Libsyn makes it easy",
          "Contenu": "Libsyn makes it easy. I have found Libsyn to be easy to use and understand. It’s a one stop shop for publishing your pod across all the major platforms."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaelyn Cochenour",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T22:36:19.000Z",
          "Titre": "I got through support",
          "Contenu": "I got through support. He even followed up to let me know when my question was fixed! Thanks so much Ben!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Aylward",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T22:06:08.000Z",
          "Titre": "Quick, clear, precise and caring",
          "Contenu": "Rich responded very quickly with clear and precise communication and then followed up equally as promptly and accurately all with a genuine caring tone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 5,
          "Date": "2023-09-04T22:26:40.000Z",
          "Titre": "Love Libsyn!",
          "Contenu": "Thank you Rich H. for your help and assistance, also appreciate the support from Libsyn!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Paula Fyans",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T21:44:00.000Z",
          "Titre": "Great responses online whenever I run into difficulties or have a question",
          "Contenu": "Very prompt and accurate help whenever I have a query or a problem about my podcast feed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Patterson",
          "Nb_Reviews": 3,
          "Date": "2023-06-28T17:03:45.000Z",
          "Titre": "Chris Jones Was Quick and Amazing!",
          "Contenu": "Chris Jones provided quick and decisive help - even when the problem was on my end. He represents Libsyn well!"
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T14:23:07.000Z",
          "Titre": "Responsive and Professional",
          "Contenu": "Responsive, professional and answering the questions asked in a way that led to quick solutions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marshall Schott",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T20:43:47.000Z",
          "Titre": "Amazing & fast customer service!",
          "Contenu": "Had an issue that I submitted a support ticket for, and within 5 minutes I received an email saying the issue was fixed. Amazing!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "R. Kahn",
          "Nb_Reviews": 16,
          "Date": "2023-07-10T16:24:10.000Z",
          "Titre": "A SYSTEM THAT REALLY WORKS WELL",
          "Contenu": "It has proved exactly what we wanted to launch our podcast series 'Walk The Talk'. Efficient, helpful, does what it says on the tin."
        }
      ]
    }
  ]
}