{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "liquidweb.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chiquita Oblitas",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:36:21.000Z",
          "Titre": "You won't get the support they tell you.",
          "Contenu": "The only thing that matters to me is support. This company pitches 100% U.S. based support. I have called support at least 7 times. NOT ONCE did I get someone in the U.S. NOT ONCE! If you're willing to suffer with the mind-numbing experience of offshore tech support, you might as well hire another hosting company and save the premium that these people charge for supposedly offering a superior experience."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "It's a beautiful world",
          "Nb_Reviews": 7,
          "Date": "2023-12-13T05:04:56.000Z",
          "Titre": "Stay Far Away",
          "Contenu": "Stay Far AwayHosting a VPS server for a single URL initially cost $59, but the price increased to $76 without any apparent justification other than CPanel increasing their prices.  Dissatisfied with this unexplained increase and frustrated by the subpar customer service, I opted to switch to a different hosting company, which I am way happier with.1.\tThe decline in customer service quality became evident during the COVID period, with support staff scattered around the globe, It's like they're playing a global game of hide and seek, and nobody really knows what's going on. The misinformation provided by the team was particularly frustrating.2.\tEven if you are fortunate enough to escalate an issue to Senior Tech Support, the process involved jumping through hoops to get to the same person who has been dealing with your issue as no one is willing to provide their ext. number. So each time you call you get a subpar person who has to verify you every time you call. 3.\tSince the onset of the pandemic, the tech support team seemed to transition into sales roles, actively promoting non-essential products instead of resolving the immediate technical problems.4.\tAdding to the list of grievances, my account was neglected to be deleted despite numerous emails and phone calls requesting cancellation. Even after 30 days and having migrated all my data out, the account still remains active, necessitating further contact with support just to terminate the service.For those seeking a provider synonymous with poor service, misinformation, disarray, and unwarranted headaches, this company is the perfect choice."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T18:35:35.000Z",
          "Titre": "Poor QOS",
          "Contenu": "Poor service, downtime, random support staff handing ticket every few hours, over priced."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Iskan",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T01:56:52.000Z",
          "Titre": "I strongly advise against using Liquid…",
          "Contenu": "I strongly advise against using Liquid Web's Dedicated Server with fully managed support. This company seems to favor new customers, often neglecting existing ones. My experience reflects this, as my requests (Ticket: 13082580) have been consistently overlooked, even for simple tasks. The account managers, Nathan A. and Steven L. have demonstrated a lack of professionalism and responsiveness, failing to reply to emails and exhibiting arrogance. For nearly five months, I have been attempting to obtain a quote for migrating our server to a new one. However, the account managers appear more interested in extracting additional fees, leveraging the complexity of migrating my current server. Consequently, I am in the process of moving my dedicated server services to a different provider to avoid further interactions with these unscrupulous individuals. Iskan."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jan",
          "Nb_Reviews": 3,
          "Date": "2023-11-12T04:52:19.000Z",
          "Titre": "Managed Dedi Server Fiasco",
          "Contenu": "I moved a large client on a managed dedi server to a managed dedi server with LW for extra support and expanded features. I was mislead and lied to the whole way. If I didn't know the right question to ask, they took advantage and did not educate me so I could make an informed choice. I did a lot of research but it was an area that was beyond my technical expertise. The migration was a nightmare but I hoped that it would get better once settled. Not hardly. They have a wonderful Tech Support team but they cannot change the short-comings in the server and lack of features, way less than what we moved from. The stress and problems this has caused is tremendous."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Manny Diego",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:09:02.000Z",
          "Titre": "Liquid Web has singled us out",
          "Contenu": "Liquid Web has singled us out, targeted us, and requested personal information that is not standard nor required, as stated in their public privacy policy.  We were looking for an alternative provider other than Godaddy, so we pre-paid LiquidWeb for a 3-year subscription to use a Virtual Private Server (VPS).  They told us that we were a fraud, refused to tell us why, and immediately mandated that we email them two government-issued identifications.  NOTE: Their request is not an industry standard to our knowledge with any other server hosting providers such as Godaddy.  They also have no public privacy policy to ensure safeguards for requesting and storing government identifications.  We asked if they could provide a secure encrypted way to send them two forms of ID, and they would not provide one.  So we offered to send them other forms of identification that are less sensitive in nature, and they rejected them.  They refused to tell us what precisely they are looking for in our two forms of government ID to make sure everything is correct when purchasing VPS services, which couldn't be accomplished by alternative methods.  Their public terms of service don't require any form of government ID from all of their new and existing customers.  NOTE: They are not a financial institution where requesting government identifications is part of KYC and industry standards.  We also never gave them permission to pull credit, etc.  We feel targeted, mistreated, and discriminated against.  They selectively created barriers to entry and mandates for us.  We have done them no wrong and provided all the standard information stated in their Privacy Policy under the Customers section.  We have all the email evidence to support this complaint."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T20:09:27.000Z",
          "Titre": "WiredTree was much better than Liquid Web",
          "Contenu": "Was with WiredTree which was a much better company in terms of service before Liquid Web bought them out. The co kept us on an old overpriced plan and refused to help us get a better plan or migrate. The only offer was to signup as a new client and migrate everything with 0 help from them or their sales team. The so called account representative even stopped responding to emails, hence we cancelled.Bottom line is they do not care for existing customers, all their efforts are placed into onboarding more unknowingly customers that will get white glove service on the way in, but no service after that.They will milk you for all the overpriced charges they can until you seek something better."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Barrick",
          "Nb_Reviews": 5,
          "Date": "2022-12-04T00:22:21.000Z",
          "Titre": "Worst support - treat clients like horribly",
          "Contenu": "Worst support, they treat you like an absolute moron, thinking you are ok with a copy paste status from 7 hours ago, and telling you to deal with it.  No options no real updates.  WE all know they resell the exchange services from rackspace but at least they have a crappy work around and gave customers better updates.  Hopefully we can move everyone off of your servers so you feel the result of your action."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "asd",
          "Nb_Reviews": 3,
          "Date": "2023-03-19T00:26:01.000Z",
          "Titre": "This used to be my favorite company…",
          "Contenu": "This used to be my favorite company because their support team was truly heroic. After covid support became bogged down. Every single time I call them nowadays I get somebody who is lazy and unmotivated and fails to solve my problem and I often find the solution myself. I'm just so tired of the situation and I thought I would come on here and warn other business owners. Most people don't have the time to come on here and complain because they have busy schedules and better things to do."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cory Pantelakis",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T01:56:33.000Z",
          "Titre": "Ticket 12350384 took 5 days to resolve",
          "Contenu": "The Ticket 12350384 opened 5/19/23Finally part 1 resolved 5/24/23 5 days later.  :( 1) took numerous call ins due to inactivity or delays that were caused by lazy staff who did not read prior ticket notes where needed details or authorization was already given.2) Level 1 Technicians were easily confused, not able to help properly and afraid to seek help and rather delayed... delayed... delayed- I Asked for Support Managers and had initial response that was professional and appreciated but then no follow up by support management 3) When I finally requested a Level 3 Technician, Alex Silkin was the only person who was excellent in both support (stayed after shift for nearly 2 hours) and follow up communication as well as taking initiative to check the ticket when in the following day.  Can not give high enough praise re Alex's work ethic!"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Francisc",
          "Nb_Reviews": 3,
          "Date": "2023-06-06T13:18:59.000Z",
          "Titre": "Looking for another hosting company ...",
          "Contenu": "Have been with Liquidweb for a few years and was very happy.Several things lead to a frustrated customer.Since December when our emails got lost (still are actually because the .ost files can't be imported in our new accounts), I've spent my time with the support team on the website chat and in tickets.Convinced me to upgrade for a new server and then the migration team didn't take the proper actions, our websites was offline for several hours today (losing business is not something ideal for a business owner...)Not to mention the big loading time when trying to update pages on the website ...The service and the competence of the people involved has dropped considerably.Take for example ticket no: 12419834"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John P.",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T15:35:10.000Z",
          "Titre": "Liquid Web is the most expensive web host. + Tax",
          "Contenu": "We Left Liquid Web because we found a web host that offered a fully managed VPS with a better configuration than Liquid Web at 1/3 the price & NO TAX! Liquid Web was charging us $150 s month for their (lowest VPS Configuration) +TAX. Constant upselling, scheduled and unscheduled updates and service interruption at the worst times. Your biggest problem will be leaving Liquid Web. They will grill you and treat you like a criminal because you want to close the account. It took 9 business days for them to approve closing the account. There are better VPS pricing than Liquid Web. One of the most expensive Hosting companies we've ever seen."
        },
        {
          "Note": 1,
          "Lieu": "DO",
          "Pseudo": "ari",
          "Nb_Reviews": 7,
          "Date": "2022-07-11T22:41:57.000Z",
          "Titre": "Very sad!",
          "Contenu": "Very sad!, A once great company has gone down the drain, they have outsourced their support to India, and we all know how that story ends.  I have been with this company for 5 years and their negligent server management has caused my websites to basically become vulnerable and my SEO rankings are falling by the day. The damages to my company are mind boggling. My downgrade request via ticket number 10728244 has also been ignored."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "It's a beautiful world",
          "Nb_Reviews": 7,
          "Date": "2023-11-15T11:17:51.000Z",
          "Titre": "Stay Far Away",
          "Contenu": "Hosting a VPS server for a single URL initially cost $59, but the price increased to $76 without any apparent justification other than CPanel increasing their prices.  Dissatisfied with this unexplained increase and frustrated by the subpar customer service, I opted to switch to a different hosting company, which I am way happier with.1.\tThe decline in customer service quality became evident during the COVID period, with support staff scattered around the globe, It's like they're playing a global game of hide and seek, and nobody really knows what's going on. The misinformation provided by the team was particularly frustrating.2.\tEven if you are fortunate enough to escalate an issue to Senior Tech Support, the process involved jumping through hoops to get to the same person who has been dealing with your issue as no one is willing to provide their ext. number. So each time you call you get a subpar person who has to verify you every time you call. 3.\tSince the onset of the pandemic, the tech support team seemed to transition into sales roles, actively promoting non-essential products instead of resolving the immediate technical problems.4.\tAdding to the list of grievances, my account was neglected to be deleted despite numerous emails and phone calls requesting cancellation. Even after 30 days and having migrated all my data out, the account still remains active, necessitating further contact with support just to terminate the service.For those seeking a provider synonymous with poor service, misinformation, disarray, and unwarranted headaches, this company is the perfect choice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pasquale L Nocito Jr",
          "Nb_Reviews": 4,
          "Date": "2023-06-01T19:50:56.000Z",
          "Titre": "Addition of Nexus with migration made us leave",
          "Contenu": "I was with you guys forever but as soon as you pushed us and forced us over to Nexus and messed up our migration expected us to pay for 3 months while you figured it out I have to give this review. You also changed your ticketing process where you have to log into confirm every time you enter a ticket. And then your system doesn't recognize that it's the same ticket or conversation. This is absolutely ridiculous and we left because of itResponse to your answer. It's interesting how fast you get back because I left a bad review. When I can't even get a phone call or anything when I put in multiple tickets.  This point we have completely left and migrated and there's nothing left for you to do. You had your chance"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keremy Stiles",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T03:13:40.000Z",
          "Titre": "SAVE MONEY AND FIND ANOTHER WEB HOST",
          "Contenu": "Unfortunately The Mainstream Does Not Know that LiquidWeb.com charges 3 times as much for any of their servers, especially VPS. Their lowest end costs $150 + Tax per month. Charging tax is against the law for anyone, you dont have to be a reseller in most if not all states. And they Push for proof to be exempt from a charge that shouldn't exist. The IRS will eventually catch up with their practice of charging tax and then it will be bye bye!I have never heard of a web hosting company charging tax. I am with another hosting comping charging me $50 per month for a high end VPS with 8 Gig of Ram & 250Gig Hard Drive. Never get up sales or up charges or shut down for maintenance."
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Marios Apatsidis",
          "Nb_Reviews": 4,
          "Date": "2022-12-12T08:40:44.000Z",
          "Titre": "They did 4 big mistakes in my 10 days…",
          "Contenu": "They did 4 big mistakes in my 10 days of experience. One of them was they accidentally charged me a very large amount of USD that was meant to be for another client, after apologizing the amount of money that went out of my bank never came back the same, was and still missing money that they are not willing to return. What I know is when somebody makes a mistake he is responsible to pay for the side costs. Too much talking from the sales dept before I purchase some service, but in reality what sales promise is not close to the reality. Stay away from this company!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael R",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T01:33:03.000Z",
          "Titre": "OVER PRICED & LOW QUALITY CUSTOMER SERVICE, NOT  RECOMMENDED.",
          "Contenu": "LOW QUALITY CUSTOMER SERVICE.We have been a liquid web customer  for hosting for 10+ years. Support was generally OK and rather good. However over the last 2 years customer service has been  almost completely outsourced from the USA, and the quality of tech support and customer service has steadily  deteriorated beyond recognition. It is now very low quality, poor to non existent tech support. Now when you call in for a tech support issue, thier response is typically sorry, that's “OUT OF MY SCOPE OF SERVICE”  for pretty much everything!  I no longer recommend Liquid web hosting to anyone. The hosting service is way overpriced compared to it's competition and now with the low quality service you get, it's not worth it. You should definitely look for a better hosting company elsewhere and not use Liquid web."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vivek",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T02:46:57.000Z",
          "Titre": "Inaccurate Price and Provisioning…",
          "Contenu": "Inaccurate Price and Provisioning estimates: The initial pricing and provisioning estimates proved to be misleading. Their behavior raised doubts: While their response times were impeccable during the purchasing phase, the situation took a downturn after the credit card transaction went through! Suddenly, we were confronted with delays in procuring parts, and the clock had already begun ticking on the subscription. Their initial estimate of 1-2 days of provisioning has now stretched into a frustrating one-week delay, with no progress in sight but they were happy to take our money. Additionally, it's crucial to watch out for concealed expenses related to backups that are not counted in the advertised costs. I initially started with a single server to assess their service quality before committing to larger orders, but unfortunately, they've already left me feeling let down. I'm glad I did not place a large order with them. [Ticket #: 12760779]"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "MA",
          "Nb_Reviews": 12,
          "Date": "2022-08-13T07:43:45.000Z",
          "Titre": "been with them for 7 years...",
          "Contenu": "been with them for 7 years...now, support is extremely poor.tried providers our there and find out, others are now cheaper and better, much better.every opportunity to extract money will be used.used to be great. projectile, going down."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dylan Safra",
          "Nb_Reviews": 2,
          "Date": "2022-09-18T01:14:11.000Z",
          "Titre": "LiquidWeb completely destroyed my livelihood…",
          "Contenu": "PLEASE, DO NOT HOST WITH THEM - DO NOT LET THIS HAPPEN TO YOULiquidWeb completely destroyed my livelihood yesterday. I received a notice that my account with them was being terminated and I had 24 hours to move over 200,000 files. I still do not know why my account was terminated. The managers refused to speak with me about it because I was \"no longer a customer\". I was able to get the files but they completely destroyed my databases with no remorse. After years of being self-sufficient, LiquidWeb destroyed my livelihood in 24 hours with no explanation and no remorse."
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "Michal Krcmar",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T12:31:55.000Z",
          "Titre": "I contacted support regarding to the…",
          "Contenu": "I contacted support regarding to the settings, after the account was created, payment was charged and account was blocked for no reason. You want to get the new account, send same amount again :-)It is 14 days since that and I still did not receive money back. First I get info money need to be refunded on 30th at the latest. Now I have info I have to contact the bank as the money are in block in escrow money should be sent 14 days ago. And solve everything on your own dear client we dont care by.If this is customer support approach to such a simple thing as payment for new service, I dont want to see what support I will get if there will be any more difficult problem connected with service itself. I cannot recommend that company to anyone as it is clear representation of complete dilettantism from the start."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anna",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T21:23:18.000Z",
          "Titre": "Terrible service, terrible company",
          "Contenu": "Terrible service. Refuse to help in any way. Refuse to let me talk to the manager."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Sao",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T20:38:58.000Z",
          "Titre": "Not the same company as it was before Covid",
          "Contenu": "I can't trust Liquid Web anymore and I advise everyone to look elsewhere. I signed up a week ago (Aug 14, 2023) because prior to 2020, I found Liquid Web to be the best hosting company and was using them for years. I immediately noticed a change on the first day of signing up. The first day of signing up for the 2 GB RAM VPS General Essential plan, they said I had to cancel my account twice because their team weren't able to \"set up provision\" as they've failed both time. No biggie, but they kept charging my card rather than just handling it internally. I had to voice this to them and get my refunds. I should have walked away at this point, but I gave them another chance and that was a mistake.When my account was activated, I was only able to log in once into InterWorx before it suddenly went down. Their support team kept saying someone new picked up the ticket and it was as if no one cared or knew what to do. My Interworx login has been down for the entire time. One support person flat out lied to me that the site was up, while the rest (including online websites to check to see if sites were down) confirmed that the site was still down.I've requested to cancel and have them issue me a refund, but they are not issuing me a refund.Everyone, PLEASE stay away. This company is no longer the trusted Liquid Web it used to be prior to 2020.Edit: They are issuing me a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "unhappy",
          "Nb_Reviews": 5,
          "Date": "2023-03-28T19:20:52.000Z",
          "Titre": "Support is absolute garbage",
          "Contenu": "When I moved to LW many years ago they had \"heroic support\" and it was true. Now they have some of the worst support I have ever had to deal with. Support reps are unable to resolve issues, tickets get opened and take days to resolve or are closed but not actually fixed. Its a total joke. If all you need is hardware there are cheaper providers. Dont come here for support."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean McSweeney",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T01:29:50.000Z",
          "Titre": "Fraudulent activity from Liquidweb",
          "Contenu": "We were using Liquidweb for server hosting for some time, then switched completely to AWS. We canceled in December 2022 through their online portal. For four more months they continued to charge us $175/mo. Once we realized what was happened, contacted them and they said that they were charging us for a firewall for a server we didn't have and they claimed we had not canceled everything and refused to refund it. They also said we had to cancel again, even though we had received the termination email 12/23/2022. We terminated everything visible in their portal, it didn't notify us that there was anything else, and when we went into the portal to review our account, it did not show anything active as a service so we couldn't even know there was something still \"active\" after termination. Their support even acknowledged IN WRITING that we could not have known there was a service we were still be charged for through their own portal. We reported all this to the credit card company, got a credit, and LiquidWeb just re-charged us for everything the credit card had credited back after they lost. Now we have to go through the whole dispute process with the credit card company again. This is beyond poor customer service to fraudulent behavior."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Brad S.",
          "Nb_Reviews": 9,
          "Date": "2023-10-19T01:15:02.000Z",
          "Titre": "Unbelievably bad customer service",
          "Contenu": "I purchased a managed dedicated server with CentOS and WHM/cPanel on a 50% off for the lifetime of the server Black Friday special. I have been a Liquid Web customer for more than twelve years, and this is my fourth server with them in this time.Six months later, the server could not be updated because CentOS 7 is the last version WHM/cPanel is going to support. cPanel 110.0 is the last version to support CentOS 7. The current version is now 114.0.8.This was announced by cPanel at least nine months before my purchase, so Liquid Web had to have known yet continued to sell servers with cPanel and an EOL operating system.I cannot update to benefit from new features in cPanel, and security will become an issue in less than a year when support for security patches is completely discontinued. This is on a box that would typically have a 5-6-year lifespan for someone like me.Liquid Web insists that I need to buy a new server to update the OS and refuses to carry my lifetime discount over to the new server. I am being financially punished for their mistake, and it's going to cost me thousands more than it should.This is in addition to the complete fiasco of getting this box set up. The wrong control panel was installed, so the whole server had to be reformatted, the box was not configured properly, and getting the billing right with the Black Friday discount took seven months of arguing back and forth with Liquid Web that this promotion had even existed. I have close to two dozen tickets dealing with the issues surrounding this server.The ticket I opened regarding this current problem is now well over two months old, and weeks pass by without any reply. This is despite having written to Liquid Web support through the chat several times to ask for someone to look at the open ticket. I had to open another ticket to bring attention to the existing ticket, and that ticket is now a month old and going nowhere.The Liquid Web sales team refuses to help, as they always do in situations like these. I have asked to speak to management several times, but my requests have been ignored.Needless to say, I am not a happy customer and I am once again considering leaving Liquid Web."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andres Zamriver",
          "Nb_Reviews": 3,
          "Date": "2022-09-12T02:08:03.000Z",
          "Titre": "The support from Diane Reacher was…",
          "Contenu": "The support from Diane Reacher was awful, didn't solve my issue, and I tried to refresh the support chat and she was the only one who attended my queries. Lately, I'm very disappointed with the support and their lack of support"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shawn Hansen",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T02:41:07.000Z",
          "Titre": "My Server Migration Took 19 Days",
          "Contenu": "My server migration took 19 days to complete, and on numerous occasions Liquid Web Tech Support and Migration failed to properly respond to ticket updates, requests for help, and reported issues.In addition, I am STILL battling with billing over a simple request for a prorated refund on the extra days that I was charged while permissions, scripts, pho, DNS, and other elements of the new server were overlooked, not installed, or otherwise not matched to the old server.It's simply unacceptable."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Marie Tejero",
          "Nb_Reviews": 3,
          "Date": "2022-12-03T11:23:54.000Z",
          "Titre": "A hell experience which you never wish to experience",
          "Contenu": "A hell experience which you never wish to experience.I’ve spent hours, days, and weeks to fix issues they’ve caused, wasted a lot of time and money.If you have an issue with LiquidWeb, I suggest you post your complaints here and on as many sites as you possibly can, as well as BBB.ORGMy story is very long, most people won’t even read it so no point, I’m going to make it very short and simple, I said what I said above, you should search deep and read reviews for this company before you decide to hire them, I think the reason they get a lot of 5 star reviews is because some of their staff are very friendly, but knowledge wise and support I would give them -10 if I had the choice.Just go to Google and search:LiquidWeb ReviewsLiquidWeb ComplaintsMAKE SURE! That you sort the reviews with the lowest first, there are lots of FAKE positive reviews online so I always sort and read the low star reviews first.And if LiquidWeb responds to this, I don’t have time anymore to waste replying to you therefore you will not receive a reply as you are useless."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Andy Berg",
          "Nb_Reviews": 11,
          "Date": "2022-07-14T17:11:26.000Z",
          "Titre": "Beware of their Billing Changes",
          "Contenu": "I have had a server with them for some time and lately strange things started happening. They suddenly snuck in a charge for almost $40 a month for something that is already included on my server. When I asked why that was being billed when it is already included, the response was that it was supposed to be included in my bundled package, but it was never installed, but now it has been set to $0.00 again on my invoice. This is the worst thing I have ever heard. They tell me that when I ordered this server, it was supposed to come with something, they didn't install it and then now they are still keeping it on the invoice, but they are kind enough to mark it as $0.00 because it wasn't installed and is still not installed. I think they are trying to bill customers for things so they can make more money. Go over your invoices people. Beware! I would recommend checking your invoices once a year when you do business with this place."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Edward Tob",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T12:54:18.000Z",
          "Titre": "There are many fake reviews posted…",
          "Contenu": "There are many fake reviews posted here, read the negatives first, don’t believe everything you see in the positive reviews which are many posted by employees."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Irene Barbieri",
          "Nb_Reviews": 2,
          "Date": "2022-07-22T20:45:57.000Z",
          "Titre": "Buyer Beware! Fraudulent Billing",
          "Contenu": "I worked with Liquid Web for more than 12 years hosting my website. However, the last two years were a disaster. They managed to bilk me out of $2,000+ by fraudulently double billing me. It all started when they were having problems with hosting my site and could not figure out what the issues were. Then they told me it was because my server was old and beyond useless and needed to be replaced. I gave them the ok and they created a new server. At the beginning of this process, which took about 3 weeks, I received a form type letter which outlined in technical jargon what they were planning to do. At the very end of the letter buried in the text they mentioned that that they needed to receive notice to discontinue any older server to avoid double billing. Because I did not see this line in the letter I did not know to tell them to discontinue my old server. They require having your credit card information and so they deduct their fees every month. So for two years they took money from my account for the server they determined was useless. I tried to resolve this with numerous staff there but they blew me off every time saying that they don't give refunds. Their staff were rude and cocky. They are very sneaky in their billing practices and I suggest to everyone to carefully review your bills. You may find similar issues if you do. I am giving them one star for the services that were provided successfully in my first 10 years with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Busek",
          "Nb_Reviews": 3,
          "Date": "2023-03-14T23:08:56.000Z",
          "Titre": "Overcharged for years with unnecessary charges.",
          "Contenu": "03/14/2023 update: Liquidweb has been unresponsive in spite of their promise to involve management in addressing our complaint. We are forwarding documents to our attorney and anticipate a filing in our local Small Claims Court later this week. We will continue to update Trustpilot until this matter is resolved. 03/08/2023 We use Liquidweb cloud sites service. I feel they offer a quality product in terms of uptime and speed. However I have been frustrated by their Customer Service Department regarding the amount of our monthly invoices. The problem is that we have had two line items on our invoices for well over 5 years that apparently no one at the company could correctly explain. This week tech support finally gave us the answer- we have been paying for services on sites we are no longer even hosting. In 5 years we have been over charged by $4,440.00.These charges are for MSSQL storage and SSL certificates. Over the years we have questioned these line items, but we were never told they were for inactive websites. We were only told that they were necessary charges.On Jan 12, 2023 we opened up ticket number 11600106 to address possible overcharges. We were notified that only 1 person in the company handled potential cost reductions. Even though we have followed up at least 5 times, we have not heard a single word from this person.We are beginning to suspect that Liquidweb purposely overcharges clients.We placed a phone call to Liquidweb sales and got a new price quote for the services we are currently receiving. The quote for new service was issued in minutes. The prices on the new quote would save our company over $1700.00 a year.The purpose of this review is to finally get someone’s attention at Liquidweb. We are willing to stay with them at a renegotiated price. Hopefully current and possible future Liquidweb clients can benefit from our story."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Mick",
          "Nb_Reviews": 8,
          "Date": "2023-10-11T15:48:30.000Z",
          "Titre": "Failing at the basics",
          "Contenu": "Always interesting reading and comparing the lower and higher ratings. Difficult to reconcile them as being from the same company.And upfront – I am not a Liquid Web customer. My engagements with Liquid Web are escalations related to a serial spammer Liquid Web provides DNS and hosting services to.This spammer is known as a solo-ads person – Dominykas Gobe ala “Domas G”. For context – Google still returns links to old offers that Dominykas was flogging on WarriorForum. Dominykas has ignored every unsubscribe request I submitted over the course of a year or so.Having now reached out to Liquid Web a few times over the last year with well-evidenced and well-supported escalations, I can report that these escalations were all met with stony silence, and no action on Liquid Web's part. I know this because I am still getting up to ten spam emails a day from across multiple services that Liquid Web hosts for Dominykas.In my mind, points to the lower ratings probably being more accurate than the higher ratings. Some of the stories around their focus on revenue generation ahead of service supports that narrative. I imagine their relatively recent sale to private equity is probably making this worse.Regardless, I am not the only person reporting Dominykas’s spam emails to multiple spam reporting entities. And from what I am seeing, these reports are impacting deliverability.I imagine you want to give your online presence the best chance of success. You should be aware then that these deliverability impacts may potentially also affect your deliverability.Suggesting there are probably other providers you can find at the same or similar price points who will not carry equivalent risk. These providers may even deliver better service than the one- and two-star reviews here speak to because they can afford to pay service and support staff salaries instead of the private equity executive salaries that Liquid Web now also has to fund since Liquid Web sold themselves to a private equity fund.**Updated on 12-Oct-23.**Noting Liquid Web have asked for further details via Trustpilot - something like a reference number or email address. Otherwise TrustPilot will remove my review.I provided a reference to the email I sent to Liquid Web on 1-Aug 23 with the subject line,    \"Further abuse complaint Re: \"Abuse complaint | Serial spammer ignoring repeated unsubscribe requests over extended period (various, including domasg2.com, domsolo.com, domasg.com, and mailgobi.com)\".There was no response from Liquid Web to that email.That email included an earlier email sent on 17-Jun-23  with the subject line,    \"Abuse complaint | Serial spammer ignoring repeated unsubscribe requests over extended period (various, including domasg2.com, domsolo.com, domasg.com, and mailgobi.com)\".There was no response from Liquid Web to that earlier email either.There were other emails including my last on 16-Aug-23 asking for a status update seeing as I was still receiving spam.And yet again, no response from Liquid Web to that email either.They are consistent at failing at the basics."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2022-08-25T09:35:31.000Z",
          "Titre": "Standard of Support has fallen off a cliff. Be cautious when considerng buying Cloudflare via LiquidWeb.",
          "Contenu": "Although I left a good review 1+ years ago, ListHub's service has deteriorated dramatically. It seems they have outsourced Support to a very low-grade provider, who is just interested in reducing handling time, rather than solving the client's problem. First off, when you contact their support chat, the techs start providing answers, without waiting for the customer to advise the question.  So prepare yourself for the first 5 to 10 minutes to be a complete waste of time while the tech digs up a reply to a question you have not asked plus have no plan to ask!Second, anything related to buying Cloudflare via LiquidWeb, is a disaster.  Techs literally just send you a link to their internal set up documentation (which is either outdated or inaccurate) and don't wait for your question.   They send the link to the document and then terminate the call.  Shocking!!Third, if you do get a Tech to stay on the call long enough to read your question, then be prepared to get the wrong answer 4 times out of 5 (yes, literally) and be prepared for this to take days or weeks, rather than minutes or hours. Implementing a CDN is a little complex and their Support know very little about it.  In fact one of their sales/support team told me they couldn't provide support as it is a 3rd-party product.  LiquidWeb are happy to charge you, but Techs are not trained on providing Support.4th, the Techs always seem to default to responding about adding more DOMAINS, rather than adding more USERS to the account.  Despite us never ever asking about adding more domains and only asking about adding more Users (our Developers), the Techs always default to advising how easy it is to add more Domains. From our experience, DO NOT purchase Cloudflare via LiquidWeb as very few Techs know anything about it.  If any issues arise, it will take hours or even days to get the correct answer. In our case, it is months and we still don't have it resolved. We are still waiting to add more users and continue to be told about adding more domains.  But, we only have one domain!  We don't want to add more domains.  Please stop telling us about more domains!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ignatius",
          "Nb_Reviews": 7,
          "Date": "2022-08-23T12:30:40.000Z",
          "Titre": "Unreliable...",
          "Contenu": "I have been with Liquid Web since 2016.Today is 13 days since they send me an invoice. I ask support to give me a few more days to pay it. They answered that they couldn't and suspended me in the next few minutes.It is unfair to treat me like this, considering that I've been paying all my invoices for more than six years...UPD I asked to move my ticket to a supervisor and they answered:\"I will pass this ticket to our Senior agents. Their usual working hours are 12 AM - 4 PM EST Monday through Friday.\" [Ticket #: 10914685]Today is Sunday...Six years were good, but it seems like something has changed, and now LiquidWeb is no longer as impressive as it used to be. So... I'll migrate to another cloud servers provider.⚡️ UDP 2 (to Liquid Wed's comment below)Indeed, the support was very responsive to block my account:-----Sun, 21 Aug, 13:22Hello!I’ve got some issues. I’m going to pay early next week. Please don’t shut down the services.Sun, 21 Aug, 13:29The services weren't shut down yet though they will be shut down throughout this day. We can reactivate your account on 24 hours only if they get shut down, but no other extension is available.The services will be reactivated automatically upon payment. Thank you for your understanding!Sun, 21 Aug, 13:33 Your Account Is Now Suspended For Non-PaymentSun, 21 Aug, 13:31I’ve been your loyal client for many many years. You just can’t treat me like that.Sun, 21 Aug, 14:18I will pass this ticket to our Senior agents. Their usual working hours are 12 AM - 4 PM EST Monday through Friday.We thank you for your patience.-----It was Sunday..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C.B.",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T06:55:07.000Z",
          "Titre": "Liquid Web customer since 2016",
          "Contenu": "I have been a subscriber with Liquid Web for over 6 years maintaining a dedicated server account. If you are looking for an honest managed dedicated hosting company with truly great support, as a long-time customer I warn you to ignore the dishonest ads and stay away. This company is 100% Hustler with zero customer service integrity.Multiple times I have discovered that I had zero or outdated backups available. This has happened several times this past year alone. I keep reaching out to Liquid Web support to try to resolve the issue but most of their support agents are extremely rude and disrespectful to communicate with.Today I discovered again, by chance that my server had not been backed up in 72 hours (3-day old files). I contacted Linux support and tried very hard to explain (to an agent who seemed that she could not have cared less) that if I needed to restore one of my WordPress sites and that if a recent backup was not available, my business would be over - The Liquid Web support agent responded to me saying that \"... it was my responsibility to contact them and ask them to run a backup\". Her reply can actually be confirmed by their own call transcript if they recorded the call as they claim to do.Two weeks prior I contacted them to request support for my backup files and checked back an hour later and discovered their support agent deleted every backup file for every website on the server. Again ZERO backups were available. This can be confirmed by chat and email transcripts.I would have migrated away from this company a long time ago, but migration is not easy when you have large sites and also want to avoid risking DNS downtime. But being a Liquid Web customer since 2016 my business is now suffering by having to constantly police this issue with them. Until I can get my websites over to a new host, I will be taking my own backups manually and downloading them away from Liquid Web so that I can be sure I have backups ready when I need them.Email and chat transcripts can validate this review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JF",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T19:18:49.000Z",
          "Titre": "Customer Service Has Gone Downhill Bigtime…",
          "Contenu": "I’ve been a customer of Liquid Web’s for nearly a decade at this point and their customer service has really hit rock bottom as of late. I spend a decent amount of money every month on a dedicated server and in recent months our traffic has gone down and we no longer need such powerful equipment so I contacted them asking to downgrade our server letting them know it was urgent so we could complete the process before our next billing cycle. I wanted to start the process right that day but they said they couldn’t do it on the phone and my account had to be reviewed by a “downgrade specialist” that can only be communicated with via email. I asked them how long does it take for them to respond and they literally said “I don’t know.” I told them it was urgent and I needed to talk to someone asap and they said just open a ticket and someone will get back to me when they are available. Well I opened a ticket and it has now been 72 hours / 3 days and there is no response! Zero! Not only that but I called in at the 48 hour mark to see what was going on and they said they will have a supervisor look into it and reach out to me. That was 24 hours ago and no response!I called in again today about it and they said the same thing. A supervisor will contact you. I asked how long because this is what happened yesterday and I still haven’t heard from anyone and they said there is exactly 1 supervisor on staff and they are busy and they don’t know how long it will take!! This is a complete and total joke, a significant SLA violation and they clearly do not care about you if you want to downgrade.When I upgraded my server years ago it was very smooth. Now when they are faced with the prospect of losing money from me I can’t get any help.The support has been terrible. I have been on the phone with them for over an hour at this point just trying to get an answer on my original ticket that has not been responded to in 72 hours! And they keep telling me “I don’t know when someone will respond.” And “No one is available to help you.” Totally ridiculous. So ridiculous, in fact, that I have to waste more time coming on here to leave a negative review in the hopes of actually getting help from support.Happy customer of 10 years now unhappy customer on the verge of leaving for another company. Absolute pity…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T11:46:01.000Z",
          "Titre": "i dont can creat server and cloud"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Zain Zahid",
          "Nb_Reviews": 3,
          "Date": "2022-03-11T23:15:14.000Z",
          "Titre": "Unsatisfactory Support",
          "Contenu": "Unsatisfactory Support. The moment you have paid for a service within the whole company that has at least a 1000 employees, none of the senior managers are ever available to provide the support to their employees which a regular executive is not able to provide.It is extremely unacceptable and dissatisfying. I believe the only option left is to make a chargeback and find another provider."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ignatius",
          "Nb_Reviews": 7,
          "Date": "2022-05-01T23:04:41.000Z",
          "Titre": "I have been with Liquid Web since 2016",
          "Contenu": "I have been with Liquid Web since 2016. There was a great support team. However, something has changed.I wanted to clone my server to VPS, it there was some issues with that.The communication was extremely long. I had to wait for answers for hours and hours, so I needed to start a chat asking them to answer me through the ticket each day.I asked an agent on chat how I could complain, but there's even no way to do so; that's why I wrote this review.I wrote a ticket to complain (10429640), I was told that they help me asap, but since 24 hours I'm still waiting.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacob Wonder",
          "Nb_Reviews": 38,
          "Date": "2022-02-09T20:54:27.000Z",
          "Titre": "Rude support.",
          "Contenu": "Rude support.They ended the chat when I simply asked what we would need to do to add me to full access on one of my clients accounts...Edit: I had already solved the issue, I regrettably gave them more information on the issue and they contacted my client saying I shouldn't change the nameservers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chin",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T18:02:19.000Z",
          "Titre": "Scammers with many fake positive reviews"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wayne Massey",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T17:01:52.000Z",
          "Titre": "our server has been hosted by Liquid…",
          "Contenu": "our server has been hosted by Liquid Web for a few years now. We have experienced a pretty high level of outages, including them deciding to reboot in the middle of the work day. We are currently 31 hours into a complete outage with no ETA from them for restoration. we are in the process of migrating away from these losers.Wayne"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Cliff Harris",
          "Nb_Reviews": 6,
          "Date": "2021-02-18T22:30:35.000Z",
          "Titre": "Absolute rubbish",
          "Contenu": "Absolute rubbish. I had 3 days of them pretending to look into a critical email problem, with each tech support person pretending to work on it then hand it to someone else because 'my shift has ended', followed by five days (so far) of total radio silence.Absolutely abysmal customer service. If you actually need a working web site avoid at all costs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan Spencer",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T21:53:23.000Z",
          "Titre": "Liquid Web no longer cares.",
          "Contenu": "What was once the best Tech support in the industry seems to now be outsourced overseas with horrible results.  Incompetent support has led to websites going down, files not being able to be uploaded and being locked out of wp-admin. And in the meantime, they have raised their hosting prices.  REALLY?  I've gone elsewhere and am not looking back.  Do NOT use this company.  You will regret it. (And the problems WERE BROUGHT TO THEIR ATTENTION prior to me leaving)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NANCY POLLREIS",
          "Nb_Reviews": 2,
          "Date": "2022-03-03T01:10:04.000Z",
          "Titre": "I love  Liquid Web techs",
          "Contenu": "I love  Liquid Web techs. They’re smart, great problem solvers, professional and very down to earth & approachable.  Ted Keener and Dominic Hudson just finished solving a long standing email problem on 2 of my accounts. Maya Gabrielle, Daniel, and Freddie the week before helped me get to the bottom of several hacks - and to clean them up and prevent future hacks. There are many others there, too who have helped us immensely over the 5 years we’ve been with them. It’s so nice knowing we can count on them to help solve important issues time and time again. These guys define the meaning of “managed” services. Five (5) stars to all of them!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Craig D",
          "Nb_Reviews": 1,
          "Date": "2021-02-12T01:12:12.000Z",
          "Titre": "Terrible company.",
          "Contenu": "Terrible company.They used to be good years ago and now their support is awful and takes weeks to halfway resolve any kind of issue. Overpriced for what they deliver as well. Stay away from this company they are a complete waste of time and money and you'll always get the runaround when their servers fail."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Marwane Khalil",
          "Nb_Reviews": 5,
          "Date": "2020-01-30T18:52:34.000Z",
          "Titre": "I have been a victim of racist…",
          "Contenu": "I have been a victim of racist discriminatory behaviour by liquid web, they have denied me service on the basis of me “using a vpn” I have repeatedly offered to provide all documentation pertaining to my identity and have included my driver’s license in my email to them, but they continued to refuse on what can only be as discrimination that I assume was caused by my name."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Garris",
          "Nb_Reviews": 2,
          "Date": "2021-03-01T16:30:30.000Z",
          "Titre": "Worst sales team ever.   Totally clueless and rude.",
          "Contenu": "I contacted LiquidWeb to inquire about hosting services.   They did not get back to me for several days.   Then a man named Chris called me at 6am and woke me up.   I told him that he woke me up.   He said, \"No worry, I will call you later.\"   No apology at all.  When I woke up, I called and asked to speak to a manager.   After 10 minutes of listening to the man type, he told me no manager was available.They are so clueless, I can't imagine how their actual service is.   Never going near this company again."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Alexandre Caporal",
          "Nb_Reviews": 2,
          "Date": "2019-12-11T13:23:49.000Z",
          "Titre": "Changed the rules without notify, poor support and more and more expensive",
          "Contenu": "Changed the rules every time without send any notification and terrible support.A few services was not working for last month and now they want to increase $$$$Now i've got suspended because they changed my suspension date without tell me before and not even can help me for 24 hours. Already spend more than $10k and that's how they treat me.Too bad, I lose money, they are loosing a client."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Marco Ravagnani",
          "Nb_Reviews": 3,
          "Date": "2020-05-08T23:43:59.000Z",
          "Titre": "It has been a good service long time ago",
          "Contenu": "We were Liquidweb happy customers until we have been hit by a Malware. Four days with no answer, malware scan from his side with problems, no one updating the ticket. Downloaded Wordfence and found the malware. I write to the assistance and they said we need to pay extra 49/month to the security and the clean up. Four days before. Big no!"
        },
        {
          "Note": 1,
          "Lieu": "BG",
          "Pseudo": "Victor",
          "Nb_Reviews": 4,
          "Date": "2021-10-02T12:10:53.000Z",
          "Titre": "Their control panel is extremely…",
          "Contenu": "Their control panel is extremely limited and total trash. The webfile manager is MonstaFTP, which is useless, there's no SSH access. The GUI is from my grandma's time where she didn't even had a DSL connection.I have managed to setup a WordPress, it took more than 15 minutes just to upload the files, extract them (through the s**t web ftp client) and once I did, the load speed of a stock WordPress.. oh... I don't even want to talk about it.Edit: All of those positive reviews are fake, better ask for a trial of their services so you can see with your eyes before paying a cent to them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hitesh Chaudhary",
          "Nb_Reviews": 2,
          "Date": "2019-09-24T17:25:13.000Z",
          "Titre": "Worst support team ever",
          "Contenu": "Worst support team ever, DO NOT MIGRATE TO THEM!. They migrated our website TWO times and so many issues happended and their support team does not even respond. we lost $10k worth of sales. we will be taking Legal action against them for sure. if you want the best customer support and best quality servers (Google Cloud)  use WPEngine."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Stian Wiik Instebø",
          "Nb_Reviews": 2,
          "Date": "2020-11-30T09:52:04.000Z",
          "Titre": "Breach of contract.",
          "Contenu": "We had a huge deal with them, where the location of the servers were utterly most important. We were told that all our servers would be in EU, however, they quickly changed that since they needed to save cost.This making us non GDPR compliant. Their legal team is useless as well their support. Telling us this was not in our contract. However we have email correspondence telling them then otherwise.I would highly recommend anyone to stay clear of this unprofessional company.If you're considering them, please take a look at WPEngine."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Judd Dunagan",
          "Nb_Reviews": 9,
          "Date": "2019-02-11T14:19:23.000Z",
          "Titre": "Worst decision we made for our business…",
          "Contenu": "Worst decision we made for our business was to Trust Liquid Web. We immediately saw that there is no leadership. They have entirely burned us a company, service is incompetent, and they have no idea how to provision servers to run large loads with PHP-fpm. We're now stuck and I am writing this post so other business like mine or just small businesses who need a host to stay clear of them as you will lose business and they can care less about fixing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hiren Shah",
          "Nb_Reviews": 1,
          "Date": "2018-12-27T07:21:06.000Z",
          "Titre": "Charging for service without actually providing the service",
          "Contenu": "I ordered their $50/month 250 GB guardian backup plan several months ago. They started billing me for it but never fully activated the service. Mind you, this is a fully managed server plan without root access so their team is in charge of providing and managing this service. The support engineers acknowledged the problem but passed the buck to other team which never responded. In the meantime, if I were to lose any data on my server, I will be SOL"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T17:03:30.000Z",
          "Titre": "Tech team are good but don't forget your old customer...",
          "Contenu": "Tech team are good and helpul.Commercial team are not good at all. Nothing is done for long term customer (several years).Mega discount for new customers and nothing for old customers... (it's a shame I know it's not only this company but why not have a % of discount relating to years as customer...)I give one star because I have different exchanges with different people in the company but it's like speaking to walls.Solution evolves, competitors are here, prices are very high without discount and for old customer who would like to have new hardware.Also invoice generation system is very bad and not easy to use..."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Ralph Kiko",
          "Nb_Reviews": 2,
          "Date": "2019-11-07T08:14:10.000Z",
          "Titre": "THIS IS THE LAST TIME I WILL USE THIS…",
          "Contenu": "THIS IS THE LAST TIME I WILL USE THIS SERVER. Their servers are always done and their tech team cant even fix it. So all our websites are down for 3 hours now and till now theyre down.We got tons of complains from our clients and some decided to move to our provider. THANKS TO LIQUIDWEB we lost clients."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "daniel",
          "Nb_Reviews": 2,
          "Date": "2018-01-11T08:08:47.000Z",
          "Titre": "I made a serious business error while …",
          "Contenu": "I made a serious business error while signing up with liquidweb hosting 18 months ago. They call their support staff heroic, nothing could be further from the truth. They have not got a clue what they are doing, leave you hanging for days and resolve nothing.  Please do not make the same mistake , i suggest you obtain hosting services elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 9,
          "Date": "2018-03-26T04:38:42.000Z",
          "Titre": "Very very bad!",
          "Contenu": "Very very bad!Slow servers and NOT \"heroic support\". Their unprofessionalism costed us millions. They say they manage the server but they leave it not updated. You need to call 3 to 5 times to get a knowledgeable person and then... he starts working on your case and ends the shift and the next one doesn't know what the previous did. Caused us great damages because Liquidweb doesn't have proper backup system.Also, they are too expensive."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Ralph Laurence Quito",
          "Nb_Reviews": 3,
          "Date": "2020-10-20T08:03:08.000Z",
          "Titre": "Worst service im server is slow and i…",
          "Contenu": "Worst service im server is slow and i already open a ticket. for 7 days no one is replying to my ticket and everyday i reply on the ticket to followup and even chat their live chat support. But it seems they just dont bother and dont care about their customer. Ticketid 07270914"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry D. Jones",
          "Nb_Reviews": 1,
          "Date": "2019-06-19T23:19:42.000Z",
          "Titre": "Liquid Web is slowly becoming an awful…",
          "Contenu": "Liquid Web is slowly becoming an awful hosting company. Their support is poor and employees untrained. They don't listen and you have to explain things many times to them. We use to have $250,000 a year with them and have  slowly left them. They were sold to another company and lost their personal touch and great service. Someone should bring this up to their senior staff Joe Oesterling and others.#PoorService #LiquidWeb #NeedNewHosting #employeeengagement #customerservice #leadership #leadershipdevelopment"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T23:25:37.000Z",
          "Titre": "I was a client of alphahosting",
          "Contenu": "I was a client of alphahosting.  My account was bought by Liquid Web. It took me over a week to get connected to my database.  I often wouldn't hear back from my tickets I submitted.  Or it would take more than a few days. Finally I initiated a chat and the tech person immediately looked into the problem and saw it was a password issue.  My other complaint is I paid 15/month at alpha hosting but with Liquid web my cost climbed to 77+/month. I asked for a reduction and after a week I would hear that is the plan my account fits into.  So between the cost and the slow response time for my tickets. I do not want Liquid web as my hosting company.  At 77/month my tickets should be answered immediately.  Not a week later."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Hoffman",
          "Nb_Reviews": 6,
          "Date": "2018-07-27T01:17:12.000Z",
          "Titre": "100% uptime guarantee",
          "Contenu": "100% uptime guarantee.  Their site says verbatim:Your Clients will Love the UptimeWe have your back, 24 hours per day, 365 days per year and offer 100% guaranteed uptime at high speed.Meanwhile, my site hosted through them has been down for over an hour now with no ETA on a fix and just generic copy/paste answers from support.  Lady on the phone was less than pleasant and just kept repeating \"well what do you want me to do?\".  False promises, not 100% uptime.  Bad hosting company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AIM",
          "Nb_Reviews": 1,
          "Date": "2020-12-11T23:41:17.000Z",
          "Titre": "Deleted my sites without warning",
          "Contenu": "They deleted all of my sites (I had 15+) with them without warning. I've been a customer for almost 10 years since the times when the platform was owned by Rackspace. I should have transferred my business from them when the acquisition happen but I had hopes they'd be decent stewards.I set up auto-payments when they transitioned. Despite 3+ years of successful payments on-time, I missed their notification regarding my credit card failure. With almost non-existent outreach from their end, they terminated my account. I am asking other developers I know that use them (some of which I referred) to cancel their accounts as well."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Phil Mood",
          "Nb_Reviews": 7,
          "Date": "2022-01-01T14:27:41.000Z",
          "Titre": "Once upon a time there was a wonderful hosting...",
          "Contenu": "Liquidweb had always surprised us with its professionalism and excellent technical support.Unfortunately, the quality has deteriorated significantly in recent years.We ourselves experienced the frustrations of their WordPress Managed Service that felt more like an unfinished product, charging us monthly to become their beta testers.Not to mention their Business Email service, with months of excuses for undelivered messages to multiple domains.If we add to all these disasters their dubious accounting practices, reducing annual payment contracts at will, I wonder if the management is aware of the bad direction their company is taking.A great shame how an excellent company can inexorably ruin their reputation in such a short time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FJ",
          "Nb_Reviews": 3,
          "Date": "2020-02-22T14:44:46.000Z",
          "Titre": "Find another Company... they are backwards.",
          "Contenu": "Ever since they took over from WiredTree they've screwed everything up. They can never get their billing accurate they continue to send me threatening emails and then when I correct them and they fix the problem they still shut down my server."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "R Townsend",
          "Nb_Reviews": 1,
          "Date": "2017-08-01T12:24:11.000Z",
          "Titre": "Shocking Customer services",
          "Contenu": "After 10 years with Liquid web there level of service has become unacceptable taking well over 48 hours to respond to a support request which has caused damage to my business. Would not recommend there services and will be moving my business away from then asap"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Phun",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T22:00:51.000Z",
          "Titre": "Lazy and rude humans",
          "Contenu": "This review I am making not for their server quality but of their support quality. It is indeed hit or miss. I have filed a complaint but no one seems to hear me. The supervisors Darren Wise and Andrew Cronk clearly do not know how to read emails and have no plans of resolving it. Even a slightest empathy they don't have any. Even denied my request to pass it on to a Manager. Why? When agent is at fault they try all the ways to cover them up. Not good practice for such a reputable company.UPDATE: Another one got back, in the name of Devlin, that no further action will be taken. What? Is that how you take a complaint?@adminI have sent you an email as requested. Here is the ticket as well just in case 09144944. Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wendi Friesen",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T18:42:25.000Z",
          "Titre": "Since March 2018 Liquid Web disabled…",
          "Contenu": "Since March 2018 Liquid Web disabled all my websites and yet they CONTINUE to charge me DESPITE NUMEROUS cancellations by me. I had to cancel my AMEX card, and block your recurring charges. Now you charged me AGAIN today. You OWE ME 9 months at $220. $1800.00. I will now post publicly wherever I can. Several months ago I was asked on the support chat to verify that I wanted to stop my account, verified it, and I was asked if I had all the content transferred, confirmed yes. And still you are charging me. I will post this review everywhere I can, since you are operating fraudulently. When you refund me, I will stop posting publicly."
        },
        {
          "Note": 1,
          "Lieu": "BY",
          "Pseudo": "Paul Moiseev",
          "Nb_Reviews": 4,
          "Date": "2018-08-12T10:11:27.000Z",
          "Titre": "support fraud",
          "Contenu": "support fraud, zero response from abuse department, after 11 days of wait their livechat suggest me to send another email - unless you are doing scum please do find another more legit provider. Fraudster - you are surely welcome here"
        },
        {
          "Note": 1,
          "Lieu": "QA",
          "Pseudo": "ABDULQADER",
          "Nb_Reviews": 2,
          "Date": "2019-03-31T10:26:32.000Z",
          "Titre": "They Only Looking for the Money",
          "Contenu": "They Only Looking for the Money without any help for new customer, I have an issue with them i just asking for my IP range and they don't need to give me my IP and they tell me they don't support the Hyper-V  and they don't need to refund my payment back i already take the dedicated server for only 1 hours after i make chating with them they refund the money back to my account and when i make request the new server they ask me for the payment by this replay (They cannot be applied to activation invoices. You need to supply the account with a positive payment to activate your new services.), this not helpful and not good and i don't trust them anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave Henrickson",
          "Nb_Reviews": 5,
          "Date": "2021-01-12T22:12:15.000Z",
          "Titre": "Apparently liquidweb  has gone full…",
          "Contenu": "Apparently liquidweb  has gone full liberal. They can't seem to continue business with my good friends conservative website. If this is what the democrats want, then we're in for a rough 4 years."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry Jones",
          "Nb_Reviews": 1,
          "Date": "2020-11-14T20:13:15.000Z",
          "Titre": "This company has become ridiculous",
          "Contenu": "This company has become ridiculous. After signing up, they want you to send them two government ID pieces to get a hosting account. Not sure who they think they are, but they can not ask for that. In today's cybercrimes world, I, for one, would not email or send my passport or DL to someone I don't know. As a corporation, they should look it up and verify us but ask for something when they are not a government entity is wrong. We will find hosting elsewhere, that's for sure. They need to post where people can see they require additional information that you should only give to a government office, not a simple hosting company that doesn't need it. I was buying hosting services, not applying for a loan."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Khaled Ahmed",
          "Nb_Reviews": 2,
          "Date": "2022-05-02T09:50:36.000Z",
          "Titre": "Avoid them",
          "Contenu": "Avoid them. They have fast response but Zero taking care of your data and server. You may lose them simply and they will not do any thing to you!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T18:43:52.000Z",
          "Titre": "Stay away from Liquid Web hosting",
          "Contenu": "Stay away from Liquid Web hosting. I own an agency and decided to use their managed Wordpress hosting. Their hosting environment has a known bug which they know about that randomly causes the servers to crash. You would think since they know about it they would monitor the sites and automatically fix the sites when they go down, but that is not the case. If the sites go down, you have to call them to tell them to get it fixed. They absolutely refuse to do anything on their end to remedy the issue. They told me to contact the creators of php to get their server environment bug fixed. Now they just want me to change hosting plans acting like moving and testing 50 sites will be no big deal. Absolutely terrible customer service and experience. Please stay away from this company and save yourself the trouble. Especially if you are an agency with multiple sites to host."
        },
        {
          "Note": 1,
          "Lieu": "YE",
          "Pseudo": "محمد علي المطري",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T23:20:10.000Z",
          "Titre": "From greatest to the worest",
          "Contenu": "It was great company for years but in last two years... they killed my trust with my customers! Lost all backups and they said what!! We do not have backup recovery for your server! I lost 2 months of my time to rebuild websites for customers and gave them one free year for hosting due to my mistake and I lost more than 30% of my angry customers. They killed me. I paid for one server for one year and the other for two years! So, I had no choice to stay with this worst company and I bear the consequences of my mistake for being customer with these losers. Until today my reputation with customers has issue. They did not apologize or say any thing. Not there mistake! The rest of time for my servers were always slow respond from support and I could not trust them any more. I have to take other servers from other company. In same time, losing many taking debts and blames."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Walsh",
          "Nb_Reviews": 4,
          "Date": "2021-04-23T18:39:16.000Z",
          "Titre": "Many Issues with Liquid Web",
          "Contenu": "We used to be with Wiredtree (great company) which was purchased by Liquid Web.  Since then we have seen our monthly cost go up and quality of service go down.  Our \"Managed Server\" was hit by WordPress hackers, so we asked support for help.  They told us we had to buy a separate \"Security\" package so that they could help us.  We were desperate so we did, but they took days to implement and restore issues from the hackers.  We ended up losing many clients.  Then, our server was coming up on EOL OS and needed to be upgraded, so we asked them to do that but they told us we need to buy a second server to migrate our current server to the new server.  So now they are charging us double for the same service.  We had enough of this company and are moving on.  We would not recommend Liquid Web."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kavi A",
          "Nb_Reviews": 1,
          "Date": "2019-03-30T11:07:31.000Z",
          "Titre": "Beware of billing once you cancel service.",
          "Contenu": "It's been 2 years since I cancelled service and still getting billed for a backup image that was taken 2 years ago. Called/email multiple times and still getting bills and finally had to put a vendor block to stop them from ripping me every month. If you discontinue service with them, keep a close eye on your monthly statements to make sure they don't bill you for cancelled service. As for technology, the offerings are few years behind. Once they ask me to cancel a service on mobile view of control panel, when the link didn't exist. Do yourself a favor and pick one of the many cloud hosting providers. Plain and simple billing, cutting edge tech and peace of mind. These billing practices reminds me of gym memberships from years ago."
        },
        {
          "Note": 1,
          "Lieu": "KH",
          "Pseudo": "Ian",
          "Nb_Reviews": 5,
          "Date": "2020-01-20T11:33:01.000Z",
          "Titre": "The Worst Hosting Company I Have Ever Used",
          "Contenu": "What a fall from grace.  I have used the service for a few years now and the service has gone from very good to TERRIBLE.  Firstly my sites have been going offline daily for months, their Phillipine customer support who pose with western names are next to useless, if they find an error and fix it you can be sure they will have created two more problems.  I have lost so much revenue due to downtime.  The final nail in the coffin is when they recommened a new server for me to use, which i then paid for but have been told they cannot migrate the data over from my old server as the server they have setup is using their own alternative of Cpanel.  Of course i wont get a refund.  I have lost $1000's over the last few months due to this company and i strongly suggest anyone who wants a reliable host does not use this service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon Stevens",
          "Nb_Reviews": 1,
          "Date": "2018-12-26T17:26:09.000Z",
          "Titre": "Worst Customer/Tech Support Ever!!",
          "Contenu": "I had created a single site service, and needed to move to a multi-site service. The process was supposed to take 30 minutes, but instead it took about 2 days. Then a couple of weeks later I got a bill for $239 (Multisite is supposed to be $99). I had to spend nearly 2 hours dealing with trying to get the to fix the billing and system issues the DAY AFTER CHRISTMAS!! And the first thing the online customer care rep did was to blame me. That I was supposed to do something about it. Not Happy! I will be moving this simple small site to another provider, as I do not ever want to have to deal with them again. (FYI, when I called them via phone, there was a very friendly and helpful customer rep, but even she was saying there would be a few more steps I would have to do after the call to make sure it was handled properly). Yeesh!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michel",
          "Nb_Reviews": 18,
          "Date": "2019-09-01T20:22:29.000Z",
          "Titre": "No longer what it used to be.",
          "Contenu": "I have been Liquidweb customer for more than 5 years. I run multiple VPS and high traffic websites. All my sites have been down for more than 3 days and the technical support kept telling me the issue was from their supplier, Level3.netI had to spend hours on the phone to technically demonstrate that the issue was from their own DC. Finally they realised they had an issue with a network switch and out of the blue, everything started to work again. 3 days of downtime on all my sites and traffic has been my worst nightmare in 2019. I was not even offered an explanation or a technical review and what they will do to prevent such issue in the future. A Liquidweb BLANK MOMENT. I have already started to look into alternative for my DR and hopefully a total switch to a new host soon. (In case you are actually reading this, CaseId=5003a00000ucgxJ)"
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "William Tan",
          "Nb_Reviews": 1,
          "Date": "2020-08-19T07:51:40.000Z",
          "Titre": "Save the pain and avoid this company",
          "Contenu": "I was a happy customer of Beyond Hosting until Liquid Web took over. While the support team tried to be helpful, it did not solve my problem. They deleted my data before migration could be completed.I have multiple websites wiped out and I have to rebuild each website. Fortunately, I have some backup and I could restore some sites but surely it will be on another hosting company. I still lost some data. This is unacceptable for a so-called \"world-class\" web hosting company.I write this not to defame Liquid Web but to warn other Business Owners not to put their business on Liquid Web. The loss of revenue and effort can truly be devastating.Please avoid this company.Liquid Web Support Ticket #: 05720783**************Reply:The request to terminate the server because I am terminating my subscription to your service after you have wiped out all my data."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jon D",
          "Nb_Reviews": 3,
          "Date": "2021-11-25T13:24:40.000Z",
          "Titre": "Security and billing issues",
          "Contenu": "Awful support and the billing are just a nightmare. Over-priced and not well-secured servers. LiquidWeb used to be a good host. Not anymore."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "RapelForg Abluck",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T19:33:59.000Z",
          "Titre": "Server under performed computationally, got scammed",
          "Contenu": "Server under performed computationally, requested a refund. They then proceeded to dodge me and charge me for an extra month, had to cancel my credit card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2022-02-06T21:42:33.000Z",
          "Titre": "Horrible experience and horrible…",
          "Contenu": "Horrible experience and horrible servers. I can't believe they took over $1300 of my money, gave me trash servers that still after 30 days wouldn't function correctly, and pretty much left me with no other choice but to shut them down and move to a new data center with servers that actually work.This place is only interested in stealing your hard-earned money. They are not interested in providing you with satisfactory support or a quality product.Very disappointed I was expecting a more professional environment with higher standards. Instead, I was given dedicated cloud servers that were retired 8 years ago and stored in the janitor's broom closet and they ran like crapola. 30 days after purchasing and I still couldn't use them that is just sad and horrible service. When you have support tickets with over 100 replies back and forth concerning a single server that should be the first clue that there is something major wrong with your product.Stay away from this business if you value your time and your money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Summerfield",
          "Nb_Reviews": 4,
          "Date": "2020-09-16T12:19:34.000Z",
          "Titre": "Chat and support for billing is nearly worthless",
          "Contenu": "Coming from SiteGround where a chat window is usually connected to a rep immediately [or at least under a minute] and the problem is solved, I find Liquid Web's chat support wait times abominable - if the chat takes place at all.  Opening a ticket isn't necessarily a solution.  I still have a very simple billing ticket question open for nearly a week.  I had to call them to ask them to address the ticket.  Only their senior support specialist can answer my question?  You can't help me on the phone?  You won't resolve my open ticket?  I guess they don't want to get paid via ACH funds.  My invoice link is dead.   How can I submit for my expense account?  Why can't you invoice my Accounts Payable monthly?  Not everyone in corporate America can use their credit cards for IT expenses due to compliance issues.  This is simple stuff.  I'm not sure I want to know what happens when things get more complicated.  I hope this lack of support is limited to billing."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Julie Francis",
          "Nb_Reviews": 1,
          "Date": "2019-05-15T04:49:57.000Z",
          "Titre": "Deleted websites after 30 days",
          "Contenu": "I was very happy with Wired Tree - Liquid Web took over. Though their help staff chat was excellent, their sales system has me shellshocked. I am at fault to some degree, but this is unacceptable. What happened. My visa card showed charges I didn't approve, the bank picked up and cancelled card. It took two weeks to get new card and pin, more time to think all the places it was entered online. I wasn't well and didn't check emails. Liquid Web sent an \"invoice unpaid\" message and auto reminders saying my account \"could be suspended\". I did not see them. Then I realised emails were not coming through, twigged its the card change, paid the bill, but the amount was not correct. Opened chat with billing - was informed that after just over the month - they had terminated my account. Not suspended. Terminated. Websites deleted, emails, backups,gone- nothing to be found. If that sends a shiver down your spine - check every bill every 29 days. Bad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T20:28:01.000Z",
          "Titre": "I ask to switch to one of your bundles…",
          "Contenu": "I ask to switch to one of your bundles and you cant migrate us?  We have to reinstall everything?   We cant even pay a fee to migrate?"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "A Marketing",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T17:29:58.000Z",
          "Titre": "Not keen on customer loyalty.",
          "Contenu": "I was a customer with WiredTree until LiquidWeb bought over and all accounts were transferred. Transfer had some minor issues which were handled well and I was happy with everything until the first renewal. Since mine is a transfer account, it had to be converted to one of LiquidWeb's specific account. I choose one with similar specs as what I had on WiredTree and paid for 2 years in advance. Reason I paid for 2 years in advance is because of the attractive discount.2 years flew by and it was time to renew. During these 2 years, support was good but not as good as WiredTree. But I was with them and had no intention of changing anyway, so I went ahead to renew. Was shocked to learn that the 2-year discount offer was only for new customers and not existing customers. This meant a more than 100% increase in costs for services that I feel are really over priced. I managed to find another host with similar features, at a quarter of what they charge. I moved out from LiquidWeb a year ago to the new host and have no regrets.Honestly, LiquidWeb servers are over priced but with 2 year discount packages when paid up front, it is ok. When the discounts are removed, it is totally not worth it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 12,
          "Date": "2018-08-06T16:21:19.000Z",
          "Titre": "Requires phone number -- will reject your order otherwise!",
          "Contenu": "Heard good things, I needed temporary (1 month) emergency e-mail hosting while I setup another VPS with another host and my own mail server.I'm very security conscious which is why I provided them a fake telephone number because their system wouldn't allow me to proceed with the order without providing one.After going through checkout and paying via PayPal, it said something along the lines of \"A member of our sales team will call you to introduce themselves, the service and welcome you to blah blah blah\"...Needless to say I didn't receive the call, instead they sent me an email to say they've rejected my order, and that they'll refund me shortly.The refund didn't come either, had to get in touch with their team to manually issue one.These companies do not legally need a phone number to do business with you and they're the first hosting company I've dealt with that has rejected an order from me, and for such stupid reason at that.Thanks for wasting my time you privacy invading trolls."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul Worthington",
          "Nb_Reviews": 15,
          "Date": "2020-02-11T15:31:29.000Z",
          "Titre": "It appears I'm joining a que",
          "Contenu": "Disappointed, frustrated, annoyed - the one thing you need from support is them to be fully with you to achieve everything being resolved to your satisfaction.   You shouldn't be spending all day wondering if you are actually going to get a response.As others have stated on their reviews support is dreadful.  As an ex Wiredtree customer of many years, maybe I was spoilt, but wow they could supply support, Liquid Web I believe did have this level of support but it is certainly not there now.I have just been migrated over to Interworx and I am honestly wondering what the hell is going on.  Open tickets are only answered if constantly being prompted to look via web chat.  Even now after expressing my displeasure at the way support has been provided I am still awaiting a response and we are now hours on.As others have stated if support is as poor as this is proving to be you start to look elsewhere.  So if you are looking to join Liquid Web and have come here to get a feeling for the company all I can say is the speed and server reliability is there but the support is woefully lacking"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Emanuel",
          "Nb_Reviews": 1,
          "Date": "2020-05-22T07:09:28.000Z",
          "Titre": "TERRIBLE Windows hosting support",
          "Contenu": "Sadly I have watched LW tech support for windows just get worse and worse as time goes on. I can remember a time when using the chat support feature 99% of the time they would be able to solve the problem on the spot, now it rarely happens, the tech either makes it a email support request or even on occasion has flat out lied to me in the chat, which I later asked them about. I have even tried escalating to a supervisor on shift but rarely would I get a response. My last issue involved trying to exchange some bad ip address that THEY assigned to me, took 5 days to solve the ticket!! and 3 different supervisors. Also recently I had an issue with file permissions I was transferred to another support tech and I really think that they just ignored the request me to spite me, after 40 minutes of waiting, there was no more response in the chat window yet it remained open and I could send them messages like \"hello are we still connected?\"  This company used to have STELLER Customer support but now its a complete waste of my time, If I could change them out I would and would NEVER use them again."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Alper Kağan Canbaz",
          "Nb_Reviews": 1,
          "Date": "2019-06-13T22:14:59.000Z",
          "Titre": "I noticed they were charging much more…",
          "Contenu": "I noticed they were charging much more than their announced priced from my credit card.Very bad business etics. If they notice that you don’t login, they charge more.Current 4gb vps promotional price is $49Regular current 4gb vps price is $99What they charged for my 4gb vps for months = $149 !!!!!I also noticed that ip price is $1 but they charged me $2 per ip for years.When I noticed that they are charging my card more than they should, I openned a ticket. They told me that they write their prices on their website and I need to check my bills regularly. I requested a refund but its been weeks and they dont even reply.And before that happen they downgraded my server without telling while I was paying the same price. When I checked my server configuration I noticed that it was downgraded and they said it was an accident and upgraded it back. I thought it was a mistake at first but im not sure anymore.Used their services for many many years. If you dont keep an eye on the bills they will charge more.But I must say that their service doesn’t have downtimes and support is generally pretty fast but terrible at billing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Curt Johnson",
          "Nb_Reviews": 5,
          "Date": "2019-07-24T19:11:08.000Z",
          "Titre": "I have been a loyal Liquid Web customer…",
          "Contenu": "I have been a loyal Liquid Web customer for over 12 years, but they have instituted changed over the past year that has even got their tech department complaining. Their latest billing change now makes it so that customers who don't pay their bill one day after it is created are considered 'overdue' by Liquid Web. They have gone from a Net 15 days company to Net 0 and are requiring customers to put in some form of payment card or Paypal account number in the account which is then forced into AutoPay. I spoke directly with an Account Services Specialist and had this confirmed. By forcing customers to put a credit card or Paypal, they will then bill you immediately on day bill is created. Even companies as bad as Xfinity give you 30 days to pay your bill. As I had an old credit card listed on my account I received a scary e-mail stating that if I didn't immediately pay my bill, my service would be disconnected. I have paid the same way for 12 years and now Liquid Web is saying you must pay immediately or else we will cut you off. This is why they are now losing customers and gaining the reputation hey have.It's sad as they were the only hosting company our news site promoted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "macmcd.",
          "Nb_Reviews": 2,
          "Date": "2019-08-20T16:29:47.000Z",
          "Titre": "One can no longer trust Liquidweb with…",
          "Contenu": "One can no longer trust Liquidweb with something as important as their web hosting needs!I have been with Liquidweb since March 16, 2005. it was once a great company but my latest invoice was generated on August 14, 2019 with a due date of August 13, 2019 and contained an immediate cut off notice. Since I have never seen an invoice generated with a due date earlier than the date of the invoice, I called Billing and was on hold for 47 minutes. Since this long wait time was also a first time Liquidweb experience for me, I called Sales and was immediately commented to someone in Texas who told me he had just arrived in the office and that his email was filled with questions from customers regarding this same issue. I later called Billing again and was successful in getting through. I was told that this is the new business policy of the billing department of Liquidweb, to not invoice until after the due date and to threaten immediate suspension of service with that late invoice.After over 14 years of being a loyal customer (I even won a prize from Liquidweb for posting a testimonial a couple of years ago), I feel I must move to a more reliable hosting provider. Thank all the oldtimers for their wonderful service over the years."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Ralph Kiko",
          "Nb_Reviews": 2,
          "Date": "2019-11-07T08:18:09.000Z",
          "Titre": "RESOLVED: Dont use them. Worst provider",
          "Contenu": "Its happening again. This is the last time i will use them. Lost my clients thats to them"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James A",
          "Nb_Reviews": 192,
          "Date": "2018-10-02T14:06:07.000Z",
          "Titre": "Charged me sales tax for nine months…",
          "Contenu": "Charged me sales tax for nine months when they should not have as I had the server for business purposes. Their exemption form did not accept uk limited company info when it should have and staff were unhelpful for months, and would not refund. I have no alternative but to leave.Update: I told LW I was exempt back in January but their online system would not accept company registration numbers (even though it says it does)  and LW's support was unhelpful. After multiple contacts, 9 MONTHS after the original contact, they finally send me an exemption form. Having already paid over $200 in taxes I should not have been billed for in the first place (and LW wouldn't refund), I have left LW and am much happier for it and saving about $80pm on fees. They have lost $7,100 in server fees over the next 5 years, and possibly triple that as I have two other dedicated servers elsewhere. That's what they get for implementing a tax without 1. Training staff properly about the tax, including their Billing staff, and 2. Not setting up their online system correctly so that Ltd companies without VAT registration can opt out. 3. Taking 9 months to enable me to opt out. The form they sent me in September should have been sent in January. It's a complete farce which, as you can see, LW take no responsibility for. Awful company in my opinion."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim Trott",
          "Nb_Reviews": 6,
          "Date": "2023-11-09T03:03:00.000Z",
          "Titre": "More than once I have created a tech…",
          "Contenu": "More than once I have created a tech support ticket with some degree of urgency only to have it remain \"open\" for up to 10 hours. All I got from the Chat \"human\" response was \"sorry, I'll escalate your ticket.\" There is NO EXCUSE for this kind of poor service. I lost customers because they couldn't install an SSL certificate two years in a row. I'm about to lose another one because it has taken 12 hours to find out why a customer's site takes more than 45 seconds to load."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T23:20:41.000Z",
          "Titre": "Too expensive …",
          "Contenu": "I pay 1248 a month and I had a critical error. I could get a back up because I’m not subscribed to some other service."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Kieran Morten",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T19:52:15.000Z",
          "Titre": "Stable platform but poor account management support",
          "Contenu": "I've been a customer for a number of years (since Liquid Web acquired Rackspace Cloud Sites) and never had a problem. I then signed up for a 2 year VPS contract having been told the email capability was equal that of my current solution. It was not the case. It was a downgraded version and had no calendar or out of office capability that my client was used to.4 months or so into the contract I raised the issue that I had been mis-sold. After 18 long months of back and forth, LW eventually admitted fault and offered me credits to go back onto my original email plan.This lasted only 2 months. The moment I came out of VPS contract, the credits expired - even though I rolled onto a pay monthly plan. At no time have LW tried to resolve this for me. I'm still a paying customer and now paying more because I'm on a monthly plan - I don't mind that, but I don't ever see me signing up for a 2 year contract again.This is not how I would treat any of my customers, and this has reflected poorly on me professionally.The fact that LW have admitted fault is what frustrates me so much.I would expect a re-fund, or future credits that would cover my costs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roger weissinger-baylon",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T05:00:36.000Z",
          "Titre": "Total disaster in migrating my emails…",
          "Contenu": "Total disaster in migrating my emails to Liquid Web.  I won't give all the gory details but the process ultimately failed because they migrated all of the emails for one account, some of the emails for another account, and none of the emails for two other accounts.  After than they stopped responding to the help tickets.  I lost a week of my life for nothing, because I need to go back to my former email provider.After a delay, I eventually received considerable support by 3 or 4 well-qualified technicians who helped me solve essentially all of my migrations problems.  The Liquid Well server is working smoothly now, and I am glad that I am with Liquid Web.  I am therefore changing my rating from 2 starts to 4."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "MA",
          "Nb_Reviews": 12,
          "Date": "2022-08-17T08:29:40.000Z",
          "Titre": "v poor webmail and they even…",
          "Contenu": "third class webmail and they even charge for it.I have to speak out about it.for years, we have been paying the liquid web fee for a mail service which is so poor, it's unbelievable.The search does not work.UI is ancient.There is no app or calendar sync they do offer hosted exchange mailboxes, which are pricier.and on top, their email server IP addresses get black listed and then our emails won't reach the destination.when we asked by opening a ticket, they had no resolution time frame."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan Gode",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T14:50:00.000Z",
          "Titre": "Inordinate delays in migrating a web server",
          "Contenu": "I have been with WiredTree and then LiquidWeb for 11 years. They have been fantastic all those years. This time the experience has been poor. I needed to migrate to a more powerful server and change my OS from CentOS to AlmaLinux. I needed everything set up by July 5 morning. I signed up and paid for a two-year plan on July 1, Saturday night. I was told that the new server would be set up in minutes and that the migration would take another 24 hours. However, the tech support's attempt to provision a new server failed. They said the issue had been passed on to the \"development\" team, and that someone would get back to me soon. I don't think the tech support can set up a server, and they knew no one from the development team would be in until July 5 to set it up. I expected an honest and realistic timeline. All I got was multiple tech support folks passing the tickets to each other. As of now, NOTHING has been set up. I am unsure if LiquidWeb is having financial problems and is short of staff or whether they have cut down on technical staff, hoping the customers will not notice. However, the marketing staff has contacted me in the meantime to discuss plans. I notice that the tech support now aggressively markets security plans. This tardy service and false disclosure are not the LiquidWeb I knew. Not sure if they are having financial problems internally or if the investors are now demanding higher returns. The tech support staff I get for other issues seems competent and helpful. However, this poor experience setting up a new server and migration has left me wondering if I should demand a refund and move to another host."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 102,
          "Date": "2023-05-19T21:17:25.000Z",
          "Titre": "Knowledgeable staff has already left LiquidWeb",
          "Contenu": "The knowledgeable staff has already left LiquidWebPROS: Friendly support (mostly). Uptime is very good, close to 100% or should I say almost 100% most of the time. There used to be some guys that are very knowledgeable and were willing to make the extra step to help you out on tricky issues, although the knowledgeable guys seem to no longer work there.CONS: The billing charges one's card without notifying in advance on what exactly the amount will be charged, thus price increases can surprise you. And tricky extra charges are also a shocker.Very expensive for what you get.LiquidWeb automatically enrolls you in auto-pay via credit card or your bank account (direct debit) via Paypal, so they can charge your card or withdraw any amount directly from your Paypal account and if your Paypal acc. has zero balance then from your bank account! And you are unable to remove your bank account number from their records! They won't accept bank wire or manual Paypal balance payments, so you're stuck providing LW either your credit card or Paypal/bank account for them to help themselves in your account for any amount.Made a 2 year deal with a fixed amount paid to LW but a year after I paid for 2 years LW is already charging me extra money on the balance despite the agreement and prepaid hosting for 2 years. One year after the deal they stopped sending me zero invoices via email, but started sneaking in extra sneaky charges of unknown unidentified origin. When asked what those charges are the billing department gives some smoke and mirrors answer.The live chat constantly closes from lost connection. Can't even save the chat transcript. Or the chat will get stuck for hours in waiting being never attended.There's a lack of knowledgeable staff since most of their best staff has already left the company and you can read about that on the internet forums. The support will for days conveniently ignore more complex issues they were able to fix in the past and only address issues that are simplest in nature, but usually reply is written that there's nothing they can do about it, leaving customer stranded looking for help elsewhere or moving to another, more modern, knowledgeable and more flexible host.Simple questions they were easily able to answer and address now are repeatedly ignored, even if asked twice, just to confirm things.The best days of LiquidWeb heroic support and fair billing are clearly over. I am looking to move elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Capt Obvious",
          "Nb_Reviews": 113,
          "Date": "2023-03-17T21:17:55.000Z",
          "Titre": "Rubbish support",
          "Contenu": "I have been working for a client for the last month who is hosted with Liquidweb and been having major problems with email being sent from the website/server due to it being badly setup to begin with.Liquidweb have been a complete nightmare in trying to get this resolved, they have caused even more problems, refused to help fix issues they caused, given bad advice and made the whole situation worse.The IP address on the server had a bad reputation and was blacklisted. So I fixed all the issues on the website that were causing spam, and asked Liquidwebweb for a new IP. They refused, so no way to fix the issues without outgoing mail being rejected.I then discovered they had sold the client various other services they didn't need or know how to use, including the business email, which they had never setup for them.So I moved all their email from their server to the business email service and got everything working.Liquid web then blocked the mailbox that was being used to send email from the website, causing more problems.We got the mailbox unblocked, liquidweb support, and insisted everything was working, but we still couldn't send email.Finally they admit they had actually blocked the entire server/IP from sending email through the business email server completely due to the bad reputation of the IP.Yes they were blocking their own IP from one of their own servers, which they had refused to replace, causing this situation in the first place.So we switched to using a 3rd party SMTP relay service (mailersend), but this was also failing, because liquidweb had actually blocked all outgoing SMTP from the server to anywhere.So we have an e-commerce site that cannot send email to any customer using any method because liquidweb have blocked everything and won't do anything to help and won't give us a new IP.Now in process to migrating site to a new provider."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Georgia Petty Ferguson",
          "Nb_Reviews": 3,
          "Date": "2021-08-13T16:22:43.000Z",
          "Titre": "I paid for private server hosting",
          "Contenu": "I paid for private server hosting. I expected good support, at least. They not only take forever to respond, they clearly don't listen and have canned answers. They broke my site by editing files and didn't bother to check. When my site goes down every time I try to update their answer is, \"Oh, looks like it's up\" and then don't try to solve the problem. Terrible. Not worth it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Geoffrey Porter",
          "Nb_Reviews": 6,
          "Date": "2019-04-28T02:29:27.000Z",
          "Titre": "Run in circles",
          "Contenu": "I was told, you gotta do A, then we'll help.I did A.Oh we won't help, you gotta do B.I do B.Oh we won't help, you gotta do C.A rational person would have likely done C, but they could have easily started with do A+B+C, I just felt like I was being run in circles.  I had no reason to think, hey if I just do C they'll help, they lost my trust by then."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donnal Santos",
          "Nb_Reviews": 9,
          "Date": "2018-10-24T10:24:49.000Z",
          "Titre": "They are very very unresponsive and…",
          "Contenu": "They are very very slow  on their ticket (customer service). You have to keep calling them over and over for their customer service to help you out with your ticket issues. they say they are Backed Up! They would need to hire more customer service for ticket issues. I been waiting for over 24 hour now and my clone is still not done, I had to call them over again to start working on it again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Doug Holt",
          "Nb_Reviews": 2,
          "Date": "2020-01-16T18:29:57.000Z",
          "Titre": "Look elsewhere",
          "Contenu": "2 months ago, this review would have been 4-5 stars. As you can see from other long-term clients, the quality of service has fallen drastically. As an agency, we've lost clients due to downtime and errors made by Liquid Web. Sadly, we've been lied to and that's something that's hard to come back from."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2021-06-07T23:35:28.000Z",
          "Titre": "not ready for prime time but now they are!",
          "Contenu": "someone hit the button for automatic SSL/Certificate and wasted our certificate for exchange mail server. Now we have to solve that problem. I find features on the account that aren't available, only a promise for future completion. the support desk hasn't solved any problems for me yet.FOLLOW UP RESPONSE: My first experience with LiquidWeb was less than satisfying, but they have proven themselves to be top notch support as I learned through my later interactions with them. They do a good job and I am glad I migrated to the Liquidweb Host. I think we will be here a long time. thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2017-08-30T19:20:28.000Z",
          "Titre": "We were with them for years and they …",
          "Contenu": "We were with them for years and they were great but now they just stink.  We have had outages the last two weeks and not one of their reps can solve the problem.  They are fast to respond which is good but I would rather company that takes ownership of a problem and solves it in full.  They will probably be taken over by AWS if they don't go back to giving good service with stable servers.I also warned them at least 3-4 times that I would review them if they didn't fix our issues and each time they said it was fixed only to have it break hours later."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melanie Prough",
          "Nb_Reviews": 2,
          "Date": "2020-01-27T20:14:51.000Z",
          "Titre": "I moved to liquid web with 3 dedicated…",
          "Contenu": "I moved to liquid web with 3 dedicated servers early in 2019. Less than 2 weeks after I moved, I requested a look at a PCI scan via the helpdesk as I had been told it was NO PROBLEM after asking extensive questions. However, my salesperson either lied or fully misunderstood the information she was relaying back and forth... NOT SUPPORTED. I raised hell and she came up with a compromise of pasted the report in to a helpdesk ticket. I agreed, moving clients is no joke across 3 dedicated servers. Now less than a year later they will not even honor the workaround.Aside from that the service is adequate, not fast support and certainly not the most experienced, but adequate."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Cathy Moore",
          "Nb_Reviews": 2,
          "Date": "2021-10-25T18:46:00.000Z",
          "Titre": "Support quality has declined",
          "Contenu": "I've been with Liquid Web since 2016. In the last two years, support has gotten worse. They promise 24/7 support, and they do answer the chat quickly, but the engineers who can actually fix things work much more limited hours. At the same time, the technical abilities of the average support person seem to have tanked. This has meant that seemingly simple fixes now take hours to fix when they used to take about 10 minutes. Today it took them three hours to renew the expired SSL certificate that they improperly installed in 2019 and still haven't really fixed. It used to take them 10 minutes to renew the certificate. During those three hours, my customers rightly complained that they couldn't access the info they had paid for. I'm now looking for another hosting company."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "kegan mooney",
          "Nb_Reviews": 9,
          "Date": "2021-12-19T10:08:15.000Z",
          "Titre": "Lying sales & poor customer service",
          "Contenu": "I've had nothing but trouble with LW, the sales person on live chat said he wanted to speak to me on the phone to offer me a deal, which I found out wasn't recorded so he could give me free extras (that I didn't even want)He got his commission then I got charged 100's of dollars more as they're not free extras.My account manager promised a refund on these services and has now just ignored me for the past 18 days, I haven't had a refund.One of the services I got conned into was a security tool, which they claimed would stop and viruses, I never had a single virus flagged with it, yet manually found some, and had some flag up via Wordfence, so the extra tools we're also useless anyway.They get 2 starts instead of 1, because the servers themselves are very good, as long as you don't need support.There control panel for the billing area is by far the worst I have ever come across in my entire web development career.They are not cheap, and the support is terrible, so there is no real reason to use this company, they have absolutely no USP."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Annie Middleton",
          "Nb_Reviews": 5,
          "Date": "2020-05-05T14:49:27.000Z",
          "Titre": "Dedicated Servers: Good infrasturcture, Bad customer service.",
          "Contenu": "May 2020: Update. The support is just awful. I had a problem with one account on a dedicated server going down. It took 3.5 hours for someone to respond and they had made a minor changed and asked if I had fixed it myself. It's now been a week, they have changed the settings back on the account so that the sites sometimes loads quickly and sometimes hangs.  This is exactly what I was going thru last year.  I will send 3 numbered questions and get one response about a change they made while answering none of my questions.  It often takes days for them to respond and then I resort to opening a new ticket in order to get them to respond to my initial ticket.  Based on their replies, there doesn't seem to be any ability for the people that work there to look over the past information from the ticket.  I'm sure that's not the case, but that's what it seems like.  I'm now shopping for a new data center.  Liquid Web is completely unreliable in times of need.  I asked in a previous ticket and was told that if the server goes down, they should be able to get to it in 30 minutes.  Totally unacceptable!April 2019: Their infrastructure is great. Their customer support used to be better.  Now my tickets are shuffled from tech to tech, getting different answers from each one.  If I ask more than one question, they don't all get answers.  Ticket history doesn't seem to be read.  If you keep pushing you can get somewhere. It just takes work on your end."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2019-10-06T22:21:51.000Z",
          "Titre": "I expected more from Liquid Web",
          "Contenu": "I have been with Bluehost and MDDHosting. I do not recall spending so much time with their support (although to be fair--they each had their issues or I would not be here now). I was recommended last year to give Liquid Web a go. I wanted to hand the entire migration process off to someone on my team. It did not happen, as it was complicated. I am a technical person to a certain degree, but not enough to have avoided a tenuous migration process. This was last October. There were then a variety of different issues that were resolved until we hit a recurring one this past summer. I was on chat with a support person who told me I should take them up on their \"only one day\" left spring server special! She said it would stop the issues I was having. It was double the price monthly. I agreed as she gave a lot of credence to the upgraded server being something I could rely on. I have my payments each month automatically deducted from my credit card. I do not always check the credit card. Long story short, I had been charged for the old server the last few months. In speaking with their tech team after blowing a fuse. I was informed they keep the old server going until I tell them I want to get rid of it. Unfortunately, NO ONE informed me of this at all. NO ONE. Not the person who sold me their spring special, no one since then--nothing. My responsibility is that I did not check my credit card statement. Their responsibility is when you have people who work for you and they sell a client into something new, they should also tell the client that they will continue to have the old server and be charged for it. I did not go through this at the other server companies, as the monthly cost of 99.00 is what I paid for one year at MDD and about half what I paid at Bluehost annually. For a client who did not have the background or experience with moving servers within a company this was not cool. You need to inform your clients when YOU sell them a new item. I was given one month of a refund, instead of the past few months. Had I not noticed my credit card statement, it could've gone on even longer. I do not and have not used the old server (again I had no clue that I could since no one felt the need to tell me). I gave two stars, because they are expedient in tech response, though some of the issues I have had took quite awhile to be fixed. I am grudgingly looking to move server companies again. Ugh, but I seriously am not down for the attitude of customer service at Liquid Web."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cory Fuller",
          "Nb_Reviews": 2,
          "Date": "2020-02-24T06:32:05.000Z",
          "Titre": "Poor Service and Communication",
          "Contenu": "This review is a tad long, but I assure you it is worth your time. I am convinced that most poor reviews are written in a frustrated and heated moment, however, my review is going to calmly explain my full situation so that you can make an educated decision for yourself.I own a small web design and hosting company. As a start-up we used self-managed VPS machines to host our client websites. However, we found that most of our time was dedicated to system administration rather than the business itself and so decided to find a company we could partner with to manage the overall support for system/server side of things. In other words, they handle the server and we handle our business. Unfortunately, from day 1 it was nothing but problems with their customer and technical support.We purchased a 1 year pre-paid plan (bad idea since they have a NO REFUND POLICY). We asked if we could use Plesk instead of cPanel with our server. They said it was impossible to use Plesk and use the server OS we had. This was not true since we were using it on another server just fine. After about 30 mins of transfers to different level technicians, they finally agreed it could be done. We then asked for them to install CloudLinux and we went through the same charades to get it approved. Once it was approved they added a $20/m fee, even though a personal license is only $14 from CloudLinux directly. Since I had my own license I asked if I could just use that instead and they refused. Obviously an upsell tactic, but poor service in my book.After the server was all established we were assigned an Account Manager since we were considered a part of their \"Partners\" program. The Partner program is nothing more than a few videos and write ups on basic web hosting and server management. However, you apparently have access to a Dedicated Account Manager and a free WHMCS license. At first, these two things caused me to feel valued in our pursuit to build a relationship with another company. However, I requested the WHMCS license several times and never received an answer. My account manager was also difficult to get a hold of and gave empty promises when I asked to expand our relationship.As an example, they had a new years sale and we decided that it was a good time to expand our capabilities. We contacted our account manager and asked if we could upgrade the server we had just purchased and pay the difference for the upgrade since it was less than 30 days. This would have resulted in doubling our initial investment with them. He agreed and asked me to contact sales and let them know that he approved it. I did as instructed and not only was I told he did not have the authority to approve it, the representative was short and rude. I attempted to get a hold of my account manager to discuss the issue again and he never responded back.During this time I was charged $70 with no explanation. I opened up a chat to discuss the charges and they said they had to elevate it to a ticket. I waited 4 days without a response and had to open up another chat to get it looked at. It was \"corrected\" and funds credited to my account, but still no explanation of why it happened, what was corrected and only half the charge was credited. A month passed and I was not billed for anything, however the following month I was billed for $20. I asked for an explanation and they said it was the CloudLinux fee. I explained that during the process of installing Cloudlinux I asked to be taken down from Fully managed to Core managed, which was reflective in tickets/email and lowered the price. They said there was no record of the conversation, even though I had it in my email as proof.To conclude, I am patient and reasonable, but Liquid Web has poor communication among themselves and overall poor customer service. I will say I had one tech that was excellent when installing Plesk but overall as a company, go elsewhere. Sadly, there are more issues but I have limited space left..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerry Hilburn",
          "Nb_Reviews": 3,
          "Date": "2023-07-28T01:14:31.000Z",
          "Titre": "Better in the past.",
          "Contenu": "I've been with Liquid Web for more than 10 years and in the last two years the support quality has changed. Depending upon who picks up your ticket you might get a knowledgeable engineer, or someone that is barely able to identify and correct your issue. I am very disappointed with the way renewal is handled. Instead of providing you a path to a 1 or 2 year upfront payment option with discount, they make you wait until your current contract expires to determine your new pricing.The invoices always say zero dollars in email. You have to open your management interface to find out what was paid and how much was paid. I have discovered mistakes from time to time that were only caught after I closely checked my invoices online each month.Recently they upgraded a system on a Weekend late at night and almost immediately I started receiving high load warnings every hour at the exact same time. When I called in for support the technician tried to tell me it was an issue with memory and suggested I upgrade my server. I hung up on him, and called back. The next tech said there was an issue on their end they were working on but would not share the details and insisted on creating a ticket. He failed to create the ticket after I ended the call.When I did not receive the ticket and called back again and this time the tech told me straight up that an upgrade to their backend had broken backup disc storage and was creating the issue. He did issue a ticket, unmounted my storage, and then I waited a week for a correction.I still want to believe in LW and continue my hosting with the company, but these annoyances have left me pause to consider other VPS providers. I have many clients I setup on their own LW VPS offerings and I manage their sites on those servers. This obviously creates excess service hours when multiple VPS's are affected by a backend upgrade. Currently I rate them 3 of 5. They need to be more consistent in the support department, more transparent in billing, and come up with a way of addressing renewal offerings before the end of each annual contract expiration. In that they are not a low cost provider compared to their competition they do need to address these issues to keep long time customers from jumping ship."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LANCE L",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T21:33:36.000Z",
          "Titre": "The experience of passing the ticket…",
          "Contenu": "The experience of passing the ticket between multiple techs was a bad experience.  Repeated steps each time I got a new person and LONG delays in the whole process.  Other than that, the work was completed as expected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T00:31:40.000Z",
          "Titre": "Hosting and technicians are great but…",
          "Contenu": "Hosting and technicians are great but sometimes I receive no response from sales staff for days or weeks. They become impossible to get any response from, miss meeting, and ignore you. It is disrespectful. Other than that issue, their service is fantastic. I have used LW for many years and I recommend you do to."
        },
        {
          "Note": 3,
          "Lieu": "UA",
          "Pseudo": "Cemal Fatih Keçelioğlu",
          "Nb_Reviews": 8,
          "Date": "2023-01-28T08:04:41.000Z",
          "Titre": "Avoid if you can",
          "Contenu": "Edit: At the least, the supervisor did his best to recover from their mistakes. So two more stars.But these should not have happened in the first place.I am not satisfied with their services. It is such a messy and disorganized support team. Why?1) They constantly ask me to buy SS+ or Threat Stack. On each ticket. It is like you are being spammed constantly on your own tickets that you open.2) SS+ package previously broke my site. So we discussed with one of their team members to EXCLUSIVELY avoid disabling set_ini function. After several confirmations, I gave them the green light, and they STILL disabled the set_ini3) It does not stop there. I opened another ticket to cancel LimitLoginAttempts rules because I found a plugin that does the job. Then first, my .htaccess file got broken, and then user.ini file broke down due to a setting included PHP 7.2, which does not even exist on the server!!!While all of this is happening, sales are plummeting, and traffic is dropping organic traffic is suffering.These are not professional guys; it feels like just a few bunches of kids playing behind computer screens. And I must add the \"account manager\" is a joke. He just evaporated, not able to follow up anything.I am not migrating only because it was a big hassle to migrate and introduce my website to another company. But I think I will have to do that soon.OLD review: I am not always having the best experience, but their support is really dedicated and hard-working."
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "Justin W.",
          "Nb_Reviews": 5,
          "Date": "2022-08-10T14:21:48.000Z",
          "Titre": "Good communication but no result",
          "Contenu": "Quick summary: paid by PayPal. Told have to produce two ID documents for \"Fraud Prevention\". Didn't want to. Refund ok - but seems to take a week. Don't understand why they took the money before the checks rather than the other way around.Detailed narrative: I paid them a substantial sum of money. They took the money from my PayPal account and started demanding that I send them two forms of government Photo ID to actually provide the service I had just paid for. They said this was \"Fraud Protection\" but very odd then that they went ahead and took the money before seeing my ID. If they thought it was a possible fraud surely they should have done the checks and then taken the money? I lost all trust and cancelled.It is important to clarify in response to the claims from LiquidWeb below that a) I paid by PayPal for the hosting which is an available payment option and b) despite saying this was a fraud protection measure they took the money from my PayPal account before checking my documents. They then refused to provide me with the already paid for service until I had provided the documents. The phrase «Liquid Web cannot take payment from your PayPal account» I don't quite understand. I have a PayPal statement showing a payment from my account to LiquidWeb! Perhaps they can explain this?(As a side note they demanded that I send the documents by insecure email as open jpegs - not even a password protected archive).Update! Ok. I sent the money from PayPal; they didn't «go into the account». I don't think this is important. The point I want to make clear to readers is that they said «Fraud Protection» - but they took/I sent (via their PayPal integration which they set up) the money Before they saw the ID documents. They then refused to provide a service before seeing two government photo IDs. Just be aware that this can happen(Hopefully - final update. The refund it seems can take several days. Though the payment to them seems to have been instant. This means my funds are tied up for days).Update! I paid with bank account not a card but perhaps that does not make a difference.But - let's not lose sight of the main point!!!! - If Liquid Web had not taken/received the payment Before blocking provision of the service for \"Fraud Protection\" we would not have been in this position. This is my point. They should not take funds and then raise further demands to provide the service. If they want to raise further demands they should do this, give the client the choice, and only take the funds when they are actually going to provide the service."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Claudia Tavani",
          "Nb_Reviews": 2,
          "Date": "2022-03-11T07:00:02.000Z",
          "Titre": "AI support",
          "Contenu": "I had my sites on LiquidWeb for little over 6 months and had to open countless tickets for a number of issues which included sites randomly going down; redirects not working etc. What I truly disliked was that support was slow; it never fully solved my issues (it always took another ticket to find out there was an extra step to go through to get things properly fixed, and I only would because I asked and pressured for an answer); and support felt like a cheap AI or bot rather than actual humans. I was glad to move away."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Moorhead",
          "Nb_Reviews": 2,
          "Date": "2022-01-07T02:10:58.000Z",
          "Titre": "Thank God for Kohl",
          "Contenu": "I give this rating a three because it took over a week to resolve my issue. I was struggling and had to work with MULTIPLE people at Liquid Web to get resolution. HOWEVER, in the end, I finally got to a man named Kohl. And he...was...AMAZING. He solved every issue that others couldn't and did it quickly. He had instant resolutions to issues, was kind and helpful and was a genuine pleasure to work with. I do like having this company as my hosting service. And my issue was very complicated. A lot of techs tried to help me. But Kohl stood above the rest. I just wanted to commend him on his professionalism and REAL expertise."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim Trott",
          "Nb_Reviews": 2,
          "Date": "2018-12-28T22:03:23.000Z",
          "Titre": "Handle with care and demand that coodination and communication.",
          "Contenu": "The LW sales person takes no responsibility when there is any problem. That's how it is when you are a \"small\" account anywhere.  It was a rough start but things are improving now that I have found a few people I can trust. Make a checklist demand that they maintain communications and coordinate with you on a migration. Don't just trust and wait.  Rackspace priced me into non-profit status after almost 20 years so I had to move."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ariel Hermenegildo",
          "Nb_Reviews": 2,
          "Date": "2020-09-10T19:38:07.000Z",
          "Titre": "Save your money and avoid this hosting",
          "Contenu": "Save your money and avoid this hosting. I'm the one who have experience of their cloud sites (cloud based hosting). This is one of the worst hostings after Godaddy and Dreamhost. 1. No filemanager2. Always issues with files and folder persmissions - need to contact their support to flush/update it, otherwise you can't rename, remove, edit or delete it from FTP, which is your only access3. First byte speed and overall SEO scores are low here.4. Support is Ok-ish, no as much experienced, but very fastAdded Later: Unfortunately there isn't any way to reply.Small correction: we have >50 websites hosted on your hosting and these permission issues are not continued issues on the same site. This is issue that we have an all websites that we host with LQ."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Paul Healy",
          "Nb_Reviews": 2,
          "Date": "2019-06-26T13:27:41.000Z",
          "Titre": "I had my subscription transferred to…",
          "Contenu": "I had my subscription transferred to Liquid Web from Rack Space when Rack Space decided to sell off their Cloud Hosting service.I noticed the difference immediately - a poorer customer interface for managing sites and poor webmail. However, hosting was reliable and I continued using their site for a few years.Gradually, the costs started rising - and it was only when they started charging for mailboxes that I started to think about ending my contract with Liquid Web.The customer service was quite good by industry standards (or at least up until December 2018 when I left). However, I get the impression this company at some point for some reason or other decided they needed to squeeze extra money out of their existing customers while not providing anything extra in return. I'm pleased I moved on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Everyday Data Science",
          "Nb_Reviews": 2,
          "Date": "2020-05-13T04:45:40.000Z",
          "Titre": "Formerly a very happy customer with…",
          "Contenu": "Formerly a very happy customer with WiredTree. A shame LiquidWeb totally destroyed the trust I had with WT after their takeover.  Look around and you can see many other negative reviews from former WiredTree customers. Perhaps it is because they have grown so big and focus more on larger enterprise clients.After migration I got the same level of hosting performance but much less pro-active support.The biggest issue is they continually raised prices on my plan till they were over 70% more expensive than my previous WT bill, all over 1 year. The billing team is extremely slow in responding to requests and has very poor handover with the tech team.I'm leaving 3 stars for their stable hosting platform. However I find LiquidWeb is way overpriced for the level of performance and support they provide. I've just terminated my contract and am enjoying a superior level of performance and service from my new host, at a price less than 1/3 of what I was paying for my previous VPS plan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew P. Seltzer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:20:02.000Z",
          "Titre": "Four Stars--Keep Up The Good Work",
          "Contenu": "I like the fact that it seems that most of the customer service reps with whom I've interacted are native speakers of English.  Also, have I told you how much I love the fact that I can actually call you guys on the phone?  (The chat feature is a little less than satisfactory, which is why I gave you four stars instead of five.)"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Avrom",
          "Nb_Reviews": 10,
          "Date": "2023-10-20T18:43:45.000Z",
          "Titre": "I have mixed feelings about Liquid Web. Excellent support but high costs.",
          "Contenu": "I have mixed feelings about Liquid Web. We've been a customer since 2012, and the technical support is excellent. I don't know any other hosting provider that provides that kind of support. It is the reason we stay. However, the high costs, CAD to exchange USD and sales is not good. This year, we have been hit with several price increases with Liquid Web, and with the dollar exchange is becoming painful. We endured a 60% increase in our monthly cost without any notice, and ongoing price increases this year.LW could offer us no discounts as a long-time customer.  The costs on all their services are extremely high at premium rates now (with the CAD dollar). We stay, only because of the excellent support, however, moving hosting providers is always on the back of our mind now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stu",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T19:00:30.000Z",
          "Titre": "I am happy with the experience so far",
          "Contenu": "I am happy with the experience so far. It was daunting migrating my old server and setting up my new one but support played a big helpful role in it. Looking forward to using my server when my busy season starts...real soon!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Intrepid Network",
          "Nb_Reviews": 4,
          "Date": "2022-08-03T04:14:30.000Z",
          "Titre": "The continued support is appreciated.",
          "Contenu": "Liquid Web has helped us transition from a legacy hosting environment to our own VPS. Even though this process has taken a lot of staff hours we are please with the support we continue to receive along the way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-07-19T16:23:10.000Z",
          "Titre": "On this issue the first tech gave up…",
          "Contenu": "On this issue the first tech gave up and said there was nothing that could be done which was disappointing. After calling and getting another tech on the phone he solved it with in a few minutes while on the phone.Since Covid the tech support has been hit and miss so I can't give a 5 star rating at this time. Prior to Covid the support was top notch. Hopefully it will someday get back to that level."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sacha Brant",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T04:02:31.000Z",
          "Titre": "You're always helpful!",
          "Contenu": "You're always helpful and we always get the resolution. The only reason I didn't put full stars is that it's hard to know WHEN something will get addressed, and the waiting without knowing is painful sometimes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T22:04:39.000Z",
          "Titre": "Issue was resolved.",
          "Contenu": "Issue was resolved.Not sure if initial proposed solution did the trick or final solution by the last rep."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rockinroot",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T11:00:58.000Z",
          "Titre": "Two years of managed hosting",
          "Contenu": "LiquidWeb hosted my web server for two years. Startup was simple, and the live chat and phone support were very helpful each time I needed assistence. I would have gave five stars, however my main concern is clarity of pricing and billing. When I signed up I had no idea that I would not be able to pay the same rate in the next billing cycle, so  when the price increased three-fold, and I had spent two years saving, I realized I had no choice but to move on. This also took place in the cPanel email, and I'm not sure whose fault it is, but they said it would increase annually and then I started getting monthly bills for five dollars. To me, the word annual means yearly, not monthly. I don't want to blame LiquidWeb for this. It's all good. In the future however, I would rather see paying, returning, long time customers receive the discounts instead of new members. I must say that the support team has been excellent. In all the two years I did not have any downtime that was unscheduled, and my connection speeds were best. There is a lot of behind the scenes management that was taken care of for me by the technical staff here at LiquidWeb, also, and for that I recommend anybody looking to start a business or corporate website to use LiquidWeb. If you are like me, and just want a fileserver to share photography and homemade music with friends, maybe get something more budget friendly.Thank you for reading this review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2023-03-14T01:51:22.000Z",
          "Titre": "I got patient help.",
          "Contenu": "I got patient help.However, it seems liquid web has outsourced its help desk and time will tell if the reason I host there remains."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl Farrington",
          "Nb_Reviews": 4,
          "Date": "2022-07-25T14:47:22.000Z",
          "Titre": "Grass is not always greener on the other side.",
          "Contenu": "I originally gave a two-star review and have revised it for the following reason: Although I think they need to improve their trans-atlantic communications over all for the money, I really didn't realize how good I had it. I attempted to migrate to another data center, and what a nightmare by comparison."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T17:33:06.000Z",
          "Titre": "great support",
          "Contenu": "great support, small bit of advice -not all customers are IT people so keep in mind that we don't know what you know. walk us slowly through he process."
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "ITL Kenya",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T11:34:29.000Z",
          "Titre": "Good Support Staff and they know what…",
          "Contenu": "Good Support Staff and they know what needs to be done. Fast Service too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T17:13:38.000Z",
          "Titre": "I appreciate all the help and…",
          "Contenu": "I appreciate all the help and assistance we where given and the responsive time frame, as I know what we where working with winacme is technically not supported but as these are newish servers and we didn't have to go though this before and it only happening on the one sever its questionable to what root cause of the issue just wish there where some guides from liquid web outlining the way to fix the issue not some google articles though getting it fixed was the priority"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Charlotte Moore",
          "Nb_Reviews": 5,
          "Date": "2022-04-26T20:42:09.288Z",
          "Titre": "I've been on Liquid Web for a few…",
          "Contenu": "I've been on Liquid Web for a few months now for networking. It's an extremely friendly and welcoming space with tons of business owners and services. I've met some wonderful people and have been doing business with them and we have been supporting each other's businesses. I would highly recommend Liquid Web if you're a beginner business owner, a small business, or if you're just looking for services or to network."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Anthony Page",
          "Nb_Reviews": 2,
          "Date": "2022-03-16T00:36:36.000Z",
          "Titre": "Memory issues on my managed server…",
          "Contenu": "I had memory issues on my managed server, even though current traffic was low. Ted and especially Brian found and corrected several configuration problems which radically improved the situation (and Brian continues to monitor). Early stages, and Covid has decimated my travel site traffic, but support fresh eyes has so far produced notable results.I have deducted one star because I consider some of these configuration issues should have been picked up before given the server is managed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-01-17T20:49:14.000Z",
          "Titre": "Generally OK but seem to be focused too…",
          "Contenu": "Generally OK but seem to be focused too much on acquisitions and not enough on existing customers.  Technical support is usually good, but it used to be ALWAYS good.  From Best In Class to merely above average.  My Sales account rep is disinterested.  I don't think there is a better choice, however - at least not when also considering the hassle of moving."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T16:01:39.000Z",
          "Titre": "Liquid web has always been good on…",
          "Contenu": "Liquid web has always been good on support. At times, they have gone above and beyond based on the request. Keep up the good work. Knowing that they have folks with good knowledge and willing to help no matter how dumb the question may be is comforting. thank you."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "simon harrison",
          "Nb_Reviews": 9,
          "Date": "2022-09-05T11:30:17.000Z",
          "Titre": "Watch this space!",
          "Contenu": "Updated review...trying to work through customer service issues"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T18:26:09.000Z",
          "Titre": "Migration of Custom Web Application",
          "Contenu": "Just completed migration of our custom application to Liquid. So far I am very impressed by the quality of the VPS as well as the technical support. And the willingness of the team to go the extra mile to help with this migration. I took away one star because of the final synchronization one tech was not very careful and overwrote some of the settings that we had configured as part of the testing phase. Fortunately another tech was able to help correct the issues and we are now up and running. Looking forward to a long lasting relationship with Liquid Web."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 2,
          "Date": "2020-05-04T14:29:34.000Z",
          "Titre": "Excellent",
          "Contenu": "My online program has received several upgrades and as usual had several programming glitches that needed the attention of Liquid Web technicians. They were timely in getting back to me and expedient in solving the concerns. The only reason that I didn't give 5 stars is that I don't always understand their lingo and would appreciate when possible to break down their explanations to lay terms - otherwise they are excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T19:56:29.000Z",
          "Titre": "We do Like your service a lot",
          "Contenu": "We do Like your service a lot. The only reason I give 4 star is, the speed. It seems the server speeds could have been increased more. Most of the sites due to server cranks runs slow. But if I oversee that, you guys are awesome. And I must appreciate your customer support, they are awesome."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T06:09:40.000Z",
          "Titre": "The Support Team is exceptionally great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T20:05:18.000Z",
          "Titre": "Liquid Web has been a great partner!",
          "Contenu": "Liquid Web has been a great partner for us. We are a small agency with no server admins/techs on staff so we rely on their availability and competency often but especially in panic scenarios when a client's site is down or we have technical questions outside of website development."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacqueline Yoo",
          "Nb_Reviews": 1,
          "Date": "2019-04-25T16:54:19.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "The support staff at Liquid Web is available 24 hours every day. Wait time is usually very short or non-existent (I usually use the live chat and not calling on the phone). The support staff are always friendly and courteous and will stay on the case until your issue is solved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd Broadbent",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T20:57:40.000Z",
          "Titre": "Major Migration",
          "Contenu": "We just recently migrated around 35 websites to 2 dedicated servers at LiquidWeb. The migration included a legacy Wordpress multisite network and Michael was extremely helpful in getting this over and discovering that this pre-WP 3.0 multisite does not have the same built-in redirects that subsequent versions of WP include, and is likely causing the bugs we've never been able to pinpoint. (Every developer that has worked on it assumed it was something we couldn't find in our configuration). Our sites now run about 10X faster post migration. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2020-03-30T21:04:49.000Z",
          "Titre": "They care about their customers.",
          "Contenu": "After a terrible customer service experience, they went out of their way to try and do the best to make up for it.  It's still a little concerning that their weekend support is not as available as expected, but they did really try to make it better."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T19:28:48.000Z",
          "Titre": "Managed WordPress Liquid Web is highly…",
          "Contenu": "Managed WordPress Liquid Web is highly recommended for site speed, performance and reliability. If you have outgrown WPEngine and/or want more features but not ready to moonlight as a system administrator, you cannot go wrong with Liquid Web."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2021-02-18T20:07:42.000Z",
          "Titre": "A rough beginning",
          "Contenu": "A rough beginning. There were multiple oversights in the setup of my environment. Including software that was never applied to my environment, incorrect software licensing, broken networking configurations (On both the hardware firewall and software firewalls), missing backups, and more.  All of which was clearly listed in the contract that I signed. It took nearly two weeks before the environment was even safely usable, after I was billed for my VMWare cluster.    It was disappointing that there was such a lack of quality control on an enterprise grade service. However, the technicians have been getting it all resolved and the environment is now working well, despite the rough start."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Adrian Wanless",
          "Nb_Reviews": 10,
          "Date": "2022-03-08T18:21:52.000Z",
          "Titre": "Support has been great as usual",
          "Contenu": "Support has been great as usual - but no one has been able to explain why Manage is not allowing SSL certificates to be renewed and added. Hence the 4 star and not 5 star."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2020-01-17T23:26:13.000Z",
          "Titre": "Good hosting company.",
          "Contenu": "I have changed this to 4 star because support did fix the issues (migration from cpanel to siteworx) in a very professional manner. The staff are really good. The issue I still have is their ticket system. While they have 50 some second guarantee of a response to the first initial ticket (which is great) I waited 15 hours for a reply after the support person finished their shift. And so it goes. The ticket system does not maintain any sense of urgency after the person finishing a shift is replaced. I feel this is an LW systems issue rather than support staff. It has been like this for years and is my only real problem with LW. Otherwise their a great company to deal with."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "AG",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T08:29:50.000Z",
          "Titre": "The best tech support team",
          "Contenu": "Superb & effective resolution provided always by the great customer support reps!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2020-05-01T12:11:58.000Z",
          "Titre": "Liquid Web is awesome and if you need…",
          "Contenu": "Liquid Web is awesome and if you need to call them they are there to help at anytime and also if you need them to they will walk you through what you need to do..Awesome group of people.. I highly recommend them.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-07-28T18:29:18.000Z",
          "Titre": "If Only Liquid Web Could Do This One Thing.",
          "Contenu": "I’ve been using Liquid web for several years now. I would probably give liquid web 3.7 stars if I could. Overall, I’m somewhat pleased, however I’m not over-the-top happy. Like most businesses that provide service, it all depends on who you get. I’ve had many positive experiences with support admins that know their stuff and can do some good troubleshooting. However, I have also had a good number of interactions with support admins that are not experienced and have wasted my time. My most recent interaction was with one of the most knowledgeable and helpful Liquid Web admins I’ve ever had the pleasure of working with. His name is Scott Bixbey. If Liquid Web could clone this guy, they would dominate the market. Until that day comes, support will always be hit or miss."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AMain.com, Inc.",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T19:13:01.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. The biggest problem I have is the lack of inventory for exactly the same spec dedicated cloud servers, so when we need to spin up more we can't always get the ones we need."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2019-05-15T02:11:37.000Z",
          "Titre": "Great service at a fair price",
          "Contenu": "You may have to push a little, but they really will help you with any issues. Great service at a fair price."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Madeleine",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T02:01:19.000Z",
          "Titre": "thank!",
          "Contenu": "thank!Fast service. Price norms. I liked the support. Quite good conditions. Server norms."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ian Shere",
          "Nb_Reviews": 3,
          "Date": "2019-04-30T18:19:30.000Z",
          "Titre": "Good hosting and support",
          "Contenu": "Since starting our website design business nearly 10 years ago (and we host 95% of our clients) we have been through 3 different hosting providers. The first 2 began well then went downhill. Both gave stellar live chat support initially, but, as they grew, the response times got worse as did the service once you finally connected. With the last one, I regularly got stuck in the \"swamp\" for 10, 20 even 30 minutes before being connected.On a friend's recommendation I changed to Liquid Web about 5-6 years ago and haven't looked back. I've done at least 2 if not 3 hardware upgrades as my needs changed and they've always been extremely helpful. And all this wonderful support does NOT come at a premium cost. I've found their pricing to be extremely competitive and their support outstanding.I unreservedly recommend them as a single site host or someone, like me, who wants to buy space to host numerous sites.EDIT: As of today - April 30, 2019 - I have removed a star. My PCI scan failed due to a quite outdated OpenSSH on the server. I have had to pay $75 for them to upgrade their software on my server. Not on. I have no control over the software installed. Despite paying a reasonable amount for my server setup, this is the sort of thing cheap hosts do - using outdated software.Had this been less critical to my business, I wouldn't have altered my review; however, begin fined every day I'm out of compliance, then being charged not to be fined is not my idea of great support."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T00:55:14.000Z",
          "Titre": "Victor did a great job to get it…",
          "Contenu": "Victor did a great job to get it sorted. Many thanks V"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teresa Wilson",
          "Nb_Reviews": 4,
          "Date": "2022-05-18T17:49:12.000Z",
          "Titre": "A good hosting service for small…",
          "Contenu": "A good hosting service for small businesses."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Stacy",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T21:36:55.000Z",
          "Titre": "Service is acceptable and order is fast."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "galal",
          "Nb_Reviews": 5,
          "Date": "2020-05-08T09:12:23.000Z",
          "Titre": "Thanks for your good support and…",
          "Contenu": "Thanks for your good support and service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ArtStreet",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T17:58:23.000Z",
          "Titre": "Always great technical support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "OMG Media Partners - Chris",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:32:38.000Z",
          "Titre": "Many thanks to Kohl",
          "Contenu": "Many thanks to Kohl!  Remarkable experience this morning.  Kohl was extremely knowledgeable and helpful.  He was able to quickly identify my needs, address my immediate concerns, and make recommendations for future growth and EOL of some current products we're using.  Because of his expert advice and explanations, we made some overdue changes and upgrades to the account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:55:55.000Z",
          "Titre": "LiquidWeb support is almost always…",
          "Contenu": "LiquidWeb support is almost always great.  But a recent  experience with Krissy from support was stellar.  She went the extra mile to make sure the issue was completely corrected, communicated everything to me, and took the time for pleasantries which made me feel like I was dealing with a human rather than a robot (like so many other places).  Great job!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ch",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T15:54:25.000Z",
          "Titre": "Site restore",
          "Contenu": "We're able to completely restore the website from a previous state. great job!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Kelley",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:18:55.000Z",
          "Titre": "I have had a dedicated server with Liquid Web",
          "Contenu": "I have had a dedicated server with Liquid Web for over 3 years. I stay with them because of their quick and responsive customer service. No matter what time of day or night, I can get quick help with any website or server issues I may have. I have had dedicated servers with several companies in the past. Liquid Web takes care of me."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T01:50:56.000Z",
          "Titre": "Super-speedy, friendly, professional resolution - again!",
          "Contenu": "My request for help was met inside a minute by the wonderful Fred. I am constantly astounded at the speed with which LiquidWeb's helpful humans respond, and then work speedily to resolve my issues. Fred's help, and his constant speed of reply greatly helped to reduce my levels of stress. Fantastic service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TM",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T23:30:24.000Z",
          "Titre": "Completely Satisfied",
          "Contenu": "I have been with Liquid Web for over two years and loved their uptime and service.  They responded quickly to service tickets on the few times I have had to use one.  I upgraded to a larger VPS.  The migration started slow (about three weeks) due to some confusion and clarification of which control system to use.  Once I called Michelle at support, she immediately recognized the problem and brought Robert into the picture.  Robert went to work and had our old server completely and perfectly migrated to the new one in a couple of hours.  He was patient and answered all my questions.Thanks again, Liquid Web, Michelle and Robert.  Best VPS service available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Admin",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T16:56:13.000Z",
          "Titre": "Liquid Web truly are the most helpful humans in hosting.",
          "Contenu": "The level of support that Liquid Web provides is hard to comprehend without experiencing it. It's also hard to describe. The variables involved in optimizing and managing your site can be enormous, depending on the complexity of your site. Liquid Web is a partner with you throughout the life cycle of the project, providing assistance at every step. They are also a fantastic resource for educating and empowering you to do a better job in every aspect of managing your site, from design and development to DevOps, server management and security. They will take care of you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Vigil",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T01:36:28.000Z",
          "Titre": "LiquidWeb has been great for us",
          "Contenu": "LiquidWeb has been great for us. The people are very friendly, extremely helpful, and help to make sure everything is done right. I recommend wholeheartedly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:50:40.000Z",
          "Titre": "Fast Service",
          "Contenu": "No wait, once I contacted customer support my issue was solved in minute's. My experience with Liquid has always been good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T10:16:53.000Z",
          "Titre": "I started using Liquid Web servers over…",
          "Contenu": "I started using Liquid Web servers over 10 years ago to host a dozen sites requiring both cPanel and Plesk. Their support staff have been patient, understanding, and extremely helpful in solving both major and minor issues of server stability and security. Their recommendations for improvements to server efficiency and security have provided greater peace of mind and allowed me to focus on growing my business."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Dénes Székely",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T21:24:58.000Z",
          "Titre": "I am their client for almost 10 years",
          "Contenu": "I am their client for almost 10 years, and in this time I convinced many of my clients to do the same. The support is brilliant, the products are simply great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GEORGE MANSOOR",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T19:47:07.000Z",
          "Titre": "Amazing support",
          "Contenu": "I am very grateful to Liquidweb for their care and support, especially Steven Davis. Thank you all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAN",
          "Nb_Reviews": 6,
          "Date": "2023-12-11T16:39:17.000Z",
          "Titre": "The Tech was knowledgeable and…",
          "Contenu": "The Tech was knowledgeable and explained things in terms clear to me.The Issues was fully resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dhanu Konara",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T18:36:14.000Z",
          "Titre": "Linux Tech Support Review",
          "Contenu": "I recently talked with a member of Linux Tech Support, Alex Silkin, and he helped me solve a major technical issue. He was very patient with me on the phone and was very knowledgeable about the issue. I really appreciated his patience and understanding as I have never faced this problem before. We covered a lot of things during our phone conversation. Not only did he resolve the issue, but he also explained some important concepts to me in a very clear manner. Liquid Web is very lucky to have Alex on the team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Tsiopanos",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T02:10:15.000Z",
          "Titre": "I trust Liquidweb engineers to support my business.",
          "Contenu": "Liquidweb engineers have been responsive and on-point with their willingness to investigate and troubleshoot even complex issues. For as long as I have been a customer, they have been only a phone call, ticket, or chat message away. I don't expect people to work as hard as I do, but Liquidweb is there like a trusted engineer working by my side."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hello World",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T02:09:24.000Z",
          "Titre": "I've worked with hosting and vps…",
          "Contenu": "I've worked with hosting and vps companies for 20+ years. Never have I had service like what I've had from Alex. We've inherited a site on a vps and are working through some tech debt and support has been amazing at helping us fix problems. Instead of \"you should change your config here\", or worse \"you should check your config\", support has identified and fixed multiple issues for us. And fast. Some were legit infrastructure issues but some would have been punted back to us with limited help with other companies. I'm impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Software Engineer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T02:47:20.000Z",
          "Titre": "Always there when you need help fast",
          "Contenu": "Our company depends on this server for business, and our users connect at all times of day 24/7 via Remote Desktop.  When a user noticed after hours that the connections were failing, and even could not connect, I put a ticket in to find out why.  Our support tech Fred Luke was able to get us back online with 10 minutes.  When I recommended Liquid Web to the company owner, he trusted my prior positive experience with them.  Liquid Web continues to shine with awesome support, and it is always above and beyond expectations!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Long-Time Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:04:10.000Z",
          "Titre": "Outstanding Tech Support Experience",
          "Contenu": "Tech Support person I dealt with on my ticket had a positive attitude throughout handling my ticket, responded with a pleasant demeanor and went above and beyond in making certain that my issue was dealt with in a professional manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Nisbet",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T04:41:05.000Z",
          "Titre": "Fast response",
          "Contenu": "Fast response, thank you for resolving the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T18:47:34.000Z",
          "Titre": "The customer service at Liquid Web is AMAZING!",
          "Contenu": "The customer service at Liquid Web is head and shoulders above any other hosting company I've ever used! Today I worked with Kohl and he was AMAZINGLY helpful. I truly appreciate his expertise. He is a real asset to the team!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Manoj Durve",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T11:07:59.000Z",
          "Titre": "Thank you Denis - appreciate your efforts",
          "Contenu": "Thank you Denis, I appreciate your efforts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:58:51.000Z",
          "Titre": "Kristopher was fast",
          "Contenu": "Kristopher was fast, efficient and friendly. We manage roughly 40 Liquid Web accounts and recommend them to all of our clients."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T19:29:22.000Z",
          "Titre": "Fast response and solution to my issue…",
          "Contenu": "Fast response and solution to my issue achieved. Very knowledgeable and courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carey Patton",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T01:19:54.000Z",
          "Titre": "Server Migration reviews..",
          "Contenu": "I just migrated to the new server and wanted to give a shout out to my tech - Arlie Rugg, Migrations Technician for getting me through it. Arlie was very quick to respond and answered every question in great detail. I highly recommend Liquiweb for your hosting needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Imagine That",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T21:35:47.000Z",
          "Titre": "There is no better hosting support than Liquid Web",
          "Contenu": "I am not a server-side expert. I need to rely heavily on support to walk me through some of that stuff. I have always had a 5-star experience with them. They are patient, knowledgeable, and kind. There is no better support out there as far as I'm concerned. And I've used pretty much every hosting company out there."
        },
        {
          "Note": 5,
          "Lieu": "LB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T02:11:16.000Z",
          "Titre": "Liquid Web is one of the best and most…",
          "Contenu": "Liquid Web is one of the best and most professional companies I have worked with so far in server providers because they guide you into what is most vital for you and the work you want to do to keep your services and resources up to date and protected. To add to this, the support is accurate and unique, they deal with any problem under their scope of work also if it is not under their scope they provide all the necessary articles and assets for you to have a clearer way to deal with any related issues Best Server provider in the world"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will D",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T01:58:59.000Z",
          "Titre": "I’ve been using liquid web for years…",
          "Contenu": "I’ve been using liquid web for years and recently had a Moulton month nightmare with one of my websites. One of the techs, Alex S , did an amazing job of working through and identifying/solving the issue. He is one of the top techs I’ve used during almost 12 years of being a customer. Well, the service was so outstanding I figured it deserved a review."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Cassie",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:21:59.000Z",
          "Titre": "Samuel was incredibly helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MAKane",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T02:45:14.000Z",
          "Titre": "Fantastic Tech Support",
          "Contenu": "After many years having dedicated servers managed by Liquid Web, I've come to expect great tech support, but today my support agent went above and beyond. I woke up this morning to see our primary website a complete mess with most pages not rendering correctly. I spent a few minutes trying to figure out what was going on, but didn't get anywhere. In a slight panic, I called Liquid Web support and was fortunate to be connected with Alex Silkin, a support technician who not only knows his tech inside and out, but also had the ability to keep calm and focused, and keep me calm and focused, over the several hours it took to make everything right again. He then spent more time on his own going over the server to make sure a problem like this doesn't occur again. Absolutely stellar in every way!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Georgetown, TX",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T14:14:29.000Z",
          "Titre": "Superior Window Site Support",
          "Contenu": "The Windows-based site support team is awesome.  They know their stuff and generally provide very quick resolutions to site issues.  As applicable, they will even provide resources (generally web links or instructions) to help understand and/or resolve issues.  Liquid Web is a “get what you pay for” type of company.  They are not cheap but for someone like me with limited technical knowledge, they are worth the expense.  I highly recommend Liquid Web."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T00:51:27.000Z",
          "Titre": "Fast response and Great explanation on…",
          "Contenu": "Fast response and Great explanation on issues that were concerning."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Debbie M",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T14:03:36.000Z",
          "Titre": "I was thinking of leaving Liquidweb",
          "Contenu": "I was thinking of leaving Liquidweb, having had a few less than satisfactory dealings with support staff in the past few weeks over issues with my web server.This time I got Mariam, and she was so great. She found the problems and managed to fix everything for me promptly. She saved you a client."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sygnifi Networks",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T15:04:10.000Z",
          "Titre": "The entire Linux Server support team is…",
          "Contenu": "The entire Linux Server support team is polite, competent, thorough, and wonderful! Over the years I have dealt with many companies in the same business as Liquid Web, and I will flatly state, \"Liquid Web's Linux Support Team gives the best support I have ever received.\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JayLewis",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T19:05:59.000Z",
          "Titre": "A rather odd problem that took some work",
          "Contenu": "A rather odd problem that took both us and your staff some puzzling and testing to work it out (was an IP block mis-match in php).  But YOU did and your persistence is very much appreciated.  Brian Buehler gets all the credit here for going a bit above and beyond and get our customer working again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "hAltonJones",
          "Nb_Reviews": 6,
          "Date": "2023-09-28T12:44:10.000Z",
          "Titre": "Phil Kyle was simply outstanding.",
          "Contenu": "Phil Kyle was knowledgeable, patient, understandable, and as professional as any support technician I've ever seen (and I owned a software company with a good sized technical support department). If I were still in the business, I would do whatever it took to hire him away!Excellent job."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Goh Kian Huat",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T07:36:46.000Z",
          "Titre": "Prompt Assistance to Renew SSL Certificate",
          "Contenu": "I was trying to renew my SSL Certificate. After I have deleted my CSR Code under SiteWorx, there was no icon to set up a new CSR code. It was a technical issue. I was impressed that Gayathri Poovannan, Linux Support Technician, was able to re-instate the icon to assist me to renew my SSL Certificate promptly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T10:37:30.000Z",
          "Titre": "Prompt resolution on ticket and follow up.",
          "Contenu": "The issue was investigated and looked into quickly with screenshots and logfiles explaining what had occurred.  This was very helpful to understand so our client was able to address what had happened in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BEAUTIFUL RUGS",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T06:34:02.000Z",
          "Titre": "Liquid Web where you expect excellent customer service!",
          "Contenu": "I called Liquid Web to get technical support and spoke to Dean Pike. He was very professional and knowledgeable. He spent enough time with me to answer all my questions. I received great customer service from him. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Year Customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T21:46:01.000Z",
          "Titre": "As a LiquidWeb customer since 2001",
          "Contenu": "As a LiquidWeb customer since 2001, I remember your old slogan \"Heroic Support\". I'm happy to say that 22 years later it's still alive and well. I had a complex downgrade and spoke with multiple reps during this migration and you were able to save me some money and make sure that everything still runs great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom D",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T19:29:06.000Z",
          "Titre": "Quick Response and Great Technical Support",
          "Contenu": "I contacted Support on a Sunday evening.  My call was taken in short order.  The Service Agent worked with me to bring the issue to resolution by utilizing an appropriate support team.  Ultimately, an issue was resolved that would have hobbled my client's business had it not been resolved before the start of the work week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Trumbore, client",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T21:49:03.000Z",
          "Titre": "I had a complex issue that has been…",
          "Contenu": "I had a complex issue that has been plaguing my site and Christopher was the first person who quickly identified the problem and made the necessary changes.  Very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeanne Z",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T18:21:25.000Z",
          "Titre": "Amazing employees of PBE Nexcess and…",
          "Contenu": "Amazing employees of PBE Nexcess and Liquidweb. Had a very difficult business need and they were able to help pull it all together and make it happen. Superstar awesome employees, Mark Lawrence who added the final touch to make it right, Phil Kyle who understood what was necessary for the business, and Ryan (sorry didn't get your last name). They were the main people who helped in this and they were so kind and patient. Thank you all so very much!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T20:11:32.000Z",
          "Titre": "She was professional and extremely…",
          "Contenu": "She was professional and extremely knowledgeable and helped me right away. Everything is working now!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T14:11:07.000Z",
          "Titre": "Ryan Powell was great",
          "Contenu": "Ryan Powell was great - he really stayed with it until he isolated the problem. Many thanks."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Kathy",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T05:30:23.000Z",
          "Titre": "Very grateful - no waiting and real people helping!",
          "Contenu": "Took 2 calls, but the first person was actually having technical problems of his own, so apologized (I understood - that does happen) and asked if I'd mind calling back.  When I did call back I spoke to Stan Conway, and he walked me through checking the settings on Outlook to make sure they were okay, and within a few minutes, everything was working again. I'm very grateful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lowfitz",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T22:30:04.000Z",
          "Titre": "Uncomparable support. Very satisfied.",
          "Contenu": "The support I get from Liquid Web for my dedicated server is consistently prompt, from agents who are very knowledgeable and cordial.  I've used 5 other web hosts over the last 21 years, and none have come even close to the quality of this support. My thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Nieves",
          "Nb_Reviews": 4,
          "Date": "2023-08-04T20:11:30.000Z",
          "Titre": "Five Star Service",
          "Contenu": "I just had an incredible experience with Liquid Web. I had an issue & questions I needed answered. Their customer rep Krissy Franklin handled my issue with the utmost empathy & professionalism. My issue was instantly resolved due to Krissy's prompt service. She is a tremendous asset to Liquid Web, & Liquid Web itself continues to provide me five star service. I'm a customer for life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2023-06-10T09:43:55.000Z",
          "Titre": "Great technical support!",
          "Contenu": "This review is a big thank you to two specific LiquidWeb support techs! Mark Greenhoe and John Duncan are fantastic at helping solve issues and both really went the extra mile for me. Overall they are a great hosting provider with excellent live phone support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Self-employed web developer",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T18:30:10.000Z",
          "Titre": "Support is everything",
          "Contenu": "Ryan is the kind of support that makes me choose Liquid Web year after year. LW isn't the cheapest option, nor the most flexible one. But when things go astray, as they always do, I love knowing that I have competent, native-English-speaking support I can rely on. Having the option to call when I need immediate help (with very little wait time) is the reason I use LW and recommend it to my clients."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kev",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T17:14:31.000Z",
          "Titre": "Outstanding company",
          "Contenu": "I have been a liquid customer for over 15 years now and had multiple servers for my company and clients.I can honestly say that the support they offer is outstanding.I am a windows admin but host websites & apps for my clients, never really bothered learning Linux as the Liquid Web support staff is there to hold my hand at all times of day or nightNo hesitation to recommend them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAKTechnologies com",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T23:01:55.000Z",
          "Titre": "Liquidweb is Awesome 💯",
          "Contenu": "Had all the fixes, all the answers. Awesome guy, extremely intelligent, highly professional, knows what he's doing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Cutler",
          "Nb_Reviews": 8,
          "Date": "2023-04-25T18:28:51.000Z",
          "Titre": "Amazing Customer Service",
          "Contenu": "I own a small company and neither myself nor my employees are very tech savvy.   We've been using Liquid Web for probably 10 years just because they always make it so easy.  If there is every any issue, which is rare, I just email them and they not only respond promptly, but take care of it immediately.  I wish the rest of the world offered such amazing service.  It would be worth paying extra for honestly, but the good news is that their prices are excellent as well.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John G",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T19:36:50.000Z",
          "Titre": "Liquid Web Support is simply awesome",
          "Contenu": "Liquid Web is simply awesome. Their support is unbelievably great and everytime I open a ticket or call the help desk I speak with someone immediately.Very professional and very knowledgable. You will not find better support anywhere else.I am an IT professional and have tried all of the top hosting companies and no one comes close to these folks.Great Support! If I could go above 5 stars I would."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T14:52:29.000Z",
          "Titre": "Another great support service…",
          "Contenu": "Another great support service experience. I was running into issues with my SSL cert and a new Cloudflare insulation and Steven D. from the Linux Support team took it upon himself to see that the issue was resolved - even going as far as to work over his shift time on multiple occasions - until the proper solution was in place. This dedicated and helpful support is why I’ve stuck with LiquidWeb for the better part of 5 years now. Thank you again Steven and LIquidWeb."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The CMOOR Group",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T22:49:47.000Z",
          "Titre": "Greg was awesome",
          "Contenu": "Greg was awesome.  As is everyone there in support.Seriously, LiquidWeb has probably the best customer support I've ever dealt with.   You rock!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald, MissionTracker",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T13:31:00.000Z",
          "Titre": "Steve Coyle did an awesome job helping…",
          "Contenu": "Steve Coyle did an awesome job helping us support and troubleshoot a very strange apache issue. We appreciate having technicians available to us like Steve who can provide technical prowess - especially on a US holiday (Memorial Day). Thanks Steve!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T20:15:31.000Z",
          "Titre": "Exceptional Customer Service by Ryan Powell",
          "Contenu": "Your customer service is always just stellar. I have been with your company for about 15 years and recommend to all my clients that they host with Liquid Web. Today I had a technical rep, Ryan Powell help me. He was exceptional. Friendly, knowledgeable, fast, intuitive, patient, just really quite wonderful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T11:47:53.000Z",
          "Titre": "Solid and Dependable Tech Support",
          "Contenu": "Max was polite, helpful and knowledgeable as I have found with all their support techs.  I've managed a lot of client sites on a lot of hosts and the Liquid Web tech support team wins hands down. I've been a client from day one and over the years I've found the service and support staff solid and dependable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon & Brandon, Inc.",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T01:11:53.000Z",
          "Titre": "Alex Silkin | Linux Support Technician is a Great Employee!",
          "Contenu": "Alex Silkin at Liquid Web provided 5 Star Linux Support to us today on a troublesome WordPress Migration from another Web Hosting Provider to our Liquid Web Dedicated Server.  Thank you Alex for all of the patience, time and attention you gave to us to work through the issues we were having.  The migration was finally successful due to Alex's assistance and expertise.  Great employee, hold on to him!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T17:22:36.000Z",
          "Titre": "I was having a problem with server cpu…",
          "Contenu": "I was having a problem with server cpu being consumed by a compression process and tech support (Jeff Z.) pointed me to the cause and solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler Rice",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T18:54:39.000Z",
          "Titre": "Liquid Web Does it Again! Thanks!",
          "Contenu": "Alex Silkin was incredibly helpful in getting my server email situation sorted out. He (among many other US customer reps) is always helpful and kind. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rocco",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T23:10:26.000Z",
          "Titre": "Helpful.",
          "Contenu": "you guys are helpful. Especially when your IT department is limited. They NEVER cop-out and try to get off the phone and say -that's a microsoft problem, call them.... They are ALWAYS willing to try to help solve your problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T19:14:37.000Z",
          "Titre": "Best switch I've made!",
          "Contenu": "For 19 years, I have used GoDaddy, Host Gator and Inmotion Hosting and since I have moved to Liquid Web, it has been, bar none, THE best hosting solution I've had all around. I've been familiar with the backend with minimal learning curve and if I've ever had question, their support staff has been 100% professional in explaining anything I didn't understand. I'm a \"do-it-yourself\" kinda guy so this is critical not just for my business, but my character. In 2 years and tons of calls only a single time have I ever spoke to someone who was a little short with me. But everybody is entitled to bad days...perhaps I just called on his..lol.But even with this call, I've never been on hold longer than 4 min!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott C.",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T00:57:57.000Z",
          "Titre": "New Dedicated Server Going Very Well",
          "Contenu": "Starting out as a New Dedicated Server client we have been really impressed with the Quick response to Support tickets and the ability to reach someone via the Phone when we Did Not understand something in learning the Liquid Web environment. Everything is going well and we expect that it Will continue to go well too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron M.",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T07:25:32.000Z",
          "Titre": "Real, quick, human, interaction",
          "Contenu": "Liquid Web is always quick to respond via chat. And, if they can't give you the information you need immediately, the issue is converted to a support ticket. And, unlike other SaaS I've used, they actually get back to you in a timely manner, and even follow up after the issue has been corrected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2023-05-25T20:11:35.000Z",
          "Titre": "Liquid Web is my preferred hosting…",
          "Contenu": "Liquid Web is my preferred hosting company for my client's websites.  I've been a website designer for over 20 years, and Liquid Web has the best customer support of all the hosts I've worked with.  Their support is prompt and professional, and their servers are fast and reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dhanu Konara",
          "Nb_Reviews": 2,
          "Date": "2023-02-24T02:33:57.000Z",
          "Titre": "Linux Server Support Experience Review",
          "Contenu": "The Linux Technician that I spoke with, Alex Silkin, was a great help in resolving my issue. He was very knowledgeable, friendly and willing to help in any way that he could. He was also very patient with me when I asked him a lot of questions on the issue, and I appreciated that very much. Whenever we were stuck on a specific part, he was willing to research into the topic and give me feedback. Liquid Web Linux Support is very lucky to have him on the team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T00:46:29.000Z",
          "Titre": "The Alex Silkin has gone above and…",
          "Contenu": "The Alex Silkin has gone above and beyond to help me with my migration to a new server.  I was so frustrated I was going to REVERT back to my old server.  Alex stepped in (although not part of the migration team) and FIXED my issue.  He listened to my frustration as the migration team felt my issue was not a server issue.  In the end because of Alex, he made a server tweak and saved the day.  I'm grateful that he picked up my support call as it was a very stressful 3-day trying to get everything working properly as I moved TWO servers to new servers.THANK YOU ALEX!! You deserve a raise! I know when you answer the call I have the \"A\" team on it.  Fantastic support because of Alex!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T07:27:00.000Z",
          "Titre": "I was able to get help late at night…",
          "Contenu": "I was able to get help late at night and around the clock.  Dean, the agent, was knowledgeable and made it easy to get my issues resolved and my environment setup."
        },
        {
          "Note": 5,
          "Lieu": "NP",
          "Pseudo": "Pokhara Mountain Bike Adventur",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T10:00:48.000Z",
          "Titre": "great support team",
          "Contenu": "great support team. we at Pokhara Mountain Bike Adventure/nepalmountaibike.com appreciate professional support from Liquid Web Inc. Many thanks for the professional service. Jagan Biswakarma."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill H.",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T17:38:15.000Z",
          "Titre": "ConsistentlConsistently friendly and professional supporty friendly and professional…",
          "Contenu": "Consistently friendly and professional support has kept me a loyal customer for more than 10 years. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:32:41.000Z",
          "Titre": "always solid IT support",
          "Contenu": "always solid IT support. been with you for years and have yet to be let down."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Fred Greaves",
          "Nb_Reviews": 11,
          "Date": "2023-09-14T10:50:58.000Z",
          "Titre": "Great service and fast response time",
          "Contenu": "Great service and fast response time. Such a fantastic starting point for my new Windows server, great help from the team for setup and content.."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Sean",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T01:18:55.000Z",
          "Titre": "Amazingly quick response to my support…",
          "Contenu": "Amazingly quick response to my support ticket (less than a minute) with constant updates. Also - a follow-up a few days later. Super service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sage K",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T05:47:06.000Z",
          "Titre": "Responsive Rep",
          "Contenu": "Rep worked on our issue same night right away and got it to the best possible state could have on liquidweb's side making communication easy through the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Minrod",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T16:24:06.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "The people on the chat messages knew exactly what I needed and they didnt just explain it they went and did it for me. There were more issues on my end and they even helped explain what I might need to look into. Amazing customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Mizel",
          "Nb_Reviews": 8,
          "Date": "2023-05-01T17:43:15.000Z",
          "Titre": "Amazing support",
          "Contenu": "Been with them for 10 years and love their service. They answer the phone, respond to tickets promptly, and fix any problems quickly, we appreciate having LiquidWeb as our host."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommy",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T17:56:31.000Z",
          "Titre": "Quintin is amazing",
          "Contenu": "Quintin is amazing!  He always goes above and beyond.  He should be a very valued employee!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CannabisSeniors.org",
          "Nb_Reviews": 4,
          "Date": "2023-02-23T19:35:51.000Z",
          "Titre": "I started with Liquid Web when they…",
          "Contenu": "I started with Liquid Web when they acquired Cloudsites from MOSSO/Rackspace. What I was most impressed with was the level of service I always received. Professional. Knowledgeable. Efficient. Friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Sims",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T21:40:11.000Z",
          "Titre": "So glad I picked LiquidWeb!",
          "Contenu": "I did a lot of research before selecting a hosting service with an emphasis on quality of support.  The prior feedback Liquid Web has received from customers is the reason I selected LiquidWeb and after my first support ticket (new customer less than a week) I certainly understand why.  All staff have been knowledgeable, professional, patient, responsive, and kind.  Very happy with my decision!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn H",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T00:59:29.000Z",
          "Titre": "Tech Support is Simply The Best",
          "Contenu": "I think we've been at LiquidWeb since about 2018 and the tech support is PHENOMENAL! Every time, except once, a long time ago and really, who cares about once? I cannot say enough good things about the tech support, really, just great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie K",
          "Nb_Reviews": 3,
          "Date": "2023-06-06T19:33:22.000Z",
          "Titre": "Liquid Web services are outstanding",
          "Contenu": "Liquid Web services are outstanding. I rarely need to contact their tech support but when I do, they are always very prompt, professional, and ready with the correct answer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T12:28:38.000Z",
          "Titre": "Great cost-effective hosting services",
          "Contenu": "Great cost-effective hosting services.  For years, I've found Liquid Web to provide great, cost-effective hosting services.  They are responsive and their technicians are very knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Sackett",
          "Nb_Reviews": 4,
          "Date": "2023-07-20T20:26:48.000Z",
          "Titre": "Quick and responsive support",
          "Contenu": "Liquid Web has been outstanding with their support and help anytime we need to implement something that is beyond our abilities. Great team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Excess Noise LLC",
          "Nb_Reviews": 6,
          "Date": "2023-07-08T17:14:32.000Z",
          "Titre": "Excellent tech support",
          "Contenu": "Basically, out of about 50 tickets, I was unsatisfied once or twice. Their tech support is outstanding. This last time was excellent also."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Emil Kjæhr",
          "Nb_Reviews": 7,
          "Date": "2023-03-03T11:43:10.000Z",
          "Titre": "Great and fast support regarding migration!",
          "Contenu": "Had a ton of questions on moving from my existing hosting provider which struggled to keep up high load traffic. Marc from the support team was really helpful, and answered all my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marketing Co - Houston",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T21:30:26.000Z",
          "Titre": "Stan went WAY above and beyond to help…",
          "Contenu": "Stan went WAY above and beyond to help me move a couple of my websites over to Nexcess during your extended outage on Cloudsites."
        },
        {
          "Note": 5,
          "Lieu": "UY",
          "Pseudo": "Roberto Berrospe - Ruta Internet Company",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T00:41:14.000Z",
          "Titre": "Excellent support",
          "Contenu": "Excellent support! Very kind and do everything as possible to resolve your problem. Very recommended! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T20:27:49.000Z",
          "Titre": "Experienced Technical Staff",
          "Contenu": "Experienced technical staff that provides exceptional service. The Liquid Web team is the best in the business.  I have been with them for years now and there is a reason for that. Thank you Liquid Web Team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T20:16:25.000Z",
          "Titre": "Extremely knowledgeable and helpful",
          "Contenu": "Extremely knowledgeable and helpful. Best hosting support I've ever had bay far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie D.",
          "Nb_Reviews": 3,
          "Date": "2023-06-16T19:49:40.000Z",
          "Titre": "Patience, Kindness & Knowledgeable",
          "Contenu": "I am an independent small business owner. My website is critical to my business. I’ve been a Liquid Web customer for at least ten years. I am not “technical” from a server perspective.  Yet, I know that uptime and reliability are essential.  I applaud Liquid Web for its 24 x 7 service and support. They are quick to respond and patient with customers like me, who may not understand how tech support is helping me to resolve issues with my WordPress website.  My most recent experience with Kohl revealed that the information I was provided by my WordPress developer, was not what the developer claimed. Kohl was patient and kind as he shared his knowledge of what I now refer to as a “false positive critical error”.  Kohl spent as much time with me as I needed to get my questions answered and gain a sufficient understanding of the recommendations. I am grateful for the service Liquid Web provides and grateful to Kohl for taking the time to explain in non-technical terms what, how, and why.   Thank you, Kohl, and the entire Liquid Web Team! More than hosting, Liquid Web truly has the “Most Helpful Humans in Hosting”.If you want dependable hosting and helpful humans, Liquid Web is your solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kentropolis",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T21:23:54.000Z",
          "Titre": "Prompt and direct attention with…",
          "Contenu": "Prompt and direct attention with willing ness to do what needed to be done even if I could have completed the action myself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T16:06:13.000Z",
          "Titre": "10 Years a Customer",
          "Contenu": "10 Years a Customer. Over the past 10 years I have had the pleasure of interacting with your service team and it  has ALWAYS been a professional and supportive experience. Today's interaction was no exception. The tech support rep was patient, explained in plain language the situation and provided actual support. Thank you for being better than expectations every time."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "PAA",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T07:40:26.000Z",
          "Titre": "Quick, skilled and helpful support",
          "Contenu": "Quick, skilled and helpful support on this caseMany thanks, P"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Hensley",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T03:42:37.000Z",
          "Titre": "Outstanding Support from Ted PiersonI had the privilege of receiving…",
          "Contenu": "I had the privilege of receiving exceptional assistance from Ted Pierson in restoring my website. Ted's patience and calm demeanor stood out, especially when it took several attempts to resolve the issue. Even when I was upset, Ted remained composed and provided invaluable help.What truly sets Ted apart is his dedication to saving me time and effort. His expertise and persistence prevented me from having to redo the entire site, which would have been a time-consuming endeavor. Moreover, he went above and beyond by addressing my additional questions, offering informative answers.Ted Pierson's support was outstanding, and I am immensely grateful for his assistance. His professionalism and commitment to resolving the issue efficiently and effectively are a testament to his exceptional customer service. Thank you, Ted, for your outstanding help and unwavering dedication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenifer W",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T05:27:30.000Z",
          "Titre": "Loyal Liquid Web Customer",
          "Contenu": "I love liquid web and have been a customer since 2018. Amazing customer service with people who genuinely care."
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T00:04:29.000Z",
          "Titre": "I have used Liquid Web services for…",
          "Contenu": "I have used Liquid Web services for more than 5 years and during that time, the attention they have given me and the solutions they have offered me have been very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAN",
          "Nb_Reviews": 6,
          "Date": "2023-06-24T22:19:03.000Z",
          "Titre": "Support above expectation",
          "Contenu": "The support given was above and beyond expectation.Very knowledgeable and personable technician.The issue was resolved and explanation given to steps taken.I have been with liquid web for many many years and was never disappointed in the level of support and service received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T22:48:27.000Z",
          "Titre": "A great partner for my busines",
          "Contenu": "Liquid Web support is always quick to respond with knowledgable support engineers. They are truly a great partner for my business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "datingadmin",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T05:18:29.000Z",
          "Titre": "Top notch customer support",
          "Contenu": "Top notch customer support. They have helped me many times with my server. They are there to assist 24 hours a day. Customer support is very important to me."
        }
      ]
    }
  ]
}