{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "livelyme.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Antonio D",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T09:25:23.000Z",
          "Titre": "Was good NOW thumbs DOWN....",
          "Contenu": "Used to be good when there was no min balance needed to transfer funds or no charge for transferring funds to the HSA investment part. But now if you want to transfer funds for investing you either need to have $3000 sitting in your HSA Lively account making them investment returns while you get nothing or pay $24 per year! Sorry will be finding a new HSA."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "j Kraft",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T00:27:33.000Z",
          "Titre": "Forget Lively.......go to Fidelity",
          "Contenu": "Applied for transfer of HSA from another company on 9/22/2023. Was informed it would take until 11/5/2023 to complete transaction. Called Lively on 11/13/2023, to learn that their security group decided not to make the transfer and closed my account. I asked why they made this decision, thinking perhaps the next step would be to submit a HSA statement or provide my passport.  They would not give me any reason for their decision and said the next step for me is to find another HSA provider. I asked to speak with a security representative or a manager. They said I cannot speak with security and the manager would call me within a day, but that never happened. They didn't even bother to notify me of their decision. I should have known something was up when I couldn’t log into my account a couple days after the application was submitted. This was the worst customer service experience ever encountered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Brace",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T17:09:18.000Z",
          "Titre": "It's terrible",
          "Contenu": "They say it's easier but they are making it very difficult for me to deposit a refund I live over an hour from Blackhawk bank and they want me to link a bank account to it I'm not sure I want to do that my bank instructed me not to so what now"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roland",
          "Nb_Reviews": 4,
          "Date": "2023-09-17T20:21:00.000Z",
          "Titre": "Changing terms __after__ you have the…",
          "Contenu": "Changing terms __after__ you have the money and forcing users to accept just to login is absolutely unethical and probably violates at least one extortion statute. Adding in that you cannot be held liable for losses due to bug riddled software shortly after the Titan sub crushed due primarily to its Agile development process means you are using Agile and the software will always be bug riddled. You should be held accountable."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "J P",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T00:42:09.000Z",
          "Titre": "Too much cash holding is required",
          "Contenu": "Lively requires $3000.00 cash holding and that needs to be $0 holding like Fidelity. I am planning to move all of my HSA to Fidelity."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A. Clarke",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T18:47:14.000Z",
          "Titre": "Lack of timely and honest communication cost me money",
          "Contenu": "I would not recommend Lively HSA.  I opened an account 7 weeks ago, or so I thought, incurred medical expenses, and it turns out the account was never opened.  I have a username and password, they’ve sent me a newsletter, but my account was still not open as they were “verifying my identity”.  I just found this out, AFTER I incurred several thousand dollars’ worth of medical expenses for a planned procedure.  I could have rectified whatever the problem was or gone with another company BEFORE the medical expenses, but Lively never contacted me to let me know there was a problem with verifying my identity.  When I finally reached a “manager” this week, she repeated the same phrase over and over: “As a company, we are not able to proceed with opening an account.”  She said this was due to a review by the security team, but could not give further details. She only said, “We were not able to pass the information through to open an account.”  What does that even mean? I have an excellent credit score (not that I was applying for credit so why would that even matter?) and I have the right kind of health insurance for an HSA.  So I can only assume they looked at my name/ gender and decided they didn’t like it?  I mean, what else is their decision based on?  The whole thing was very weird, because when I asked for a reason, the “manager” just kept repeating the above statements – I don’t even know what the big deal is- ok, you don’t want my money.  Fine, but 1) please inform me immediately, instead of waiting until I call almost two months later and discover there is a problem and 2) why repeat these weird answers like a robot; what are you hiding?All very strange.  In the end I’m happy that I am not with Lively. I went to Fidelity and opened a new HSA and it took me about 5 minutes.  And Fidelity has many more investment options, so I guess Lively’s weirdness was a blessing in disguise!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SLW",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T18:35:12.000Z",
          "Titre": "After signing up with Lively...",
          "Contenu": "After talking with Lively and before signing up with them, we were under the impression that adding employees and transferring contributions to them would be automated. It is not. When I reach out to them I get very short answers that don't offer a solution. Additionally, our employees have found that investing funds in Charles Schwab is not as easy as we had hoped."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Armando",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T19:38:03.000Z",
          "Titre": "Terrible new fee structure, awful customer support",
          "Contenu": "Switched to Charles Schwab and now I have to have $3000 in my account to not get charged for maintaining my investments. I can’t close the account because of some frozen assets due to the government sanctions on Russia. Terrible and annoying fees, no useful help.Reply to Lively from 07/24/2023: I already tried that, geniuses. You notified us of the fee structure change but your competitors offer better options. I cannot liquidate the assets due to government sanctions which means I cannot transfer out, neither Lively nor Charles Schwab wants to waive their fees and has been entirely useless for guidance despite it being out of my control, so I have to leave $3000 uninvested to avoid the fee. I will be leaving these groups as soon as I’m able to liquidate the measly amount in assets that I’m not allowed to liquidate since you’ve been no help whatsoever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Go away",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T02:38:06.000Z",
          "Titre": "Do not email me",
          "Contenu": "Do not email me. F**kk off with these stupid f**king emails leave me alone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Bond",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T12:00:38.000Z",
          "Titre": "Fees are coming",
          "Contenu": "Everything was perfect until you’ve started to change a cash balance fee. I will be leaving to another few-free provider like a Fidelity’s HSA. Really a shame, as Lively has been great."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel-san",
          "Nb_Reviews": 7,
          "Date": "2023-08-05T04:17:56.000Z",
          "Titre": "Pro (1) and Cons (2)",
          "Contenu": "Pro - customer service is usually pretty quick to respond, personable, and attentive to details.Cons - they take FOREVER to actually put your money to work.  They typically take 7-10 days to put your money to work in your investment account after you transfer it to them.  I think this is how they make their money - they hold YOUR money and make interest on the float period of a week+ while they sit on your money, and claim that it takes that long to transfer it to your investment account, which is obviously nonsense.  If I issue a transfer request from my bank to my broker, it takes place same day.  But if I issue a transfer request to Lively, to invest in my broker HSA, it takes 7-10 days.  Completely unacceptable.  On top of this, if you're with TDA and being forced to convert to Schwab, they are now going to start charging an annual $24 fee or monthly $3K minimum balance of dead cash for those of us who wish to invest our money, rather than letting you invest ALL of your money, yet they still advertise they charge $0.  That's not truthful advertising since you'll either pay them $2/month, or lose the interest on at least $3K of dead money you have to park at Lively and not invest. So as of now, the only *actual* $0 HSA appears to be Fidelity....which is where I'm considering moving my HSA after the forced conversion from TDA to Schwab."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kari Chalstrom",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T00:40:18.000Z",
          "Titre": "When calling the 888 number to talk to…",
          "Contenu": "When calling the 888 number to talk to someone in Support, the number does not work. Therefore my trust in this company is quickly fading away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lively is Poo Poo",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T00:58:31.000Z",
          "Titre": "Lively participates in discrimination",
          "Contenu": "Lively was arguably the most unprofessional and vague company I may have ever had the misfortune of communicating with. Not only was I declined the ability to open an HSA account with them, but I was given the vague walk-around by at least 4 separate service techs and one supervisor all stating, \"we cannot provide a reason for the decline, our security team just said no\", not even a halfway decent attempt to provide me with why I was declined coverage. On top of that none of my emails to their customer service department were ever answered. Self-claiming to be one of the best places to open and HSA account, while also being one of the worst places to try and have an adult conversation is mind-boggling to me. I have half a mind to claim discrimination and file a lawsuit based on my interactions with this \"company\". Horribly disappointed by the lack of professionalism and disgusted by the treatment of a potential account holder. If you are looking to open an HSA with Lively look elsewhere. Fidelity has great options for HSAs, HSA Bank is also another quality option, and check with your local banks as all of them will provide you with better customer service than Lively ever could, I guarantee that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CW",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T05:23:00.000Z",
          "Titre": "Too many glitches",
          "Contenu": "Too many glitches. Hard to deposit and even harder to withdrawal money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "--Anne",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T17:48:59.000Z",
          "Titre": "Customer service is terrible",
          "Contenu": "Customer service is terrible. I'm switching to a different HSA."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Riley",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T14:00:12.000Z",
          "Titre": "cant access my account via website"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robin Moreland",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T03:53:19.000Z",
          "Titre": "Don't do business with Charles Schwab"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KKB",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T17:39:50.000Z",
          "Titre": "I liked using them until TD Ameritrade…",
          "Contenu": "I liked using them until TD Ameritrade switched over to Schwab, at which time I was unable to transfer all of my Lively savings to Schwab, without having to pay a fee. I don't think I should have to pay to access MY money, to invest as I wish."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RJ",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T04:34:17.000Z",
          "Titre": "One thing gives me pause",
          "Contenu": "Your one single sprial galaxy \"CAPTCHA\" makes me question what other shortcuts have been taken with the security of the site. It's not a true CAPTCHA if it's the same picture every time. I'll keep what funds you already manage with you, but I don't think I'll be increasing my deposits."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ANON",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T03:19:01.000Z",
          "Titre": "Thumbs Down",
          "Contenu": "The interest rate sucks.  It was ridiculously difficult to set up a new account that was involuntarily transferred from a previous bank. The website is not user friendly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ed Adams",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T18:50:12.000Z",
          "Titre": "POOR interest rate",
          "Contenu": "Given the recent interest increases by banks it is frankly unbelievable that Lively pays the lowest interest of any institution. The highest rate is 1/10 of 1 percent for $10,000 and over. I'm getting 3.75% in my savings account with no minimum!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MadameLaZonga",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T21:45:59.000Z",
          "Titre": "I have never been able to get the…",
          "Contenu": "I have never been able to get the Schwab investment thing to work with my regular Schwab account. The investment side of the needs better UX."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carlyn Groshans",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T17:11:17.000Z",
          "Titre": "HSA card doesn’t work at the same places as previous HSA",
          "Contenu": "I’m not able to use my HSA card in the same types of places I was able to use my previous HSA card.  So it requires me to submit claims manually, which is a hassle."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sandra U",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T02:11:15.000Z",
          "Titre": "I was issued a debit card that didn’t…",
          "Contenu": "I was issued a debit card that didn’t work.  I guess lively Likes it when customers can’t pay their medical bills."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bryan Eck",
          "Nb_Reviews": 3,
          "Date": "2023-05-30T05:33:26.000Z",
          "Titre": "Communicate more",
          "Contenu": "Communicate more, put out reading/articles to learn about HSA's in general, future planning, taxes etc."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alan R",
          "Nb_Reviews": 5,
          "Date": "2023-05-12T11:43:35.000Z",
          "Titre": "Bad interest rates on the $s deposited",
          "Contenu": "Bad interest rates on the $s that sit there. Less than .1%.Oh Boy the Tiers! Awesome (sic)Over 10k = .1% Woo Hoo! (more sic) Meanwhile the Fed has raised short-term rates to 5%!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Megan Nicholas",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T00:32:31.000Z",
          "Titre": "My card expired and a new one was not sent",
          "Contenu": "My card expired and I needed to pay a bill. Why wouldn’t you automatically send a new one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth Storm",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T00:50:39.000Z",
          "Titre": "Long wait time on phone",
          "Contenu": "Long wait time on phone. Repeated request to fix same problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T14:12:26.000Z",
          "Titre": "Everything was okay",
          "Contenu": "Everything was okay. The investment side does not have money market choice. The interest rate is about 0.5%which is unbelievably low!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alexander Zagoro",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T17:49:56.000Z",
          "Titre": "new paid option is ridiculous",
          "Contenu": "new paid option is ridiculous. i want to invest my hsa money and i can't unless i keep 3k balance. but i can't keep 3k because the annual limit is $3850 and i already maxed out for 2023. Otherwise it's easy to use"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JP",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T05:15:41.000Z",
          "Titre": "OK HSA",
          "Contenu": "Lively is an ok HSA provider but they can use some improvement.  Their investment options are not as robust with features as other providers.  Transactions in the Devenir portal will usually show as duplicates making it hard sometimes to determine cost basis.  There is also when I tried to move funds  it took a matter of 3 weeks before I had to call and they noticed a bug in their system."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KL",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T00:22:11.000Z",
          "Titre": "Pretty easy to use, wish you could do partial payments",
          "Contenu": "It’s simple to use and track expenses. The one thing I’ve found frustrating and I don’t like is that you can’t do partial reimbursements of an expense. Haven’t quite figured out how to withdraw all your money (down to $0 balance) unless you make an additional deposit to create a balance that equals the exact amount of a reimbursement or you get lucky enough to have an expense that’s the exact amount you have in the account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T15:41:47.000Z",
          "Titre": "Adequate but Slower than Necessary",
          "Contenu": "For the most part, Lively is easy to work with. However, in a world where most banking is instant, or takes a day at the most for transactions to clear, Lively moves rather slowly, taking 3 to 4 business days for transactions to clear."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chad Reed",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T20:28:38.000Z",
          "Titre": "Lively is fine but the investing needs work.",
          "Contenu": "Lively is fine on its own but the investing side needs serious work. There is no graph to see what your money is doing in the investments day by day. The only things the investments shows you is what % you’ve gained or lost since the account was opened. They claim there is a guided investment feature but that still leaves things very much in the dark when you don’t really know what accounts to choose. Would much rather this be a robo-investor that moves my money to the right options based on my risk level. Like Wealthfront does."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Ellis",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T01:35:14.000Z",
          "Titre": "Lacking in customer service",
          "Contenu": "1. Upfront information about what you do not have access to on the app vs the website. 2. Follow up to messages is not always in a timely manner. I have had to re-message or call to get answers. 3. Answers are not always accurate. I was told no attempt by my cobra was made for payment, when infact they did and I was charged a $25 nsf because it took 5 days to process my bank transfer deposit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MM",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T18:40:04.000Z",
          "Titre": "(Used to be) easy for first-dollar investing",
          "Contenu": "Appreciated that they were clear about their first-dollar, no-fee investing options when I first joined but not sure if their upcoming investment platform transition will continue to allow that same easy access to first-dollar investing. May look into other HSA providers again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Zehnder",
          "Nb_Reviews": 3,
          "Date": "2023-07-04T03:34:27.000Z",
          "Titre": "Easy to use platform. New fees not great.",
          "Contenu": "Easy to use platform. Connecting to TDA was nice. Slow transfer of funds and now charging a fee leads me to look at other options."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MT",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T01:03:54.000Z",
          "Titre": "Annual fee to invest my contribution",
          "Contenu": "I like the overall of Lively service but the idea of having to pay $24 annual fee for me to invest all of my contribution is not good considering other companies don't charge this fee."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Unsatisfied",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T06:41:22.000Z",
          "Titre": "Good company for HCSA type account."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "dcinnv",
          "Nb_Reviews": 10,
          "Date": "2023-10-30T02:20:55.000Z",
          "Titre": "Hit or miss on days of deductions",
          "Contenu": "Do not take $$ out as requested. Supposed to be every other Friday. Comes out all over the place. Also bit hard to get out of investments when I needed it. I leave little in the investments as I have medical bills and no desire to lose it to investments."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kimberly Hayes",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T17:06:59.000Z",
          "Titre": "Simple and easy!",
          "Contenu": "Lively was simple to set up and is extremely user-friendly! The only drawback I have experienced is the inability for my employer to send a monthly check to make deposits into my account as she does with all other employees and their accounts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy Watson",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T19:18:44.000Z",
          "Titre": "Easy to use",
          "Contenu": "The website overall is user friendly. The only thing that bothers me is that there is no running balance on the transactions page. They show the current balance, and the transactions only show the amount spent or contributed and the date. Otherwise... you can upload receipts, check what expenses are eligible, check how much more you can contribute, etc. fairly easily."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "K. Grammatica",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T03:41:27.000Z",
          "Titre": "I love the Dashboard!",
          "Contenu": "I love the Dashboard which is the first page you see when you login onto the site. I dislike having to use the hamburger menu to revisit a listing after I was focused into one item from the list or when I need to get back to the Dashboard just to return to the full list I started out on. I think a \"breadcrumb trail\" could be helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oregon dad",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T04:59:28.000Z",
          "Titre": "Great platform to manage my HSA.",
          "Contenu": "Our Lively account is easy to manage and reliable. There was a small learning curve understanding how to reimburse payments made to providers when we couldn't use our card, but once we figured it out it is an easy process. Throw in that it is a free service and it is hard to beat."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Sheaffer",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T16:11:57.000Z",
          "Titre": "Lively makes the HSA experience easy.",
          "Contenu": "Lively makes the HSA experience easy. I like that they work with TD Ameritrade (soon to be Schwab) which allows me to handle my own investments. The only negative I have is that it takes about a week for money deposited into Lively to get transferred to TD Ameritrade."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca H.",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T14:09:24.000Z",
          "Titre": "Lively helps me save for medical expenses",
          "Contenu": "Lively helps me save in my HSA for current and future medical expenses.  The website is easy to use and I like that I can transfer funds to an investment account and self-direct my investments.  Uploading receipts (or using the Lively HSA card) is very easy and reimbursements to my bank account are quick.However, I used to be able to keep $1,000.00 in cash and invest anything higher, but now with the switch to Schwab (I'm not sure if the transfer is the reason or if the timing is coincidental) I have to keep $3,000.00 in cash.  With the increase in interest rates, I'm losing out on some interest income since Lively's interest rate is much lower than the current rate on CD's or Treasuries which I can invest in at Schwab."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marianne Zacharias",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T20:48:12.000Z",
          "Titre": "Very easy to set-up",
          "Contenu": "Very easy to set-up.  Before retirement employer had with another company, we’re never able to get statements, one time lost account. Never had any problems with lively."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindy Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T19:15:52.000Z",
          "Titre": "Mostly Good - customer service lacking",
          "Contenu": "Lively has an easy to use, no fee HSA account.  Only downsides are:  Best if you pay medical providers with the card they give you, not with checks.  And, not easy to get an answer from customer service.  It took two weeks for them to get an actual answer to my inquiry as to why they bounced a check when there was money in the account.  Their answer was the financial institution they use, Choice, could not locate account information.  The answer is crazy since I've written many checks.  And, the fact it took 2 weeks for them to get the answer is not good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Claire",
          "Nb_Reviews": 3,
          "Date": "2023-03-22T13:03:57.000Z",
          "Titre": "Lively is very user friendly and easy…",
          "Contenu": "Lively is very user friendly and easy to navigate. You can link your bank account and add and remove funds easily. They have options for investing to grow your money both self guided and professional. My only complaint is you only get statements from the professional investors quarterly not monthly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trish P Smith",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T14:47:05.000Z",
          "Titre": "As a small business owner",
          "Contenu": "As a small business owner, I needed some reassurance of reserved health care coverage.  I explored the internet and read about different HSA programs, and Lively had very good reviews.  As a member now for several years, Lively has lived up to my expectations.  I am able to save and invest with tax relief benefits for my future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T03:55:03.000Z",
          "Titre": "Very pleased with my Lively experience",
          "Contenu": "I have found Lively easy to navigate and use in almost every respect. The process for getting funds from the trading platform (formerly Ameritrade; now Schwab) can be a little cumbersome and take a couple of days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Haley M",
          "Nb_Reviews": 3,
          "Date": "2023-04-05T00:29:03.000Z",
          "Titre": "User Friendly website",
          "Contenu": "I really enjoyed Lively’s website - found it easy to use and navigate. The only reason I gave 4 stars instead of 5 is because I wasn’t really using the full spectrum of what was available to me - I had an HSA account and just let it accrue based on my contributions and my employers. I feel like I could have easily done more with Lively if I had been more motivated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Milligan",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T16:55:42.000Z",
          "Titre": "It took longer than I expected to be…",
          "Contenu": "It took longer than I expected to be verified and it takes several days for your deposit to show up. Customer service is great and once everything was approved it has been great !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luc Cisna",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T20:36:27.000Z",
          "Titre": "Overall pretty good",
          "Contenu": "Customer service is helpful and I actually get to speak to a human. The app is very user friendly and I like having investment options for my HSA funds. The app sometimes doesn't work which is the most frustrating part of using Lively, but not frustrating or frequent enough to leave Lively. At the end of the day, I am happy with their product and service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith E",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T01:39:25.000Z",
          "Titre": "Lively HSA",
          "Contenu": "First of all, it's a no cost HSA.  It was easy to transfer my balance to Lively. There's also an investment option with Schwab. I have had no issues using the card.  Just an easy process all around.  Only reason for 4 stars is I wish my deposits would hit my account faster, typically takes 4 days"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T13:01:18.000Z",
          "Titre": "Lively is easy to use",
          "Contenu": "Lively is easy to use, free, and has great features. Transfer processing times are slow, so your contributions and transfers take a week when it should be instantaneous."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "E Broker",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T21:34:38.000Z",
          "Titre": "I love that I have the ability to…have a choice of investments",
          "Contenu": "I love that I have the ability to invest my HSA in what I want and not limited to just receiving interest. The app is a little confusing but it is worth it to be able to invent in what I want to increase the value of my HSA account."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric H",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T05:47:48.000Z",
          "Titre": "Flexibility to invest funds beyond a…",
          "Contenu": "Flexibility to invest funds beyond a pre-set list determined by a third party.  Web-site is well designed and easy to use.One area for improvement is how long it takes for a trustee-to-trustee transfer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oscar",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T06:19:30.000Z",
          "Titre": "Time will tell",
          "Contenu": "So far my experience with Lively has gone well, I have not had the need to reach out to their support for any issues as of yet and neither had a reason to complain. Though I have not been with Lively for very long either to form a strong opinion of them yet, time will tell."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabrielle",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T21:13:54.000Z",
          "Titre": "Overall great experience with lively",
          "Contenu": "Overall great experience with lively. The team is super responsive. Great product (HSA with no fees). I have had problems with transferring HSAs into them. I have done this 3 times, one spouse account, and 2 of my own accounts. I have had one just fail, I tried to fix it several times, and tried to get lively to help, but it has just been so difficult and has not been successful even though I have sunk hours into it. I think lively can and should step in and do more there. I don't know how often this happens. But still overall a great experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NMP",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T05:09:48.000Z",
          "Titre": "Nice platform for HSA",
          "Contenu": "Nice platform, freedom for the investment. Nice platform. However, moving money to Lively is taking more time than it should be. It also takes time to send for the investment. If they make transaction part more smooth, it will be best HSA."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank Scavo",
          "Nb_Reviews": 3,
          "Date": "2023-07-29T03:43:11.000Z",
          "Titre": "A good platform for health care…",
          "Contenu": "A good platform for health care payments.  Fairly easy to navigate.  Better than some of  the others I have tried.  I really use auto pay for most transactions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kate P-",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T19:09:24.000Z",
          "Titre": "The online inteface to submit medical…",
          "Contenu": "The online inteface to submit medical bills is easy and quick - the two-three days that someone besides me enjoyed the 'float' till the funds showed up in my bank I suppose is the price we all pay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Barker",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T13:44:20.000Z",
          "Titre": "Good investment",
          "Contenu": "I like the range of investment opportunities. The HSA offers tax fee path to pay medical bills while investing what isn't used."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eileen",
          "Nb_Reviews": 3,
          "Date": "2023-03-23T20:05:45.000Z",
          "Titre": "Very easy to make payments and check…",
          "Contenu": "Very easy to make payments and check your account.  I will say we haven't taken any disbursements yet but we have been using the account for 3 years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brett Calder",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T04:36:25.000Z",
          "Titre": "You delivered as promised",
          "Contenu": "You delivered as promised. I would give 5 stars but the brokerage does most of the work I am interested in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raoul Farcot",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T15:33:15.000Z",
          "Titre": "Plan was easy to set up",
          "Contenu": "Plan was easy to set up. Good communications from Lively's support staff."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Painter",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T01:25:57.000Z",
          "Titre": "I like being able to invest my money",
          "Contenu": "I like being able to invest my money. Having to leave $3,000 in is a bit much. $1,500 would be better."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vaedrae",
          "Nb_Reviews": 3,
          "Date": "2023-02-27T17:37:05.000Z",
          "Titre": "Easy to navigate",
          "Contenu": "Easy to navigate.   Have never really had a problem.  Keep up the good work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Al H.",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T04:44:38.000Z",
          "Titre": "Things have been quite straightforward…",
          "Contenu": "Things have been quite straightforward with Lively."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Soumyakant Tripathy",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T08:12:01.000Z",
          "Titre": "It's a good platform to invest HSA…",
          "Contenu": "It's a good platform to invest HSA money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Fox",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T17:09:20.000Z",
          "Titre": "All forms for the IRS should be sent by…",
          "Contenu": "All forms for the IRS should be sent by mail if asked"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SP",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T04:49:24.000Z",
          "Titre": "Make the change...",
          "Contenu": "Good so far!  Very easy to use, and best of all -- NO monthly fees!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawrence K. Shelton",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T03:48:24.000Z",
          "Titre": "Simplified Quality",
          "Contenu": "Simplicity, quality platform, etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cobie Jane",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:03:24.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "They have excellent customer service and make it quick and easy to get reimbursed for approved expenses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin K",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T05:09:28.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use! No fees for transferring money to a different HSA account and multiple investment options with and without fees."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly Martin",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T04:06:49.000Z",
          "Titre": "Robust",
          "Contenu": "Robust, easy to use tech platformBroad investment options thru schwabFlexible service optionsReasonable fee schedule/economics"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauria Grant III",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T02:15:56.000Z",
          "Titre": "Easy & Scalable",
          "Contenu": "After quite a bit of research, I decided to roll my HSA to Lively for a few reasons that did not disappoint. 1. Opportunity to have integration with Charles Schwab for future investing.2. Easy to navigate their interface. (Desktop & Mobile)3. Customer Service was super helpful with my initial questions to move funds to them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Snowe",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T19:01:07.000Z",
          "Titre": "Excellent Experience",
          "Contenu": "Excellent customer service team that kept me informed every step of the way as I transferred my HSA from an employee-sponsored plan to Lively. My experience in using Lively since the transfer has been nothing but positive. I'd strongly recommend Lively to anyone looking for an HSA."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Peterson",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T01:44:50.000Z",
          "Titre": "I was impressed with the support that I…",
          "Contenu": "I was impressed with the support that I received during the transition from my previous HSA provider. I am looking forward to our relationship!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonya W",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T06:30:40.000Z",
          "Titre": "Very happy with my HSA",
          "Contenu": "I’m thrilled with my HSA account with Lively. The app & website are easy to use. I’ve had excellent help with any customer service requests. They always answer fast & are super friendly. I’d easily recommend Lively."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn D.",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T00:20:06.000Z",
          "Titre": "Best Place for HSA accounts!",
          "Contenu": "The Lively staff is so responsive with knowledgeable information and guidance!  So much more helpful than my local in person bank. The website is user friendly, and straightforward.  Completely satisfied with Lively!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marianna",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T22:06:20.000Z",
          "Titre": "BEST Customer Service",
          "Contenu": "This is the most refreshing Customer Service experience ever! I have called three or four times over the past year and each and every time I get a knowledgeable, friendly, professional agent (who is also a regular English-speaking individual). They have answered my questions or solved my problem every single time. Thank you, Livelyme for hiring the best Team ever and for making it way easier for the end user to get real help directly from the source. I highly recommend them to anyone who has or needs an HSA. I hope they're around forever!  Thanks, guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T19:50:43.000Z",
          "Titre": "First time setup and transfers to fund account.",
          "Contenu": "This review relates to the setup and first time use (transfers) in Lively.  Everything worked as described on the website.  Customer service was friendly and very helpful.  Timeliness of transfers was adequate.  I am very pleased with the administration of my account and very happy with my decision to switch my HSA to Lively."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Moira Eberle",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T18:36:16.000Z",
          "Titre": "Lively makes your HSA easy…",
          "Contenu": "Lively makes the entire HSA process easy. Through connection with an investment account or use of a debit card to pay expenses, Lively let’s you use your HSA your way. I looked into several ways of using my funds in connection with my High Deductible Savings Plan, and Lively had everything I needed plus a simple, streamlined interface. Absolutely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gina J",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T02:18:12.000Z",
          "Titre": "This company has been easy to work with…",
          "Contenu": "This company has been easy to work with and I've had no issues.  They reflect the amount of my deductible so I don't have to go to multiple sources to check.Also, I like that my HSA is gaining a little value whereas the last bank that managed my HSA charged a monthly fee."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T03:31:15.000Z",
          "Titre": "Every one that is able to participate should.",
          "Contenu": "The biggest positive about Lively aside from automatic deposit from my bank was the tax savings at the end of the year. Easily able to submit my receipts with the Lively card or with my own for future reimbursement. I wish I had started sooner but I'm glad I finally did."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Mason",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T02:36:16.000Z",
          "Titre": "Call, real people, real help!",
          "Contenu": "When I transferred to Lively from my former employer's HSA, it is a long and difficult process.  Primarily from the HSA providers who are being asked to give up the funds to Lively.  I had to go through this several times and each time I called Lively, got a person in short time and was helped immediately and they took care of getting the funds transferred.  They also allow my TD Ameritrade (now becoming Charles Schwabb) to invest my funds and provide me advice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G Cox",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T05:50:25.000Z",
          "Titre": "I need to close my lively account",
          "Contenu": "I need to close my lively account.  It's been great, but all my money is invested in TDAmeritrade, and I'm not staying with Schwab when they take things over, but instead will be using a different firm to invest my HSA that is both an HSA account and investment firm.  Please tell me how to close it as easy as possible and ASAP.  Thanks again for your great experience and regret needing to move on!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PTA",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T14:02:59.000Z",
          "Titre": "I recently transferred my HSA into…",
          "Contenu": "I recently transferred my HSA into Lively. I spoke with 2 agents during the time, they were professional helpful and friendly. It was a smooth experience. Since then I have not needed to be in contact with Lively. I had a very good experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Obryant",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T18:14:09.000Z",
          "Titre": "I can invest the whole balance anyway I want.",
          "Contenu": "The best thing is I can invest the whole HSA balance with TDAmeritrade (Schwab soon) using any stock or ETF I want. The HSA my employer set up had about 12 stogy mutual funds and I had to leave 1 or 2 thousand uninvested. The web site is easy to use. I recommend Lively to my family and friends. And it is a Y-combinator company, a big green flag for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zander Koallick",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T14:51:34.000Z",
          "Titre": "Lively is a top notch provider",
          "Contenu": "I was a Lively customer for 4 years. I initially opened an HSA to rollover an employer sponsored HSA that charged me account fees after I switched employers. When the new company I joined started offering an HSA contribution, they contributed those funds directly to my Lively HSA. Now, after switching employers again, I'm making the tough decision to consolidate my accounts. Through the account closure process, Lively has been outstanding to work with. I have nothing but good things to say about the team.Other items of note:* Product is simple, but incredibly functional* Debit card / expense reporting is helpful* Ability to invest HSA dollars without additional fees is a game changer* Support team is super helpful5/5 recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff E.",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T17:27:33.000Z",
          "Titre": "User friendly, and fantastic customer support",
          "Contenu": "Lively's mobile app and web interface are very straightforward and pleasant to use. There are so many actions available for self-service, but when I did end up calling customer support, I was speaking to a real person within minutes and they were very kind and helpful.I've been thrilled with my Lively HSA experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T15:23:13.000Z",
          "Titre": "I Had an HSA account with my employer",
          "Contenu": "I Had an HSA account with my employer. Well I finally decided to retire and was shocked when I recieved my statement from my HSA provider a few months later showing a monthly service charge.  I contacted them and they said the monthly charge was always there but used to be paid for by my employer and now it was my responsibility. well, I said Bye Bye and moved my funds to Lively!  It was easy to do and there are no monthly service charges and the ability to associate my funds with TD Ameritrade (soon to be Schwab)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T22:02:15.000Z",
          "Titre": "Extremely Pleased with Lively",
          "Contenu": "I have been extremely pleased with Lively since transferring my HSA account from Optum Bank to Lively in July of 2023. My account is small (below $3000) and had started incurring a monthly service charge of $2.75 per month to maintain the account at Optum Bank. In addition to Lively not charging any monthly fees, it accrues a small amount of interest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Calis",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T12:48:09.000Z",
          "Titre": "I have been very happy with Lively",
          "Contenu": "I have been very happy with Lively. The site is easy to use and navigate, but their customer service is unmatched. I've had to call several times and each time didn't sit on hold and the first person I talked to resolved my issue or question. In fact I've now had to sign up for two new HSA bank plans with employers since setting up my Lively account, and I refuse to move funds out of my Lively account. It's my primary one and I transfer funds there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amit Bhatnagar",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T02:57:50.000Z",
          "Titre": "No inactive account fees+trading with Charles Schwab",
          "Contenu": "No fees when the account is not getting fixed monthly deposits is great compared to all other competitors. It was easy to link the account to a trading account at Charles Schwab where I could purchase stocks and/or etfs so it turned out great. My experience with Lively has been great so far. I have transferred all other HSAs from my previous employments over to Lively seamlessly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chester B",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T16:13:55.000Z",
          "Titre": "Happy millenial",
          "Contenu": "Great experience. Easy interface. I auto draft from my bank into my lively account weekly. Everything has been flawlessly easy from setup, to investments, to maintenance. Disclaimer: I have been with lively for 2-3 years. I have never had to use funds for an expense so I can’t comment on how easy it is to use the debit card, but if it’s like the rest of the process then I’m assuming it’s super easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T18:11:59.000Z",
          "Titre": "Easy set-up for your HSA",
          "Contenu": "I explored a few other options for setting up an HSA account, but Lively proved by far to be the most efficient and intuitive.  The set-up process was simple and provided clear guidance, and the website was very easy to navigate.  If you are looking for a headache-free way to set up your HSA, go with Lively."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chiriqui",
          "Nb_Reviews": 7,
          "Date": "2023-07-04T14:26:20.000Z",
          "Titre": "Great HSA Bank",
          "Contenu": "Great website - Lively.com enables me to do all my HSA management online.  Also Lively pays a very competitive interst rate on my monthly balance.  Many HSA banks don't pay any interest at all.  Finally, in the event that you do need help, Lively has great US-based customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis Dixon",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T14:05:36.000Z",
          "Titre": "I transferred my HSA from Optum because…",
          "Contenu": "I transferred my HSA from Optum because they started charging monthly fees. Lively handled the transaction in a timely manner with no issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul C",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T07:31:23.000Z",
          "Titre": "Excellent site, customer service, and investing options",
          "Contenu": "The website is good-looking, clean, and super easy to navigate. I like having the option to either choose investments by myself or use their guided option, and also, that you can invest the entire amount in your account. Interactions with customer service have been excellent: they respond quickly, clearly, and in a friendly manner - no canned messages. Very different from previous HSA admins through my employer. So far, I am very happy with Lively, go with them if you have the option!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T03:32:02.000Z",
          "Titre": "System was easy to set up and move…",
          "Contenu": "System was easy to set up and move money over. No hidden fees. Good use of tech in an industry where competitors are using old systems that are difficult to use. They have disrupted the HSA customer experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Everton Sequeira",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T03:32:31.000Z",
          "Titre": "Easy to use website,",
          "Contenu": "Easy to use website,Everything is as advertised. The investment options at Charles Schwab are also extensive and low-cost alternatives. Will satisfy the whole range of investments needed from conservative to aggressive high quality options."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K. Lawyer",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T03:15:24.000Z",
          "Titre": "Very knowledgeable staff that will walk…",
          "Contenu": "Very knowledgeable staff that will walk you through setting up an HSA.  I went from a FSA to HSA and they gave me all the correct legal steps to set up my HSA with Lively.  I also like that when I call, I get someone that speaks English and I can understand them.  The Website is user friendly and easy to nagivate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Kwan",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T07:38:05.000Z",
          "Titre": "migration from employer plan 3 years ago",
          "Contenu": "I was able to move my HSA with an employer plan to Lively when I was no longer active in the employer plan.  They made moving to them super easy.  One of the main reasons I picked them was no fees and their offering of brokerage services via TD Ameritrade, where I have many other accounts.  Since Schwab bought out TD Ameritrade and will migrate accounts to them, unfortunately, maintaining a brokerage account would no longer be fee-free.  With this upcoming migration, I've decided to move my HSA account to Fidelity (again, brokerage account, no fees).  Lively helped me with this final migration.  They've been a great company, with helpful staff and clear communications."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sylvia Batane",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T12:57:02.000Z",
          "Titre": "Convenient and Easy",
          "Contenu": "Lively just makes it so easy for the customers. The integration with Investments is seamlessz. We hear customer obsession every where but Lively is the only one who truly demonstrates it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Stinnett",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T00:07:02.000Z",
          "Titre": "Happy I chose Lively",
          "Contenu": "I researched HSA providers and Lively had great reviews. I signed up and am glad I did. It was a very easy process. Got my debit cards super quick and set up direct deposit with my employer. Great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex R",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T04:12:47.000Z",
          "Titre": "Fantastic Representatives",
          "Contenu": "I’ve called Lively twice for assistance and been met with excellent representatives. They both understood my questions, spoke in plain English, and were able to help me on the first call. It’s one of the few companies I don’t fret calling!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer B",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T04:59:00.000Z",
          "Titre": "Finally, a user-friendly HSA",
          "Contenu": "Lively not only has a user-friendly dashboard, it is also incredibly easy to use. I have transferred money into my Lively account from other HSA vendors, I have used my Lively debit card to pay for expenses, and I have transferred money from my Lively account into an HSA investment account. All of it is very easy to do. I highly recommend Lively!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert M Matcham",
          "Nb_Reviews": 7,
          "Date": "2023-08-10T15:45:08.000Z",
          "Titre": "Great to be able to invest this money for faster growth",
          "Contenu": "My company only offers 1 HSA option to save.  It pays no interest and has no fees, but it also does not have any ability to grow.  I learned of HSA on Youtube and checked it out.  I setup and account and an auto transfer from my company's HSA vendor to Lively, and I am now investing my funds to have them grow for when I will need them as I get older.  Staying within the rules I am able to avoid all account  fees, and just have the deal with trading fees."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexander Smith",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T01:40:32.000Z",
          "Titre": "Simple UI",
          "Contenu": "Simple UI Quick and easy to set up, deposit, and withdraw funds. The investment options are integrated effectively. I'm a big fan and have used Lively for several years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Myhre",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T21:59:30.000Z",
          "Titre": "They make our HSA easy",
          "Contenu": "They make our HSA easy, and you don’t have to go through 50 layers of phone hell to speak to a real person. I recommend Lively to anyone wanting to open an HSA"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K Poyser",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T19:16:38.000Z",
          "Titre": "HSA done right",
          "Contenu": "Easy to set up, simple transfers from other HSA accounts, and very cost efficient for my needs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave R.",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T21:09:48.000Z",
          "Titre": "Great! No issues, easy to use.",
          "Contenu": "So far, very satisfied. Haven’t been enrolled for too long, but the convenience of the card and the app make it very easy for me to organize and manage my health-related expenses. No wrinkles or hiccups so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Hodges",
          "Nb_Reviews": 3,
          "Date": "2023-08-06T02:49:38.000Z",
          "Titre": "Great Phone and Great Service",
          "Contenu": "I bought the phone in Juine for my 96 year old mother. It is a great phone and she has no problem in using it. I have had contact with the company a couple of times. I quickly am connected with a very pleasant person that I can understand and they quickly took care of my need (increasing the data lan)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BeenThereBefore",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T05:22:58.000Z",
          "Titre": "Lively and their technology platform…",
          "Contenu": "Lively and their technology platform make it easy to manage an HSA. Topping that is earning money on the HSA. They are very supportive and helpful in the process to setup the account and they don’t stop there. We’ve been with their service nearly five years and have no plan to change."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marge Hayes",
          "Nb_Reviews": 3,
          "Date": "2023-08-09T03:36:02.000Z",
          "Titre": "Everything I Need",
          "Contenu": "Navigating the website is easy and understandable.  Customer service, when needed (which isn't often), has been courteous, efficient, and very helpful.  I've been very happy with my choice to go with Lively."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Taunton",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T05:06:04.000Z",
          "Titre": "All around great product",
          "Contenu": "Always perfectly informed, not to much info but just enough.Best company I have found for low to no cost HSA.Best feature may be that I can move my money to my brokerage account for little to no cost and invest it in stocks I like, and have full control."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anshul G",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T03:41:25.000Z",
          "Titre": "I love having my HSA account with…",
          "Contenu": "I love having my HSA account with Lively. Gives me so much flexibility with my funds, amazing customer service and market integration. Have been with lively for years and looking forward to more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce R",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T12:53:03.000Z",
          "Titre": "Great Company",
          "Contenu": "Very easy to set up an account.  Also very simple to connect bank to bank transfers so adding money is fast and easy.  Paying medical bills, you can use the debit card or have Lively send a check, both are good and allows you to upload copies of your bills.  Also, I get a deduction on my taxes !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Tolmachoff",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T17:21:54.000Z",
          "Titre": "The transfer process was very easy",
          "Contenu": "The transfer process was very easy.  In the issue was with the source provider slowing the process down. Lively made it easy.  Also like the Schwab self directed investment option."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-07-12T02:08:43.000Z",
          "Titre": "Awesome customer Service",
          "Contenu": "From the set up until the present, the Lively staff have been wonderful to work with. Anytime I had a question or concern, they responded with care and support. I highly recommend Lively to everybody I know (and those I don't know!) for their HSA's.Sincerely,Sharyn Ferrie"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emil Saladik",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T13:54:19.000Z",
          "Titre": "communications are clear and balanced…",
          "Contenu": "communications are clear and balanced not too much and not too little, platform is easy to use and works well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Sanderson",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T03:38:14.000Z",
          "Titre": "Very impressed",
          "Contenu": "Lively's website is functional and well-implemented; they made it easy to get my HSA set up online, quickly and efficiently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave S",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T07:18:36.000Z",
          "Titre": "Never had a HSA account",
          "Contenu": "Never had a HSA account, Lively made it simple and so fast, once the account was set up only one doc download that I needed to send to employer and that was it.  Been happy customer for about 3 years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Wittman",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T15:50:40.000Z",
          "Titre": "32 y/o millennial business owner",
          "Contenu": "As a 32 y/o millennial business owner, we've started investigating ways to put our profits to use with the best tax advantages, and that can be daunting to do on your own. However, with the intuitive user experience and customer service provided by Lively starting and funding an HSA was so easy. We recommend it to our employees instead of the default company used by our health insurer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A. Grundy",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T04:29:17.000Z",
          "Titre": "Easy to use HSA Account",
          "Contenu": "In the job I had before this one, my HSA was set up for me. When I moved to my new job and I found out I had to set up my own at HSA. I was a little daunted. I did a little research and I found Lively online and found out that they had no fees for the type of account I needed. I signed up for this account. It was really easy and it’s very easy to manage on my own. It’s  very straightforward and works for what I need like a charm. I’m happy to be using this HSA account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerod Nielson",
          "Nb_Reviews": 5,
          "Date": "2023-10-31T21:47:12.000Z",
          "Titre": "Lively is very easy to use",
          "Contenu": "Lively is very easy to use. The app works great without error. It's just like a second bank account and in a year of having it I have never been hassled or denied anything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail Givan",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T19:35:07.000Z",
          "Titre": "Transferred My Two HSAs to Lively ❤",
          "Contenu": "I transferred two HSA accounts to Lively, on the advice of my financial planner.  It is great to have them consolidated into one and now I have them invested.  Lively is very easy to use.  I recommend it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JBW",
          "Nb_Reviews": 6,
          "Date": "2023-07-10T03:56:32.000Z",
          "Titre": "Lively the best of my 3 past HSA custodians.",
          "Contenu": "I was with two different HSA Custodians before several years now with Lively. Lively has by far the best web site and response times of the three. Very satisfied with Lively."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T01:20:59.000Z",
          "Titre": "I love Lively",
          "Contenu": "I love Lively!  I'm so glad I found you!  You are in my time zone; that was a huge problem with my old HSA.  The Lively website is amazing, so I don't even need to contact the bank by phone like my old HSA.  The app is wonderful.  The phone service and email response when I've had to use it has been exemplary.  And no fees.  The informative emails are much appreciated.  You're great all around.  Everyone should go to Lively."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T04:01:51.000Z",
          "Titre": "Low investing fees",
          "Contenu": "I chose Lively because of its strong reputation and partnership with Charles Schwab which keeps the investing fees extremely low and gives you so many options."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nayeem Syed",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T15:02:18.000Z",
          "Titre": "Excellent Service!",
          "Contenu": "Customer service is friendly, available with right amount of wait time, and knowledgeable.Online portal is easy to use and get all the information in a glimpse."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh Snodgrass",
          "Nb_Reviews": 2,
          "Date": "2023-07-22T03:17:42.000Z",
          "Titre": "So easy to use!",
          "Contenu": "We've used Lively for several years now and it's been a great experience.  The dashboard is easy to use and it's been a good tool that's helped our financial plan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T16:13:42.000Z",
          "Titre": "Simple & Easy!",
          "Contenu": "So easy to set up, they don't bug you with mail and email ads, they show you exactly the information you want to see, and it's all easy to use and understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T12:15:44.000Z",
          "Titre": "Customer service has always been very…",
          "Contenu": "Customer service has always been very nice and helpful whenever I have had any question. The platform is user friendly and quick with transactions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua King",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T03:11:52.000Z",
          "Titre": "Lively is the most insanely intuitive...",
          "Contenu": "Lively is the most insanely intuitive savings app that I've used.  They make it easy to save, spend and invest using the HSA account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Pak",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T12:19:35.000Z",
          "Titre": "Excellent and well educated staffs…",
          "Contenu": "Excellent and well educated staffs toward to their customer service with my pleasant experiences each of them! We love you and thank you all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine Goins",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T04:14:56.000Z",
          "Titre": "Convenient and highly functional",
          "Contenu": "Been using Lively for 5 years. Super easy to use and invest! Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T21:05:11.000Z",
          "Titre": "I've been using Lively for many years…",
          "Contenu": "I've been using Lively for many years now and I love it.It's easy to use and has become second nature for my healthcare finances."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 12,
          "Date": "2023-07-22T03:32:44.000Z",
          "Titre": "Helpful Website and no Fees!",
          "Contenu": "Your website is easy to use, find my information, balances quickly. Also, no service charge on my account was a big draw to your company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig R",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T04:19:36.000Z",
          "Titre": "Simply to transfer, no fees and easy to use",
          "Contenu": "Simply to transfer from job sponsored HSA plan, great comms and instructions, no fee and very easy to use once transferred."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne Curry",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T04:41:10.000Z",
          "Titre": "Your customer service",
          "Contenu": "Your customer service. The fact that a real live person answers the phone and actually listens. Try's to answer all my questions. Gets back to me asap if don't have answer. easy to use the Visa for the HSA."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victoria",
          "Nb_Reviews": 5,
          "Date": "2023-10-24T04:15:16.000Z",
          "Titre": "I’ve been with Lively for many years…",
          "Contenu": "I’ve been with Lively for many years now. Great platform, amazing customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Kinzelman",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T14:30:45.000Z",
          "Titre": "When I first realized I could invest my…",
          "Contenu": "When I first realized I could invest my HSA - Lively seemed the best avenue for this.  I have been happy with the service since, and recommended Lively to many friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jiajun Zou",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T02:48:53.000Z",
          "Titre": "Ease of use never had a problem",
          "Contenu": "Ease of use never had a problem, always quick and professional, very easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Srinivas Melkote",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T14:27:07.000Z",
          "Titre": "A good experience",
          "Contenu": "It was easy to use this card at my doctor's office. No annoying filters. Lively also has good communication with customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Baker",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T21:02:22.000Z",
          "Titre": "HSA Made Easy",
          "Contenu": "Easy transfer of HSA over to Lively with notifications of the steps completed along the way!Also a wonderful app for mobile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2023-08-22T12:54:31.000Z",
          "Titre": "Good service, great price",
          "Contenu": "I switched to Lively because my previous service started charging a monthly fee.I’ve been happy with the service from Lively and you can’t beat the price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan St. Andrews",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T04:13:19.000Z",
          "Titre": "Strong recommendation",
          "Contenu": "Easy to use and full control of the investment options with TD Ameritrade (soon to be Schwab). Good long term option."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pierre Hulin",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T00:13:39.000Z",
          "Titre": "Easy streamlined onboarding process",
          "Contenu": "Easy streamlined onboarding process. Only provider I found to offer custodian HSA with investment account without monthly maintenance fee"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Huu Ho",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T05:41:56.000Z",
          "Titre": "Great Product, Great Support",
          "Contenu": "Low fees, great customer support. Calling in for questions is always a great time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Giovanna Cruz Pifano",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T00:46:36.000Z",
          "Titre": "The online platform is super convenient…",
          "Contenu": "The online platform is super convenient and I love the functionality that lets me track expenses and my deductible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esteban Vasquez",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T15:23:01.000Z",
          "Titre": "Easy to set up & work through the…",
          "Contenu": "Easy to set up & work through the software. Easy to scan in receipts & easy to transfer money into the account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Smith",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T04:02:21.000Z",
          "Titre": "Lively debit card & web page very…",
          "Contenu": "Lively debit card & web page are very eady to use. We have had no problems using Lively for our medical expenses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie K",
          "Nb_Reviews": 3,
          "Date": "2023-07-17T18:01:00.000Z",
          "Titre": "Ideal HSA Provider",
          "Contenu": "I've used Lively for over 5 years and it's been consistently great. Their website works well and is user-friendly. I've never had any issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kashmanchew",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T02:25:40.000Z",
          "Titre": "I’m glad to use Lively",
          "Contenu": "I’m glad to use Lively. To be able to invest the funds has been a huge help in being able to save more in my HSA. I have been very happy with the service as well. I would recommend lively to anyone who is investment savvy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Milligan",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T02:51:02.000Z",
          "Titre": "Really easy",
          "Contenu": "Really easy, even for an old guy :).  Very helpful.  Great customer service.  Especially Mariah!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hugh Aaron",
          "Nb_Reviews": 4,
          "Date": "2023-08-02T07:15:13.000Z",
          "Titre": "New HSA on Lively",
          "Contenu": "I recently set up a new HSA on Lively.  Both their technology and customer service are impressive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana Tassino",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T22:42:06.000Z",
          "Titre": "Great webpage",
          "Contenu": "Great webpage. Called 800 number twice, always got a knowledgeable human being willing to answer my concerns."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Willis",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T04:50:49.000Z",
          "Titre": "Very easy website to navigate",
          "Contenu": "Very easy website to navigate. Retired so no way to utilize HSA until Lively made it available to individuals. Great experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WT",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T04:21:44.000Z",
          "Titre": "Solid",
          "Contenu": "Does what it is supposed to do and without annoying fees."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Cofer",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T17:09:46.000Z",
          "Titre": "Transactions have always been on time…",
          "Contenu": "Transactions have always been on time and no issue with using debit card anywhere also app is super easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Price",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T03:29:48.000Z",
          "Titre": "Easy to navigate",
          "Contenu": "Easy to navigateTransfer from another provider was seamless Investment options and movement between Schwab & Lively quite easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Merriman",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T04:23:22.000Z",
          "Titre": "Easy to set aside funds for our family…",
          "Contenu": "Easy to set aside funds for our family medical expenses. Would highly recommend Lively"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yuki",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T02:57:03.000Z",
          "Titre": "Lively has a great UI and lets you…",
          "Contenu": "Lively has a great UI and lets you manage investments with schwab."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Lathem",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T01:24:51.000Z",
          "Titre": "Best HSA",
          "Contenu": "Great Customer Service.  No Fees.  Easy to add Expenses on the website.  Debit Card available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NickiT",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T03:30:50.000Z",
          "Titre": "App is very easy to use",
          "Contenu": "App is very easy to use for adding funds, loading receipts and see balances."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "W.P.",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T04:51:12.000Z",
          "Titre": "I really like the ease of operation and…",
          "Contenu": "I really like the ease of operation and and ability to invest my longer term allocations. Runs very smooth"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kai Suganuma",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T22:06:06.000Z",
          "Titre": "Clean, clear, and concise",
          "Contenu": "All the graphics were clear and easy to understand. The design is clean and the relevant information is easy to find."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CM",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T02:44:22.000Z",
          "Titre": "Excellent ease of use",
          "Contenu": "Super easy to use. After a year and a half,  I’ve had zero issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TIM",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T13:54:47.000Z",
          "Titre": "Easy to submit the claim online and…",
          "Contenu": "Easy to submit the claim online and receive direct deposit in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R Griffith",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T12:45:50.000Z",
          "Titre": "Great service",
          "Contenu": "The web site is very easy to use and they pay quickly when I submit receipts for reimbursement."
        }
      ]
    }
  ]
}